{
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_ross-wye-flooding/content_44.html": "Jesse Norman writes for the Ross Gazette.\nI looked at Leon, Leon looked at Katie and Milly, they all looked at me, and we peered once again into the drain. The water was near the top, and it wasn't moving. Not good.\nThis is not because we all belong to an obscure group of hobbyist drain inspectors. No: Katie Fowler and Milly Boylan are local councillors, and Leon Davies is one half of a legendary Ross partnership with his wife Lorraine, who owns the hairdressers at the bottom of Brookend Street. I was just there to try to give everything a bit of extra va-va-voom.\nIn the old days, Brookend Street used to flood now and then, perhaps once a year, from river water coming up from the Rudhall Brook. no one was happy about it, but the local businesses understood the problem and generally had a bit of time to prepare.\nNot recently. This year in particular there have been a series of sudden downpours which have caused flash flooding of rain water, and that water is not draining away. After the torrential downpour in May, I had helped to convene a flood recovery group bringing Welsh Water, Balfour Beatty, Herefordshire Councillors and Ross Town Councillors together.\nIt had taken many months, much longer than anyone wanted, but the pavements and road surface had been reinstated on Broad Street. They look much better, and let's hope they stand the test of time.\nBut Brookend Street was a different matter, Local businesses had been assured that the drains had been cleared of silt. But here we were again, looking at drains outside Aldi that were not doing their job, part of the pavement riding up under the water pressure, and wondering how to get them fixed.\nAnd in the meantime, everyone was concerned that there was more rain expected at the weekend and no fresh sandbags (the hessian ones, not the plastic, which degrade very quickly).\nBut I am hopeful there is good news on the horizon. A follow-up meeting last week brought all the key officers on site, identified a potential drain connection problem (no surprises there) and has scheduled a whole raft of further work to figure out what has gone wrong here and how to fix it.\nAnd as for the rain? Well, after our drain-peering session we put out an all points bulletin, and Welsh Water brilliantly obliged with sandbags the following day, a Saturday afternoon, just in time. Thank you!",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_jesse-hails-new-government-action-plan-river-wye/content_9.html": "Local MP Jesse Norman, who has led the campaign to Clean Up the River Wye for over three years, has today hailed the publication of the Government's new Action Plan for the River Wye.\nThe plan, with £35 million of new funding, sets out a wide range of measures to address phosphate pollution and other environmental impacts on the Wye.\nAnd in a crucial development, the Government has appointed well-known local resident and former Ross-on-Wye Councillor and MEP Anthea McIntyre as a new River Champion for the Wye.\nCommenting, Jesse said:\n“I have been campaigning for an Action Plan and joined-up approach to cleaning up the River Wye for over three years now, and this is a potential turning point for the river. I am especially pleased that the Action Plan recognises the brilliant efforts of volunteer groups up and down the river.\n“At the Shell Store meeting in 2022 we laid out what was needed: a properly funded single collective long-term effort bringing everyone together. And I reiterated the importance of this approach at our meeting with the previous DEFRA Secretary of State last June.\n“Now the Government has delivered on its side, with a larger package than anyone expected, which is fantastic. The challenge is now for us all -- including farmers, Welsh Water, Herefordshire Council, wildlife and environmental groups -- working with the new River Champion, to respond quickly and decisively to make it happen.”",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-calls-government-reinstate-river-wye-action-plan/content_23.html": "Jesse Norman takes the opportunity of a Westminster Hall debate on water quality in rivers, lakes and seas to call on the Government look again at the plan for the River Wye and at least preserve the £35 million of funding pledged by the previous Government to support the restoration of the river.\nJesse Norman (Hereford and South Herefordshire) (Con)\nI congratulate the hon. Lady on securing this debate on an immensely important topic, and I am grateful to you, Mr Dowd, for allowing a quick intervention from a shadow Front Bencher on a matter of great constituency interest. She will be aware that I and others have tried to fight this battle for at least four years. Will she support my request that the Government look again at the plan for the River Wye and, even if they do not adopt the detail of it, at least preserve the £35 million of funding pledged by the previous Government, or something close to it, to support the restoration of the river?\nCatherine Fookes (Monmouthshire) (Lab)\nI salute some of the work that the right hon. Gentleman has tried to do locally on the Wye in Herefordshire, even though he is an Opposition Member, but with all due respect, the River Wye action plan was roundly discounted and felt to be not worth the paper it was written on by the non-governmental organisations in the area at the time. The Government failed to consult Wales, and the plan seemed to be rushed out before the general election. When the Minister looked at it, she found that that money was not allocated and available to push out and support the Wye. I am sure she will say later that we have had a meeting with the Wye Catchment Partnership, and that we are working in partnership with the Welsh Government to push forward a plan that has been developed by the Wye Catchment Partnership. I will give some more detail about that in a moment.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_nmites-new-student-accommodation/content_8.html": "It has always been part of the long term vision for our new university project NMITE, not only that it should boost the economy of the whole county, but that it should act to regenerate Hereford itself. After all, cathedral cities across the UK have benefitted from the infusion of energy from high education; think of York or Canterbury, or most recently Lincoln, an ancient city not so much bigger than our own. Why not here?\nNMITE has grown slowly and steadily, as it seeks to create a great all round experience for its students. First, it took over its main campus site on Blackfriars Street. Then it partnered with Hereford College of Arts and the Council to build the Station Approach student block. Then it built its own fabulous new Advanced Timber and Manufacturing Technology buildings by the Shell Store at Skylon Park in Rotherwas.\nSo I was delighted to have the chance last week to visit NMITE’s new student accommodation at Eign Gate for the first time It occupies the old Woolworths building, which was then taken over by Peacock's: a substantial structure in an important but now sadly neglected part of town.\nAnd reader, I was not disappointed. The building is terrific. It has 71 student flats arranged across three floors. Each of them includes a bedroom, ensuite bathroom and mini-kitchen, but they are organised in sets with shared access to state-of-the-art kitchens, dining and living areas. And there are fully equipped accessible bedrooms and wet room bathrooms on each floor as well for students with disabilities or special needs.\nOn the first floor, there is a large communal space for use by all student residents, which will include a home, cinema, no less. And most vital of all a large laundry facility!\nAll in all, It marks another stage in the development of NMITE, as well as being a vast improvement on what I remember from my own university days many years ago. Students will benefit not only from high quality accommodation of their own, but a city centre location just a few moments from High Town and a short walk from the Old Market development.\nThe second phase of the project will focus on the huge former Peacock’s retail space on the ground floor and basement. Once that is complete, the whole space will be a new landmark in the city, which can breathe new life into ancient stones of Hereford’s medieval centre. Bravo!\n12 January 2023\nNMITE’s New Student Accommodation",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-calls-government-back-river-wye-action-plan/content_17.html": "Jesse Norman takes the opportunity of an Opposition Day debate on farming to call on the Government to ensure that the £35 million allocated for the River Wye Action Plan is retained and River Champion is reappointed.\nJesse Norman (Hereford and South Herefordshire) (Con)\nI would add one thing to what the shadow Secretary of State is brilliantly saying: this is a matter for farmers in Herefordshire as much as for those elsewhere. Ross-on-Wye, a rural town, was under water as a result of the floods. Does he share my view that the whole ecosystem ultimately feeds into the river, and into river pollution, on which he took such a lead with the action plan? Does he share my hope that the plan will be supported by the new Government, as well as by the river champion that he put in place?\nSteve Barclay (North East Cambridgeshire) (Con)\nI very much agree. My right hon. Friend alludes to one of the key questions being asked by many farmers around the River Wye: what has happened to the £35 million that was announced for farming support around the River Wye? Again, there has been so little detail from this Government, so I hope the Secretary of State is able to give some reassurance to my right hon. Friend.\nJesse Norman\nCan the Secretary of State give me some comfort that the money that was allocated for the action plan for the River Wye will be retained, even if not necessarily for the purposes that it was created for? Will he also reappoint the current champion for the river who has so far done excellent work?\nThe Secretary of State for Environment, Food and Rural Affairs (Steve Reed)\nI am grateful to the right hon. Member for his intervention and for the representations that he has made to me personally on this issue. I know that he feels passionately about it and, indeed, it is a very important issue. I am afraid that we will need to wait until the conclusion of the spending review, which is normal practice in government, but his words have been heard and his concerns recognised.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_cookies/content_56.html": "We want to make this website as easy to use and helpful as possible. This sometimes involves placing small amounts of information on your computer. These are called 'cookies'.\nThese cookies cannot be used to identify you personally and are only used to improve the service offered to users of this website.\nYou can manage or disable these small files yourself in your web browser, but some features of the website may not function as a result. To learn more about cookies visit AllAboutCookies.org.\nThe cookies we use\nThe open source platform and content management system on which this website is built uses the following cookies:\n|\nDrupal |\nSESS |\nLogs the current session, Expires 21 days from the session date. |\n|\n|\n|\nhas_js |\nLogs whether or not you have javascript enabled. Expires at end of session. |\n|\n|\n|\nDrupal.tableDrag.showWeight |\nThis cookie determines whether a numeric weight is shown when a table is dragged. Expires 1 year from the session date. |\n|\n|\nGoogle Analytics |\n_gat _ga _gid |\nThese cookies are used to collect information about how visitors use this website. We use the information to compile reports and to help us improve the website. The cookies collect information in an anonymous form, including the number of visitors to the website, where visitors have come to the site from and the pages they visited |\n|\n|\nCookie control |\nCookiecontrol |\nThis cookie is set when you accept cookies from this site. Expires 2 months from the session date. |\nThird Party cookies\nSome third-party services used on this website also use cookies. These are not controlled by us, but are controlled by the service provider:\nGoogleMaps",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-welcomes-defence-boost-slams-governments-smoke-and-mirrors/content_57.html": "As we mark the third anniversary of Russia’s invasion of Ukraine, Jesse Norman welcomes the proposed increase in defence spending, but raises concerns that the increase was overstated, details were leaked to the media prematurely, and muddled by aggregating the intelligence services budget into the defence budget, potentially hiding cuts.\nJesse Norman (Hereford and South Herefordshire) (Con)\nMr Speaker, it is my happy task to open by saying that today sees the retirement of Dawn, a stalwart of the Tea Room. I am sure that I speak for the whole House in wishing her a very happy retirement.\nOn a very different note, this week also marks the third anniversary of Russia’s invasion of Ukraine. We wish the Prime Minister every success in his meetings at the White House today. The Government have come in for some fairly punishing criticism from me at the Dispatch Box in recent months, and rightly so. They came to power loudly advertising their virtue and careful planning, but instead, as the House will know, we have seen a series of entirely avoidable resignations, blunders and mishaps. The Government have talked about growth, but their decisions have managed to reduce the Bank of England’s forecast from 2% to 0.75% growth for this year. It is little wonder when one considers the £25 billion increase in national insurance contributions and the imposition of an Employment Rights Bill with an up-front cost estimated at £5 billion, among much else.\nMost bizarre of all has been the lack of foresight in financial planning. The Chancellor talked grandly in her Mais lecture last year about “securonomics”—whatever that is—and the importance of economic security, but as many commentators have noticed, her fiscal rules and other decisions have left her very little room for manoeuvre. After all, it was obvious in the autumn that there could be tariffs on trade and, as Ministers have since acknowledged, an inevitable rise in defence spending. It is almost as though Labour never imagined, or perhaps never wanted to believe, that President Trump would be re-elected. As a result, the Government may be forced to have a mini-Budget next month and then a spending review, which has been so delayed that they will have gone a full year from their election without having any settled spending plans. Meanwhile, they prefer to import oil and gas from abroad, rather than use less expensive domestic energy supplies. Forget securonomics; this is a recipe for insecurity, as well as increasing carbon emissions.\nHowever, it is important to give credit where credit is due. I reported in December that genuine signs of reality were starting to break through in the Government’s so-called plan for change. In it, the Prime Minister said:\n“In 2010, the incoming government inherited public finances in desperate need of repair.”\nHe said that the UK needed\n“a profound cultural shift away from a declinist mentality, which has become so comfortable with failure”.\nFinally, and most notably, he said that\n“we cannot tax our way to prosperity or spend our way to better public services.”\nThe Prime Minister was right on all three counts, and he is right now to increase defence spending. It is not untrue to say that he is visibly becoming more conservative before our eyes.\nUnfortunately, the real numbers in the defence statement were in fact half what he claimed, as the Institute for Fiscal Studies quickly made clear, and I am sorry to say that the statement was insulting in other ways to this House. It appears to have been leaked to the media, who ran the headline before the Prime Minister had even stood up. Perish the thought that the statement was deliberately redacted so that MPs would be kept in the dark and could not hold the Government to account. The Prime Minister has emphasised all the planning that was involved in this decision. Even so, he was repeatedly unable to answer the simple “yes or no” question of whether funding for the Chagos Islands deal was included in the total.\nWhat is worse is that, in his statement, the Prime Minister tried to aggregate the intelligence services budget into the defence budget. That is grossly misleading, because those budgets are, and have long been, kept separate. What is worse still is that the Prime Minister’s claim that the combination of the two budgets would be 2.6% of GDP seems to imply a cut, not a rise, in the budget for the intelligence services, which currently stands at over 0.15% of GDP. This cannot be correct. Even if the Leader of the House cannot address my question now, I would be grateful if she could write to me with the details in order to answer it for the record and for the benefit of this House.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_cleaning-wye-campaign/content_7.html": "Local MP and long time River Wye campaigner Jesse Norman has given a qualified welcome to news today of the first joined-up action by governments on the river.\nPhosphate pollution in the River Wye is a very serious issue, destroying the fragile ecosystem and habitats along this gorgeous river, with huge implications for local businesses, tourism and public health.\nBuilding on the work of Councillor Elissa Swinglehurst and the Wye and Usk Foundation, I was the first to highlight this issue, in September 2020, press the agencies for a collective response, and then call for a cross border, all-catchment collective long-term action plan.\nIn June 2021, working with Bill Wiggin MP, Fay Jones MP, Mark Harper MP and David Davies MP, I called the national agencies and the local councils on both sides of the border to a special meeting devoted to this issue. In October 2021 I coordinated a letter from Wye catchment MPs to the Chief Secretary to the Treasury, calling for a specific spending package devoted to the Wye in the 2021 three year Spending Review.\nThe result — finally, lockdowns and other delays notwithstanding — was the Shell Store meeting of July 2022 and the set-up of the Wye Phosphates Working Group, whose terms of reference have now been adopted — very much with my support — by the important Phosphates Commission, established by the four local authorities.\nMinisters are not able to speak for themselves in Parliament. But as a backbencher, I highlighted the plight of the River Wye in separate Parliamentary Questions to the Prime Minister, the Deputy Prime Minister and the Secretary of State for DEFRA.\nAmong other things, I called for the proceeds of fines on water companies to be ring-fenced and devoted to a new National Rivers Recovery Fund. In November 2022 the Government accepted the ring-fencing, which is a major win.\nI have also asked the new Office of Environmental Protection to review the situation with the Wye, and expect to meet with them shortly.\nI finally, have written extensively on this issue, both in the local and national press, including via the links below.\nJesse Norman presents a Ten Minute Rule Bill that would require the Secretary of State for Environment, Food and Rural Affairs to publish and implement a plan for cleaning and improving the water quality of the River Wye.\nJesse Norman takes the opportunity of a Westminster Hall debate on water quality in rivers, lakes and seas to call on the Government look again at the plan for the River Wye and at least preserve the £35 million of funding pledged by the previous Government to support the restoration of the river.\nJesse Norman takes the opportunity of an Opposition Day debate on farming to call on the Government to ensure that the £35 million allocated for the River Wye Action Plan is retained and River Champion is reappointed.\nThe government has pledged £35m to help clean up the River Wye. The cash comes after years of campaigning and legal action taken by conservation groups, who say the pollution from agriculture is “killing the river”.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com/content_1.html": "Shadow Leader of the House of Commons, Jesse Norman MP, calls out the Government's reckless energy policy of relying on foreign oil and gas imports which is expensive with a high carbon footprint and risks the UK's energy security.\nShadow Leader of the House Jesse Norman challenges the Government on its reluctance to confront Unite over the crisis at Birmingham City Council and warns of potential implications in the Government’s ability to negotiate with its union donors as it takes greater control over running the NHS.\nSpeaking in an Adjournment debate on the Northern Ireland coroner’s ruling that SAS soldiers were unjustified in killing four IRA members in Clonoe in 1992—and his decision to refer the case to the Director of Public Prosecutions—Jesse Norman condemns the ruling as a grave injustice and a double standard that is both deeply damaging to morale and unjust to veterans.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_solutions-needed-urgently-save-true-national-treasure-river-wye-pollution/content_16.html": "Jesse Norman writes for The Express\nThe River Wye is one of the most beautiful and ecologically significant rivers in the UK.\nIt is a vital part of our landscape, our national heritage, and of the local economy of the Marches. It is the home of English tourism, the origin of the movement known as the Picturesque, and the inspiration for some of the finest poetry in the English language.\nYet in recent years the river has faced huge environmental pressures, particularly from high phosphate levels, harming water quality and aquatic life. Agricultural run-off, wastewater discharges, and changes in land management have all contributed to the problem. The rapid growth of certain farming sectors, including poultry, has brought economic benefits but also placed additional strain on the river.\nProgress in addressing these issues has been painfully slow. In 2021, I pushed for a comprehensive, joined-up plan to address pollution in the Wye. Despite much good work on the ground, the creation of a high level catchment-wide plan -- essential to manage this cross-border issue -- was impeded by political differences between the Welsh and UK governments. Meanwhile regulatory agencies struggled to enforce existing environmental protections effectively.\nFinally, we managed to secure the River Wye Action Plan last year. This at least covered the English part of the river, and allocated £35 million alongside the development of an integrated long term recovery strategy. But it was dropped by the Labour government after the election.\nSo what is to be done? Protecting and restoring the Wye will require a long-term, collaborative approach. Government, the agencies, farmers, businesses, local authorities, environmental groups and local people all have a role to play in developing a strategy that balances economic sustainability with environmental responsibility.\nSolutions must include better land management, improved water treatment, effective incentives for sustainable farming, and stronger oversight and enforcement.\nThe key clean-up measures and mitigations are well understood. What is needed is political leadership from ministers on both sides of the border, a high-level, long-term strategy, and the £35 million to make it happen.\nThe River Wye is a true national treasure. It requires, not just short-term measures, but a sustained collective effort, led by the UK and Welsh governments, to ensure that this magnificent river is fully restored to health.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_jesse-pushes-better-drainage-ross/content_27.html": "Local MP Jesse Norman has expressed his deep concern at the continuing lack of effective drainage on Brookend Street in Ross-on-Wye.\nJesse was on site again last week after renewed flooding in order to discuss potential solutions with local councillors Katie Fowler and Milly Boylan, and shopkeeper Leon Davies.\nWith the councillors' support, Jesse alerted Herefordshire Council and Welsh Water to the immediate need for more sandbags in the face of expected rain, and these were rapidly delivered by Welsh Water on Saturday.\nCommenting, Jesse said:\n“Shopkeepers on Brookend Street have got used to occasional flooding over the years when the river rises. But this repeated flooding from rainwater is something new.\n“It was plain to see that the drains were not clearing, and the pavement is already riding up at the entrance to Red Meadow Car Park.\n“It is great that the resurfacing of Broad Street has now been done, and that has made a huge difference.\n“Now we need the same focus and attention to getting the drains opened up and if necessary expanded and rebuilt in Brookend Street.”\nPhoto: Jesse inspecting flood damage with Leon Davies and Cllrs Milly Boylan and Katie Fowler",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_flash-flooding/content_25.html": "Utter devastation, I thought as I saw the impact of the flash flooding in Ross-on-Wye last week.\nIt was not just that there was such extensive damage, made worse by the combination of drain and foul water. Or that homes and premises along Broad Street had been flooded which had never experienced it before.\nIt was also that the road surface was so bad -- before the flooding even occurred.\nRoss Town councillors were rightly indignant about what had happened, and Welsh Water, Balfour Beatty and Herefordshire Council did well to put an emergency response fairly quickly in place.\nSince then, at my urging, Welsh Water have made clear they will offer a generous and inclusive compensation package. As their CEO Peter Perry wrote to me on Wednesday: \"We are very sorry for the impact and distress caused. We will do all we can to support all those affected and do right by them.\"\nI and my team will continue to work with anyone locally who needs our help to make this happen.\nBut amid all this damage there is also an opportunity here: not just to fix the damage but to give Ross a real sense of change and renewal. How could this be done?\nEveryone is feeling very knocked back in Ross at present. So why not lift parking charges on council-owned car parks for a few weeks, to give local businesses a boost?\nOn Broad Street, Welsh Water are looking to reinstate the pavements as they were, with what is to my eyes a rather ugly brown brick treatment. That is the statutory minimum. But why not have Herefordshire Council put in paving stones, as there are further up, and run them down the length of the street on both sides?\nInstead of just checking for sub-surface damage, why not then replace the whole road surface from top to bottom, making sure the drains on both sides are good for another generation or more?\nGoing a step further, why not consult with Ross Town Council and local people about options to improve the streetscape across all the main streets of Ross? And then lay out a multi-year plan of improvements which could build local pride and attract new investment?\nYes, this would not be inexpensive. But the money should be there, from the extra £102 million which we recently secured from the government. Indeed, this kind of long term investment is exactly what that money is intended for.\nNovember 9, 2024 will be a very big day for Ross: the reopening of the refurbished Market House, in the 300th Anniversary year of John Kyrle, the Man of Ross. Why not use that date to celebrate the regeneration of this gorgeous ancient market town?",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-challenges-government-over-birmingham-bin-crisis/content_12.html": "Shadow Leader of the House Jesse Norman challenges the Government on its reluctance to confront Unite over the crisis at Birmingham City Council and warns of potential implications in the Government’s ability to negotiate with its union donors as it takes greater control over running the NHS.\nJesse Norman (Hereford and South Herefordshire) (Con)\nIt is some weeks away yet, but this is the last moment I will have to wish you, Mr Speaker, and all Members of this House and staff a very happy Easter; I hope I may do so. Easter is a joyous occasion, full of families and possibly inappropriate amounts of chocolate. I will be making the shadow Leader of the House’s legendary hot cross buns—not very much of the mix actually makes it into the oven, but that is part of the joy.\nIt is lucky, however, that we have several weeks to look forward to Easter, because this week has not been one of joy. We will be debating tariffs later, and we have also had the impact of the national insurance rises, which have pushed up costs, raising inflation, making it harder than ever to hire a new employee and blocking routes into work for young people.\nMy question, however, is this: what on earth is happening in Birmingham? As the House will recall, Birmingham city council is now in the fifth week of a strike with the union Unite over bin collections. Apparently this matter concerns just a few dozen out of some 9,500 city council employees. As the House has heard, 17,000 tonnes of rubbish has piled up so far, growing by a reported 900 tonnes a week. Let us not forget that Birmingham’s bin collections were reportedly three and a half times worse than the worst of other councils even before this strike. The public health implications are now so dire that the council has declared a major incident.\nThe strike comes on top of two other recent fiascos. First, the athletes’ village in Perry Barr was built by the city council to host competitors during the Commonwealth games in 2022 but was never used, and has been sold at a reported loss to taxpayers of about £320 million. Secondly, Birmingham city council tried to install a shiny new Oracle IT system, resulting in a disaster whose costs are set to reach £216-odd million by 2026, according to a report by academics at Sheffield University.\nAs a city, Birmingham is technically bankrupt. It has been controlled by Labour for well over a decade, but my point is not about the council—it is about the Government. The Minister for Local Government let the cat out of the bag in his statement on this topic on Monday, when he said:\n“Birmingham’s waste service has been in urgent need of modernisation and transformation for many years… Practices in the waste service have been the source of one of the largest equal pay crises in modern…history, resulting in costs of over £1 billion to the residents of Birmingham. This situation simply cannot continue.”—[Official Report, 31 March 2025; Vol. 765, c. 45.]\nThe Prime Minister went further in his own remarks yesterday, saying:\n“The situation in Birmingham council is completely unacceptable”.—[Official Report, 2 April 2025; Vol. 765, c. 294.]\nHowever, neither the Minister nor the Prime Minister has yet offered any criticism at all of Unite, whose action is the cause of all this rotting refuse in the streets.\nUnite was Labour’s biggest union donor before the general election, giving £553,900 to a total of 86 MPs—although not to the Leader of the House, I am very pleased to say. Does she think there could be any relationship between the Government’s reluctance to call out Unite on the disastrous situation in Birmingham and the half a million pounds in donations their MPs have just received? Some Members of the House may see this whole situation as eerily reminiscent of the 1970s, especially Labour’s winter of discontent in 1978-79, when striking binmen caused refuse to pile up across major cities, including in Birmingham. My worry, however, is about not the past but the future. Labour consistently backed public sector union strikes when they were in opposition—a point the Prime Minister conveniently forgot to mention yesterday—but now they are in power they have thrown money at the unions hand over fist with little or no negotiated improvements. Let us not forget that Northern Rail negotiators have even said that their agreements with the union require them to use fax machines.\nThere is a very serious point here, Mr Speaker. At this moment, the Government are abolishing NHS England and taking direct control of the NHS. Does anyone seriously think that a Government who are incapable of calling out their union donors over bin collections will have any ability at all to withstand pressure from the same and other union donors on the NHS? What will that do to cost control and productivity, to public spending and inflation? I would be grateful if the Leader of the House reflected on those issues in her remarks.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_governments-must-step-mark-and-clean-our-rivers/content_47.html": "Jesse Norman writes for The Times.\nAt a time when political debate is dominated by public concern over pollution and other threats to the environment, few things are more important than the protection of our rivers and the ecosystems, livelihoods and businesses they support.\nThat is the argument I will be making today, in a debate on water quality in the House of Commons.\nThe River Wye, which flows from the middle of Wales through my constituency and on towards the Severn, is a case in point.\nThe Wye is one of the glories of our country, a priceless national asset celebrated for its beauty since the 18th century, when it inspired the first domestic tourism and the aesthetic movement known as the picturesque.\nYet the Wye is at grievous risk from phosphate pollution, which destroys river life and natural habitats. It is the victim of what a recent Commons report identified as a “chemical cocktail” of sewage, slurry and plastic in our rivers, only 14 per cent of which meet good ecological standards.\nThe problem is complex, but the path to a solution is well understood and likely to be relatively inexpensive. But bureaucratic delays and inertia have impeded the way forward.\nMuch recent public attention has focused on the effect of sewage discharges, but the much bigger issue is the leaching of phosphate and other chemicals that have built up in the soil over many years of intensive agriculture on both sides of the border.\nThis has been exacerbated by the rapid development of chicken sheds in England and Wales. Chicken litter is a particularly potent source of phosphate, and discharges upstream are naturally carried all the way down the river.\nThree agencies are crucial to the clean-up: the Environment Agency, Natural England and Natural Resources Wales. All are needed, together with Ofwat, which regulates the water companies, and with guiding support from the Welsh and UK governments.\nThe solution is evident, as I have argued for more than two years. It is for these organisations to develop a single team and a joint long-term cross-agency strategy covering the river from source to mouth. It will require testing, monitoring and enforcement. But once the team and strategy are in place, we will have the framework needed to secure the necessary funding.\nAnd it is nothing new. A very similar issue was addressed in relation to the River Tweed, which straddles the border between England and Scotland, as long ago as 1807, and the Tweed is still regulated by its own commissioners. So the precedent is there.\nIt was that pioneering environmentalist Margaret Thatcher who said in 1988, “It’s we Conservatives who are not merely friends of the Earth — we are its guardians and trustees for generations to come.\n“The core of Tory philosophy and the case for protecting the environment are the same. No generation has a freehold on this Earth. All we have is a life tenancy — with a full repairing lease. This government intends to meet the terms of that lease in full.”\nShe was right, and that obligation remains today. Now the agencies, the regulator and the Welsh and UK governments need to step up to the mark.\nJesse Norman is a former Treasury minister and MP for Hereford",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_what_people_say/content_46.html": "“Jesse Norman has worked tirelessly to support the NHS, particularly to ensure that essential acute hospital services remain available to residents of the County. He has helped to get a better deal on the Private Finance Initiative for Wye Valley NHS Trust and potentially for the wider NHS. His commitment to health services being available to all, free at the point of service and properly funded is unswerving.”\nDerek Smith, former Chief Executive, Wye Valley NHS Trust\n“Jesse Norman has evidenced his passion for Herefordshire and he has been very involved in issues which have mattered to me, in particular health and the NHS and education. He has been an excellent MP for Hereford and South Herefordshire.\n“I have thought hard and carefully about the election and I believe that Jesse has also shown that he has an independent streak and will not be told what to do. I fully support his decision to stand as a candidate and I wish him every success.”\nJoyce Thomas MBE, former mayor of Ross-on-Wye\n“Jesse is a good man and an even better MP. Throughout his time representing Hereford he has worked tirelessly for local businesses, campaigning for better broadband, organising jobs fairs and promoting independents through his Discover Hereford and Discover Ross competitions, of which I was the proud winner of Hereford’s favourite independent shop.\n“He is genuine, sincere and approachable about the welfare of all of his constituents.”\nAngela Siemieniuk, Owner, Hat Trick\n“Jesse is a very caring man, a great MP who does what he thinks is right.”\nMrs M., Roman Road\n“Over past years I cannot remember anyone else speaking out strongly to protect our Hospital and facilities precious to those with learning difficulties. We are fortunate to have in you a guardian angel of Herefordshire.”\nMrs T., Ross-on-Wye\n“I have to say that the assistance has been exceptional.”\nMr B., Hereford\n“We greatly admire the personal attention you are bringing to this very local issue - it is what one always looks for in one's constituency MP. ”\nMr and Mrs W., Ross-on-Wye\n“Thank you, thank you, for your help. Until you stepped in no one listened to me. If it wasn’t for you I’m sure I would be struggling.”\nMiss T., Redhill\n“I respect you greatly as an MP who is not afraid to speak up against issues and a person who is rapidly proving to be the best MP this constituency has had for many a long year.”\nMr H., Tupsley\n“During our last committee meeting I was asked to write to thank you for all the work you have done to help. It was felt by everyone that we should write to express our gratitude for your hard work.”\nCommunity group, Golden Valley\n“On Syria, it is great to have an MP who votes with his conscience and does not just follow the party line.”\nMr W., Llangarron\n“I want to thank you a million times for sorting the Winter Fuel Payment out so quickly – my neighbour is over the moon. This is what Herefordshire needs: an MP who works for his people.”\nMr E., Holmer\n“As talented as any Tory backbencher is ever likely to be.” Janet Daley, Sunday Telegraph, 5 August 2012\n“I want to thank you a million times for sorting it out so quickly -- [Mrs P] is over the moon and please pass our thanks onto Jesse Norman and just say to him he has won many more votes now this is what Herefordshire needs a mp who works for his people-- this is what I call service -- once again thank you so so much.”\nKE, Hereford\n“Their outriders include the brilliant Tory MP Jesse Norman, who anyone interested in the more imaginative aspects of modern Conservatism should follow closely.”\nJohn Harris, The Guardian\n“Jesse's brilliant book shows that the modern compassionate conservatism that I am leading has its roots in the deepest traditions of conservative thought.”\nRt Hon David Cameron MP\n“Down the road in Hereford, the candidate to watch is Jesse Norman. Norman is someone you need to vote for never mind what party he belongs to. I first met him when he and I carried a very large man in a wheelchair up a flight of stairs. Himself, that is, in person, not a researcher.\n“Ostensibly a Tory, he is the nearest thing Hereford is going to get to a green MP. Furthermore his dad masterminded the rebuilding of the Roundhouse in London, which is where I saw the Doors and the Jefferson Airplane in 1968. It is hard to think of a political pedigree more impeccable than that.”\nLlywelyn ap Gruffydd, Broad Sheep Magazine\n“Much the most impressive Tory candidate at the next election I've yet come across”\nAmol Rajan, The Independent\n“One of the party’s brightest”\nBryan Appleyard, Sunday Times\n“Jesse is the Clark Kent of British politics.”\nBoris Johnson, Mayor of London\n“Jesse Norman is the sort of MP who gives even a cynic like me some hope about the future of our nation’s public life. He is independent minded, understands the value of ideas, is willing – indeed eager – to subject himself to fierce cross examination and has the charming ability to mix modesty with conviction.”\nMark Littlewood, Director of Institute for Economic Affairs\nNo-one could describe Jesse as left wing, but he has not hesitated to champion the case of what could be broadly described as the \"workers\" against their former business bosses and directors. All power to Jesse, and don't blink first!\nEditorial, Hereford Journal, 17 December 2008\nIn January 2008 primary schools in Herefordshire were presented with the possibility of closures. Jesse Norman was a great support to the school. He intervened with the local council to help stop the closures and set up a website that was of great help to all concerned. Jesse brought the Shadow Secretary of State to Herefordshire and an event was organised to allow schools to discuss the situation. Jesse has continued to keep schools updated and is in regular contact.\nGill Thompson, former Head teacher of Kings Caple Primary School\nAs Chair-person of SHTUG (Sheltered Housing Tenants Umbrella Group) I sent a petition of nearly 300 signatures to Herefordshire Housing expressing our concern about the loss of the Warden service. This had fallen on deaf ears. I asked Jesse if he could help. Jesse was brilliant, understanding, and took up the challenge on our behalf. He came to many of our meetings, and highlighted our concern by getting the press involved. He also found a solicitor who agreed to act on our behalf. He was constantly in touch with me and many others during this fight to help the elderly and disabled who relied on the Warden Service. It is hard to put into words all the energy Jesse donates to every individual who seeks his help.\nShirley Baldwin, Sheltered Housing Tenants Umbrella Group\nThe Wiggin Pensioners Action Group would like to extend our thanks to Jesse Norman for his involvement over the last two years in our fight for fair treatment. His excellent advice and back up were vital to us. We are praying that Jesse will continue to help us win this battle with Special Metals Wiggin.\nRoy Harries - Chairman of the Wiggin Pensioners Action Group\nI was very pleased with all the help that rural surgeries received from Mr Jesse Norman and his colleague Rt Hon Bill Wiggin MP when the future of dispensing medicines at rural practices came under threat. Thanks to their support the proposed changes were scrapped and dispensing can continue to the benefit of rural patients.\nDr Richard Dales - Secretary of Herefordshire Local Medical Committee\nJesse is a great supporter of N-TAG. At great risk to his dignity he grew a beard for a “Shave-a-thon” which raised funds for the Charles Renton Unit at the County Hospital, Hereford. We have confidence that Jesse will always be sympathetic to the needs not only of local communities with which he is involved, but also the whole area of South Herefordshire and Hereford City. To have someone so approachable is of great benefit to us all.\nSally Hollingshead - Vice-Chair of the North Tupsley Action Group\nI would like to express my gratitude to Jesse Norman for his help and support with regard to my son's epilepsy. I tried to get Christopher seen by the Epilepsy Centre, who were willing but the Hereford Primary care trust refused to fund this. This is when I contacted Jesse to see if he could help. Jesse responded very quickly contacting the Primary Care trust and also discovering a specialist in London. We are extremely grateful to Jesse for taking a stand for us, and giving Christopher a chance of a better life ahead.\nKaren Hughes, Herefordshire resident",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-slams-government-dodging-public-concerns-and-opposition-questions/content_52.html": "Shadow Leader of the House Jesse Norman criticises the Government for failing to address significant public concerns and answer questions raised by the Opposition.\nJesse Norman (Hereford and South Herefordshire) (Con)\nMr Speaker, may I first associate myself very strongly with your kind remarks about Peter Hipkins and his service to this House?\nWe join all colleagues in celebration of International Women’s Day this Saturday. I am sure the whole House will also share my deep concern at the latest news in relation to Ukraine and will wish to send all of our best wishes to the Prime Minister and other European leaders in doing everything they can to support that country.\nIt is now three months or so since I became shadow Leader of the House, and I am sad to say that these joyous Thursday morning sessions seem to have fallen into a little bit of a rut. [Interruption.] “No, no!”, I hear you cry, Business questions are still as fresh, lively and engaging as they ever were, if not more so, but sadly I fear that is not true. It is our function on the Opposition Benches to press public concerns and raise questions about the Government indeed, as His Majesty’s loyal Opposition, it is not only our function, but our constitutional duty to do so. It is the Government’s job to respond to those questions and concerns and, in so doing, to make the case publicly for the policy choices and decisions they have made and to say whether they have an underlying strategy.\nUnfortunately, as you will have noticed, Mr Speaker, the Government are not doing that in our sessions. In fact, the Leader of the House rarely, if ever, responds to the important public questions and concerns that I raise. Instead, I am sorry to say that we get the same endlessly reheated mishmash of standard party political lines, personal jibes and irrelevant comment.\nHon. Members will recall that I first raised this issue at business questions on 5 December, when I highlighted a series of occasions on which the Leader had been unwilling to answer or even address some obvious examples of Government economic incompetence. As I pointed out:\nMany different responses were open to her. She could have said, “I agree with you.” [Official Report, 5 December 2024; Vol. 758, c. 458.]\nShe could have said, “The shadow Leader is wrong for the following reasons”, or even, “I don’t know.” If she did not want to respond at that time, she could have said, as so many other Ministers do, “I will look into it,” “I will reply to you,” or, “I will ask a colleague to investigate and respond”. We just heard the Chancellor of the Duchy of Lancaster say those things.\nIn fact, on none of those occasions did the Leader of the House bother to give any kind of proper answer at all. Instead, her approach was to change the subject and attack the previous Government, rather than to defend the record of her own Government which is, after all, the whole point of these exchanges. More troubling still is that she herself has so often called for transparency from Ministers, and that a failure to be accountable is itself a breach of the rules of this House, of the Nolan principles and of the ministerial code of conduct.\nI wish I could report that anything has changed since December. If anything, however, I am afraid that matters have got worse. A recent low point was at business questions on 13 February, when I raised five important issues relating to the Government’s approach to the rule of law, including the potential clash between domestic and international law, the level of risk that the Government sought to take and their attitude towards judicial review. I am sorry to say that the Leader of the House did not bother to respond to any of those questions: instead, we had yet another series of irrelevant political attacks.\nWe need a better way to track and monitor those evasions, so, in the spirit of openness and transparency, I propose a new approach, which we can call “Leader’s bingo”. Colleagues get a point every time the Leader of the House blames the previous Government, attacks Members of the Opposition, changes the subject or uses the words “gently remind”, “take no lectures” or similar in her response. I would not for one second suggest that colleagues shout “Bingo!” in the Chamber, but there may be other ways in which they can indicate when they have filled their card.\nThat is a light-hearted suggestion, but it has a serious purpose. I know how strongly you, Mr Speaker, feel about the importance of parliamentary accountability, transparency and the proper scrutiny of Government decisions. I ask the Leader of the House again if she will reaffirm her commitment to those values and engage properly with the questions I ask in the future.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_theres-quiet-education-revolution-hereford/content_37.html": "Jesse Norman writes for The Telegraph.\nTo level up the country, we need to level up education. That is the message of the Government’s recent announcement about cracking down on low-quality degrees and driving up opportunities for our school leavers. And it is absolutely right. In education, the idea of levelling up is pretty clear: higher-quality degrees for those who want one, greater opportunity and quality for those who want vocational training, more good degree apprenticeships for young people to learn while they are earning.\nBut alongside these established approaches is a fascinating new option: the blended academic-vocational degree, which is being pioneered by a revolutionary new university project in my constituency of Hereford: the New Model Institute for Technology and Engineering, or NMITE for short.\nIn a sector long criticised for its lack of innovation, the emergence of new models is massively welcome.\nNMITE students work through hands-on learning-by-doing in small teams, in engineering studios like their future work environments. They study 46 weeks a year, on accelerated Bachelors and Masters degree programmes, tackling a constant flow of real-world challenges, set by real companies as clients, in specific short and intense learning modules.\nThe result is that they learn academic content, technical skills and professional practice together from the start. And engineering firms are waking up to the potential. The first module client was a small business; the most recent is BAE Systems.\nAs regards students, NMITE has been designed to be as inclusive as possible. Potential applicants have to show they can do what is a very demanding degree. But because the focus is on concentrated learning through practice, NMITE does not impose the usual requirement to have a Maths A-level that deters many, especially women, from becoming engineers.\nInstead, NMITE looks for five qualities in a student: grit, curiosity, passion, creativity and collaboration. It wants students who can deal with adversity, who can learn and think independently, who have deep interests or hobbies, who can work imaginatively through problems, and who are team players. It doesn’t matter what school you went to, what your background is, or who your parents are.\nMany of these young people come from poorer and more diverse families, and NMITE seeks to give them a world-class technical education, without ignoring the “hidden curriculum” of human skills that make such a difference to future success.\nThis “whole person” approach means learning shaped not just by technology, but by economics, ethics, design, the arts, and business. There is an emphasis on self-reliance, community spirit and volunteering, which reflects the values of Hereford as a working garrison city in a rural setting. In many ways, though the technologies and applications may be cutting-edge, the basic educational philosophy is well-tested, almost old-fashioned.\nThe emphasis on skills reinforces the knowledge gained; the focus on professional practice with clients creates students who are better able to step into jobs; the practical nature of the work creates young people who want to do things, not just stand by.\nSo: is it working? Bear in mind that NMITE first opened its doors to degree students in September 2021. Even so, the early signs are encouraging. By this September, it expects to have 100 or so students. The Ucas forms of applicants show they are also applying to very good, established universities such as Birmingham, Nottingham and Cardiff.\nThat’s a good sign. Here’s another: the Quality Assurance Agency’s assessment of NMITE’s courses has been extremely positive. And only this week, NMITE announced that it has been given New Degree Awarding Powers by the Office for Students, a vital step to enable further growth.\nMost encouragingly, half the first graduating cohort of 2024 have already been offered jobs by local businesses starting at £30,000 – a great starting salary anywhere, and more than the median adult salary in Herefordshire. That means building and keeping skills locally. Not bad for an institution that is less than two years old.\nNMITE’s goal is to prove the value of its educational approach, and then work with local partners to see if it can be replicated elsewhere. There are large towns and small cities up and down the country with low skills, low productivity and sluggish economic growth, so the need is massive.\nI think of NMITE as the small modular nuclear reactor of higher education; a pocket-sized powerhouse. The idea behind it has the potential to transform local economies, and the lives of thousands, perhaps tens of thousands, of young people. That’s real levelling up in action.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_jesse-welcomes-skills-minister-hereford/content_6.html": "Local MP Jesse Norman was delighted to welcome the Government's Minister for Skills, Alex Burghart MP, to Hereford last Thursday.\nThe Minister came to Herefordshire in order to visit the county’s pioneering new higher education project, the New Model Institute for Technology and Engineering, or NMITE.\nHis visit came just a day after the Government specifically mentioned NMITE by name in its key Levelling Up White Paper, as pioneering a model with transformative potential to boost economic regeneration not just in the Marches, but across the UK.\nMinister Burghart was taken around NMITE’s main campus at Blackfriars by Prof Dave Allan, seeing the engineering studios, meeting faculty and talking throughout to students. At the end he described what he had seen as “incredibly impressive”.\nBefore entering politics, Alex Berghart MP was an academic at King's College London, where he taught mediaeval history. After his visit to NMITE, at his personal request he was kindly shown around Hereford Cathedral, the Mappa Mundi and the chained library by Glyn Morgan, Chief Executive of the Perpetual Trust, and members of the Cathedral’s expert staff.\nPhoto: NMITE CEO Elena Rodriguez-Falcon, Jesse Norman, Alex Burghart and NMITE Chief Academic Office Beverley Gibbs.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_jesse-welcomes-new-ps35million-charles-wolfson-charitable-donation-nmite/content_36.html": "Jesse Norman has given a very warm welcome to the announcement this week that the Charles Wolfson Charitable Trust has made a £3.5 million donation to NMITE, Herefordshire's pioneering new university project.\nhttps://nmite.ac.uk/news/hereford-nmite-announces-three-half-million-gift-charles-wolfson-charitable-trust\nThe gift will go to fund a new building and a wide range of internal improvements at NMITE'S main campus building at Blackfriars in Hereford. Combined with the 2022 Stronger Towns Fund award of £2.4 million, it takes the level of investment at NMITE in Blackfriars to nearly £6 million.\nJesse was closely involved in identifying and securing the donation on behalf of NMITE. Commenting, he said:\n“This is another massive vote of confidence in the new university, in the city of Hereford and in the county of Herefordshire. And it is all the stronger coming from this very highly regarded family foundation.\n“The trustees made clear that they were especially impressed by NMITE's new 'vocational university' model of combined team-based hands-on, theoretical and professional learning, and how well it prepares students for the world of work.\n“NMITE is demonstrating the capability to take local young people who might never have considered a university education, and turn them into highly employable Masters-level degree graduates in three years.\n“That is a fantastic gain in capability, and a real saving in cash, for the student and their family compared to conventional forms of higher education.”",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-criticises-chancellors-spring-statement-halved-growth-and-rising-taxes/content_54.html": "Shadow Leader of the House Jesse Norman criticises the Chancellor’s Spring Statement in which her growth forecast has been halved, she increased cuts to welfare benefits, and has a projected record-high tax burden by 2027-28 with the threat of more tax rises to come.\nJesse Norman (Hereford and South Herefordshire) (Con)\nMay I start by thanking the whole House for their wonderful messages of condolence during last week’s business questions? I could not be more grateful. I single out, in particular, the Leader of the House for her very gracious remarks.\nI turn from fathers to mothers, as this Sunday, of course, is Mother’s Day. The infant shadow Leaders of the House have been instructed—not that they needed it—on how to manage the occasion. I am sure that the whole House will want to join me in celebrating mothers at the weekend, and expressing ourselves in all kinds of ways to thank our mothers and the mothers we have among us for all the work they do.\nThis has been the week of the spring statement. The House will recall the October Budget in November of last year. It was described as a once-in-a-generation Budget, with no tax rises to follow. This week we have seen that the Chancellor’s own growth forecast just four months later has been halved, and she has increased cuts to welfare benefits. That follows the interesting strategy of abolishing NHS England, having just fired all the team running it. The tax burden is on track to hit a record high in 2027-28.\nWe should give credit where credit is due—the Chancellor has protected capital investment, which is a very important and correct decision—but there have also been wheezes. I am sorry to say that she has somewhat pulled the wool over the eyes of the Office for Budget Responsibility in relation to housing growth, which is the Government’s new “get out of jail free” card. It has never been included in an OBR estimate before, and it is very doubtful and unlikely that it will happen in any case, even at those levels—the target has already been downgraded from 1.5 million houses to 1.3 million houses—because of the planned upheaval in local government. Meanwhile, the immensely damaging Employment Rights Bill goes entirely unscored economically by the OBR. We will see what it says about that piece of legislation next time around.\nThe brutal fact is that although the Government claim to prioritise growth, growth has halved since they came into power. They have talked about little else, but even their own forecasts do not show growth getting back even to 2% by the end of the decade, and every major independent expert forecast of the economy’s future growth is lower than that of the OBR.\nWhat do we see if we look more closely? The spring statement is not really about work at all; it is about moving people from welfare into lower-paying welfare. The cut to universal credit announced last week has been followed by a freezing of universal credit—why? It is because that appears to hit the Chancellor’s own fiscal headroom number to the decimal point. Last week we heard all the rhetoric about the moral case for nudging people back into work, but now it seems that this is actually an accounting exercise, and the economic and moral justification for the policy has been lost sight of.\nThe second point is the question whether artificial intelligence, which the Government have greatly emphasised, will actually have the effect of increasing growth. The Chancellor suggested that this idea was somehow obvious and conventional wisdom, but that is very far from true. The Nobel prize-winning economist Bob Solow famously said that the effects of the IT revolution could be seen everywhere except in the economic numbers. Other countries are scaling and deploying artificial intelligence with massive speed, and many experts believe that AI could increase unemployment and inequality, and raise the costs of retraining people and reintegrating them into the workforce. Far from creating economic growth, the advent of AI could end up forcing a Government—possibly this Government—into even more spending than they presently contemplate.\nFinally, we get to the vexed and much-discussed issue of so-called fiscal headroom—or, to use a more technical phrase, the goolies-in-a-vice problem. It has been suggested that the definition of insanity is to keep doing the same thing expecting a different result. So far, we have seen minimal fiscal adjustment at the statement, and meanwhile the Chancellor has managed to recreate the same constraining conditions that existed beforehand. This is a situation entirely of the Government’s own making. It was the Chancellor’s decision to choose these fiscal rules, and it was her decision then to take measures that undermined economic growth. She has staked her own credibility and that of the Government on those decisions. The result is that we will now have endless uncertainty and avoidable speculation about the fiscal position every week, through the comprehensive spending review and into the autumn Budget.\nThe Chancellor has refused to rule out making more cuts to spending. Even so, she may have to impose tax rises, and those tax rises could come even sooner than anticipated if the US decides to go ahead with the tariff it has suggested. As such, my question is this: what will the Leader of the House feel in her own heart, and what will she say to her Cabinet colleagues over the next few weeks, as the full effects of these terribly damaging decisions become clear?",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-slams-governments-reckless-energy-policy-over-security-and-misguided/content_28.html": "Shadow Leader of the House of Commons, Jesse Norman MP, calls out the Government's reckless energy policy of relying on foreign oil and gas imports which is expensive with a high carbon footprint and risks the UK's energy security.\nJesse Norman (Hereford and South Herefordshire) (Con)\nA few weeks ago I talked about how the Prime Minister was steadily being mugged by reality, and we have seen this again in the last few days with the Government’s U-turn on the ban on sourcing photovoltaic cells built with slave labour in China. The same can be said for the Government’s energy policy as a whole. It is important to put before the House the fact that Labour’s 2024 manifesto promised to cut bills, boost energy security and create cheaper, zero-carbon electricity by 2030, accelerating to net zero by 2050. It tried to allay public concerns by promising\n“a phased and responsible transition in the North Sea that recognises…the ongoing role of oil and gas in our energy mix.”\nNine months on, we can see how that is going. The Government have already had to U-turn on their infeasible commitment to zero carbon electricity by 2030. Most recently, the situation with British Steel in Scunthorpe has underlined the deeper incoherence of their overall approach. By banning new oil and gas licences and preventing new exploration, the Government are committing the UK to greater dependency on imported oil and gas at higher cost, with higher emissions and under less democratic control. In so doing, they are not advancing environmental justice or economic resilience; they are accelerating a decline in energy sovereignty that will leave this country more polluting, less secure and, ultimately, poorer.\nIf we do not produce our own oil and gas, we will have to buy it. The difference is that it will come from overseas, and imported energy is not only more expensive but has a far higher carbon footprint. I remind the House that, for example, importing liquefied natural gas involves cooling gas to 160° below zero, shipping it thousands of miles from Qatar and regasifying it at a port in this country. The net emissions are up to four times higher than those from North sea gas. Crucially, UK territorial emissions go down, but overall emissions, including imports, are higher than they would be. This is not an honest policy.\nLabour’s manifesto talked about the importance of energy security, but refusing to allow new exploration does not reduce our vulnerability; it increases it. Energy, after all, is national security. It is industrial strategy. It is heating our houses and fuelling our cars. The idea that a major economy should voluntarily give up control of its energy supply before alternatives are well advanced is not progressive—it is reckless.\nThe problem goes somewhat wider. The Government talk about a green industrial revolution, but the more expensive imported energy we have, the harder that will be to achieve. Not just steel but chemicals, ceramics and fertilisers all require large amounts of gas and will do for years to come. If energy is unreliable or unaffordable, those industries will continue to struggle whatever the fond imaginings of the Secretary of State. Worse still, the Government’s policy will squander capital and skills that might have gone into safely managing the UK’s remaining hydrocarbon assets. The extra revenues that would have helped fund the transition will now be lost to the many other countries that welcome such investment, while the Government turn their back on a sector that still employs 200,000 people and contributes billions in tax revenue.\nI ask the Leader of the House whether she shares my view that we badly need some common sense here. We all want an effective and just energy transition, but that starts with one principle: control what we can and use our own resources responsibly and transparently while building the clean energy system of the future. Instead, the Government have chosen a path that will increase emissions, raise costs, weaken the economy and tie Britain’s future to foreign powers and volatile markets. That is not leadership; that is an abdication.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-condemns-coroners-ruling-sas-soldiers-unjust-and-demoralising/content_14.html": "Speaking in an Adjournment debate on the Northern Ireland coroner’s ruling that SAS soldiers were unjustified in killing four IRA members in Clonoe in 1992—and his decision to refer the case to the Director of Public Prosecutions—Jesse Norman condemns the ruling as a grave injustice and a double standard that is both deeply damaging to morale and unjust to veterans.\nJesse Norman (Hereford and South Herefordshire) (Con)\nMy right hon. Friend is giving an important and telling speech on a very important topic. As he rightly says, these soldiers were subject to well-defined rules of engagement. He has described the IRA as a terrorist organisation, but what he has not said is that at the time, it was the most sophisticated terrorist organisation in the world. The soldiers he talks about were operating under orders, in a chain of command and on the Queen’s business, and could not respond. Does my right hon. Friend agree that there is a grotesque double standard here, and that not only is this an injustice, but the Government’s position is potentially deeply corrosive of morale, as well as deeply unjust to the veterans?\nDavid Davis (Goole and Pocklington) (Con)\nMy right hon. Friend makes a very good point. Of course, he is the Member for Hereford, so many of the people who have retired and will face these threats will be his constituents. He and I are long-standing supporters of human rights in this country, and have both defended article 2, for example, but this case is a misuse of article 2. The people who wrote the European convention on human rights were recently out of the second world war—they did not write it to be interpreted in this way. He has made a double point.\nReturning to my right hon. Friend’s point about the IRA, since the events in question, the Good Friday agreement has allowed for the release of convicted terrorists in order to achieve an end to the bloodshed. I guess we all agree with that, yet we continue to persecute those who fought against the terrorists. These persecutions are conducted decades after the fact, without any new evidence being presented to give reason for the reopening of cases. After the action, everybody involved was questioned thoroughly to establish the facts—what the intelligence was, what the arrest plans were, and what happened. On the basis of that questioning, on 15 October 1992—with the evidence close to hand and the events fresh in the witnesses’ minds, and when investigation of everything was possible—the police and the Director of Public Prosecutions for Northern Ireland concluded that there should be no prosecution of the soldiers. There was no case to answer.\nJesse Norman\nCould the Secretary of State not simply say now to the House that he has a deep understanding and awareness of the trauma that has been caused, and that he takes the side—not judicially, but politically, in his own mind as a matter of human sympathy—with the poor people affected by these decisions and how they are playing out in the public realm? Could he not say that now, so that veterans and their families understand that a Government Minister in a senior position gets it and is on their side in his own mind, even if not judicially?\nThe Secretary of State for Northern Ireland (Hilary Benn)\nI expressed that view to the veterans I met this afternoon, when I thanked them for their service in the most difficult and dangerous circumstances. The right hon. Member invites me to do that this evening, and I readily do it, because they were seeking to protect the citizens of the United Kingdom, including of Northern Ireland, in the face of terrorism and terrorists.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_new-tory-leader-must-rebuild-our-party-ground/content_55.html": "First published in The Telegraph.\nWho should be the next leader of the Conservative Party? Every MP will have their own take, of course. But for me it comes down to two key issues: the task and the person.\nNo one can be in any doubt about the magnitude of the task. Personally I doubt whether a government led by Jeremy Corbyn and Diane Abbott would have performed better over the past five years than the government we have actually had.\nBut all this is now moot. Whatever the true merits of the case, whatever one thinks about the difficulties of dealing with the long-term impact of the global financial crisis of 2007-8, Brexit, the Covid pandemic, the global spike in energy prices or the war in Ukraine, the national mood on July 4 was “Anyone but the Tories”.\nThe Conservative Party needs to get the message, and show the country that it gets the message. There has been a lot of talk about the need to bring the party together, and that is important. But far more important is the need to undertake a thorough process of moral, intellectual and organisational reconstruction.\nThe root issue is not one of political presentation, it is one of values and legitimacy, of earning once again a measure of trust and belief that the Conservative Party is serious, competent and oriented towards the public good, among a vast swathe of the people of this country, including millions of young people who may never have considered voting Conservative.\nThat will take time, and it will involve hard choices, especially as regards fiscal matters. His Majesty’s loyal opposition cannot leave the field, but equally it cannot pretend that nothing has happened, seek to bounce back immediately and shirk the task of building a new Conservative Party on solid foundations, from the ground up.\nThe Labour government has a huge majority. But the financial facts of life did not change on July 5, and the new government is already struggling to square the opacity of its mandate with the expectations it has raised, the demands of the unions and the internal contradictions of a top-down yet somehow decentralising administration.\nAll this demands scrutiny and creates political opportunity. But this will be as nothing if the Conservative Party cannot earn itself a hearing.\nIn seeking to do so, the party needs to rediscover its commitment to public service. Ever since ancient times, it has been thought that human beings are unique among animals in having the power – however sparingly exercised these days – to govern themselves.\nPolitics is the messy, compromised and yet vital means by which they seek to do so. It is an activity, not a project, the necessary basis for the very possibility of human society. It can be done better or worse, and the fates of peoples and nations can hang on the difference. But, despite the fond imaginings of the Westminster village, politics has little or no intrinsic merit in itself.\nWhat matters is public service. That is the goal. Putting public service front and centre means a lot less ego, and a lot more thought to the well-being of others, especially future generations. This has always been the spirit of conservatism at its best, and the Conservative Party needs to rediscover that spirit.\nThat is the task facing the next leader. What about the person? It goes without saying that, young or old, a Conservative leader should have a record of commitment to open markets, individual responsibility, financial prudence and limited state intervention, together with a deep interest in history and policy.\nAs leader of the opposition, the new party leader will need to be adaptable and resilient, able to bring others together both inside and from outside politics, to draw on the biggest talents and put them to work.\nThey will need to balance independence of mind with a willingness to take advice. And they will need to be a highly effective communicator, with a distinctive voice and a zest and cut-through that can energise people of all political parties and of none.\nBut I would go further. A really good leader does not simply articulate but embodies the change they are seeking to make. The media tends to focus on social divisions, but these conceal the deep strengths of our society. The United Kingdom is more vibrantly diverse in its culture and identity now than ever before. Recognising that strength in diversity, and acknowledging its limits, will be a formidable task.\nThe same is true of facing the twin challenges of Keir Starmer at the dispatch box, and Nigel Farage at the bully pulpit. And in my judgement the right person to take these challenges on, to draw the best from the past but galvanise fresh energies and set a new direction, is Kemi Badenoch.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-addresses-uk-youth-parliament/content_58.html": "Shadow Leader of the House of Commons Jesse Norman speaks to members of the UK Youth Parliament.\nJesse Norman\nWell, thank you very much indeed. Mr. Speaker, and what a delight it is to see this fantastic assembled Youth Parliament here today. My name is Jesse Norman. I rejoice, if that's the right word in the title of Shadow Leader of the House. The acronym is sloth. I have to say, it doesn't feel very slothful when I'm running around doing the Speaker's bidding and, the service of the House most of the time.\nBut, that's part of the joy of my job. And I don't want to give you a political speech of any kind. I just want to talk about three things that might be of interest to you as youth parliamentarians. So the first, the acronym I want you to take away is House of Commons H O C.\nAnd the first one I want to start with is H for history. When you come into this building, you are entering a building that has been deliberately modelled after the Gothic period in our history. Of course, it was only 150, only a little more than 150 years, old. It's a bit of a con. It's the truth of the matter.\nBut it's designed to carry a majesty and an authority and a historical weight to it that reflects the quality and the importance of this institution of Parliament and Parliament itself, let me remind you, is an institution that goes back to the 13th century, and we can date it in various ways, with De Montfort’s Parliament did attempt to bring in people, and have them in, largely for reasons of raising tax, consent and agree to the process of politics as a way of securing public consent.\nAbsolutely essential component. And even indeed the elements that make up good government go well beyond that. I mean, we can date back to Anglo-Saxon times the idea when a reigning monarch should receive counsel and advice from people around him or her. That's a real, and it was of course her later on, very much so, and very emphatically so.\nSo that process of historical development is something that I hope that as youth parliamentarians, you will take away from today and think about and meditate on and learn about as you go about your own lives. That's the H in HOC. The O is oratory. This is a fantastic moment for you, ladies and gentlemen, to practice your oratorical skills in front of no lesser figure than our magnificent Speaker, Sir Lindsay Hoyle.\nAnd if any of you do become Speaker, you will be following a glorious reign that our current incumbent has had. And of course, you will have to be waiting quite a long time before he will consent to give up the post, because, he's enjoying it and giving so much to it. But I hope you will, as youth parliamentarians, think about what you can learn about how you consent.\nAnd there are many of my colleagues, dare I say, in Parliament, who don't do that. I don't mean Ministers from the Dispatch Box who often have to read what they say. I mean people from the backbenches who often you see them in PMQs reading the little questions. Absolutely not. What we want is people who can speak extempore from the Dispatch Box or from the backbenches and enliven and engage each other in debates.\nAnd I know you're going to do that today and I congratulate you for it and thank you for it. And the final point is C. C for careers. Now many of you as the, as the Speaker said, may be future cabinet ministers or members of parliament or even, dare I say, possibly Prime Ministers. I hope you won't be those things until you've done something outside politics, because what you bring to politics is what really distinguishes an effective parliamentarian.\nSo go out when you finish your studies, go out, learn, fail, run teams, make money, lose money, give yourself in volunteer work, do whatever is necessary to have a really rich and fulfilling and rewarding life. And then when you do that, you will have something incredibly special and powerful to bring back to your constituents. So when you make your careers, make them in politics, but make them having had careers elsewhere, politics, bringing an extra piece of public service to what you've already achieved.\nThat's HOC House of Commons ladies and gentlemen, I thank you so much for having me. Let me say one thing. It's famously been said that politics is showbusiness for ugly people. When I look at the energy and the joy and the driving, the vigor around this chamber today, I didn't see any ugly people. But I do see some potentially very formidable politicians.\nThank you very much indeed.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_bbc-highlights-review-river-wye-action-plan-and-ps35-million-financial-support/content_19.html": "12 April 2024\nBBC highlights review River Wye Action Plan and £35 million financial support\nThe government has pledged £35m to help clean up the River Wye. The cash comes after years of campaigning and legal action taken by conservation groups, who say the pollution from agriculture is “killing the river”.\nMoney will be given to farmers to encourage them to stop soil getting into the water, and to take the waste from chicken farms out of the river catchment.\nThe latest plan was announced on Friday by Jesse Norman, the Conservative MP for Hereford and South Herefordshire.\n“This is a potential turning point for the river,”\nhe said.\n“The challenge is now for us all, including farmers, Welsh Water, Herefordshire Council, wildlife and environmental groups... to respond quickly and decisively to make it happen.”\nRead in full on BBC News",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_shell-store-conference-frames-new-5-year-cross-border-plan-save-river-wye/content_51.html": "A new cross-border working group of agencies, local authorities and other key parties has come together to frame the first five-year integrated plan to cut pollution in the River Wye.\nThe group is the initiative of local MP Jesse Norman, who convened a meeting of the key players last Thursday in the Shell Store at the Skylon Park Enterprise Zone.\nAlso present were Sir Bill Wiggin MP, senior representatives from the Environment Agency, Natural England, Natural Resources Wales, OFWAT, Welsh Water, the Nutrient Management Board and the three local authorities of Herefordshire, Powys and Monmouthshire.\nFay Jones MP was unable to attend, but was represented at the conference\nCommenting, Jesse Norman said\n“Some very good work has been done to cut pollution in the Wye over the years, but I think this is the first time the agencies and local authorities across the border have all come together at a senior level with Welsh Water, in order to manage the problem in an integrated way.\n“It is very early days in this initiative, but there were a lot of ideas under discussion at the conference, a real sense of urgency and a desire to work together.\n“The key now is for the group to pull together a properly integrated five-year plan that builds on, extends and accelerates existing work. I have made clear that once this is in place I will press the case at the highest levels of government for greater funding and support from the centre, on both the English and Welsh sides.\n“This is a long-term problem, but the response needs to be as rapid and effective as we can all collectively make it.\n“It starts with the agencies and with local and national governments, but it needs to embrace and support the amazing work of our citizen volunteers up and down the river if we are going to make the maximum impact.”",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_user_register/content_34.html": "Skip to main content\nMain navigation\nHome\nAbout\nIn Parliament\nNews\nArticles\nContact\nSearch\nCleaning Up the Wye\nNMITE\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout\nIn Parliament\nNews\nArticles\nContact\nSearch\nCleaning Up the Wye\nNMITE\nPrimary tabs\nLog in\nCreate new account\nReset your password\nEmail address\nUsername\nPicture\nUpload\nYour virtual face or picture.\nUpload requirements\nOne file only.\n16 MB limit.\nAllowed types:\npng, gif, jpg, jpeg\n.\nCAPTCHA\nMath question\n3 + 1 =\nSolve this simple math problem and enter the result. E.g. for 1+3, enter 4.\nThis question is for testing whether or not you are a human visitor and to prevent automated spam submissions.\nCreate new account",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_record/content_22.html": "My Record\nJesse has always believed very strongly that Members of Parliament, like others in public office, should hold themselves publicly accountable and campaign not on promises but on their record.\nFor more on Jesse’s record as a constituency MP since 2010, click below:",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_action-plan-river-wye/content_50.html": "Jesse Norman writes for the Hereford Times and the Ross Gazette.\nApril 19 marked Primrose Day, a celebration of the great reforming Prime Minister, Benjamin Disraeli.\nIn similar spirit, I hope that readers will have shared my delight at the recent news of the Government's new £35 million Action Plan for the River Wye.\nBut the truth is that the real work begins now. After three and a half years of pretty relentless campaigning, endless conversations with ministers and officials, a huge public outcry and considerable delay while the details were worked through at DEFRA, I can tell you that this Action Plan comes not a moment too soon.\nIt is not perfect, of course, and local people will have many good ideas for improvements. But the Action Plan establishes a vital direction of travel, and at £35 million the funding envelope provided is significantly greater than even I had dared to hope for.\nEspecially encouraging is the appointment of Anthea McIntyre as the new River Champion. She is a former MEP and Ross-on-Wye Councillor and a person of great integrity and experience. She lives very close to the river and is well known and widely trusted. And she has already made clear her intention to meet with interested parties along the full length of the river, and to engage with agencies, local authorities and other bodies on the Welsh side of the border as well as the English.\nIt will be for her to set priorities, of course. But I would not be surprised if they included three key elements: The first is much more dialogue and communication, between farmers and environmentalists, businesses and concerned local people, agencies and public authorities on both sides of the border. This is a collective long-term problem, which can only be solved by collective means.\nThe second is a strengthened understanding of what is going on locally within the UK and Welsh governments and statutory agencies. To take a case in point, we have a real need for high quality new housing in Herefordshire, and yet the application of environmental regulation makes this impossible in some areas. Serious consideration should be given to a more proportional approach, especially for smaller schemes which support villages and local communities.\nThe third is the careful trialing of new technologies. The Government's new Action Plan creates the opportunity for Herefordshire to become a national, perhaps even a global, leader in the treatment and management of excess phosphate. Let's see if we can take that opportunity and clean up the river at the same time.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_phosphate-pollution-river-wye/content_32.html": "30 June 2021\nPhosphate Pollution in the River Wye\nJesse Norman calls out agencies’ “inadequate” response to tackling phosphate pollution in the River Wye.\nMr Norman said that whilst staff from the agencies had helpfully supported the Wye Phosphates Working Group accepted the pollution in the Wye was a “pressing issue”, he felt that more needs to be done.\nIn a letter to agency chiefs he said that responses were “seriously inadequate”, and there needed to be a lead agency to tackle the problems.\nHe said:\n“It is not acceptable for your organisations, as the three public bodies charged by law with preservation of the environment and our natural resources across England and Wales, not to take a leadership role and to abdicate responsibility for this very serious issue”.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_parliament/content_33.html": "Shadow Leader of the House of Commons, Jesse Norman MP, calls out the Government's reckless energy policy of relying on foreign oil and gas imports which is expensive with a high carbon footprint and risks the UK's energy security.\nShadow Leader of the House Jesse Norman challenges the Government on its reluctance to confront Unite over the crisis at Birmingham City Council and warns of potential implications in the Government’s ability to negotiate with its union donors as it takes greater control over running the NHS.\nSpeaking in an Adjournment debate on the Northern Ireland coroner’s ruling that SAS soldiers were unjustified in killing four IRA members in Clonoe in 1992—and his decision to refer the case to the Director of Public Prosecutions—Jesse Norman condemns the ruling as a grave injustice and a double standard that is both deeply damaging to morale and unjust to veterans.\nShadow Leader of the House Jesse Norman criticises the Chancellor’s Spring Statement in which her growth forecast has been halved, she increased cuts to welfare benefits, and has a projected record-high tax burden by 2027-28 with the threat of more tax rises to come.\nAs we mark the third anniversary of Russia’s invasion of Ukraine, Jesse Norman welcomes the proposed increase in defence spending, but raises concerns that the increase was overstated, details were leaked to the media prematurely, and muddled by aggregating the intelligence services budget into the defence budget, potentially hiding cuts.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_nmite/content_2.html": "This week we have seen scandalous revelations, in The Sunday Times, of fraudulent loan activity at rogue colleges offering courses franchised from established universities.\nJesse first campaigned to establish a university in Herefordshire in 2007, and is one of the founders of the county's pioneering new university project, the New Model Institute for Technology and Engineering, or NMITE. Jesse has helped raise over £25 million to get NMITE launched.\nNMITE has three objectives:\n-- to give fantastic education opportunities to young people in Herefordshire and the Marches, and beyond;\n-- to give a massive boost to the economic base of the county, supporting local businesses, building skills and attracting in new talent; and\n-- to create a new kind of small, high-quality, low-cost teaching university that can be adopted to boost other parts of the UK in turn.\nNMITE is already having a transformational effect. Its corporate partners now include BAE Systems, JCB, National Grid, the Environment Agency.\nNMITE students are already getting excellent, well-paid jobs in engineering, whether after the 2 year, 2 month accelerated BEng course, or the 3 year accelerated MEng course. And it only opened its doors in September 2021!\nJesse Norman writes for The Telegraph.\nTo level up the country, we need to level up education. That is the message of the Government’s recent announcement about cracking down on low-quality degrees and driving up opportunities for our school leavers.\nLocal MP Jesse Norman has warmly welcomed news today that the government's Office for Students (OfS) has granted new degree awarding powers to NMITE, Herefordshire's pioneering new university project.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_jesse_profiles/content_41.html": "Profiles\nInterview with Jesse Norman MP: “I don’t really believe in making political promises.”\nBy Andrew Gimson in ConservativeHome\nPolitics is “a noble calling”, and so is conservatism. Few politicians are much good at explaining why they believe what they believe, but Jesse Norman delights in making boldly unfashionable declarations of this kind, and producing the arguments to back them up.\nJesse Norman, the Government's worst nightmare - an intellectual conscience\nBy Sarah Sands of the Evening Standard\nThe former government adviser Jesse Norman is perplexed by his sacking last week after abstaining over the vote on intervention in Syria. “I seem to have acquired this reputation as the Che Guevara of the Conservative Party,” he says gloomily.\nContinue reading \"Jesse Norman, the Government's worst nightmare - an intellectual conscience\" »\nJesse Norman, Tory Rising Star, On Boris, Burke And His Row With Cameron\nBy Mehdi Hasan of Huffington Post\nTo call Jesse Norman “clever” would be an understatement. The Conservative MP for Hereford and South Herfordshire has a classics degree from Oxford, a PhD in philosophy from University College London and is the author of several highbrow books, including ‘Compassionate Conservatism’ and ‘The Big Society’. His pre-parliamentary career included stints as a director of Barclays Bank and executive director of the right-wing thinktank Policy Exchange. He is, in the words of GQ, “the preeminent intellectual theorist of Cameronism”.\nContinue reading \"Jesse Norman, Tory Rising Star, On Boris, Burke And His Row With Cameron\" »\n“Tories must not forget there is more to life than money”\nJesse Norman, David Cameron’s new policy adviser, insists it won’t be all Old Etonian mates at No 10, he tells Rachel Sylvester and Alice Thomson of The Times\nJesse Norman plays the trumpet in the parliamentary jazz band and his hero is Louis Armstrong, although he says “don’t ask me to choose between him and Bob Dylan”. The other trumpeter in the group is Lord Glasman, Ed Miliband’s “blue Labour” guru — “so it’s blue-on-blue blues,” the Tory MP says.\nContinue reading \"Tories must not forget there is more to life than money\" »\nJesse Norman: Impeccably conservative\nDespite having led a backbench rebellion against Lords reform, Jesse Norman is one of the last defenders of Cameron’s “big society”. What’s more, he tells Rafael Behr, its influence is growing. NewStatesman\nThere’s a great scene in The African Queen, the 1951 film about a colonial military escapade in the First World War: Rose Sayer, a Methodist missionary, disposes of the stash of gin belonging to Charlie Allnutt, a drunken Canadian boat captain. “A man takes a drop too much once in a while,” he complains. “It’s only human nature.” Sayer responds: “Nature, Mr Allnutt, is what we are put in this world to rise above.”\nContinue reading \"Jesse Norman: Impeccably conservative\" »\nInterview with Jesse Norman\nJesse Norman speaks to Jane Merrick of the Independent on Sunday about Westminster, the battle of ideas and the joys of jazz.\nJesse Norman has been talking for nearly an hour before I notice the pale green, slightly tatty, cotton wristband on his right hand. It's the fashion among the more socially aware MPs to wear a charity band. This threadbare strap, Norman says, was given to him by a Dusun tribesman in Borneo last year. The man, whose grandparents were headhunters, spotted the MP's own wristband and asked him to swap, and Norman obliged. \"So there's a Borneo tribesman wandering around the jungle with a Help for Heroes wristband on his arm,\" he says, amused.\nContinue reading \"Interview with Jesse Norman\" »\nJesse Norman: Captain Sensible proves a major adversary for Cameron\nby Nicholas Watt and Juliette Jowit in The Guardian.\nAs one of the most erudite MPs at Westminster, Jesse Norman naturally turned to Charles James Fox to describe his own predicament yesterday.\nHours after David Cameron remonstrated with him outside the commons division lobbies, after Norman led the biggest Tory rebellion of the parliament, the backbencher quoted the 18th-century Whig statesman.\nContinue reading \"Jesse Norman: Captain Sensible proves a major adversary for Cameron\" »\nJesse Norman looks firmly towards a bright future, for both county and country\nby Tom Kennedy in the Hereford Times\nJesse Norman certainly has a clear image of what he wants for the future of Hereford. The Tory politician is highly respected within the party, and considered as a true pioneer of compassionate conservatism. It is his fresh thinking approach the Tories will need to embrace in order to gain the necessary support to succeed in next year’s general election.\nContinue reading \"Jesse Norman looks firmly towards a bright future, for both county and country\" »",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-speaks-parliamentary-debate-governments-strategic-priorities-ofwat/content_29.html": "Jesse Norman intervenes in a backbench debate on the strategic priorities for Ofwat to highlight the problem of pollution in the River Wye and the need for a cross-border or all-rivers strategy to tackle phosphate pollution.\nJesse Norman (Hereford and South Herefordshire) (Con)\nI thought the Environmental Audit Committee’s report was a model of its kind. I noted in particular that it created this context of identifying a “chemical cocktail” of sewage, slurry and plastic. Does my right hon. Friend feel that the Government’s response adequately addressed that issue—both on the sewage side and on the wider phosphates issue?\nPhilip Dunne\nMy right hon. Friend tempts me to rewrite my speech from scratch. First, I thank him for his comments about our report, which was a significant body of work and the first such report of consequence for a number of years. The Government response to our 55 recommendations was one of the most positive responses to any of the reports that our Committee has prepared in the time I have served on it. We made 55 recommendations and I believe only five were rejected by the Government; the others were either accepted in whole or in part. So I think the Government have moved quite a long way in addressing these concerns, but my right hon. Friend will recognise that solving this problem is going to take decades, not days. I know that the Minister will address that in her remarks.\nJesse Norman\nSewage discharges, at least in the River Wye, on which my right hon. Friend’s report brilliantly focused, are only 25% of the problem. Phosphate leaching from fields is more like 65%. Does he feel that the Government have set an adequately ambitious target in saying that 80% of this phosphate should be reduced by 2037? I wonder whether we should go faster than that.\nPhilip Dunne\nMy right hon. Friend is right to refer to other polluters. If we take a look across the country as a whole, we will see that it is roughly evenly balanced between pollution from water treatment plants and storm overflows and pollution from agriculture. In the Wye, pollution is particularly prone to come from agriculture. As he knows, I am one of his parliamentary neighbours and our waterways along the whole of the Wye and the Lugg catchment are very affected by intensive poultry farming and the phosphates that it generates through spreading litter on the fields.\nJesse Norman\nDoes the hon. Lady share my view that one of the things the Government should closely consider is the idea of a national rivers recovery fund so that fines that have been paid can be used to remedy all of the pollution that has created them? At the moment, small fines go back into redress for pollution, but large ones go to the Treasury. My former colleagues will not thank me for it, but there is a case for a wider national recovery fund for rivers.\nDaisy Cooper\nI thank the right hon. Member for his intervention, and I think that is an exceptionally good idea. I am certainly open to any idea that effectively makes these water companies cough up to clean up the mess they have made. I would happily have a conversation with him to see how we can advance such a suggestion.\nJesse Norman\nMy hon. Friend is so familiar with Herefordshire and the angling there that he needs no encouragement from me, but may I remind him that part of the problem with the Wye is that it crosses the border so there is an impunity in that Wales can avoid having regulatory involvement and leave the muck to come down to Herefordshire? Does my hon. Friend agree that an all-river strategy with some commissioners, as there have been since the 18th century on the Tweed, might be a solution to the problem?\nSir Charles Walker\nMy right hon. Friend demonstrates huge knowledge because the Tweed does indeed have commissioners and that works. The Tweed has its own problems but they are not on the same scale as those of the Wye and our right hon. Friend the Secretary of State for Wales is currently talking to the Angling Trust and will be working with the Welsh Government to try to find a way forward.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_conservatives-cannot-win-their-heads-sand/content_26.html": "Jesse Norman writes for The Telegraph.\nTo say that the 2024 general election was a disaster for the Conservative Party tests the art of political euphemism to its limits. The result has been to create a wasteland on the centre-Right of British politics.\nStories will be told of the efficiency of the Labour vote, the reemergence of the Liberal Democrats, and the rise of Reform UK. But the deeper truth is that the Conservative Party lost because it had forgotten what real conservatism is.\nLacking that shared understanding and commitment, it was unable to offer a coherent account of what it had done and why, or any serious argument for its own legitimacy or continuation in government.\nAll else flowed from that. Little wonder it was destroyed.\nAfter all, it should not need saying that a real conservative is conservative in temperament: modest, not arrogant; public-spirited, not self-obsessed; frugal, not extravagant; long term in focus, not preoccupied with the evanescent; respectful of others, not offensive about them; pragmatic, not reckless, cautious in making commitments, not given to empty promises; sceptical of grand claims and easy solutions, not embracing of them.\nThis ought to be a truism. But it could scarcely offer a greater contrast with the recent examples of Conservative governance, which often demanded the pen of a Swift to do it justice.\nIt is easy to be wise after the event. But take some of the specific decisions of the past 14 years.\nFirst come the referendums on the Alternative Vote, on Scottish Independence and on Brexit, which cast a complex issue or set of issues into a supposedly simple one-off choice in a yes/no format, and which proved to be intensely – and progressively more – divisive.\nOr take many less high-profile decisions as well. These include the escalation of UK intervention in Libya, the vote to bomb Syria, the Bill to create an elected Lords, the planning of HS2, the Fixed Term Parliaments Act, the spikes in public spending in 2017 and 2019, the second and third Covid lockdowns, and the spike in legal immigration after 2022. Very little of this had to do with the real values of conservatism.\nWhat is to be done? The road to recovery will take time. Policymaking can come later. What matters is authenticity: of values, tone and temperament expressed in action.\nFirst, Conservatives should take the British Constitution with the seriousness it deserves.\nThat means setting their face against referendums, supporting sensible reforms of parliament, curbing the creeping presidentialism of the office of Prime Minister or Leader, and reinforcing the authority of the (Shadow) Cabinet.\nSecondly, against the tide of modern politics, Conservatives should make a point of treating the general public like grown-ups.\nThat means avoiding bandwagons, offering explanations rather than slogans, acknowledging mistakes, and seeking to dial down public emotions, not inflame them.\nAnd finally, the Conservative Party should rededicate itself to public service, and to being a sane and effective political organisation.\nIt could, for example, set two tests for potential parliamentary candidates: demonstrate that you were a real conservative, and that you made a meaningful commitment to public service, before you sought public office. If either answer is “no”, the candidate should be gently encouraged to apply again in future.\nThis may seem frivolous, but it is not. Now more than ever, the Conservative Party needs to be serious: in the way it treats the British Constitution and the public, in addressing the deep challenges we face, and in how it conducts itself.\nThat begins with people who know what real conservatism is, and who are personally committed to it.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_news/content_10.html": "This week we have seen scandalous revelations, in The Sunday Times, of fraudulent loan activity at rogue colleges offering courses franchised from established universities.\nNews\nConservatives cannot win with their heads in the sand\n28 October 2024\nJesse Norman writes for The Telegraph.\nTo say that the 2024 general election was a disaster for the Conservative Party tests the art of political euphemism to its limits. The result has been to create a wasteland on the centre-Right of British politics.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_contact/content_30.html": "For Constituency Casework\nIf you need Jesse's assistance with any matter, please enter your postcode in the box above and select 'Jesse Norman' on the following page. Alternatively, you can call the office on 01432 276422. If Jesse is not your MP, you will be able to contact your own MP from that page.\nPlease ensure you include your full address and a contact telephone number, even if you have contacted Jesse before. We will not be able to offer you assistance until this has been provided. This is due to strict parliamentary protocol that states MPs may only act on behalf of their own constituents.\nYou can also write to Jesse Norman MP, Suite 2A, Penn House, Broad Street, Hereford HR4 9AP.\nThe constituency office is open Monday to Friday, 9am to 5pm.\nProtecting Your Data\nMy office will not use your personal data in any way that goes beyond your reasonable expectations in contacting me. Please see my Privacy Notice.\nInvitations, Press Enquiries and other questions\nPlease e-mail jesse.norman.mp@parliament.uk, call Jesse's Westminster office on 0207 219 7084, or write to Jesse Norman MP, House of Commons, London SW1A 0AA.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_specialist-colleges-can-save-university-system/content_40.html": "Jesse Norman writes for The Times\nThis week we have seen scandalous revelations, in The Sunday Times, of fraudulent loan activity at rogue colleges offering courses franchised from established universities. The rewards are obvious: the supposed student drops out with the cash from a £4,000 maintenance loan which they never repay, while the college and the lead university split the tuition fees for which the supposed student has borrowed.\nThe franchised sector is large, with 341 colleges franchising courses from 110 universities. Some 50,000 students were enrolled in 2018 on franchised courses; there were 138,000 in 2023. Little wonder the regulators and the Treasury are so concerned.\nBut we must not miss the wider picture. The UK’s university system is structurally compromised by over-expansion, which has prioritised growth over financial sustainability. This has reduced the quality of many degrees, undermined the wellbeing of many students and driven some universities to use new financial strategies to generate cash.\nOne strategy has been the sale of valuable inner-city land for development. Another has been the relentless focus in recent years on recruiting foreign students, who typically pay twice the domestic student fees. As immigration controls and international competition for students have increased, these revenues have plummeted, leaving many universities exposed.\nFranchising is the latest symptom of this underlying condition. What is required is a deep rethink. The sector has focused on increases to student fees, which seem highly unlikely in the present context. A better approach might be to look at reducing costs and boosting diversity and innovation.\nNMITE, the New Model Institute for Technology and Engineering in Hereford, is one of a small handful of new providers that aim to do just these things. NMITE focuses on teaching and learning, without the research costs of a traditional university. Its students work 35 hours a week, 46 weeks a year, in teams and on projects set by industrial and other partners. Their engineering courses are accelerated, taking three years to masters level, not four.\nThe result is that at a time when many students struggle to get jobs, NMITE’s graduates are being snapped up by engineering leaders including Balfour Beatty, BAE and AWE. But we also need to look at the deep purposes of education itself. NMITE’s goal is to create a transformational, not a marginal gain both in learning and capability: to take British youngsters who would never have considered going to university and help them become not just critical thinkers, but thinking doers. That seems a worthy ambition.\nJesse Norman MP is the chair of NMITE",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_user_password/content_45.html": "Skip to main content\nMain navigation\nHome\nAbout\nIn Parliament\nNews\nArticles\nContact\nSearch\nCleaning Up the Wye\nNMITE\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout\nIn Parliament\nNews\nArticles\nContact\nSearch\nCleaning Up the Wye\nNMITE\nPrimary tabs\nLog in\nCreate new account\nReset your password\nUsername or email address\nPassword reset instructions will be sent to your registered email address.\nCAPTCHA\nMath question\n4 + 13 =\nSolve this simple math problem and enter the result. E.g. for 1+3, enter 4.\nThis question is for testing whether or not you are a human visitor and to prevent automated spam submissions.\nSubmit",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_jobs-pledge/content_43.html": "Sixteen years ago, in the spring of 2007, I was a newly selected parliamentary candidate to stand as MP for Hereford and South Herefordshire. It still feels like yesterday.\nOf course there was a lot of campaigning to do, and an election to be won. But I also wanted to set out a positive vision for change in Herefordshire, and that meant thinking hard about the fundamentals.\nWhy were wages so low, overall? Why was there very little unemployment, but quite a lot of underemployment? And what could we do to arrest these trends and regenerate the local economy?\nI came to two key conclusions. The first was that the county needed a lot more public investment in order to kickstart growth. It had plenty of great small and medium-sized businesses, but its rural location and small and sparse population meant that it was structurally short of private capital. In this context, additional public investment could make a huge difference.\nThe second was that we needed to find some way to build up skills locally, and then keep them in the county. We had fantastic colleges and the superb Herefordshire Group Training, but we needed to create more pathways for local young people to develop their capabilities and use them locally in existing companies or as entrepreneurs in their own new businesses, rather than losing them to Bristol or Birmingham or London.\nNow, sixteen years later, we have made huge progress on both of these ambitions;. Our recent £20 million Levelling Up Fund win takes the total public investment in which I have been involved since 2010 to over £120 million, by my calculation.\nAnd we now have NMITE, our own university project — and the first exciting signs that it will be able to deliver on its mandate. Its initial cohort of 30 students will graduate in September 2024 with a Masters degree in Engineering — the first students ever to have been educated to that level in the history of Herefordshire.\nAnd what is more exciting still: NMITE have already secured conditional job offers for over half of them, from a fantastic group of local tech and engineering businesses. That’s 15 job offers, subject only to a final interview, on a pay scale that starts at £30,000.\nWhich are these pioneering companies? Step forward, in alphabetical order, ABT Products, ETL Systems, Kirintec, REHAU, TRP Sealing Systems and Welsh Water.\nThis is not philanthropy, but hard business sense.\nThey know NMITE and its focus on advanced practical skills, they have met the staff and students, and they can see the value of recruiting really talented young people locally.\nSo, if you’re a local business with similar goals, why not get involved with NMITE and see what they are doing for yourself? And if you’re between the ages of 18 and 30 and want a great local education and a great job, NMITE may be the place for you.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_phosphate-pollution-threat-river-wye/content_49.html": "Gazette readers will need no reminding that the River Wye is one of the great glories of Herefordshire and the Marches. Rising from the slopes of Plynlimon in mid-Wales, it winds its way through to Hay-on-Wye and Hereford and on to Ross, before heading down to Symonds Yat, Monmouth, Tintern and the Severn estuary.\nThe Wye Valley is renowned for its beauty. It is a Special Area of Conservation, with two Sites of Special Scientific Interest. It was admired in Roman times and celebrated by Wordsworth. Wye salmon remains known the world over, and the river supports a vast array of leisure activities; not just fishing, but canoeing and of course the superb rowing clubs we have in Hereford and Ross.\nYet readers will also know that the Wye is under serious threat from phosphates pollution. Algal bloom has robbed the water of oxygen and caused huge damage to the river’s ecosystem of plants, invertebrates and micro-organisms. It is killing the ranunculus that gives the river such character and supports many of its species. A petition to protect the Wye has attracted 70,000 signatures, underlining the huge strength of public feeling.\nHistorically, much of the problem has been caused by the run-off of phosphates from chicken litter. But farmers in Herefordshire have made huge efforts to reduce their impact on the river’s ecology. Yet these downstream improvements will mean nothing if pollution is flowing from the Upper Wye in Powys.\nSimon Evans, the Chief Executive of the Wye and Usk Foundation, says: “The ecological deterioration of the Welsh Wye continues. Both Powys County Council and Natural Resources Wales have a legal responsibility to protect Special Areas of Conservation like the Wye, but apparently have been unwilling to use the existing laws to protect the river.\"\nI have been working over several months now with Herefordshire Council, Cllr Elissa Swinglehurst who chairs the Nutrient Management Board, and fellow MPs to address this issue. The Wye falls under the jurisdiction of the Environment Agency in England and of Natural Resources Wales, and I am grateful to the Environment Agency for their willingness to engage and assist.\nHowever, we are waiting for more information from Natural Resources Wales and Powys County Council about the precise impact of phosphates from Powys. We need thorough, reliable data, a commitment to a consistent monitoring programme, and an action plan to address this very serious problem. Soon.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_jesse-hails-massive-breakthrough-herefordshires-new-university-project-grant-new-degree/content_13.html": "Local MP Jesse Norman has warmly welcomed news today that the government's Office for Students (OfS) has granted new degree awarding powers to NMITE, Herefordshire's pioneering new university project.\nThe new powers will allow NMITE to award its own accelerated Bachelors and Masters degrees in Integrated Engineering, as well as new non-accelerated degrees, foundation courses and a pioneering new BSc in the Sustainable Built Environment from September of this year.\nCommenting, Jesse said:\n\"This is a milestone in our county's history. Thanks to NMITE, for the first time in more than 1,000 years, students coming here from near and far will be able to graduate with a Herefordshire university degree.\n\"But this is also a milestone for NMITE itself. It shows the amazing progress which it has made since it opened its doors to degree students just two years ago. And it underlines the quality of its education and the confidence which the Office for Students as regulator has in it.\n\"Slowly but surely, we are building a new model of economic regeneration and development, a model of higher skills, better jobs and greater prosperity. This is one crucial further stage in that process.\"",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_mps-call-spending-review-tackle-phosphate-pollution-river-wye/content_24.html": "Jesse Norman, together with other local MPs, has written a joint letter to the Chief Secretary to the Treasury calling for a three-year integrated spending package in the forthcoming Spending Review specifically focused on cleaning up the River Wye.\nThe MPs believe this could be funded from recent fines handed out to water companies for unpermitted pollution discharges.\nRt Hon Simon Clarke MP\nChief Secretary to the Treasury\nHM Treasury\nThe Correspondence & Enquiry unit\n1 Horse Guards Road\nLondon\nSW1A 2HQ\n30th September 2021\nDear Chief Secretary\nSPENDING REVIEW BID: TACKLING PHOSPHATE POLLUTION IN THE RIVER WYE\nWe are writing as MPs for Herefordshire, Brecon and Radnorshire, and the Forest of Dean. Together with our colleague David Davies, the MP for Monmouth, who shares our concern, we cover the length of the River Wye.\nAs you will be aware, there is a very serious issue of phosphate pollution in the Wye, which is having grievous environmental consequences for marine and plantlife in the river, threatening the wider ecosystem, undermining tourism and recreation, and leading to the imposition of bans on building and other development which are damaging the local economy.\nOver the past eighteen months we have formed the Wye Phosphates Working Group. Its purpose has been to focus attention on the issue and bring the key agencies, Natural Resources Wales, the Environment Agency and Natural England, and the Nutrient Management Board, local councils, the water companies and other stakeholders together.\nWhat we need is a clearly designated, coordinated and responsible cross-border and crossagency taskforce with accountable individual leadership tasked with tackling phosphate pollution in the River Wye, according to an agreed and properly funded strategy. Unfortunately, it is now quite clear that this is not going to happen without real leadership and support from HM Government, in conjunction with the Welsh Government.\nGood progress has been made by DEFRA and MHCLG (now DLUHC) ministers, but we need to give more priority and urgency to this work. The need for urgency was specifically recognised by the Deputy Prime Minister in recent Oral Questions, when he said \"the Government understand, and my right hon. Friend champions eloquently, the importance of the River Wye. We will do everything we can to support him with preserving it for future generations.\"\nWe are therefore making a request, and a recommendation.\nThe request is that you agree a three-year integrated spending package with DEFRA and DLUHC in the forthcoming Spending Review, specifically focused on cleaning up the Wye. The outline cost of this is likely to be in the range £10-£15M, but it should be scaled to the need. Please regard this as a formal spending bid.\nAn effective long term approach will require considerable amounts of water- and soil-testing and enforcement, among other things, and these in particular will inevitably bear a cost. But that cost is extremely small compared to the critical current impacts, let alone a potential fullscale crisis. If these issues are not addressed it is also quite possible, some would say likely, that the wider Wye Valley catchment area will be subject to further restrictions on economic development, which would seriously affect human wellbeing, local economic growth and levelling up.\nMoreover, as you will know, Southern Water was recently sentenced to pay a recordbreaking £90m fine after pleading guilty in court to nearly 7,000 unpermitted pollution discharges. This investigation was the biggest that the Environment Agency has ever conducted. Earlier this year, Thames Water was also fined £4 million and £2.3 million for separate pollution incidents. In addition to these fines, four water companies still require improvements, and no single company achieved all the environmental expectations set out for 2015–2020.\nSo, our recommendation is that you consider using some of these fines to fund the clean-up of at-risk rivers, and in particular the Wye. This would be a highly appropriate use of the funds received, and it would send a wider signal that polluters should and will be made to pay for damage to the environment.\nFinally, we would be grateful for the opportunity to meet with you to discuss these concerns as soon as Parliament reconvenes.\nWith all good wishes,\nJesse Norman MP\nBill Wiggin MP\nFay Jones MP\nMark Harper MP",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_government-action-river-wye-just-first-step-says-jesse/content_21.html": "Local MP and long time River Wye campaigner Jesse Norman has given a qualified welcome to news today of the first joined-up action by governments on the river.\nThe UK and Welsh governments have announced a joint new £1M fund for research into the causes of pollution in the Wye.\nCommenting, Jesse said:\n“It’s good news that the UK and Welsh governments are finally getting together to work on cleaning up the River Wye, as I have campaigned for since 2020.\n“But the £1M they have announced won't go far. And it's a far cry from the £35M allocated by the last government.\n“So this is just the first step. We will need to see a genuine, effective and fully funded plan of action under way before anyone can start to feel that this vital local and national issue is being properly addressed.”\nhttps://www.gov.uk/government/news/uk-and-welsh-government-unite-in-1m-fund-to-transform-river-wye",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_about-jesse/content_5.html": "The Rt Hon Jesse Norman has been the Member of Parliament for Hereford and South Herefordshire since 2010. He has been married to Kate since 1992, and they have three children.\nWide experience\nJesse was educated at Merton College, Oxford University, and has a Masters and PhD from University College London. He worked for and later ran an educational project giving away medical and other textbooks in Eastern Europe from 1988-1991. In 1991 he went to work at Barclays, mainly on eastern Europe and other emerging markets. He left Barclays in 1997 as a Director in order to teach and do research in philosophy at UCL, and later at Birkbeck College. He was an Honorary Fellow at UCL in 2005-10, and a Visiting Fellow at All Soul's College, Oxford in 2016-17.\nA lifelong volunteer, Jesse has personally raised more than half a million pounds for charity. He has also been a school governor of an inner city comprehensive and worked for nearly a decade with the Roundhouse arts centre and urban regeneration project, which has helped many thousands of disadvantaged young people. He has been a board member of the Hay Festival of Literature and the Arts, and patron of many other local charities.\nJesse has been a Conservative since university. He worked to help Oliver Letwin MP retain his seat in West Dorset during the 2005 General Election, and stood as a Conservative candidate in the 2006 Council elections. He has acted as a policy adviser to George Osborne MP, the Shadow Chancellor, and to the Shadow Work and Pensions team. In 2007, he took time out to advise Boris Johnson on his successful campaign to become Mayor of London.\nHe served as Financial Secretary to the Treasury from May 2019 to September 2021 and as such was responsible for tax policy and HM Revenue & Customs, and for the National Infrastructure Strategy, National Infrastructure Commission and Infrastructure Projects Authority. He was very closely involved in the Government's response to the coronavirus pandemic.\nLocal campaigner\nJesse was selected as a parliamentary candidate in December 2006 in an open primary contest. Since then he has campaigned actively on key local issues, fighting to improve public services and for a stronger voice for Herefordshire in Whitehall and Westminster. His campaigns are regularly featured in the Hereford Times, Hereford Journal and Ross Gazette.\nAmongst other things, he led a successful campaign to improve local broadband services, was county-wide co-ordinator of the Herefordshire Save Our Post Offices campaign, and set up SchoolsFirst.org.uk as a resource to help all those fighting school closures. He was closely involved in securing Government investment in the Enterprise Zone at Rotherwas, and more recently the successful bid by Hereford for Stronger Towns Fund.\nJesse first called for a university in Herefordshire in 2008. He convened the founder team, and has been closely involved with the project ever since, playing an integral role in raising over £23 million in Government and other investment in NMITE, the New Model in Technology and Engineering, as the new university is called.\n“Jesse Norman has worked tirelessly to support the NHS, particularly to ensure that essential acute hospital services remain available to residents of the County.”\nHigh public profile\nJesse is a published author of many books and pamphlets, and has written widely in the national press. His book on the life and thought of the great Irish philosopher-statesman Edmund Burke was shortlisted for the Orwell Prize and the Political Book Awards. His book on Adam Smith won the Parliamentary Book Award for non-fiction in 2018.\nHe has also written for The Times, Sunday Times, Financial Times, Guardian and Spectator, and has appeared on TV on BBC 1, BBC News 24 and Sky News; and on radio on Start The Week, Any Questions?, The Westminster Hour and Analysis. He has also been the subject of profiles in Varsity, BBC Online, Herefordshire Life and GQ.\n“Jesse Norman has worked tirelessly to support the NHS, particularly to ensure that essential acute hospital services remain available to residents of the County. He has helped to get a better deal on the Private Finance Initiative for Wye Valley NHS Trust and potentially for the wider NHS. His commitment to health services being available to all, free at the point of service and properly funded is unswerving.”\nDerek Smith, former Chief Executive, Wye Valley NHS Trust\n“Jesse Norman has evidenced his passion for Herefordshire and he has been very involved in issues which have mattered to me, in particular health and the NHS and education. He has been an excellent MP for Hereford and South Herefordshire.\n“I have thought hard and carefully about the election and I believe that Jesse has also shown that he has an independent streak and will not be told what to do. I fully support his decision to stand as a candidate and I wish him every success.”\nJoyce Thomas MBE, former mayor of Ross-on-Wye\nInterview with Jesse Norman MP: “I don’t really believe in making political promises.”\nBy Andrew Gimson in ConservativeHome\nPolitics is “a noble calling”, and so is conservatism. Few politicians are much good at explaining why they believe what they believe, but Jesse Norman delights in making boldly unfashionable declarations of this kind, and producing the arguments to back them up.\nJesse Norman, the Government's worst nightmare - an intellectual conscience\nBy Sarah Sands of the Evening Standard\nThe former government adviser Jesse Norman is perplexed by his sacking last week after abstaining over the vote on intervention in Syria. “I seem to have acquired this reputation as the Che Guevara of the Conservative Party,” he says gloomily.\nContinue reading \"Jesse Norman, the Government's worst nightmare - an intellectual conscience\" »",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_jesse-celebrates-cma-debt-advice-and-family-support-south-wye/content_18.html": "30 September 2024\nJesse celebrates CMA debt advice and family support in South Wye\nLocal MP Jesse Norman has expressed his strong support for two great initiatives in South Wye, the new CMA debt advice service and the community food parcels provided to needy families.\nSpeaking on a visit to Putson Baptist Church, Jesse said:\n“These are both fantastic local community initiatives, aimed at helping people to get out of debt, and feeding more than sixty local families with good, nutritious food.\n“I warmly congratulate Revd Andy Goode and the whole team at the Baptist Church in Putson for their energy and spirit in making them happen.”",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_nmite-0/content_31.html": "Our new local university project, NMITE, continues to go from strength to strength.\nReaders will recall that the September student intake almost doubled in size over the previous year, with 55 students, many of them from Herefordshire. The latest feedback Is that they are thriving, very much fired up by the combination of high academic standards, a real life working environment, working in teams, lots of access to faculty and a changing mix of challenges and opportunities to learn.\nNow NMITE have announced a further groundbreaking local initiative: 30 new Lifechanger Bursaries of up to £10,000, available to successful student applicants who have lived or studied in Herefordshire for the past two years.\nThe bursaries represent a phenomenal investment in the long-term future of Herefordshire. These young people will have the opportunity to receive a superb education right on their doorsteps, and while many of them may decide to work in large national international companies, many will undoubtedly decide to stay in the county once they have graduated, either working for local businesses or setting up as entrepreneurs in their own right.\nThat's a huge win-win.\nEven more than new infrastructure, local economic development is geared to a long-term improvement in the skills of local people; so these bursaries will also have a major effect in supporting local businesses, building skills across the county, and offering incredible individual opportunities to the young people energetic enough and passionate enough to qualify for them.\nFurther details are on the NMITE website, www.nmite.ac.uk; the key point is that they are available on a first come first served basis, with a long stop date in June 2024.\nBut these bursaries do not simply represent an investment in the county, but in the whole region. After all, you can still qualify for them if you have been studying in Herefordshire, but come from adjoining counties in England and Wales, as many students do. I was very excited to highlight this point when I spoke at the recent launch of the Marches Forward Partnership, a new grouping of the four local authorities of Herefordshire, Shropshire, Powys and Monmouthshire.\nThe new Partnership will embrace a range of areas including transport, tourism, economic development and the environment, the River Wye and other important local issues. But these new NMITE Lifechanger Bursaries add another dimension , higher education, which further underlines the scope for future cooperation. Bravo!\nFirst published in the Hereford Times and Ross Gazette",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-pays-tribute-his-father-torquil-norman-pilot-innovator-and-social/content_38.html": "Jesse Norman reflects on the life and values of his father, Torquil Norman, creator of Polly Pocket toys and founder of the Roundhouse in Chalk Farm who passed away yesterday.\nJesse Norman (Hereford and South Herefordshire) (Con)\nThank you very much indeed, Madam Deputy Speaker. I hope that you and the House will excuse me if I start on a very personal note.\nAlmost exactly 24 hours ago, my father, Torquil Norman, died at the age of 91. He was an extraordinary man. He flew Seafires and Sea Furies during his national service in the Fleet Air Arm. He created Polly Pocket, a toy that has brought unbelievable joy to many young people around the House and around the world. He rebuilt the Roundhouse in Chalk Farm in London, not just as an incredible performing arts centre, but as a creative centre for young people from whatever background to be able to find their way into jobs.\nThe reason I mention that now is that my father stood for values that bear a wider consideration in this House and in our own lives—values of positivity and creativity. He always said that the secret to success in the toy business was to have a mental age of seven and an eye for detail. He had incredible energy but also amazing resilience and focus on the long term. “Turn up at the finishing line” was one of his maxims. Even in his 80s, he was building and creating a new enterprise to develop flat-pack trucks, if you can imagine such a thing, Madam Deputy Speaker, that could be sold to countries around the world at low cost, supporting businesses and people.\nI think the whole House would agree with me that we need these values today. At a time of difficulty, stagnation and international conflict, we need these values of creativity, ambition, drive, respect for others and, above all, capability—a focus not just on the head, but on the hand and the heart as well. That is something I feel very strongly about. We are trying to build a new specialist technical engineering college in Hereford, precisely to bring those different aspects of the human personality together in the service of better jobs and better possibilities.\nI also think that it encourages us all, as a House and as a Parliament, to ask the right questions and to support long-term solutions, even when those questions and solutions may not be ones that we are ideologically or politically drawn to. We are in a world where welfare costs are rising higher than anyone could have wanted; civil service effectiveness is perhaps not as great as we would like; productivity in the NHS is not what we would all want, for whatever reasons that may be, over a very long period; and we need a rapid boost to our defence and security. Those are crucial questions that we, as a House, will need to continue to develop and discuss over the next few years.\nI want to ask the Leader of the House whether we and other Members of the Modernisation Committee cannot expand our thinking about those long-term issues and try to push for more scope for co-operation between the parties on them, more consultation and debate on key legislation before it is brought to the House, and more ways to develop closer personal engagement between Members, so that we can build respect and co-operation across the House for the longer term. One of my father’s maxims—you will have discovered that he had many—was, “The secret to success is to take a large bite and then chew it.” I think that we could perhaps do that more as a House and as a country.\nHansard",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_mtcnmite-joint-venture/content_3.html": "Last year I had the opportunity to visit the remarkable Manufacturing Technology Centre in Coventry. The MTC is a huge, state-of-the-art set of facilities dedicated to showcasing the very best of today's manufacturing technologies.\nMTC is supported by the Government, and by dozens of the best global technology and engineering companies, from ABB and Bosch to Makita, Meggitt and Renishaw to Rolls-Royce and Siemens. It gives them a unique opportunity to demonstrate innovative processes and technologies, and develop them in partnership.\nAs I walked around, I had the chance to see some extraordinary machines. I manipulated the latest generation of robotic hands, used to work remotely with dangerous materials. I saw the way MTC was able to combine different laser-related technologies from countries as distant as Switzerland, Brazil and Japan. I watched some of the biggest and best 3-D additive manufacturing machines available anywhere in the world at work.\nSo you can imagine my feelings of delight last week when MTC and our own new university project NMITE announced a new joint venture, to be based at NMITE's superb Centre for Automated Manufacturing at Skylon Park in Rotherwas. The Centre's mission is to support the growth of a modern, productive, sustainable and competitive regional manufacturing industry across the Marches, helping local companies to scale up, automate and re-skill in an affordable way.\nMTC@NMITE, as it is known, will feature a range of advanced manufacturing technologies and machines on the Skylon Park campus, with three key goals. First, it will train students at NMITE, so that the students have hands-on access to the latest in manufacturing equipment and techniques, building their skills and expertise.\nSecondly, MTC@NMITE will offer training to local manufactured engineering and tech businesses seeking to upgrade their skills. And finally, it will also work with local businesses in transferring and adopting knowledge to boost their own manufacturing productivity and sustainability, in Herefordshire and across the West Midlands and the South-West.\nShowcasing MTC's technology, giving NMITE students cutting-edge skills, boosting local tech and engineering businesses, putting Herefordshire on the national map... coming on top of the news that half of NMITE's 2024 graduates have already received conditional job offers at great local companies, this marks another terrific step forward.\nSo: if you're a young person wanting a great tech and engineering education, or a company wanting skilled expertise on new technologies, why not check out https://www.the-mtc.org, or email MTC@NMITE via information@nmite.ac.uk?\nFirst published in the Hereford Times.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_user_login/content_4.html": "Skip to main content\nMain navigation\nHome\nAbout\nIn Parliament\nNews\nArticles\nContact\nSearch\nCleaning Up the Wye\nNMITE\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout\nIn Parliament\nNews\nArticles\nContact\nSearch\nCleaning Up the Wye\nNMITE\nPrimary tabs\nLog in\nCreate new account\nReset your password\nUsername\nPassword\nCAPTCHA\nMath question\n4 + 1 =\nSolve this simple math problem and enter the result. E.g. for 1+3, enter 4.\nThis question is for testing whether or not you are a human visitor and to prevent automated spam submissions.\nLog in",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-challenges-government-rural-policies/content_59.html": "Jesse Norman challenges the Leader of the House of Commons on the Government’s approach to rural areas and the countryside and invites her to visit Herefordshire to see for herself the effect of its punitive policies.\nJesse Norman (Hereford and South Herefordshire) (Con)\nI am sure the whole House will want to join me in recognising and thanking the salvage and nature recovery specialists who are even now scrambling to clear up after the disastrous collision in the North sea.\nThey say a conservative is a socialist who has been mugged by reality. If that is so, we are witnessing the extraordinary sight of a Prime Minister who is being visibly mugged by reality in slow motion before our very eyes. The Government’s brand of socialism started well from their point of view, if disastrously for the country: we had the union pay-offs, the rapid settlement of pay disputes in the public sector—for zero apparent efficiency benefits—and a heavily tax-and-spend Budget. The Chancellor was even so bold, as Members will recall, as to announce to the CBI that she would not be raising taxes or increasing debt over the course of the Government. As she said:\n“I’m clear…I’m not coming back with more borrowing or more taxes”.\nHowever, the Budget started to unravel almost as soon as it was published. We had the bizarre sight of a Government who were ever more committed to talking about growth while clubbing growth to death across a variety of sectors: through the national insurance rise and the £5 billion burden of the Employment Rights Bill, of course, but also through their loss of credibility in the markets, which has pushed up gilt yields by 25% since September. Great British Energy was announced, and did nothing. The Government made an unsuccessful attempt to claim credit for the achievements of the newly rebranded National Wealth Fund, which had been set up only weeks before. The system of infrastructure monitoring and planning has been dismantled, and there has been no news for three months on the decision on small modular reactors, which was due on 1 December or thereabouts. Can the Leader of the House update the House on when we can expect that decision?\nThen President Trump got elected, despite—or perhaps because of—the special SWAT team of Labour activists sent over to campaign for his rival, and then the mugging by reality really began. The Energy Secretary was forced to pare back his ruinously expensive zero-carbon energy plans; the Prime Minister had to announce his plan for change; the Government were forced to accelerate their defence spending plans in order to address the situation in Ukraine; and so it continues.\nThis week, we have heard of the Government’s so-called Operation Chainsaw—or should that be butter knife?—to reshape the civil service. Next week, we will have hasty and almost certainly ill thought through cuts to welfare. Labour was red under the right hon. Member for Islington North (Jeremy Corbyn), became a gentle cerise for voters at the general election and, now that reality is setting in, it is a pleasing shade of purple, with more and more patches of blue. The Prime Minister and the Government are becoming more Conservative by the day.\nIn sharp contrast, it is the Government’s policy towards rural areas that is most striking. We have seen the family farm tax and the disproportionate effect on hospices and social care services in rural areas arising from the rise in national insurance. Now, in the same week, we have seen new compulsory purchase powers to seize farmland and the abrupt and unexpected end of the sustainable farming incentives scheme. The Government are simultaneously reducing farm incomes, threatening farm holdings and forcing the sale of family farms through their inheritance tax changes. I am sad to say that even the £35 million allocated by the previous Government to clean up the River Wye—one of the natural glories of this country—has been cut to just £1 million. The Labour message is clear: do not be a farmer. Do not feed the country. Do not give us food security. Do not work every hour God sends, whatever the weather—we do not care.\nThe Leader of the House has been very clear that it is her policy not to answer Opposition questions, or even to answer questions about her policy of not answering questions. She ignored my questions yet again last week, but perhaps she can have a go at these questions now. Why have the Government taken such a punitive approach to the countryside? Are they doing so deliberately, or is it just by accident? Finally, will she come to visit some farmers in Herefordshire with me so that she can see the actual effect of these policies for herself? We will throw in some magnificent Shepherds or Rowlestone ice cream, as well, if that will make any difference.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_jesse-norman-mp-addresses-uk-youth-parliament/content_11.html": "Local MP Jesse Norman was a guest speaker at the opening of the United Kingdom Youth Parliament 2025 last week.\nIn his speech, Jesse stressed three themes based on the House of Commons, HOC:\n-- History: the importance of understanding the past, and the lessons of human experience;\n-- Oratory: the importance of effective public speaking to engage with others in dialogue and debate.\n-- Career: the importance of having politicians who have had substantial and varied careers outside politics before they stand for office.\nCommenting, Jesse said:\n\"The Youth Parliament was extremely lively and energetic. But I hope its members will take away with them the importance of coming to politics only when you have built a career elsewhere, with all the life experience that goes with that. Far too many MPs today are nothing more than professional politicians with little knowledge or understanding of the wider world.\"\nJesse Norman\nWell, thank you very much indeed. Mr. Speaker, and what a delight it is to see this fantastic assembled Youth Parliament here today. My name is Jesse Norman. I rejoice, if that's the right word in the title of Shadow Leader of the House. The acronym is sloth. I have to say, it doesn't feel very slothful when I'm running around doing the Speaker's bidding and, the service of the House most of the time.\nBut, that's part of the joy of my job. And I don't want to give you a political speech of any kind. I just want to talk about three things that might be of interest to you as youth parliamentarians. So the first, the acronym I want you to take away is House of Commons H O C.\nAnd the first one I want to start with is H for history. When you come into this building, you are entering a building that has been deliberately modelled after the Gothic period in our history. Of course, it was only 150, only a little more than 150 years, old. It's a bit of a con. It's the truth of the matter.\nBut it's designed to carry a majesty and an authority and a historical weight to it that reflects the quality and the importance of this institution of Parliament and Parliament itself, let me remind you, is an institution that goes back to the 13th century, and we can date it in various ways, with De Montfort’s Parliament did attempt to bring in people, and have them in, largely for reasons of raising tax, consent and agree to the process of politics as a way of securing public consent.\nAbsolutely essential component. And even indeed the elements that make up good government go well beyond that. I mean, we can date back to Anglo-Saxon times the idea when a reigning monarch should receive counsel and advice from people around him or her. That's a real, and it was of course her later on, very much so, and very emphatically so.\nSo that process of historical development is something that I hope that as youth parliamentarians, you will take away from today and think about and meditate on and learn about as you go about your own lives. That's the H in HOC. The O is oratory. This is a fantastic moment for you, ladies and gentlemen, to practice your oratorical skills in front of no lesser figure than our magnificent Speaker, Sir Lindsay Hoyle.\nAnd if any of you do become Speaker, you will be following a glorious reign that our current incumbent has had. And of course, you will have to be waiting quite a long time before he will consent to give up the post, because, he's enjoying it and giving so much to it. But I hope you will, as youth parliamentarians, think about what you can learn about how you consent.\nAnd there are many of my colleagues, dare I say, in Parliament, who don't do that. I don't mean Ministers from the Dispatch Box who often have to read what they say. I mean people from the backbenches who often you see them in PMQs reading the little questions. Absolutely not. What we want is people who can speak extempore from the Dispatch Box or from the backbenches and enliven and engage each other in debates.\nAnd I know you're going to do that today and I congratulate you for it and thank you for it. And the final point is C. C for careers. Now many of you as the, as the Speaker said, may be future cabinet ministers or members of parliament or even, dare I say, possibly Prime Ministers. I hope you won't be those things until you've done something outside politics, because what you bring to politics is what really distinguishes an effective parliamentarian.\nSo go out when you finish your studies, go out, learn, fail, run teams, make money, lose money, give yourself in volunteer work, do whatever is necessary to have a really rich and fulfilling and rewarding life. And then when you do that, you will have something incredibly special and powerful to bring back to your constituents. So when you make your careers, make them in politics, but make them having had careers elsewhere, politics, bringing an extra piece of public service to what you've already achieved.\nThat's HOC House of Commons ladies and gentlemen, I thank you so much for having me. Let me say one thing. It's famously been said that politics is showbusiness for ugly people. When I look at the energy and the joy and the driving, the vigor around this chamber today, I didn't see any ugly people. But I do see some potentially very formidable politicians.\nThank you very much indeed.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-calls-cross-border-action-tackle-threat-phosphate-pollution-river-wye/content_15.html": "Jesse Norman raises the threat of phosphate pollution of the River Wye and calls for cross-border action to tackle the issue for the betterment of the Wye and the whole catchment area.\nJesse Norman (Hereford and South Herefordshire) (Con)\nAs my right hon. Friend knows, the River Wye is a priceless national asset, threatened by phosphate pollution. He also knows that the Wye is unusual because it crosses the border between Wales and England and the majority of its phosphate does not come from sewage companies, and therefore it will not be as affected as other rivers by the thoroughly laudable measures that my right hon. Friend has taken. Will he make a note to his successor, if there is one, and to his officials now in the Box, that the next administration of DEFRA, if there is one, should take the matter up with great energy and authority, and press the cross-border issue, for the betterment of the Wye, the whole catchment and this country as a whole?\nGeorge Eustice (The Secretary of State for Environment, Food and Rural Affairs)\nMy right hon. Friend raises an important point, in that there are sometimes cross-border issues. While we are taking leading action in England, we obviously also need other devolved Administrations, including in Wales, to play their part to address the challenge, particularly in catchments such as the Wye. I am aware of the point that he makes on phosphates. We are consulting at the moment on reducing nutrient pollution—both nitrogen and phosphates—from both agriculture and sewage treatment works, and I am sure that when the results are published they will give the impetus that he requires and requests for agriculture to be tackled.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_privacy/content_53.html": "Privacy and Cookies\nThis privacy notice relates to the personal data processed by the Office of Jesse Norman, Member of Parliament for Hereford and South Herefordshire, in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is Jesse Norman, Member of Parliament for Hereford and South Herefordshire.\nWhat does the office do?\nThe office discharges the duties and functions of an elected Member of Parliament. As part of this work, we conduct constituency casework and respond to policy queries, for which we must process personal data of our constituents. We also manage a small, non-political mailing list for the purpose of sending Jesse’s newsletter and information about upcoming advice surgeries.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent.\nWe are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted Jesse about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you such as local authorities, government agencies, public bodies, health trusts, regulators and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures.\nWe will not share the personal information of members of Jesse’s mailing list or those in receipt of our newsletters.\nIn any case, we will not use your data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Unless specifically requested by you, we feel it is reasonable that our office will hold your personal data for the duration of Jesse’s time as representative for the Hereford and South Herefordshire Constituency. Following an election, if unsuccessful, all records will be destroyed within one calendar month of the election.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page.\nPlease note that we will ask for identification (passport, driving license, utility bill from the last 3 months) should you choose to exercise any of the above rights in relation to personal data we hold.\nComplaints\nIn the event that you wish to make a complaint about how your personal data is being processed by this office, or how your complaint has been handled, you have the right to lodge a complaint directly with the Information Commissioner’s Office www.ico.org.uk\nJesse Norman MP\nMember of Parliament for Hereford and South Herefordshire\nSuite 2A, Penn House\nBroad Street\nHereford HR4 9AP.\nTelephone:\n01432 276422\nPlease note, calls will be recorded for safety and monitoring purposes.\nemail:\njesse.norman.mp@parliament.uk",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_Parliament_jesse-norman-introduces-bill-restore-river-wyes-water-quality/content_48.html": "Jesse Norman presents a Ten Minute Rule Bill that would require the Secretary of State for Environment, Food and Rural Affairs to publish and implement a plan for cleaning and improving the water quality of the River Wye.\nJesse Norman (Hereford and South Herefordshire) (Con)\nI beg to move,\nThat leave be given to bring in a Bill to require the Secretary of State to publish and implement a plan for cleaning and improving the water quality of the River Wye; and for connected purposes.\nAs shadow Leader of the House, I am rarely allowed to speak on behalf of my constituents from the Back Benches, so this ten-minute rule motion is a priceless opportunity for me to highlight a vital issue of both local and national significance—the plight of the River Wye.\nThe Wye is one of the most beautiful and ecologically significant rivers in the UK. Rising from the slopes of Plynlimon in mid-Wales, it winds its way via Hay-on-Wye and Hereford on to Ross-on-Wye before heading down to Symonds Yat, Monmouth, Tintern and the Severn estuary.\nThe Wye valley, too, is renowned for its beauty. It is a special area of conservation with two sites of special scientific interest. The river is thus a vital part not only of the local economy in Herefordshire but of our landscape, our culture and our heritage as a nation. Admired since Roman times, the river is one of the birthplaces of British tourism, the origin of the movement known as the picturesque and the inspiration for some of the finest poetry in the English language, yet in recent years it has faced huge environmental pressures, particularly from high phosphate levels, which have harmed water quality and aquatic life.\nThe rapid growth of certain farming sectors, including poultry, has brought economic benefits but also placed additional strain on the river. As well as agricultural run-off, sewage and waste water discharges and changes in land management have contributed to the problem. Those pressures have been compounded by rises in water temperature and changes to seasonal water flow. Many of those specific problems and their interactions are still not fully understood, so there is a real need for proper research.\nBuilding on the work of Councillor Elissa Swinglehurst and the Wye and Usk Foundation among many others, I first highlighted this issue in September 2020. From the start I pressed the agencies—the Environment Agency, Natural England and Natural Resources Wales—for a collective response and called on them to produce a cross-border, all-catchment long-term action plan.\nIn June 2021, working with other catchment MPs at the time, I invited the national agencies and the local councils on both sides of the border to a special meeting devoted to the issue. In October 2021, I co-ordinated a letter from Wye catchment MPs to the Chief Secretary to the Treasury calling for a specific spending package devoted to the Wye in the 2021 three-year spending review. The result, notwithstanding lockdowns and other pandemic delays, was the Hereford Shell Store meeting of July 2022 and the setting up of the Wye phosphates working group, whose terms of reference were then adopted—very much with my support—by a phosphates commission established by the four local authorities. All those things helped to bring people and groups together.\nIn the course of that work, I am pleased to say we also had one major win of substance. I had called for the proceeds of fines on water companies to be ringfenced and devoted to a new national rivers recovery fund. In November 2022, the Government accepted that ringfencing.\nIn relation to the Wye, it is important to be aware that much good work has been done on the ground. The cross-border nutrient management board has carefully assessed and assembled a range of potentially useful measures. Thanks to detailed assessment work with Welsh Water, it now looks as though local sewage and waste water discharges will be brought within national standards—though only by the early 2030s, which is still far too slow. The community response on both sides of the border has been magnificent, with hundreds of volunteer citizen scientists actively taking weekly water readings under the aegis of the Friends of the Wye and other organisations.\nAt the national level, I am sorry to say that progress in addressing these issues has been painfully slow. For years, the creation of a high-level catchment-wide plan, essential to managing this cross-border issue, was impeded by political differences between the Welsh and UK Governments. Meanwhile, the regulatory agencies struggled to enforce existing environmental protections effectively. Finally, after three ministerial visits, including one by the then Secretary of State for Environment, Food and Rural Affairs to Hereford in June 2023, we managed to secure publication of the River Wye action plan last year. That at least covered the English part of the river, and £35 million was reallocated from within existing DEFRA budgets to fund mitigations and the development of an integrated long-term recovery strategy.\nThe then Government also announced that they had appointed a new river champion, whose job it was to lead the detailed planning work in collaboration with key stakeholders on both sides of the border. The plan for the Wye was by no means perfect, but for the first time it provided a framework, badly needed money to support projects and research, and a named person to help drive things forward on the ground. It was therefore deeply disappointing when the plan was dropped by the new Government after the general election, alongside the idea of the river champion.\nIt is still more disappointing that the Treasury is also now rowing back on the previous Government’s commitment to ringfence money from fines on water companies and use them for a river restoration fund. That is a massive step backwards. Water companies have paid many tens of millions of pounds in fines since 2022 alone. That money should go back into saving our rivers.\nWhat is to be done? Protecting and restoring the Wye requires a long-term, collaborative approach, as I have highlighted. The UK and Welsh Governments, the agencies, farmers, businesses, local authorities, environmental groups and local people all have a role to play in developing a strategy that balances economic sustainability with environmental responsibility. While I am very glad that my colleague the hon. Member for North Herefordshire (Ellie Chowns) is sponsoring the Bill, it is a great pity that other Wye catchment MPs have chosen not to. Indeed, I do not notice a single Wye catchment MP in the Chamber; a great sadness.\nThe Bill is clear and simple in its intent. It would for the first time require the Secretary of State for Environment, Food and Rural Affairs in law to publish and implement a plan for cleaning and improving the water quality of the River Wye. That is a measure that every MP of every constituency inside or outside the Wye catchment should be enthusiastic to support. Solutions must include better land management, improved water treatment, effective incentives for sustainable farming and stronger oversight and enforcement.\nThe Wye catchment 2025 management plan is designed to cover not just water quality but biodiversity loss and flood and drought vulnerability. The nutrient management board provides an important framework of public accountability in relation to measures affecting nutrients and water quality. In other words, many of the key clean-up measures and mitigations are well understood. What we need now is action. We need an end to delay. We need political leadership from Ministers on both sides of the border, a shared determination to address this vital national issue with the seriousness it deserves, and the funding—the £35 million cut from the plan for the Wye—to make it happen.\nThe River Wye is a true national treasure. It requires not just short-term measures but a sustained, collective effort led by the UK and Welsh Governments to ensure that this magnificent river is fully restored to health as swiftly as that can be achieved.\nQuestion put and agreed to.\nOrdered,\nThat Jesse Norman and Ellie Chowns present the Bill.\nJesse Norman accordingly presented the Bill.\nBill read the First time; to be read a Second time on Friday 4 July, and to be printed (Bill 186).",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_new-government/content_20.html": "Jesse writes for the Hereford Times.\nA new government in a new parliament is always an opportunity for political renewal. But how vigorously that opportunity is taken varies wildly.\nSometimes, as in 1945 and 1979, you can see a clear and enduring change of direction. At other times, such as in 1997, there is as much continuity as change. There is some truth in the claim that Tony Blair and Gordon Brown were \"Thatcher's Children\", after all.\nPeople often measure political change by the size of a majority and the duration of a government. But what really matters is impact.\nOver the last 30 years there has been a deplorable tendency for governments to try to look active through the sheer volume of new legislation they create, as though the solution to all problems was more law, and the weight of law mattered more than its quality.\nThis has generated so much complexity that, as my late father-in-law the judge Tom Bingham said in his brilliant book \"The Rule of Law\", it is sometimes impossible to say with any certainty what the law as laid down by Parliament actually is.\nIn this context, the new government's 40-Bill King's Speech is not encouraging.\nBut perhaps even more important is tone, on all sides. Is it partisan or open, hostile or confident, hurried or measured? As recent weeks have shown, tone becomes especially important at times of public conflict and disorder.\nPoliticians of all parties have a huge obligation here: to conduct themselves in a way that mixes proper passion for good government and effective law with a sober recognition of their difficulty and complexity.\nAnd this is an obligation that extends to us all. Our human environment is like, indeed part of, our natural environment. We can improve it, or we can pollute it. We can keep the temperature steady, or we can raise it.\nThe person who posts anonymous abuse or provocations on social media, or denounces others in chat rooms, is raising the temperature of the water. The politician who fulminates against their opponents, or who dog whistles to their supporters in order to mobilise anger and resentment, does the same.\nThis is not to say for one second that there should not be vigorous protest against injustice, or public anger at malfeasance and wrongdoing. But politicians and people alike can use this moment to set a new direction, of courtesy and engagement and respect and tolerance.",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_search/content_39.html": "Skip to main content\nMain navigation\nHome\nAbout\nIn Parliament\nNews\nArticles\nContact\nSearch\nCleaning Up the Wye\nNMITE\nUser account menu\nLog in\nToggle navigation\nMain navigation\nHome\nAbout\nIn Parliament\nNews\nArticles\nContact\nSearch\nCleaning Up the Wye\nNMITE\nSearch this site\nSearch form\nSearch\nSearch",
  "http_www_jesse4hereford_com_/http_www_jesse4hereford_com_articles/content_35.html": "Articles\nConservatives cannot win with their heads in the sand\nJesse Norman writes for The Telegraph.\nTo say that the 2024 general election was a disaster for the Conservative Party tests the art of political euphemism to its limits. The result has been to create a wasteland on the centre-Right of British politics.\nA rushed Tory leadership contest would not be in the interests of the party, or the country\nJesse Norman writes for The Telegraph.\nIt is not given to mere mortal human beings to predict the future. But you don’t have to be the Oracle of Delphi to suspect, as the polls are suggesting, that we may have a Labour government on Friday.",
  "http_www_jesse4hereford_com_/https_www_jesse4hereford_com_News_rushed-tory-leadership-contest-would-not-be-interests-party-or-country/content_42.html": "Jesse Norman writes for The Telegraph.\nIt is not given to mere mortal human beings to predict the future. But you don’t have to be the Oracle of Delphi to suspect, as the polls are suggesting, that we may have a Labour government on Friday.\nIf that happens, we will doubtless be inundated by a vast tide of analysis offered by every would-be pundit, from pub bore to party activist to academic expert.\nWe can safely leave any post mortems to another day. But there is one thing that we can say now with absolute certainty. If the worst happens, the Conservative Party must have a functioning front bench from the start, because the biggest changes from a Labour government will come in the first hundred days.\nBut the Conservative Party should not rush into another leadership election. On the contrary, it should think slowly, deeply and carefully about what has gone wrong, who will be best placed to take the party forward, and how.\nMuch ink has already been spilled on the question of the right way to choose a new leader. One option, not yet considered, would be for MPs to take the final decision but for each MP to have to justify their preferred choice of leader to their local party members before the final vote. This would increase accountability while preserving the representative principle.\nThere are three other fundamental questions to be addressed. The first is, does the Conservative Party as it is presently constituted really believe in the idea of conservatism?\nConservatism in the English tradition is a reforming and not a radical disposition: an instinct to preserve what is best in human society, to curb injustice and celebrate the rule of law, and to improve people’s lives and enhance their freedom, in particular from the excessive burdens of state regulation and tax.\nThese are the wellsprings of the Conservative Party’s collective instincts when it is at its best: for a strong nation state, for the institutions of civil society, for entrepreneurship and business growth, for fiscal probity and care in spending the public’s money.\nThis disposition does not exclude radical ideas or policies. It merely demands that they are properly based on effective prior consideration and preparation.\nAfter all, the radicalism of Margaret Thatcher in the 1980s, with privatisation and home ownership, did not spring fully-formed like Athena from the head of Zeus. Those policies were the vigorous extension of good ideas that had already proved their worth. The same was not true of the poll tax, which was genuinely revolutionary, and disastrous.\nThe second question is this: is the Conservative Party doing a good enough job of recruiting talented individuals who can be candidates for public office?\nOne of the principal functions of a political party is to act as a conduit for people of ability to enter public life. That means recruiting those with real life experience – not merely Westminster insiders, but those who have, crucially, demonstrated that they believe in conservative principles, and have evinced a clear commitment to public service, before they ever considered entering politics.\nSuch people will come from any background and walk of life. The idea that councillors and other people well known to local Conservative associations are to be rejected in favour of those known to the central party is an embarrassingly facile and foolish one. And selecting people en masse in the heat of a snap general election is far from the careful sifting and selection that is required.\nThe third question is this: can the Conservative Party articulate over time a new programme of government which is intellectually compelling, practically achievable and inspiring to others?\nSuch a programme will draw on the answers already given to questions one and two above. Radicalism will have to be earned through the hard grind of proper policy work. Effectiveness requires an institutional rebuilding as well as the development of a new generation of experienced and competent Members of Parliament.\nThis will take considerable time, effort and investment, as it should. By contrast, to attempt to spring back immediately would suggest that the last few years had taught the party nothing.\nAll of this implies a leadership election process which is not precipitate but steady, deliberate and wide-ranging, allowing scope for the party to take stock. It should run through the late summer and autumn, into a party conference in which all of the candidates can make the case for themselves and be scrutinised and held accountable by the membership, before a final decision is made.\nAnyone who knows the Prime Minister will know that he is driven by an acute sense of public duty. When and if he decides to step down as party leader, to facilitate a process of this kind will be a last great service – not merely to his party but, since our democracy demands an effective opposition, to the nation as well."
}