{
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_mp-voices-residents-concerns-quarry-expansion/content_33.html": "Julia Lopez, MP for the Hornchurch & Upminster constituency, has urgently raised residents’ concerns about a new quarry at Rainham Lodge Farm with Havering Council’s planning committee as they deliberate whether to give it the green light.\nRainham Quarry operators Brett Aggregates are currently seeking planning permission from Havering Council for a new sand and gravel extraction site on the farm. Materials would then be transported down to their main site at Rainham for processing.\nIn her letter to Havering Council’s planning department, Mrs Lopez highlighted a range of concerns on traffic, air quality and noise with the proposals following extensive correspondence with constituents.\nResidents claim that the site could increase the amount of airborne PM10 in the area which could, with prolonged exposure, lead to a number of negative health effects on residents.\nThe MP has also raised the issue of road safety, with eleven HGV movements up and down the narrow Launders Lane every hour – an estimated 114 movements a day.\nNoise pollution has also been raised by Mrs Lopez, citing the use of heavy machinery on the site six days a week, potentially causing disruption to the lives of those living nearby.\nCommenting, Julia said:\n“I’d like to thank everyone who has been in touch with me to share their concerns about the proposed new extraction site at Rainham Lodge Farm and the impact it will have on local people. I’ve now compiled everyone’s concerns into an extensive submission to Havering Council’s planning department as they make their deliberations\"\nBack in 2023 when the plans were initially submitted, Mrs Lopez visited the site and shared residents’ initial concerns, securing changes to the proposals which would see the site boundary moved away from homes on Hacton Lane.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_mp-backs-havering-families-over-government-cuts-vital-adoption-support/content_35.html": "Hornchurch & Upminster MP Julia Lopez has sharply criticised the Government’s recent overhaul of a key support fund for adopted children, warning that Hvaering families are being left without the vital help they need.\nThe Adoption and Special Guardianship Support Fund (ASGSF), introduced by the Conservative Government in 2015, was designed to help children overcome the effects of early trauma, abuse, and neglect. It provides therapeutic services for families who have adopted children or care for them under special guardianship orders—arrangements where a child is permanently placed with someone other than their birth parents, often a relative or close family friend.\nDespite the fund's critical role, Labour Ministers failed to outline its future until this month, when a hastily issued ministerial statement confirmed it would continue for another year. However, a later announcement revealed significant cuts to the support available and there is now a lengthy backlog of applications due to government dithering over the new approach.\nKey changes include a 40% reduction in the annual therapy allowance per child—from £5,000 to £3,000—the scrapping of match funding for high-cost cases, and the end of multi-year funding arrangements.\nFamilies and experts in the adoption and guardianship sector have voiced alarm over the cuts, warning they will disproportionately harm children with complex needs who rely on intensive and long-term therapy.\nIn Parliament, Mrs Lopez highlighted the plight of a local Havering constituent whose adopted son has been unable to access sensory therapy due to the funding suspension. She criticised the decision to cut targeted support while investing in universal initiatives like free breakfast clubs.\nCommenting, Mrs Lopez said:\n“Labour is making a political choice to remove this lifeline from the most vulnerable children in Havering, all while rolling out a universal breakfast scheme that will spend limited funds on children whose parents are happy to provide them food. Parents going down the adoption route accept that a child will often come to them with multiple complex needs. Those needs can be hard to navigate due to trauma and abuse, and it is on these families and children that public money should be spent. The Government’s decision to cut support without warning, consultation, or a clear long-term commitment to the fund will cause real distress to families. They deserve better.”\nAdding to the disruption, a backlog of around 700 applications—prepared under the previous criteria—is now being returned to local authorities and agencies for resubmission, further delaying access to services.\nWhile the Department for Education has defended the changes as necessary to meet growing demand and extend access to more families, critics argue that diluting the fund’s impact undermines its purpose. They warn that children most in need of specialist, consistent therapy will be left behind.\nThe fund has been allocated a flat £50 million budget for the 2025–26 financial year. However, no guarantees have been given about its continuation beyond that point, with future funding contingent on the next government spending review.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_category_Westminster-News/content_11.html": "Julia Lopez MP Protests the Family Farm Tax - Featuring Jeremy Clarkson 19th November 2024 Julia Lopez, the Member of Parliament for Hornchurch & Upminster constituency, attended today's protest against the Labour Government's Family Farm Tax. Westminster News\nThe BBC needs to restore trust after Huw Edwards scandal 2nd August 2024 Shadow Culture Secretary, Julia Lopez, comments on the pay rise and news of the arrest of BBC presenter, Huw Edwards. The Huw Edwards story is grim, the timing... Westminster News\nJulia Lopez Sworn in as Member of Parliament for Hornchurch and Upminster 10th July 2024 On the 9th of July 2024, Julia Lopez was sworn in as the Member of Parliament for Hornchurch and Upminster following her third re-election as the MP for the... Westminster News\nJulia Lopez MP Welcomes Prime Minister Rishi Sunak's Defence Spending Commitments 26th April 2024 Julia Lopez MP has welcomed this week’s announcement by the Prime Minister that the UK will undertake the biggest strengthening of the UK’s national defence in... Westminster News\nPost Office Offences Bill introduced to House of Commons 18th March 2024 On 10 January, the Prime Minister announced a major step forward in response to the Horizon scandal. He confirmed that the Government would introduce new... Westminster News\nMP supports radical new plan to recover and reform NHS dentistry 9th February 2024 Julia Lopez MP has welcomed the Government’s Plan to Recover and Reform NHS Dentistry. Under this plan, patients will benefit from millions more NHS dental... Westminster News\nWarm Home Discount Scheme 8th February 2024 This winter, 3 million households will receive the Warm Home Discount across Great Britain, providing eligible households with a rebate of £150 off their... Westminster News\n£15 million boost for cultural venues through the Cultural Development Fund 8th February 2024 Julia Lopez MP has welcomed the opening of the fourth round of the Government's Cultural Development Fund. Venues across England are invited to apply for up to... Westminster News\nNew Small Business Council and Help to Grow campaign launched 8th February 2024 MP for Hornchurch and Upminster, Julia Lopez, has welcomed the government’s new Small Business Council and Help to Grow campaign. A new Small Business Council... Westminster News",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_julia-lopez-mp-protests-family-farm-tax-featuring-jeremy-clarkson/content_25.html": "Julia Lopez, the Member of Parliament for Hornchurch & Upminster constituency, attended today's protest against the Labour Government's Family Farm Tax.\nYesterday, local MP Julia Lopez brought the voice of Havering’s hair and beauty industry to the heart of Westminster, leading a passionate debate in Parliament and urging the Government to take swift action to protect high street salons across her constituency from collapse.The debate follows a high",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_mp-supports-radical-new-plan-recover-and-reform-nhs-dentistry/content_42.html": "Julia Lopez MP has welcomed the Government’s Plan to Recover and Reform NHS Dentistry. Under this plan, patients will benefit from millions more NHS dental appointments over the next year through easier and faster access to NHS dental care across England.\nThe Government’s plan is supported with £200 million funding, providing NHS dentists with a ‘new patient’ payment of between £15-£50 (depending on treatment need) to treat around a million new patients who have not seen an NHS dentist in two years or more.\nThe plan could see up to 2.5 million additional NHS dental appointments delivered for patients over the next 12 months, including up to 1.5 million extra treatments being delivered. It sets out how the NHS and government will drive a major new focus on prevention and good oral health in young children and deliver an expanded dental workforce. A new ‘Smile For Life’ programme will be launched which will see parents and parents-to-be offered advice for baby gums and milk teeth, with the aim that by the time children go to school, every child will see tooth brushing as a normal part of their day.\nTo attract new NHS dentists and improve access to care in areas with the highest demand, around 240 dentists will be offered one-off payments of up to £20,000 for working in under-served areas for up to three years. The public will also be able to see which practices in their local area are accepting new patients on the NHS website and the NHS App. To promote the increased availability of appointments, the government will also roll out a marketing campaign encouraging anyone who has not been seen by a dentist for the past two years to access treatment. NHS work will also be made more attractive to dental teams with the minimum value of activity increasing to £28 (from £23).\nThe health service will build a pipeline of new dentists and other dental care professionals, including increasing dental training places by up to 40% by 2031/32, as part of the NHS Long Term Workforce Plan. The plan, published today, also includes new measures to attract dentists to work in the NHS, including supporting more graduate dentists to work in NHS care. The government will consult on whether dentists should be required to work in the NHS for a period upon completion of their training.\nCommenting, Julia Lopez MP said ‘The Government’s new plan for NHS dentistry will truly improve access to dentists nationwide. I know some constituents have struggled to register with new dentists in Havering, something I have previously raised with our local Integrated Care System. This new investment and dedication to improving recruitment will help alleviate pressures on oral care and improve services in our area.’",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_campaigning-redevelop-queens-ae-department/content_6.html": "Julia is campaigning for Queen's Hospital to secure the £35m worth of funding needed to redevelop their A&E department following the opening of the St. George's NHS Health & Wellbeing Hub. The opening of the new hub in November 2024 allowed some services to move out of Queen's into the new hub, making the redevelopment of the A&E possible. Currently, Queen's A&E is operating at roughly double its original intended capacity.\nUpdates\n- April 2025 - Minister Smyth suggests a public consultation is required for the scheme and urges local NHS to demonstrate the urgency of the works. Julia writes to CEOs of local ICB and Queen's Hospital, encouraging them to do so.\n- March 2025 - In the House of Commons, Julia once again calls on the Health Secretary to provide the funding needed for the redevelopment to improve healthcare outcomes for residents in the Hornchurch & Upminster constituency.\n- January 2025 - Queen's Hospital launch their official campaign and call for the £35m of funding needed to remodel their A&E department. Julia immediately backs the campaign with a fresh letter to the Health Secretary, calling on him again to provide the funding for the redevelopment.\n- November 2024 - The St. George's NHS Health & Wellbeing Hub opens its doors for the first time. Julia again makes the case for a redevelopment of Queen's Hospital A&E.\n- September 2024 - Julia chases the Department for Health for an answer to her calls for the Government to provide the funding to remodel Queen's A&E. Minister Karin Smyth responds by explaining that the Department for Health is reviewing its spending commitments.\n- August 2024 - Julia visits the St. George's NHS Hub which is nearing completion. As part of the visit, Julia highlights that some services are moving out of Queen's to St. George's, creating the opportunity to remodel the A&E department at Queen's.\n- July 2024 - Following the 2025 General Election, Julia writes to the new Health Secretary, Wes Streeting, highlighting that the new St. George's NHS Health and Wellbeing Hub will open later in the year, providing the chance to reconfigure the A&E department at Queen's and urges him to find the funding.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_great-culture-and-leisure-hornchurch-upminster/content_2.html": "People's quality of life is dependent on having great access to grassroots sports and leisure opportunities as well as culture. Increasing access to green spaces throughout the constituency, improving opportunities to participate in sports and supporting our cultural institutions are campaigning priorities.\nWhat I’m campaigning on:\n- We all know having access to the great outdoors is good for our mental and physical health. That’s why I’m campaigning to create a network of connected green spaces so that people can go from the Thames Chase Community Forest to new woodland being planted in Brentwood via Pages Wood.\n- I am working with local creative, heritage and cultural groups on their own projects, from Upminster Windmill’s volunteer drive to securing funding for theatre groups like the Habbit Factory and restoring heritage assets at Langtons.\nWhat we’ve achieved:\n- I backed Upminster Cricket and Hockey Clubs’ successful bid to redevelop the current pavilion to include dedicated changing facilities for the many women and girls’ teams the clubs have.\n- I worked with the Government in 2023 and 2024 to secure £841,000 for Harold Hill Central Park Leisure Centre from the Swimming Pool Support Fund.\n- In 2022, Queen’s Theatre was given Grade II listed status by the Department for Digital, Culture, Media and Sport. It also received £1.44m worth of funding from Arts Council England earlier in the same year. This funding will run until 2025.\n- In 2023, we secured £390,000 of funding from DCMS and the Lawn Tennis Association to resurface the tennis courts in Harold Wood Park, as well as make other improvements to football pitches and courts around the constituency.\n- I’ve continued to lobby the Lower Thames Crossing to expand local woodlands to offset the development’s impact. The Conservative government granted the Forest money to expand via the Trees for Climate fund while the Lower Thames Crossing is planting a new woodland site at Hole Farm and intends to build a bridge over the A127 for cyclists and walkers.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_education-secretary-announces-special-educational-needs-boost/content_37.html": "Since my election last year, I have made it a priority to visit each of the 42 schools in the constituency in order to get to know the school community and its needs.\nThe pressures on special educational needs services in Havering has been a consistent theme in my discussions with teachers and the parents of SEN children. I have therefore continued to highlight those pressures both to the Secretary of State for Education and to Havering Council's lead for children’s services.\nI am very pleased to say this week that these representations have borne fruit, with Education Secretary, Damian Hinds, announcing an additional £250 million of high needs funding – £125 million for 2018-19; and £125 million for 2019-20.\nLooking at the breakdown of that figure, our borough of Havering will receive £611,278 extra in 2019-20 in high needs funding. This will be on top of its existing allocation.\nMeanwhile the Secretary of State has allocated a £100 million top-up for new high-needs school places and improved facilities, and a removal of the cap on the number of special and alternative provision free school bids.\nAlongside the additional cash will come a package of other measures to improve outcomes for those children and young people with special educational needs, and I paste below the full letter I received from the Education Secretary outlining these.\nRt Hon Damian Hinds MP\nSecretary of State\nSanctuary Buildings Great Smith Street Westminster London SW1P 3BT\n17 December 2018\nDear Julia,\nEDUCATION: HIGH NEEDS PROVISION AND SUPPORT\nI announced today via a Written Ministerial Statement, allocations to local authorities (LAs) of the Dedicated Schools Grant (DSG). In recognition of the cost pressures that LAs are experiencing on the high needs element of this Grant, I have also set out a range of further measures that I am taking alongside these allocations.\nOur ambition for children with SEND is exactly the same as for every other child – to achieve well in school and college, find employment and go on to live happy and fulfilled lives. High needs funding has already risen by £1 billion, from £5 billion in 2013 to £6 billion this year. As part of our wide-ranging reforms to the SEND system in 2014, we introduced Education, Health and Care (EHC) plans, to ensure that support is tailored to the needs of individuals, and families are put at the heart of the process. Already, more than 320,000 children and young people are benefiting from these.\nToday I am announcing, on top of existing high needs allocations:\nan additional £250 million of high needs funding – £125 million for 2018-19; and £125 million for 2019-20. I have published individual LA allocations today;\na further £100 million top-up to the Special Provision Capital Fund for local authorities in 2019-20 to take our total investment to £365 million across 2018-21, for the new places and improved facilities they have identified they need in order to put more cost effective provision in place. This funding can be used for more places in SEN units and resourced provision in mainstream schools or colleges; in special schools; or in any of the other types of provision used for pupils and students with EHC plans. This funding is for places needed up to 2021 and the specific amount for each LA will be published in due course; and,\nremoval of the cap on the number of special and alternative provision free school bids that we will approve as part of the current wave. Instead of approving around 30 bids, as we previously proposed, we now anticipate being able to approve all those LA bids that fully meet the criteria for the wave and will, therefore, contribute to relieving high needs funding revenue pressures.\nMany LAs have already proposed to move funding between blocks of the DSG in 2019-20, principally from the schools block to the high needs block, in the\nusual way. Given the announcement today of additional funding for the high needs block, we expect that some LAs may therefore want to review these\nproposals. Where they have submitted requests to the department to do so, they may wish to reduce or remove their requests. We will provide a window\nearly in the New Year for authorities to do so.\nOf course, extra funding cannot be our only response. Alongside central government, LAs, play an essential role in providing strategic leadership and\noversight of the services, provision and funding for children and young people with SEND in their area. While LAs must take the lead in this, I am clear that\nthey cannot act alone. There is a vital role for all education providers in an area - whether mainstream or special, school or college, within the area or outside it\n– along with health services and working with families. Many LAs have embraced their new role as strategic commissioners, but more remains to be done.\nWe are seeing some excellent practice through our joint Ofsted/CQC local area SEND inspections, for example the recent positive inspections in Lincolnshire\nand Milton Keynes, and I am pleased that the revisits to local areas who were required to produce a Written Statement of Action are now beginning. However,\nthe inspections are also showing that the experiences of children, young people and their families are inconsistent across education, health and social care.\nTherefore, I have written today to Chairs and Chief Executives of LAs to outline several further supporting measures. These include:\noutlining the next steps to establish a new SEND System Leadership Board focused on improving local joint commissioning as recommended by Dame Christine Lenehan’s review into the experiences and outcomes of children in residential special schools and colleges. We are also establishing joint Ministerial roundtables with the Department for Health and Social Care to give providers, users and voluntary sector organisations further opportunities to input their views and insight across the SEND system. Nadhim Zahawi, Minister for Children and Families, has written separately to Dame Christine today to provide further details\non this;\nreviewing current SEND content in Initial Teacher Training provision (ITT) and building on our existing SEND specialist qualifications to develop a continuum of learning from ITT, through teachers’ early careers and into specialist and leadership roles in support of the upcoming Teacher Recruitment and Retention Strategy;\nensuring a sufficient supply of Educational Psychologists (EPs), trained and working within the system to carry out the statutory functions linked to the EHC plan process, and to support teachers and families. We will be funding three more cohorts of EP trainees, starting in September\n2020; and will increase the number of trainees from 160 to at least 206, to reflect increased demand;\nholding, in early 2019, an evidence-gathering exercise on the financial incentives in the current arrangements, in particular on the operation and use of mainstream schools’ notional SEN budget, which pays for the costs of special educational provision up to £6,000;\ncommissioning ‘SEN Futures’, a flagship package of long-term research and analysis to provide evidence on the impact of current SEN provision on children and young people’s outcomes, and to assess the value for money of SEN provision in England. Procurement for the first pieces of work in this programme has begun today: more details on this can be found here.\nI recognise the rising demand for EHC plans for those over 19, and the need for education, health and social care services to agree a shared vision of what good\nlife outcomes look like for an individual, and when it is right to cease an EHC plan. We have commissioned one of our delivery partners, the National Development Team for Inclusion to work with 20 local authorities to develop and model effective practice on this, and to share their findings across regions.\nI also want to continue to ensure that services for young people with SEND effectively prepare them for adulthood, including employment: raising expectations and aspirations for young people, their parents, education providers and employers. My officials are working closely with the Department for Work and Pensions on this, and the Work and Pensions Secretary and I are committed to finding ways to support more young people with SEND into sustainable employment. I want our wider reforms to post-16 education, including T Levels, to be accessible to those with SEND and will continue to support close working between colleges, schools and local authorities to improve pathways to adulthood.\nI want to continue engaging with local authorities, health providers, families, schools and colleges to better understand what is driving the cost pressures on high needs budgets, and to work with the sector to help manage them.\nDamian Hinds\nSecretary of State for Education",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_telegraph-article-reevess-ruinous-budget-now-driving-female-led-firms-wall/content_4.html": "An unmistakable theme has recently revealed itself in my casework. Countless female business owners have been getting in touch for the first time, in a state of distress.\nI have been an MP for seven years. Let me tell you, these are the type of people who never email. They are busy juggling businesses and family with exhausted determination, avoiding politics if they can. Capable, unfussy, utterly reliable. The kinds who keep shows on roads – now reluctantly turning to their MP for help.\nThe numbers had been crunched, and a fear of the new financial year had begun to set in. These women’s businesses, built on years of graft and grit, were about to be hammered by Labour.\nOne woman running a small after-school club for two decades has seen her Employer National Insurance Contributions leap from £10,851 to over £26,000. A nursery provider is now facing £30,000 in extra payroll costs every month, thanks to minimum wage hikes and National Insurance changes. A hair salon has seen its business rates rocket from £7,500 to over £18,000. The owner asked, “How much money does the Government think we make?!”\nThe October Budget was deeply pernicious. Due to the lowering of employer national insurance thresholds, the jobs tax is hitting hardest sectors where profit margins are tight, where staff are often part-time, and where wages make up the lion’s share of costs.\nSince women often run people-facing services that employ small platoons of female staff – care homes, nurseries, salons, after-school clubs – they are especially vulnerable to Labour’s tax changes.\nOn top of that come other sector-specific issues. Many high street salons saw continued business rates relief – now cut – as a lifeline. They also face a challenge with the VAT regime. A salon that employs its staff directly is pulled into VAT, which cannot be reclaimed on the biggest cost it faces: wages. Yet those operating entirely with self-employed stylists can often sidestep VAT. Two businesses that appear identical to a customer operate under completely different tax burdens. The looming Employment Rights Bill is encouraging more salons down the self-employed avenue, ironically giving stylists fewer rights.\nAnd while salons that are not PAYE-registered cannot take on apprentices, those which are now cannot afford to keep them.\nIt is not just happening in hair and beauty. Construction firms – a vital route for young people entering the workforce – are shedding apprentices rapidly. Two traditional routes into skilled employment for working-class girls and boys are quietly collapsing under the weight of bad policy. Is this the future Labour promised? A generation of working people priced out of trades?\nAs small firms shut up shop, they are leaving empty units behind on our high streets. Those spaces are too often being filled by businesses that skirt the rules; shadow operations exploiting workers and avoiding tax. Legitimate, tax-paying firms simply cannot compete as dodgy barbers, nail salons and vape shops fill the void. Customers lose high quality services they rely on and the skilled people who give a town soul and identity.\nThe Chancellor’s Budget is also colliding disastrously with the Education Secretary’s childcare reforms. Private nurseries, overwhelmingly run by women, have effectively seen a cap placed on the fees they can charge parents, while the Government’s own funding for so-called “free” hours fails to cover their costs. Meanwhile the state is opening rival provision in schools, which will likely fail to offer the vital non-termtime care many working parents need. The childcare scaffolding that supports mums in returning to work is being kicked away.\nWhat is happening in early years mirrors the chaos being wreaked by Labour’s introduction of VAT on school fees. As Government destroys business, the pot shrinks to fund new state nurseries and school places for those pushed out of the collapsing private sector. Socialism at work.\nThe women approaching me are not activists. They are not political operators. But they are asking difficult questions. Why is a supposedly pro-worker Government making it harder to employ people? Why should they keep playing by the rules when the system punishes them for doing so?\nI worry equally for every small businessperson – man or woman – who is fighting to stay afloat. But tomorrow, I will lead a parliamentary debate focused on the hair and beauty industry – where over 80 per cent of the workforce are women, 86 per cent of businesses are female-owned, and 40 per cent of employees work part-time.\nI find identity politics utterly loathsome. However, I must point out the impact – not just the irony – of a Chancellor celebrating herself for being the first woman to hold that office, while simultaneously hammering the sectors that employ, serve, and are typically led by women.\nWhat we are seeing is not a pro-growth strategy. It is a slow, grinding squeeze on the people who quietly exhaust themselves to make our country work.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_julia-lopez-mp-secures-extra-bus-capacity-and-presses-deputy-mayor-transport-issues-havering/content_15.html": "Hornchurch & Upminster MP, Julia Lopez, met Deputy Mayor of London for Transport, Seb Dance, on Friday 7 February, to push for improvements to Havering’s public transport network – including more frequent buses and accessible toilets.\nSuccess for the 499 Bus Route: Mrs Lopez’s recent campaign to increase capacity on the 499 bus route has been successful, with an additional double-decker bus now set to run during school pick-up and drop-off times on the popular Harold Hill route.\nBus Capacity Review: Julia requested that Transport for London (TfL) share the results of their capacity survey on the 193, 174, and 496 bus routes to ensure services are meeting demand.\nShe also asked TfL to assess capacity on the 346 bus route, following a fresh campaign from a pupil at Sacred Heart of Mary Girls’ School earlier this week.\nStation Facilities & Security: Mrs Lopez once again pressed TfL on the lack of toilet access at Hornchurch and Upminster Bridge stations, asking them to tackle the anti-social behaviour that has led to frequent closures.\nShe also urged TfL to keep ticket barriers closed and work more effectively with British Transport Police to prevent criminals from using the Tube network to enter the area to shoplift and to reduce anti-social behaviour at stations. Finally, she asked for step-free access to the Hornchurch platforms.\nLack of Investment in Outer London: Julia also raised concerns about the Mayor of London’s failure to invest properly in outer London boroughs, leaving Havering’s public transport underfunded compared to inner London despite changing population demographics.\nFollowing the meeting, Julia said:\n\"Residents across Hornchurch and Upminster rightly expect reliable and safe public transport, and want a better service from the Mayor of London.\n“It’s great that our campaign on the 499 bus route has been listened to but there is still more work to do on other Havering bus routes.\n“I still worry that toilet access at District Line stations is being restricted because of nuisance behaviour. I’m pushing TfL to grip the issue so people can have use of the toilets there. The Mayor says he wants better toilets across the transport network with an £8m investment so it’s only right that Havering gets included.\"",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_julia-lopez-pushes-answers-key-transport-projects-constituency/content_29.html": "* UPDATED - This article has been updated to include a copy of the reply Julia Lopez MP received from Lilian Greenwood MP\nEarlier this month, Julia Lopez MP wrote to the new Transport Secretary as well as the Rail Minister, calling for answers on three key transport projects in the constituency, namely the refurbishment of the Gallows Corner flyover, the Lower Thames Crossing and getting step free access on platform 6 at Upminster Station.\nBack in the summer, the Department for Transport announced it was suspending all capital investment projects and reviewing its spending commitments, casting doubt over the future of these key transport projects in the constituency.\nThe previous Conservative Government had made firm commitments to delivering the projects, agreeing to fund 85% of the cost of the Gallows Corner flyover refurb (around £57m), and committing funding through the Access for All programme for a feasibility study on proposals to make platform 6 at Upminster Station step free.\nIn August, Julia wrote to the then Transport Secretary, Louise Haigh, asking for a commitment that the Gallows Corner flyover refurb would not be cancelled in light of the spending review.\nShe also wrote to the Rail Minister in the same week, asking for the Government to commit to plans which could see a lift installed at platform 6 at Upminster station.\nUnfortunately, no commitment on the schemes were forthcoming with Ministers, instead only confirming that a review of their capital spend was underway – leaving the future of these three vital transport schemes uncertain.\nAs such, in the absence of any announcements from the Department for Transport, Mrs Lopez has written again to the Transport Secretary and Rail Ministers for clarity on the future of the three projects. She is also once again seeking their commitment to deliver these projects which had been set in motion by the previous Conservative Government.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_accessibility/content_7.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_better-healthcare-hornchurch-upminster/content_5.html": "Our health and wellbeing underpin everything we do in life, whether that’s being able to work, look after your family, or being able to enjoy life to its fullest. When you’re not well, things can grind to a halt.\nThat’s why one of my key aims as your local MP is to improve local healthcare. From delivering the St. George’s Health Hub in Hornchurch, which will revolutionise healthcare here in Havering, to working with our local NHS team to improve standards at Queen’s Hospital, my team and I want to get residents the best care.\nFind out more below about what I’m currently working on, and what we’ve delivered so far for local people.\nWhat I’m campaigning on at the moment:\n- I’m working with various stakeholders, the local NHS and the Government to ensure that the new St. George’s Health Hub opens on time later this year and starts transforming healthcare in our region. Read more here.\n- Better healthcare in Hornchurch &Upminster also means good quality end of life care for our residents. That’s why I’m working closely with our local hospices and supporting their valuable work. Find out more.\n- Queen’s Hospital looks after so many people right throughout Havering and so I’m determined to work with them to improve patient care and services at the hospital. Read more.\nWhat we’ve achieved:\n- Back in 2017, I secured £17m of funding from the Conservative Government to build the new St George’s Health Hub which will transform healthcare in our part of the world. Find out more.\n- Getting a quick diagnosis when you need one is so important, increasing the chance of treatments for certain illnesses being successful. That’s why I’m proud to have secured a Community Diagnostic Centre in Hornchurch. Find out more.\n- I know that the 8am rush for a doctor’s appointment can be stressful for many residents. Thankfully, the Conservative Government’s ‘Pharmacy First’ scheme means 7 common ailments can now be treated in pharmacies, freeing up hundreds of GP appointments. Find out more.\n- In the most urgent moments, our emergency workers need the very best facilities available to save lives. That’s why I was proud to support the Conservative Government’s £1.1m of investment for a new ambulance hub at Queen’s Hospital. Read more.\n- During my time in Parliament, I’ve been proud to use my platform to make life saving drugs and treatment available on the NHS for those with cystic fibrosis and neuroblastoma. Find out more here.\n- The Conservative Government provided record investment in healthcare in North East London, with £3.95bn worth of funding. This has delivered, 1.9m more GP appointments per year, 54 more full time equivalent GPs in BHRUT and the delivery of the new St. George’s Health Hub. Find out more about our record health investment here.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_category_Speeches-in-Parliament/content_27.html": "Asking about the UK's Missile Defence Capabilities 6th January 2025 Today Julia Lopez MP asked the Government about the UK's missile defence capabilities following reports from over the weekend about NATO concerns in relation to... Speeches in Parliament\nUK Trade & Investment Strategy 23rd July 2019 Today I led a parliamentary debate on the UK's Trade & Investment Strategy that was answered by Investment Minister, Graham Stuart MP. Once Hansard is published... Speeches in Parliament\nNegotiations on the UK leaving the EU during the Extension Period. 22nd May 2019 Thank you, Mr Robertson, while I have contributed to many Westminster Hall debates, it is an honour to lead my first this morning and to do so under your... Speeches in Parliament\nUK's Relationship with China 7th May 2019 I made the following contribution to a debate on the UK's relationship with China, which was tabled by Aldershot MP, Leo Docherty. Unfortunately I was called... Speeches in Parliament\nFuture International Trade Opportunities 1st May 2019 I made the following contribution to a debate tabled by Conservative MP, Craig Tracey, on future trading opportunities for the UK. Julia Lopez Conservative... Speeches in Parliament\nLoan Charge Debate 4th April 2019 I know that a number of constituents, particularly those involved in IT contracting, are concerned about HMRC's Loan Charge. I attended the parliamentary debate... Speeches in Parliament\nKnife Crime Sentencing Debate 26th March 2019 Petition debates occur within parliament when online public petitions reach 100 000 signatures. Our constituency contributed the greatest number of signatures... Speeches in Parliament\nQuestion to PM on Brexit statement 26th February 2019 This afternoon, the Prime Minister made a statement to the House advising MPs that we shall have a further meaningful vote on her Withdrawal Agreement by 12... Speeches in Parliament\nSpecial Educational Needs and Disabilities 12th February 2019 I made the following speech in a Westminster Hall debate on special educational needs. Due to the number of MPs wishing to speak, we were only able to make very... Speeches in Parliament",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_mp-defends-haverings-heritage-government-slashes-support/content_24.html": "Hornchurch & Upminster MP, Julia Lopez, has defended Havering’s heritage buildings as the Labour government confirmed that funds to repair ancient churches will be slashed, after months of uncertainty.\nThe decision has been branded a ‘worship tax’ as it puts at risks the futures of some of the country’s most important faith buildings. The previous Government provided listed places of worship up to £42 million per year of support toward repairing roofs, masonry and monuments integral to the buildings – a scheme Labour Ministers are now cutting by £19 million. The decision leaves over 1000 buildings at risk nationally, including Havering churches like All Saints, Cranham, St. Thomas, Noak Hill, St. Mary Magdalene, North Ockendon, St. Andrew, Hornchurch, and St. Laurence, Upminster.\nMrs Lopez said:\n‘Churches and other historic places of worship aren’t just part of our shared heritage – they are at the heart of our communities’\n‘The brilliant volunteers who keep them open now and for future generations, do so with very little help. That’s why the Listed Places of Worship Scheme was always such a vital lifeline.’\n‘Labour withheld their plans to cut the scheme’s funding for months, and their decision effectively to impose a Worship Tax will make it much harder to fund repairs of our beautiful Havering churches.’\nMrs Lopez has worked with several local groups to protect Havering’s heritage. This month she visited Upminster’s tithe barn as restoration works near their completion thanks to partnership between the Historic England and National Highways. Once complete, it will add to an emerging heritage corridor with the newly restored Upminster Windmill, whose volunteer drive Mrs Lopez has backed. She has also been working with the Friends of Langtons to unlock grant funding for their bathhouse restoration project.\nMrs Lopez was formerly a Minister in the Department for Culture, Media & Sport, during which time Queen’s Theatre in Hornchurch received listing, alongside the Hornchurch War Memorial. She has also worked with volunteers at the RAF Hornchurch Museum to recognise the area’s important role in protecting London during the Second World War.\nAs a result of the increased focus on the borough’s heritage, National Highways is funding a dedicated Heritage Officer for Havering Council and Mrs Lopez is consulting with Historic England on blue plaques for the area – including potentially for Upminster resident and famous punk rocker, Ian Dury.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_warm-home-discount-scheme/content_26.html": "This winter, 3 million households will receive the Warm Home Discount across Great Britain, providing eligible households with a rebate of £150 off their electricity bill, directly from their supplier. This brings support through the scheme to over £4 billion since 2011.\nThe Government has streamlined the rebate process for most eligible households in England and Wales, ensuring automatic distribution by matching data with suppliers. However, some potentially eligible customers may need to confirm details by calling a dedicated helpline, as communicated in letters sent between October and December. If you have received a letter, it is essential to contact the helpline before February 29, 2024, to confirm eligibility and claim the discount.\nPlease do check your letter if you have received one and take the relevant action as soon as possible. For advice on applying and checking eligibility, please see the Warm Home Discount Scheme website - https://www.gov.uk/the-warm-home-discount-scheme",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_better-transport-across-constituency/content_10.html": "Having great transport links are a vital part of making Hornchurch & Upminster a great place to live, work and raise a family - whether you’re heading across Havering to see family on a bus, driving to work through Gallows Corner, or commuting into central London by train.\nAs one of London’s largest outer boroughs, Havering is one of the capital’s more car reliant areas. Ensuring we have a good road network, as well as great public transport is key for our community.\nWhat I’m campaigning on:\n- In May 2024, we were successful in getting £57m worth of funding from the Conservative Government so that TFL can refurbish the Gallows Corner flyover. I’m now pushing the Mayor of London to get this project over the line to keep the flyover open.\n- All residents throughout Hornchurch & Upminster deserve to have access to great public transport. That’s why I’m working closely with C2C to make platform 6 at Upminster station fully accessible, ensuring everyone in our community has full use of all platforms.\n- As one of London’s outer boroughs, lots of people in Havering regularly use their cars. That’s why I’m campaigning for more investment in fixing our roads here in the Borough.\n- Helping to secure the Lower Thames Crossing to stop major roads gumming up when there are problems at Dartford.\nWhat we’ve achieved:\n- In May 2024, following years of campaigning, we secured £57m worth of funding for the Department for Transport for a full refurbishment of the Gallows Corner flyover.\n- I have been successful so far in my campaign to make platform 6 at Upminster station step free for those with accessibility needs. The station won a share of redirected HS2 money toward getting a lift or ramp installed.\n- In 2023, I was successful in lobbying the Government to redirect £10m of HS2 funding for Havering to improve our roads locally.\n- I successfully fought Mayor Khan’s proposals to scrap the 347 bus route by writing to residents, asking why the bus was important to them. After extensive campaigning, TFL reversed their decision to scrap the route.\n- During the planning and construction of the Lower Thames Crossing, I’ve worked to make sure it has as little negative impact on our area as possible, whilst making sure this vital transport project gets over the line.\n- Following my work with the Department for Transport and National Highways, we secured vital improvements to Junction 28 of the M25. These plans will reduce congestion and queues, improve safety and minimise pollution.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_category_Written-Questions-News/content_8.html": "Setting up an independent Trade Remedies Authority 22nd February 2018 I attended oral questions to the International Trade Secretary this morning to ask the following question about the pressing need to set up an impartial Trade... Written Questions News\nResourcing our embassies and high commissions for Brexit 20th February 2018 I asked the following question of the Foreign Secretary at FCO Questions today. Julia Lopez Conservative, Hornchurch and Upminster If Britain is to assume a... Written Questions News\nBasketball in the UK 20th February 2018 I made the following intervention in a debate tabled by Alex Sobel MP about basketball in the UK. Julia Lopez Conservative, Hornchurch and Upminster I... Written Questions News",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_map-locations/content_9.html": "Skip to main content\nJulia Lopez\nConservative Member of Parliament for Hornchurch & Upminster\nMain navigation\nHome\nAbout Julia Lopez\nMy Plan\nCampaigns\nNews\nIn Parliament\nContact\nMy map",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_hornchurchs-queens-theatre-secures-ps144m-arts-council-cash/content_21.html": "Culture Secretary, Michelle Donelan MP, has today confirmed to Hornchurch & Upminster MP, Julia Lopez, that Queen’s Theatre has secured £1.44m in Arts Council England (ACE) funding over the next three years.\nThe treasured Hornchurch theatre was granted Grade II listed status by the Department for Digital, Culture, Media & Sport (DCMS) earlier this year to celebrate the Platinum Jubilee and recognise the incredible contribution that the theatre has made to the local arts scene in the region. The ACE grant further secures the local theatre’s future for Havering residents.\nACE is investing in arts organisations, museums and libraries in every corner of the country and reaching places that, historically, have been underserved. More people in more places than ever before will have access to fantastic, fulfilling art and culture in the villages, towns and cities where they live.\nThis latest funding round has seen a fairer spread of cultural investment across the country whilst protecting London’s world class cultural ecology, made up of a broad range of organisations and artforms. London will receive over £150 million, around a third of the investment that has been announced today, with funding going to the centre as well as 16 of its outer boroughs.\nSpeaking about the announcement, Julia said, ‘As a DCMS Minister and local MP, I know how much of a difference a vibrant arts and cultural scene can make to a community. Queen’s Theatre isn’t just a great place to go out but it is a hub for the community, where I have hosted Jobs and Older People’s Fairs and held meetings with constituents. I know many people value the theatre as a place to see friends, join parents’ groups and get time out. The theatre is also a fantastic sponsor of local artists and theatre groups. I am absolutely thrilled that Queen’s has secured this substantial grant, which should allow it to continue its fantastic role and work over the next three years.’",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_loan-charge-debate/content_38.html": "I know that a number of constituents, particularly those involved in IT contracting, are concerned about HMRC's Loan Charge. I attended the parliamentary debate this afternoon on the Loan Charge that had been tabled by my colleague, Ross Thomson, and had prepared a speech (below) to make. Unfortunately I was down on the list as last to be called and the skies intervened before I could speak – a huge leak in the roof began, the Chamber had to be evacuated and the sitting suspended.\nI did manage to make an intervention earlier in the debate, raising the issue of HMRC knowing for some time about the loan mechanism and subsequently making a political decision to call time on such schemes. I suggested that if they were not complaint, those schemes should have been highlighted to users much earlier and therefore the tax bills deriving from them could have been much smaller.\nYou may wish to read the transcript of the entire debate when it is published in Hansard tomorrow because the case was put very strongly by MPs to the Minister and the recommendations of the APPG pushed. I imagine that the Minister will be getting back to us all formally given the weight of the concern that was raised and the number of MPs in attendance.\nI also wrote to the Minister again on constituents’ behalf a few weeks ago, and his reply can also be read below.\nLike others who have spoken today, I have several constituents beside themselves with worry over the Loan Charge and the financial impact it will have on them and their families. Some are now retired, hit with a demand from HMRC on a tax arrangement from a decade or more ago that they are unable to make up through current or future earnings.\nMy constituency of Hornchurch & Upminster is home to many professional services contractors who lubricate the thriving IT and financial sectors within the City of London, Canary Wharf and beyond with a supply of flexible, highly-skilled labour.\nThis flexibility has been encouraged by the Treasury and taken advantage of by government departments themselves because it allows consultants to be brought in for specific projects, for short periods of time or to plug gaps in the permanent workforce. It is one of the things that makes London so globally-competitive, but the Loan Charge episode highlights how, in the absence of clarity or swifter action from HMRC over what is and is not an acceptable way to structure pay and tax arrangements, groups of such workers can get caught down the line by charges that can be financially ruinous. This includes not just those working in IT or financial services but people like agency nurses, public sector workers or freelancers in the creative industries.\nThe Minister and I have been in close touch on this issue over the past eighteen months and I am grateful to him and his PPS for their engagement with me, looking into specific cases and trying to provide a counter-argument to some of the concerns raised. I think it was right that the government accepted the Rt Hon Member for Kingston & Surbiton’s amendment so that we could look at the arguments in greater detail and in the open.\nAs he is aware, I am in two minds on this issue. I know several people who opt to contract because it gives them personal flexibility and allows them to move between companies with ease in a way that keeps their own skills base up-to-date in what can be rapidly-changing industries. It can also be financially advantageous due to competitive daily rates, but the flip side is that they have few employment rights, no paid holiday or additional benefits such as pensions or healthcare. Many of them were offered schemes some years ago that involved complex loan arrangements and very low rates of tax, and they had rejected the option on the simple basis that if something sounded too good to be true, it probably was.\nHowever, for some of the contractors with whom I am in contact, this was not an option – they were employed by companies that explicitly encouraged them to receive pay via loans or had received advice from paid professional advisers whom they trusted and who offered assurances of their scheme’s compliance, sometimes after they had been checked by HMRC itself. The majority of those who entered these arrangements, the Loan Charge APPG suggests, did so due to the IR35 legislation and to avoid the administrative burden of running a limited company. But they also suggest some public sector contractors did not even know they were being paid in such a way.\nThe Minister knows that my concerns centre primarily around the issue of retrospection and the fact that HMRC has been bringing into its scope schemes that had been in operation as long ago as 1999. I am concerned about the message being sent out to firms and individuals who currently contract about the certainty around tax arrangements. I have asked whether HMRC had itself employed any contractors who are being pursued on the loan charge, and whether there has been any analysis on ‘lessons learned’ such that the Treasury is now trying to create more awareness among contractors that even professionally-endorsed schemes may leave people vulnerable long into the future for unpaid tax. I also believe that HMRC knew about these loan schemes for many years and thus must take a significant portion of blame for not calling time on them sooner.\nMany people have been given wholly inadequate notice of the Loan Charge. In large numbers of cases which are technically ‘open’, HMRC has failed to act within a reasonable timescale. The Loan Charge APPG suggest the real reason for the introduction of the Loan Charge was to bypass the normal legal processes and to allow HMRC to collect tax where they were ‘out of time’ under existing legislation. They contend that evidence, and HMRC’s own admissions, show that there was a profound failure on HMRC’s part to tackles payroll loan arrangements in the past, something HMRC sought to rectify by pushing for the introduction of a retrospective charge which allows them to seek tax that they are no longer able collect.\nI now ask the Minister whether it is time to reach a compromise by looking properly at some of the recommendations put forward by the APPG. For example, an Independent Review into the Loan Charge led by an experienced tax judge to examine the Loan Charge as a policy, the impact on people, the legal justification and whether it needs to be amended. I am also drawn to the recommendation of the House of Lords Economic Affairs Committee (EAC) for a new ‘Powers Review’ into HMRC to make the organisation more accountable.\nI appreciate that mitigations have been put in place already to simplify payment arrangements, provide long repayment periods and deal with vulnerable people who fear they may have to sell their homes to meet HMRC payment demands. I also understand it has been confirmed that no one will be disadvantaged from benefiting from the published settlement terms if they contact HMRC with a genuine intention to settle before 5 April 2019. Most of the yield from the Loan Charge is expected to come from employers not employees.\nHowever, a deep sense of injustice endures over HMRC’s actions in pursuing this matter. I ask the Minister to listen with care to all that has been said this afternoon and consider with openness and honesty the merit of the APPG’s recommendations and the culpability of HMRC in this debacle.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_myplan/content_16.html": "Our health and wellbeing underpin everything we do in life, whether that’s being able to work, look after your family, or being able to enjoy life to its fullest. When you’re not well, things can grind to a halt.\nThat’s why one of my key aims as your local MP is to improve local healthcare.\nOne of the reasons Hornchurch & Upminster remains an attractive place to live, work and raise a family is that it has a reputation for being one of London’s safest areas.\nHaving great transport links are a vital part of making Hornchurch & Upminster a great place to live, work and raise a family - whether you’re heading across Havering to see family on a bus, driving to work through Gallows Corner, or commuting into central London by train.\nAs one of London’s la",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_bbc-needs-restore-trust-after-huw-edwards-scandal/content_23.html": "Shadow Culture Secretary, Julia Lopez, comments on the pay rise and news of the arrest of BBC presenter, Huw Edwards.\nThe Huw Edwards story is grim, the timing highly damaging to the BBC.\nIn the same week we heard the star presenter had received a £40 000 pay rise despite being off-air for paying a young drug addict for explicit pictures, it was revealed he had then been arrested for possessing child pornography.\nImmediately I saw the two stories, I checked the timelines - had BBC leaders known about the arrest while Edwards collected his inflated wage? What was truly behind his eventual resignation in April beyond ‘medical advice’?\nDirector General, Tim Davie, has since provided some public answers. But questions remain about precisely what the Corporation knew and when; whether salary and pension can be clawed back; and why, once again, the BBC is seemingly unable as an employer to impose consequences for wrongdoing by its major stars.\nThere are questions too about whether Edwards’ poor mental health became a convenient umbrella under which a rain of further scrutiny could be ducked. The plea for empathy certainly rings hollow given Edwards’ own disregard for the vulnerability of others.\nIn this story, however, the BBC has a problem bigger than it might want to admit: trust.\nLike many institutions in recent years - including my own Conservative Party - scandals have undermined public faith in the legitimacy of the BBC’s place in British society. Until now, it has relied on a unique social compact - viewers pay a mandatory licence fee in return for trusted programmes of social, cultural and educational value to our nation.\nThe BBC still relies on that fee for two-thirds of its income. Yet each year, fewer and fewer households pay it. Seen as increasingly anachronistic, the licence fee’s case is being further eroded by a lack of trust that the BBC is truly impartial and trustworthy. Frustration over no-strings mega salaries for its top cadre - many of whose foibles seem to be indulged not challenged - and a perception that wagons are circled when things go wrong only worsens perceptions.\nThis should worry BBC leadership at the best of times. But we are now in the lead up to Charter Renewal - a ten year deal between government and BBC where the future of the licence fee will be set.\nBefore I left government as Media Minister, we were in the middle of a big review of the BBC’s funding model in preparation for Charter Renewal, which will be a huge moment for UK broadcasters, audiences and creators given how rapidly the world is changing around us. Yet Labour Ministers have so far tried to dampen down any idea that the BBC must change too.\nThe irony is that an urgent new demand is emerging for an institution like the BBC in the coming decades. We now live in an age in which information and facts are being blurred with increasing sophistication and intent. The likes of China and Russia are investing heavily in their own broadcasters - and expanding their global operations - as information wars complement physical ones. AI and social media giants are evading broadcasting rules that have traditionally prized the truth. And a sense of our having a shared endeavour as a nation is undermined as audiences get served a narrow diet of content that caters to an individual’s own worldview or offers junk to our children. The BBC could be one of the few tools we have to counter these forces if it makes truth its currency and the core to its legitimacy.\nSince the Second World War, we have understood our country and its values in part through the strength of its great institutions. The BBC has been one of them. But it is not enough simply to will the broadcaster to have a future and expect that to be the case. As the world shifts around us, every institution must go through a process of renewal that provides clarity of purpose and a sense of mission for the coming decades. In that context, how the BBC handles scandals like the Huw Edwards one will become a test by which the public will judge whether it is up to the challenge.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_asking-about-uks-missile-defence-capabilities/content_40.html": "Today Julia Lopez MP asked the Government about the UK's missile defence capabilities following reports from over the weekend about NATO concerns in relation to the UK's missile defence coverage.\nYesterday, local MP Julia Lopez brought the voice of Havering’s hair and beauty industry to the heart of Westminster, leading a passionate debate in Parliament and urging the Government to take swift action to protect high street salons across her constituency from collapse.The debate follows a high",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_cookies/content_12.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_julia-lopez-urges-local-sports-clubs-bid-funding/content_31.html": "Julia Lopez has urged local sports clubs to bid for funding from the Cash4Clubs Fund run by Flutter UKI. Grants of up to £2000 are available for up to 200 community sports clubs across the country.\nThe Member of Parliament has pledged to formally support bids made by sports clubs within the Hornchurch & Upminster constituency as part of her wider campaign to improve sports and leisure in Havering.\nThe grants can be used by clubs to fund improvements to facilities, purchase new equipment and expand participation in sport in their local area.\nOf the 200 clubs to be awarded funding last year, 85% were able to deliver more activities for local people within their area, with 9,000 more people engaging with sport as a result of the funding.\nJulia Lopez said:\n“If you run a sports club in the constituency or know a club which would benefit and would like to apply, get in touch with me and I’d be happy to write a letter in support of your bid.\n“Supporting grassroots sports here in Hornchurch & Upminster is incredibly important and we want as many local people to benefit from everything which sport has to offer.\n“The last Conservative Government aimed to get one million more young people active by 2030 so it’s important we continue to promote great initiatives such as these.”\nThe previous Conservative government recognised the importance of sport as part of a balanced, healthy lifestyle and launched the Get Active strategy which aimed to get 2.5 million more adults and 1 million more children active by 2030. It backed up that ambition with a range of investments in grassroots sport and Havering benefitted from that strategy in several ways:\n- £841,000 to support swimming at the Central Park Leisure Centre via the Swimming Pool Fund, alongside separate support for other pools in the borough.\n- £390,000 to improve tennis courts in Havering, jointly provided by DCMS and the Lawn Tennis Association.\n- £30,000 in investments via the Multi-Sport Grassroots Fund.\nThe campaign forms part of Mrs Lopez’s wider six-point plan to make the Hornchurch & Upminster constituency an amazing place to live, work and raise a family.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_cdn-cgi_l_email-protection/content_20.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_mayor-backtracks-347-bus-breakthrough-mps-campaign/content_18.html": "Hornchurch & Upminster MP, Julia Lopez, has thanked local residents for their help in a successful fight against Sadiq Khan’s bus plans for Upminster and Cranham.\nThe Mayor of London put forward a proposal last year to completely cut the 347 route, withdrawing bus services between Clay Tye Road and Ockendon Road.\nOn hearing the plan, Mrs Lopez wrote to residents along the route to ask them to set out why the 347 is so important to them. Mrs Lopez then used residents’ fantastic feedback to make the case to the Mayor in her consultation response and to express concerns about the overall reductions proposed to other services. Meanwhile, she backed plans for an extended 497 to merge with existing routes in Upminster while calling for it to run more often. GLA Member, Cllr Keith Prince AM, then worked in City Hall to oppose the Mayor’s plan.\nTransport for London has now confirmed that it will continue to operate the route - but under review. Their reply reads:\nRoute 346 – will be restructured to operate between Upminster Park Estate, Waycross Road, and Dagnam Park Square via Upminster and Harold Hill. We will not now install bus driver facilities at Waycross Road. In response to feedback, the restructured route will operate at a higher frequency than that consulted upon and a new Sunday service will be introduced. The route will therefore operate every 20 minutes Monday-Sunday daytimes and evenings\nRoute 347 – will continue to operate under review\nRoute 497 – will be replaced in its entirety by the extended route 346, as described above’\nMrs Lopez is now asking the Mayor to confirm the 347’s future to make sure the good news is not simply a stay of execution. The Upminster MP remains concerned that residents on St. Mary’s Lane (east of Front Lane) and Clay Tye Road still face the possibility that their access to bus services will be removed entirely. For residents in the Cathedral Estate, this could mean that they are forced to walk 600 metres and via an unlit alleyway to access local buses.\nTfL have listened to the community’s feedback that the proposed frequency of services on the revised 346 route was not adequate. TfL now state that the service will operate every 20 minutes, into the evening and with a Sunday service.\nCommenting, Julia Lopez MP said:\n‘Sadiq Khan’s earlier proposals to amend bus routes in Harold Wood and Upminster simply did not reflect a good deal for residents and I am glad that TfL have listened to the feedback given by me, Keith and residents on the frequency of services on the soon to be combined 346/497 route.\nHowever, I am concerned that the Mayor and TfL have still not recognised that, in 2024, it is completely unacceptable to remove Londoners’ access to bus services so I ask them to remove any doubt over the 347’s future. The total removal of access to bus services would serve only to isolate residents or to condemn them further to the pernicious ULEZ expansion. I will continue to oppose this proposal until it is completely withdrawn.’",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_haverings-conservative-mps-condemn-network-rails-tree-clearance-liberty-line/content_39.html": "Andrew Rosindell M.P., Member of Parliament for Romford, and Julia Lopez M.P., Member of Parliament for Hornchurch and Upminster, have expressed their deep frustration and disappointment over Network Rail's recent tree clearance along the Liberty Line, commonly known as the \"push and pull\" line, which serves their communities.\nIn January 2021, following strong campaign efforts from local residents and activists, Network Rail had agreed not to cut down healthy trees unless absolutely necessary for safety reasons or to control the spread of disease. They assured that any vital works would only be completed after engaging and consulting with local residents. However, this commitment has not been honoured, causing significant anger amongst local residents.\nNetwork Rail has admitted that contractors acting on their behalf failed to properly notify residents about the work. Despite Network Rail's promises, Havering’s MPs remain concerned about the recurrence of this situation and the scale of the works. Residents believe that the works have gone further than necessary, resulting in the destruction of healthy trees and habitat.\n\"This is not good enough,\" stated Mr Rosindell and Mrs Lopez, \"as the elected Members of Parliament for both Romford and Hornchurch and Upminster, we are completely on the side of the local community in opposing the removal of trees, unless is it absolutely necessary.\"\nBoth MPs are seeking an urgent meeting with Network Rail to discuss the situation and secure a commitment that such actions will not happen again in the future.\nJoint Statement from Andrew Rosindell M.P. and Julia Lopez M.P.\nAs the Members of Parliament for communities served by the Liberty Line, commonly known as the “push and pull” line, we continue to reflect both our own and our resident’s bitter frustration and disappointment at the lack of notice and scale of Network Rail’s tree clearance from along the line from Romford to Upminster.\nThree years ago, in January 2021, after strong campaign efforts from local residents and activists, supported by us, Network Rail agreed not to cut down healthy trees unless absolutely necessary for safety reasons or to control the spread of disease. They assured us that vital works would only be completed following engagement and consultation with local residents. This has not happened. Network Rail have not been true to their word, which has caused much anger amongst local residents.\nThey have now admitted that contractors acting on their behalf had failed to properly notify residents about the work. However, we remain concerned that this situation was able to happen again, despite Network Rail’s promises, as well as being concerned at the scale of the works. Residents continue to believe that the works have gone further than necessary causing the destruction of healthy trees and habitat.\nThis is not good enough and as the elected Members of Parliament for both Romford and Hornchurch and Upminster, we are completely on the side of the local community in opposing the removal of trees, unless is it absolutely necessary.\nWe are seeking an urgent meeting with Network Rail to discuss this situation and to seek a commitment from them that this will never happen again in the future.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_vital-cystic-fibrosis-drugs-made-available/content_13.html": "Earlier this morning, the Secretary of State for Health and Social Care, Matt Hancock MP, announced that the Government had secured an agreement with Vertex Pharmaceuticals to make available all three of their UK-licenced cystic fibrosis medicines; Orkambi, Symkevi and Kalydeco.\nFor two years, Julia has been pleased to campaign with parliamentary colleagues on behalf of local cystic fibrosis sufferers and their families so that they may access the vital drugs they need. This has been a long process, involving many parliamentary debates, representations to ministers as well as cross-party efforts to the National Institute for Care Excellence (NICE) and Vertex Pharmaceuticals.\nWe are pleased that the Secretary of State has today announced that NHS England have now secured an agreement with Vertex Pharmaceuticals to make available all of their UK-licenced cystic fibrosis medicines: Orkambi, Symkevi and Kalydeco.\nNHS England advise that clinicians will be able to prescribe these medicines, free of charge, within 30 days and that there is no cap on the number of patients that may receive these drugs. We are thrilled that these vital drugs will be made promptly available to those suffering from cystic fibrosis.\nFor a long time, the NHS and NICE have been in negotiations with Vertex Pharmaceuticals regarding the availability of these medicines at a price that represents value to the NHS and in a way that ensures that they can be subject to full NICE appraisal. The Secretary of State said that the deal represents great value for money for the NHS. It also includes a condition that in due course Vertex will also submit its new triple therapy for NICE appraisal, potentially paving the way for further treatments to become available.\nFurther information on this important announcement can be found on the NHS England website using the link below:\nhttps://www.england.nhs.uk/2019/10/nhs-england-concludes-wide-ranging-deal-for-cystic-fibrosis-drugs/\nWe hope that this will bring some relief and comfort regarding the future availability of vital cystic fibrosis medicines to cystic fibrosis sufferers and their families. Please contact us if you or a family member encounter any issues obtaining these medicines as we would be very happy to help resolve them.\nTeam Lopez",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_basketball-uk/content_14.html": "I made the following intervention in a debate tabled by Alex Sobel MP about basketball in the UK.\nJulia Lopez Conservative, Hornchurch and Upminster\nI appreciate the hon. Gentleman’s securing this debate, not least because I wake up every day to the NBA highlights on YouTube as my husband is such a fan. One reason for the great appeal of basketball is that it is a game of the street. That is particularly the case in London, where outdoor courts such as Clapham Common, Turnpike Lane and Bethnal Green can act as a social lubricant for people from all backgrounds. Does the hon. Gentleman therefore agree that we need not just to focus on funding costly leagues and indoor basketball courts, but to get local authorities to fund outdoor courts properly and get proper facilities for people?\nAlex Sobel Labour/Co-operative, Leeds North West\nAbsolutely. I am very grateful for the hon. Lady’s point, because I am not going into great depth about facilities, but we absolutely do need facilities, and I will come to the outdoor game later in my speech.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_setting-independent-trade-remedies-authority/content_19.html": "I attended oral questions to the International Trade Secretary this morning to ask the following question about the pressing need to set up an impartial Trade Remedies Authority when we leave the EU.\nJulia Lopez Conservative, Hornchurch and Upminster\nOne of the new institutions we shall need to set up as we leave the EU is a trade remedies authority. I recently travelled to Canada and the US with the International Trade Committee. They are two countries that have robust trade remedies authorities whose impartiality can be critical in reaching economically sound judgments. What assurances can the Minister offer the House that the UK Government are similarly committed to an independent TRAthat will be free from undue political interference?\nGreg Hands The Minister of State, Department for International Trade\nI congratulate my hon. Friend and the other members of the Committee on their recent visit to the United States and Canada. Those are two of the countries whose trade remedy systems we have studied, along with Australia and, in fact, the European Union system itself. As my hon. Friend says, it is common, although not universal, for the investigation process to be independent of Government, but there is still a political decision at the end of the process by a Minister who is accountable to Parliament. It is worth pointing out, by the way, that all the Opposition parties voted against the creation of the trade remedies authority in the first place.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_campaign-delivered-major-refurbishment-gallows-corner-flyover-begin-imminently/content_22.html": "Transport for London (TfL) has announced that the long-awaited refurbishment of the Gallows Corner flyover will commence on 10 March. This significant infrastructure project, greenlit for funding in 2018 by the Conservative government, is the result of extensive lobbying efforts by Julia Lopez, MP for Hornchurch & Upminster.\nThe Gallows Corner flyover, originally constructed as a temporary structure in the 1970s, has been in urgent need of renewal. The refurbishment will ensure the long-term safety and efficiency of the local transport network, addressing the current speed and weight restrictions that have been in place for several years.\nMrs Lopez and local conservatives have been lobbying to get the project over the line ever since the previous Conservative Transport Minister, Chris Grayling, announced the scheme would get £50m of funding in 2018..\nSince 2018, TfL have explored several potential options for the site and during that period Mrs Lopez has worked with TfL and the Government to ensure the scheme has retained support.\nIn May 2024 the Conservative Transport Secretary, Guy Opperman, approved the outline business case from TfL which all but guaranteed the £58m worth of funding for the scheme.\nSince then, Mrs Lopez has lobbied the new Labour Government persistently to ensure the Government did not cancel the project following their announcement of a capital spending freeze. Now the final business case has been accepted by the Government, with construction due to begin on 10 March.\nIn a statement, Mrs Lopez said:\n\"I am glad to report that the long-awaited refurbishment of the Gallows Corner flyover will start on 10 March. This 'temporary' structure has been in place for over 50 years, and its renewal is crucial to ensure the safety and efficiency of our local transport network. There will be disruption but my fear has always been the greater disruption and chaos of the total closure of the flyover if it was deemed no longer safe – something TfL told us was an imminent risk.\n\"For seven years I have persistently lobbied TfL and Government ministers for this vital project and I look forward to seeing works commence soon. I am grateful for the support we have received from residents and the previous Conservative Government that made the redevelopment possible. I would also like to pay tribute to local Conservative GLA Member, Keith Prince AM, and Havering Conservatives, whose hard work have been vital in making this project a reality.\"\nThe refurbishment project will involve the complete renewal and replacement of the entire structure, except for its foundations. New pedestrian and cycle crossings will be installed, and road markings and resurfacing will be improved to enhance journey time reliability for thousands of people traveling through the area.\nTfL has outlined a phased approach to the works, with lane closures beginning on 10 March and continuing until June 2025. A full closure of the junction is planned from June to September 2025, with overnight lane closures for resurfacing works scheduled from September 2025.\nResidents and commuters are advised to plan ahead and allow extra time for their journeys during the construction period. Full travel advice is available on the TfL website.\nThis major refurbishment project marks a significant milestone in the ongoing efforts to improve the safety and efficiency of the local transport network, ensuring that the Gallows Corner flyover can continue to serve the community for decades to come.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_fighting-better-deal-havering/content_30.html": "Since her election as the Member of Parliament for the Hornchurch & Upminster constituency, Julia has been fighting for a better deal for Havering residents, and more funding for Havering Council to help put it on a sustainable footing. Currently, Julia is campaigning to reform the Local Government Funding Formula. At present, the Formula is not up to date and does not take into account changes to Havering's population, including a huge increase in the number of young people in the Borough. This means that the demand for services currently outstrips the Council's ability to supply them.\nUpdates\n- March 2025 - Julia speaks in a Westminster Hall debate, making clear the need for reform to the Local Government Funding Formula. She highlights the further financial damage done to Havering Council due to the Government's October 2024 budget.\n- March 2025 - Julia updates residents on the work she has been doing with Havering Council and the Government to ease financial pressures on the Borough. The Government grants Havering Exceptional Financial Support, but this is only a temporary measure.\n- January 2025 - Julia helps to secure a meeting with Havering Council's Chief Exec, and the Local Government Finance Minister, Baroness Taylor, once again calling for the Government to look at how the Local Government Funding Formula works.\n- May 2024 - Following her efforts to help Havering secure emergency financial support to help it set a balanced budget, Julia meets with Michael Gove MP, Secretary of State for Local Government, to discuss how to put the Borough on the path to long term financial stability.\n- Late January 2024 - Following multiple meetings with ministers, the Government announces that it will put a £600m funding uplift into local government. Havering will benefit from a share of this funding to help ease pressures on social care.\n- Early January 2024 - Julia meets with the new Local Government Minister, Simon Hoare to discuss the continued financial pressures which Havering Council is under.\n- October 2023 - Julia leads another delegation to meet with Minister Lee Rowley to discuss the Borough's finances following more warnings to the media that it was coming under increasing financial pressure.\n- December 2022 - Julia leads a successful delegation from Havering to meet with Local Government Minister Lee Rowley. Following the meeting with the delegation, Secretary of State Michael Gove MP confirms extra funding for Havering Council.\n- January 2022 - Julia meets with Secretary of State Michael Gove MP to discuss how the Thames Freeport can help provide the funds which Havering Council needs.\n- February 2021 - Julia welcomes news that an extra £1.3bn worth of funding has been provided to London authorities to help deal with the effects of the COVID pandemic.\n- November 2019 - Julia's Parliamentary Team meet with government Minister to lobby for more funding for Havering Council. This comes following Havering Council's decision to introduce new parking charges in the Borough, citing funding pressures as the reason for the change.\n- May 2019 - Julia highlights that more social care programmes could be used to tackle knife crime in the borough if the Local Government Funding Formula was reformed. She speaks about her efforts to lobby the Government to amend the Formula under the Fair Review.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_campaign-banking-hub-constituency/content_28.html": "Julia Lopez, MP for the Hornchurch & Upminster constituency (which includes Harold Wood and Harold Hill), is running a campaign to get a banking hub in the constituency.\nBackground\nOver the last few years, the constituency’s high streets in Hornchurch, Upminster and Harold Hill have seen a number of bank branch closures. The most recent closure saw Barclays shutter their Hornchurch branch in May 2024, prompting disappointment from businesses and residents in the area.\nThis trend is not unique to Havering, with banks closing branches in their thousands over the last ten years with more closures to come.\nHowever, from this trend has emerged the Post Office Banking Hub model. A banking hub provides a location for people to access cash-based services such as withdrawal, deposits and cashing cheques, as well as hosting various major banks on rotation for more complex banking enquiries.\nFollowing correspondence with Hornchurch businesses and residents after the most recent bank branch loss, Mrs Lopez decided to launch a survey on a banking hub within Hornchurch town centre to establish demand. Evidence collected was put to Link UK, the organisation responsible for rolling out the banking hubs.\nMrs Lopez discussed possible locations for a hub, as well as the criteria for a community being eligible for one in the first place. Three locations within the constituency were looked at, including Hornchurch, Harold Hill and Upminster. Unfortunately Link UK said only Upminster currently meets the initial criteria for a potential hub.\nTo be considered for an access to cash assessment, an area must have 70+ retailers within 1km of the high street, have no full-service bank branches and be more than a 15-minute bus ride from the next high street with a bank.\nHornchurch currently has the most coverage by bank branches with several still on the high street and so was deemed ineligible by Link.\nMrs Lopez had lobbied for Harold Hill to be considered as a potential site due to less public transport connectivity and a higher use of physical cash. However, the Hilldene area of Harold Hill still has a full-service bank branch (TSB) and around 40 retailers, so the community is similarly ineligible.\nNow Mrs Lopez is focussing her efforts on securing a hub in Upminster in order to support the high street and wider community.\nWhy does this matter?\nAccess to cash and banking services is vital to many residents and local businesses in the community. From older people who may not be as comfortable using online banking services, to businesses looking to deposit cash or families who use cash to plan household finances, it’s important that people have access to this basic provision.\nHowever, in recent years the high street has come under pressure from online retail, rising energy bills due to the war in Ukraine and the long lasting impacts from the COVID pandemic.\nEnsuring that individuals and businesses have access to good banking services and cash is a key part of helping to keep our high street vibrant and thriving – a banking hub on the high street will be a huge boost to the community.\nAll of this work to support the local high street and businesses forms part of Julia’s six-point plan to make the Hornchurch & Upminster constituency a great place to live, work and raise a family.\nNext Steps\nJulia submitted her survey findings to Link UK in February 2025 and made a formal request for the organisation to carry out an access to cash assessment. Link confirmed they would undertake the assessment within the coming months to see if, upon closer inspection, Upminster would be eligible for a banking hub.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_save-hornchurch-police-station/content_34.html": "Julia Lopez is campaigning with local Conservative activists to stop Mayor of London, Sadiq Khan, selling Hornchurch Police Station, and is calling on residents to back a local petition opposing his plan.\nWith the Government successful meeting its manifesto commitment to recruit 20,000 additional police officers in England and Wales, over 350 officers have been added to the area’s Command Unit. However, in order for those officers to be at their most effective, they need a local base from which they can work and start their shifts closer to the community that they serve.\nMayor Khan revealed his intention to sell Hornchurch Police Station in 2017. Mrs Lopez, worked with local campaigners at the time to prevent the loss of this critical policing base, and with the support of hundreds of residents, secured for Havering Council an option to purchase the station from the Metropolitan Police and lease some of the site back to them, guaranteeing a police presence in the area.\nSince then, progress on implementing this deal has stalled. Mrs Lopez has repeatedly lobbied the Mayor to review his plans but last autumn, he confirmed that he still wants to sell despite new officers needing a base from which to boost neighbourhood policing.\nMrs Lopez believes that the Mayor must think again and has lobbied to the Metropolitan Police Commissioner to ask him to overturn the decision to sell Hornchurch Police Station. Sir Mark Rowley has since confirmed to Havering’s London Assembly Member, Cllr Keith Prince AM, that the sale of Hornchurch is on hold while he reviews the Met’s wider estate strategy.\nMrs Lopez and our London Assembly Member now believe that a clear show of public support will help make the case to keep Hornchurch Police Station in the Met’s hands, and the Hornchurch & Upminster Conservative Association have started a petition so that residents can make their voice heard.\nCampaign updates\n- November 2023 - Julia Lopez writes to Mayor of London and seeks update from Met Commissioner on Estate Strategy Review\n- July 2023 – Julia writes to Mayor seeking confirmation Hornchurch Police Station will be retained after Mayor asks Commissioner to retain Uxbridge Police Station\n- June 2023 – Dedicated Emergency Response Team Patrols in Hornchurch announced\n- April 2023 – Julia meets with Met Commissioner to discuss campaign and present petition\n- March 2023 – Julia Lobbies Met Commissioner for more police resources\n- February 2023 – Julia Lopez calls for more police resources in Hornchurch following spate of knife crime\n- January 2023 – Met Commissioner announces sale of Hornchurch Station has been put on hold while Met’s Estate Strategy is reviewed\n- December 2022 – Julia asks Met Commissioner to retain Hornchurch Police Station\n- Autumn 2022 – Mayor confirms intention to sell Hornchurch Police Station\n- Summer 2022 – Julia asks Mayor to review the sale of Hornchurch Police Station",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk/content_1.html": "LATEST NEWS\nSIGNS UP TO JULIA'S REGULAR E-NEWSLETTER\nSEE WHERE I'VE BEEN WORKING\nMY CAMPAIGNS\nGET IN TOUCH\nWestminster Office\nThe House of Commons, Palace of Westminster, Westminster, London, SW1A 0AA\n0207 219 2631\nConstituency Office\nThe Coach House, 133 Hall Lane, Upminster, RM14 1AL\n0207 219 2631",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news/content_41.html": "MP CALLS ON GOVERNMENT TO STEP IN AND SAVE HIGH STREET SALONS Thursday, 24 April, 2025 Yesterday, local MP Julia Lopez brought the voice of Havering’s hair and beauty industry to the heart of Westminster, leading a passionate debate in Parliament and urging the Government to take swift action to protect high street salons across her constituency from collapse. The debate follows a high-profile visit to Hornchurch from Shadow Chancellor, Mel Stride MP, who joined Julia on a tour of... Local News\nMP BACKS HAVERING FAMILIES OVER GOVERNMENT CUTS TO VITAL ADOPTION SUPPORT 23rd April 2025 Hornchurch & Upminster MP Julia Lopez has sharply criticised the Government’s recent overhaul of a key support fund for adopted children, warning that Hvaering... Articles\nTELEGRAPH ARTICLE: Reeves’s ruinous Budget is now driving female-led firms to the wall 21st April 2025 An unmistakable theme has recently revealed itself in my casework. Countless female business owners have been getting in touch for the first time, in a state of... Articles\nHORNCHURCH MP URGES HAVERING SALONS TO SPEAK OUT AHEAD OF KEY DEBATE 14th April 2025 Hornchurch & Upminster MP Julia Lopez is urging local hair and beauty business owners to share their experiences ahead of a parliamentary debate she has secured... Local News\nHAROLD HILL POST OFFICE TO BE FRANCHISED 14th April 2025 Harold Hill Post Office Saved from Closure After Successful Local Campaign In a win for the Harold Hill community, the directly-managed Post Office branch on... Articles\nMP WRITES TO EDUCATION SECRETARY - URGING GOVERNMENT INTERVENTION TO SAVE EARLY YEARS PROVIDERS 8th April 2025 Julia Lopez, the Member of Parliament for Hornchurch & Upminster, has called on the Government to address the unsustainable pressures facing early years... Local News\nHORNCHURCH & UPMINSTER PUPILS PARTICIPATE IN MP’S DEBATE COMPETITION 4th April 2025 On Friday morning, pupils from local schools across Hornchurch & Upminster took part in the inaugural debating competition hosted by local Member of Parliament... Local News\nHORNCHURCH & UPMINSTER MP CONTINUES CAMPAIGN TO UPGRADE QUEEN’S A&E 3rd April 2025 Julia Lopez, MP for the Hornchurch & Upminster constituency, is continuing her campaign to get a £35 million redevelopment of Queen's A&E as the Romford... Local News\nMP HOSTS CRITICAL MEETING AS HAVERING NURSERIES WARN OF CLOSURES 2nd April 2025 Havering’s nurseries and pre-schools are sounding the alarm over looming fee hikes, job cuts, and closures as new government taxes and childcare policies... Local News\nJULIA LOPEZ CHAMPIONS RESTORATION OF HISTORIC HORNCHURCH BATHHOUSE 31st March 2025 Hornchurch & Upminster MP Backs Funding Bid for Langtons Gardens Refurbishment. In a bid to preserve a cherished Hornchurch cultural landmark, Julia Lopez MP... Local News",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_news_upminster-playground-works-way-after-campaign-students-mp/content_17.html": "Upminster Park playground will be getting an upgrade, thanks to a campaign by Sacred Heart of Mary school girls that was backed by local MP, Julia Lopez.\nVeolia Environmental Trust has now awarded £75 000 to update the play equipment in the popular local park – and make it accessible for children with disabilities.\nMrs Lopez has been supporting the campaign after Class 9L of Sacred Heart of Mary Girls’ School in Upminster invited her to a special class presentation in May. Inspired by a BBC Newsround report, pupils wanted to show the MP the lack of facilities at Upminster Park playground for disabled children. Currently the park has only one piece of equipment for disabled users which is broken and cannot be used.\nMrs Lopez got full square behind the campaign and vowed to raise it immediately with Havering Council. The council went on to bid for Veolia Trust funding, with the Trust writing to Mrs Lopez at the turn of the year to confirm that the campaign has been successful.\nBy installing new accessible equipment, benches and new planters, the funding will create an inclusive space which also supports local biodiversity.\nCommenting, Mrs Lopez said:\n“I’m so pleased to hear that the pupils’ campaign to improve Upminster Park’s play area has been successful! I wanted to show the girls that the right campaigns can genuinely make a difference and improve people’s everyday lives for the better – and that that's what our politics and democracy is about.\n\"These students have had their first win, and they should be so proud of themselves. Every new play experience that a local child gets at Upminster Park – building their strength, skills and sense of adventure – can now be directly attributed to the girls’ campaign.\nMrs Lopez was particularly keen to support the campaign as it chimed with her wider work to improve leisure options in the constituency. She has been working with Upminster Hockey & Cricket Clubs to renovate their pavilion, secured funding for court resurfacing in Harold Wood and swimming pool support in Harold Hill, and has secured the expansion of local woodlands as part of compensation for the Lower Thames Crossing.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_parliament/content_3.html": "Tweet Here you can find Julia's contributions in Parliament as the Member for Hornchurch and Upminster (provided by theyworkforyou):\nNHS England: Redundancy Pay | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, pursuant to the Answer of 3 April 2025 to Question 42886 on NHS England: Redundanc\nAlan Milburn | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, pursuant to the Answer of 23 April 2025 to Question 45093 on Alan Milburn, whether\nCriminal Injuries Compensation - [Dr Andrew Murrison in the Chair] | Westminster Hall debates I thank the hon. Gentleman for tabling an incredibly important debate.\nMetropolitan Police: Finance | Home Office | Written Answers To ask the Secretary of State for the Home Department, pursuant to the Answer of 7 April to Question 43180 on Metropolitan Police: Finance,\nAsylum: Republic of Ireland | Home Office | Written Answers To ask the Secretary of State for the Home Department, how many asylum seekers have been sent from the Republic of Ireland to the United Kin\nWinter Fuel Payment | Department for Work and Pensions | Written Answers To ask the Secretary of State for Work and Pensions, what the cost to the public purse was of correspondence to inform pensioners about chan\nHair and Beauty Sector: Government Policy | Westminster Hall debates I thank every colleague who has spoken so passionately on behalf of their local businesses and the local people who run them.\nHair and Beauty Sector: Government Policy | Westminster Hall debates I thank every colleague who has spoken so passionately on behalf of their local businesses and the local people who run them.\nHair and Beauty Sector: Government Policy | Westminster Hall debates That is precisely one of the issues I wish to highlight in today’s debate.\nHair and Beauty Sector: Government Policy | Westminster Hall debates I thank my right hon. Friend for that important intervention.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_improving-education-here-havering/content_32.html": "One of the cornerstones of a happy, healthy and successful life is having access to a great education. A high-quality education makes all the difference to the prospects of young people living in our area.\nOne of the great achievements of successive Conservative Governments has been 14 years of rising education standards, meaning children here in the UK benefit from a world leading education. I’m determined to make sure that residents throughout our constituency benefit from these rising standards.\nWhat I’m campaigning on:\n- One of the big challenges towards the end of a young person’s education is transitioning into the world of work. That’s why I’m working on providing a link between employers and young people in our area such as my previous virtual apprenticeships fair, as well as inviting schools to my larger jobs and skills fairs.\n- One of the best bits of my constituency diary are visits to local schools. I’m always speaking to teachers and pupils to see how I can help support them as their local Member of Parliament and champion their causes.\nWhat we’ve achieved so far:\n- By 2024, 36/37 of the schools in the Hornchurch & Upminster constituency were rated Good or Outstanding by Ofsted. Since being the MP for our area I have visited all of our schools to offer my support.\n- A big part of having a good start in life is ensuring that families have good childcare support around the school day. That’s why in 2023, I lobbied the Chancellor for more childcare support for those with young families, which we secured.\n- In 2019, I campaigned for more post-16 education funding in Havering to address budget challenges faced by schools and colleges. I was delighted when the then Chancellor, Sajid Javid, announced an additional £400m for further education in the UK.\n- In 2023, I welcomed the Conservative Government’s decision to award Havering Sixth Form College a £4m grant for a new teaching block. This has opened up more post-16 education spaces in our borough for young people.\n- Ensuring that children with special educational needs get the right support is absolutely vital, and back in 2019 many local schools highlighted the financial pressures on SEN services. After lobbying the Department for Education, we helped to secure approx. £611k for SEN services here in Havering.\n- I supported local schools to access the Government’s Condition Improvement Fund, with 30 schools receiving grant support from the Conservative Government in the last two Parliaments. This means that our schools have the facilities they need to keep doing well. Read about some of them here.\n- Following the pandemic and the Russian invasion of Ukraine, schools faced continued pressures on their budgets, especially with their energy bills. I welcomed the Conservative Government’s extra funding to support schools with these bills in 2022, meaning they could keep spending their money on education.",
  "https_www_julialopez_co_uk_/https_www_julialopez_co_uk_campaigns_help-high-streets-and-local-businesses/content_36.html": "Small businesses and high streets are the lifeblood of our community. The constituency is blessed with several vibrant high streets and countless amazing local businesses which make it an amazing place to live.\nHowever, in recent years our brick and mortar businesses have come under pressure from different sources. Whether it’s the rise of internet shopping with large online retailers taking away trade from traditional shops, rising energy bills due to the war in Ukraine, or the long-lasting impacts of the pandemic, our high streets have a lot to contend with.\nThat’s why I’m determined to support local businesses and our high streets in any way that I can to make sure they continue to thrive for years to come.\nWhat I’m campaigning on:\n- Over the last few years, we’ve lost a number of bank branches from our high streets. Having access to in-person banking is vital for businesses which deal in cash, as well as those residents who may not have access to mobile banking. That’s why I’m campaigning for a banking hub in the constituency. Find out more.\n- I'm currently running a small business survey so that I can continue to speak up for the issues which are most important to the small businesses in the constituency. You can take the survey here.\n- I'm campaigning to save the Harold Hill Post Office branch from potential closure as I think it would be a hammer blow to the high street. Sign my petition calling for it to remain open here.\n- Much like in person banking, hairdressers and barbers play an important role in supporting our local high streets, with people often popping into other nearby shops. Recently, I looked to recognise our amazing barbers and hairdressers for the work that they do. Find out more here.\n- I’m always visiting local businesses to see the work they do and hear about how I can support them as their Member of Parliament. Get in touch with me if I can support your work.\nWhat we’ve achieved:\n- Business rates are one of the big costs which put high street businesses at a disadvantage compared to those operating online. That’s why I was proud to support the Conservative Government’s efforts to reduce business rates for smaller companies.\n- During my time as an MP, I’ve hosted numerous Job, Skills and Apprenticeship fairs. in Hornchurch & Harold Hill. Hosting these fairs has helped local people find their next opportunity, as well as helping businesses find the right staff in a tough labour market.\n- For our high street to thrive, it’s important that we tackle crime targeted at those businesses. That’s why I’ve worked closely with retailers and the police on the ‘Clear, Hold, Build’ scheme as well as supporting tougher laws to protect those working in shops.\n- One of the main ways I can help a business as an MP is helping them understand changes in the law which may affect them. For example, in 2024 we got Conservative Party Chairman, Richard Holden MP, to do a budget briefing for local companies.\n- Following the COVID-19 pandemic, in early 2021 I worked with the Government to secure £231k from the Welcome Back Fund to help businesses and high streets bounce back after lockdown.\n- In 2020, I was successful in getting Havering Council to provide free Sunday parking, 30 minutes of free street parking, and 20% off for those using the Havering Parking App, providing an important boost to our high streets and shops. Find out more."
}