{
  "https_newcastleupontyne_greenparty_org_uk_/https_newcastleupontyne_greenparty_org_uk_about-us/content_2.html": "Meet the Team\nThe Green Party is rapidly expanding. We proudly represent citizens in Westminster, a record number of local councils, the London Assembly, and now, significantly, in Newcastle.\nWe are thrilled to announce the election of our first two Green councillors in Newcastle. Their presence in the council chamber is a critical step towards addressing the pressing issues that have long been overlooked by the established parties.\nOur commitment to Newcastle goes beyond electoral success; we are actively engaged in local issues to enhance the lives of all residents and to improve our local environment. As part of the Green Party of England & Wales, we stand for social and environmental justice, a commitment reflected in our national policies. We believe that striving for fairness is essential.\nWe operate on the power of the people, not corporate finance. Join us today, and help us achieve even more for Newcastle.\nNewcastle Green Party’s manifesto “Greenprint” aims to address the pressing issues facing the residents of Newcastle upon Tyne. While the city council has taken steps to address climate change, more urgent action is needed. The Green Party’s vision is to make the city greener and fairer for all, and to raise the standard of living.\nThis manifesto outlines a “Green New Deal” for Newcastle, which includes policies and initiatives to tackle the climate and ecological crises, the cost of living crisis, and social inequalities. By electing Green Party councillors, the people of Newcastle can ensure that local issues, social justice, and the environment are at the heart of all decisions made by the council",
  "https_newcastleupontyne_greenparty_org_uk_/https_newcastleupontyne_greenparty_org_uk/content_1.html": "Championing a Greener, Fairer Future for Newcastle\nWe are dedicated to making Newcastle a more sustainable, equitable, and vibrant place to live. Our commitment to environmental justice, social equity, and community empowerment drives everything we do.\nOur Vision\nOur vision for Newcastle is outlined in the Newcastle Green Print, a comprehensive plan to transform our city into a beacon of sustainability and social justice. Imagine a Newcastle where the air is clean, the streets are safe, and everyone has access to affordable, energy-efficient housing. A city where local businesses thrive, green spaces are protected, and public transport is both reliable and eco-friendly. This is the future we are working towards.\nMeet your Green Representatives\nWe are thrilled to introduce our two new local councillors in Newcastle, Nick Hartley and Khaled Musharraf. They are committed to representing your interests and driving positive change in our community.",
  "https_newcastleupontyne_greenparty_org_uk_/https_newcastleupontyne_greenparty_org_uk_get-involved-in-the-local-campaign/content_4.html": "Meetings and policy discussions\nNewcastle upon Tyne Green Party holds regular meetings, which combine bottom-up democracy with discussions on key policy issues. Members will receive notice of meetings by email: if any non-member supporters would like to join us for our policy discussions, please contact us for information on when we meet and what discussions are on the agenda.",
  "https_newcastleupontyne_greenparty_org_uk_/https_newcastleupontyne_greenparty_org_uk_donate/content_3.html": "Donations\nNewcastle Green Party members are hard at work all year round, holding the council to account and canvassing for support in elections. With 2 councillors now on the council, our capacity to influence and advocate for environmental and community issues is stronger than ever. However, effectively delivering our message still requires substantial resources.\nThe Newcastle Green Party relies on small regular donations from our members and supporters to ensure our voice is heard throughout the city. The ongoing climate emergency and the council’s responses to it underline the critical need for strong Green representation. Our councillors are there to ask the difficult questions and to hold the council accountable to their promises.\nYOUR CASH could be the pivotal contribution that takes our campaign to the next level.\nTHANK YOU! Lee Irving Treasurer\nP.S. We also need more volunteers out speaking to residents and delivering our newsletters, to make sure we get the Green Party’s message across to every voter in Newcastle. For more information of ways you can help, please see our Get Involved page."
}