{
  "https_alisontaylor_org_uk/https_alisontaylor_org_uk/content_1.html": "My name is Alison Taylor and it is the honour of my life to be elected as Scottish Labour Member of Parliament for Paisley & Renfrewshire North.\nAs your Member of Parliament I will be helping influence what happens here in this diverse seat which hugs the River Clyde from Langbank to Glasgow and takes in two colleges, a university, an international airport and a vast industrial hinterland – so much untapped potential and infrastructure that requires capital investment, regeneration and as we transition to a greener future de-carbonisation.\n“We need to rebuild our county together. Labour will deliver opportunities for all by growing the economy and creating a new green energy company headquartered here in Scotland creating jobs and bringing down energy bills.”\nMy promises to you\n- We will manage better the transition to green energy and net zero technologies of tomorrow.\n- I will use my 30 years as a chartered surveyor and in leadership roles to bring my life experiences and team building skills to the role so I can help deliver new opportunities for investment in our town centres, public transport and infrastructure. I will be a strong voice for Scotland at Westminster.\n- I am proud to call this area my home, having worked and gone to school in Glasgow and graduated from university in Paisley in Land Economics before becoming a Fellow of the Royal Institution of Chartered Surveyors.\nI promise to be a hard working constituency based MP fighting for these communities. I will hold surgeries throughout the seat. I am still in the process of setting up my office in the constituency and will publish details of surgeries shortly, until then please use the contact details below.\n“I raised my family here and this area will always mean everything to me.”\nGetting in touch\nI am currently in the process of setting up my Constituency Office. Over the next couple of weeks you can still get in touch by email and phone.\nI can only provide support to people who live in the constituency covered by Paisley and Renfrewshire North (PRN).\nAlison\nCall Alison on 0141 319 8914\nFrom my Mum’s (on deckchair) Family Album\nLike our campaign on Facebook | Follow Alison on X (formerly Twitter)\nFollow Alison on LinkedIn | Call Alison: 0141 319 8914\nPromoted by Alison Taylor.\nAt India of Inchinnan, Greenock Rd, Inchinnan, Renfrewshire. PA4 9LF.",
  "https_alisontaylor_org_uk/https_alisontaylor_org_uk_press-releases/content_2.html": "Skip to content\nAlison Taylor\nScottish Labour Member of Parliament – Paisley and Renfrewshire North\nHome\nCampaign photos\nPress releases\nMenu\nPress releases\nRenfrew Gala Day 2nd June 2024\nRenfrewshire Gazette",
  "https_alisontaylor_org_uk/https_alisontaylor_org_uk_campaign-photos/content_4.html": "Campaign photos Renfrew Gala Day 2nd June 2024 Supporting Westway Business Park, Renfrew On the campaign trail in Renfrewshire Battle Bus Paisley 21 June Rachel Reeves visit, Cardonald Glasgow25 June",
  "https_alisontaylor_org_uk/https_alisontaylor_org_uk_cdn-cgi_l_email-protection/content_3.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}