{
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_news_category_Speeches-in-Parliament/content_7.html": "Speech from Sir John Hayes MP (January 15): Women’s Changed State Pension Age: Compensation 17th January 2025 That this House has considered compensation for women affected by changes to the State Pension age. \"The genesis of betrayal is trust—the kind of trust that... Speeches in Parliament\nBudget Speech - November 4th 2024 7th November 2024 Aristotle said that the state exists to advance the wellbeing of its members; a state that fails to advance its people’s wellbeing is not merely a state that... Speeches in Parliament",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_news_sir-john-hayes-mp-supports-ms-awareness-week/content_2.html": "Sir John recently met with people affected by MS to hear about the challenges they are facing – from support in the workplace and accessing benefits to receiving vital treatment and care on the NHS.\nMore than 150,000 people live with MS in the UK, including an estimated 1,691 people in South Holland and The Deepings.\nThe condition affects the brain and spinal cord, impacting how people move, think and feel. Symptoms are different for everyone and often invisible, but once diagnosed, MS is a lifelong condition that can worsen over time.\nMany people with MS rely on disability benefits such as Personal Independence Payment (PIP) to help with the extra costs of their condition – including paying for carers to assist with essential daily tasks.\nSir John Hayes MP said: “I’m proud to join the MS Society in speaking up for those suffering from MS. Working in collaboration with the charity, I look forward to drawing attention to the challenges that people with MS face and calling for this Labour Government to reverse the cuts to the disability benefits which those living with MS rely on.”\nFor any questions, please contact Helen Davies on 01775 711534 or [email protected]",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk/content_1.html": "Latest News\nSouth Holland & The Deepings\nAm I your candidate?\nEnter your postcode\nThe Rt Hon Sir John Hayes CBE MP is the Conservative Member of Parliament for South Holland and The Deepings. Sir John was first elected in 1997, and subsequently re-elected seven times.",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_about-rss/content_5.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_news_category_European-News/content_8.html": "Hayes in the House - The Need for Peace 23rd February 2025 The war in Ukraine stands as an egregious testament to mankind's capacity for destruction. The conflict, imposed on Ukraine by Russia, savage in its execution... European News",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_news_keep-elgin-marbles-britain/content_4.html": "Sir John Hayes MP speaks in a Westminster Hall debate on Wednesday 30 April 2025, arguing against the return of the Elgin Marbles to Greece and making the case for keeping them in the British Museum.\nSir John Hayes MP speaks in a Westminster Hall debate on Wednesday 30 April 2025, arguing against the return of the Elgin Marbles to Greece and making the case for keeping them in the British Museum.",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_about-sir-john-hayes-mp/content_6.html": "The Rt. Hon. Sir John Hayes CBE M.P. was first elected to Parliament in 1997.\nSir John studied at the University of Nottingham for BA (Hons) degree in Politics, followed by a PGCE. He has subsequently been appointed as a Visiting Professor at the University of Bolton, and been awarded a Post-Graduate Certificate in Philosophy from the University of Cambridge.\nFollowing a successful career in business, Sir John was elected to represent the seat of South Holland and the Deepings as its Member of Parliament in 1997, and has subsequently been re-elected seven times. He served in Government as Minister of State for Further Education, Skills and Lifelong Learning; Minister of State for Energy; Minister of State for Security; Minister of State for Transport; and Minister of State at the Cabinet Office when he was also the Senior Parliamentary Adviser to the Prime Minister.\nSir John is the Chairman of the Common Sense Group of Conservative Members of Parliament, the President of the New Conservatives, a member of the Parliamentary Intelligence and Security Committee.\nSir John Hayes was appointed to the Privy Council in 2013, awarded a CBE in 2016 and a made a Knight by Her Majesty Queen Elizabeth II in 2018.",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_news_category_Articles/content_3.html": "Back Britain by Buying British 26th April 2025 In the rapidly shifting global political landscape, one enduring certainty is ever clearer: national economic security means putting Britain first. To do so, in... Articles\nHayes in the House - Strength in our Conviction 21st April 2025 As we celebrated Easter, Christians in the Middle East — the birthplace of the Son of God — were enduring relentless persecution and violence. Yet, despite the... Articles\nJohn Hayes Backs Parkinson’s UK on World Parkinson’s Day 11th April 2025 Sir John Hayes Backs Parkinson’s UK on World Parkinson’s Day Sir John Hayes MP has reaffirmed his support for people living with Parkinson’s by attending a... Articles",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_parliament/content_9.html": "Tweet Here, you can see Sir John's recent speeches and appearances in Parliament (provided by theyworkforyou):\nOfqual: Apprentices | Department for Education | Written Answers To ask the Secretary of State for Education, whether Ofqual has offered apprenticeships in each year since 2010.\nEducation and Skills Funding Agency: Apprentices | Department for Education | Written Answers To ask the Secretary of State for Education, whether the Education and Skills Funding Agency has offered apprenticeships in each year since\nGender Incongruence: Puberty Suppressing Hormones | Westminster Hall debates Will the Minister give way?\nGender Incongruence: Puberty Suppressing Hormones | Westminster Hall debates Might my hon. Friend add to her list of questions and ask about the experience of other countries that have looked at these matters?\nGender Incongruence: Puberty Suppressing Hormones | Westminster Hall debates It is a pleasure to serve under your chairmanship, Ms Lewell, and I am grateful to my hon.\nWater Companies: China | Department for Environment, Food and Rural Affairs | Written Answers To ask the Secretary of State for Environment, Food and Rural Affairs, what estimate his Department has made of the level of funds invested\nActive Travel: Apprentices | Department for Transport | Written Answers To ask the Secretary of State for Transport, whether Active Travel England has offered apprenticeships in each year since it was set up.\nDriving Tests: East Midlands | Department for Transport | Written Answers To ask the Secretary of State for Transport, what the average waiting time is for a practical driving test in (a) Lincolnshire and (b) the E",
  "https_www_johnhayes_uk_/https_www_johnhayes_uk_cdn-cgi_l_email-protection/content_10.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}