{
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_category_Speeches-in-Parliament/content_30.html": "Westminster Hall debate on the impact of digital landlines 1st April 2025 Damian led a debate on the impact of digital landlines on rural communities in Westminster Hall. During the debate, Damian said: \"My focus today is not just on... Speeches in Parliament\nDamian speaks at the second reading of the IfATE Bill 25th February 2025 Damian raised his concerns about the IfATE Bill during the second reading debate. The Bill will, if enacted, transfer the functions of the Institute for... Speeches in Parliament\nDebate on the Non Domestic Rating (Multipliers and Private Schools) Bill - Remaining Stages (part 2) 15th January 2025 In the debate, Damian continued to express his opposition to the principle of taxing education. Speaking at the time, Damian said: \" On top of VAT and NI, many... Speeches in Parliament\nDebate on Non Domestic Rating Bill - Remaining Stages (part 1) 15th January 2025 Damian spoke at the Remaining Stages debate of the Non Domestic Rating (Multipliers and Private Schools' Bill. Damian said at the time: \" Business Rates... Speeches in Parliament\nChildren's Wellbeing and Schools Bill 2025 - Second Reading 9th January 2025 Damian speaking in Parliament during the second reading of the Schools Bill, raising his concerns that the Bill in its current form threatens to undermine the... Speeches in Parliament\nWestminster Hall debate on Apprenticeships and T Levels 20th November 2024 Damian secured a Westminster Hall debate on apprenticeships and T Levels and the government's decision to replace the Institute for Apprenticeships and... Speeches in Parliament\nOpposition Day Debate - education 8th October 2024 On 8 October 2024 Damian opened the Opposition Day Debate on VAT on independent schools. The full debate can be viewed here: Parliamentlive.tv - House of... Speeches in Parliament\nDamian asks an Urgent Question on OfStEd reforms 2nd September 2024 Damian raised an Urgent Question today in response to the Government's proposed reforms to OfStEd. Damian said: \"I’m grateful to the Speaker for granting me an... Speeches in Parliament\nAdjournment debate on allergy guidance in schools 21st May 2024 Damian speaking at an adjournment debate on allergy guidance in schools following the tragic case of five year old Benedict Blythe who died from an anaphylactic... Speeches in Parliament",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_sheep-and-livestock-worrying-remains-issue/content_58.html": "The article below was written by Damian and published in this week's editions of the Herald and Petersfield Post:\n\"Our love of pets, and of dogs in particular, is very much part of the British culture and way of life, and ownership of pets has certainly increased as people have spent more time at home during the pandemic.\nBut even the most considerate and well-meaning dog owner can fail to control their pets when out walking in the countryside, perhaps believing their pet incapable of harming livestock or that it would return when called.\nSadly we have seen an increase in dog attacks on sheep and other livestock, and the impact this has on the emotional and financial well-being of farmers, as well as of course the distress and damage to the animals themselves is significant.\nThis is I know a very real issue for farmers and landowners across East Hampshire and many other rural areas.\nLocal shepherdess Terena Plowright continues to lead a community response through the Sheep Watch UK organisation she formed, and I was pleased to support the conference she organised a few years ago to raise awareness of the issue and to promote steps that can be taken to address it.\nUnfortunately the trend continues, with figures from the NFU showing the number of dog attacks on farm animals rising by an estimated 50 per cent during the first quarter of 2021. and it is right that further action is taken to address this.\nThe UK has a world-leading record on animal welfare, and over the last decade the Government has introduced a range of measures to ensure animals are offered the care, respect and protection they deserve.\nThis includes raising the maximum custodial penalty for animal cruelty offences from six months to five years, and the decision to formally recognise animals as sentient beings in domestic law.\nAnd in June this year, new measures to crack down on livestock worrying were introduced in England and Wales through the Kept Animals Bill, seeking to update existing legislation that dates back to 1953.\nThe improved powers enable the police to respond to livestock worrying incidents more effectively - making it easier for them to collect evidence and, in the most serious cases, seize and detain dogs to reduce the risk of further incidents.\nBut there has been a call for more to be done, and I was pleased to support the Ten Minute Rule Bill presented in Parliament in July by Virginia Crosbie MP, which aims to build on the measures already announced.\nEducation remain important too, as some pet owners remain unaware that their pets are capable of injuring livestock. Even if a dog doesn’t make physical contact, the distress and trauma of the chase can cause sheep to die or miscarry, with other incidents leading to sheep drowning in rivers, falling from cliffs or getting trapped in fencing.\nA new and refreshed version of the Countryside Code was launched in the spring this year – the first in over a decade – aiming to help people enjoy the outdoors in a safe and respectful way.\nThe advice highlights the need to keep pets under control, to stay on footpaths and not to feed livestock, horses or wild animals. It also makes clear that the code applies to all natural places, including parks and waterways, coast and countryside.\nThere is much we can do to prevent the suffering caused to animals and the anxiety inflicted on farmers, by being more aware but also being prepared to act when necessary to ensure our pets remain under control when near to livestock.\"",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_damian-appears-justice-select-committee/content_22.html": "This week Damian appeared before the Justice Select Committee to take questions on community sentencing.\nParliamentlive.tv - Justice and Home Affairs Committee\nThis week Damian appeared before the Justice Select Committee to take questions on community sentencing.\nParliamentlive.tv - Justice and Home Affairs Committee",
  "https_www_damianhinds_com_/https_www_damianhinds_com_campaigns_understanding-analogue-switch/content_65.html": "The UK's old analogue landline network (otherwise known as PSTN) is being switched off in 2027. What this means is that all devices that currently rely on the PSTN - landlines, care alarms, security alarms, and some basic broadband packages - will need to be moved to a digital connection. We have been working to understand the implications of the switch over to digital and what practical steps people living in East Hampshire will need to take so that they are fully prepared for the change.\nWe know that some constituents are very concerned about losing their landline and moving to a digital option, particularly those that are subject to frequent power cuts that can last hours, sometimes days (the digital handsets do not work without power). We also know that some constituents have been automatically moved onto a digital contract when their old landline contract has come to an end, sometimes against their wishes. Clearly, there are a number of issues that still need to be resolved.\nIn February 2025, Damian wrote to the Secretary of State at the Department for Science, Innovation and Technology (the department that has the lead responsibility for the telecomms and broadband sector) to urge him to put better protections in place for those individuals that are currently landline dependent, many of whom live in rural locations such as East Hampshire. The letter can be found below.\nIf you are concerned about losing your landline, please do get in touch - [email protected]\nTo help you understand what this all means, we've provided some basic information below:\nCommonly used terms\nPublic Switched Telephone Network (PSTN) – this is the traditional telephone network using copper wires.\nVoice over Internet Protocol (VoIP) – this is the method of delivering/receiving voice calls using the internet (also known as 'digital landlines' and 'digital voice')\nFTTP – stands for Fibre to the Premises and is ultrafast full fibre broadband. This method uses fibre optic cables to carry broadband directly from the telephone exchange to your property.\nFTTC – stands for Fibre to Cabinet and is superfast broadband. This method of delivering broadband uses copper wires.\nProject Gigabit - This is the government’s £5 billion programme to provide ultrafast broadband to homes that are not currently within the upgrade plans of the main commercial providers e.g. Sky, Virgin Media etc. This is particularly important for the more rural parts of the community, which are less likely to be covered by commercial providers. Project Gigabit also runs the voucher scheme whereby local residents can apply for government vouchers to fund broadband improvements if they're currently struggling with slow speeds.\nCityFibre were awarded a contract by the government (Building Digitial UK or BDUK for short) to provide ultra fast fibre to 70,000 homes in Hampshire. We are currently awaiting the full list of postcodes that will fall within this contract as well as a timetable for implementation (we are hoping to receive this before the end of 2024).\nThere is some useful background information about the transition here.\nFrequently asked questions\nWhat is the analogue switch off and why is it happening?\nOver the next few years the way our landlines work is going to change. We currently rely on the PSTN to make and receive calls, but this method will be retired and changed to VoIP as the copper lines are becoming too difficult and expensive to maintain. Also, as the way we receive broadband continues to shift to fibre optic cables, the copper lines are becoming redundant. This change will affect the whole of the UK.\nFor most people, the switch to digital will be carried out entirely by Openreach and current broadband suppliers, with little or no involvement from consumers.\nWhen will the PSTN be switched off?\nThe change is expected to be completed by January 2027. Openreach announced their intention to retire the PSTN in 2017. The rollout of BT’s Digital Voice (a new phone service using VoIP) began in 2021 but was paused last year to allow for more time to figure out how to support customers who rely more heavily on landlines (and following a number of problems with migrating individuals with telecare alarms to digital landlines). The deadline for switching off the PSTN has now been extended to January 2027 so that those who need greater assistance in making the switch, including individuals with 'telecare' alarms, have longer to do so.\nWhat is the government’s role in this?\nThe switch off is entirely industry-led and had not required legislative action from the government. Ofcom are regulating the switch off to ensure the transition is not disruptive and so that vulnerable customers are protected. However, the switch to digital relies on homes having a reliable broadband connection and decent mobile phone signal (more on that below). The government’s role in this is assisting with the rollout of ultrafast fibre broadband to hard-to-reach areas through Project Gigabit.\nWill this cost me anything?\nThe pricing for VoIP services is a commercial matter but BT and Virgin Media have both said that customers will not have to pay more for their digital landline service when the switch off happens.\nAny back-up equipment or adaptations to existing equipment that you may require should be provided free of charge by your provider. It's best to contact your provider to find out.\nWill I need to purchase broadband connection?\nOfcom reports that around 3% of households used landline only services in 2018. VoIP will require a good internet connection to work and the higher the speed of the broadband, the better the quality of calls will be. However, it will not be essential to have FTTP; VoIP will work using superfast broadband (FFTC). If you don’t currently have a broadband connection, your provider should supply one to you specifically to support the digital landline service. This shouldn’t cost any more if the broadband connection is to support your landline only. This is because the speed of your broadband will not need to be as fast for voice calls as it would need to be for general broadband use.\nFor those individuals not wanting (or able) to have a new broadband connection, BT will be introducing a new dedicated landline for anybody without broadband in their home. This will not require any in-home changes at all, and it will continue to provide a powered phone line. This is an interim measure until 2030 and will start to become available by the end of 2024. It is likely that other phone providers will follow suit.\nWill I get to keep my current handset and telephone number?\nYes. If you would still like to keep a landline you can keep your current handset and in most cases you will be able to keep your number. Your existing handset will need to be plugged directly into your router for VoIP to work. Your provider should supply you with an adapter for your handset if you cannot plug it directly into your router.\nIf you use cordless phones in your home, you will need only one adapter. If you use traditional corded phones, you will need an adapter for each phone.\nWhy do landlines using the PSTN work during a power cut but those using VoIP won’t?\nA traditional analogue phone works during a power cut because the PSTN uses power from the local telephone exchange, which has a back up generator. Telephone exchanges also tend to be underground and not as susceptible to extreme weather as exposed power lines.\nWhen the switch over takes place, your digital landline will no longer work in a power cut and nor will any devices connected to it e.g. medical emergency alarms. This is because for VoIP to work, there must be an internet connection provided by a router. A router requires mains power to work. This is why it will be important to ensure that there is a good mobile signal across the whole of East Hampshire before the analogue line is switched off.\nWhat is being done to help people who rely on their landlines?\nIndividuals who are dependent on a landline (such as those who do not have a mobile phone) will be offered a back up solution so that they can contact emergency services during a power cut. This is a requirement set by Ofcom. This solution could be a battery back-up unit for the digital landline phone or a mobile phone or 'hybrid' phone if you do not already have a mobile. There are a number of phone operators, for example Virgin Media O2, who already offer emergency back up lines to their customers with a full charge lasting approximately eight hours. This device has a SIM card inside and is connected to the router and phone, so if there is disruption to power, the device will activate and the customer can continue to use their home phone to contact emergency services (this solution though relies on a good mobile signal to work). Obviously, in areas where there is little or no network coverage, any kind of mobile or hybrid phone is not going to work as an emergency back up phone. This is an area that Damian continues to campaign about.\nSee Virgin Media O2's and BT's latest guides for consumers below.\nWhat if my mobile phone does not have reliable network?\nThis is a crucial issue that is critical to the success of the switch over to digital. It's well documented that there are parts of East Hampshire, and indeed other rural parts of the country, where mobile phone coverage is patchy at best and certainly not reliable. The mobile phone operators have plans over the next few years to upgrade existing masts in East Hampshire to improve 4G and 5G coverage. The old 3G network has been switched off although, importantly, the 2G network will continue for another 10 years (2G carries calls and texts).\nIt's worth remembering that in the event of an emergency, you can dial 999 from your mobile phone and it will connect to the best signal locally (even if this isn't your own mobile phone provider).\nDamian continues to raise this matter with mobile phone providers to find out what else can be done to improve the signal across the constituency. He has met with Vodafone, BT EE and Virgin Media O2 to understand their plans to upgrade their mast signals in the constituency (including their collective work on the shared rural network - see below) as well as how they will be supporting their customers as they move them over to VOIP. There is a very real possibility, though, that improvements to the mobile phone network will not be in place before the landline is switched off in 2027 - potentially leaving many individuals digitally 'marooned'.\nVirgin Media O2 estimate that half of the population will have 5G by the end of 2024.\nWhat other equipment relies on the PSTN?\nOther devices, such as telecare medical devices, security alarms, CCTV and traffic lights, all rely on the PSTN. The government is working with relevant sectors to ensure customers and providers of these devices are prepared. For instance, the Department for Health and Social Care published a telecare stakeholder action plan.\nThe government published new guidance on 19 November 2024 to protect elderly people relying on personal alarms during the switch over from analogue to digital landlines. This means that an engineer will need to physically visit a vulnerable customer to test that the alarm is working on the digital network before giving it the green light. More information here:\nIf you are at all concerned, it's worth contacting the manufacturer of your device to see how they can support you during the switch to VOIP.\nSome companies encourage vulnerable customers to register for extra support in the event of an emergency. For example, the electricity provider, SSEN, has a priority services register to identify customers who may need additional help during a prolonged power cut. e.g. by providing back up power for those customers reliant on medical equipment. It's worth registering now for these services.\nWhat is the Shared Rural Network?\nThis was introduced to try and eliminate the number of partial and total 'not spots' in rural areas by encouraging providers to share mast infrastructure. Partial 'not spots' are areas where mobile signal is available from just one mobile phone provider. Total 'not spots' are areas where there is no signal at all. By using existing infrastructure or sharing new infrastructure, the signal for all mobile customers should be improved. The impact on the local environment is also reduced by fewer masts needing to be erected in the countryside. The network is a funding partnership between the providers and government, which aims to get 4G to 95% of the UK.\nI currently have FTTC broadband (and it doesn't look like my area will be upgraded to ultrafast broadband by 2025), will my broadband still work once the analogue line is switched off?\nYes. VoIP services can be provided using any broadband technology, including existing FTTC - this uses copper wires to carry signals from cabinets (normally positioned somewhere on your road) to your house. These are the same copper wires that are used for PSTN landlines but switching off the analogue signal will not affect the broadband connection.\nDo I need to do anything ahead of these changes?\nWhen it is time for the switch to happen, you should be contacted by your provider and, at this point, you should talk to your provider about your needs and how this change will affect you. For most people, this change will all be carried out by the provider with little disruption to you.\nOfcom recommends that customers start talking to their provider now if they:\n- have other devices which rely on the PSTN;\n- would be unable to access emergency services in the event of a power cut (for instance, if they do not have a mobile phone or a reliable mobile signal): and/or\n- have a disability or any other needs that will require assistance with installation.\nOfcom has stated that service providers should seek to identify customers who rely on other devices that use PSTN.\nBelow are a few of the industry guides on the transition to digital voice. It's worth looking at the website of your mobile phone provider for more information, particularly if you are a vulnerable customer.\nVodafone's guide can be found here: Your landline is changing: Everything you need to know",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_chancellor-faces-bleak-road-ahead/content_33.html": "Whilst spring may have sprung outside, the mood in the Chamber following the Chancellor’s financial statement this week was anything but sunny.\nAn unwelcome headline from the Spring Statement was the UK’s downgraded growth forecast - slashed to a meagre 1%. In simple terms, the financial buffer the Chancellor had last year has effectively been wiped out by the revised projections, meaning deeper cuts. This time, it was welfare that bore the brunt.\nIt has been a mixed bag of announcements. I welcome the clarity on how we get to 2.5% defence spending by 2027, though as I wrote here a couple of weeks ago, cutting international development so much to fund it does also have material downsides.\nSince Covid, there has been a significant increase in the number of people not working because of long-term sickness. It is right that we need to encourage and support more people back in to work.\nI appreciate that the government wants to make sure the system doesn’t encourage people to leave the labour market if they may be able to work. I share that aim. But the scale of the cuts to incapacity payments will have adverse effects too.\nIt will be the restrictions on eligibility for the ‘daily living’ part of Personal Independence Payment (commonly known as PIP) – which is not to do with whether you are in work or not – which will be among the most controversial. There are some 2,800 people in the East Hampshire constituency currently in receipt of PIP.\nAlthough no new tax changes were announced, the looming impact of increased employers' National Insurance Contributions and business rate rises from next month is cause for concern. The combination of worsening growth prospects and increased cost of employment is not a good one.\nTo make matters worse, legislation coming down the pipeline, including the Employment Rights Bill, feels anything but pro-business. The likely effects of that Bill are not yet fully reflected in Office of Budget Responsibility’s (OBR) forecasts.\nMoreover, there are some fears the OBR’s growth projections could anyway be, if anything, too optimistic. Some other forecasters expect lower growth this year.\nIt’s tempting to point to global changes and the spectre of tariffs as cause for the UK’s sluggish GDP, and this was indeed a narrative deployed at the Spring Statement. Yet the reality is that business confidence has been hit since the Chancellor’s Budget last October – before the change in administration in the White House.\nAlthough in East Hampshire we are a little insulated from the unemployment risks because of having low levels to begin with, we need the government to recognise that ultimately it is businesses, including the small businesses, that are central to our local economy, that drive the growth we all want – and need – to see.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_about-damian/content_26.html": "Damian Hinds was re-elected to parliament in the General Election on 4th July 2024.\nHe was first elected in 2010 as the MP for East Hampshire, and was re-elected in May 2015, June 2017, and again in December 2019. He is committed to working hard to support the many excellent East Hampshire businesses, charities and organisations. His areas of interest include business, the economy, tackling disadvantage and widening opportunity.\nIn Parliament, Damian has served on the Education Select Committee, and chaired the All Party Parliamentary Groups for Social Mobility and for Credit Unions. Damian was involved in establishing the All Party Parliamentary Group for T Levels, and also the All Party Parliamentary Group for EdTech, and was a member of the Digital, Culture, Media and Sport Select Committee.\nIn 2015 he was appointed Exchequer Secretary to the Treasury, a role which he held until being appointed Minister for Employment in June 2016. Damian was appointed Secretary of State for Education in January 2018, a position he held for 18 months.\nDamian served as Security Minister at the Home Office from August 2021 to July 2022, and was appointed a Minister of State at the Ministry of Justice in October 2022. He was appointed Minister of State at the Department for Education in November 2023. Following the July 2024 election, Damian was appointed to the shadow cabinet as Education Secretary. He stepped down from the shadow cabinet in November 2024.\nDamian’s degree is in politics, philosophy and economics. Before Parliament, he spent 18 years working in the pubs/brewing and hotel industries, in Britain and abroad. Damian lives between Alton and Petersfield with his wife Jacqui and their three children.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_calling-new-approach-housing-numbers/content_15.html": "Damian took part in a Westminster Hall Debate on new developments in green belt land, and called for a new approach to housing numbers for East Hampshire, that recognises the unique circumstances with the National Park boundary cutting through the district.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_category_Articles-for-the-Herald-and-Post/content_7.html": "Chancellor urged to act as childcare sector faces growing financial pressure 1st May 2025 President Trump’s tariffs have added fresh uncertainty to an already fragile UK economy. With government borrowing higher than expected last year, speculation... Articles for the Herald and Post\nWe must renew our commitment to international trade 24th April 2025 My first political writing was a letter I wrote as a boy to Margaret Thatcher in 1980 or 1981, a time of great economic and industrial stress. I had just been... Articles for the Herald and Post\nWhen the line goes dead: why rural landlines still matter 17th April 2025 The Candovers, the Tisteds, Binsted, Buriton, Froxfield and Privett, Hawkley, East Meon. These are among the places that epitomise the beauty of the East... Articles for the Herald and Post\nAwful April rears its head 10th April 2025 Along with April Fool’s Day and the start of the new tax year, this month has acquired a rather less humorous nickname—\"Awful April.\" Dubbed by the media, this... Articles for the Herald and Post\nChancellor faces a bleak road ahead 3rd April 2025 Whilst spring may have sprung outside, the mood in the Chamber following the Chancellor’s financial statement this week was anything but sunny. An unwelcome... Articles for the Herald and Post\nMaking sense of the local government shake up 27th March 2025 Last Thursday and Friday, I joined Hampshire County Council leader, Nick Adams-King, at public meetings in Alton and Rowlands Castle to discuss the upcoming... Articles for the Herald and Post\nCracking down on rural crime 20th March 2025 Last week saw the second reading of the Crime and Policing Bill, an important piece of legislation that introduces a number of new offences and strengthens... Articles for the Herald and Post\nUnited in support of Ukraine 13th March 2025 Most democratic legislatures seat their members in a horseshoe or hemisphere. The House of Commons is unusual with two sides facing each other head-on. It is at... Articles for the Herald and Post\nGovernment needs to switch on to the switch off 6th March 2025 If you regularly read my column in this paper, you’ll know I am concerned about the impending switch off of the analogue landline and the potential implications... Articles for the Herald and Post",
  "https_www_damianhinds_com_/https_www_damianhinds_com_campaigns_staying-safe-online/content_24.html": "The government's 'Stop! Think Fraud' campaign is a one stop shop for everything you need to know about protecting yourself online.\nFor advice on identifying a scam call or message, go to: https://www.ofcom.org.uk/phones-telecoms-and-internet/advice-for-consumers/scams\nTo report a suspicious text message, forward the text to 7726 so the mobile phone provider can investigate.\nTo report a suspicious phone call, or other potential scams, contact Action Fraud at https://www.actionfraud.police.uk/ or by calling 0300 123 2040\nYou can also report suspicious emails to the National Cyber Security Centre (NCSC) vis their Suspicious Email Reporting Service (SERS), using [email protected]. More information about their service is available at https://www.ncsc.gov.uk/information/report-suspicious-emails\nIf you are a business, charity or other organisation which is currently suffering a live cyber attack (in progress), please call Action Fraud on 0300 123 2040 immediately. This service is available 24 hours a day, 7 days a week. Please note, if you are member of the public you must call to report through their core opening hours.\nThe Cyber Essentials Scheme helps businesses guard against cyber attack, and there is more information at: https://www.ncsc.gov.uk/cyberessentials/overview\nFor other organisations that may be helpful, go to: https://www.actionfraud.police.uk/useful-organisations\nCitizens Advice also operate an online Scams Action programme, and you can get advice from a Scams Action adviser by calling 0808 250 5050. The service is open from Monday to Friday, 9am to 5pm. Calls are free from mobiles and landlines. There is more information at https://www.citizensadvice.org.uk/consumer/scams/get-help-with-online-s…\nThe Take Five campaign also offers useful information on how to prevent fraud. Go to: https://www.takefive-stopfraud.org.uk/\nVictim Support\nIf you’ve been affected by crime, Victim Support can give you the help you need to move forward. Their services are free, confidential and available to anyone in England and Wales, regardless of whether the crime has been reported or how long ago it happened. Call their support line on 08 08 16 89 111 or request support online.\nBelow are two booklets that may also be helpful in understanding Romance Fraud and how to identify the most common scams:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_damian-welcomes-cross-party-focus-landline-switch/content_55.html": "Damian released the following statement today:\nA new report published today calls on the government to play a greater role in the rollout of digital landlines, ahead of the switch-off of the PSTN (Public Switched Telephone Network) analogue landline in 2027. The cross-party group of MPs behind the report is also demanding a stronger public awareness campaign, echoing concerns previously raised by Damian Hinds.\nDamian has long campaigned for better protections for consumers with poor or no mobile signal and no broadband access – people who rely entirely on their landline. Last month, he wrote to the Secretary of State at the Department for Science, Innovation and Technology, urging the government to mandate longer lasting backup batteries. Ofcom currently requires only one hour of backup power for digital landlines during power outages – a standard Damian argues is insufficient, particularly in rural areas like East Hampshire, where power cuts can last much longer.\nCommenting on the report, Damian said: “Unlike traditional landlines, digital landlines will not function during a power cut. For those who are landline-dependent, this creates a real risk of being cut off from a vital lifeline if effective, durable backup solutions are not in place.\n“The current system relies on individuals identifying themselves as vulnerable and adding themselves to a register, but the reality is, anyone can be vulnerable at any time.\n“A sensible step forward would be to provide back up units to all customers in postcodes prone to regular power outages, free of charge. Ofcom must also mandate a significantly longer battery life for these units than currently required, to reflect the needs of rural communities.”\nNon voluntary migrations to digital landlines were temporarily paused last year due to reported failures of telecare alarms on the new system. However, customers not on a vulnerable users register continue to be switched over, causing further issues.\nDamian added: “The government must stop the practice of forcing customers onto digital landlines simply because their existing contract ends. Residents in East Hampshire have already been pushed onto digital landlines they didn’t want, with hybrid phones that have limited battery life and no signal during prolonged power cuts. This is unacceptable.”\nThe full report can be accessed here: https://url.uk.m.mimecastprotect.com/s/aja1CYW3GF3JEplyU0fxUxIfwp?domain=digitalcommunities.inparliament.uk",
  "https_www_damianhinds_com_/https_www_damianhinds_com_contact/content_34.html": "If you are a resident of East Hampshire and would like to contact me regarding an issue or query, please complete the form below:\nI would like to be kept up-to-date by Damian Hinds on future issues that matter to me:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_category_Local-News/content_13.html": "Shine Radio - April 2025 1st April 2025 Click here for Damian's latest monthly update for Petersfield's Shine Radio: Damian Hinds MP April update | Petersfield's Shine Radio Local News\nLocal Conservative MPs unite to oppose water recycling at new Havant Thicket reservoir 24th March 2025 Damian released the following statement today: Damian Hinds MP recently joined neighbouring MPs Alan Mak and Suella Braverman to oppose the proposed water... Local News\nDamian welcomes cross-party focus on the landline switch off 24th March 2025 Damian released the following statement today: A new report published today calls on the government to play a greater role in the rollout of digital landlines... Local News\nThe suns shines at brilliant Birdworld 27th February 2025 Damian was delighted to be invited to Birdworld recently to see how funding from East Hampshire District Council has been used to improve accessibility at the... Local News\nJob opportunity - senior caseworker 24th January 2025 An opportunity has arisen to join Damian Hinds' busy office as his senior caseworker. Details and how to apply are below: Closing Date: 10 February 2025 Job... Local News\nShine Radio - December update 13th December 2024 My end of year recording for Shine Radio: https://omny.fm/shows/petersfieldstories/damian-hinds-mp-update-for-dec… Local News\nUK Parliament Week - 18 - 22 November 2024 15th November 2024 Damian has recorded a short film for local schools to use as part of their activities around UK Parliament Week. Local News\nRemembering the fallen in Holybourne 9th November 2024 Damian attended Remembrance services across East Hampshire over the weekend. This includes Holybourne's on Saturday, pictured. Damian said: \"Thank you to all... Local News\nThe Budget 2024 - what it means for East Hampshire 4th November 2024 Labour’s first for 14 years, this was a big Budget in all respects, with big tax rises and big borrowing. Taxes are going up by £40bn, taking the total tax... Local News",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_we-must-renew-our-commitment-international-trade/content_3.html": "My first political writing was a letter I wrote as a boy to Margaret Thatcher in 1980 or 1981, a time of great economic and industrial stress.\nI had just been with my family to France for the first time and was cross that the French roads were full of Peugeots and Renaults and Citroens, while ours were full of allsorts. My letter advocated an obvious solution: economic protectionism, or tariffs.\nThe observation might have had some truth, but my proposed prescription was all wrong. It is beguiling to think you can protect your domestic industries to create employment and growth, and rake in lucrative tariff revenue at the same time.\nTrade does need to be fair. Farmers and producers should not be undercut by others with lower standards. And self-reliance is important in strategic sectors, like food and energy. But, as a general rule, the freer trade is, the better.\nInternational trade is important to Hampshire, with Southampton handling exports of £40bn a year. And Britain is an outward-looking maritime nation. Mostly (not quite always) for good, our country has been a leader in global trade.\nIt was in the same year that the then thirteen American colonies declared their independence - 1776 - that the great Scottish economist Adam Smith published the Wealth of Nations. Smith’s seminal work is the grounding of our understanding of how the division of labour, specialisation and trade bring economic growth.\nIn 1799, another British economist, David Ricardo (inspired by reading Smith), developed the theory of Comparative Advantage: the notion that everyone benefits when countries specialise in and export what they’re best at, and buy in other things from others.\nIt is complained in some countries that “the problem is, we don’t have a comparative advantage in anything any more.” In fact, that is impossible. Even if country A can produce everything better and cheaper than country B, there are still gains to be made from trade by country A specialising in the things it is even more better at (bad grammar, I know).\nMoreover, if you do hike tariffs, as we have seen again, other countries retaliate – and then competitively you are back where you were, but with consumers now paying higher prices. No one wins from a trade war.\nTo say “globalisation is over” is wrong. But it certainly is much challenged and already much changed.\nExactly how and where the US tariff actions will lead is an open question.\nBut one thing’s for sure: we need to renew, not reduce, our commitment to trade. We must work harder at our trading relationships with powerhouse growth economies like India, and G7 partners in Japan, Canada and Europe",
  "https_www_damianhinds_com_/https_www_damianhinds_com_stay-connected/content_66.html": "National and regional organisations\nFederation of Small Businesses (FSB) https://www.fsb.org.uk/\nHampshire Chamber of Commerce www.hampshirechamber.co.uk\nInstitute of Directors www.iod.com\nBusiness Easthants www.businesseasthants.org\nA forum to help local businesses connect and support eachother\nBusiness South https://www.businesssouth.org/business-support/\nCan help with start up financing advice, training and workshops, as well as some one on one business advice\nSouthern Entrepreneurs https://www.facebook.com/groups/SouthernEntrepreneurs/\nThe group is dedicated to networking, resource sharing and idea development\nLocal networking groups\nFirst Friday Petersfield HOME - First Friday Petersfield (first-friday.org)\nAn informal business networking group in Petersfield set up in 2003, with around 400 members. They meet on the first Friday on the month, usually over lunch.\nBusiness Growth Network Networking Petersfield | Business Networking Petersfield | Breakfast Meeting (bgnetwork.co.uk). A local networking group that meets weekly in Petersfield.\nBNI Hampshire BNI Hampshire | Professional Business Networking Groups in Hampshire and Isle of Wight | English (GB) | BNI Hampshire and the Isle of Wight. Has chapters in Petersfield (South Downs), which meet on Tuesday mornings.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_school-visits/content_43.html": "Visiting Parliament\nEvery year MPs welcome hundreds of school students to Parliament. The usual format is a free walking tour of the Palace of Westminster followed by a trip to the state of the art Education Centre. I will always try and meet school visitors at the end of their visit for a Q&A and general discussion about working as an MP. Schools can also use the opportunity to take in nearby sights such as the Tate Britain, the National Gallery or the London Eye and enjoy a picnic lunch in St James' Park before heading home.\nDue to the proximity of East Hampshire to London, the travel subsidy is not available to schools in the constituency.\nSchool visits\nI also carry out a programme of primary school visits throughout the constituency. The visits are a good opportunity for students and teachers to talk to their MP about local or national issues, as well as for me to see the school in action. I also visit secondary schools and post 16 colleges to meet with students interested in politics or studying GCSE or A Level politics - this includes the annual 'Question Time' debate involving students from The Petersfield School, Bedales and Bohunt.\nPlease contact me if you would like me to visit your school.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_category_Reporting-Back-newsletter/content_20.html": "Reporting Back - April 2025 1st May 2025 Click here for Damian's latest constituency and Westminster update: Reporting Back newsletter\nReporting Back - March 2025 1st April 2025 Click here to read Damian's latest monthly newsletter: Monthly newsletter from Damian Hinds MP Reporting Back newsletter\nReporting Back - February 2025 7th March 2025 Click here for Damian's latest update from Westminster and the constituency. Reporting Back newsletter\nReporting Back - January 2025 31st January 2025 Click here for Damian's latest constituency and Westminster update: Monthly constituency update from Damian Hinds MP Reporting Back newsletter\nReporting Back - December 2024 27th December 2024 Click here for Damian's constituency and Westminster update for December 2024: Monthly constituency update from Damian Hinds MP Reporting Back newsletter\nReporting Back - November 2024 3rd December 2024 Damian's constituency update for November 2024: Monthly constituency update from Damian Hinds MP Reporting Back newsletter\nReporting Back - October 2024 31st October 2024 Damian's constituency update for October 2024: Monthly constituency update from Damian Hinds MP (mailchi.mp) Reporting Back newsletter\nReporting Back - September 2024 30th September 2024 Damian's constituency update for September 2024: Monthly constituency update from Damian Hinds MP (mailchi.mp) Reporting Back newsletter\nReporting Back - May 2024 30th May 2024 Damian's constituency update for May 2024: Monthly constituency update from Damian Hinds MP (campaign-archive.com) Reporting Back newsletter",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_feed/content_44.html": null,
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_damian-speaks-second-reading-ifate-bill/content_45.html": "Damian raised his concerns about the IfATE Bill during the second reading debate. The Bill will, if enacted, transfer the functions of the Institute for Apprenticeships and Technical Education (IfATE) to the Department for Education, effectively abolishing the Institute. Commenting at the time, Damian said:\n\"You can’t just wish it or will it. You can’t assume it or assert it. Parity of esteem for vocational training and qualifications needs independent standards-setting, as the academic route has. Ministers must amend this Bill accordingly.\"",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_reporting-back-february-2025/content_63.html": "Tweet Friday, 7 March, 2025 Reporting Back newsletter Click here for Damian's latest update from Westminster and the constituency.\nReporting Back - April 2025 Thursday, 1 May, 2025 Click here for Damian's latest constituency and Westminster update:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_visiting-westminster/content_14.html": "There are a number of free guided tours of Parliament available to constituents - these are detailed below. There are also opportunities to visit Parliament to sit in on debates in either of the two chambers or listen to Select Committee hearings that are open to the public.\nInside UK Parliament tours\nTours are free of charge and open to UK residents and take place when Parliament is sitting. Guides accompany visitors on the 75-minute tour and explain the work of UK Parliament and its relevance today, outline how the working spaces are used, set out ways to get involved and engage with the democratic process, and highlight some of the dramatic history of the Palace of Westminster.\nThe visitor tour route includes the chambers of both Houses, the State Rooms in the House of Lords, Central Lobby, St Stephen’s Hall and Westminster Hall. It is worth noting that the full tour route may not always be available and can be subject to last minute changes or cancellation due to parliamentary business.\nThe maximum size for a group is 15 per guide. If your group exceeds this size, it will have to be split between different tour groups starting at different times (tours usually depart at 15-minute intervals). You can find further information regarding tours on Parliament’s website.\nElizabeth Tower Tours (Big Ben)\nYou can now book tours of the Elizabeth Tower by contacting your MP. Tickets are released at the start of each month and MPs have a period of around two weeks in which to book free constituent tours before tickets go on sale to the public. Tickets are bookable three months in advance - although they do sell out very quickly, often on the day of release.\nMPs only have a yearly allocation of eight tickets each, so you may be added to a waiting list if there is lots of interest in these tours.\nIf you would rather book and pay for your own tickets, please visit the Parliament website.\nPrime Minister's Questions (PMQs)\nEach MP’s allocation is only four tickets per month and demand always exceeds supply. We have a long waiting list for tickets, but would be happy to add your name to this list. We will then contact you when you reach the top of the list.\nFor help with any of the above tours or to be added to the list for PMQs, please get in touch.\nPlease visit the educational visits section for information about school visits to Parliament.\nDebates\nPlease note that tickets are not required for general debates in either the House of Commons or the House of Lords, they are only required for PMQs (which are on Wednesdays). On sitting days other than Wednesdays, you can come to Parliament (via the Cromwell Green entrance) and wait for entry to either Chamber on the day. It's worth checking the What's on in Parliament section of the Parliament website for details of all the debates and Select Committees happening that day.\nYou are welcome to watch Select Committees when they are in session, which is usually on a Monday afternoon, all day on Tuesday and Wednesday and on Thursday morning. Typically, committees briefly meet privately before opening up the public gallery.\nTo watch a committee session, you do not need a ticket. If the committee is meeting in the Palace of Westminster, you should arrive at the Cromwell Green Entrance. You should arrive at the Portcullis House visitor entrance for committees meeting there. There will always be someone there to show you where to go.\nFor directions and a map of the Parliamentary Estate please click here.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_parliament/content_5.html": "Damian was first elected as the Conservative Member of Parliament for East Hampshire in May 2010. He was re-elected to this position in May 2015, June 2017, and again in December 2019.\nDamian was appointed Security Minister at the Home Office in August 2021 to July 2022, and held the position of Secretary of State for Education between January 2018 and July 2019. He became Minister of State at the Ministry of Justice in October 2022, where his responsibilities include prisons and the probation service. In November 2023, he became Minister for Schools at the Department for Education where his current focus is school attendance, SEN provision and sport in schools.\nDamian was previously Minister for Employment at the Department for Work and Pensions from July 2016 to January 2018, and prior to that, Damian held the position of Exchequer Secretary to the Treasury; an appointment he took up in May 2015. Damian was also an Assistant Government Whip between July 2014 and May 2015.\nHe had previously served on the Education Select Committee and chaired the Social Mobility All-Party Parliamentary Group.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_protecting-children-online/content_32.html": "During a DCMS debate on child protection online, Damian highlights research from Ofcom that indicates the risk of children appearing to be over 18 when they register with false dates of birth.\nDuring a DCMS debate on child protection online, Damian highlights research from Ofcom that indicates the risk of children appearing to be over 18 when they register with false dates of birth.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_help-vulnerable-families/content_54.html": "This week the first of three payments, £301 of a total of £900, have been going to qualifying lower-income households to help with the cost of living. Info on eligibility here: https://www.gov.uk/guidance/cost-of-living-payment\nThis week the first of three payments, £301 of a total of £900, have been going to qualifying lower-income households to help with the cost of living. Info on eligibility here: https://www.gov.uk/guidance/cost-of-living-payment",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_damian-hinds-slams-hospital-delay/content_27.html": "The following statement was issued today:\nDamian Hinds spoke out today about the government’s plans to put the new hospital for North Hampshire on hold. This follows a decision by the Health Secretary to pause the New Hospitals Programme, leaving 15 hospital schemes in limbo.\nResponding to the announcement, Damian Hinds said:\n“The case for this new hospital in Hampshire has been well made already by clinicians, staff and elected representatives, and there is overwhelming public support for the proposals. The Treasury had previously approved the necessary funding for the hospital; giving the green light for the hospital to proceed with the next stage of the planning works. It is incredibly frustrating that all of this hard work is now being held up by a government review.”\nDamian added: “This follows a very public statement from the Prime Minister during his election campaign visit to Basingstoke where he promised local people that they would get their new hospital.\nI know that the plans for the new hospital are well advanced, so I will be doing everything in my power to ensure that this new hospital is built.”\nThe hospital, which would serve Basingtoke and Winchester as well as those living in Alton, Four Marks, Medstead, the Candovers and surrounding areas, would create a state-of-the-art A&E plus centralised maternity and obstetric services. A public consultation on the location of the hospital closed earlier this year.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_about-rss/content_10.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_why-bordon-needs-banking-hub/content_52.html": "My column for this week's Herald and Post...\nIn September I wrote in this column about the decline of cash and the dangers of financial exclusion for some of the more vulnerable people in our communities. Following news of more bank branch closures across the country, I’m back to that subject this week.\nI remember a couple of years ago when I was complaining to one of the big banks (the one that, as it happens, I am a customer of myself) about a local branch closure, he said to me “When did you last need to visit one of our branches?” It took me a while to call to mind the occasion.\nIt is an unavoidable reality that with the growth of online, fewer and fewer people are going to a bank branch – and others are using banking services through the Post Office.\nBut it’s also true that some people – or many people, but only sometimes – still need and want to access banks’ face to face services, such as mortgage advice, locally.\nThere is just not enough demand – as there used to be – to have a full branch offering for every major bank in every sizeable town. But there isn’t none.\nAnd that’s where an idea called ‘banking hubs’ comes in – where the main banks can share a premises, in places where otherwise there would be no bank branch at all.\nA programme is run by Link, to identify places now with no physical banking presence, most in need of one and where it would be most used. For the successful communities, the banks then take it in turns to open the doors of a shared hub to customers on different days of the week.\nWhile we have seen bank branch closures across East Hants, the position has been particularly acute in Whitehill & Bordon. With no branches still open, I have been making the case for such a banking hub in the town. Over the past few months I’ve been working with EHDC to provide evidence to Link to support an application.\nAs things stand, a town needs to meet a number of criteria. Broadly, these are about the size of the town, how many cash-dependent retailers are in a defined geographical area, the proximity of the nearest high street bank, the percentage of older people, and how cash-reliant the community is.\nThe last Bordon bank branch closed in August 2017, with the nearest bank now in Alton, and there are many cash-dependent businesses in town.\nAn assessor has now visited Whitehill & Bordon to measure the town against Link’s criteria. It was a positive meeting but we still have work to do to get over the line. One issue is that the shops are spread over a larger area rather than being concentrated on a single high street.\nWhilst we don’t yet have a final decision on whether our application will be successful, I will continue to push the case for a hub to be approved as I’m in no doubt that this will be a real help to residents and local businesses. It will also ensure that access to cash is protected for those that need it most.\nThe Financial Conduct Authority this week launched a consultation on the hubs scheme (CP23/29: Access to cash (fca.org.uk). I will be making a submission highlighting the need for the criteria to be flexible to take in Whitehill & Bordon’s situation.\nAnd of course this is not only in Whitehill & Bordon. I’m afraid to say that, over time, more places will find themselves in the same position. There is a strong case to be made for many more shared banking facilities in towns like East Hampshire’s.",
  "https_www_damianhinds_com_/https_www_damianhinds_com/content_1.html": "Water recycling proposals at Havant Thicket Housing and planning Cost of Living Support For general information, links and advice, go to Cost of Living Support Latest News Reporting Back - April 2025 Click here for Damian's latest constituency and Westminster update: Chancellor urged to act as childcare sector faces growing financial pressure President Trump’s tariffs have added fresh uncertainty to an already fragile UK… We must renew our commitment to international trade My first political writing was a letter I wrote as a boy to Margaret Thatcher… Latest Campaigns Water recycling proposals at Havant Thicket Scroll to the bottom of the page to give me your views on the water recycling… A new hospital for Hampshire Damian spoke at an Adjournment debate on the future of healthcare in Hampshire… Supporting our farmers Farming remains an important part of life here in East Hampshire, both in terms… Is Damian your MP? Enter your postcode Postcode Featured story Chancellor urged to act as childcare sector faces growing financial pressure 1st May 2025 Read full article The Constituency\nChancellor urged to act as childcare sector faces growing financial pressure President Trump’s tariffs have added fresh uncertainty to an already fragile UK…\nWe must renew our commitment to international trade My first political writing was a letter I wrote as a boy to Margaret Thatcher…\nWater recycling proposals at Havant Thicket Scroll to the bottom of the page to give me your views on the water recycling…\nA new hospital for Hampshire Damian spoke at an Adjournment debate on the future of healthcare in Hampshire…\nSupporting our farmers Farming remains an important part of life here in East Hampshire, both in terms…\nChancellor urged to act as childcare sector faces growing financial pressure 1st May 2025 Read full article",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_debate-non-domestic-rating-multipliers-and-private-schools-bill-remaining-stages-part-2/content_64.html": "In the debate, Damian continued to express his opposition to the principle of taxing education.\nSpeaking at the time, Damian said: \"On top of VAT and NI, many independent schools will also be facing business rates for the first time. We tried to amend the legislation to exempt some schools, or at least to delay it, but the government is intent on steamrollering on.\"",
  "https_www_damianhinds_com_/https_www_damianhinds_com_campaigns_water-recycling-proposals-havant-thicket/content_4.html": "Scroll to the bottom of the page to give me your views on the water recycling proposals at Havant Thicket reservoir\nThe South East is ‘water stressed’. The Environment Agency has predicted that 3.5 billion extra litres of water are required by 2050 (50% of the need is in the South East). Although we are water stressed in Hampshire (particularly in the areas covered by Southern Water), we do have an abundance of natural springs and also lay claim to a number of chalk streams - including the Test and the Itchen.\nThe water companies are now looking at options for securing the water supplies for decades to come, recognising that extreme weather events, such as prolonged droughts and exceptional rainfall, are going to become more commonplace. Lots of options are being considered, but are likely to include repairs/upgrades to pipes to prevent and fix leaks, improved efforts to capture and store rain water, and significant investment in the UK's antiquated sewage system to reduce the number of sewage overflows into our rivers and streams.\nIt is important to note that there are two project proposals, which get considered individually - the first is to create a reservoir; the second is to 'repurpose' that reservoir as a waste water recycling facility. They are both outlined below; the descriptions of them here are derived in large part from information provided by the water companies. You can see more at: Havant Thicket Reservoir project\nThe Havant Thicket Reservoir\nHampshire's new reservoir, which is currently being built, is being delivered as a partnership between Portsmouth Water and Southern Water. It is located close to Rowlands Castle and Havant and is due to be operational by 2029. It will cost approximately £340 million to build.\nThis reservoir will enable Portsmouth Water to capture and store excess rain water over the winter months. This is water that currently runs off into the sea. This water, added to the water from Hampshire's many natural springs, can then be supplied to Southern Water in times of drought so that Southern Water, in turn, can reduce the amount of water it takes from the Itchen and Test chalk stream rivers.\nThe reservoir will be able to hold 8.7 billion litres of water when full and supply, on average, 21 million litres per day. Portsmouth Water already shares 30 million litres per day with Southern Water. Once the reservoir is operational they will be able to share an extra 21 million litres per day plus an extra 9 million from this year (equal to 60 million litres per day eventually). Southern drinking water customers will see an increase in their bills to pay for the reservoir.\nThe Water Treatment and Water Recycling (WTWR) project at Havant Thicket Reservoir:\nSouthern Water have proposed a new water recycling plant south of Havant to turn treated wastewater into recycled water, which would eventually become drinking water. The recycled water would be transported to the Havant Thicket Reservoir via a pipeline where it would be mixed with spring water and subjected to treatments and filtration. A further pipeline would then take this purified water to the Otterbourne Water Supply Works where, following further treatments, including the addition of chlorine, it would be turned into drinking water.\nThe aim of Southern Water's new plant is to build in more resilience to the challenges posed by climate change and the growing population, and create a sustainable water supply for future generations.\nThe WTWR would be the first water recycling plant of its kind in the UK, although this technology is in use in other parts of the world. The approximate cost would be £1.2 billion. Southern Water has estimated that the new plant would supply up to 111 million litres per day. Southern Water say it would also mean that they would not have to tap into the local chalk streams during droughts (or ship in supplies from Norway).\nCurrent status of the project:\nAs mentioned above, the Havant Thicket reservoir and the WTWR are two separate projects. The reservoir has passed the planning stage and is now in the construction phase. The WTWR is at a much earlier stage and still requires permission. Southern Water has recently consulted on the project as part of its draft water resources management plan.\nOnce Southern has analysed the responses, it plans to apply for a consent order from Defra next year (2025). Defra, as the responsible department, has determined that the WTWR is of national significance meaning that the project will be assessed by the planning inspectorate, rather than the local planning authority.\nMore broadly, the water regulator, Ofwat, will shortly publish its determination for the water companies (on 19 December 2024). This will tell the water companies what they are allowed to charge customers over the next five years. These prices will be in place from April 2025.\nIn Parliament:\nThe WTWR project is a colossal project with wide reaching implications. It's important that we fully understand the environmental impacts of the proposals, and how they will be mitigated, and the business case behind the project. To that end, I've started asking questions in Parliament to try and get a better sense of the government's view on the concept of water recycling at Havant Thicket. I've tabled a number of Parliamentary Questions on the government's assessment of the concept of water recycling and transfer, as well as on the specifics of the water recycling scheme at Havant Thicket, and on the regulatory/approvals processes. A sample of the responses from the Defra Minister is below. I've also requested a debate on the proposals.\nQuestion 1 (tabled on 18 November):\nTo ask the Secretary of State for Environment, Food and Rural Affairs, what recent discussions he has had with the Water Commission on the proposed water transfer and recycling project at the Havant Thicket Reservoir. (14597)\nEmma Hardy:\nThe independent water commission, led by Sir Jon Cunliffe, will consult experts in areas like the environment, public health, engineering, customers, investors and economics, reporting to the Secretary of State for Environment and Wales’ Deputy First Minister and Cabinet Secretary for Climate Change and Rural Affairs by Q2 2025. The commission will consider the challenges the water sector faces as a whole and use the evidence to set out recommendations that will help transform the sector. The Terms of Reference for the Independent Commission are available at GOV.UK.\nQuestion 2 (tabled on 18 November 2024):\nTo ask the Secretary of State for Environment, Food and Rural Affairs, what guidance his Department issues on criteria for approval of a water transfer and recycling project. (14599)\nThis question was grouped with the following question(s) for answer:\n- To ask the Secretary of State for Environment, Food and Rural Affairs, what assessment he has made of the potential (a) merits, (b) risks and (c) cost to the public purse of the proposed water transfer and recycling project at the Havant Thicket Reservoir. (14595)\n- To ask the Secretary of State for Environment, Food and Rural Affairs, whether he has made an assessment of potential impact of the proposed water transfer and recycling project at the Havant Thicket Reservoir on Hampshire’s chalk streams. (14596)\n- To ask the Secretary of State for Environment, Food and Rural Affairs, whether he has made an assessment of the potential relevance of international comparisons of the potential (a) merits, (b) risks and (c) costs of proposals for recycling waste water in (i) Havant Thicket and (ii) elsewhere. (14598)\nAnswer (Emma Hardy):\nSouthern Water are currently consulting on their Water Resources Management Plan (WRMP), which includes the proposed water transfer and recycling project at Havant Thicket Reservoir. Water regulators will review and scrutinise the plan to ensure it is fit for purpose, the risks to the environment including the impact on chalk streams are low, and it is value for money.\nOptions such as water recycling mark a transition to water supplies that are not dependent upon the uncertainties of rainfall. These options are well established elsewhere around the world and in the UK, to ensure resilient supplies in a changing climate.\nFor any water recycling scheme to proceed it must comply with the Water Environment Regulations (formally the Water Framework Directive) and the Habitats Regulations. The Environment Agency will ensure environmental requirements are met through their roles as statutory consultee of the planning process and regulator for environmental permits. Environmental impact assessments are required to support planning and permitting and appropriate mitigation must be provided for any impacts.\nQuestion 3: To ask the Secretary of State for Environment, Food and Rural Affairs, if he will (a) commission an independent assessment of the potential (i) environmental and (ii) health impact of using recycled waste water and (b) pause approval of water (A) transfer and (B) recycling projects until that assessment is published. (21 November 2024)\nAnswer (Emma Hardy): For any water recycling scheme to proceed it must comply with the Water Environment Regulations (formally the Water Framework Directive) and the Habitats Regulations. The Environment Agency will ensure environmental requirements are met through their roles as statutory consultee of the planning process and regulator for environmental permits. Environmental Impact Assessments are required to support planning and permitting and appropriate mitigation must be provided for any impacts.\nWater re-abstracted from the environment for public water supply must also be treated to meet our high drinking water standards before use, in accordance with a robust risk assessment. Recent research carried out for the Drinking Water Inspectorate indicated a high level of support (79% agreement) for the use of water recycling to supplement drinking water supplies.\nOptions such as water recycling mark a transition to water supplies that are not dependent upon the uncertainties of rainfall. These options are well established elsewhere around the world and in the UK, to ensure resilient supplies in a changing climate.\nThere are currently no plans to commission an independent assessment on the potential of using recycled waste water.\nThe full list of my written ministerial questions to Defra can be found here.\nLocal concerns:\nThere are very legitimate concerns in the community and from environmental groups about these proposals. Over the coming months I will be scrutinising the Southern Water proposals and continuing to push the government to provide answers to a number of essential questions about the scheme - not least, what are the pros and cons of water recycling over other schemes to improve water resilience?\nTo tell me what you think about the proposals, please complete the survey below:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_opposition-day-debate-education/content_62.html": "On 8 October 2024 Damian opened the Opposition Day Debate on VAT on independent schools. The full debate can be viewed here: Parliamentlive.tv - House of Commons\nOn 8 October 2024 Damian opened the Opposition Day Debate on VAT on independent schools. The full debate can be viewed here: Parliamentlive.tv - House of Commons",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_tackling-fraud/content_8.html": "Banks are doing a lot to tackle fraud. We need social media to be similarly incentivised. Damian's recent speech on the Financial Services Bill.\nBanks are doing a lot to tackle fraud. We need social media to be similarly incentivised. Damian's recent speech on the Financial Services Bill.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_events_feed/content_17.html": null,
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_budget-2024-what-it-means-east-hampshire/content_21.html": "Labour’s first for 14 years, this was a big Budget in all respects, with big tax rises and big borrowing. Taxes are going up by £40bn, taking the total tax burden to over 38% of GDP, the highest ever. And borrowing is rising by £28bn – and not all of that is for investment; it also includes day-to-day spending.\nForecasters are predicting a cut in interest rates soon, but after that, the extra borrowing means rates will stayer higher for longer than would otherwise have happened, which will be unwelcome news for the 31% of East Hampshire households that have a mortgage. Our local economy is all about small businesses.\nThe Chancellor raised the prospect of business rates reform in the future. But before that, business rates relief for hospitality and retail is to be extended but at a much lower level: down from the current 75% to 40%. For pubs, there was a (very) small offsetting change – a penny off draught beer tax.\nThe biggest single tax rise is the increase in employer National Insurance Contributions (NICs) and the reduction in the threshold at which it’s paid. There has been a lot of debate about whether this ‘counts’ as a tax on working people – but economists agree that the effect of employer NICs ultimately gets felt by workers, either in the form of lower wage growth, or fewer jobs being created. But there was also a measure which will mitigate the effect for East Hampshire’s smallest businesses: the ‘employment allowance’ is going up to £10,500.\nFor our key farming sector – 80% of East Hampshire land is agricultural – there was very bad news, with the Chancellor cutting inheritance tax relief for family farms, which will make it harder for farmers to pass their holdings onto their children and grandchildren. The National Farmers Union has said it feels “incredibly let down” by changes to Agricultural Property Relief and Business Property Relief, having received assurances this wouldn't happen. As they say, APR is not a ‘loophole’, it is a policy that was designed specifically to protect family farms from being sold and broken up. As the Opposition, we will campaign to stop this Family Farm Tax.\nOne piece of good news, especially important in rural areas like ours, was that the fuel duty freeze is to be retained. I had joined the Fair Fuel campaign’s calls for this. East Hampshire has an above-average number of pupils at independent schools. We have been campaigning to stop the imposition of VAT on fees, but in the Budget the government confirmed they intend to plough on. They did say they would make some offsetting changes for military families, of which we have a sizeable number locally. I will continue to call for further exemptions – or preferably for the plan to be dropped altogether.\nYou have to look not only at what is in the Budget, but what isn’t.\nSadly there was no reprieve on Winter Fuel Payments, which currently go to 26,000 in East Hampshire. And there was no mention in Rachel Reeve’s speech of Child Benefit, but buried in the accompanying documents it says the government will not proceed with plans Jeremy Hunt set out in March that would allow more families to get the payment. The biggest single factor in household income and reducing inequality is having low unemployment.\nThe National Living Wage, introduced by George Osborne, has been a very successful policy and massively reduced the proportion of people on low pay. It is now to rise to £12.21 and the lower level for 18-20 year olds is to come up closer to the full rate. Of course, this itself is good for employees but there is a worry that, when combined with the increase in employer NICs and the proposed new labour laws, that there could be a depressive effect on employment – this is something that will need to be watched very closely.\nPerhaps the most surprising thing is that, after all the talk about economic growth (which, rightly, the Chancellor said is the only way to sustainably increase both public spending and living standards), the Budget is predicted to actually cut growth after an initial borrowing-driven boost.\nOverall, this is a risky Budget which will see everyone paying more tax, and independent commentators are forecasting there may be more tax rises coming. On the plus side, the starting point is one of low unemployment, inflation back to target and growth had returned. We shall now have to see how the economy performs.\nListen to my take on the Budget on LBC in a panel with Jeremy Corbyn, Sir Rocco Forte, Stephanie Flanders and me, with Iain Dale: Cross Question with Iain Dale 30/10 | Watch again - LBC",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_more-industry-placements-t-levels/content_23.html": "In Education Questions Damian commended Alton College's work with local employers and asked how more firms could be introduced to the benefits - for them, for students, for the economy - of T Levels industry placements.\nIn Education Questions Damian commended Alton College's work with local employers and asked how more firms could be introduced to the benefits - for them, for students, for the economy - of T Levels industry placements.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_map-locations/content_38.html": "My map\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_campaigns_banking-east-hampshire/content_48.html": "It is a sad fact that the number of high street bank branches in local communities is diminishing. In East Hampshire, some have closed in recent months, including HSBC in Alton, and some are earmarked for closure later this year, e.g. Lloyds in Liphook. From the banks' point of view, these closures are necessary as there just aren't the numbers using them anymore to make the branches commercially viable.\nMany of us now bank online or via our telephones and do so confidently. We therefore have little need to visit a physical bank branch. However, for those who choose not to use online or telephone banking or don't have the means to do so, branches remain an important way of managing household tasks, such as paying bills, or seeking advice on financial matters, such as probate and mortgages.\nWhile I do not have the power to stop banks from closing their branches, I think it's essential that we campaign for decent alternative provision for those customers that need it. This could be maintaining the network of post office 'everyday banking' counters as a minimum and looking to extend the services they can provide to customers to try and fill the gaps left by branch closures.\nWe also need to look at the community banking hub scheme Cash Access UK - Home - this is a community service, run by Link on behalf of the banks, to determine areas that could benefit from a banking 'hub'. This is particularly relevant to those communities which no longer have a physical banking presence and may have to travel some distance to access a branch.\nI have long argued for better banking facilities for Whitehill and Bordon so I was delighted to receive confirmation in May 2024 that the town has been recommended for a banking hub: a fantastic result! This was the culmination of many months of hard work with Link, supported by EHDC, so I'm delighted that the town will be getting the banking provision it needs. Work is already underway to source a venue for the hub and a community event will be organised following the election.\nFinancial Conduct Authority - consultation on Access to Cash (Dec 23 - Feb 24)\nThe FCA last year consulted on improving access to cash in villages, towns and cities. The consultation proposes a \"new regulatory regime, which would require banks and building societies to assess and fill gaps, or potential gaps, in cash access provision that significantly impact consumers and businesses. \" This could mean that banks would need to do a full assessment of the impacts of a bank branch closure on a local community before closing its doors for good. It's also looking at the criteria for deciding which locations are suitable for banking hubs and how the assessments should be carried out. This is an important issue for us in East Hampshire where we have seen many banks close across our towns in recent years, particularly in places like Bordon. I have responded to this consultation and my response can be found below.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_chancellor-urged-act-childcare-sector-faces-growing-financial-pressure/content_29.html": "President Trump’s tariffs have added fresh uncertainty to an already fragile UK economy. With government borrowing higher than expected last year, speculation is mounting ahead of the Autumn Statement that tax rises could be on the horizon – further squeezing household budgets and threatening the UK’s already sluggish growth.\nBut it’s not just households feeling the pressure. Businesses are also under strain. This month alone, they’ve had to absorb a hike in employer National Insurance contributions (NICs), changes to business rate relief, and increases to the legal minimum wage.\nThe impact is widespread, affecting pubs, restaurants, shops, care homes, hospices and nurseries. While schools have been protected from the employer NICs increase, nurseries – despite their vital role in early years education – have not.\nUnlike many sectors, nurseries can't adjust staff numbers or raise prices freely. Strict staff-to-child ratios mean their hands are tied.\nThe National Day Nurseries Association estimates that an average nursery with 18 staff will see their annual costs rise by £47,000 from NICs and wage increases alone. Add business rates, and that figure climbs by another £21,000.\nYes, government funding for free childcare places has increased, but not enough to cover these added costs. And funding rules mean the government only covers staffing costs for the funded hours (15 or 30 per week). Nurseries can end up having to charge separately for extras like lunches or nappies. Some parents are now sending packed lunches and their own supplies to avoid the charges. Yet the nurseries have little choice.\nI’ve heard directly from several local nurseries. Their message is clear, and as one nursery put it: these financial burdens are “making it more difficult for nurseries to operate and is a disincentive to taking on more children or expanding the nursery.”\nThat’s why I’ve written to the Chancellor urging her to take immediate action to exempt nurseries (and hospices for that matter) from the NICs increase and business rate hikes, and increase early years funding to reflect real world costs, including inflation.\nSo far, the Treasury has been silent. That silence speaks volumes.\nIt makes no sense to champion getting more parents into work while simultaneously pushing childcare providers to the brink. If nurseries can’t grow or worse, if they start closing their doors, parents will struggle to find or afford childcare. That risks pulling people out of the workforce and further hampering economic growth.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_protecting-access-our-cash/content_51.html": "Last week's article for the Herald and Post...\nNow and again I receive a letter from a constituent concerned that they have been unable to make a payment to a local business using cash. Sometimes this has turned out to have been a misunderstanding and a cash option is available.\nBut some businesses, or some of their branches, do now display the sign ‘cards only’ (or cards and phones). Digital payments are in the ascendancy, and a switch that was made by some outlets during the COVID epidemic has endured.\nUltimately businesses determine the payment methods accepted. There can be misunderstanding about the meaning of ‘legal tender’, which the Bank of England explains has a very specific technical meaning: if you offer to fully pay off a debt to someone in legal tender, they can’t sue you for the debt. But that isn’t relevant most of the time. Some very common methods of payment – like debit cards or contactless – are not in fact legal tender, but that is not of practical significance either.\nThe term ‘cashless society’ seems to have been around about as long as the term ‘paperless office’, but of late there has been rapid change.\nI’m (just about) old enough that my first wage packet came in one of those envelopes with the little round holes in it so you could count the banknotes without breaking the seal. Bank transfers for pay, and state benefits, are long established now.\nStill, it wasn’t that long ago that the majority of payments were made in cash. It is in the last ten years that online payments have jumped from 45 per cent to 85 per cent.\nLike many, I appreciate the convenience of tap and go payments, and like many, I find myself using a cash machine less and less often.\nBut there is something more immediate and real-feeling about cash. The physical manifestation of money can assist with budgeting. And when we teach our children about money, it is easier to make it come alive with notes and coins than with e-payments and online balances.\nOn the other hand, not walking around with cash, and not having cash at home, can have benefits for crime reduction. At the Serious Organised end of crime, less cash means cash money laundering – on which the drugs trade, for example, relies – has been made that bit harder. On the flip side, there is more complex fraud and online scams.\nIt’s true that many buskers and street vendors now take contactless payments. Some church collections too. But many charities can find it harder, and some community and voluntary organisations find cash (and indeed cheques) more straightforward.\nLike many changes, the decline of cash is neither all-good nor all-bad, but it definitely brings its own issues. And the issues are unevenly felt. Obviously those least comfortable with the online world can be most affected.\nWe do need to make sure people can readily access their money. It is here where last week’s announcement by the Government on access to cash will help. This is to ensure that those living rurally should not have to travel far to withdraw or deposit their money. The Financial Conduct Authority will have the power to fine banks and building societies that do not enable this.\nIn writing my column this week, I am aware of a big, related issue, which is the closure of so many of our bank branches in East Hampshire and elsewhere. This is not only about the move from cash but broader societal changes and the use that almost all of us make now of call centres and, especially, online banking.\nStill, not only does it impact the vibrancy of our high streets, it also diminishes options for over-the-counter transactions and seeking advice about banking matters. It is essential that this does not lead to an increase in financial exclusion. This is a subject I will return to in this column.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_damian-appointed-shadow-education-brief/content_11.html": "Damian was last night appointed as shadow education secretary.\nDamian said: \"Education has always been my first passion and one of the best things about being MP for East Hampshire is working with our excellent local schools, early years settings and colleges.\n“I’m very pleased to be taking on this brief. The record of the last 14 years has been a big rise in children’s attainment compared to other countries. That was brought about by brilliant teachers, supported by our reforms. I sincerely hope the new government can build on this.\n“Good governance needs good Opposition and our approach will be constructive and positive, while scrutinising the decisions the new government takes, and holding them to account for what they deliver.”",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_shine-radio-april-2025/content_42.html": "Click here for Damian's latest monthly update for Petersfield's Shine Radio: Damian Hinds MP April update | Petersfield's Shine Radio\nClick here for Damian's latest monthly update for Petersfield's Shine Radio: Damian Hinds MP April update | Petersfield's Shine Radio",
  "https_www_damianhinds_com_/https_www_damianhinds_com_surgeries-advice-and-public-meetings/content_12.html": "Surgeries\nDamian holds regular advice surgeries in East Hampshire on Friday afternoons. Each appointment is 15 minutes long and must be booked ahead of time. To make an appointment, please email the office using the details below.\nYou will need to provide your full name, full address with postcode and contact telephone number, as parliamentary protocol prohibits Damian from acting for constituents who are represented by another MP.\nYou have the option of attending the surgery in person or requesting an online appointment\nBefore requesting a surgery appointment please do:\n- Check whether the issue can be sorted direct (please refer to the 'when you need help' section of this page).\n- Think about whether we could start to help you more quickly if you phoned or emailed rather than waiting for the next available surgery appointment.\nPlease note that Members of Parliament are not permitted to intervene in any matters of a legal nature and cannot offer legal advice. Members of Parliament can usually only assist with issues that are the responsibility of the UK Parliament. Often the right person to contact will be a local councillor, Citizens Advice or an ombudsman. They are unlikely to be able to assist with private disputes.\nMPs do not have any jurisdiction over local Council decisions, so please contact your local Councillor (see below) if you wish to have the assistance of an elected representative in pursuing an issue with a local Council.\nThe full list of services provided by Hampshire County Council can be found here.\nThe full list of services provided by East Hampshire District Council can be found here.\nThe full list of services provided by Basingstoke and Deane Borough Council can be found here.\nTown Council websites are also useful guides to local services:\nCouncillors\nFind your District Councillor (East Hampshire District Council)\nFind your Borough Councillor (Basingstoke and Deane Borough Council)\nFind your County Councillor (Hampshire County Council)\nAlternatively, you can find your councillor by entering your postcode here.\nHousing enquiries\nMany people write to me about issues to do with housing. I know that these can often be highly stressful and complex situations to navigate, and knowing where to start can be a challenge in itself.\nI always suggest that the best place to start is Hampshire HomeChoice. This sets out the steps you need to take to register for social housing as well as the rules the local authorities (in this case East Hampshire District Council and Basingstoke and Deane Borough Council), follow to ensure that the available accommodation is allocated fairly and transparently.\nAs an MP, I have no role or powers in relation to housing, as this is all managed by not-for-profit housing associations, but I can always make enquiries about a case or offer advice based on my past experience with constituents in a similar situation.\nEducation - Special Educational Needs and Disabilities (SEND)\nLike housing, I receive many emails about SEND provision for children and how to access it. Responsibility for SEND sits with Hampshire County Council so while I can't intervene in the formal process, I can direct individuals to the correct person or team within the authority who can hopefully help with your particular situation.\nThere is a wealth of information on the following websites: Hampshire SENDIASS, IPSEA, SOS!SEN or HPCN.\nPublic meetings\nI host regular open discussion forums in the community for all residents living in the East Hampshire constituency. This is an opportunity to raise any concerns with me direct and debate local issues in a relaxed and friendly environment. These tend to take place on a Thursday evening in a community venue. Details are published beforehand on this website and in the local newspaper. If you would like me to come and speak at a community event, please contact the office using the details below.\nMy next public meeting will be in Rowlands Castle on 1 May 2025 - details here.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_unleashing-potential-credit-unions/content_53.html": "The Financial Services Bill will boost them as an alternative to high-cost lenders — but there is much more to be done to unleash credit unions’ full potential. Damian's recent speech in Parliament\nThe Financial Services Bill will boost them as an alternative to high-cost lenders — but there is much more to be done to unleash credit unions’ full potential. Damian's recent speech in Parliament",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_meeting-local-nfu-members/content_36.html": "Damian met with local National Farmers Union members last week, and said:\n\"These are testing times for farming especially with the volatility in markets and supply. Thank you to East Hants NFU for the opportunity to meet at Neatham and discuss issues and opportunities for this sector that is so vital to our local economy.\"",
  "https_www_damianhinds_com_/https_www_damianhinds_com_what-can-mp-do/content_18.html": "Members of Parliament are elected to the House of Commons to represent the interests and concerns of all the people who live in their constituency, whether they voted for them at the General Election or not. They are only able to deal with issues raised by people who live in their constituency, called constituents.\nMPs consider and vote on legislation and use their position to ask government ministers questions about current issues.\nThey split their time between working in Parliament and working in the constituency. In Parliament, MPs spend their time fighting for the interests of their constituents, attending debates, scrutinising and voting on legislation, and attending meetings. In the constituency, MPs hold advice surgeries for their constituents to come and talk to them about local issues and problems, attend meetings and community events, as well as visiting local organisations and businesses.\nMembers of Parliament are able to help with all matters for which Parliament or central government is responsible.\nClick here for the full list of government departments, agencies and public bodies.\nWhen a constituent writes to their MP, the MP will then write to the relevant department or official or the Minister involved. Many problems are solved in this way.\nAlternatively, if a constituent is happy for the issue to be made public, an MP can ask an oral or written question, secure a debate or petition Parliament.\nMPs do not have any jurisdiction over local Council decisions. However, they can write to a local Council and ask them to look into a problem or make enquiries. In the first instance, constituents should contact their local Council or Councillor. Please visit the surgeries and advice section for more information.\nOral or Written Questions\nOnce a month each minister from each government department answer questions from MPs at the Dispatch Box. There is a limit to the number of questions that can be asked. MPs can also table a written question to the relevant Government department, which are published in Hansard. http://www.parliament.uk/business/publications/hansard/\nAdjournment Debate\nMPs may be able to raise a constituent's issue in a half-hour Adjournment Debate. To get an adjournment debate, MPs must be successful in a ballot of Members of Parliament or have the subject chosen by the Speaker. The debates are usually the last business of the day and a government minister responds at the end of the debate.\nPetitions\nMembers of Parliament can present a petition to Parliament on behalf of their constituents. The format and wording of the petition need to be in a particular way. For more information or guidance, please visit: Petitions - UK Government and Parliament",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_category_Opinions/content_50.html": "Time to Stop the Farm Tax 7th November 2024 The following statement was issued on 7 November 2024 Local MP campaigns to ‘stop the farm tax’ Changes to Agricultural Property Relief (APR) announced in last... Opinions\nDamian responds to the Budget 2024 30th October 2024 Today's Budget contains a huge set of tax increases and more borrowing, and many other measures including very unwelcome news about Agricultural Property Relief... Opinions\nKeep winter fuel - sign the petition 25th October 2024 It's less than a week until the Budget. 26,000 people in East Hants are set to lose Winter Fuel Payments, including many on low incomes. Sign the petition: www... Opinions\nWhen it comes to the Conservative record on education, Labour aren’t telling the truth 25th September 2024 The article below, written by Damian, appeared on the Conservative Home website: Like millions of parents across the country my children recently started... Opinions",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_tribute-her-late-majesty-queen/content_31.html": "Tweet Saturday, 10 September, 2022 Westminster News Yesterday in Parliament Damian joined other MPs in making a tribute to Her late Majesty the Queen You may also be interested in In Parliament Damian was first elected as the Conservative Member of Parliament for East Hampshire in May 2010. He was re-elected to this position in May 2015, 2017 and again in December 2019.\nIn Parliament Damian was first elected as the Conservative Member of Parliament for East Hampshire in May 2010. He was re-elected to this position in May 2015, 2017 and again in December 2019.\nReporting Back - April 2025 Thursday, 1 May, 2025 Click here for Damian's latest constituency and Westminster update:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_reporting-back-september-2024/content_41.html": "Tweet Monday, 30 September, 2024 Reporting Back newsletter Damian's constituency update for September 2024: Monthly constituency update from Damian Hinds MP (mailchi.mp)\nReporting Back - April 2025 Thursday, 1 May, 2025 Click here for Damian's latest constituency and Westminster update:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_reporting-back-november-2024/content_49.html": "Tweet Tuesday, 3 December, 2024 Reporting Back newsletter Damian's constituency update for November 2024: Monthly constituency update from Damian Hinds MP\nReporting Back - April 2025 Thursday, 1 May, 2025 Click here for Damian's latest constituency and Westminster update:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_reporting-back-may-2024/content_61.html": "I continue to raise issues that impact local communities across the East Hampshire constituency, including concerns about flight traffic and noise at Farnborough Airport as well as concerns regarding motorbike noise along some key routes within the constituency and proposals affecting the local trai",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_supporting-nature-and-landscape-recovery/content_35.html": "This article was written by Damian and published in this week's Herald and Petersfield Post:\n\"When we started preparing for the COP 26 East Hampshire event last year, we knew that agriculture and how we use land was going to be a key theme for us locally.\nFarming is an important part of life here in East Hampshire, and considering its role in delivering net zero targets was the focus of the Land Use & Agriculture Action Group which was one of three groups that presented their findings at the event in October.\nWe need both farming practices that reduce greenhouse gases, and a policy framework for a sustainable, productive and profitable agriculture sector.\nTwo new schemes launched by Defra last week will help move this important agenda forward.\nThe schemes will support nature recovery and climate action by rewarding farmers alongside sustainable and profitable food production. They’re part of plans to restore 300,000 hectares of habitat across England and help halt the decline in species by the end of the decade.\nThese reforms are some of the biggest changes to farming in fifty years, as we see the move away from the land-based subsidies of the EU’s Common Agricultural Policy.\nFirst, the Local Nature Recovery scheme will pay farmers for locally-targeted actions that make space for nature in the farmed landscape and countryside such as wildlife habitat, tree planting or restoring peat and wetland areas.\nThis is the improved and more ambitious successor to the Countryside Stewardship scheme, coming in 2023 and 2024.\nSecondly, the Landscape Recovery scheme will support more radical changes to land use change and habitat restoration such as establishing new nature reserves, restoring floodplains or creating woodlands and wetlands.\nApplications for the first wave of Landscape Recovery projects will open shortly, with up to 15 selected from those focused on either helping to recover England’s threatened native species or restoring rivers and streams.\nThe schemes are designed to provide farmers with a range of options from which they can choose the best for their business – they are voluntary and farmers will be able to determine the combination of actions that is right for them.\nMore detail on the schemes is of course needed and this will be important to help farmers make the longer term investments required to adapt their businesses, but there are of course already excellent examples of local farming practice here in East Hampshire.\nThe COP26 East Hampshire Action Group identified several local case studies, including the Selborne landscape partnership (covering 5,500 hectares and 22 farms), the work done by the Blackmoor estate in adopting a carbon footprint exercise across its operation, and the innovative aeroponic towers used to grow produce at Applegarth Farm in Grayshott.\nThe actions we take to change farming methods are clearly an important part of our net zero journey, but the impact of those changes must be sustainable – for farmers, their communities and for the wider food producing sector.\"",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_reporting-back-october-2024/content_56.html": "Tweet Thursday, 31 October, 2024 Reporting Back newsletter Damian's constituency update for October 2024: Monthly constituency update from Damian Hinds MP (mailchi.mp)\nReporting Back - April 2025 Thursday, 1 May, 2025 Click here for Damian's latest constituency and Westminster update:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_financial-and-consumer-advice/content_60.html": "East Hampshire Citizens Advice:\nFor free, impartial, confidential advice on 0300 3309 028 or www.citizensadvice.org.uk\nFinancial advice:\nTurn2us is a national charity that provides practical information and support to people facing financial crisis. On their website turn2us.org.uk you fill find a Benefits Calculator so that people can work out what they are eligible for, a Grants Search which contains over 1,700 charitable grants searchable by profession, health condition, location and age, and Information pages on benefits and grants (including additional rights due to coronavirus)\nThey also offer a helpline at 0808 802 2000 (Mon-Fri 9:00-17:30)\nHMRC Tax helpline: https://www.gov.uk/government/news/tax-helpline-to-support-businesses-affected-by-coronavirus-covid-19\nFSB: https://www.fsb.org.uk/campaign/covid19\nAssociation of Independent Professionals and Self Employed: https://www.ipse.co.uk/coronavirus-hub.html\nUK Finance: https://www.ukfinance.org.uk/policy-and-guidance/guidance/let’s-talk-business-covid-19\nConsumer advice:\nFraud: https://takefive-stopfraud.org.uk/\nWhich?: https://www.which.co.uk/news/coronavirus/\nFor help finding insurance, please use the BIBA Find Insurance Service on 0370 950 1790 or https://www.biba.org.uk/find-insurance/",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_united-support-ukraine/content_9.html": "Most democratic legislatures seat their members in a horseshoe or hemisphere. The House of Commons is unusual with two sides facing each other head-on.\nIt is at the heart of our constitutional system that the government should be opposed: there must always be something to debate, and therefore something to disagree about. Ours is probably the most confrontational legislature in the democratic world.\nThat makes it all the more striking, all the more powerful, when the whole House is as one. That was the case last Monday, at the PM’s statement on Ukraine and meetings in Washington and London over the previous few days.\nParliament was united in support of Ukraine. United, too, in valuing our alliances with the US, European nations, and NATO.\nThere was also a wide, sober realisation of the gravity of the international security situation, and how the world has changed.\nFor years, we and many countries had become accustomed to a ‘peace dividend’ from the end of the Cold War. But new threats have arisen since. And then came Putin’s full-scale invasion of Ukraine, a sovereign democratic European nation.\nIt has been clear for some time that defence spending needs to rise. In April last year, Rishi Sunak announced that it would rise to £87 bn, or 2.5% of GDP, by 2030.\nOther NATO countries are also spending more. Ten member nations hit the 2% target in 2023, but 23 were expected to last year. The new German Chancellor is committed to significant growth.\nBut the United States is still a disproportionately high defence spender, at 3.4% of its real GDP (in NATO, only Poland and Estonia are higher as a % of GDP) – and of course that’s a higher percentage of a much higher GDP.\nThe PM filled in the timing for the UK’s increase to 2.5% and stated the ambition to increase again to 3% in the next Parliament. As the Opposition, we support these moves.\nSupporting such an increase is the easy part. There is then the question of where the money comes from. Taxes are already high; but I do believe the government can make economies from getting more people back to work.\nMinisters have decided to take the money – at least for the first move, to 2.5% – from overseas development. I am not one of those that believes this is ‘free’ money. As well as the altruistic case, there is also self interest in development, which grows the world economy, and indeed can help reduce armed conflicts.\nBut I do accept the hierarchy of imperatives here, and the urgency, and that these funds can more quickly be diverted.\nBut we will also need to return to the hard-headed case for effective international development.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_privacy/content_25.html": "This document outlines how Damian Hinds processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Damian Hinds\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Damian Hinds .\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Damian Hinds , or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Damian Hinds via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_shine-radio-december-update/content_47.html": "Tweet Friday, 13 December, 2024 Local News My end of year recording for Shine Radio: https://omny.fm/shows/petersfieldstories/damian-hinds-mp-update-for-december\nReporting Back - April 2025 Thursday, 1 May, 2025 Click here for Damian's latest constituency and Westminster update:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_work-experience/content_39.html": "Due to the sensitive nature of the work carried out by Damian's office, we do not currently offer work experience placements.\nHowever, young people interested in politics can arrange to sit in on a chamber session in the House of Commons or the House of Lords, or a committee debate on any given day. Please visit our visiting Westminster section for more information.\nDamian occasionally runs a 'Taste of Parliament' event for sixth form politics students living and studying in East Hampshire. This normally takes place over a two day period in the October half term, when Parliament is still sitting. As well as an opportunity to have a Q&A with Damian, the students will meet the teams from across Parliament who help support MPs in their day to day work. This includes HanPsard, the policy research unit and the Parliamentary archives. If you are interested in attending a future 'Taste of Parliament' event, please get in touch so that you can be added to the waiting list:\nFor career opportunities in and related to Parliament, please visit: Work for an MP",
  "https_www_damianhinds_com_/https_www_damianhinds_com_cost-living/content_19.html": "The government has set up multiple programmes to help support families, especially lower income families, with the cost of living. For more information visit, Help for Households - Get government cost of living support\nThere is a cost of living payments scheme if you're entitled to certain benefits or tax credits.\nEast Hampshire District Council has also put together advice on cost of living support\nAdditional Support\nExtra funding has been made available to local councils through the Household Support Fund to help the most vulnerable to cover their essential daily costs, like energy bills. Locally, this is being provided through Hampshire County Council's CONNECT4COMMUNITES programme.\nThose on benefits may also be eligible for an interest free BUDGETING LOAN through the DWP to help pay for things such as travel costs or buying furniture and white goods.\nFor job seekers, there is a special FLEXIBLE SUPPORT FUND that can help with the costs of finding a job, such as travel, childcare or clothing. More information on how to apply is available via Job Centres.\nThere are also useful benefit calculators for people to check they are getting the right help. These include TURN2US and ENTILTEDTO\nEnergy Costs\nAdvice for domestic customers from OFGEM\nBroadband and Mobile Costs\nSome providers offer SOCIAL TARIFFS to customers who receive certain benefits.\nComparison Websites\nThere are many comparison sites to check the best deals for many household costs, including energy suppliers, broadband and mobile providers, and insurance cover:\nhttps://www.comparethemarket.com\nhttps://www.moneysupermarket.com\nFor further advice and tips go to the Money Saving Expert website, including a weekly email service. More details at https://www.moneysavingexpert.com\nTo compare food prices across different supermarkets, go to https://supermarketwizard.com\nBanking and Loans\nAs not-for-profit cooperatives, community banks can be an alternative way to save and borrow, including the Hampshire-based WESSEX COMMUNITY BANK\nOther not-for-profit lenders include the PARITY TRUST who offer a range of loan and mortgage services\nDebt Advice\nGovernment advice on paying off debts: https://www.gov.uk/options-for-paying-off-your-debts\nMoneyHelper tool to find free debt advice: https://www.moneyhelper.org.uk/en/money-troubles/dealing-with-debt/debt…\nAge UK debt service: https://www.ageuk.org.uk/information-advice/money-legal/debt-savings/de…\nCitizens Advice: https://www.citizensadvice.org.uk/east-hampshire/\nCAP UK: https://capuk.org/get-help/cap-debt-help (general advice, with a dedicated Debt Coach for the Alton area)\nHoliday Activities\nThe Department for Education (DfE) funds local holiday activity programmes (HAF) for disadvantaged children during the school holidays. The Hampshire County Council HAF programme can be viewed here.\nHAMPSHIRE LIBRARIES also offer a range of free events and programmes.\nOther ways to cut costs\nTesco Clubcard points can be used towards a Friends & Family Railcard or Senior Railcard (https://secure.tesco.com/clubcard/browse/travel/4294967286.cat?icid=CCSV_Stamp_Travel)\nSome discounts available through membership of groups like the AA (https://www.theaa.com/smart-benefits) or RAC (https://www.rac.co.uk/breakdown-cover/enjoymore)\nFor tips on how to save money on everyday spending from online shopping, cash back sites to entertainment, go to: https://www.moneysavingexpert.com/shopping/chat-tips-gold/",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_stop-think-fraud/content_40.html": "For this week's column for the Herald and Post I return to the subject of fraud...\nI wouldn’t normally answer a call on my mobile if I didn’t see a number I recognised. But the other day I did. It had rung several times; perhaps it was something important.\n“Oh, hello. First, just to let you know, this call may be recorded for training purposes.” It was the usual patter. “Now, can you just confirm please your full name and postcode for me?”\nEr, no. He had called me, not the other way around. Luckily I spotted the oddity in time, despite the familiarity of the script. But honestly, I can see that on another day I might not have done straightaway.\n“Why are you asking me that? And who’s calling?”\nThe line went dead.\nNow I don’t actually know of course what the purpose of that call was, but I suspect it might have been part of a process of ‘building out’ contact lists for defrauding people weeks or months later.\nThe fraudster starts with a set of random mobile phone numbers; that’s not worth much to anyone. He needs to attach personal detail to each number to make it useful, and if he can get a name and a postcode, that could be used to link to other sorts of data.\nThe eventual use of that data might be an attempt at so called ‘authorised push payment’ fraud where the person who contacts you knows so much about you that it must be the bona fide bank / utility company / etc, right?\nI learned when I was at the Home Office working on the Fraud Plan just how complex and sophisticated the business is. The criminal group carrying out the final stage of the fraud may not be the same one that builds out (and then sells) the target list, and the man who phoned me may not even have known he was part of a criminal activity at all. Others may do web site infrastructure, place ads and so on, with others again laundering the proceeds.\nThere are many methods of approach: phone, text, email, the post, fake web sites and social media profiles, and in-person. And many different types, from high-value investment fraud, to too-good-to-be-true shopping scams, to the horrible genre of romance fraud.\nA further complication is that, unlike most ‘traditional’ crime, much of fraud is so-called ‘distance crime’. Indeed the distances can be great, and outside British jurisdiction. Estimates are that most fraud has at least some international element, and that 1 in 4 UK frauds involve no UK-based perpetrator at all.\nThere has been progress, with the Fraud Plan, and concerted effort from both law enforcement and industry, especially the banks. Those extra checks on your banking app may slow things down a bit – but they have disrupted many a scam.\nEstimates from the most recent Crime Survey for England and Wales show a 13% decrease year-on-year. But there is still far too much. I know from the Hampshire Economic Crime Unit the breadth of frauds that have been seen in our area.\nThere is more work going on all the time to disrupt and deter the organised crime gangs behind this. But there is also much we can do ourselves.\nAs the new National Campaign Against Fraud puts it: “By staying vigilant and always taking a moment to stop, think and check whenever we’re approached, we can help to protect ourselves and each other from fraud.”\nPlease do take a moment to visit: stopthinkfraud.campaign.gov.uk.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_campaigns_housing-and-planning/content_46.html": "East Hampshire is a beautiful place to live and work in. The combination of stunning countryside, vibrant towns, beautiful villages and easy access to London and the south coast is a real draw for those of us lucky enough to live here.\nHousing in East Hampshire\nEast Hampshire, like the rest of the country, needs to build more homes. It is a particularly acute issue in our area, as is the case in most of the South East, because of the high house-price-to-income ratios. Whilst we do need to build more, we also need to protect our green spaces and ensure the correct infrastructure is in place to support new settlements. I firmly support the ‘brownfield first’ principle, but a constraining factor in East Hampshire is that we have relatively little brownfield space for development.\nEast Hampshire District Council has a 'local plan', covering the period 2012-2040. In late 2023, the council consulted on a draft of this local plan, which set out indicative sites for new homes. Many of you responded to this consultation and also got in touch with me to raise concerns about the sites being proposed, including areas near to Alton. Proposed house building, in or near to an established community, is always going to be controversial and I do completely understand the strength of feeling about some of the sites that have been put forward. The responses to the consultation can be viewed here.\nNational Planning Policy is set by central government, which produces guidance for local planning authorities such as East Hampshire District Council. The government has now consulted on revising the National Planning Policy Framework (NPPF). This follows the previous government's revisions to the framework in 2022 (which East Hampshire District Council's draft local plan was based on), In simple terms, what is now being proposed - a new 'standard method' - would mean a much higher housing target for East Hampshire. The information provided by the government during the consultation suggests that the required uplift to East Hampshire's housing targets is 86%. I believe such a sizable uplift cannot be accommodated by our existing infrastructure and so schools, GP surgeries and other local infrastructure would struggle to cope.\nI have raised my concerns about this new target both to the Ministers at the relevant government department in my response to the consultation (see below) and in a several debates in Parliament. This is how the Independent reported my most recent Westminster Hall debate on rural housing targets: Government accused of having ‘rogue algorithm’ for deciding housing targets | The Independent\nTheoretically the next stage of the local plan is for East Hampshire District Council to formally respond to its consultation. This was anticipated to take place in the latter half of 2024, but will now need to take into account any changes to the housing target for East Hampshire following the Government's review of the NPPF, so will, most likely, push into 2025.\nWhen I meet constituents concerned about the impact of house building on their community I always stress that any proposals will have to take into account the future infrastructure requirements of additional households, including the impact on local roads and public transport, as well as water and sewage services. Providers of these services are known as 'statutory consultees' and play a key role in any decisions about housing in an area. Other essential services, such as GP surgeries, dentists and school places, also need to be taken into account when housing developments are being considered. I am in regular touch with the Integrated Care Board for Hampshire and the Isle of Wight (which oversees NHS services in Hampshire), as well as the education team within Hampshire County Council, to understand how they are planning for any future housing developments.\nPlanning and the South Downs National Park\nA unique complicating factor for our area, and one i have spoken at length about, is the existence of the South Downs National Park, which has a boundary that runs through the middle of East Hampshire's planning area. As a result, East Hampshire is partly in the national park and partly outside it. The critical point is that different planning rules apply to national parks.\nAny uplift to the government imposed housing target would place further pressure on areas outside the national park - Alton, Four Marks, Medstead - which have already seen significant development in recent years.\nFurthermore, decisions about housing developments within the national park rest with the South Downs National Park Authority and not with East Hampshire District Council, which is another complicating factor.\nMy view is that there should be different targets for developments inside and outside national parks. I will keep pushing the government on this point.\nThe BBC recently ran this story which shows some of the issues involved with the government’s new housing targets, and illustrates (see the map) some of the anomalies created, including that targets in London are actually going down https://www.bbc.co.uk/news/articles/crk4y05vp61o\nA31 Veolia Incinerator\nBack in 2022, I campaigned against Veolia's plans to convert its current recycling site on the A31 near Alton into an incinerator. Despite the recommendation from planning officers at HCC to approve Veolia's application for planning permission to build and operate the incinerator, I was delighted that Hampshire County Council refused planning permission at their meeting on the 23 February 2022. Supported by councillors Mark Kemp-Gee, Andrew Joy and Adam Carew, I lodged objections during the public consultation periods, stating at the time that:\n“If this kind of facility is required (and, to my mind, that is a very big ‘if’), there must be a better location for it. The beauty of the Wey Valley is precious and the impact of the proposed facility on our countryside, the historic town of Alton and its surrounding villages is, I believe, unacceptable.\" I commend the No Wey Incinerator group for the enormous amount of work undertaken by its members to present detailed and cogent arguments against Veolia’s proposal.\"\nThe deadline for Veolia to appeal the planning refusal was September 2022. No appeal was submitted.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_reporting-back-april-2025/content_6.html": "Tweet Thursday, 1 May, 2025 Reporting Back newsletter Click here for Damian's latest constituency and Westminster update:\nChancellor urged to act as childcare sector faces growing financial pressure Thursday, 1 May, 2025 President Trump’s tariffs have added fresh uncertainty to an already fragile UK economy.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_campaigns_new-hospital-hampshire/content_2.html": "Damian spoke at an Adjournment debate on the future of healthcare in Hampshire. He pressed on the government’s plans for the new Basingstoke hospital, especially important for residents in and around Alton and Four Marks. Speaking at the time, Damian said: \"we must have no further delays; the minister’s answer was fairly encouraging\".",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_romance-fraud-protecting-yourself-and-others/content_59.html": "This article was written by Damian and published in this week's Herald and Petersfield Post:\n\"Romance and fraud are two words that do not belong together. But we are seeing a growing trend in this type of deception, not only by opportunistic individuals but also by the calculated and organised efforts of criminal gangs.\nA new survey ahead of Valentine’s Day found that almost two in five people who have dated someone online have been asked for money, with many giving or lending the money when asked.\nNew figures from Hampshire Constabulary show that residents across the county and the Isle of Wight lost £3.1million through dating scams between November 2020 and October 2021, with a total of 262 reports during the twelve month period.\nResidents aged between 50 and 59 were the most at risk of romance fraud, with more than a fifth of all victims in that age bracket, followed by people aged between 60 and 69. But people in their twenties are victims too.\nCriminals use a range of tactics to get victims to transfer money without it raising suspicion. Their stories are often quite plausible, particularly as the online relationship develops, including funds to enable travel or for emergency medical expenses.\nThe reality however is that the person is likely to be using a fake profile to build a relationship to gain the trust of someone who may be lonely or vulnerable.\nTechnology has altered our lives in so many ways, including how we meet and date, and that has of course been magnified during the pandemic. We may be more connected than ever before, but communicating via online platforms does present greater opportunities for fraudulent and misleading activity.\nThere are ‘red flags’ that should make us suspicious, whether for ourselves or on behalf of friends and family, particularly if the individual has not been met in person.\nAny request to send money or to transfer money on someone else’s behalf, providing copies of personal documents such as passports or driving licences, purchasing and providing codes for gift cards or sending parcels on behalf of another person should all be regarded with hesitation.\nFraudsters may ask the victim to come off the dating platform where they met and use a different messaging service so they can’t be monitored or easily reported. That’s often an early warning sign.\nThere are practical steps that can be taken to help protect against this type of fraud. Ensuring adequate privacy settings on social media accounts helps prevent strangers getting access to personal information. A ‘reverse image search’ (go to Google Images and click on the camera icon) can sometimes help identify whether a photo has been taken from somewhere, or someone, else.\nIf you think you, a friend or a family member has been a victim of romance fraud or a romance-based scam, then it is important to contact you bank immediately and report it to Action Fraud on 0300 123 2040 or via actionfraud.police.uk.\nOnline fraud is an important part of my brief as Security Minister, and I would encourage everyone to stop and consider whether a situation is as genuine as it may appear – to pause and think if everything you’re being told really does make sense.\nFor more information on how to protect yourself and others against fraud, go to: www.damianhinds.com/campaigns/tackling-fraud\"",
  "https_www_damianhinds_com_/https_www_damianhinds_com_cdn-cgi_l_email-protection/content_67.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_campaigns_supporting-our-farmers/content_28.html": "Farming remains an important part of life here in East Hampshire, both in terms of the local economy but also the contribution to local communities. I maintain regular contact with the local NFU team and local farmers to discuss the issues that impact them and the sector more widely.\nAccording to the local NFU team, more than 75,000 acres across East Hampshire is farmed, employing more than 1,000 people, making it a vital sector for the local economy. The predominant sectors are cattle, sheep and crops.\nFinancial support for Farmers\nChanges to Agricultural Property Relief (APR) announced in the Autumn Budget (October 30th 2024) mean that many farms with assets over a threshold will now pay inheritance tax at 20 percent from April 2026. APR is an important relief that enables family farms to be passed down through generations. Damian is campaigning for this tax change to be reversed - do join him in opposing the government's decision to cut inheritance tax relief for family farms by signing the petition at: www.stopthefarmtax.com\nDamian continues to push the government to rethink its proposals on inheritance tax - see above clip from the recent E-Petition debate on the inheritance tax proposals (10 February 2025).\nIf you are a local farmer and you have concerns about the impact of this tax on your business, please do get in touch.\nSheep worrying\nAttacks on livestock is a significant issue for farmers across the country, and, beyond the emotional impact, it can have substantial financial consequences for their businesses.\nAnd with the rise in dog ownership during the pandemic, there is a need for people to be more aware of how and when to control their dogs when accessing farmland. The Countryside Code provides important guidance for the general public.\nRural Crime\nBreak ins and vehicle loss remains an on-going issue within rural communities like East Hampshire, and Damian takes part in Hampshire Constabulary's Rural Crime Tactical Board to represent the interests of local residents, alongside other key local stakeholders.\nAlthough crimes should always be reported to the police via the 101 service, the Hampshire Alert initiative is another way for local people to exchange information with the police, to help detect and prevent crime and anti-social behaviour.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_campaigns/content_37.html": "Water recycling proposals at Havant Thicket Scroll to the bottom of the page to give me your views on the water recycling proposals at Havant Thicket reservoir The South East is ‘water stressed’. The...\nA new hospital for Hampshire Damian spoke at an Adjournment debate on the future of healthcare in Hampshire. He pressed on the government’s plans for the new Basingstoke hospital...\nSupporting our farmers Farming remains an important part of life here in East Hampshire, both in terms of the local economy but also the contribution to local communities. I maintain...\nSupport for Veterans Damian partnered with the Petersfield Royal British Legion and East Hampshire District Council to hold a Veterans Festival on Friday 24th January 2025 at the...\nHousing and planning East Hampshire is a beautiful place to live and work in. The combination of stunning countryside, vibrant towns, beautiful villages and easy access to London...\nBanking in East Hampshire It is a sad fact that the number of high street bank branches in local communities is diminishing. In East Hampshire, some have closed in recent months...\nUnderstanding the analogue switch off The UK's old analogue landline network (otherwise known as PSTN) is being switched off in 2027. What this means is that all devices that currently rely on the...\nStaying safe online The government's 'Stop! Think Fraud' campaign is a one stop shop for everything you need to know about protecting yourself online. For advice on identifying a...\nBetter Broadband for all The previous government’s ambition was to deliver nationwide gigabit-capable broadband as soon as possible. Over 70% of premises can now access the fastest...\nLocal issues that affect us all I continue to raise issues that impact local communities across the East Hampshire constituency, including concerns about flight traffic and noise at...\nExcellence in education The Government committed to creating 3 million high quality apprenticeships by 2020, giving thousands of young people a chance to make the most of their talents and gain new skills, whilst working an\nDementia Friendly communities I am delighted to be working with the members of Dementia Friendly Petersfield to support the initiative to increase the awareness and understanding of dementia across the town, so those affected feel more supported by the businesses and services they rely on.",
  "https_www_damianhinds_com_/https_www_damianhinds_com_news_reporting-back-january-2025/content_57.html": "Tweet Friday, 31 January, 2025 Reporting Back newsletter Click here for Damian's latest constituency and Westminster update: Monthly constituency update from Damian Hinds MP\nReporting Back - April 2025 Thursday, 1 May, 2025 Click here for Damian's latest constituency and Westminster update:",
  "https_www_damianhinds_com_/https_www_damianhinds_com_accessibility/content_16.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}