{
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_parliament/content_3.html": "Tweet Photo credit: House of Commons, LinkHere, you can see Andrew Bowie's speeches and appearances in Parliament (provided by theyworkforyou):\nEnergy Prices: Energy-intensive Industries | Commons debates Grangemouth, the Luton Vauxhall plant and now the Moorcroft pottery in Stoke-on-Trent—every single week, we hear of more job losses in energ\nEnergy Grid Resilience | Commons debates I thank the Minister for advance sight of his statement, and echo his comments; of course, the Conservatives’ thoughts are with all those af\nTopical Questions | Energy Security and Net Zero | Commons debates Voters “feel they’re being asked to make financial sacrifices…when they know that their impact on global emissions is minimal… Present polic\nGreat British Energy | Energy Security and Net Zero | Commons debates When GB Energy was first proposed, we were told it would employ 1,000 people and create 650,000 jobs.\nTopical Questions | Energy Security and Net Zero | Commons debates To be honest, I was looking forward to hearing what I said a few weeks ago, Mr Speaker.\nTopical Questions | Energy Security and Net Zero | Commons debates Voters “feel they’re being asked to make financial sacrifices…when they know that their impact on global emissions is minimal… Present polic\nTopical Questions | Energy Security and Net Zero | Commons debates To be honest, I was looking forward to hearing what I said a few weeks ago, Mr Speaker.\nGreat British Energy | Energy Security and Net Zero | Commons debates When GB Energy was first proposed, we were told it would employ 1,000 people and create 650,000 jobs.",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_category_Westminster-News/content_11.html": "Stop the Family Farm Tax 19th November 2024 Business Relief and Agricultural Property Relief (APR) are long-standing components of the tax regime. Without them, many businesses, including farms and family... Westminster News\nAndrew appointed to Shadow Cabinet 5th November 2024 Andrew Bowie MP has been appointed to serve as Shadow Secretary of State for Scotland in Kemi Badenoch's new Shadow Cabinet. Andrew, who supported the new... Westminster News\nSuspicions raised over GB Energy jobs goal 9th October 2024 At the first bill committee meeting for the Labour Government’s Great British Energy Bill Andrew joined colleagues in questioning the newly appointed chairman... Westminster News\nAndrew elected as vice-chair of Scotch Whisky APPG 8th October 2024 Andrew Bowie has been elected by colleagues as a vice-chair of the Scotch Whisky All Party Parliamentary Group. This group, chaired by North East Fife MP Wendy... Westminster News\nAndrew Bowie re-elected 8th July 2024 Andrew Bowie was re-elected for the third time at the general election held on the 4th of July 2024. Andrew has represented the constituency of West... Westminster News\nAndrew welcomes Autumn Statement 24th November 2023 Andrew Bowie MP has welcomed the measures brought forward by the Chancellor during his Autumn Statement. Addressing the House of Commons on Wednesday Chancellor... Westminster News\nAndrew Bowie is elected to Defence select committee 25th October 2022 Andrew Bowie MP has been elected to Westminster’s select committee on defence. The committee is appointed by the House of Commons to scrutinise the Ministry of... Westminster News\nNeglect Oil and Gas Sector at Your Peril 19th October 2022 Work with, Not Against Industry to Tackle Climate Change and UK Energy Security – Says Andrew Bowie With West Aberdeenshire & Kincardine being home to thousands... Westminster News\nConfidence Vote In Boris Johnson 8th June 2022 Five years ago, on the 8th June 2017, I was elected as your Member of Parliament. As such it means our constituency, and its predecessor, Kincardine and Deeside... Westminster News",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_contact/content_6.html": "Please find contact details for Andrew Bowie MP below.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_category_Speeches/content_17.html": "Andrew Bowie MP full Scottish Conservative Conference speech 1st March 2024 Good Morning Aberdeen! And welcome to Conference. It’s a real honour to welcome you all here, to the North East, to our Granite City. A city that is proud to be... Speeches\nAfghanistan Crisis Debate - Andrews Contribution 19th August 2021 Yesterday Andrew spoke in the debate on the Afghanistan crisis, and pledged to continue doing all he can to help families that have contacted him from the... Speeches\nSupport to Abolish the Fixed Term Parliament Act 7th July 2021 Earlier today Andrew spoke during a debate on the Fixed Term Parliaments Act, he supported the Governments proposal to abolish the act which he described on... Speeches\n\"Caution and Pragmatism\" - Covid Secure Borders Debate 16th June 2021 Last night Andrew spoke during the Covid Secure Borders debate in the house of commons. Drawing on his own experience of witnessing loved ones unable to see... Speeches\nEducation Debate - SNP Fail to Show Up but Andrew Speaks Up for Scotland 10th June 2021 Yesterday Andrew spoke in Parliament during a debate on education. Not a single SNP Member of Parliament was present for the debate, leading Andrew to question... Speeches\nEnvironment Bill - Andrews Contribution to the Debate 31st May 2021 Last week the UK Government brought forward an exciting, transformative and ambitious Environment Bill. Watch Andrews contribution to the debate here - https:/... Speeches\nAndrews Heartfelt Speech on Dementia 27th May 2021 \"As a little boy, I remember lying in my bed, praying that the gran I knew when I was younger would return, that she would once again recognise me.\" Andrew... Speeches\nAndrew Invites Prime Minister to Stonehaven 19th May 2021 Today Andrew used PMQs to outline his support for a \"Global Britain, with Scotland at its heart, championing Free Trade\" He spoke about the relationship between... Speeches\nQueens Speech reaction from Andrew 13th May 2021 Jobs, Jobs, Jobs! Andrew spoke in support of the Queen's Speech during debate in Parliament today. Andrew said that he hoped \"we can work together with the... Speeches",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_stop-family-farm-tax/content_14.html": "Business Relief and Agricultural Property Relief (APR) are long-standing components of the tax regime. Without them, many businesses, including farms and family businesses, would cease to exist or would be broken up on the passing of their owner. They are critical to business planning and succession planning.\nWhen in Opposition, the Secretary of State for Environment, Food and Rural Affairs stated that the then Opposition had no plans to change Inheritance Tax, including APR. However, at Autumn Budget, the Government announced that, while there would continue to be no Inheritance Tax on combined business and agricultural assets worth less than £1 million, above that there would be a 50 per cent relief, at an effective rate of 20 per cent, from April 2026.\nMany farms would simply not survive the imposition of Inheritance Tax. Families who have farmed the land for generations could be forced to give up their businesses, their farms, and their homes, which could jeopardise the sustainability of the rural economy, as well as undermining efforts towards greater self-sufficiency in food production and compromising environmental goals.\nInheritance Tax is a tax on the estate of someone who has died, including all property, possessions, and money. The standard Inheritance Tax rate is 40 per cent. It is only charged on the part of your estate that is above the tax-free threshold, which is currently £325,000. This is known as the nil rate band.\nAndrew is aware that, at Autumn Budget, the Chancellor set out plans to bring unused pension funds and death benefits from a pension into a person's estate and alter Agricultural Property Relief and Business Property Relief.\nHe is also deeply concerned about the impact of these reforms, particularly on farms. Many farms would simply not survive the imposition of Inheritance Tax. Families who have farmed the land for generations could be forced to give up their businesses and their homes, jeopardising the sustainability of the rural economy and food security.\nTell Labour to stop the family farm tax here: Stop the family farm tax",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_cameron-and-his-modernising-agenda-inspired-my-generation-who-or-what-will-inspire-next/content_15.html": "My political life has been dominated by referendums.\nBy arguments over national identity.\nFirst the 2014 referendum on Scottish Independence. Then the 2016 referendum on our membership of the European Union.\nThis is not why I got into politics. I joined the Conservative and Unionist party, not because I was a unionist - Scottish separation was just not an issue back then - but because I am a conservative.\nBut I would never have joined had it not been for one man, David Cameron. I joined the Conservative Party because I believed in the modernising agenda that David Cameron brought. Because I thought you could believe in free markets, private enterprise, personal responsibility, aspiration, fiscal responsibility and low taxes - whilst also believing we have a responsibility to act on man-made climate change; that two people in love, whatever their gender, should be able to marry; that the NHS was an institution to be as proud of as the British Army; and that our response to mental health could be better than simply asking people to keep a stiff upper lip. Cameron represented a modernising force that redefined centrist politics and left Labour - and the SNP at the start of its dynastic crumble - struggling to find relevance.\nI was three weeks too young to vote in the 2005 General Election. Thank goodness, because I had absolutely no idea who I would have voted for! It was just after this, whilst waiting to join the Royal Navy, I found myself working at my local Morrisons Supermarket. I loved it. I still miss it.\nAnd one day, whilst waiting to start my shift, sitting in my dad’s car outside the store, I listened, in awful quality to Radio 5 Live's coverage of David Cameron winning the leadership election (DAB in a car was a dream back then). And I knew then that the Conservative Party was my party.\nBecause for me, David Cameron spoke to my generation. A generation that couldn’t remember Thatcher, but was born when she was in Downing Street. That grew up through the Blair years, entered the world of work through the Brown years and suffered, as we did, the financial crisis. Are old enough, just, to remember a pre-internet age but that were the first users of Facebook and YouTube; to remember when going for a night out meant waking up the next day reeking of the stale smoke of the club the night before. That thought playing \"snake\" on a Nokia **** or owning a Tamagotchi was the limit of technological advancement. That had the terrifying experience of, shock, actually speaking to a girl or guy before going on a date.\nWe grew up in a different age.\nMy point is we, my generation, the “Cameroons”, are about as far removed from the lived experiences of young people today as Michael Howard or Iain Duncan Smith were from my generation and our values, concerns and dreams in the mid-2000s.\nAnd, to go back to the start of this piece, I wonder if our focus particularly in Scotland on national identity or referendums, has got in the way of our recognising that, as we in the political and commentariat class re-fight, as nauseam, the battles of 2014 and 2016, there is a whole new generation out there in the country we are not speaking to.\nA generation who have never known a world without social media, on whom the demands to look, speak or act a certain way have never been more demanding. Who are being asked to define themselves in ways even I don’t fully understand.\nA generation who, just as friends of mine fought the battle for equal marriage, now fight for recognition of Trans rights. A generation for whom owning a house is simply unimaginable. And a generation who have had their whole lives turned upside down, put on hold, due to our actions in locking down the country last year to combat the pandemic.\nI have been saying for a while now that the current generation of 18-25s have been more affected, not physically or medically, but mentally and socially by the pandemic than any other. School life on hold. Travel banned. The work place closed down. University or college experience changed beyond recognition. The simple pleasures of going out and - shock - dating, banned.\nBut I hadn’t fully understood the sheer enormity of the impact until I had the privilege of speaking on a panel, organised by Onward and Speakers for Schools at Conservative Party Conference alongside a 17-year-old who *should* have sat her GCSEs last year.\nThe words she used - prison, hopelessness, despair, trapped, abandoned - to describe her experience of being in education over the past year and half was so powerful it brought some in the room to tears. It was the best speech at Conference by far. And it gave me pause for thought.\nWe have an obligation, a responsibility to these young people. We, who took the decisions that put their lives on hold, must reach out, must listen, must start engaging and talking about the issues that affect them. We cannot assume we have the answers if we do not even know the questions to ask. We cannot, for example, blithely talk about changing the student finance model without understanding the fear and worry this causes for students aspiring to a university education but who know their parents can’t afford it at the minute.\nSo that is the challenge I lay at the feet of my colleagues in the Conservative Party. Talk to this generation in the way that Cameron spoke to mine. Engage, challenge and be challenged. If we do, we reap the rewards and change this country. If we don’t, we risk becoming as irrelevant and out of touch as the male, pale and stale Tory party of the late 90s and early 2000s felt to me.\nIf we don't others will, who conflate values and issues with national identity. Or others who simply weren’t in power when the decisions were taken. We cannot afford for that to happen.",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_when-sweden-went-right-and-what-conservatives-can-learn/content_9.html": "The Conservatives did not lose the General Election. The Conservatives won 42.4 per cent of the popular vote – the highest since 1979. The Conservatives remain in Government. The Scottish Conservatives are the Official Opposition in Scotland having won 22 per cent of the constituency and regional votes – the highest in the age of devolution. The Conservatives are not in crisis.\nAll this must be remembered. It must also be remembered that you cannot simply transpose the experience of one political party in another country into another. Different societies, political traditions and histories make that an impossibility.\nBut I do think one of those experiences has timely and pertinent lessons for us.\nTwo days before Christmas found me sitting in the Ericson Globe in central Stockholm attending my first-ever ice hockey game – Djurgarden v Lulea. Also in the crowd happened to be the former Prime Minister and leader of the Swedish Moderaterna, Fredrik Reinfeldt.\nI didn’t know this until the big-screen cameras zoomed in on him. Immediately I had that sinking feeling that always comes when politicians are shown in the crowds at sporting events as I awaited the ritual booing. However, instead, the entire arena suddenly applauded. I was stunned. The Swedes are known the world over for being a reserved and polite people, but after seven years of visits, I knew enough about them to know that when it came to their politicians, they were just as critical and certainly less respectful than even the Brits!\nThe applause? Mr Reinfeldt, it turns out, despite leading his party to defeat in 2014, remains incredibly popular with the majority of Swedes. Why?\nThis is the story of the reform, rise, and electoral success of the Moderaterna under Reinfeldt, why he positioned the party where he did and how, for the first time ever, he led them to two successive election victories.\nAt its heart, the Swedish Moderaterna of today are a pragmatic, liberal, centre-Right conservative party espousing views similar to those of David Cameron in his reforming pomp in the late 2000s.\nThis was not always the case. Relying too heavily on its base, seen as the party of the aged and privileged, the Moderaterna slumped to an all-time low in the general election of 2002, polling only 15.2 per cent.\nFast-forward four years and, under Mr Reinfeldt, the party found itself with 26 per cent of the vote, at the head of a centre-Right coalition Government which commanded a majority of seats in the Reichstag.\nHow did they manage this incredible turnaround? Of course, the popularity of Mr Reinfeldt helped, but the Swedes didn’t simply wake up one morning day and decide to throw off decades of socially democratic consensus. And the fact remains that, even today and even on the Right, the Swedish people overwhelmingly favour consensus, equality and expansive public services. In this I would suggest they are quite close to the Scots.\nAnd yet, in 2006, they elected a radically centre-Right government. In 2010, they re-elected them.\nHow? Well, the first lesson to be learnt is that people, all people, like stability and reassurance. In this the Swedes are no different. With this in mind, Reinfeldt took possibly the biggest gamble of his time as leader of the opposition when in 2004 he conducted an interview with a trade unionist magazine in which he declared that he believed the Swedish labour law (one of the most generous in the Western world) was working. He even went so far as to say that he believed it provided a quintessential foundation for safety in the labour market. This was something no Moderaterna leader had said – nor would have dreamed of saying. But Reinfeldt knew that ordinary Swedes would not vote for a party that was intent on tearing up the foundations on which many Swedes had built their lives and livelihoods.\nFor the next 10 years – eight of which were in Government – Swedish Labour law remained untouched. More than that, in the two years leading up to the 2006 election, he accepted and adopted every single promise made by the Social Democrats on social welfare spending – even going so far as to as to improve on some of them.\nHe switched the party’s priorities from cutting tax for the wealthy to making tax fairer for the middle-income earners in an effort to widen the tax base, and in Government he drastically cut taxes for the lower paid in an effort to stimulate the economy.\nHe made the Moderaterna relatable to ordinary, middle-class, middle-aged Swedes. He made sure that the Moderaterna were the ones that understood and could find solutions to the “life puzzle” facing that most important group of voters – upwardly mobile, educated, young professionals bringing up children.\nWith radical policies on education and health, with a promised tax break on household services, and by promising to keep but reduce the cost of the social democratic welfare state, the Moderatna were able to appeal to a group we would know as “the just-about managing”.\nThere was one more, tactical decision taken by the party – they did politics differently. For decades, the default position in Scandinavian politics had been to “react” to Social Democrat policies. To allow themselves to be defined by their opposition to Social Democrat positions. Indeed, in Norwegian Social Science, the Social Democrats are frequently described as an eagle, soaring above the fray, causing all below to take up reactive, defensive positions. The Moderaterna under Reinfeldt changed all that. They simply ignored the Social Democrats and embarked on a programme of announcing new and radical policies and decisions, forcing the Left on to the back foot for the first time in a generation.\nAnd so in 2006, the Moderaterna were elected with over a quarter of the popular vote, at the head of a centre-Right coalition (the Alliance) and embarked on an ambitious programme of reform – reducing the size of the state, overturning decades-long consensus, making the system easier for SMEs to start up and grow, introducing free schools and choice to education, allowing private companies to compete for government tenders in public transport and delivery of health services, and beginning a massive programme of infrastructure investment. Quickly, the results were seen – Sweden became one of the most business-friendly countries in Europe and a hub for high-tech start-ups (see, for example, Spotify).\n2010 saw the Moderaterna re-elected with 30 per cent of the vote, and although the Alliance did lose its overall majority, this was the first time in a century that a centre-Right government had been re-elected in Sweden. By 2011, whilst much of the West was still in a stuttering recovery from the economic crisis, Sweden’s economy (which had barely been touched by the recession) was growing at 6.4 per cent, unemployment was falling, it had established a budget surplus and public debt was sitting at around 40 per cent of GDP.\nWhat happened next was unfortunate – a rise of the far Right, stoking anti-immigrant tensions, eroded a small but significant part of the Moderaterna’s base as well as a sizeable proportion of Sweden’s blue-collar workers, whilst a stubbornly immovable long-term unemployment figure cast a pall over otherwise miraculous economic growth. Therefore, compounded by a natural desire for change reflected in all democracies, the party, despite still polling in the mid-20s (in a 10 party system) and despite the alliance picking up 141 seats out of 349 (after eight years in government), the Moderaterna found themselves back in opposition. Reinfeldt promptly resigned as leader.\nDespite this loss (which they may be about to overturn in this years general election), one can only look back with awe at the reforming zeal Reinfeldt brought to a flailing, unattractive political party. Turning it around, making it appeal to a new key demographic, succeeding in winning two general elections, transforming the “Swedish model”, the Swedish economy and wielding an influence on the European and world stage far beyond what Sweden’s 10m-odd population would seem to justify.\nAs I said, I will let the reader draw his or her own lessons and conclusions from this remarkable story.\nHowever, what is clear to me is that a popular leader, with radical policies and a willingness to gamble, can take a party that was once thought of as irrelevant and on the fringes to recover the centre ground, recover legitimacy and recover relevance.\nThe Moderaterna became a party unafraid to reform itself in order to regain legitimacy. And in showing it could reform itself, it proved it could reform the country. It became a party willing to take a gamble in order to win the trust of the people and appeal to a new demographic. It became a bold party willing to take radical action, introducing competition and choice into healthcare and education. And it became a party that refused to solely be defined by its opponents. It ignored the cosy consensus and appealed directly to the people.\nSurely I can’t be the only one to see the parallels and opportunities for us, our party and our nation?\nOriginally published on CapX.co on the 16th January 2018\nhttps://capx.co/when-sweden-went-right-and-what-the-conservatives-can-l…",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_why-i-will-vote-against-assisted-dying-bill/content_7.html": "Parliamentarians will soon be asked to vote on whether or not to legalise assisted dying here in the United Kingdom.\nThis is a devolved issue, and I am aware that there is a similar Bill proceeding through its stages in the Scottish Parliament. However, as an elected member to the UK Parliament, I have a responsibility to vote on all legislation put before us - especially on something as consequential with such far reaching consequences as this.\nFirstly, I and many of my colleagues are deeply unhappy with how this issue has been handled by the Government. We were a little over five weeks from the vote when any detail at all was published and are expected to vote following only five hours of debate on the floor of the House due to this not being “Government Business” – essentially, the Government have outsourced this hugely contentious bill to a back-bencher to bring in through the Private Members Bill process. This, it has to be said, is deeply worrying to many and, whatever your view on the issue, I think the British people deserve for this issue, one that would signal a marked change in how we perceive life, death and the role of medical professionals in that process here in this country, to have far more time and consideration before voting.\nHowever, I have to take a decision and, as an MP, defend my position to my constituents and the country. I will be voting against the Assisted Dying legislation.\nNot only for the reasons set out above, but because I fundamentally believe in the sanctity of human life and, whilst understanding the obvious, heartfelt, sometimes heart-rending calls for it and do not doubt for one moment the motivations behind those pushing for this change in the law, I would be unable to square my belief that all life is sacred and that the voluntary taking of it should be done only in the most extreme circumstances.\nI am also concerned by the examples in Oregon, Canada and the Netherlands - all of which legalised Assisted Dying with the same safeguards as are being proposed in this bill, but that now see far more people, for a fare wider variety of reasons that were ever envisaged, now seeking to end their lives. Instead of heading down this path we should be investing more in palliative care and in the services needed to support those with the complex situations that lead them to a place where the only option, they see, is to take their life.\nWe must not, in my view, ever move towards a place where someone requiring intense care feels they are a burden on the state or on their family, for whatever reason. In that scenario, too many could feel duty bound to choose to end the suffering of their loved ones by ending their life.\nI know the supporters of this bill will say that the safeguards proposed will prevent this from happening. But that is what they said in Canada. We cannot allow it to happen here.\nThis is a serious debate with heartfelt views on all sides. I respect all of those on each side of this debate. Indeed, some of my greatest friends are arguing passionately for this change. But this Bill requires far more time, thought and consideration before it is presented to the House of Commons for a vote.\nAnd for that reason, as well as the others listed above, I will be voting against it when it comes before us.",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_andrew-explains-why-he-backs-agriculture-bill/content_13.html": "I have the pleasure of representing a constituency in Aberdeenshire, home of the best beef, lamb, berries & cereals produced anywhere in the United Kingdom with the most determined farmers in the country – battling snow and frost in late Spring for example- and ensuring that food production has continued in this most difficult time.\nAgriculture is devolved. So the majority of what this bill seeks to implement will apply in only in England or England and Wales. In Scotland we have seen the Agriculture (Retained EU Law and Data) (Scotland) Bill introduced to the Scottish Parliament ahead of new legislation coming in due course.\nAs the official opposition in the Scottish Parliament, the Conservatives supported this bill last week and will play our part in scrutinising any legislation to ensure our new agriculture framework is the best for Scottish farmers that it can be- freed as they will be from the restrictive Common Agricultural Policy.\nHowever, there are important reasons for Scottish MPs to take interest in this bill, for whilst policy and implementation of that policy is wholly devolved, agriculture in our United Kingdom operates in a single market across our islands.\nAnd, of course, crucially, the funding for agricultural support – despite mechanisms being developed in Holyrood, will be delivered by the UK Government as part of a pan British funding framework.\nThis bill also seeks to make provision for UK-wide reporting on food security which is vitally important.\nIt is welcome to see in the bill, the commitment to the creation of a framework to allow Great Britain’s meat levy boards, to work establish a system for fair redistribution of levy. It has been a matter of contention for a, well, very long time that farmers in Scotland lose out to the tune of around £1.5million a year due to the animals they have reared being sent to other parts of the UK for slaughter.\nThe interim measures, allowing ring fenced funding to be spent across the country by the boards, works fine, but a permanent solution is long overdue.\nScottish farmers will also welcome the introduction of obligations for fair contractual relationships between producers and purchasers. We need fairness in the supply chain.\nBut, much of the focus around this bill has been on the proposed New Clauses 1 and 2, in the names of my Honourable Friends the Members for North Dorset and Tiverton and Honiton respectively. I fully understand why the New Clauses have been proposed. And the Honourable Member for North Dorset will know that it is incredibly rare for me to disagree with him on any matter - and I do so today cautiously and with the utmost respect… for I know that the intention behind his and the Member for Tiverton and Honiton is utterly good- to protect UK farmers from competition from sub standard imports.\nHowever, in attempting to enshrine in law, as an amendment to this bill, that any future trade deals with any other country should require that country to have the same high standards as our own, could be, potentially, damaging.\nFor example, none of the transitioned EU FTAs, such as its agreement with South Korea, or South Africa, have exported domestic welfare production standards; the existing mandate for our European Union Trade Deal – a deal we all want to see succeed, would have to be altered; no current imports to the UK are required to meet our domestic production standards and the World Trade Organisation – an organisation we defend and support, requires outcome based trade deals, not process based rules and would see this, rightly as extra territorial regulation. So a challenge there would be expected.\nIn the next 30 years, supply of food needs to rise by about 50% to meet the needs of a wealthier, growing, global population. I don’t want anything that would stand in the way of our high quality, world leading Scottish and British products reaching the shelves of consumers around the world.\nIt is precisely our high standards and high quality of produce that makes our produce so attractive to the outside world. And, because of that, and because we believe in high welfare standards, the Government has given its commitment that in negotiating trade deals, we will not allow our domestic welfare production standards to be in any way diminished. We will protect, defend and enhance our food safety, environmental and animal welfare standards and we will actively seek to export these, world leading standards, and our expertise, to new partners around the world.\nI think the Government should take notice that significant numbers of Honourable Members, particularly from rural constituencies, myself included, will be watching the trade negotiations- hawk like. We must ensure that, as we exit the CAP, British farming retains the highest possible standards and remains competitive.\nI look forward to working with the both of Scotland’s Government’s to see what we can do to promote home grown, locally produced food to be bought here – including, I hope, progress on effective labelling on production standards.\nThis is an Agriculture Bill, not a Trade Bill. No doubt we will revisit many of the issues that have arisen here today in future. But for now I think we should give this bill our assent and do all we can to ensure British farming has a bright, productive and profitable future.",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_category_Articles/content_12.html": "Andrew to run marathon for MS Society 16th January 2025 Andrew Bowie MP is to run in the world-renowned London Marathon at the end of April. Andrew Bowie, who represents West Aberdeenshire and Kincardine, will join... Articles\nStatement on Westhill Asylum Hotel 29th March 2023 I am disappointed that the Home Office have determined that the Hampton by Hilton is an appropriate location to house asylum seekers. As such, I have met with... Articles\nGovernment Action on Future UK Energy Supplies 10th January 2023 UK energy supplies are currently derived from a wide range of sources; these will further diversify as we progress towards net zero. While the National Grid has... Articles\nSupporting the online safety bill 28th November 2022 Fraud conducted online is a devastating and pernicious crime, causing financial and emotional harm to victims. Andrew understands from the many constituents... Articles\nRenewables Are The Solution To This Energy Crisis - Andrews Article for The Times Red Box 14th March 2022 The silver city with the golden sand and the rich blue beyond, oil and gas made Aberdeen and Aberdeenshire the energy capital of Europe. Net zero will be its... Articles\nBetter Together - Andrews Article for The Sunday Times 5th January 2022 I have to admit some sense of déjà vu on picking up my copy of the Sunday Times yesterday to read the piece penned by Peter Duncan entitled, “New centre-right... Articles\nHelp Regional Airports Like Exeter and Aberdeen Take Off Again - Times Red Box Article 26th October 2021 When the Chancellor stands up to deliver his Budget on Wednesday, we trust he will continue his mission to drive economic growth and prosperity in all four... Articles\n\"Cameron and His Modernising Agenda Inspired My Generation, Who or What Will Inspire The Next\" Andrews Article for Conservative Home 13th October 2021 My political life has been dominated by referendums. By arguments over national identity. First the 2014 referendum on Scottish Independence. Then the 2016... Articles\nAndrews Conference Review 8th October 2021 So, that was that! Party Conference over for another year. And after a years hiatus, it was so good to see and catch up friends that many of us hadn’t seen... Articles",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_Visitorcentre/content_16.html": "Scottish Government agency Visit Scotland have announced that they will close the Visitor Information Centre in Ballater.\nThis decision is deeply unhelpful to efforts by the local community to increase tourism and give visitors a better experience of the beautifal Royal Deeside.\nJoin my campaign calling on Humza Yousaf's government to step in and prevent this closure from going ahead👇",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_andrew-hosts-veterans-charity-meeting-balmoral/content_10.html": "Representatives from Scotland’s armed forces charities gathered at Balmoral Castle to discuss how to bring together veteran support services for the North East. The meeting, hosted by Andrew Bowie MP, focused on streamlining the support available to former service personnel and their families to ensure no one falls through the cracks.\nBringing together key voices from ten leading veteran organizations, the event included representatives from Veterans Housing Scotland, Royal British Legion Scotland, SSAFA, Horseback UK, Forces Children Scotland, Networks of Wellbeing, RAFA Scotland, and What Makes a Difference. These groups provide crucial assistance in areas such as housing, mental health, and employment support, but navigating the various services can be complex and overwhelming for those in need.\nAndrew Bowie, MP for West Aberdeenshire and Kincardine, emphasized the challenges many veterans face when transitioning to civilian life.\n“Veterans and their families can face a confusing, often daunting landscape when looking for help. The potential issues facing someone leaving the Armed Forces are many,” Mr. Bowie stated.\nHe highlighted the struggles of adjusting to life off-base, the mental and physical health challenges that can arise, and the difficulties of finding work and reintegrating into civilian communities.\n“The camaraderie and special bonds once felt with squadmates can fall away without the daily rigours of service underpinning it. Even just finding work and adapting to civilian life can be so difficult. It can be easy to slip through the cracks,” he added.\nThe discussion at Balmoral Castle aimed to build on existing services while developing a more cohesive and accessible support system. Mr. Bowie stressed the importance of raising awareness about the help already available and creating a unified network that simplifies access to vital services.\n“It was brilliant after months of planning to have so many Scottish and North East voices around the table to talk about what we can all do to elevate the profile of what is already here, but also to lay the groundwork for a one-stop service that can tie it all together.”\nAs part of this initiative, Mr. Bowie is calling on veterans to share their experiences—both positive and negative—of dealing with public services and charities. Feedback from those directly affected will be instrumental in shaping the future of veteran support in Scotland.\nVeterans and their families who wish to contribute can reach out to Andrew Bowie MP at [email protected]. All correspondence will be treated in strict confidence.",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_news_category_Opinions/content_8.html": "Why I will vote against the Assisted Dying Bill 22nd November 2024 Parliamentarians will soon be asked to vote on whether or not to legalise assisted dying here in the United Kingdom. This is a devolved issue, and I am aware... Opinions\nAndrew Bowie backs Russell Findlay 23rd July 2024 In a few months time, I will be asked to cast my ballot in Parliament, for the candidate I want to be Leader of the Official Opposition. Then, along with all... Opinions\nWhy I'm backing Rishi Sunak for PM 20th July 2022 I thought long and hard about who I was going to back to become leader of the Conservative and Unionist Party. We have an amazing array of talent standing to be... Opinions\nAndrew Explains Why He Backs Agriculture Bill 14th May 2020 I have the pleasure of representing a constituency in Aberdeenshire, home of the best beef, lamb, berries & cereals produced anywhere in the United Kingdom with... Opinions\nWhen Sweden went Right – and what the Conservatives can learn 16th January 2018 The Conservatives did not lose the General Election. The Conservatives won 42.4 per cent of the popular vote – the highest since 1979. The Conservatives remain... Opinions\nBeing an optimist comes with the membership... 7th November 2017 This might seem like an odd thing to say this week of all weeks, but I feel really positive about the future of politics and the future of the Conservative... Opinions\nLiberty, Freedom and the centre right's inability to communicate 10th September 2017 I’ve been thinking a lot in last two days about Ronald Reagan’s farewell address which he delivered on January 11th 1989. I was only 1 year old when he sat... Opinions",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_cdn-cgi_l_email-protection/content_2.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_accessibility/content_5.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk_campaigns/content_4.html": "50mph speed limit survey The Scottish Government have announced a consultation into the national speed limit on single carriageway roads; including the A96. The proposed changes to the...\nStop the Family Farm Tax Labour have broken their promise to British farmers with the Family Farm Tax. Labour's Family Farm Tax will stop farms being passed to the next generation...\nSave Ballater Visitor Centre Scottish Government agency Visit Scotland have announced that they will close the Visitor Information Centre in Ballater. This decision is deeply unhelpful to...\nTell Andrew Bowie MP your priorities West Aberdeenshire and Kincardine MP Andrew Bowie has announced he has been reselected by local members, and will stand at the next General Election. Let him...\nSSEN Kintore-Tealing Overhead Line proposals My view is clear, these are huge pieces of infrastructure that will irreparably damage the countryside that we call home. Whilst the UK Government has reserved...\nSupporting our tourism and hospitality sector Across West Aberdeenshire and Kincardine, we have fantastic distilleries, restaurants, hotels, and bars. They need our support so that our communities can...\nProtecting our Union In 2014 the people of Scotland were given a clear choice, and they made their view clear. They wanted Scotland to remain part of the family of nations that make...\nBacking North Sea oil & gas The North Sea oil and gas industry is absolutely critical to North East Scotland’s economy and indeed Scotland’s. As we transition away from fossil fuels we...\nHill of Fare Wind Farm Proposals The plans to construct one of the tallest onshore wind farms only four miles away from Banchory has generated much concern from residents in many communities...",
  "https_www_andrewbowie_org_uk_/https_www_andrewbowie_org_uk/content_1.html": "Andrew on Twitter\nAm I your MP?\nEnter your postcode\nI'm Andrew Bowie, the Member of Parliament for West Aberdeenshire and Kincardine. Here, you can find my news, campaigns and more about me, including how to contact my office. I'm here to help, so please don't hesitate to get in touch."
}