{
  "https_www_petergibson_org_/https_www_petergibson_org_news_could-new-darlington-economic-campus-be-named-after-ww2-hero/content_23.html": "Peter Gibson MP for Darlington today (19 Dec) asked the Chief Secretary to the Treasury Laura Trott MP if she would support naming the new Darlington Economic Campus after Pilot Officer William McMullen.\nSpeaking in the House of Commons Peter Gibson MP said “Can the Minister reassure my constituents that the Darlington Economic Campus will receive all the jobs that we were promised? And would she consider the proposal to name the permanent home of the Darlington Economic Campus McMullen House in honour of William McMullen in recognition of the sacrifice that William made for the people of Darlington”.\nIn response the Chief Secretary to the Treasury Laura Trott MP responded by saying that she would be happy to meet with Gibson discuss the proposal.\nOn January 13, 1945, Pilot Officer William McMullen was returning to RAF Middleton St George on a training exercise when his Lancaster bomber caught fire. His six-man crew jumped to safety before he alone successfully steered the blazing plane away from the residential houses at the east end of Darlington but was killed when it crashed in a fireball into fields off what is now McMullen Road.\nDarlington Economic Campus last week announced 200 more jobs in addition to the 600 already created with 80 percent going to the local region with more jobs yet to come",
  "https_www_petergibson_org_/https_www_petergibson_org_news_mp-backs-campaign-introduce-emilies-law/content_11.html": "Last week (08/05/23) Peter Gibson MP attended an event to support the introduction of new legislation to criminalise fatal dog-on-dog attacks. At an event in the House of Commons, Anna Firth MP formally launched her new Private Members Bill, entitled “The Animal Welfare (Responsibility for Dog Attacks) Bill.”\nThe Bill will criminalise fatal dog-on-dog attacks in the UK, ensuring that irresponsible dog owners are held to account. It is informally named ‘Emilie’s Law’ after Anna Firth MP’s constituent Michael’s bichon fries, who lost her life to a dog attack in 2021 in Chalkwell Park in Leigh-on-Sea.\nRecently Darlington has seen a similar attack, where Sasha, a mixed breed terrier, was attacked by a German Shepherd in South Park, while this incident was not fatal, it demonstrates the need for action in this area.\nEmilie’s Law will have its First Reading in the House of Commons led by Anna Firth MP on Wednesday 23rd May.\nThe new legislation will address a key gap in the law which currently states that a dog owner is not liable for any form of prosecution when their dog fatally attacks another dog. The only exemptions are if the injured pet is an assistance or a service dog, or unless another human is injured or attacked or seen to be at risk.\nIn the five years between 2016 and 2021 there was a 700% increase in dog-on-dog attacks, rising to 11,559 from just 1,700.\nThe Bill is being supported by the Conservative Animal Welfare Foundation, which campaigns to improve conditions for animals, as well as a number of MPs, including Mr Gibson.\nSpeaking about the Bill, Mr Gibson said: “We are a nation of animal lovers and I know that if anything were ever to happen to my own dogs, I would be distraught.\n“This Bill would close a loophole in current legislation that allowed irresponsible dog owners to shirk all responsibility when their dog fatally attacks another, creating untold distress and harm to the deceased dog’s owner and wider family.\n“Of course, not all dogs are dangerous and not all dog owners are irresponsible, but it is crucial we have accountability under the law. I look forward to supporting my colleague Anna Firth as she brings this important Bill forward for its First Reading on 23rd May”",
  "https_www_petergibson_org_/https_www_petergibson_org_what-can-mp-do/content_26.html": "Members of Parliament are elected to the House of Commons to represent the interests and concerns of all the people who live in their constituency, whether they voted for them at the General Election or not. They are only able to deal with issues raised by people who live in their constituency, called constituents.\nTo check if you are one of my constituents, please enter your postcode on the Parliament website .\nMPs consider and vote on legislation and use their position to ask government ministers questions about current issues.\nWe split our time between working in Parliament and working in the constituency. In Parliament, I spend my time fighting for the interests of all my constituents, attending debates, scrutinising and voting on legislation, and attending meetings. I hold advice surgeries for my constituents (where they can come and talk to me about any local issues and problems), attend meetings and community events, as well as visiting local organisations and businesses across the constituency.\nWhen a constituent writes to me, I will write to the relevant department or official or the Minister involved. Many problems are solved in this way and I always aim to respond within 10 working days although sometimes more complex cases may take slightly longer.\nAlternatively, if a constituent is happy for the issue to be made public, I can ask an oral or written question, secure a debate or even petition Parliament itself.\nOral or Written Questions\nOnce a month each minister from each government department answer questions from MPs at the Despatch Box in the Chamber of the House. There is a limit to the number of questions that can be asked but I can also table a written question to the relevant government department, which are published in Hansard .\nAdjournment Debates\nMPs may be able to raise a constituent’s issue in a half-hour Adjournment Debate. To get an Adjournment Debate, MPs must be successful in a ballot of Members of Parliament or have the subject chosen by the Speaker. The debates are usually the last business of the day and a government minister responds at the end of the debate.\nPetition\nMembers of Parliament can present a petition to Parliament on behalf of their constituents. The format and wording of the petition need to be in a particular way. For more information or guidance, please contact:\nClerk of Public Petitions\nJournal Office\nHouse of Commons\nLondon SW1A 0AA\nhttp://www.parliament.uk/get-involved/have-your-say/petitioning/public-petitions\nWhat I cannot do, however, is have any jurisdiction over local Council decisions. I can write to on your behalf to the council and ask them to look into a problem or to reconsider an issue. In the first instance though, constituents should contact their local council or councillor directly.",
  "https_www_petergibson_org_/https_www_petergibson_org_map-locations/content_19.html": "Skip to main content\nMain navigation\nHome\nAbout\nNews\nMy Plan\nDarlington\nWestminster\nMy map",
  "https_www_petergibson_org_/https_www_petergibson_org_news_category_Westminster-News/content_7.html": "Police UK Disability Sport team meet with Darlington MP in Westminster 14th May 2024 Yesterday (14 May) members of the Police UK Disability Sport visited the Palace of Westminster at the invitation of Darlington MP, Peter Gibson. Police UK... Westminster News\nPET THIEVES TO PAY FOR THEIR CRIMES THANKS TO NEW LAW 31st January 2024 This morning (31 Jan) Darlington’s MP, Peter Gibson, served on The Bill Committee to progress a new law which will see pet abduction become a criminal offence... Westminster News\nPETER GIBSON MP SPEAKS IN PARLIAMENT ABOUT STEEL PRODUCTION 9th November 2023 Peter Gibson MP spoke in an Urgent Questions debate in the House of Commons on steel production in Britain (8/11/23). Peter welcomed the new steel making coming... Westminster News\nMP ATTENDS DEBATE ON HIV ACTION PLAN ANNUAL UPDATE 19th July 2023 Peter Gibson MP attended and contributed to a debate in Westminster Hall on the 2022-23 annual update on the Government’s HIV Action Plan yesterday (18.07.23)... Westminster News\nMP asks for update on Darlington Economic Campus 20th June 2023 Speaking during Treasury Questions in the House of Commons today (20.06.23), Peter Gibson MP asked Gareth Davies MP, Exchequer Secretary to the Treasury, for an... Westminster News\nMP welcomes announcement of extra 4 million tests, checks and scans carried out by community diagnostic centres to bust backlogs 12th June 2023 Peter Gibson MP has welcomed the news that the government has delivered an extra 4 million tests, checks and scans to bust elective backlogs – and that eight... Westminster News\nDARLINGTON MP PUTS FORWARD SOLUTION FOR DENTISTRY IN DARLINGTON 26th May 2023 Earlier this week (24/05/23) Darlington MP, Peter Gibson took part in an adjournment debate on dentistry in Durham. Health Minister, Neil O’Brien confirmed that... Westminster News\nMP BACKS CAMPAIGN TO INTRODUCE EMILIE’S LAW 24th May 2023 Peter Gibson MP has today (23.04.23) supported the introduction of new legislation to criminalise fatal dog-on-dog attacks. Speaking in the House of Commons... Westminster News\nMP BACKS CAMPAIGN TO INTRODUCE EMILIE’S LAW 16th May 2023 Last week (08/05/23) Peter Gibson MP attended an event to support the introduction of new legislation to criminalise fatal dog-on-dog attacks. At an event in... Westminster News",
  "https_www_petergibson_org_/https_www_petergibson_org_news_category_Speeches/content_13.html": "‘Stop ripping off the drivers of Darlington’ says Peter Gibson MP 12th March 2024 Yesterday (11.3.24) Darlington’s MP declared that he was continuing to take the fight to companies ripping off drivers in Darlington. Speaking in the House of... Speeches\n‘Don’t ignore the education of working class kids’ says Peter Gibson MP 5th March 2024 Today (5.3.24) Peter Gibson MP spoke in a debate about the education of boys. In the debate, Peter focussed on the disparity of attainment levels between boys... Speeches\nCould the new Darlington Economic Campus be named after a WW2 Hero? 19th December 2023 Peter Gibson MP for Darlington today (19 Dec) asked the Chief Secretary to the Treasury Laura Trott MP if she would support naming the new Darlington Economic... Speeches\nMP calls for Darlington station to retain ticket office 13th September 2023 Speaking during a debate in Parliament today (13.09.23), Peter Gibson has called for the ticket office at Darlington Bank Top Station to remain open. Mr Gibson... Speeches\nMP SPEAKS ABOUT TACKLING VIOLENCE AGAINST WOMEN AND GIRLS 3rd February 2023 This Week (01.02.23), Peter Gibson MP spoke about the need to tackle violence against women and girls in a Westminster Hall debate in Parliament on Sentencing... Speeches\nMP RAISES CONCERNS ABOUT TERRESTRIAL TELEVISION AND RADIO 27th January 2023 Speaking at the Department for Culture, Media and Sport Oral Questions in the House of Commons (26.01.23), Peter Gibson MP has raised concerns regarding... Speeches\nMP RESPONDS TO REPORT INTO CRUSTACEAN DEATHS IN THE NORTH EAST 26th January 2023 Peter Gibson MP has today (26.01.23) spoken in response to a Ministerial Statement in the House of Commons on the independent expert assessment of crustacean... Speeches\nHolocaust Memorial Day 2023 26th January 2023 Sadly I am unable to attend all of this important debate in Parliament this afternoon, and Parliamentary courtesy dictates that you must be in the Chamber at... Speeches\nDarlington Northern Link Road moves a step closer 24th November 2022 Peter Gibson MP for Darlington raised the case for a Northern Link Road in Darlington with the Parliamentary Under Secretary of State (Roads and Local Transport... Speeches",
  "https_www_petergibson_org_/https_www_petergibson_org_privacy/content_20.html": "This document outlines how Peter Gibson processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Peter Gibson\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Peter Gibson .\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Peter Gibson , or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Peter Gibson via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_petergibson_org_/https_www_petergibson_org_myplan/content_12.html": "Skip to main content\nMain navigation\nHome\nAbout\nNews\nMy Plan\nDarlington\nWestminster\nMy Plan\nTweet\nAttachments\nAttachment\nSize\nLevelling Up - General Election Special\n(3.1 MB)\n3.1 MB",
  "https_www_petergibson_org_/https_www_petergibson_org_cookies/content_2.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_petergibson_org_/https_www_petergibson_org_about-rss/content_15.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_petergibson_org_/https_www_petergibson_org_news_mp-welcomes-government-announcement-trans-inclusive-conversion-therapy-ban/content_10.html": "Peter Gibson MP has welcomed the news that the Government has today (17.01.23) announced that they will publish a draft Bill which will set out a proposed approach to ban conversion practices.\nThe Bill will apply to England and Wales and will protect everyone from these harmful practices, including those targeted on the basis of their sexuality, or being transgender.\nThe NHS, the Royal College if Psychiatrists, the UK Council for Psychotherapy, the British Association for Counselling and Psychotherapy and the British Medical Association have all concluded that conversion therapy practices are unethical and potentially harmful.\nFurther, the Government Equalities’ Office commissioned a large-scale LGBTQ+ survey in 2017 which found that two per cent of respondents to the national LGBTQ+ survey said they had undergone conversion therapy in an attempt to ‘cure’ them of being LGBTQ+.\nThe Government have now announced that they will publish the draft Bill banning conversion therapy practices shortly and will ask for pre-legislative scrutiny by a Joint Committee before the end of this parliamentary session, which is likely to be October. Once pre-legislative scrutiny has been completed, the bill will then begin its legislative journey through both houses of Parliament.\nSpeaking about the announcement, Mr Gibson said “Conversion therapy is an abhorrent practice, that I consider as a form of abuse and I am proud that we have committed to banning it. I welcome the Government’s commitment today and appreciate the way Government has engaged with colleagues across the political spectrum to deliver this.”\n“We now have a timetable for delivering this ban and the protections this bill will offer to some of the most vulnerable in society will be warmly welcomed by all members of the LGBTQ+ community. I now look forward to the publication of the draft bill and hope to see it swiftly pass its legislative stages to make its way onto our statute books.”\n“I want to pay tribute to Alicia Kearns MP, who has led the campaign on this issue as well as many other Conservative colleagues who have been pushing for an inclusive ban on conversion therapy throughout the duration of this Parliament”\nFurther, Mr Gibson said “I am positive about the steps that have been made so far in the UK to achieve LGBTQ+ equality, and I am confident that this good work will continue. As a member of the LBGTQ+ community, I personally am committed to seeing all forms of abuse for LGBTQ+ people banned and will continue to work towards that in Parliament.”",
  "https_www_petergibson_org_/https_www_petergibson_org_news_pet-thieves-pay-their-crimes-thanks-new-law/content_21.html": "This morning (31 Jan) Darlington’s MP, Peter Gibson, served on The Bill Committee to progress a new law which will see pet abduction become a criminal offence.\nThe bill which would create an offence of \"pet abduction\" passed its first Commons hurdle unopposed today. Under the legislation, anyone convicted of the offence could face a fine or a maximum of five years in prison.\nPeter commented, “This new law will be welcome by thousands of pet owners in Darlington. The Pet Abduction Bill will mean that anyone found guilty of stealing a pet will face up to five years in prison, a fine, or both.\nIt is right that these criminals will face the justice they deserve, and I am proud to have served on this committee which is firmly on the side of fellow pet owners”.\nAnna Firth MP, who bought forward the Bill commented, “As a nation of pet-lovers, it is vital that the law recognises the emotional impact that the abduction of a pet can have and brings the perpetrators to justice that correctly reflects this.\nPets are not merely property like a smartphone or watch – they are part of the family. It is not right that the law does not distinguish this, and I am delighted that my bill will redress this wrong”",
  "https_www_petergibson_org_/https_www_petergibson_org_news_photo-signed-prime-minister-gifted-education-village-catering-team-international-womens-day/content_27.html": "A photograph signed by the Prime Minister Rishi Sunak featuring the team of women who work tirelessly behind the scenes at a Darlington school has today been presented to them by Darlington’s MP Peter Gibson.\nIn January the Prime Minister visited the Education Village, in Haughton-le-Skerne, Darlington to speak with pupils, teachers and parents. Mr Sunak also met with the Academy’s catering team and gathered for a group photograph.\nSince then, the town’s MP Peter Gibson has had the photograph signed by Mr Sunak and framed.\nIn a presentation today, to mark International Women’s Day Peter handed over the picture to a delighted team.\nPeter Gibson MP said “The ladies were so excited to meet with the Prime Minister and it was lovely to drop off a memento of his visit to the school.\n“The team work incredibly hard behind the scenes and it was nice to see that recognised, especially on International Women’s Day”.\n“It was lovely to see the picture in pride of place, hanging in the Education Village Kitchen, even before I left”.",
  "https_www_petergibson_org_/https_www_petergibson_org_news_category_Opinions/content_24.html": "Peter Gibson MP joins call for ‘Buy British’ section on supermarkets’ online store 22nd August 2023 Peter Gibson MP, Member of Parliament for Darlington has signed an open letter from over 100 MPs calling on supermarkets to highlight the very best of British... Opinions\nMP WELCOMES NEWS THAT CHILDREN IN ENGLAND ARE THE BEST READERS IN THE WESTERN WORLD 16th May 2023 Peter Gibson MP has welcomed the news that the largest global comparison of its kind shows that children in England are better at reading than anywhere else in... Opinions\nWe’ve got a plan. Let’s make it work and end new cases of HIV by 2030 28th February 2022 As Conservatives we can be proud of the momentum our Government is building toward the goal of ending new cases of HIV by 2030. Not only was it a Conservative... Opinions\nLast week in Israel 16th July 2019 Last week I joined a group of Conservative Candidates from around the country on a five day trip to Israel organised by Conservative Friends of Israel. We... Opinions",
  "https_www_petergibson_org_/https_www_petergibson_org_news_category_Reports/content_6.html": "MP CALLS ON GOVERNMENT TO BACK INNOVATIVE LOCAL BUSINESS 20th January 2023 Peter Gibson MP has called on the Government to support the delivery of new hydrogen technologies being developed by Cummins in Darlington. The need to reduce... Reports\nMP WELCOMES GOVERNMENT ANNOUNCEMENT OF TRANS INCLUSIVE CONVERSION THERAPY BAN 18th January 2023 Peter Gibson MP has welcomed the news that the Government has today (17.01.23) announced that they will publish a draft Bill which will set out a proposed... Reports\nPeter speaks in support of the Electricity and Gas Transmission (Compensation) Bill 28th November 2022 Peter Gibson MP has spoken in favour of the Electricity and Gas Transmission (Compensation) Bill at its second reading in the House of Commons (Fri 25 Nov). The... Reports\nMP SUPPORTS HUNTING TROPHIES IMPORT PROHIBITION BILL 28th November 2022 Peter Gibson MP has supported the Hunting Trophies (Import Prohibition) Bill as it was debated and passed its second reading in the House of Common’s (25 Nov... Reports",
  "https_www_petergibson_org_/https_www_petergibson_org_parliament/content_18.html": "Tweet Here you can find Peter Gibson's latest speeches and appearances in Parliament (provided by theyworkforyou):\nPolice: Disability and Injuries | Home Office | Written Answers To ask the Secretary of State for the Home Department, what support his Department provides for (a) injured and (b) disabled police officers\nHIV Infection: Screening | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, when she plans to extend the opt-out HIV testing programme.\nDarlington Economic Campus | Cabinet Office | Written Answers To ask the Minister for the Cabinet Office, what progress the Government Property Agency has made on the erection of hoarding for the Brunsw\nHIV Infection: Drugs | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what steps her Department is taking to ensure that PrEP is available in all parts\nHIV Infection: Health Services | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, whether her Department is taking steps to identify people that have been diagnosed\nGonorrhoea | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what assessment she has made of the current levels of syphilis recorded; and what\nPalliative Care | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what steps her Department is taking to collect data on people admitted to hospital\nGonorrhoea | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what assessment she has made of the levels of Gonorrhea recorded; and what steps s\nPeople with Autism: Employment | Work and Pensions | Commons debates What steps his Department is taking to support people with autism into employment.",
  "https_www_petergibson_org_/https_www_petergibson_org_news_peter-backs-football-bill/content_9.html": "Last night (24.4.24) Peter Gibson MP spoke in Parliament regarding proposed new laws for English football clubs.\nSpeaking in the House of Commons, Peter spoke about the importance of Darlington FC to the community and how important it is that it is protected so that fans can continue to enjoy the Quakers as they have done since 1883.\nThe Football Governance Bill seeks to protect local football clubs and ensure that fans have a say over key decisions. The Government is seeking, with cross party support, to set up an independent regulator to ensure that the future of football clubs is safe.\nAfter the debate, Peter commented \"Football is a key part of our community. I am proud to have secured over a million pounds worth of investment in pitches and goal posts in Darlington to ensure that all can play the great game.\n\"I am proud to support our football club in all they do, particularly their community work through their foundation and I share their ambition to have a dedicated stadium. I support the Bill which will ensure that our club and others can survive, thrive, and continue to bring us enjoyment\".",
  "https_www_petergibson_org_/https_www_petergibson_org_accessibility/content_5.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_petergibson_org_/https_www_petergibson_org_news_darlington-nursery-celebrated-number-10-downing-street/content_3.html": "A Darlington nursery manager recently attended an event in Downing Street together with a number of influential individuals across the early years sector.\nRachael Lowes, Childcare Operations Manager from Maidendale Nursery, based in Firthmoor Community Centre visited No. 10 Downing Street in recognition of the work she does at the nursery, and that her team do in order to support families and early years provision in Darlington.\nRachael was nominated by the town’s MP, Peter Gibson under the category of “Giving every child the best start in life”\nMaidendale Nursery offers high quality, affordable childcare to meet the needs of parents with variable working patterns. They also support parents and carers who may be out of work the opportunity to access training and qualifications.\nSpeaking about attending the event Rachael said “It was a pleasure to attend and a fantastic opportunity to be able to gain further skills and information that can be implemented within our setting”.\nThe event, which was led by David Johnson OBE MP, Minister for Children and Families celebrated significant contributions which have been made by early years professionals since the pandemic and recognised those such as Racheal who have contributed in the local community.\nPicture: Racheal Lowes with David Johnson OBE MP, Minister for Children and Families.",
  "https_www_petergibson_org_/https_www_petergibson_org_about-peter-gibson/content_14.html": "Local solicitor Peter Gibson believes that people want more MPs who have had real life experiences to take with them to Westminster to better represent them.\nBorn in Middlesbrough and raised in Redcar and Saltburn, Peter is the son of an NHS Midwife who once worked at Darlington Memorial Hospital and a shipwright who worked at Smiths Dock.\nLiving and working in the North East for his whole life, Peter says “I am a passionate northerner, proud of our rich heritage and the bright future we have, but I have often felt that the north could be better represented than it has been in the past. Living locally, and building a business in the Tees Valley and North Yorkshire, I want to be an MP who stands up for our town and be an ambassador for it.”\nPeter has worked hard for a variety of charitable causes alongside building his business over the past decade. He said “The energy I have put into everything I have done in my life so far I now want to put to good use for this great town. I will be a visible campaigner on local issues and work hand in hand with the great conservative team of Councillors locally and our fantastic mayor Ben Houchen.”\nPeter was first elected as the MP for Darlington in the 2019 General Election.",
  "https_www_petergibson_org_/https_www_petergibson_org_news_darlington-mp-puts-forward-solution-dentistry-darlington/content_25.html": "Earlier this week (24/05/23) Darlington MP, Peter Gibson took part in an adjournment debate on dentistry in Durham.\nHealth Minister, Neil O’Brien confirmed that a comprehensive dental reform plan is underway and that this overhaul will address the 2006 contract made under the Labour government, which limits dentist’s ability to take on more patients.\nThe Minister also went on to confirm that there are 1,473 more NHS dentists across the UK since 2010, this is a 6.5% increase.\nPeter Gibson MP suggested that introducing dentistry into schools would be a solution to counteract the difficulties residents in Darlington are facing in accessing appointments, alleviating dental practices of pressure on appointment availability and ensure that children have regular access to dental treatment. This regular access to dental care will also ensure that children get regular check-ups.\nPeter Gibson said, “I am delighted that the Minister welcomed my idea for dentistry in schools and I look forward to seeing what plans are put into motion on this in the future.\n“There is a lot of misinformation about the figures on dentistry and I glad that the Minister was able to clarify once and for all the exact figures of the increase in NHS dentists across the UK. I will continue to raise the issue with local health authorities to see what can be done in the immediate to address dentistry in Darlington.”",
  "https_www_petergibson_org_/https_www_petergibson_org/content_1.html": "I'm Peter Gibson, the Conservative MP for Darlington between 2019 and 2024. I believe that people want more MPs who have had real life experiences to take with them to Westminster to better represent them, so here you can find my news, campaigns and what I stand for. I'm here to help so please don't hesitate to get in touch.\nMuch of the content on this website was established while I was a Member of Parliament.",
  "https_www_petergibson_org_/https_www_petergibson_org_news_we-must-end-hiv-2030-says-peter-gibson/content_16.html": "Today (20.3.24) Peter Gibson MP spoke in Parliament about HIV giving the Government suggestions on how to meet the pledge of zero new transmissions by 2030.\nPeter has long campaigned for the Government to end new cases of HIV and today said, “In order to reach our commitment of zero new transmissions by 2030, that we need a four-pronged approach of improving sex education, the expansion of opt out HIV testing, expanding the availability of PREP and finding the 13,000 people with HIV not who are not under care.”\nIn response, Stuart Andrew MP said The opt out system which Peter had been an outspoken proponent of has helped identify 1,000 cases of HIV and that the Government were looking closely into why certain groups most likely to benefit from PREP (an HIV preventative drug) were not accessing it.\nAfterwards, Peter commented, \"I am glad that the Government has done so much on this already. Going forward, I will continue to campaign for a holistic approach to ensure that all in Darlington and across the country are safe from HIV.”",
  "https_www_petergibson_org_/https_www_petergibson_org_news_category_Speeches-in-Parliament/content_17.html": "Peter backs Football Bill 24th April 2024 Last night (24.4.24) Peter Gibson MP spoke in Parliament regarding proposed new laws for English football clubs. Speaking in the House of Commons, Peter spoke... Speeches in Parliament\nMP calls for off-road vehicles to be registered and suggests Darlington as a place to trial scheme 22nd April 2024 Draft legislation that would make it a rule that off-road vehicles be registered was debated in the House of Commons on Friday (19.04.24). Peter Gibson MP for... Speeches in Parliament\n“Make pet abduction a specific offence” says Peter Gibson MP 19th April 2024 Today (19.3.24) Peter Gibson MP for Darlington spoke in Parliament about a new law which would make stealing a dog or cat a specific offence. Speaking in the... Speeches in Parliament\n‘We Must End HIV by 2030’ says Peter Gibson 20th March 2024 Today (20.3.24) Peter Gibson MP spoke in Parliament about HIV giving the Government suggestions on how to meet the pledge of zero new transmissions by 2030... Speeches in Parliament\n“End the abuse now” says Peter Gibson MP 1st March 2024 Today (1.3.24) Peter Gibson MP spoke in a debate about a Bill which would make so called conversion therapy illegal. Conversion therapy is offered to LGBT... Speeches in Parliament\nPeter Gibson MP urges tougher action to stop criminal off-road vehicles in Darlington 20th February 2024 Today (20.2.2024) Peter Gibson MP called for the Government to do more to stop dangerous off-road vehicles terrorising Darlington. Speaking during a Westminster... Speeches in Parliament\nNEW DENTISTRY PLAN FOR DARLINGTON 7th February 2024 Today (7.2.2024) Peter Gibson MP spoke in the House of Commons about the Governments new plans for dentistry. Peter stated: ‘I welcome the new plan which will... Speeches in Parliament\n‘Get off your backsides, pull your finger out and give us dentists!’ say’s Darlington’s MP in Parliament 9th January 2024 Today (9 Jan) Peter Gibson MP spoke in the House of Commons in a debate about dentistry in England. Darlington has faced a dental crisis since the NHS dentist... Speeches in Parliament\nChildren's mental health waiting times are unacceptable says Darlington’s MP 7th December 2023 Peter Gibson MP for Darlington spoke today (7/12/23) in Parliament about the “unacceptable” wait that young people with emotional, behavioural or mental health... Speeches in Parliament",
  "https_www_petergibson_org_/https_www_petergibson_org_news/content_4.html": "DARLINGTON NURSERY CELEBRATED AT NUMBER 10 DOWNING STREET Friday, 17 May, 2024 A Darlington nursery manager recently attended an event in Downing Street together with a number of influential individuals across the early years sector. Rachael Lowes, Childcare Operations Manager from Maidendale Nursery, based in Firthmoor Community Centre visited No. 10 Downing Street in recognition of the work she does at the nursery, and that her team do in order to support families and... Local News\nPolice UK Disability Sport team meet with Darlington MP in Westminster 14th May 2024 Yesterday (14 May) members of the Police UK Disability Sport visited the Palace of Westminster at the invitation of Darlington MP, Peter Gibson. Police UK... Westminster News\nPeter backs Football Bill 24th April 2024 Last night (24.4.24) Peter Gibson MP spoke in Parliament regarding proposed new laws for English football clubs. Speaking in the House of Commons, Peter spoke... Speeches in Parliament\nMP calls for off-road vehicles to be registered and suggests Darlington as a place to trial scheme 22nd April 2024 Draft legislation that would make it a rule that off-road vehicles be registered was debated in the House of Commons on Friday (19.04.24). Peter Gibson MP for... Speeches in Parliament\n“Make pet abduction a specific offence” says Peter Gibson MP 19th April 2024 Today (19.3.24) Peter Gibson MP for Darlington spoke in Parliament about a new law which would make stealing a dog or cat a specific offence. Speaking in the... Speeches in Parliament\nMore money for Darlington to improve active travel 25th March 2024 Peter Gibson MP for Darlington has welcomed the news that the town has been awarded £1.3 million from the Active Travel England Fund. The fund is designed to... Local News\n‘We Must End HIV by 2030’ says Peter Gibson 20th March 2024 Today (20.3.24) Peter Gibson MP spoke in Parliament about HIV giving the Government suggestions on how to meet the pledge of zero new transmissions by 2030... Speeches in Parliament\nPeter Gibson MP welcomes Independent Football Regulator from Conservative Government, putting Darlington Football Club's voices front and centre 19th March 2024 Peter Gibson MP has welcomed the news that Darlington Football Club and its fans are set to benefit from the creation of an Independent Football Regulator... Local News\n‘Stop ripping off the drivers of Darlington’ says Peter Gibson MP 12th March 2024 Yesterday (11.3.24) Darlington’s MP declared that he was continuing to take the fight to companies ripping off drivers in Darlington. Speaking in the House of... Speeches\nPHOTO SIGNED BY THE PRIME MINISTER GIFTED TO THE EDUCATION VILLAGE CATERING TEAM THIS INTERNATIONAL WOMENS DAY 8th March 2024 A photograph signed by the Prime Minister Rishi Sunak featuring the team of women who work tirelessly behind the scenes at a Darlington school has today been... Local News",
  "https_www_petergibson_org_/https_www_petergibson_org_news_mp-responds-report-crustacean-deaths-north-east/content_28.html": "Peter Gibson MP has today (26.01.23) spoken in response to a Ministerial Statement in the House of Commons on the independent expert assessment of crustacean mortality in the north-east of England in 2021 and 2022.\nMr Gibson, expressed the concerns of people in the north-east regarding this issue, asking the Mark Spencer MP, Minister for Food, Farming and Fisheries, to outline what support has been offered to the fishermen affected by this issue. Further Mr Gibson called out those who have sought to turn this point into a political game.\nOpposition MPs have treated this issue as a political football. The MP for Stockton North openly questioning the integrity of the independent panel, which included the chief scientist at the Department for Environment, Food and Rural Affairs as well as Sir Patrick Vallance the Government’s chief scientist. Further, the MP for Swansea West, derided the expertise of the panel before he even knew who they were. While they have played their political games, Mr Gibson and his Conservative colleagues in the north-east have listened to the scientific experts and sought to support those people affected by this incident.\nMr Spencer, assured Mr Gibson that a thorough evidence-based approach was taken to the investigation into this issue, but that one sole cause for the incident has not been identified. Further Mr Spencer outlined the support for fishing communities available through the £100 million Seafood Fund, which many businesses in the north-east have been bidding into.\nSpeaking, Mr Gibson said “It is a shame that Labour MPs have only sought to deride the experts who have been seeking to find the cause of this issue. This is an issue is of serious concern to people in the north-east, particularly to those whose livelihoods depend on a thriving aquatic environment. I will continue to engage productively on this issue alongside my Conservative colleagues, working with the Government to support those effected rather than sniping from the side lines.”",
  "https_www_petergibson_org_/https_www_petergibson_org_news_police-uk-disability-sport-team-meet-darlington-mp-westminster/content_22.html": "Yesterday (14 May) members of the Police UK Disability Sport visited the Palace of Westminster at the invitation of Darlington MP, Peter Gibson.\nPolice UK Disability Sport provides sports recovery in regional, national, and international sports formats.\nThe service is open to serving and retired Police Officers and staff from both civilian and Armed Forces Police, those with injuries or living with a disability, illness or mental health.\nThe team spoke with a number of MPs in relation to highlighting their campaign to increase support for all Police Officers and staff in the UK, through the power of sports recovery.\nThe team also spoke with the former Home Secretary Suella Braverman MP, who has provided her full backing for Police disability sport.\nTheir campaign to access Proceeds of Crime money was also well received by ministers.\nCommenting Peter Gibson MP said, “It was great to host the Police UK Disability Sport team on their first visit Parliament to discuss their campaigns, which are aimed at supporting disabled and injured Police Officers”.\nFurther information can be found here: www.policeukdisabilitysportcic.co.uk",
  "https_www_petergibson_org_/https_www_petergibson_org_news_make-pet-abduction-specific-offence-says-peter-gibson-mp/content_8.html": "Today (19.3.24) Peter Gibson MP for Darlington spoke in Parliament about a new law which would make stealing a dog or cat a specific offence.\nSpeaking in the debate, Peter, the owner of three dogs, including Westminster Dog of the Year Clemmie, stated “I have yet to meet anyone who doesn’t acknowledge that the theft of a family pet would cause far more pain and anguish than say a wallet, purse or phone.\n“They simply have far more value to us than money alone, and it is right that the law seeks to acknowledge that and mark them out as different that simple inanimate objects.”\nPeter has long supported this new law and has been an outspoken champion of animal welfare and after the debate stated “Pets mean so much to so many. I cannot imagine how heartbreaking it would be if any of my dogs were stolen, and I think that criminals should pay.\n“This is why I support pet abduction becoming a specific offence which will see our pets have more safety and owners have more comfort.”"
}