{
  "http_www_loonyparty_com_/https_www_loonyparty_com/content_4.html": "Runcorn & Helsby By election Manicfesto\nManicfesto for Runcorn Bye Bye Election 2025\nWe will stand for this election on the basis that the Loony Party although a small political party will always punch above our weight.\nAs the Government assure us that there is no problem with the burning of waste at the Runcorn Incinerator, we will reinstall it next to The Houses of Parliament. Well, its perfectly safe isn’t it?\nAs part of the Regenerating Runcorn plan we will build a space port\nWe will get rid of VAT as it adds no value.\nFly Tipping..We will ban all tipping of flys, insects, and zips of any kind..\nWe will replace employees of the Border Force with GP receptionists. This will dramatically reduce the number of people getting in.\nTo help with the cost of Living and to raise money for the Treasury we will Convert Numbers 10 and 11 Downing Street into a Hair salon, Which we will call ‘Government CutZ’\nAlong with the existing Government policy for levelling up the North with the South, we will provide free Spirit Levels to all.\nThe MOT is an annual test to ensure that your car is roadworthy. We will introduce a ROT, an annual test to make sure all roads are car worthy.\nIn an effort to reduce the problems faced by the NHS , it is proposed to reduce pregnancy from nine to seven months ?\nWe will reduce hospital waiting lists by using a smaller font.\nTo make things fairer we will introduce a Court of Human Lefts.\nOnce in Government, we will replace the Foreign Secretary with a British one!\nPublished by Mr R.U.Seerius for Alan Howlin Laud Hope on behalf of the Official Monster Raving Loony Party. 59 Newbarn Close..Fleet. Hants GU51 5HU\nHowling Toy\nEveryone needs more Howling Laud in their life, it must be true because Alan says so. Here’s your chance to take your Looniness to the next level by purchasing something that absolutely doesn’t exist.\nIn a world gone bonkers, one man stands taller than a pint of lukewarm ale at a village fête, wearing a hat large enough to house a small badger. He’s the only politician promising free teabags for all and a unicorn in every garage, with manicfestos scribbled on beer mats and policies dreamt up in the pub loo of Wetherspoons.\nTo purchase this non-existent product, get down to The Prince Arthur in Fleet with a crisp tenner in your eager little hand and a credit card to buy all the drinks. In return you will be given a copy of Alan’s book – whether you want one or not. And remember, vote Loony, because it makes no sense at all.\nTina\nHowling’s boxing for Runcorn on the 1st May\nHowling Laud Hope is our candidate for Runcorn & Helsby’s by-election.\nI drove up to Runcorn last Monday where I met Raving ‘Runcorn’ Rodent at The Ferry Boat, Wetherspoons. We were prepared for a rumble with monster knockout gloves and collected all of Howling’s nominations before the first round!\nNick the Flying Brick\nTeddyboy Tempest at Drayton Manor, Tamworth\nAll confirmed. We will do our full Screaming Lord Sutch Tribute show only once this year and that will be at the Teddyboy Tempest weekend at Drayton Manor Resort, Tamworth (which runs from the 14th to the 16th November).\nWe are scheduled to play on the Friday night at 11.00pm and our show will capture the best in Lord Sutch’s rock ‘n’ roll theatricals and madcap Raving Loony antics.\nAppearing in our line up that night will also be 2 legends of Rock ‘n’ Roll music: Steve Carter on guitar and Dave Thorncroft on Sax… Both of whom have a long history playing along side Lord Sutch back in the day.\nFurther details and tickets here: https://www.ducktails.uk/product/teddy-boy-weekender/\nDave Savage\nVisit to Ledbury\nSome time a go I had a phone call from Robin Oakey asking about our Loony Party, I invited him to attend our last conference in Belper and he asked if we would hold a Conference at his venue ‘The Barn’ in Ledbury. Last weekend I visited along with Lawd Lawson, OB Joyful and our Mem Sec Baron Von Thunderclap. It is a rustic and unique barn in the middle of a bustling town. We spent four days there and Robin and his team are great hosts, we enjoyed every moment of it.\nWe were entertained by an excellent Screaming Lord Sutch tribute act called Jesse Merry, plus an Undertaker/Mortician called John O’Looney, yes that was his real name, telling story’s that you wouldn’t believe! I made my party speech on the Sunday to every ones delight.\nI note that The Baron has reported that I have forsaken my White Suit. I had traveled halfway there and suddenly realised ‘****’ I’ve left my suit at home, so had to improvise. Luckily Robin had a ‘Merlin the Wizard’ coat which he loaned to me, it fitted very well and after seeing it was made for me he said ‘It’s yours!’\nSo its looking like, unless anything changes, thanks to Robin, it will be Loony Party Conference time 2025 in Ledbury, Heredforshire. Sept 25-26-27. More updates nearer the time.\nHowling Laud Hope Party Leader\nBaron Von Thunderclap’s Report from Ledbury\nMain point no more ‘man in the white suit’. Howlin’ is now the ‘man in the blue kaftan’. He borrowed it for this gig and liked it so much a deal was done and he’s now adopted it.\nThe weekend started badly when both Dangerous Dave and the rejuvenated Lord Sutch pulled out due to throat infections so the music was cancelled.\nSome local musicians picked up the baton and put on a bit of a show before Lord Sutch fresh from a 25 year residency at Pinner new cemetery made enough of a recovery to attend.\nDespite only managing a reduced set due to his bad throat it was enough to prove what a great musician he is starting with the favourite ‘Jack the ripper’ followed by many self penned tracks. Just like our spiritual leader he’s a great showman but has the advantage that he can actually sing!!\nOur hosts at ‘The Barn’ were lovely, even sending out for a mass fish and chip meal to feed 10 of us.\nThe locals were also very friendly (although there may be a backlash from some of the parents whose children we gave kazoos to!) and the town is lively with plenty of pubs. Perhaps a good venue for our conference?\nBaron Von Thunderclap",
  "http_www_loonyparty_com_/http_www_loonyparty_com_get-involved_donate-to-the-official-monster-raving-loony-party/content_6.html": "If you would like to make a donation you can send a Cheque made payable to:\nO.M.R.L.P and send it to\nOMRLP c/o ‘The Flying Brick’\nHillside Farm, Field Lane, Kirk Ireton, Ashbourne, Derbyshire, DE6 3LN\nOr use the Paypal button below:\nAs we are a registered Political party in the U.K we have to abide by the Law and guidance of the Electoral Commission",
  "http_www_loonyparty_com_/http_www_loonyparty_com_proposals_policies-a-z/content_3.html": "The A-Z of the OMRLP Manicfesto Just a sample of what you’d get by voting for insanity – you know it makes sense!\nA.AIR bags will be fitted to the Stock Exchange immediately, ready for the next crash.\nB. BRITAIN will exit Europe and join the Duchy of Cornwall to benefit from tax exemptions.\nC. CAPITAL Punishment will be opposed on the grounds that it is unfair to Londoners.\nD. DATA will be secured, placed in a brown bag and hidden in the PM’s socks and pants drawer.\nE. Education. All University Tuition fees for women would be free as we are strong believers in Female intuition. (Due to gender equality laws we would include males as well)\nF. FRIVOLOUS Fraud Office setup to inspect fraud too silly for the Serious Fraud Office.\nG. GREYHOUND racing will be banned to prevent the country going to the dogs.\nH. HALF the grey squirrels will be painted red to increase the red squirrel population.\nI. INNOCENT prisoners will be released in order to reduce prison overcrowding.\nJ. JOBSEEKERS will be made to stand two abreast in order to halve dole queues.\nK. KIDS will be made to sit closer together on smaller desks in to reduce school class sizes.\nL. LONDON Marathon free to anyone finishing in sub-2 hours wearing large clown’s shoes.\nM. MEGA carwash will be created by punching holes in the roof of the Channel Tunnel.\nN. NATIONAL debt will be cleared by putting it all on our credit card.\nO. OAPS will qualify for a Summer Ice Lolly Allowance if temperatures exceed 70 degrees.\nP. PUDDLES deeper than 3 inches will be marked by a yellow plastic duck.\nQ. QUITTERS will be encouraged not to start in the first place to improve their self esteem.\nR. REGULATIONS concerning car boot sales will be relaxed to permit selling of all car parts.\nS.STAMP duty will be cancelled as stamps are expensive enough without having to pay duty.\nT.TERRORISTS will be made to wear Bells and Horns so we know where they are.\nU.UNRULY teenagers will be superglued together as if you can’t beat them, join them.\nV. VEHICLES will be fitted with bungy ropes in order to save fuel on the return journey.\nW. WIND farms will be created nationwide, where breaking wind will be encouraged.\nX. X-RAY machines will be manned by a skeleton staff.\nY. YELLOW lines will be painted where you can park instead of where you can’t to save money.\nZ. ZEBRA crossings will be made permissible to all animals wishing to cross the road.",
  "http_www_loonyparty_com_/http_www_loonyparty_com_get-involved_loony-membership/content_2.html": "One year’s membership to The Loony Party is £15-\nYou can join by using Paypal button below or contact Baron Von Thunderclap using the form lower down this page.\nIt is better for us if you choose the option of ‘Standing Order Annual Subscription’ – where your annual subscription of £15 is automatically contributed to the Loony Party and you remain year in year out a member of the most sensible party in British politics.\nPlease give us your Loony Name. Anything goes, but we should warn you that your Loony Name will be addressed on correspondence to you, so don’t blame us if your marriage ends abruptly because your wife receives a package addressed to ‘Baron Unfaithful Boaster of Broadmoor’.\nIncluded in your £15 membership is:\n- A Loony Party Rosette\n- A Certificate of Insanity\n- A Loony badge\n- Your Loony Party I.D Card\n- A letter from our Leader , Alan ‘Howlin Laud’ Hope\nPlease expect 3-4 weeks for delivery of the membership pack\n___________________\nOne Year Membership\nThere are two options in the drop-down menu below\nI year UK membership: £15-\n1 year International (outside the UK): £20\nThe extra charge for ‘International’ is to cover the extra postage for sending parcels outside the UK.\n___________________\nStanding Order Annual Subscription\nRenew your membership automatically with Paypal every year click below for annual subscription of £15. This option will withdraw your subscription every year on the date you join, and every year you will automatically receive a membership pack.\n___________________\nPostal Form for Membership and optional T-shirt\nPlease Join_the_Loony_Party_Form and send it with a cheque or postal order made payable to:\n‘OMRLP’ Membership Secretary\nBaron Von Thunderclap\nBundy’s Cottage, Colwood Lane, Bolney, Sussex, RH17 5QQ\nData Protection: Information received by the OMRLP will not be published, sold or passed on to any agency or third person.",
  "http_www_loonyparty_com_/http_www_loonyparty_com/content_1.html": "Runcorn & Helsby By election Manicfesto\nManicfesto for Runcorn Bye Bye Election 2025\nWe will stand for this election on the basis that the Loony Party although a small political party will always punch above our weight.\nAs the Government assure us that there is no problem with the burning of waste at the Runcorn Incinerator, we will reinstall it next to The Houses of Parliament. Well, its perfectly safe isn’t it?\nAs part of the Regenerating Runcorn plan we will build a space port\nWe will get rid of VAT as it adds no value.\nFly Tipping..We will ban all tipping of flys, insects, and zips of any kind..\nWe will replace employees of the Border Force with GP receptionists. This will dramatically reduce the number of people getting in.\nTo help with the cost of Living and to raise money for the Treasury we will Convert Numbers 10 and 11 Downing Street into a Hair salon, Which we will call ‘Government CutZ’\nAlong with the existing Government policy for levelling up the North with the South, we will provide free Spirit Levels to all.\nThe MOT is an annual test to ensure that your car is roadworthy. We will introduce a ROT, an annual test to make sure all roads are car worthy.\nIn an effort to reduce the problems faced by the NHS , it is proposed to reduce pregnancy from nine to seven months ?\nWe will reduce hospital waiting lists by using a smaller font.\nTo make things fairer we will introduce a Court of Human Lefts.\nOnce in Government, we will replace the Foreign Secretary with a British one!\nPublished by Mr R.U.Seerius for Alan Howlin Laud Hope on behalf of the Official Monster Raving Loony Party. 59 Newbarn Close..Fleet. Hants GU51 5HU\nHowling Toy\nEveryone needs more Howling Laud in their life, it must be true because Alan says so. Here’s your chance to take your Looniness to the next level by purchasing something that absolutely doesn’t exist.\nIn a world gone bonkers, one man stands taller than a pint of lukewarm ale at a village fête, wearing a hat large enough to house a small badger. He’s the only politician promising free teabags for all and a unicorn in every garage, with manicfestos scribbled on beer mats and policies dreamt up in the pub loo of Wetherspoons.\nTo purchase this non-existent product, get down to The Prince Arthur in Fleet with a crisp tenner in your eager little hand and a credit card to buy all the drinks. In return you will be given a copy of Alan’s book – whether you want one or not. And remember, vote Loony, because it makes no sense at all.\nTina\nHowling’s boxing for Runcorn on the 1st May\nHowling Laud Hope is our candidate for Runcorn & Helsby’s by-election.\nI drove up to Runcorn last Monday where I met Raving ‘Runcorn’ Rodent at The Ferry Boat, Wetherspoons. We were prepared for a rumble with monster knockout gloves and collected all of Howling’s nominations before the first round!\nNick the Flying Brick\nTeddyboy Tempest at Drayton Manor, Tamworth\nAll confirmed. We will do our full Screaming Lord Sutch Tribute show only once this year and that will be at the Teddyboy Tempest weekend at Drayton Manor Resort, Tamworth (which runs from the 14th to the 16th November).\nWe are scheduled to play on the Friday night at 11.00pm and our show will capture the best in Lord Sutch’s rock ‘n’ roll theatricals and madcap Raving Loony antics.\nAppearing in our line up that night will also be 2 legends of Rock ‘n’ Roll music: Steve Carter on guitar and Dave Thorncroft on Sax… Both of whom have a long history playing along side Lord Sutch back in the day.\nFurther details and tickets here: https://www.ducktails.uk/product/teddy-boy-weekender/\nDave Savage\nVisit to Ledbury\nSome time a go I had a phone call from Robin Oakey asking about our Loony Party, I invited him to attend our last conference in Belper and he asked if we would hold a Conference at his venue ‘The Barn’ in Ledbury. Last weekend I visited along with Lawd Lawson, OB Joyful and our Mem Sec Baron Von Thunderclap. It is a rustic and unique barn in the middle of a bustling town. We spent four days there and Robin and his team are great hosts, we enjoyed every moment of it.\nWe were entertained by an excellent Screaming Lord Sutch tribute act called Jesse Merry, plus an Undertaker/Mortician called John O’Looney, yes that was his real name, telling story’s that you wouldn’t believe! I made my party speech on the Sunday to every ones delight.\nI note that The Baron has reported that I have forsaken my White Suit. I had traveled halfway there and suddenly realised ‘****’ I’ve left my suit at home, so had to improvise. Luckily Robin had a ‘Merlin the Wizard’ coat which he loaned to me, it fitted very well and after seeing it was made for me he said ‘It’s yours!’\nSo its looking like, unless anything changes, thanks to Robin, it will be Loony Party Conference time 2025 in Ledbury, Heredforshire. Sept 25-26-27. More updates nearer the time.\nHowling Laud Hope Party Leader\nBaron Von Thunderclap’s Report from Ledbury\nMain point no more ‘man in the white suit’. Howlin’ is now the ‘man in the blue kaftan’. He borrowed it for this gig and liked it so much a deal was done and he’s now adopted it.\nThe weekend started badly when both Dangerous Dave and the rejuvenated Lord Sutch pulled out due to throat infections so the music was cancelled.\nSome local musicians picked up the baton and put on a bit of a show before Lord Sutch fresh from a 25 year residency at Pinner new cemetery made enough of a recovery to attend.\nDespite only managing a reduced set due to his bad throat it was enough to prove what a great musician he is starting with the favourite ‘Jack the ripper’ followed by many self penned tracks. Just like our spiritual leader he’s a great showman but has the advantage that he can actually sing!!\nOur hosts at ‘The Barn’ were lovely, even sending out for a mass fish and chip meal to feed 10 of us.\nThe locals were also very friendly (although there may be a backlash from some of the parents whose children we gave kazoos to!) and the town is lively with plenty of pubs. Perhaps a good venue for our conference?\nBaron Von Thunderclap",
  "http_www_loonyparty_com_/http_www_loonyparty_com_get-involved_conference/content_5.html": "2024 Conference\nThu 26 – Sat 28th Sept will be our 40th conference. We are heading back to The George and Dragon Hotel in Belper, Derbyshire which is a great venue. We have been there before, so we know we will be well looked after by a great crowd of people.\nThurs is meet and greet for the early arrivals. Friday great live bands ‘Moon Bullet’ plus ‘Man Pant’. Saturday two more live bands ‘Done Dirt Cheap’ and ‘Gripper and the Gurnards’ which will play after the 12 noon town pub crawl, the leaders speech, our world famous cabinet reshuffle and other shenanigans.\n‘Bad Axe’ will be there performing his usual set which is not suitable for the ‘Woke’ brigade. Accommodation is very good in and around the town, the venue itself has a couple rooms on a first come first serve basis.\nOnly 8 weeks away, so get in quick. Camping also available by arrangement.\nI’ll be there for 10 days, from Thurs 19th making sure all goes to plan. So if any of you want to make a longer break of it, you won’t be on your own.\nSee you all there.\nHowling ‘Laud’ Hope – Loony Party Leader 07946 292 557"
}