{
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_accessibility/content_2.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_news_regeneration-northwich-markets-need-be-accessible/content_3.html": "I spoke at Cheshire West Cabinet on Wednesday 31st July regarding their plans for Weaver Square in Northwich;\n\"I’m Charles Fifield and for the past 25 years I’ve worked as a Chartered Surveyor based at Gadbrook Park outside Northwich, specialising in Commercial Property. I would like to make the following points regarding the proposal:\n1. A markets needs to be in a location that benefits from footfall, car parking and public transport e.g. buses and taxis – for it to work.\n2. As such I am concerned the location of Baron’s Quay isn’t the right place, but if you are insistent on putting it there, please could I urge you to convert the “grassy knoll” between the Cinema and Baron's Quay into car parking for blue badge, taxis and a “turnaround spot” for small buses – a “shopper hopper” connecting the bus depot, the train station and Barons Quay - this would work to help increase the pedestrian flow through.\n3. Better idea would be keep the ground floor of the residential development of Weaver Square as commercial, perhaps as market kiosks / independents / starter units, especially the Witton Walk section connecting BQ, town centre and Memorial Court.\n4. Housing mix of Weaver Square would be best aimed at higher density starter units e.g. 1-2 bedroom for younger people to take advantage of location, in terms of public transport and leisure / nightlife. 1 of the last meeting I spoke at when I was a Councillor was a Scrutiny meeting when we looked at house numbers, whilst we have made a good start but 1 and 2 bedroomed properties were considerably lower.\n5. Appendix 4 – equality assessment – I am pleased to see reference to both Peter Grimes who is an excellent officer and the Council’s Disability Access Forum (which was established a decade ago for consultation on precisely these matters). I would urge particular consideration on the market fit out – Chester’s new market is very good however its not quite right for wheelchair users – the walkways, especially in the communal dining area are difficult to manoeuvre around in a wheelchair when its busy.\n6. Appendix 4 – Stakeholders – In addition to the stakeholders mentioned, I do think Northwich Businesses should be widened to include other Landowners and their Agents, given the need for some joined up thinking. Yesterday, Angela Rayner announced big planning changes to remove blockages in the planning system – I would also like to point out there are several other sites in Northwich which need the Council’s input / proactivity to move things alone (i.e. Winnington Street, Pumping Station and Bratts).\nIn conclusion, I would urge you to re-purpose the grassed area between the Cinema and Units 12/13 of Barons Quay (proposed new location of market so it can be used for Blue-Badge car parking, taxi rank and a turnaround circle for a shopper hopper) that could be the key to making it work\"\nCharles Fifield served as a Chester West Councillor for 12 years from 2011 to 2023, when he spoke frequently about regeneration.",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_contact/content_4.html": "Skip to main content\nMain navigation\nHome\nOur Plan\nAbout Charles\nNews\nCampaigns\nContact\nJoin Us\nSurvey\nContact\nLeave this field blank\nCampaign Centre\nF11 Northwich Business Centre, Northwich, CW9 5BF\n01606 606 301\n[email protected]\nCharles on Facebook\nCharles on X\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by Charles Fifield on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_campaigns_disability-issues/content_10.html": "Charles has FSH muscular dystrophy, whilst he can still walk unaided, he increasingly uses a wheelchair as he needs to be careful not to stand for too long.\nHe is very interested in disability issues, and helped establish Cheshire West & Chester Council’s Corporate Disability Access Forum in 2013, which he served as Chair until 2015 and then Vice-Chair until 2023. CDAF won the Accessible Britain Challenge Awards in 2015 and Charles narrated the Council’s CDAF 2015 submission. CDAF’s work was also an important factor in Chester winning the European Access City Award in European Access City 2016. Charles took a Motion to Council in 2017, which led to Cheshire West & Chester Council signing the Motor Nuerone Disease \"MND\" Charter in 2018.\nCharles is a member of Ability: RE which looks at disability and inclusivity issues within the Real Estate and Built Environment sectors.\nCharles is involved with the Conservative Disability Group, a former member of its Executive and has been a panel at their fringe events at the 2022, 2021, 2019 and 2018 Party Conferences. Charles is also involved in Ability 2 Win. In 2018 he also spoke on the main Conference Platform on disability issues.\nUseful Links and Help for Disabled People and carers:\nCaring for someone – Cheshire West & Chester Council, including short term breaks for carers.\nServices for disabilities – Cheshire West & Chester Council\nChildren with disabilities – Cheshire West & Chester Council\nGovernment Help for Households – help with cost of living issues.\nDisability Cost of Living Payment – 2023 to 2024\nBenefits and Financial Support – if you’re disabled or have a health condition.\nDisabled Facilities Grant – Grants to adjust your home.\nDisabled People – Includes carers, your rights, benefits and the Equality Act.\nNew how-to guide to help families access trust funds of disabled young adults\nRough Guide to Accessible Britain.\nCouncil Tax – potential discounts for disabled people.\nFoundation for people with learning difficulties – helping people with learning difficulties, families, carers, local authorities and service providers.\nMoney Saving Expert – 31 MoneySaving tips for disabled people.\nScope – Advice and support from the disability equality charity.\nCouncil for Disabled Children – network of community groups, voluntary bodies and practitioners.\nContact – charity supporting families with disabled children.\nFamily Fund – Helping disabled children. Provision of grants to families raising a disabled or seriously ill child, or young adult on a low income.\nVariety – The children’s charity helping disabled children and children in poverty.\nOfgem Priority Services Register – Extra help for eligible people from energy and network suppliers.\nStaying independent at home – Which? magazine advice.\nHealth and personal care – Which? magazine advice\nRoyal British Legion – Advice and support for veterans and their families, including care and independent living.\nSpecial Rules – Fast track assistance with the Benefits system for those approaching end of life.\nScope – Guide to planning disability care after a carer passes away.\nHidden Disabilities – Sunflower helping make the invisible visible.\nFun Stuff & Cheshire Initiatives\nCEA Card – UK Cinema Association card allowing free carer’s ticket (if carer is over 16 and disabled person pays full price) costs £6 per annum.\nScope – Events and activities, including day’s out guides and discounts.\nDial West Cheshire – providing advice and services for disabled people across West Cheshire, including Shopmobility in Chester, Ellesmere Port, Northwich and Winsford.\nCheshire Buddies – supporting over 150 young people and their families with new experiences and friendship.\nPetty Pool – helping young people with learning disabilities and difficulties.\nPetty Pool Plus – days out open to above and other disabled your adults, funded from personalised budgets.\nDanielle Ashley Activities – family run business helped adults with learning disabilities.\nNorthwich Multisports Club – helping children of all ages with disabilities.\nAlso please see “Charities and Community” page for potential sources of Funding for Charity and Community projects.\n(Charles Fifield is not responsible for the content of external websites).",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_news_category_Articles/content_8.html": "Charles Fifield for Conservative Home: How to be an effective councillor 30th November 2023 Hindsight is a wonderful thing, so what lessons have I learned as a councillor, and what advice would I give anyone taking their first steps towards becoming a... Articles\nCharles Fifield for conservativehome: Become a SLIMBY – Something Logical In My Back Yard 29th August 2023 In July, the Government renewed its pledge to increase house-building and Michael Gove made specific reference to “communities taking back control” and... Articles\nWest Cheshire: The Borough where additional education for Councillors on Poverty is a key priority but additional education for people in poverty is not. 10th July 2020 On Wednesday 8 July, the Cabinet of Cheshire West & Chester Council considered the declaration of a “Poverty Emergency” following the recent report of the... Articles",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_about-charles-fifield/content_5.html": "Charles Fifield is married to Vickie and they have 3 sons, all born in Chester. Charles was born in Crewe and has lived in Cheshire and worked in the North West all his life.\nHe works in Commercial Property as a Chartered Surveyor for his family firm Fifield Glyn, which has offices in London, Manchester & Cheshire, employing 30 people. He was a Director from 2003 to 2022 and now has a part time role the Company Secretary. He is a Registered Valuer and also arranged commercial property lettings, mainly to SME businesses. In 2023 Charles started part time a role as Policy & Engagement Officer at the Almshouse Association.\nLocally, Charles was a Cheshire West & Chester Borough Councillor for Weaver & Cuddington ward from 2011-2023 working hard with residents, Parish Councils, fellow Borough Councillors, Police / PCSOs and community groups, on local issues such as potholes, fly-tipping, speed enforcement, including helping to find funding for local community projects, often in partnership with the Parish Councils.\nHis involvement in politics began in 2002 when he joined the Conservative Party and became an active member of his constituency Association Weaver Vale, where he has been Vice President since 2018, prior to his he served as Deputy Chairman of Weaver Vale in 2005, Campaign Director in 2009 and Chairman 2010 to 2013, during which time we took the seat in the 2010 General Election from Labour with a 8.16% swing to elect Graham Evans.\nHe has also been actively involved with Cheshire & Wirral Area, before concentrating on West Cheshire following his election as a Councillor in 2011. In 2017 he was the parliamentary candidate for Bootle, a safe Labour seat, coming second which the Conservatives last achieved in 1997 and getting over 6,000 votes, the highest Conservative total since 1992.\nHe first stood for election in 2007 to Vale Royal Borough Council, in a safe Labour ward to demonstrate Conservatives should always be prepared to stand, whilst Labour kept the seat, they would subsequently lose the new CWC ward which replaced it in 2008 following local government re-organisation.\nHe stood for election in 2011 to Cheshire West and Chester Council for Weaver and Cuddington ward, topping the poll in this 3 member ward, which saw a clean sweep to the Conservatives despite a strong LibDem challenge. He was re-elected in 2015 and 2019 but decided not to stand again in 2023, after 12 years service. In December 2023, in recognition of his prior long service, he was created an Hon Alderman of the Borough of Cheshire West & Chester.\nHis service on Cheshire West & Chester Council included Chair of Places Scrutiny 2016-17, Chair of Corporate Scrutiny Committee from May 2014-2015, he served as an Assistant Executive Member, Chairing the Executive Policy Commission on Ageing Well from 2013-2014 and between 2012-13 he served as Chair of Appeals Committee. He was Opposition Group Whip 2022-23 and also served on Local Working Scrutiny, Community Governance Review, Events & Festivals Commissioning Board, Cheshire Brine Subsidence Compensation Board and Planning Committee.\nHe was also Chair of the Town & City Centres Working Group in 2013-14, which looked at issues affecting our larger settlements such as Chester, Ellesmere Port, Northwich and Winsford, together with general market trends and smaller market towns such as Frodsham and Neston.\nRecognising the continuing change in Retail, he repeatedly called for the Council to reform this Group from 2018, it finally met again during the Covid-19 pandemic, Charles served as its Deputy Chair and it delivered its report in November 2020.\nCharles has FSH muscular dystrophy, whilst he can still walk unaided, he increasingly uses a wheelchair as he needs to be careful not to stand for too long.\nHe is very interested in disability issues, and helped establish Cheshire West & Chester Council’s Corporate Disability Access Forum in 2013, which he served as Chair until 2015 and then Vice-Chair until 2023. CDAF won the Accessible Britain Challenge Awards in 2015 and Charles narrated the Council’s CDAF 2015 submission. CDAF’s work was also an important factor in Chester winning the European Access City Award in European Access City 2016. Charles took a Motion to Council in 2017, which to Cheshire West & Chester Council signing the Motor Nuerone Disease \"MND\" Charter in 2018.\nCharles is a member of Ability: RE which looks at disability and inclusivity issues within the Real Estate and Built Environment sectors.\nCharles is involved with the Conservative Disability Group, a member of its Executive and has been a panel at their fringe events at the 2022, 2021, 2019 and 2018 Party Conferences. In 2018 he also spoke on the main Conference Platform on disability issues:\nCharles has also appeared on other discussion panels at Conference including The Tax Payers’ Alliance panel on “Why does Council tax only go up?” within the 2021 Think Tent and “How can local councils deliver front line services without making cuts or increasing council tax?” in 2019.\nBetween 2013-15 Charles worked hard within the Council to ensure the popular “Round Tower” landmark at the A556 in Cuddington & Sandiway was rebuilt following a car accident in 2013 and he was proud to be able to see it rebuilt and back in place in 2015.\nCharles’s interest in Europe was primarily in relation to Trade and Business, he was keen to ensure this became the primary focus of the European Union. Charles wanted a reformed EU but that was not on offer and so he voted to Leave in the 2016 Referendum.\nWhilst he works in Commercial Property, he is also interested in rural issues as he has lived in the country all his life in Cheshire. He studied Rural Land Management at the Royal Agricultural College (now RA University) in Cirencester 1992-95, where he met his wife Vickie and he did his degree dissertation on the dairy industry following Vesting Day 1994.\nOutside of politics, Charles also is keen on voluntary work. Charles is an active fundraiser for his local Church, Christ Church Crowton, organizing their Annual Raffle since 2004 which raises around £1,500 per annum. Also since 2004 he has been a member of his village community association in Acton Bridge where he has lived all his life. He was elected to Acton Bridge Parish Council in May 2015 and re-elected in 2019 and 2023, becoming Vice Chairman.\nIn his professional body, the Royal Institution of Chartered Surveyors, he was involved in the “young surveyors” of RICS matrics becoming Greater Manchester Chairman in 2002 and UK National Chairman in 2007 representing 30,000 members. He became a Fellow of the RICS in 2009 in recognition of the work he had done for the RICS over many years. He is a member of the 1913 Wilderness Club, the Chartered Surveyors (1938) Club and the Manchester Society of Land Agents & Surveyors.\nIn 2002, as part of his role as RICS matrics Chairman in Manchester he organized a Charity Ball which raised £6,050 for the NeuroMuscular Centre in Winsford, where Charles has physiotherapy. In 2007/8 he oversaw the second year of the “Chairman’s Challenge” which through coordinated efforts across the UK raised over £86,000 for Charity between 2006/8.\nCharles’ other interests include Military & Political history, science fiction, social media, F1 racing, cricket, BBQ’s and beer. He has served as Archivist of the Cheshire Pitt Club since 2008.\nCharles is a keen “tweeter” on X-Twitter and can be found @charlesfifield often giving historical facts for the day.",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com/content_1.html": "Regeneration in Northwich - Markets need to be accessible 5th August 2024 Read full article Campaigns Disability issues Charles has FSH muscular dystrophy, whilst he can still walk unaided, he… Helping with the cost of living Government, Local Councils and other organisations are offering help with the… Thank you for voting for me on Thursday 4th July 5th July 2024 Read full article Find me on Facebook General Election: Thursday 4th July - Please vote for Charles Fifield 3rd July 2024 Read full article My map Am I your candidate? Enter your postcode to confirm that Charles Fifield is your candidate. Postcode\nHelping with the cost of living Government, Local Councils and other organisations are offering help with the…\nGeneral Election: Thursday 4th July - Please vote for Charles Fifield 3rd July 2024 Read full article",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_join-us/content_7.html": "Join the Conservative Party and help Charles and other Conservatives campaign in Mid Cheshire and elsewhere to win back our constituency, county and country.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections (after 3 months of membership).\nWe value committed members like you – join the Party today or renew your membership: https://membership.conservatives.com/membership/Levels\nStandard Membership is £39 a year or £3.50 per month, with reduced rates of £25 a year for current or former members of our Armed Forces and £10 a year for anyone aged under 26 years old.\nCharles said \"I've been a member of the Conservative Party for over 20 years, at it's heart, it is a group of dedicated people with a common purpose of wanting what is best for our country, our local communities and our economy.\"",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_news_west-cheshire-borough-where-additional-education-councillors-poverty-key-priority-additional/content_9.html": "On Wednesday 8 July, the Cabinet of Cheshire West & Chester Council considered the declaration of a “Poverty Emergency” following the recent report of the second Poverty Truth Commission and concerns over a rapid increase in poverty as a result of economic fall out from the Covid-19 Pandemic.\nCabinet looked to set up a Poverty Advisory Board to build on the Poverty Truth Commissions with its key principles as follows:\n• Ensuring equal opportunities for involvement between Community Inspirers and other stakeholders and adopting a common approach and principles of co-production.\n• Further developing two-way conversation between residents of the Borough and the Council/partner agencies.\n• Utilising data, analysis and evaluation to agree priorities and drive work more widely across the Council and with partner agencies.\n• Collective, multi-agency and cross-boundary working.\n• De-stigmatising and educational\nCllrs Lynn Gibbon and Charles Fifield spoke on this issue, welcomed what the Board intended to do but raised concerns about the lack of reference to helping those in poverty with needs in relation to literacy, numeracy, household budgeting and employment.\nThe Board seemed preoccupied with purely short term emergency measures to reduce the impact of poverty rather than also considering longer term measures to help provide a route out of poverty. They also raised concerns about rural poverty.\nCllr Fifield noted that home budgeting was advocated by the Citizens Advice Bureau and that the Trussell Trust and West Cheshire Foodbank had both recognised the need to help people with such skills with their “Eat well, spend less” and “pop up cooking” initiatives in the past. The Joseph Rowntree Foundation considers work alongside social security as the 2 key routes out of poverty.\nAs the Cabinet discussed the report and the comments raised, Cllrs Gibbon and Fifield were extremely disappointed to have our concerns dismissed by the Deputy Leader as “patronising” to those in poverty and that we were displaying a “Victorian” and even “Tudor” attitude to those in need, who we couldn’t possibly understand.\nWhen given the opportunity to speak again, Cllr Fifield clarified his comments to remove any doubt as to what he was proposing, as an addition to the key priorities, the following specific phrase:\n“Ensure issues such as numeracy, literacy, household budgeting and employment are also considered, where relevant”.\nSadly this was again dismissed, by the Leader of the Council, who none the less decided that 2 further key recommendations would be included:\nFirstly, the Poverty Advisory Board could choose to call itself the Poverty Truth Advisory Board and secondly, that Councillors should be given further education as to what poverty actually is.\nThis was approved unanimously by the entire Cabinet which means that in West Cheshire we now have a scenario where additional Education for Councillors on Poverty is essential but additional education for people in poverty is not.\n8 July 2020\n(Update: January 2023 West Cheshire receivied a grant of £1.5m from Government to help with adult numeracy.\nUseful Links:\nCitizens Advice Bureau – Budgeting https://www.citizensadvice.org.uk/debt-and-money/budgeting/\nTrussell Trust – East Well Spend Less holding page - https://www.eatwellspendless.org/\nMoney Advice Service: https://www.moneyadviceservice.org.uk/en\nMartin Lewis – Home Budgeting https://www.moneysavingexpert.com/banking/budget-planning/",
  "https_www_charlesfifield_com_/https_www_charlesfifield_com_our-plan-mid-cheshire/content_6.html": "Since being selected as the Conservative Candidate last year, I've been listening to local people, to find out what matters in our 3 great salt towns and I now have a plan for what I think people across Mid Cheshire want to see for our new constituency.\n- Improve our local High Streets and Town Centres - £10million invested in Winsford regeneration by our Government but I want to ensure Northwich and Middlewich benefit too. The Winsford regeneration needs to continue and include Verdin Exchange.\n- Quicker journeys by investing in local road and rail - including more funding for road repairs, a train station for Middlewich and access improvements for Northwich. Mid Cheshire deserves its fair share of funding from both Cheshire West and Cheshire East.\n- Improve our local infrastructure - we need a new bridge for Winnington and to start the eastern Middlewich by-pass.\n- Healthier lives by backing our local NHS - The Government is investing millions to upgrade Northwich VIN and Leighton. I will work with local people, GPs and Dentists to increase access to appointments. I will support local initiatives to encourage more exercise to improve both physical and mental health. Knight's Grange in Winsford also needs attention as grass roots sport, also boosts healthier lives.\n- Tackling Crime and Anti Social Behaviour – Cheshire has 322 more police officers, the most they have ever had and I will continue to support and work with Police to help cut crime. Housing Associations as well as the Police have their part to play.\n- Improve education for all – 90% schools in England are now rated good or outstanding up from 68% in 2010, but further improvements are needed, especially for SEND provision in Cheshire. I have pledged my support to the CWAC Send Accountability Group.\nThis is Our Plan for Mid Cheshire.\nCharles Fifield\nA strong voice for Mid Cheshire\nConservative Candidate for Mid Cheshire"
}