{
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_news/content_6.html": "MP Tables Bill to Reduce Traffic Delay and Disruption Tuesday, 1 April, 2025 Runnymede and Weybridge MP, Dr Ben Spencer, today introduced the Transport (Duty to Cooperate) Bill in Parliament, to highlight the issues of continued serious disruption on our transport networks and deliver on his pledge to keep Runnymede and Weybridge moving. The Bill calls for a duty on transport authorities and other relevant parties to cooperate more effectively to reduce transport... Westminster News\nReform of Planning and Infrastructure Rules 25th March 2025 Yesterday in Parliament I took part in the Second Reading debate of the Planning and Infrastructure Bill. I agree with the Government that aspects of our... Westminster News\nMP Calls for Integrated Transport Strategy 11th March 2025 Last week I submitted my response to the Transport for the South East Draft Transport Strategy consultation, outlining the clear need for an integrated... Local News\nStatement on Proposals for a Third Runway at Heathrow 29th January 2025 Today the Chancellor indicated support in principle for a third runway at Heathrow, without sight of any plans, any analysis of cost, benefits, or impact. The... Local News\nConcern Over Potential Further Delays to Weybridge Health Centre Project 14th January 2025 Supporting progress towards the rebuild of the Weybridge health centre has been a priority for me since I was elected in 2019. Having had years of engagement... Local News\nMP Calls on Runnymede Council Coalition to Retain Investment in Chertsey 8th January 2025 In November last year the Labour, Lib Dem, Independent and Green coalition in charge at Runnymede Council announced plans to divert funding secured for Chertsey... Local News\nThird Party Intermediaries in Energy Markets Consultation Response 15th November 2024 I was pleased to respond to the Government’s consultation on the regulation of third party intermediaries in the energy retail market this week. This... Local News\nUpdated Flood Contact Information Published 8th November 2024 Each winter too many residents have to worry about whether their homes will be safe this season. As we saw most recently in January, flooding affects our homes... Local News\nAutumn Budget 2024 30th October 2024 Today's Budget was approached with concern by many based on the promise of the Chancellor that it would be 'painful'. Having listened to the Budget Speech and... Westminster News\nMP Welcomes Councillor Support to Tackle Level Crossing Disruption 16th October 2024 I was recently contacted by Egham Town Cllrs Sam Jenkins, Geeta Moudgil and Isabel Mullens regarding the ongoing disruption caused by level crossings in the... Local News",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_accessibility/content_4.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_campaigns_scrap-ulez-expansion/content_8.html": "I have been campaigning against ULEZ expansion which will add significant costs for many residents and businesses, while achieving negligible impact on air quality. The Mayor's plans are simply a tax grab, proposed without full consultation or consideration of other, more effective means of improving air quality. While ULEZ expansion has now been rolled out (since 29 August 2023).\nBackground\nIn May 2022 London Mayor Sadiq Khan announced plans to expand the ULEZ zone to outer London boroughs. ULEZ expansion would add further costs for residents and businesses when budgets are already under pressure, disproportionately impact those on lower incomes, including key workers required to commute to London, and all with no evidence that it will deliver improved air quality in outer London boroughs, and a risk of worsening the situation on Surrey roads.\nResidents across Runnymede and Weybridge should not have to pay this London tax to prop up Sadiq Khan's failing administration.\nOn 12 April 2023 the High Court granted permission for a Judicial Review into Sadiq Kahn's ULEZ expansion plans. The decisions comes following challenge from 5 Conservative run Councils, including Surrey County Council.\nWhile I respect the decision of the Court, the decision that ULEZ expansion can proceed is hugely disappointing. The result in Uxbridge was a clear demonstration of the harm & discontent this reckless plan is causing. The Labour Party need to abandon this punitive London tax.\nULEZ expansion came into force on 29 August 2023. All but one surrounding local authority refused TfL permission to place ULEZ signage on their roads in protest at the negative impact this would have on residents.\nAlternative plans to improve air quality\nAs I highlighted in my speech in parliament, if Sadiq Khan really wanted to improve air quality, rather than introduce an unproven tax, he should be looking to push forward even faster car scrappage, and one that would help residents in Surrey. Or invest more in the conversion of TfL’s bus fleet to electricity and hydrogen vehicles. He is not even listening to industry who have highlighted the importance of the Zero Vehicle Emissions Mandate, and how supporting an ambitious mandate would drive even greater improvements in air quality.\nI have held several meetings with businesses operating in the sector and I know they are keen to deliver on measures to reduce emissions and improve air quality. They are keen to support efforts to drive and expand policy in this area, yet no efforts appear to be made to engage with this proactive agenda.\nGiven the lack of evidence that an expanded ULEZ will have a significant impact on air quality, and a lack of engagement with other policy approaches that could deliver real improvements to air quality, it is difficult to see the Mayor’s plans as little more than a way for Sadiq Khan to fill the black hole he has made in Transport for London’s finances. Despite millions of taxpayers pounds in bailouts from central government, an 8.8% increase in his share of London council tax, and at a time residents are already suffering the impact of rising costs.",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_campaigns_improve-local-rail-services/content_10.html": "I am campaigning to improve local train services. Our local infrastructure connects communities and helps make Runnymede such a great place to live, work and run a business. Our rail services are a vital part of this, offering easy access to London and the rest of the UK while also reducing the number of cars on our roads.\nYet too often what is offered it not matched by local delivery. From poor connections between mainline and branch line services, accessibility issues, with the Weybridge lifts the least reliable on the SWR network, to delays and disruption to services. Local commuters and all those who rely on the network deserve better.\nI am therefore campaigning to improve local train services. I have regularly engaged with South Western Railway when issues have arisen and have been pressing for improved timetabling to ensure sensible connections at Weybridge and Virginia Water. In response to the repeated issues with Weybridge lifts I have raised this at every level, including with the Transport Secretary, to press for action to ensure rail access for all passengers. I am delighted that Network Rail have confirmed that the lifts at Weybridge are now on a schedule of works to be renewed or replaced.\nThe acknowledgement that this work is needed is a significant success. However, there remain broader issues to be addressed around the data collection and accurate public information, which is also vital to ensuring accessible travel, and I will continue campaign on this to ensure our public transport is accessible to everyone.\nTicket office closure plans\nResidents will be aware of proposals last year from the Rail Delivery Group and South Western Railways to close all local ticket offices. I know many residents had concerns over these plans, many of which I shared. To reflect their views, and gain a greater understanding of local rail use, I created a local survey asking for your views. The responses to this survey fed in to my response to the consultation, which you can view here.\nAn astonishing 750,000 replies were received to consultations on these plans. As a result of the strength of feeling against these plans, on 31 October the Government instructed rail operators to cancel plans to close all rail ticket offices.\nThe plans would have disadvantaged customers and failed to address a whole range of accessibility, safety and value for money concerns for passengers. I am delighted our views have been heard and acted upon. Huge thanks to everyone who fed their views into my response or engaged directly.\nNational policy\nIn 2021, the Williams Review of British railways, commission by the Government, found that “too often railways are not getting the basics right”. This is evident in the issues and concerns reported to me on a regular basis by residents, and from my own experience as a frequent rail passenger.\nIn response the Government announced plans to reform the way our rail network operates and creating a new public body, Great British Railways, which will bring together many of the current segmented elements of our railways. This body will own the infrastructure, run and plan the network, organise the timetables, and set most fares.\nThe reforms will also replace the franchise system with new passenger service contracts, similar to those used to run London buses and the London overground; and reform and upgrade the fares system. I will continue to campaign for improvements to local services and deliver for our residents.",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_news_statement-proposals-third-runway-heathrow/content_9.html": "Today the Chancellor indicated support in principle for a third runway at Heathrow, without sight of any plans, any analysis of cost, benefits, or impact.\nThe Chancellor is right to prioritise economic growth, and the Government is in desperate need of measures to deliver this, but there is a logical incoherence given the backdrop of the harm to businesses and resulting job losses from their National Insurance tax rise.\nI have been a long-standing opponent of a third runway at Heathrow – while economic growth is important, so are the lives of the people this decision would affect, the environmental implications of such development, and the need to balance growth across the whole of the UK, to name but a few key considerations. Decisions should be made on the detail.\nIn light of the Chancellor's comments I expect we will see plans brought forward for a third runway, and I will be looking closely at what provisions are included to reduce noise and air pollution, such as increased climb rates and use of sustainable fuels by aircraft, as well as the level of proposed public engagement and the improvements to local transport infrastructure that would be needed. I will be calling on the Government to ensure all these factors are addressed prior to any formal decision on plans.\nI want Heathrow and our aviation sector to be successful, along with all the jobs, businesses, and families who depend on it - which is why I supported aviation so strongly during the pandemic and beyond; pushed for adoption of Sustainable fuel; and continue to campaign for better local transport routes to Heathrow. But a third runway causes Runnymede and Weybridge more problems than benefits.\nIf a third runway cannot be stopped, I will work constructively to make sure the local harms are mitigated and we get other direct benefits from it – removing a level crossing in Egham to improve traffic and support a rail link to Heathrow would be a good starter for ten…",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_campaigns_reduce-air-and-noise-pollution/content_7.html": "Air quality maps show that, in Runnymede and Weybridge, the largest impact we face is from our motorways and major A roads. Residents also know there is almost no part of the constituency that is not affected by motorway noise. We live in the most densely populated area surrounding a concrete motorway and this surface generally creates a lot more noise under such high traffic volumes.\nI have engaged with National Highways, Surrey County Council, transport providers and Government colleagues to deliver improvements to reduce both noise and air pollution. I have:\n-\nCampaigned for National Highways England to take action to reduce noise pollution from the M25, through both improvements to the road surface (and ideally a replacement of the concrete sections of motorway) and sound barriers\n-\nSupported the delivery of greener transport and technology, including greener buses and trains, as well as encouraging greater green infrastructure, such as charging points for electric vehicles.\n-\nSupported Surrey County Council to deliver improvements to our road network with reflect the needs of residents. In particular reducing emissions at level crossings, supporting schemes to reduce congestion and providing greater walking and cycle infrastructure alongside our road network\n- Pressed for further progress on ambitious national policy to reduce emissions and ensure sustainable energy and fuel supplies. You can see my recent consultation response regarding the transition to Zero Emission Vehicles here.\nProximity to Heathrow airport also has a significant impact on air and noise pollution. To help address this I am have worked with Heathrow and the aviation sector in support of Jet Zero and the development of greener aviation fuels. My response to the Government's recent consultation on sustainable aviation fuels is available here. I have also responded to the recent consultation on Heathrow's Noise Action Plan, which you can view here.\nI have also been campaigning for the delivery of the River Thames Scheme, which in addition to flood protection will also bring significant infrastructure improvements.",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_myplan/content_5.html": "I am campaigning to improve local train services. Our local infrastructure connects communities and helps make Runnymede such a great place to live, work and run a business.\nEvery resident deserves timely access to healthcare services, free at the point of use. Ensuring access requires facilities within our communities, providing the services residents need, where they need them.\nAir quality maps show that, in Runnymede and Weybridge, the largest impact we face is from our motorways and major A roads. Residents also know there is almost no part of the constituency that is not affected by motorway noise.\nI have been campaigning against ULEZ expansion which will add significant costs for many residents and businesses, while achieving negligible impact on air quality. The Mayor's plans are simply a tax grab, proposed without full consultation or consideration of other, more effective means of im",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_about-dr-ben-spencer/content_1.html": "I was first elected in 2019 and I do not believe there is a better place to live, work and represent than Runnymede and Weybridge.\nMy priorities for Runnymede and Weybridge are:\n- delivering greater protection from flooding\n- ensuring everyone has access to a great education and the skills to succeed\n- Tackling noise and air pollution, and improving sustainable infrastructure\n- celebrating and strengthening our communities\n- supporting local jobs and businesses\n- improving physical and mental health services, with particular focus on rebuilding Weybridge health services and CAMHS.\nMuch of my first two years as an MP were of course focused on addressing the challenges of the covid pandemic and supporting constituents, businesses, schools, health services and all who were affected. But I have been delighted by the progress also made on a number of these key priorities, increased per student school funding, approval for the River Thames Flood Alleviation Scheme, welcoming major investment in the constituency, supporting many community projects, including the fantastic Holme Farm Community project, and seeing our aviation sector rebound and recover.\nBefore my election, I worked for 10 years as an NHS doctor, specialising in mental health. Growing up I went to a state grammar school in the West Midlands and attended medical school in London. I live in the constituency with my wife and children.\nI believe that everyone, no matter their background, deserves great opportunities in life: a quality education, a stable job, the chance to own your home, to raise a family, and the safety net of strong public services, and will continue to work to deliver these for all constituents.",
  "https_www_drbenspencer_org_uk_about-dr-ben-spencer/https_www_drbenspencer_org_uk_privacy/content_2.html": "This document outlines how Dr Ben Spencer processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Dr Ben Spencer\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Dr Ben Spencer.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Dr Ben Spencer, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Dr Ben Spencer via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}