{
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-meets-farmers-grantham-area/content_3.html": "Gareth Davies MP this afternoon met with farmers from villages surrounding Grantham and the local branch of the National Farmers' Union (NFU).\nGareth meets regularly with local farmers, who are the backbone of rural communities and the rural economy. Gareth committed to continuing to work with farmers from Lincolnshire as they push for the Government to scrap their vindictive Family Farm Tax.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-presses-labour-impact-their-nics-tax-hike/content_53.html": "National Insurance Bill - Committee of the Whole House - Contribution by Gareth Davies (Grantham and Bourne) (Con) https://hansard.parliament.uk/Commons...\nNational Insurance Bill - Committee of the Whole House - Contribution by Gareth Davies (Grantham and Bourne) (Con) https://hansard.parliament.uk/Commons...",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_campaigns_campaign-strong-local-healthcare/content_60.html": "We all want reliable access to a GP, dental services, and our hospital. From day one I have held local NHS authorities to account to deliver excellent local services, while supporting national reforms to improve the quality of service, forever free at the point of need.\nIn the last Parliament I helped secure:\n- Grantham Hospital was back open 24/7 for emergency care.\n- Hospital expansion through a new surgical hub, increasing operating capacity by 50%\n- Lincolnshire’s first Community Diagnostic Centre in Grantham, with a further £5 million invested in new CT and MRI scanners to deliver tens of thousands of tests.\n- Outstanding local GP practices, with over 85% scoring above national average on the GP Patient Survey.\nMy work to ensure we have strong local NHS services never stops.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-supports-marie-curies-great-daffodil-appeal-2025/content_49.html": "Oh! What's Occurring? It is always wonderful to support Marie Curie’s Daffodil Appeal in Westminster, to celebrate the UK’s leading end of life charity.\nThis year they were joined by actor Larry Lamb, after his brother was supported by the charity before he passed away. It was great to speak to Larry and the nurses and volunteers from Marie Curie, to find out about the incredible work they do to make sure no one is alone or in avoidable pain.\nMarie Curie provides expert end of life care for people with any illness they are likely to die from, and they campaign to ensure that everyone has a good end of life experience. Their Great Daffodil Appeal encourages people to fundraise or donate and wear a daffodil to support the charity.\nFor more information or to donate, follow the link https://www.mariecurie.org.uk/daffodil",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-asks-minister-defence-procurement-about-good-quality-food-our-armed-forces/content_37.html": "At Defence Questions today, Gareth Davies MP asked the Minister for Defence Procurement, Alex Chalk MP, about ensuring good quality food for our Armed Forces.\nI'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_events_feed/content_26.html": null,
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-reminds-labour-whose-money-they-are-spending/content_68.html": "Gareth Davies MP today took part in the PMQ show on GB News where he was able to respond to PMQs following the event in the House of Commons.\nGareth Davies MP today took part in the PMQ show on GB News where he was able to respond to PMQs following the event in the House of Commons.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_category_Local-News/content_6.html": "Work Experience Day: Apply now 29th April 2025 I'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to... Local News\nGareth meets with farmers from the Grantham area 11th April 2025 Gareth Davies MP this afternoon met with farmers from villages surrounding Grantham and the local branch of the National Farmers' Union (NFU). Gareth meets... Local News\nGareth welcomes students from Priory Ruskin Academy to Parliament's Education Centre 21st March 2025 This week, Sixth Form students from Priory Ruskin Academy visited Parliament, and I had the opportunity to take part in a Q&A session with them. It's always a... Local News\nGareth calls on local residents to share their views on the future of Grantham's Old Cottage Hospital buildings 18th February 2025 Gareth Davies MP is encouraging local residents to contribute to a local NHS public consultation into the future of the Old Cottage Hospital buildings at the... Local News\nGareth stands with local Lincolnshire farmers against the Family Farm Tax 10th February 2025 Gareth Davies MP today joined farmers from across the country, including Lincolnshire, and Conservative MPs at a rally on Whitehall to stand against the Labour... Local News\nGareth supports Grantham Rotary Club's 2025 Swimarathon 7th February 2025 Gareth Davies MP today joined the excellent team from Grantham Rotary Club at the first day of this year's Swimarathon to show his support. Gareth said: \"It was... Local News\nGareth visits St James' Church in Woolsthorpe 31st January 2025 Gareth Davies MP today visited St James' Church in Woolsthorpe to meet with the local vicar, Rev'd Sarah Tierney, to look around this excellent village church... Local News\nGareth visits newly refurbished The Duck in Woolsthorpe 31st January 2025 Gareth Davies MP today visited The Duck in Woolsthorpe, which has undergone recent refurbishment after coming under new ownership. Local News\nGareth drops-by Harlaxton's Gregory Arms under new ownership 24th January 2025 Gareth Davies MP this afternoon visited the Gregory Arms in Harlaxton which is under new ownership after being taken over by Harlaxton College, based at... Local News",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_op-ed-britain-vies-join-key-asia-trade-bloc-it-must-stand-taiwan-against-china/content_51.html": "Last year, Xi Jinping celebrated the centenary of the Chinese Communist Party with a stark warning: “We must take resolute action to utterly defeat any attempt toward Taiwan independence”. In other words, Beijing remains committed to transforming their “One China” stance from legal fiction into geopolitical fact by any means necessary.\nWith Russia’s Vladimir Putin engaged in a horrific invasion of Ukraine, it is vital we consider Taiwan’s global position, and stay vigilant to the possibility of another democratic ally facing aggression.\nChinese efforts to isolate Taiwan hinge around preventing it from gaining recognition within the international community: whether by pressuring states not to seek free trade agreements, insisting that diplomatic ties exist with the People’s Republic of China alone, or blockading its participation in international organisations. The name “Chinese Taipei” in the medal table at Beijing’s Winter Olympics reveals the reach of the One China doctrine and the total denial of Taiwan as anything beyond provincial status within China\nIsolation can only increase Taiwan’s vulnerability to Beijing. Most recently, Taiwan has been denied the opportunity to participate in the World Health Assembly, in which they had held observer status, in retaliation for the 2016 election of nationalist premier Tsai-Ing Wen.\nEven after the outbreak of Covid-19, Taiwan was blocked from attending technical briefings from the World Health Organisation. Nevertheless, the Taiwanese response to Covid has been exemplary, registering one of the world’s lowest death rates while maintaining a robust economic performance with a growth rate above 6 per cent throughout 2021.\nWhile Taiwan’s exclusion from important international organisations undoubtedly affects its safety, prosperity, and health; it is also to the detriment of the organisations forced to do without the important contributions which Taiwan could offer.\nBritain can certainly go further in our efforts to welcome Taiwan into the global community. All calls for integration into the UN or WHO will fall on Beijing’s wilfully deaf ears.\nWe share many of the same values, not least a mutual recognition of the importance of free trade as a vehicle for global ambition. Regardless of their geopolitical position, it would be perverse for Britain not to seek closer functional ties with a potentially vital partner as we plan our global future.\nOne key tenet of this strategy will emerge from the benefits of joining the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) as its first non-founding, European member.\nBritain took one step closer to accession last month and we are in the final phase of the application process. International Trade Secretary Anne-Marie Trevelyan travelled to Indonesia, Japan, and Singapore to strengthen regional ties. Membership will be critical to removing 95 per cent of tariffs with nations across the Asia-Pacific who, in turn, will enjoy greater opportunities for their goods and services in Britain.\nThe CPTPP is proving to be yet another front to the Sino-Taiwanese proxy battle as both Beijing and Taipei have launched bids for membership. The One China doctrine will come to the fore with the two in direct competition.\nFor China, securing CPTPP membership is not paramount. Denial of Taiwan’s membership will be a concrete demonstration of their control. But Taiwan’s continual exclusion hinders their international competitiveness and further integration into the Indo-Pacific.\nExcluding China would deal a momentous blow to “Xi Jinping Thought” and affirm support for Taiwan. The CPTPP requires member states to protect fundamental rights including freedom of association and the elimination of forced labour. On this, pictures of abuse of Uighur Muslims in Xinjiang province speak for themselves.\nBritain should seriously consider declaring our support for Taiwan’s membership to make the case for international inclusion away from the well-trodden ground of the United Nations. Beyond the economic benefits of closer trade links to a soaring economy, it would be an opportunity to back calls for liberty and self-determination.\nAppeared in CityAM 10 March 2022",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-questions-governments-decision-fiddle-fiscal-rules/content_59.html": "Gareth Davies MP today questioned the Government's decision to alter the fiscal rules, despite their manifesto commitment not to do so.\nGareth Davies MP today questioned the Government's decision to alter the fiscal rules, despite their manifesto commitment not to do so.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_sign-gareths-newsletter/content_21.html": "Skip to main content\nMain navigation\nHome\nAbout Gareth\nNews\nMy local priorities\nHelp & Advice\nSign up to Gareth's newsletter\nTweet",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-drops-harlaxtons-gregory-arms-under-new-ownership/content_30.html": "Gareth Davies MP this afternoon visited the Gregory Arms in Harlaxton which is under new ownership after being taken over by Harlaxton College, based at Harlaxton Manor.\nGareth was kindly shown around the pub and the rooms onsite by Dr Holly Carter, the Dean of Harlaxton College.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_column-thoughts-all-our-area-are-those-affected-recent-flooding/content_61.html": "As we all settle back into our daily routines following the Christmas period, I want to wish all in our area a happy New Year and all the very best for the year ahead.\nWhile many who were lucky enough to have time off over the festive period will have spent the past fortnight taking down decorations and returning to normality, I know that the thoughts of all in our area are with those affected by recent flooding.\nWe all remember the impact of the flooding caused by Storms Babet and Henk last winter, where a number of local properties and businesses experienced significant damage.\nIt has been very sad this week to see many local people affected again by flooding, with a number of properties experiencing internal flooding across our corner of Lincolnshire.\nAs reported widely, in Grantham, the area around Wyndham Park and Belton Lane has been badly affected, and I know villages including Billingborough, Colsterworth, and others have also seen significant flooding as rivers burst their banks.\nAlongside residential properties, we know that businesses will also be affected whether they have been flooded themselves or due to the ongoing disruption, especially some local farmers who have seen their fields flooded.\nJust as our community has done so before, I have been pleased to hear of so many instances where local residents have come together, alongside parish councils and others, to aid their neighbours in need.\nI strongly encourage all those who have experienced flooding in recent days to seek support from our local authorities and follow the advice from local councils and Government agencies as the recovery operation begins.\nIn our area, Lincolnshire County Council is the Lead Local Flood Authority and works alongside the Environment Agency, district and parish councils, the emergency services, and others as part of the Lincolnshire Resilience Forum to coordinate support for local residents.\nRegularly over the past few years, I have met with a number of parish councils, local councillors, businesses and affected residents to discuss flooding issues, doing what I can to share their views and concerns with those responsible.\nIn recent days, I have been in contact with the Environment Agency to stay updated on the situation, and I continue to work with all those who are responsible for doing what is possible to minimise our local flood risk going forward.\nWhile the situation continues to evolve over the coming days and weeks, please make sure to check updated local flood warnings on the Government website; stay up to date on advice from local authorities and emergency services; and if necessary contact Floodline on 0345 988 1188 to seek advice.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk/content_1.html": "My local priorities\nLatest news\nFind me on Twitter\nGrantham and Bourne\nContact me\nConstituency Office\nThe Old National School, 62 North Street, Bourne, PE10 9AJ\nWorking hard for Grantham, Bourne, and our local villages\nI'm Gareth Davies and I'm honoured to have been elected as the Conservative MP for Grantham, Bourne and our local villages, in the beautiful county of Lincolnshire. Here you can find my latest news, campaigns and what I stand for, as well as how to contact me. Please don't hesitate to get in touch!",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-supports-world-book-day-2025/content_39.html": "Happy World Book Day 2025!\nReading is one of the biggest indicators of a child’s future success, and it is a wonderful hobby that develops cognitive skills and stretches the imagination. To celebrate World Book Day, children across Lincolnshire will head to school today dressed as their favourite book characters!\nEnglish primary school children have claimed the crown as the best readers in the Western world, which is great news for children and for our country’s future if this remains the case. While we should be proud of our children for reading so well, only 1 in 3 children say they enjoy reading, so there is more we can do to encourage a love of reading beyond school.\nWorld Book Day helps children reclaim a love of reading by ensuring every child has access to a book of their choice through their £1 book vouchers. All children across the UK will receive one of these vouchers, where they can choose their favourite book, empowering them to help make reading fun.\nEveryone deserves the enjoyment of reading, and it is great to see that we have so many library services here in Grantham and Bourne. Libraries provide an important space for local communities, and Lincolnshire County Council’s Mobile Book Service ensures that even the most rural residents get regular access to library services.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_campaigns_bolster-our-local-infrastructure/content_11.html": "Whether it is new funding for improved road links, or better broadband, we must ensure our communities are as connected and productive as possible. I will always work to make sure our town and its people have strong and reliable infrastructure.\nIn the last Parliament, I helped secure:\n- £4.3 million to upgrade the A1 between Grantham and Stamford, among the most per-mile in the region.\n- £9.8 million for road resurfacing and highway maintenance across the local area.\n- Improved digital connectivity, including rural areas, with gigabit access rising from just 3% in 2019 to over 82% today.\nWhere there are significant announcements in sectors such as transport, broadband, and utilities, I continue to stand up for our fair share of Government infrastructure investment.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-attends-farmers-protest-westminster/content_54.html": "Gareth Davies MP was pleased to attend the farmers protest in Westminster today and meet with a group of local farmers in Parliament to discuss the impact of Labour's proposed Family Farm Tax.\nGareth said:\n\"I wholeheartedly support the farmers’ protest this week and will continue to push the Labour Government to scrap their Family Farm Tax.\"",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_category_Reports/content_41.html": "STATEMENT ON THE DEATH OF HRH PRINCE PHILIP, THE DUKE OF EDINBURGH 9th April 2021 It is with great sadness that I heard the news of the death of HRH Prince Philip, the Duke of Edinburgh. My first thoughts are with Her Majesty The Queen, to... Reports",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_campaigns_champion-our-local-schools-and-colleges/content_67.html": "We have some of the best schools in the region. It is vital that we continue to support them to succeed and fund them appropriately. Our children deserve happy, healthy childhoods and to thrive through excellent education.\nIn the last Parliament I helped secure:\n- Highest school funding levels in history, with £91 million allocated to our local schools for 2024-25.\n- £1.5 million for Grantham College to upgrade existing facilities, following the opening of its £2.6 million state-of-the-art Institute of Technology.\n- More schools in the constituency are now rated ‘Good’ or ‘Outstanding’ by Ofsted than in 2019.\nI want to ensure that not only do academic standards and results improve, but our children are happy and learn the importance of kindness and compassion, giving them the best possible opportunity in life.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_op-ed-we-need-build-britains-piggy-bank-and-help-young-workers-saving-future/content_46.html": "Ten years ago, a government policy came into law that would go on to financially benefit over 10 million people in the UK, giving them a greater stake in our economy and more security later in life.\nAutomatic enrolment is an untold, underappreciated success story that we should look to build on and expand. For all the talk of our increasingly divided politics, on this there is consensus across the political spectrum. Indeed, we owe the system and its successes to the efforts of our three main political parties. It was a Labour government which first set up the Pension Commission to recommend a response to a dire outlook for private pension savings, and then legislated for automatic enrolment in 2008. The policy was carried forward with enthusiasm by the Conservative and Liberal Democrat coalition government in 2012.\nToday, once a worker is older than 22, and earning above £10,000 annually, 5 per cent of their income above £6,240 is automatically put towards their pension. Employers then contribute an additional 3 per cent boosting their savings for later life. The results have been remarkable; 88 per cent of those eligible now save for a pension, up from 55 per cent in 2012. 10 million extra savers are contributing an additional £17bn a year, two million fewer people are under-saving for their retirement than otherwise would have, and the youngest and lowest earners have seen the greatest improvements.\nIt also has a positive social impact, helping to equalise the participation rates of men and women, as well as eliminating the mental health pension participation gap which saw lower savings rates among those with poor mental health.\nIt has cultivated a greater savings culture in our country and reinforced the property-owning nature of our democracy. When the country and the economy does well, savers do well. In this way, millions more have more skin in the game when it comes to the economy which translates to greater engagement at the ballot box – giving their vote new salience and personal consequence.\nEven with this success, we need to look at how it can be improved. I strongly endorse, as I set out today in a new report with the Social Market Foundation, the government’s aspiration to expand the policy to those aged between 18 to 21-years-old whose need is greatest.\nOnly one in five of those eligible in this age group are enrolled in a workplace pension. But young workers will need their personal pension savings to go further as more of their generation live longer. In fifty years time, when workers aged 18 years old today enter retirement, the ONS predicts that the number of people in Britain aged 65 or above will nearly double to exceed 20 million.\nCompound interest can help to meet demographic demands, but it is important to note that its benefits are amplified the earlier you save; of two people the same age with a salary of £19,500, the one who starts saving at 18 will, with compound interest, have saved £40,000 more by the age of 65 than the one who started at 22.\nThere is an understandable anxiety about lumping younger workers with an unwelcome burden. But these very same objectors were raised for automatic enrolment in 2012. For businesses, extending automatic enrolment to young workers could even reduce administrative costs by bringing the threshold in line with the national minimum wage. For young workers themselves, automatic enrolment reduces the perceived burden of saving by avoiding the jarring transition they currently make from zero pension contributions to 8 per cent at the age of 22.\nThe bottom line is that the combination of demographic, environmental, and mental health pressures means there has arguably never been a generation for which saving early has mattered more. We have at our disposal a policy with a proven track record of increasing pension participation rates. In every sense, automatic enrolment has the power to save – let us extend it to our youngest workers as soon as possible.\nAppeared in CityAM 15 March 2022",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-visits-st-james-church-woolsthorpe/content_12.html": "Gareth Davies MP today visited St James' Church in Woolsthorpe to meet with the local vicar, Rev'd Sarah Tierney, to look around this excellent village church and learn about the efforts required to maintain the church building.\nGareth Davies MP today visited St James' Church in Woolsthorpe to meet with the local vicar, Rev'd Sarah Tierney, to look around this excellent village church and learn about the efforts required to maintain the church building.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_labours-inheritance-no-financial-dunkirk/content_29.html": "When Keir Starmer bills himself as a Clement Attlee Mark II, the comparison works on some levels. Both were lawyers of bourgeois background, born in Sussex, and swept into power in large landslides in their early 60s.\nYet when the Prime Minister and his colleagues claim to have inherited the worst economy since Attlee, who battled against what John Maynard Keynes described as a ‘financial Dunkirk’, they push the parallels too far.\nWhat Labour inherits today is no such ‘Dunkirk’, and peddling such doom and gloom risks perpetuating a declinist narrative that could damage recent economic progress.\nIn 2010, the Conservatives came to power amid far more challenging economic circumstances than those which Labour confronts today. Inflation and unemployment were both higher then than they are now, and the budget deficit was 2.5 times larger.\nWhile it is true that the Covid-19 pandemic and the war in Ukraine have since injected a great deal of instability back into the global economic landscape, with debt surging and growth stalling, it is worth remembering that had Labour presided over these challenges the economic picture would be very different – and far more bleak.\nMy own eyes and the official record bear witness that, throughout that time, Labour erred on the side of an even larger state. From longer lockdowns which would have meant lower revenues and bigger backlogs, to higher public spending that would have resulted in more debt and more taxes.\nThat said, those wishing to challenge Labour’s alternative history do not need to rely on an alternative history of their own. The latest economic data speaks for itself.\nDebt - at 97.6% of GDP - is certainly still too high, but it has not reached the record levels of the mid-1940s, and is lower now than it was at any point between 1915 and 1963.\nInflation is now at 2% - the target rate - which is a far cry from the rampant inflation of the 1970s. It has fallen ahead of expectations.\nUnemployment is down to 4.4%, far below what it once was under previous governments - and what it reached at the height of the pandemic.\nThe economy is growing again, too. The IMF recently revised upwards its growth outlook for the UK in 2024 to 0.7%, and Britain also started 2024 with the highest growth rate within the G7.\nBusiness confidence is now at +16.7, which is well above the score of -45.3 which was once recorded under Gordon Brown.\nThe Prime Minister’s claim to have inherited the worst economy since Attlee is therefore false at best - and disingenuous at worst.\nWhile lacking any foundation in fact, there is an obvious political expediency in such claims. They insulate the Prime Minister and his party from poor performance and sluggish progress, while tarring the Conservatives with the brush of financial incompetence. At the same time, they allow any favourable economic news to be attributed to the new government and soften the blow of inevitable tax rises.\nIn exchange for a stronger political position, the Labour Party are clearly content to weaken the reputation of the United Kingdom by perpetuating a declinist narrative that does not comport with recent economic history – even though misrepresenting the state of our economy and neglecting recent progress in this way risks scaring away investors, dampening business confidence, and so becoming a self-fulfilling prophecy.\nThis makes a mockery of the Prime Minister's “country first, party second” mantra.\nOf course we face economic challenges: debt remains too high, wages and productivity need to rise faster and further, and workforce participation must increase.\nStill, sound economic policy starts with honesty not hyperbole, and it is poor form for a Prime Minister who once promised “frank hope” to put a negative narrative ahead of the numbers.\nWinston Churchill famously described Clement Attlee as ‘a modest man who has a great deal to be modest about’. The current Prime Minister may wish to avoid this particular comparison, but that is the line he is currently taking on the British economy.\nPicture by Simon Dawson / No 10 Downing Street - https://creativecommons.org/licenses/by-nc-nd/2.0/",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_about-rss/content_10.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-welcomes-grantham-preparatory-international-school-pupils-parliament-0/content_70.html": "Gareth Davies MP today welcomed pupils from Grantham Prep School to Parliament and joined their session to take Q&As as they learn more about our parliamentary democracy.\nGareth Davies MP today welcomed pupils from Grantham Prep School to Parliament and joined their session to take Q&As as they learn more about our parliamentary democracy.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-davies-mp-sets-out-his-position-ahead-assisted-dying-vote/content_52.html": "Gareth Davies MP said:\n“Next week, on Friday 29th November, MPs will vote on legislation which would permit those with terminal illness to be provided with assistance to end their own lives.\nThis is an incredibly serious matter, and I am profoundly grateful to all those who have taken the time to write to me to share their views and experiences, whether we agree or disagree.\nThe Bill provides that an individual’s death must ‘reasonably be expected’ within six months to be eligible, and that their application would be subject to assessment by two qualifying medical practitioners and High Court approval.\nI will vote against the passage of this legislation for the fundamental reason that it would devalue life, and in doing so would pose an existential risk to the most vulnerable in our society, while hindering ongoing efforts to both improve palliative care and develop lifesaving medicines.\nAlongside these principled objections, I have practical concerns regarding the ability of our healthcare and judicial systems – even in the best of circumstances – to guarantee that no death would result from misdiagnosis, coercion, or any other form of error or injustice.\nI would in any case have been extremely hesitant to vote for legislation of such significance when it has been published barely two weeks ahead of voting, will be given very limited parliamentary time for scrutiny, and is unaccompanied by a Government impact assessment.\nMatters of life and death must never be taken lightly, and I take this position out of an abundance of concern.”",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-celebrates-armed-forces-week/content_50.html": "Gareth Davies MP today joined the Mayor of Grantham, SKDC Chairman and local military representatives to mark Armed Forces Week in honour of all those who serve in uniform. As the Vice Chairman of the All Party Parliamentary Group for Veterans, Gareth is a keen supporter of our military. The Armed Forces Day flag was raised above the District Council building in Grantham to mark the week.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_category_Westminster-News/content_34.html": "Gareth welcomes Grantham Preparatory International School pupils to Parliament 30th January 2025 Gareth Davies MP today welcomed pupils from Grantham Prep School to Parliament and joined their session to take Q&As as they learn more about our parliamentary... Westminster News\nGareth attends farmers protest in Westminster 19th November 2024 Gareth Davies MP was pleased to attend the farmers protest in Westminster today and meet with a group of local farmers in Parliament to discuss the impact of... Westminster News\nGareth Davies MP sets out his position ahead of ‘assisted dying’ vote 18th November 2024 Gareth Davies MP said: “Next week, on Friday 29th November, MPs will vote on legislation which would permit those with terminal illness to be provided with... Westminster News\nGareth reminds Labour whose money they are spending 6th November 2024 Gareth Davies MP today took part in the PMQ show on GB News where he was able to respond to PMQs following the event in the House of Commons. Westminster News\nGareth responds to the Labour Government's Autumn Budget 1st November 2024 Gareth Davies MP today spoke on various national and local media platforms following the Labour Government's Budget to give his response. Westminster News\nGareth gives a speech on the importance of investment 17th October 2024 Gareth Davies MP today spoke in the House of Commons on the importance of private investment, following the Government's International Investment Summit held on... Westminster News\nGareth discusses rural crime with the Countryside Alliance and National Rural Crime Unit 15th October 2024 Gareth Davies MP today met with the Countryside Alliance and National Rural Crime Unit in Parliament to discuss rural crime and their work to protect our... Westminster News\nGareth discusses the impact of Labour's mixed messages on the economy 23rd September 2024 This morning Gareth Davies MP spoke on Sky News about the consequences of Labour's mixed messages for economic confidence. As part of his media round, Gareth... Westminster News\nGareth celebrates local farmers on Back British Farming Day 11th September 2024 Gareth Davies MP today celebrated local farmers on Back British Farming Day, as part of a wider campaign led by the NFU. Westminster News",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_column-our-local-hospitality-businesses-need-our-support-overcome-challenges/content_38.html": "January can feel like a long month, a month where we all settle back into routine. However, I know some families and local businesses are still recovering from the impact of the recent flooding. I understand their frustration, and I want to assure them that I remain in regular contact with our local authorities and those such as the Environment Agency to help liaise support and push for solutions to reduce future flood risk from those responsible.\nAs our community began the clear-up, I wrote to the minister responsible in the Government to ask what compensation would be made available to those residents and businesses who were affected. I was very disappointed to hear in response that the Government has decided to not provide support similar to that provided by the previous Government following Storms Henk and Babet last year, but I will continue to push for them to do so.\nAnother area I have been challenging the Government is over support for our hospitality sector. Whether one of the fantastic Nepalese curry houses of Grantham, a quiet cafe on Bourne’s high street, or a traditional village pub, hospitality businesses breathe life into our community.\nYou may be aware that the Chancellor, Rachel Reeves MP, decided to raise the minimum wage in her Budget. This is something that received cross-party support, but we must remember that this is a cost that is paid by businesses, not the Government.\nOn top of this additional cost, the Chancellor simultaneously decided to raise the National Insurance paid by employers on many of the workers they employ. This decision stifles business, especially at a time where they are already struggling, and independent forecasters have said that at least three-quarters of this tax rise will eventually be passed on in higher prices and lower wages.\nAs well as increasing the cost of the more than 2,300 hospitality jobs in our area alone, the Government is reducing the specific relief on business rates. From April, this decision alone means that the average local pub will see their business rates bill increase by more than £5,500 a year and by almost £8,000 for the average restaurant.\nAlmost no sector is impacted more heavily by these decisions than the hospitality sector. The village pub you visit for your Sunday roast, the restaurant you visit to celebrate special occasions, or the cafe you pop by while on our high streets - almost all will see their costs rise.\nBusinesses from right across our country are set to face the same challenges from April, so this week, I was pleased to meet industry representatives at a UK Hospitality event held in Parliament. Many sadly expressed the same concerns for the future that I hear from the local business I visit each week.\nI will continue to make the case for backing our hospitality sector in Parliament and will always aim to champion local businesses. But our local hospitality retailers need all of our support more than ever, so whenever you can, please join me in continuing to eat, drink, and shop locally.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-responds-labour-governments-autumn-budget/content_72.html": "Gareth Davies MP today spoke on various national and local media platforms following the Labour Government's Budget to give his response.\nGareth Davies MP today spoke on various national and local media platforms following the Labour Government's Budget to give his response.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_feed/content_14.html": null,
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-discusses-impact-labours-mixed-messages-economy/content_69.html": "This morning Gareth Davies MP spoke on Sky News about the consequences of Labour's mixed messages for economic confidence.\nAs part of his media round, Gareth also discussed similar themes on TalkTV, which can be viewed via the following link: https://youtu.be/s1iTFeXYW8w?feature=shared",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_column-together-we-can-improve-safety-and-reliability-our-local-roads/content_48.html": "Our county has a road network of some 5500 miles, one of the largest of any county in England. Because of this, maintaining this network and ensuring safety on our roads is not an easy task for those responsible, such as National Highways, our local authorities, and Lincolnshire Police.\nNevertheless, we depend on our roads. Whether going to school or work, to access key public services or our high streets, or just to travel for leisure, rural areas like ours depend on our cars and the accompanying infrastructure.\nWith so many miles of road to maintain road works are inevitable, just like those being undertaken in Bourne. Where work is undertaken on the road or nearby infrastructure, we all want it to be completed as quickly as reasonably possible, and I appreciate how much thought goes into making this happen.\nThe A1 in particular plays a vital role for so many as the backbone of our transport connectivity, with National Highways the body responsible for the road.\nWe heard in recent weeks that National Highways will be running a consultation into all of the crossovers along our stretch of the road.\nIn recent years, many residents would have received a survey and letter from me specifically asking for their views on the A1, delivered to over 25,000 people. The responses I received have been invaluable in helping to provide the evidence I need to continue to work with the Lincolnshire County Council Leader and other Lincolnshire and nearby MPs to push for National Highways to take action to improve both safety and reliability on our stretch of the road.\nI know from reading through these responses and my regular conversations with residents that there are a range of views on aspects of the A1.\nFor example, on crossovers, while many have concerns over their safety, for our farmers and those living in villages around the A1, they significantly reduce the time it takes to get to and from their properties.\nI understand that National Highways are already proposing to close 16 gaps between Little Ponton and South Witham. I expect further proposals to be released in due course following the consultation.\nAided by all those residents who have contacted me on the A1 and who have taken the time to complete my surveys, I have always pressed National Highways to include local consultations as part of their ongoing investigations into the road. I am pleased we have secured this.\nI was recently updated on the Grantham Southern Relief Road, which unfortunately will be delayed by one year following a bridge design error.\nWhile I know how frustrating delays on projects such as this can be, I am very grateful to our Conservative Lincolnshire County Council team, under the excellent leadership of Cllr Martin Hill OBE, who are determined that those responsible will be held to account for any associated additional cost of the project. This means that any additional money spent will be recovered for the taxpayer.\nMy work on improving our local infrastructure continues, aided by the support and views shared with me by local people.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-stands-local-pubs-parliament/content_64.html": "Gareth Davies MP today spoke at a debate in Parliament's Westminster Hall on support for the hospitality and pub sector ahead of the Budget on 30th October.\nGareth Davies MP today spoke at a debate in Parliament's Westminster Hall on support for the hospitality and pub sector ahead of the Budget on 30th October.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_about-gareth/content_36.html": "Gareth was born and raised in Yorkshire, growing up in Leeds and Hull. He is the eldest of two sons to his mum, a state primary school teacher, and his dad, a small business owner.\nGareth attended state comprehensive schools in Leeds and loved playing football, tennis and cricket. He went on to complete degrees at the University of Nottingham and at Harvard University where he focused on building greater knowledge of economics, trade and foreign affairs and won first prize in his class' debate competition.\nEver since watching his dad grow his own business, Gareth has wanted to be a businessman. For over thirteen years Gareth worked for a global investment company, doing business with some of the largest pension and sovereign wealth funds in the world, and travelling extensively in the United States, across Europe, China and the wider Asia Pacific. Gareth has a long history of serving in his community, and helped establish his company’s first charitable foundation which specifically supports small British charities focused on social mobility.\nIn 2019, Gareth left his business career to run for election in Grantham and Stamford constituency. He has represented constituents across Grantham, Bourne, Stamford and local villages ever since – navigating the first pandemic in a century and the biggest war in mainland Europe since the Second World War.\nDespite these local challenges, Gareth has worked to deliver more investment and better services for local people. Compared to 2019, local infrastructure is stronger, communities are safer, children have better opportunities and healthcare has added capacity.\nGareth made strong reliable infrastructure a key priority and today local connectivity is much improved. He helped secure £4.3 million for safety upgrades on the stretch of the A1 between Grantham and Stamford, £9.8 million for local road resurfacing and maintenance, and an increase in Gigabit broadband access from 3% in 2019 to a remarkable 82%.\nWorking with Lincolnshire Police, Gareth has voted through tough new laws to keep local communities safe. Since 2019, crime is down by 15% in Grantham and Bourne, 189 new full-time police officers have been recruited, and a dedicated Rural Crime Acton Team has been established.\nAs the product of our state school system, Gareth regularly visits schools and gives children advice on their future careers and on the importance of public service. There are now more ‘good’ and ‘outstanding’ schools in the local area than in 2019, record local school funding has been secured, and Gareth was delighted to open Grantham College’s new £2.6 million Institute of Technology as a strong supporter of local Further Education.\nAs Gareth said in 2019, “we rely on hospitals in the best times of our lives and the worst times”. With a growing population, he appreciates that improved capacity and a greater focus on prevention are integral to a sustainable local healthcare system. Following intensive lobbying by Gareth, Lincolnshire’s first ever Community Diagnostic Centre opened in Grantham. The doors at Grantham Hospital are back open 24/7 after a period of part-time opening hours, alongside a new nationally recognised Surgical Hub which expanded operating capacity by 50%. All of which has been backed with millions in new funding to serve people from across the county.\nGiven his background, Gareth has long been a champion of local businesses and has visited many across the area in his time as Member of Parliament. Since 2019, £5.5 million in national funding has been secured to regenerate Grantham high street, businesses have benefited from business rate and draught duty relief, and there are 340 more businesses open in the area.\nIn the General Election of 4th July 2024 Gareth was elected as MP for the new constituency of Grantham and Bourne. He is a member of the 92 Group of Conservative MPs.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_map-locations/content_35.html": "Skip to main content\nMain navigation\nHome\nAbout Gareth\nNews\nMy local priorities\nHelp & Advice\nMy map",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_privacy/content_9.html": "This document outlines how Gareth Davies MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Gareth Davies MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Gareth Davies MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Gareth Davies MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Gareth Davies MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_campaigns_keep-our-community-safe/content_4.html": "We all want to feel safe in our homes and on the streets. I fully support Lincolnshire Police to crack down hard on criminals who seek to do us harm. I am proud to have voted through tough new laws and sentences for violent crime, disruptive protests, and illegal immigration.\nIn the last Parliament, I helped secure:\n- 189 additional police officers for Lincolnshire Police as part of a national uplift.\n- Dedicated rural policing through a new Rural Crime Action Team.\n- £900,000 Safer Streets funding to combat anti-social behaviour and additional funding for CCTV upgrades.\n- A reduction of crime by 15% in Grantham and 16% in Bourne.\nPublic safety is one of my key priorities for our community and I back Lincolnshire Police to make our streets safer and to protect our people. That means more police, better equipment, and tougher laws.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-challenges-labour-business-and-investment-taxes/content_22.html": "I'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-questions-labours-energy-policies/content_62.html": "At HM Treasury Oral Parliamentary Questions today, Gareth Davies MP asked the Government whether their energy policies will reduce bills, and whether Labour ministers still stand by their election promise to cut energy bills by £300.\nAt HM Treasury Oral Parliamentary Questions today, Gareth Davies MP asked the Government whether their energy policies will reduce bills, and whether Labour ministers still stand by their election promise to cut energy bills by £300.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_campaigns_back-local-businesses/content_57.html": "Thriving local businesses provide valuable jobs, products, and services for our local communities. I believe enterprise should be rewarded and cultivated, with confidence coming from economic stability and policies that lift obstacles to help firms get on, grow, and invest locally.\nIn the last Parliament I helped secure:\n- £5.5 million to revitalise Grantham’s High Street and £540,000 for rural businesses and communities.\n- Energy support packages to protect businesses.\n- A rise in the VAT threshold for small businesses, and the extension of 75% business rates relief for those in the retail, hospitality or leisure sectors.\n- 2,418 business loans worth more than £114.6 million during Covid.\n- 340 more businesses in the constituency than in 2019.\nWhile the role of local shops and high streets has evolved over time, I want to do everything I can to make sure ours remains a hub of community activity which helps to make our towns and villages even more attractive places to live, work, and prosper.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-visits-newly-refurbished-duck-woolsthorpe/content_45.html": "Gareth Davies MP today visited The Duck in Woolsthorpe, which has undergone recent refurbishment after coming under new ownership.\nGareth Davies MP today visited The Duck in Woolsthorpe, which has undergone recent refurbishment after coming under new ownership.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-calls-local-residents-share-their-views-future-granthams-old-cottage-hospital-buildings/content_25.html": "Gareth Davies MP is encouraging local residents to contribute to a local NHS public consultation into the future of the Old Cottage Hospital buildings at the front of Grantham Hospital. While these buildings are still owned by the NHS, Gareth has always encouraged local NHS leaders to consult local people before a decision is taken on their future.\nGareth said:\n\"Our local NHS Hospital Trust is inviting members of our community to share their thoughts as part of a public consultation into the future of the Old Cottage Hospital buildings at the front of Grantham Hospital on Manthorpe Road.\nI know just how much these historic buildings mean to many in Grantham, so I am pleased that our local NHS leaders have agreed to consult local people on their future.\"\nGet involved with the consultation and make your voice heard via https://www.ulh.nhs.uk/.../have-your-say-and-help-to.../\n(Photo credit: ULHT)",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_column-standing-alongside-our-farmers-supporting-local-charities-and-calling-views-grantham/content_27.html": "With the weather slowly improving, I know many will be looking forward to the spring which is now in touching distance. In our constituency and down in Parliament, it has been a busy couple of weeks, so I wanted to use my column to provide a short update on just some of the key local events.\nJust last week, I was proud to join Lincolnshire farmers and others in their second national protest, with hundreds of tractors again descending on Whitehall outside of the Treasury to send a message to the Government against their Family Farm Tax.\nThis new tax will mean farming families, some who have nurtured their land for centuries, will face large new tax bills when passing their farms to future generations, potentially forcing them to sell their farms and placing our national food security at risk.\nAs I have written here before, this new tax is just one prong of the Government’s attack on farmers and rural areas. I have been in regular contact with our local NFU and others as we work to oppose this and I look forward to meeting with more local farmers, this time from around Bourne, again in the coming weeks.\nAs well as looking after much of our local environment, family farms uphold much of our rural heritage too.\nOur local heritage comes in many forms. Residents in Grantham and all who access services at Grantham Hospital will recognise the abandoned buildings outside of the hospital site along Manthorpe Road. Like so much of our heritage, I know that these buildings, which used to make up the Old Cottage Hospital, mean a lot to many people.\nWhile the buildings are still owned by the NHS, because they are part of our collective heritage, I have always pushed our local NHS leaders to consult local people before they take decisions on their future.\nI'm glad that starting this week, our local NHS Hospital Trust will do just this. Whether you have a bright idea over their future use or just want to share your view on this landmark, I encourage everyone to contribute to the public consultation before it closes at the end of March via the following link:\nFinally, it was excellent to join Roger and the team from the Grantham Rotary Club recently at their 36th Swimarathon, cheering on just a few of the 1,400 local swimmers who have raised £43,000 so far this year alone.\nAs one of the largest single fundraising events in our area and one of the first ‘swimarathons’ in the country, over the last 35 years, they have raised over £1 million in total for local charities and causes.\nSo on behalf of all across our area, thank you to the Rotary Club, the swimmers, and all who donated for supporting another very successful event.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-questions-labours-taxation-british-energy/content_28.html": "I'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-picks-apart-labours-budget-broken-promises/content_55.html": "I'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-gives-speech-importance-investment/content_66.html": "Gareth Davies MP today spoke in the House of Commons on the importance of private investment, following the Government's International Investment Summit held on Monday.\nGareth pointed out that over half of the investments announced had been instigated by the previous Conservative government, but welcomed cross-party collaboration and support for new investments in the British economy.\nAhead of the Budget on October 30th, Gareth urged Labour to turn away for their self-contradictory policies and warned against anti-aspiration tax rises which place investment, jobs, and growth at risk.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-stands-local-lincolnshire-farmers-against-family-farm-tax/content_7.html": "Gareth Davies MP today joined farmers from across the country, including Lincolnshire, and Conservative MPs at a rally on Whitehall to stand against the Labour Government's Family Farm Tax.\nGareth Davies MP today joined farmers from across the country, including Lincolnshire, and Conservative MPs at a rally on Whitehall to stand against the Labour Government's Family Farm Tax.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-opens-debate-budget-responsibility-bill-opposition/content_23.html": "I'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_campaigns/content_33.html": "Support our environment and farming We live in an area of great natural beauty, so it is important that we maintain a clean, safe environment for all of us to enjoy - whether by cleaning our...\nBolster our local infrastructure Whether it is new funding for improved road links, or better broadband, we must ensure our communities are as connected and productive as possible. I will...\nKeep our community safe We all want to feel safe in our homes and on the streets. I fully support Lincolnshire Police to crack down hard on criminals who seek to do us harm. I am proud...\nCampaign for strong local healthcare We all want reliable access to a GP, dental services, and our hospital. From day one I have held local NHS authorities to account to deliver excellent local...\nChampion our local schools and colleges We have some of the best schools in the region. It is vital that we continue to support them to succeed and fund them appropriately. Our children deserve happy...\nBack local businesses Thriving local businesses provide valuable jobs, products, and services for our local communities. I believe enterprise should be rewarded and cultivated, with...",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_contact/content_32.html": "Skip to main content\nMain navigation\nHome\nAbout Gareth\nNews\nMy local priorities\nHelp & Advice\nContact\nLeave this field blank\nParliamentary Office\nHouse of Commons, London, SW1A 0AA\n[email protected]\nConstituency Office\nThe Old National School, 62 North Street, Bourne, PE10 9AJ\nGareth on Facebook\nGareth on Twitter\nGareth on Instagram\nGareth on LinkdIn\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_category_Speeches/content_18.html": "Gareth opens the debate on the Budget Responsibility Bill for the Opposition 30th July 2024 Gareth Davies MP today opened the debate on the Second Reading of the Budget Responsibility Bill on behalf of HM Most Loyal Opposition. Speeches\nGareth discusses the actions being taken to bring down inflation on Bloomberg News 16th August 2023 Gareth Davies MP discusses actions being taken to bring down inflation in his capacity as Exchequer Secretary to the Treasury. This includes holding down energy... Speeches\nGareth asks the Minister for Defence Procurement about good quality food for our Armed Forces 30th January 2023 At Defence Questions today, Gareth Davies MP asked the Minister for Defence Procurement, Alex Chalk MP, about ensuring good quality food for our Armed Forces. Speeches",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news/content_16.html": "Work Experience Day: Apply now Tuesday, 29 April, 2025 I'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting. After much expressed interest locally, I’m excited to provide this opportunity for students to get involved in my work. It will be held here in... Local News\nColumn: Vote to secure Lincolnshire’s future on Thursday 1st May 18th April 2025 Throughout our area, like my family, I know that many of us will be looking forward to spending time with our loved ones in celebration of Easter this weekend... Articles\nGareth meets with farmers from the Grantham area 11th April 2025 Gareth Davies MP this afternoon met with farmers from villages surrounding Grantham and the local branch of the National Farmers' Union (NFU). Gareth meets... Local News\nColumn: Together we can improve the safety and reliability of our local roads 21st March 2025 Our county has a road network of some 5500 miles, one of the largest of any county in England. Because of this, maintaining this network and ensuring safety on... Articles\nGareth welcomes students from Priory Ruskin Academy to Parliament's Education Centre 21st March 2025 This week, Sixth Form students from Priory Ruskin Academy visited Parliament, and I had the opportunity to take part in a Q&A session with them. It's always a... Local News\nGareth supports Marie Curie's Great Daffodil Appeal 2025 10th March 2025 Oh! What's Occurring? It is always wonderful to support Marie Curie’s Daffodil Appeal in Westminster, to celebrate the UK’s leading end of life charity. This... Articles\nColumn: Join me in making the most of World Book Day 7th March 2025 With winter now firmly behind us, I know that many will be looking forward to making the most of the early spring sunshine expected in south Lincolnshire this... Articles\nGareth supports World Book Day 2025 6th March 2025 Happy World Book Day 2025! Reading is one of the biggest indicators of a child’s future success, and it is a wonderful hobby that develops cognitive skills and... Articles\nColumn: Standing alongside our farmers, supporting local charities, and calling for views on Grantham Hospital 21st February 2025 With the weather slowly improving, I know many will be looking forward to the spring which is now in touching distance. In our constituency and down in... Articles\nGareth calls on local residents to share their views on the future of Grantham's Old Cottage Hospital buildings 18th February 2025 Gareth Davies MP is encouraging local residents to contribute to a local NHS public consultation into the future of the Old Cottage Hospital buildings at the... Local News",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_campaigns_support-our-environment-and-farming/content_2.html": "We live in an area of great natural beauty, so it is important that we maintain a clean, safe environment for all of us to enjoy - whether by cleaning our streets, protecting our wildlife, or supporting our farmers.\nIn the last parliament, I helped secure:\n- A share of the £30m Farming Investment Fund for local farmers.\n- An additional £280,000 for local woodlands.\n- £58,000 to tackle air pollution.\n- A visit from the Farming Minister to Grantham for a ‘Farming Summit’ attended by local farmers, the NFU, the Environment Agency, and Lincolnshire Police.\nWe must look after our area for future generations. When our farmers succeed, we all succeed, so I continue to push for better farm funding, protection of the best and most versatile agricultural land, and support for farmers to harness new technology.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-speaks-sanctions-against-russia-support-ukraine/content_56.html": "I'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_cookies/content_13.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-discusses-actions-being-taken-bring-down-inflation-bloomberg-news/content_65.html": "Gareth Davies MP discusses actions being taken to bring down inflation in his capacity as Exchequer Secretary to the Treasury.\nThis includes holding down energy bills, freezing alcohol duty, freezing fuel duties and aligning fiscal policy with the Bank of England.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_column-join-me-making-most-world-book-day/content_44.html": "With winter now firmly behind us, I know that many will be looking forward to making the most of the early spring sunshine expected in south Lincolnshire this weekend.\nOn Thursday of this week, children across Lincolnshire went to school dressed as their favourite book character in celebration of World Book Day 2025. In recent years, this has become a day familiar to many of us, especially to parents who often put so much effort into their children’s costumes.\nReading is one of the biggest indicators of a child’s future success, and it is a wonderful hobby that develops cognitive skills and stretches the imagination. It is why so many parents make sure that whenever they can, whether a bedtime story or exciting non-fiction, they read to and with their children.\nIn recent years under the previous Government, English primary school children have claimed the crown as the best readers in the Western world. This is good news for our children, good news for families and it will be wonderful for our country’s future if this remains the case. I will continue to do what I can to support our excellent local primary and secondary schools as they provide our children with an outstanding and fulfilling education.\nWhile we should be proud of our children for reading so well, there is more we can do to encourage a love of reading beyond school. Today, only 1 in 3 children say they enjoy reading, so outside of the classroom and away from parents, too few choose to pick up a book. World Book Day strives to make reading feel entertaining, so their £1 book vouchers allow children to pick a book of their choice, giving them a sense of agency and empowerment to help make reading fun.\nIn our corner of Lincolnshire to have access to a number of nearby libraries catering for readers of all ages, including that operated by Lincolnshire County Council in Grantham and the South Kesteven Community Point and Library, formerly known as Bourne Library, in Bourne.\nAlongside a number of community hubs, book groups, and projects organised by parish councils and others across our villages, those residents who live in the more rural parts of our community can also benefit through Lincolnshire County Council’s Mobile Library Service. I’d encourage those who may struggle to access library services in our towns to explore this option.\nAs well as acting as centres of learning within our community, our libraries also act as a hub. When I visited Grantham Library, I was excited to learn about their efforts to open up more space to growing local businesses.\nWork led by Lincolnshire County Council at Grantham Library to create a new IT suite equipped with business software, as well as drop-in working zones with acoustic booths for meetings is due to start in the summer. This is an excellent initiative to both drive local economic growth and boost access to our library being championed by a number of our County Councillors.\nSo this weekend, as well as enjoying the early spring sunshine, join me in finding time to open a book and get reading in support of World Book Day.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-discusses-rural-crime-countryside-alliance-and-national-rural-crime-unit/content_71.html": "Gareth Davies MP today met with the Countryside Alliance and National Rural Crime Unit in Parliament to discuss rural crime and their work to protect our villages and farmers. This came ahead of Rural Crime Action Week, which runs next week, from 21st-27th October.\nIn particular, they shared with Gareth the problems the police have returning recovered stolen tools and machinery to their rightful owners due to a lack of identification markings. Gareth also discussed wildlife crimes such as hare coursing, which the local Rural Crime Action Team have had significant success tackling in recent years.\nGareth said:\n\"Ahead of Rural Crime Action Week, it was good to meet with the Countryside Alliance and officers from the National Rural Crime Unit.\nThese crimes are unacceptable, from machinery and tool theft which can devastate local farmers and rural businesses to wildlife crimes such as hare coursing which can wreck agricultural land and harm the local environment we all cherish.\nAlongside the excellent work of the Lincolnshire Rural Crime Action Team, I will continue to do what I can to protect our rural communities.\"",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_column-vote-secure-lincolnshires-future-thursday-1st-may/content_24.html": "Throughout our area, like my family, I know that many of us will be looking forward to spending time with our loved ones in celebration of Easter this weekend.\nThis is a time of year important to Christians across our country and the world. So whether you’ll be attending church, enjoying a Sunday roast, or heading on an Easter egg hunt - I wish everyone a very Happy Easter.\nAfter the festive period, on Thursday 1st May, local elections are taking place right across England, including in Lincolnshire where all seats on Lincolnshire County Council are up for re-election along with the very first Mayor of Greater Lincolnshire.\nCouncils provide so many of the day-to-day services that we all rely on. In our area, we have three levels of local government, with parish and town councils, South Kesteven District Council, and Lincolnshire County Council each responsible for performing set duties and providing different services. Whether on issues such as bin collection, local roads, or planning, powers have been devolved by the national Government with the understanding that local people are better placed to decide upon and deliver local services.\nYet despite their importance, usually fewer than 40% of those eligible and registered to vote in our area make their voice heard in local council elections.\nWe are so fortunate to live somewhere under a well-run, efficient, and effective county council. Under the leadership of Martin Hill, the Conservative-led Lincolnshire County Council (LCC) continues to deliver for local people. I know from working closely with county councillors right across our constituency just how determined they are to work to keep our county strong.\nIn recent years, in the face of unprecedented cost pressures due to the pandemic and inflation driven by geopolitical challenges, Lincolnshire County Council has maintained investment and presented balanced and responsible budgets throughout.\nJust last year alone, LCC filled over 100,000 potholes and will be investing a further £106.6 million into road maintenance this year, underlining the importance of our local road network, under the responsibility of the council, to rural areas such as ours. Our County Council is also increasing investment into flood defences, investing into our children’s education, and continuing to support those who rely on social care throughout the county.\nIn contrast, right now on our televisions and in newspapers, we see the opposite - a real-life example of just what a badly-run council means for residents. Just look at Birmingham where the Labour-led Birmingham City Council had to declare effective bankruptcy and is now overseeing bin bags piling high on streets and rats running rampant throughout England’s second city.\nThis is not what any of us want to see in our county. So on Thursday 1st May, get out and make your voice heard to secure Lincolnshire’s future.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_category_Opinions/content_8.html": "Labour's inheritance is no 'financial Dunkirk' 30th July 2024 When Keir Starmer bills himself as a Clement Attlee Mark II, the comparison works on some levels. Both were lawyers of bourgeois background, born in Sussex, and... Opinions\nOp-Ed: We need to build up Britain’s piggy bank and help young workers saving for the future 15th March 2022 Ten years ago, a government policy came into law that would go on to financially benefit over 10 million people in the UK, giving them a greater stake in our... Opinions\nOp-Ed: As Britain vies to join the key Asia trade bloc, it must stand up for Taiwan against China 10th March 2022 Last year, Xi Jinping celebrated the centenary of the Chinese Communist Party with a stark warning: “We must take resolute action to utterly defeat any attempt... Opinions",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_statement-death-hrh-prince-philip-duke-edinburgh/content_43.html": "It is with great sadness that I heard the news of the death of HRH Prince Philip, the Duke of Edinburgh. My first thoughts are with Her Majesty The Queen, to whom I have written to extend my condolences on the loss of her husband. I know this sorrow is shared by countless others across the Grantham and Stamford constituency, Lincolnshire, the United Kingdom, and the Commonwealth.\nPrince Philip’s life was marked by 70 years of tireless public service, including fighting for Britain’s freedoms in the Second World War. We are forever grateful for his work to benefit the lives of young people, marked by the Duke of Edinburgh Awards scheme among the many charities and voluntary organisations in which he was involved. We can all learn from his devotion, fortitude, and sense of duty.\nHere in Grantham and Stamford constituency, we have been fortunate to receive visits by Prince Philip to our three main towns. His contribution to the history of Stamford came in 1961 when he and Her Majesty the Queen celebrated the quincentenary of the town by hosting a gala at Burghley House. We were fortunate to welcome Prince Philip to Grantham in 1973 to inspect local schools’ Duke of Edinburgh participants, and in 2013 we received him in Bourne where he opened the Turing Centre at Bourne Grammar School.\nAbove all else, the Duke was a constant support and trusted counsellor to Her Majesty the Queen as well as a much-loved father, grandfather, and great-grandfather. The whole Royal Family is in our thoughts today as we mourn with them.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-celebrates-local-farmers-back-british-farming-day-0/content_63.html": "I'm excited to announce the launch of my first Work Experience Day, now open for student applications. Work experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_work-experience-day-apply-now/content_5.html": "I'm excited to announce the launch of my first Work Experience Day, now open for student applications.\nWork experience is a valuable opportunity for students to explore potential careers, build practical skills and gain confidence in a real world setting. After much expressed interest locally, I’m excited to provide this opportunity for students to get involved in my work.\nIt will be held here in Grantham and Bourne, giving you the chance to take part in research, presentations, and local engagement. I will be selecting four students for the day, so places are limited and selection will be competitive.\nThe work experience will take place on Friday 11th July. To apply, you must be a school student aged between 15 and 18 and reside within the Parliamentary constituency of Grantham and Bourne.\nDue to the high demand for work experience opportunities, we aim to ensure a fair selection process, similar to a workplace interview. Therefore, interested students will need to submit a 250-word summary about themselves, addressing the following points:\n- What are your future plans, and where do you see yourself in 5 years time?\n- How could this work experience assist you with these future plans?\n- Describe your interest in politics, and highlight if there are any specific policy areas\nPlease email the summary in an attached form along with a copy of your CV to [email protected] before the 31st May.\nIf we are unable to accommodate you at this time, I hope there will be opportunities available at a later date.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-takes-chancellor-task-her-broken-promises/content_42.html": "Gareth Davies MP today pressed the Chancellor of the Exchequer, Rachel Reeves MP, over the recent fall in business confidence at Treasury Oral Parliamentary Questions.\nGareth Davies MP today pressed the Chancellor of the Exchequer, Rachel Reeves MP, over the recent fall in business confidence at Treasury Oral Parliamentary Questions.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_cdn-cgi_l_email-protection/content_40.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_category_Speeches-in-Parliament/content_17.html": "Gareth questions Labour's energy policies 21st January 2025 At HM Treasury Oral Parliamentary Questions today, Gareth Davies MP asked the Government whether their energy policies will reduce bills, and whether Labour... Speeches in Parliament\nGareth speaks on sanctions against Russia in support of Ukraine 6th January 2025 Contribution by Gareth Davies (Grantham and Bourne) (Con) https://hansard.parliament.uk/Commons... Speeches in Parliament\nGareth presses Labour on the impact of their NICs tax hike 17th December 2024 National Insurance Bill - Committee of the Whole House - Contribution by Gareth Davies (Grantham and Bourne) (Con) https://hansard.parliament.uk/Commons... Speeches in Parliament\nGareth challenges Labour on business and investment taxes 10th December 2024 Contribution by Gareth Davies (Grantham and Bourne) (Con) https://hansard.parliament.uk/Commons... Speeches in Parliament\nGareth questions Labour's taxation of British energy 10th December 2024 Gareth Davies MP today questions Labour's taxation of British energy. Speeches in Parliament\nGareth picks apart Labour's Budget of Broken Promises 31st October 2024 Gareth Davies MP this afternoon concluded the first full day of debate on the Government's Budget. Speeches in Parliament\nGareth takes the Chancellor to task for her broken promises 29th October 2024 Gareth Davies MP today pressed the Chancellor of the Exchequer, Rachel Reeves MP, over the recent fall in business confidence at Treasury Oral Parliamentary... Speeches in Parliament\nGareth questions the Government's decision to fiddle the fiscal rules 28th October 2024 Gareth Davies MP today questioned the Government's decision to alter the fiscal rules, despite their manifesto commitment not to do so. Speeches in Parliament\nGareth stands up for local pubs in Parliament 22nd October 2024 Gareth Davies MP today spoke at a debate in Parliament's Westminster Hall on support for the hospitality and pub sector ahead of the Budget on 30th October. Speeches in Parliament",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_accessibility/content_31.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-supports-grantham-rotary-clubs-2025-swimarathon/content_47.html": "Gareth Davies MP today joined the excellent team from Grantham Rotary Club at the first day of this year's Swimarathon to show his support.\nGareth said:\n\"It was excellent to join Roger and the team from Rotary Club of Grantham recently at their 36th Swimarathon, cheering on just a few of the 1,400 local swimmers who have raised £43,000 so far this year alone.\nOver the last 35 years, they have raised over £1 million in total for local charities and causes.\"\nIf you are able, please do consider donating to show your support: https://www.justgiving.com/campaign/rotaryswimarathon-2025",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_gareth-welcomes-students-priory-ruskin-academy-parliaments-education-centre/content_19.html": "This week, Sixth Form students from Priory Ruskin Academy visited Parliament, and I had the opportunity to take part in a Q&A session with them.\nIt's always a pleasure when local schools come to Parliament, giving students the chance to learn about how Parliament functions and take a tour of the Palace of Westminster. The students from Priory Ruskin were full of insightful questions about my role as an MP and the workings of Local Government.\nSchool visits provide a fantastic opportunity to educate young people about the history and processes of democracy. The Education Centre at Parliament offers free tours and educational sessions for school children of all ages, and I highly encourage teachers to sign their schools up for a visit.\nTo stay updated on what the Education Centre has to offer, teachers can sign up for their newsletter here: https://parliament.us14.list-manage.com/subscribe?u=098af33234df9814f59fb205f&id=94468a173d",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_category_Articles/content_20.html": "Column: Vote to secure Lincolnshire’s future on Thursday 1st May 18th April 2025 Throughout our area, like my family, I know that many of us will be looking forward to spending time with our loved ones in celebration of Easter this weekend... Articles\nColumn: Together we can improve the safety and reliability of our local roads 21st March 2025 Our county has a road network of some 5500 miles, one of the largest of any county in England. Because of this, maintaining this network and ensuring safety on... Articles\nGareth supports Marie Curie's Great Daffodil Appeal 2025 10th March 2025 Oh! What's Occurring? It is always wonderful to support Marie Curie’s Daffodil Appeal in Westminster, to celebrate the UK’s leading end of life charity. This... Articles\nColumn: Join me in making the most of World Book Day 7th March 2025 With winter now firmly behind us, I know that many will be looking forward to making the most of the early spring sunshine expected in south Lincolnshire this... Articles\nGareth supports World Book Day 2025 6th March 2025 Happy World Book Day 2025! Reading is one of the biggest indicators of a child’s future success, and it is a wonderful hobby that develops cognitive skills and... Articles\nColumn: Standing alongside our farmers, supporting local charities, and calling for views on Grantham Hospital 21st February 2025 With the weather slowly improving, I know many will be looking forward to the spring which is now in touching distance. In our constituency and down in... Articles\nColumn: Our churches preserve our heritage, they deserve our support 7th February 2025 Our churches have been at the centre of our community for hundreds of years. First and foremost, they provide a place for Christians in our corner of... Articles\nColumn: Our local hospitality businesses need our support to overcome challenges 24th January 2025 January can feel like a long month, a month where we all settle back into routine. However, I know some families and local businesses are still recovering from... Articles\nColumn: The thoughts of all in our area are with those affected by recent flooding 10th January 2025 As we all settle back into our daily routines following the Christmas period, I want to wish all in our area a happy New Year and all the very best for the year... Articles",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_column-our-churches-preserve-our-heritage-they-deserve-our-support/content_58.html": "Our churches have been at the centre of our community for hundreds of years. First and foremost, they provide a place for Christians in our corner of Lincolnshire to come together in prayer. They are also a welcoming place where our whole community can come together in times of sorrow, but also celebration.\nThanks to the dedication of generations of local clergy, churchwardens and congregations, so many of our historic local churches continue to be maintained. However, at a national scale, despite these efforts, the National Churches Trust estimates that the Church of England alone has a backlog of repairs estimated at over £1 billion, with an annual repair bill at £150 million.\nWe must not allow our churches, so often the guardians of our heritage, to fall into damage and disrepair. That is why I have always been keen to support the efforts of our local churches wherever I can.\nThe previous Government provided up to £42 million per year of direct financial support for places of worship towards repairing roofs, masonry and items such as turret clocks, pews, bells and pipe organs. Through the Listed Places of Worship Scheme (LPWS) grants are provided covering the VAT on repairs of over £1,000 to listed buildings used as places of worship.\nOver the years, so many churches of all sizes in our area especially have benefitted from this funding. These include almost £12,000 for St Mary’s Church in Marston, over £45,000 for St James the Great Church in Aslackby, and more than £2,500 for Bourne Methodist Church.\nThe largest and most famous church in our area, St Wulfram’s Church in Grantham, has benefitted from this scheme by over £15,000 since 2022, supporting the preservation of this architectural treasure so it can continue to be used by future generations.\nHowever, this vital funding for our churches is now under threat. Following months of uncertainty, I was very frustrated last month that the Labour Government quietly announced their decision to implement a new Worship Tax, slashing the Listed Places of Worship Scheme’s annual funding by £19 million and introducing a cap on the amount individual places of worship can claim.\nAccording to Historic England, almost 1,000 places of worship across the country remain at risk from neglect, decay or inappropriate development. Sadly, despite significant ongoing efforts by local residents, clergy, and churchwardens, a number of churches in our area are on this list.\nI visited one of these churches, St James’ Church in Woolsthorpe, just last week to meet the local vicar who does such excellent work to maintain this church and others nearby. She and others like her across Lincolnshire very much deserve our support.\nThis decision by the Government threatens so much of our local and national heritage. This cannot be allowed to happen, so I will continue to do what I can to call on the Government to think again.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_column-its-never-too-late-go-back-school/content_73.html": "Yesterday, I am pleased to write that the first stage of the Prime Minister’s plan for living with Covid came into force as all remaining domestic Covid-19 restrictions in England were removed. Thanks to the success of our vaccine rollout, we are now able to bring our response to Covid-19 in line with other viruses and allow people to return to normal life. The Government remains ready to respond to the emergence of new variants through measures such as increased testing capacity or vaccines. Further protections are to be given to all adults over 75, residents in care homes, and immunosuppressed over 12s through an additional booster, ensuring that most vulnerable in society remain fortified against the virus.\nNational plans for improving further education have also been debated in Parliament through the Skills and Post-16 Education Bill this week. This legislation includes important proposals for local skills improvement plans. These plans would support collaboration between employers and education providers, to ensure that the education and training in our local schools is tailored to meet the needs of our local businesses. No matter what stage of life you are at, these plans will ensure that everybody is able to access a Lifelong Loan to support the development of new skills through four years of education over the age of 18 which can be used across your lifetime. This flexibility will provide broader options beyond a full-time three-year degree to show that it’s never too late to go back to school.\nI was delighted to welcome the Minister for Culture, Nigel Huddleston MP to Grantham last week to see how the significant Government funding the town has received throughout the pandemic has been used. This includes £230,000 from the Culture Recovery Fund for the Guildhall, where we met with the Mayor and heard more about the thriving programme of events and exhibitions that the grant has helped to secure. The Minister was especially impressed by the magnificence of St Wulfram’s Church and enjoyed hearing about the various events that take place there including the upcoming presentation of the 1,300 year old skull of St Wulfram from the Abbey of St Wandrille in France.\nAfter the recent inclement weather, we have yet again seen more accidents and closures along the A1. I am keen that everybody shares their views with me about their experiences of using the road to help inform my ongoing campaign for improvements to the safety measures along the stretch between Grantham and Stamford. Over the next few months I will seeking local views directly so that I can relay these to National Highways, the independent body responsible for our strategic roads.\nI and a number of local residents are continuing to follow the planning process for the Mallard Pass Solar Farm and have surveyed the recently published scoping report which describes the process that will be undertaken to assess how the project will affect the local environment. Mallard Pass is just one of a number of solar farms which are currently being planned across Lincolnshire, both as locally-decided planning applications and nationally significant infrastructure projects.\nThis week, I asked Greg Hands MP, Minister for Energy to ensure that a national plan is put in place for solar developments which ensures that Lincolnshire is not dominated by a series of uncoordinated solar developments which threaten to take up agricultural land and disrupt local ecologies. Ultimately it is the independent Planning Inspectorate who advises the Government on national projects such as Mallard Pass, but I was pleased to put on public record the concerns many local people feel about the scale of the proposals being put forward.\nFinally, and further afield, it is deeply regrettable that we are now seeing Russian tanks and troops entering the Ukraine, in an act of aggression without justification and in violation of international law. We will rightly now be imposing tough economic sanctions which will hurt Russia’s economic interests to ensure that Putin and his regime are punished. The situation remains fluid, but it remains my hope that a peaceful resolution can ultimately be found.",
  "https_www_garethdavies_co_uk_/https_www_garethdavies_co_uk_news_category_Holyrood-News/content_15.html": "Gareth celebrates Armed Forces Week 21st June 2021 Gareth Davies MP today joined the Mayor of Grantham, SKDC Chairman and local military representatives to mark Armed Forces Week in honour of all those who serve... Holyrood News"
}