{
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_chris-coghlan-on-lbc-talking-about-send/content_15.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_page-2/content_12.html": "\"As your Member of Parliament, I am committed to addressing the ongoing challenges that our community faces, challenges that have only intensified in recent years. Many in Dorking are struggling to make ends meet, with rising costs making it difficult to feed their families and pay their bills. Access to healthcare is a significant concern, with too many unable to secure timely appointments with their GPs.\nThe impact of economic instability is felt by local businesses, many of which are fighting to survive amidst the cost of living crisis. I believe passionately that we can forge a better path forward. This area is my home—where I grew up, where I live, and where my children attend school. My wife and I are deeply invested in ensuring a bright future for our three daughters. We want them to have access to good jobs, affordable housing, and a reliable NHS that will care for them. We also want to protect our beautiful countryside for future generations.\nMy journey has taken me from the bustling finance sector to serving in the British Army, where I fought against terrorism in Iraq. After meeting atrocity survivors living in extreme poverty in Mozambique, I co-founded the charity Grow Movement, which provides business learning and support to entrepreneurs and businesses around the world. Now, I am dedicated to championing the change our community needs\nI believe in a liberal economy that prioritises personal freedom and social justice. We deserve better than a government whose decisions have led to such significant financial and social damage. For too long, this area has been represented by Conservative MPs who seem to take your vote for granted. The Liberal Democrats are ready to lead that change, and I am here to ensure your voice is heard in Westminster.\"",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_privacy-policy-chris-coghlan-mp/content_25.html": "Privacy Policy\nChris Coghlan MP is committed to respecting and protecting your personal data. This policy explains who Chris Coghlan MP is, what personal (“Data”) he collects, how data is used, information on your rights, and how you can contact him. The way Chris Coghlan MP is able to process personal data is governed by the UK General Data Protection Regulations (UK GDPR) and Data Protection Act (DPA) 2018.\nWho is collecting your data\nChris Coghlan MP is the Member of Parliament for Dorking and Horley Constituency. For the purposes of UK data protection law, Chris Coghlan MP is the Data Controller for all personal data sent to him by constituents as the Member of Parliament for Dorking and Horley. As an MP, office staff will also have access to your personal data in order to keep the office running. Within this policy, any reference to Chris Coghlan MP refers to the MP and also the staff employed by the MP.\nFrom April 01 2019 elected representatives and prospective representatives (including police and crime commissioners) are exempt from paying a fee and registering with the Information Commissioner’s Office (ICO). For more information on this visit: Elected representatives and political parties | ICO\nHow is your data collected, used and stored\nWhen you contact Chris Coghlan MP seeking assistance with a casework issue or to ask a question about local or national policy issues, you will be asked for some personal data to enable Chris Coghlan MP and his office to respond.\nChris Coghlan MP will only use your data for the purposes for which you provide it.\nChris Coghlan MP takes the security of your data extremely seriously. Your data will be stored on secure servers in a locked and protected environment. Access to your personal data will be limited to Chris Coghlan MP and his staff for the purpose of dealing with your query/case and maintaining office records.\nCategories of personal data collected\nPersonal data collected may include:\n- Full name/s\n- Postal Address\n- Email Address\n- Phone Number\n- Correspondence related to your case/query/issue/question\nWho will your data be shared with\nWhen taking up casework or policy questions on your behalf, it may be necessary for Chris Coghlan MP and his office to share the personal data you provide with government departments, local authorities and other public bodies. Chris Coghlan MP will only share as much information as necessary to take your case forward.\nOther than in the circumstances above, Chris Coghlan MP will not share your personal data with other organisations or individuals without your explicit consent.\nHow long will your data be kept\nChris Coghlan MP and his office will only keep your personal information for as long as it is necessary to fulfil the purpose described in this policy. Chris Coghlan MP and his office will retain your casework data for up to five years after your case has been closed, in case you get in touch again.\nThe lawful basis for processing data\nUnder UK GDPR personal data can only be processed using a lawful basis defined in Article 6.\nChris Coghlan MP will process your data using the lawful basis of Consent (Article 6 (a)) and Public Task (Article 6(e)). Your data will be retained under the legal basis of Legitimate Interests (Article 6(f)) for the purpose of managing constituents’ casework and policy concerns effectively.\nSpecial category data\nIt may be the case that you disclose personal data classified as special category data under UK GDPR as part of your casework or policy concern. This may include information related to health, sexuality, race, ethnicity and religion.\nElected representatives are permitted to process this data under clauses 23 and 24 of Schedule 1 of the Data Protection Act 2018. Under UK GDPR this data can only be processed using a lawful basis under Article 6 and a condition of processing defined in Article 9. Chris Coghlan MP will process such data under Article 6(a) (Consent) and Article 9(a) (Explicit consent).\nYour rights\nYou have several rights in relation to your data and can choose how it is used. You can:\n- Obtain copies of the data we hold about you (known as a “Subject Access Request or SAR”)\n- Request that we correct or update any data held about you\n- Withdraw your consent and ask that we delete your data or restrict the ways in which we use your data (known as a “Right to be Forgotten” or “Right to Erasure”)\n- Request that data you have given your consent for us to use is provided an electronic format so it can be transferred to another data controller (know as “data portability”)\n- Opt-out receiving further communications from us via any medium at any time.\nYou also have the right to make a complaint directly to the Information Commissioner’s Office. They can be contacted at : Contact us | ICO, and concerns can also be logged via: Make a complaint | ICO\nContact us\nIf you have any questions about this policy or wish to exercise any of your data rights, please contact your data protection representative by emailing chris.coghlan.mp@parliament.uk. Or post to 32 Bentsbrook Park, North Holmwood, Dorking, RH5 4JN\nor\nChris Coghlan MP has appointed a member of staff who is responsible for overseeing the data protection standards within his office. If you have any queries regarding this Policy or you wish to exercise any of your rights set out above, please contact: bradley.nelson@parliament.uk. Or post to 32 Bentsbrook Park, North Holmwood, Dorking, RH5 4JN.\nChanges to our Privacy Policy\nWe keep our privacy policy under regular review and as such it may be updated from time to time so you should check it each time you submit personal information to us. The date of the most recent revisions will appear on this page. If you do not agree to these changes, please do not continue to use this website to submit personal information to us:\nLast updated: 19/09/2024",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_chris-coghlan-contact/content_2.html": "Contact Chris\nChris and the team are working for you all year round, not just at election times.\nContact Details\n✉️ Chris Coghlan MP, House of Commons, London SW1A 0AA\n💻 chris.coghlan.mp@parliament.uk\n🖥️ facebook.com/ChrisCoghlanDorkingandHorley/\nBook an advice surgery appointment\nCurrently Chris offers eight advice surgery slots a week on Monday (3-4pm) and Tuesday (1-2pm) afternoons. Outside of these times, you can arrange a virtual surgery with one of Chris's team, either by phone or online.\nBecause of the current high demand to meet Chris, appointments will need to be booked in advance. Please email to make an appointment.\nConstituents are requested to provide their full name, address and contact details on all communications.\nEmail: chris.coghlan.mp@parliament.uk\nPlease include your full name, address and contact details as this will help speed up a response.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_update-on-the-repair-works-in-dorkings-west-street/content_19.html": "Update on the repair works in Dorking's West Street\nUpdate on Sep 20th:\nMoved end date: Most recent update is that the assumed finish date has moved from end of the month to mid-November.\nComplications and reason for delay:\n- Thames Water (TW) team found that SES water needed to fix a leak, which has since been completed. The TW repair team now need to replace a longer section of pipe having discovered more defects.\n- They need to break the ground by hand to ensure safety and that service lines aren’t damaged.\nThey are looking to secure permits from Surrey County Council Highways for longer working hours to complete the work faster.\nNorth Street: after trying to keep it open it was clear it was too much of a risk for residents as the street is too narrow.\nJunction Road: can’t be opened as the closest manhole available is there and they are using this as a temporary overland sewer to not impact services.\nBusinesses: there will be compensation for businesses after the fact. A letter has been sent to businesses with this message attached.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_chris-coghlan-calls-for-intervention-scc/content_9.html": "Chris Coghlan MP calls for the Education Secretary to directly intervene in Surrey County Council\nI have written with Lib Dem MPs in Surrey to the Department for Education, stating how we have lost confidence in Surrey County Council and it's ability to deliver SEND services. We request the Secretary of State intervenes immediately\nRe: Child protection, SEND and governance crisis at Surrey County Council\nDear Secretary of State,\nFurther to our meeting with you on 29th January we are writing to express our grave concerns about the performance and governance of the Children, Families and Lifelong Learning Department (CFLL) at Surrey County Council, specifically:\nPerformance:\n1. Sara Sharif: as reported in the national media, there were fifteen missed opportunities by public authorities including CFLL over ten years to save her from murder by her father and stepmother. On 15th December 2024 the Executive Director of CFLL Rachell Wardell OBE stated; “the perpetrators went to extreme lengths to conceal the truth from everyone”. From what we know so far, we reject the narrative that Sara and her family were ‘unknown’ or ‘lost’ to the system - published details of the circumstances of this family evidence that this is demonstrably untrue. It appears that immediate intervention is warranted, such as that necessitated in other incidences of serious institutional failure, to ensure no further children remain at risk. A Local Safeguarding Review alone is wholly insufficient;\n2. Jennifer Chalkley: Last year the Coroner found that the death by suicide of 17 year old autistic Jennifer Chalkley in 2021 was avoidable. The report details 81 pages of mistakes by multiple local agencies including CFLL and CAMHS;\n3. Oskar Nash: The Coroner found that the death by suicide of 14 year old autistic Oskar Nash in 2020 was avoidable. The report details gross failures and significant missed opportunities by Surrey authorities involved in the care of Oskar Nash including CFLL. The parallels between these tragic and entirely preventable deaths, and the ongoing testimonies of our constituents, make it evident that lessons have not been learned;\n4. 1,809 Surrey children were out of school with special educational needs and disabilities SEND for over a third of the time in 2023/24, with devasting consequences for their life chances. Furthermore, our constituents tell us that many of these same children are being denied any alternative education by Surrey County Council, in clear breach of their duties under Section 19 of the Education Act 1996. The scale of this local failure is so severe that the Local Government and Social Care Ombudsman (LGSCO) required SCC to submit an action plan to prevent further breaches. Yet, testimony from our constituents makes it clear that poor practices continue, putting thousands of vulnerable children’s futures at risk.\n5. Surrey County Council has had more breaches of statutory responsibilities relating to SEND children raised to the Local Government and Social Care Ombudsman (LGSO) than any other in the country for more than two years. To illustrate the scale: in just one week of November 2024, the LGSCO ruled against Surrey County Council seven times for breaching their Section 19 obligations as outlined above. It is our concern that these are not isolated incidents - they appear to represent a systemic pattern of failures that continue unabated despite repeated warnings.\nHeadteacher after headteacher has testified to us about the appalling state of SEND provision from CFLL, including not replying to emails from headteachers for up to three months, let alone parents, and that the lack of appropriate specialist SEND provision, and the denial of sufficient SEND support is disrupting the education of children in state education across Surrey.\nGovernance:\n1. Surrey County Council did not disclose to its Council Scrutiny Committees for over 14 months that it had more breaches of statutory responsibilities relating to SEND children raised to the Local Government and Social Care Ombudsman (LGSO) than any other in the country (Appendix 1). In scrutiny reports, instead of disclosing that Surrey had exponentially more SEND-related complaints escalated to the Local Government and Social Care Ombudsman (LGSCO) than the national average, SCC omitted any information about the volume of their complaints as compared to other authorities. The true scale of their outlier performance was only disclosed after the six Surrey Liberal Democrat MPs publicly called them out (Appendix 2).\n2. County Council Leader Tim Oliver OBE repeatedly claimed in writing to Surrey Liberal Democrat MPs that the council had in fact disclosed their complaint volumes compared against other local authorities during this 14-month period (Appendix 3). Yet, when challenged to show exactly which paragraph disclosed this, he claimed it was disclosed in a paragraph which actually contained no information about volumes. This is self-evidently miss-leading.\n3. Appearing to reclassify complaints as “enquiries”: Surrey County Council claims that complaints performance has improved in the current year (Appendix 5). However, we have seen evidence that instead, SCC has been reclassifying formal complaints as “enquiries” (Appendix 3 contains four example emails demonstrating this), and worse – suggesting that if a resident persists with a complaint, this may delay their response.\n4. Rising Appeals to SENDIST – Unlike complaints data, Registered SEND Tribunal (SENDIST) appeal volumes cannot be internally manipulated. The latest figures show that appeals by families against Surrey County Council’s SEND decisions have risen by nearly 60% year-on-year, indicating that the performance of this department continues to catastrophically deteriorate. This also indicates that improvements in EHCP timeliness are at the expense of the quality of EHCPs issued, and also, consequently, decisions made about provision requirements and placements. Families5. and headteachers alike have testified to us of EHCPs which are unfit for purpose- sometimes with the wrong child’s names, clearly copied and pasted from other EHCPs and behavioural characteristics unrelated to the child nominally referred to by the EHCP. Worse, decisions about provision increasingly appear to bear little relation to the evidence gathered from specialists during assessments leading to significant increases in appeals being registered and leaving children with wholly insufficient provision in the interim.\n5. A leadership culture contemptuous of families in crisis: In a meeting which all Surrey MPs were invited to on 27th September 2024 County Council Chief Executive Terrence Herbert stated that “Surrey does not have a particular problem with SEND, the issue is that Surrey parents are particularly articulate. ” Deputy Leader Member for Children’s Services, Cllr. Maureen Attewell stated in a Cabinet meeting on 28th January 2025 that Surrey County Council should “… guard, actually guard against hearing only from more articulate parents, often with loud voices, or access to additional resources such as expensive legal representation.” The choice of language by both executive and elected leaders of the current administration of Surrey County Council implies a deeply troubling attitude—that the exceptional scale of catastrophic failure, complaints, legal challenges, and Ombudsman rulings by the CFLL Directorate in Surrey is not the result of systemic local failure, but rather the consequence of parents being 'too articulate’. It is in galling contrast to the lived experienced of hundreds of children and families in crisis detailed in points 2-5 in the performance section above.\nGiven the above, we have lost confidence in the leadership of Surrey County Council and its care of children.\nWe have constituent children right now whose lives are at risk, including one 16 year old SEND child who has been hospitalised for 12 suicide attempts and whose desperate mother has had to take Surrey County Council to tribunal ten times to fight for the support that her children are legally entitled to. Yet we understand that in her case, Surrey County Council has still persisted in obstructing her access to essential provision for over two years.\nWe request that the Secretary of State now directly intervenes with whatever measures necessary to prevent the risk of any further harm to the children, young people and families of Surrey.\nRegards,\nChris Coghlan MP - Dorking and Horley\nZoe Franklin MP - Guildford\nAl Pinkerton MP - Surrey Heath\nWill Forster MP - Woking\nMonica Harding MP - Esher and Walton\nHelen Maguire - Epsom and Ewell",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_donate/content_11.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_chris-on-bbc-politics-south-east/content_17.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_chris-calls-for-humility-from-all-political-parties/content_3.html": "Chris calls for humility from all political parties\nChris called for humility from all political parties for their records on defence on BBC Radio 4 this morning. The Coalition cut defence spending. Some soldiers died unnecessarily in Iraq and Afghanistan under the last Labour government due to atrocious equipment at the outset, including possibly one of his friends. We live in a different world with a Great Power attacking Europe and need a path to increase defence spending to 2.5%.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_chris-coghlan-email/content_13.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org/content_1.html": "Changing the Mental Capacity Act 2005\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nI am honoured that last year my Maiden speech in Parliament was nominated for Speech of the Year by Parliament News alongside 5 other MPs.\nIn it, I shared Christopher Laskaris’s tragic story—a young man with autism who was murdered. Together with his mother Fiona, Jake Richards MP (Labour) and Jeremy Hunt MP (Conservative). I’m working to improve the law to try and stop this happening again.\nChristopher grew up in my childhood home, Jake was the barrister at his inquest and Jeremy is Fiona’s MP.\n\"As your Member of Parliament, I am committed to addressing the ongoing challenges that our community faces, challenges that have only intensified in recent years. Many in Dorking are struggling to make ends meet, with rising costs making it difficult to feed their families and pay their bills. Access to healthcare is a significant concern, with too many unable to secure timely appointments with their GPs.\nThe impact of economic instability is felt by local businesses, many of which are fighting to survive amidst the cost of living crisis. I believe passionately that we can forge a better path forward. This area is my home—where I grew up, where I live, and where my children attend school. My wife and I are deeply invested in ensuring a bright future for our three daughters. We want them to have access to good jobs, affordable housing, and a reliable NHS that will care for them. We also want to protect our beautiful countryside for future generations.\nMy journey has taken me from the bustling finance sector to serving in the British Army, where I fought against terrorism in Iraq. After meeting atrocity survivors living in extreme poverty in Mozambique, I co-founded the charity Grow Movement, which provides business learning and support to entrepreneurs and businesses around the world. Now, I am dedicated to championing the change our community needs\nI believe in a liberal economy that prioritises personal freedom and social justice. We deserve better than a government whose decisions have led to such significant financial and social damage. For too long, this area has been represented by Conservative MPs who seem to take your vote for granted. The Liberal Democrats are ready to lead that change, and I am here to ensure your voice is heard in Westminster.\"\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nI have written with Lib Dem MPs in Surrey to the Department for Education, stating how we have lost confidence in Surrey County Council and it's ability to deliver SEND services. We request the Secretary of State intervenes immediately.\nToday Chris was on Heart Radio discussing how the delay of elections means Surrey County Council won't be held to account for their failings\nChris was on BBC Politics South East at the weekend",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_chris-on-itv-news/content_20.html": "Chris on ITV News\nIn his maiden speech to Parliament, Chris called for justice for our special needs children. Last night he was on national ITV news with families giving witness to the terrible cost when their children are denied their legal right to an education. Conservative Surrey County Council has the highest number of complaints in the country.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_chris-is-the-media/content_8.html": "Changing the Mental Capacity Act 2005\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nI have written with Lib Dem MPs in Surrey to the Department for Education, stating how we have lost confidence in Surrey County Council and it's ability to deliver SEND services. We request the Secretary of State intervenes immediately.\nToday Chris was on Heart Radio discussing how the delay of elections means Surrey County Council won't be held to account for their failings\nChris was on BBC Politics South East at the weekend",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_search/content_14.html": "Changing the Mental Capacity Act 2005\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nPrivacy Policy Chris Coghlan MP is committed to respecting and protecting your personal data. This policy explains who Chris Coghlan MP is, what personal (“Data”) he collects, how data is used,…\nI have written with Lib Dem MPs in Surrey to the Department for Education, stating how we have lost confidence in Surrey County Council and it's ability to deliver SEND services. We request the…\nToday Chris was on Heart Radio discussing how the delay of elections means Surrey County Council won't be held to account for their failings\nThe delays to the new Betchwood Vale Academy special educational needs school in Dorking are unacceptable. Chris met with the Schools' Minster Catherine McKinnell last week urging them to…\nChris called for humility from all political parties for their records on defence on BBC Radio 4 this morning. The Coalition cut defence spending. Some soldiers died unnecessarily in Iraq and…\nChris Coghlan My Maiden Speech My Maiden Speech I am honoured that last year my Maiden speech in Parliament was nominated for Speech of the Year by Parliament News alongside 5 other MPs. In…\nContact Chris Contact Details ✉️ Chris Coghlan MP, House of Commons, London SW1A 0AA 💻 chris.coghlan.mp@parliament.uk 📱twitter.com/_Chris_Coghlan 🖥️…",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_sinkhole-in-dorkings-west-street/content_24.html": "Sinkhole in Dorking's West Street\nChris Coghlan, MP for Dorking & Horley, and Hazel Watson, County Councillor, visited the site of the sinkhole in Dorking’s West Street, and are keeping up the pressure on Thames Water to fix the issue.\nThe sink hole appeared in West Street, Dorking last Friday night and the County Council swiftly closed the road to prevent accidents. They have investigated the sink hole and had engineers from both Thames Water and SES Water on site, and have determined that the sink hole has resulted from a failure of a surface water line relating to Thames Water. The investigation has shown that the problem is not just where the sink hole has appeared but also stretches around 50m along West Street towards Pump Corner.\nSurrey Highways contractors [Ringway] are to hand over the site to Thames Water. The County Council does not as yet have a date for Thames Water to carry out the repair works. It is our understanding that the repair is a major piece of work, that Thames Water senior management will have to approve the costs of the repair, and that the overall repair and road reinstatement project will take some time to complete.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_chris-coghlan-welcomes-halt-to-horse-hill-drilling/content_21.html": "Chris Coghlan Welcomes halt to Horse Hill Drilling\nChris Coghlan, Liberal Democrat MP for Dorking & Horley, has welcomed the news that UK Oil & Gas (UKOG) has suspended production at the Horse Hill oil site. This halt comes four months after the Supreme Court denied the company’s planning permission, thanks largely to persistent campaigning by local residents and community groups as well as pressure from Chris himself.\nHowever, the situation raises concerns about Surrey County Council's role in permitting the oil production to continue. Chris questioned the council's actions, emphasising that even after the Supreme Court’s ruling, the Council allowed drilling to go on, leaving residents to fill the gap in holding UKOG accountable. Troublingly, as recently as 16 October, Surrey Council representatives were seen visiting the Horse Hill site, engaging with UKOG representatives, and seemingly allowing operations to proceed.\nChris commended the dedication of community activists and the media, who played a vital role in questioning the legitimacy of ongoing drilling. \"Their unwavering efforts helped protect our countryside from further exploitation,\" he stated.\nTo watch Chris call on UKOG to halt the drilling on channel 4, the day before they finally did, please watch here:\nwww.channel4.com/news/oil-well-still-pumping-after-uk-supreme-court-ruled-plans-unlawful",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_page-1/content_23.html": "Changing the Mental Capacity Act 2005\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nIn a difficult speech today, Chris called for immediate reform of Surrey County Council's Children, Families, and Lifelong Learning department following its catastrophic and systemic negligence in the tragic deaths of 3 Surrey children\nChris was on BBC Politics South East at the weekend\nToday Chris was on Heart Radio discussing how the delay of elections means Surrey County Council won't be held to account for their failings",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_chris-on-heart-radio/content_5.html": "Chris on Heart Radio\n12 Feb 2025\nSurrey has an enormous Special Educational Needs crisis, our roads are filled with potholes and frontline services keep getting cut. Chris on Heart Radio this morning explaining why Surrey Council elections should have gone ahead - so we could get rid of the current Conservative administration.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_page-1/content_6.html": "Changing the Mental Capacity Act 2005\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nI am honoured that last year my Maiden speech in Parliament was nominated for Speech of the Year by Parliament News alongside 5 other MPs.\nIn it, I shared Christopher Laskaris’s tragic story—a young man with autism who was murdered. Together with his mother Fiona, Jake Richards MP (Labour) and Jeremy Hunt MP (Conservative). I’m working to improve the law to try and stop this happening again.\nChristopher grew up in my childhood home, Jake was the barrister at his inquest and Jeremy is Fiona’s MP.\n\"As your Member of Parliament, I am committed to addressing the ongoing challenges that our community faces, challenges that have only intensified in recent years. Many in Dorking are struggling to make ends meet, with rising costs making it difficult to feed their families and pay their bills. Access to healthcare is a significant concern, with too many unable to secure timely appointments with their GPs.\nThe impact of economic instability is felt by local businesses, many of which are fighting to survive amidst the cost of living crisis. I believe passionately that we can forge a better path forward. This area is my home—where I grew up, where I live, and where my children attend school. My wife and I are deeply invested in ensuring a bright future for our three daughters. We want them to have access to good jobs, affordable housing, and a reliable NHS that will care for them. We also want to protect our beautiful countryside for future generations.\nMy journey has taken me from the bustling finance sector to serving in the British Army, where I fought against terrorism in Iraq. After meeting atrocity survivors living in extreme poverty in Mozambique, I co-founded the charity Grow Movement, which provides business learning and support to entrepreneurs and businesses around the world. Now, I am dedicated to championing the change our community needs\nI believe in a liberal economy that prioritises personal freedom and social justice. We deserve better than a government whose decisions have led to such significant financial and social damage. For too long, this area has been represented by Conservative MPs who seem to take your vote for granted. The Liberal Democrats are ready to lead that change, and I am here to ensure your voice is heard in Westminster.\"\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nI have written with Lib Dem MPs in Surrey to the Department for Education, stating how we have lost confidence in Surrey County Council and it's ability to deliver SEND services. We request the Secretary of State intervenes immediately.\nToday Chris was on Heart Radio discussing how the delay of elections means Surrey County Council won't be held to account for their failings\nChris was on BBC Politics South East at the weekend",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_chris-on-bbc-radio-surrey-betchwood-vale-academy/content_4.html": "Chris on BBC Radio Surrey - Betchwood Vale Academy\nThe delays to the new Betchwood Vale Academy special educational needs school in Dorking are unacceptable. Chris met with the Schools' Minster Catherine McKinnell last week urging them to progress it as fast as possible. Chris was on BBC Surrey this morning discussing the impact the school's delays are having on local families.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_page-2/content_10.html": "Chris on ITV News\nLast night Chris was on national ITV news speaking about the SEN education crisis\nLast night Chris was on national ITV news speaking about the SEN education crisis\nI have written with Lib Dem MPs in Surrey to the Department for Education, stating how we have lost confidence in Surrey County Council and it's ability to deliver SEND services. We request the Secretary of State intervenes immediately.\nChris praises work of local campaigners in holding UKOG to account.\nLast night Chris was on Ian Dale’s LBC show talking about the national crisis in special needs provision and what a better special needs education system might look like.\nChris Coghlan MP for Dorking & Horley interviewed September 20th on BBC Radio Surrey about the ongoing works in Dorking's West Street.\nChris Coghlan, MP for Dorking & Horley, and Hazel Watson, County Councillor, visited the site of the sinkhole in Dorking’s West Street, and are keeping up the pressure on Thames Water to fix the issue.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_changing-the-mca2005/content_16.html": "Changing the Mental Capacity Act 2005\nIn Chris’ maiden speech to Parliament, he pledged that it was his intention that Fiona Laskaris would success in changing the Mental Capacity Act 2005 following the murder of her autistic son, Christopher.\nThis change would give parents, or someone who knows the person, the ability to raise the alarm with public authorities. We believe this would have saved Christopher’s life.\nSince then I have been working with Fiona, Tim Nicholls of the National Autistic Society and cross party with Jeremy Hunt MP (Conservative) and Jake Richards (Labour) to change the Act when the Mental Health Bill comes to the House of Commons soon, and save the lives of others.\nThe five of us spoke on ITV news about this; see the full clip here:",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news/content_7.html": "Changing the Mental Capacity Act 2005\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nChris Coghlan MP spoke to ITV news to tell the story of Fiona Laskaris and her autistic son, Christopher, and how changing the Mental Capacity Act 2005 could have saved his life.\nIn a difficult speech today, Chris called for immediate reform of Surrey County Council's Children, Families, and Lifelong Learning department following its catastrophic and systemic negligence in the tragic deaths of 3 Surrey children\nChris was on BBC Politics South East at the weekend\nToday Chris was on Heart Radio discussing how the delay of elections means Surrey County Council won't be held to account for their failings",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_news_article_surrey-county-council-needs-urgent-reform/content_18.html": "Surrey County Council needs urgent reform\nIn a difficult speech today, Chris called for immediate reform of Surrey County Council's Children, Families, and Lifelong Learning department following its catastrophic and systemic negligence in the tragic deaths of 3 Surrey children: Chris's constituent Jennifer Chalkley from Bookham, Oskar Nash, and Sara Sharif. Alongside fellow Surrey MPs Will Forster and Al Pinkerton.",
  "https_www_chriscoghlan_org_/https_www_chriscoghlan_org_volunteer/content_22.html": "Volunteer\nHelp us make a difference in your community\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you."
}