{
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_04_14_my-submission-to-ofcoms-universal-service-obligation-consultation-about-royal-mail/content_7.html": "Far too frequently, postal deliveries in my Brighton Pavilion constituency are very poor, and\nthe unreliable service means too many of my constituents don’t receive important post in\ntime, such as medical appointment letters, benefit decisions, and legal documents.\nSee my submission to Ofcom’s Universal Service Obligation consultation below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_category_publication_page_2/content_67.html": "17 October 2024 / 17 October 2024 by matttraini\nAhead of the Budget I have written to the Chancellor with proposals for good value capital investments and revenue spending, based on needs I have identified from my own constituency in Brighton Pavilion. I’m asking for capital investment in homes and active travel and revenue spending to support fire safety, local authority support for young […]\nRead more »\n14 October 2024 / 14 October 2024 by matttraini\nI welcome Brighton and Hove City Council’s commitment to continue the offer of their Trans Inclusion Toolkit at a time when some other local authorities have paused or cancelled theirs. For local schools to have the option of this resource is not just invaluable in terms of harm reduction to trans and non-binary young people, as […]\n8 October 2024 / 10 December 2024 by matttraini\nI’ve working with Alphabet, a brilliant grassroots music venue in my constituency, which has raised concerns about a planning application to develop a site next to the venue. The concerns being raised are due to the proximity of the site to this popular venue and the potential risk of noise complaints this could create – […]\n1 October 2024 by matttraini\nAlongside my Green MP colleagues, I have written to the Department for Environment and Rural Affairs to urge immediate action to end the continued legality of snares in England. Many of our constituents have brought this issue to our attention through the campaign group Animal Aid. Read the letter in full here:\n1 October 2024 / 17 October 2024 by matttraini\nEllie Chowns MP wrote on behalf of Green MPs about the case of Jagtar Singh Johal – a British citizen who has been detained in India since 2017. See her letter and the Secretary of State’s response below.\n20 September 2024 / 23 September 2024 by matttraini\nI have made calls for new action to reduce the harm caused by gambling in the city. My proposals were sent in response to the consultation on Brighton and Hove City Council’s draft Gambling Policy for 2025-27. In my submission, I requested a meeting with local councillors to discuss possible areas of joint work and proposed a range […]\n9 September 2024 / 3 October 2024 by matttraini\nFire risk assessments (FRAs) should be available and accessible to tenants but at present Brighton and Hove City Council does not publish copies of FRAs online. I’ve raised this with the Chief Executive of the council and Cabinet Member, Housing and New Homes. Read my letter below:\n28 August 2024 / 3 October 2024 by matttraini\nSent by email to Cllr Gill Williams, Deputy Leader and Cabinet Member for Housing and New Homes. Dear Gill, I hope that you are well. I’m writing regarding Acorn’s Boot the Bailiff campaign to ask that Brighton and Hove City Council commits to reviewing its bailiff contract and sets a goal of dramatically reducing its use of bailiffs […]\n7 August 2024 / 23 September 2024 by Sian Berry\nI have written to the Home Secretary asking her a number of questions about the current wave of fascist violence on our streets.\n26 July 2024 / 17 October 2024 by matttraini\nSian Berry and the group of Green MPs have written to the Chancellor, Rachel Reeves, ahead of the budget asking for fairer taxes on the most wealthy, which could raise up to £50 billion a year towards the NHS, schools and local authorities’",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_02_10_sian-berry-joined-by-climate-youth-movement-in-green-campaign-package-reveal-for-2024-general-election/content_60.html": "10th February 2024\nSiân Berry will reveal what voters in Brighton Pavilion have said they want from their next Green MP at an event held on Feb 10th 2024.\nThe evening will be hosted by Zack Polanski, Deputy Leader of the Green Party, and also speaking is current MP for Brighton Pavilion, Caroline Lucas. Special guest speaker is from the youth-led Green New Deal, who will speak to the urgency felt by younger people in the face of climate change.\nSiân has already knocked on thousands of doors across the constituency since her selection as the Greens’ candidate in July last year and on Saturday evening will present to party activists and members what Greens have identified as the issues that matter most to people in Brighton leading up to this year’s expected general election.\nSiân said:\nThe event is being held in the same week that Labour has ditched its own flagship green pledge to spend £28bn, in a major U-turn. The spending pledge had previously been a main part of the party’s environmental plans.\nConcluding, Siân said:\nSince launching last July the campaign continues to gain momentum. With a focus on water quality and why we need to take it back into public hands, NHS waiting times, young peoples’ mental health, and getting to grips with the housing crisis, what is being heard on the doorstep is reflected in the party’s campaign package to keep Brighton green.\nSiân Berry was selected as the Green Party’s Brighton Pavilion candidate last July, after Caroline Lucas announced that she would be standing down as the country’s long standing and only Green MP at the next general election. Siân is a former co-leader and principal speaker of the Green Party of England and Wales.\n-ends-",
  "https_sianberry_org_uk_/https_sianberry_org_uk_news-all_page_3/content_61.html": "My submission to Brighton and Hove City Council’s consultation on Trans Inclusion Schools Toolkit. 14 October 2024 / 14 October 2024 by matttraini I welcome Brighton and Hove City Council’s commitment to continue the offer of their Trans Inclusion Toolkit at a time when some other local authorities have paused or cancelled theirs. For local schools to have the option of this resource is not just invaluable in terms of harm reduction to trans and non-binary young people, as […] Read more »\nMy letter supporting grassroots music venue Alphabet 8 October 2024 / 10 December 2024 by matttraini I’ve working with Alphabet, a brilliant grassroots music venue in my constituency, which has raised concerns about a planning application to develop a site next to the venue. The concerns being raised are due to the proximity of the site to this popular venue and the potential risk of noise complaints this could create – […] Read more »\nLetter on immediate action to end use of snares 1 October 2024 by matttraini Alongside my Green MP colleagues, I have written to the Department for Environment and Rural Affairs to urge immediate action to end the continued legality of snares in England. Many of our constituents have brought this issue to our attention through the campaign group Animal Aid. Read the letter in full here: Read more »\nLetter to the Foreign Secretary about Jagtar Singh Johal 1 October 2024 / 17 October 2024 by matttraini Ellie Chowns MP wrote on behalf of Green MPs about the case of Jagtar Singh Johal – a British citizen who has been detained in India since 2017. See her letter and the Secretary of State’s response below. Read more »\nCalling for more curbs on gambling premises in the city, and a ban on gambling adverts from council and government 20 September 2024 / 23 September 2024 by matttraini I have made calls for new action to reduce the harm caused by gambling in the city. My proposals were sent in response to the consultation on Brighton and Hove City Council’s draft Gambling Policy for 2025-27. In my submission, I requested a meeting with local councillors to discuss possible areas of joint work and proposed a range […] Read more »\nMy letter asking for Fire risk assessments to be made public for council tenants 9 September 2024 / 3 October 2024 by matttraini Fire risk assessments (FRAs) should be available and accessible to tenants but at present Brighton and Hove City Council does not publish copies of FRAs online. I’ve raised this with the Chief Executive of the council and Cabinet Member, Housing and New Homes. Read my letter below: Read more »\nLetter to Brighton and Hove City Council in support of Acorn’s “Boot the Bailiff” campaign 28 August 2024 / 3 October 2024 by matttraini Sent by email to Cllr Gill Williams, Deputy Leader and Cabinet Member for Housing and New Homes. Dear Gill, I hope that you are well. I’m writing regarding Acorn’s Boot the Bailiff campaign to ask that Brighton and Hove City Council commits to reviewing its bailiff contract and sets a goal of dramatically reducing its use of bailiffs […] Read more »\nMy letter to the Home Secretary about the fascist violence on our streets 7 August 2024 / 23 September 2024 by Sian Berry I have written to the Home Secretary asking her a number of questions about the current wave of fascist violence on our streets. Read more »\nLetter to the Chancellor calling for fairer taxes on the most wealthy 26 July 2024 / 17 October 2024 by matttraini Sian Berry and the group of Green MPs have written to the Chancellor, Rachel Reeves, ahead of the budget asking for fairer taxes on the most wealthy, which could raise up to £50 billion a year towards the NHS, schools and local authorities’ Read more »\nGreen Party calls for action to end HIV transmissions by 2030 23 July 2024 / 23 September 2024 by Green Party Admin The Green Party is calling for the next government to save money and save lives by: Making the HIV prevention pill (“PrEP”) available beyond specialist sexual health services, such as in GP services and pharmacies Read more »",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_07_05_thankyou/content_30.html": "Thank you from the bottom of my heart to everyone in Brighton who has put their trust in me and the Green Party. This is a very special city, and together we’ve made history again.\nI promise to work hard as your new Green MP and make sure your voices are heard in Parliament. You have demanded action on the NHS, the water companies, housing, and the climate emergency, and I will be there to make sure the new Government delivers on all these priorities.\nI am infinitely grateful to Caroline Lucas for her support throughout the campaign, and for being such a model of how to be an effective MP for Brighton and the country.\nIt’s hard to express my delight at joining three other newly-elected Green MPs, Carla Denyer, Adrian Ramsay and Ellie Chowns, I know they will all be brilliant.\nI will make sure the Government takes up the good ideas in our Green manifesto without delay.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_02_19_my-comments-on-brighton-and-hove-city-councils-consultation-on-school-admission-arrangements/content_8.html": "As the Member of Parliament for Brighton Pavilion I have written with my comments on Brighton and Hove City Council’s consultation on secondary school admission arrangements.\nSee my full submission below.\nAs the Member of Parliament for Brighton Pavilion I have written with my comments on Brighton and Hove City Council’s consultation on secondary school admission arrangements.\nSee my full submission below.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_09_20_sian-berry-mp-calls-for-more-curbs-on-gambling-premises-in-the-city-and-a-ban-on-gambling-adverts-from-council-and-government/content_23.html": "I have made calls for new action to reduce the harm caused by gambling in the city.\nMy proposals were sent in response to the consultation on Brighton and Hove City Council’s draft Gambling Policy for 2025-27.\nIn my submission, I requested a meeting with local councillors to discuss possible areas of joint work and proposed a range of actions the council should take to reduce the harm done by gambling in Brighton and Hove, including: [1]\n>> A ‘one in one out’ policy for gambling premises in the city, with further reductions if problem gambling increases.\n>> A local ban on the advertising of gambling on every billboard, bus stop, and any other ‘outdoor’ advertising sites within the city, including on buses.\n>> More data collection locally to measure the harm being done to vulnerable people and children.\n>> Work with MPs and other councils to push for a country-wide ban on gambling company advertising, plus restrictions on sports sponsorship.\n>> An end to the exception made for sports broadcasts in enforcing the watershed on TV advertising for gambling companies.\nIn the response, I say:\n“We have clear evidence that gambling harms are increasing. We have a large number of the gambling establishments in the city and, along with the large amount of advertising that takes place for the major bookmakers and – increasingly – high street slot machine outlets, these premises create a real risk of harm to those who already have problems with gambling, and to children and wider society.\n“In addition, advertising for online gambling is also prevalent in the city, and it is common for adults and children to see these adverts online as well. As a licensing authority with a duty to work towards the protection of: “children and other vulnerable persons from being harmed or exploited by gambling,” the council should be seeking to reduce all kinds of harm in every way it can.”\nRecent data has shown that problem gambling may be much more prevalent than previously estimated. Using new methodology, surveys from Public Health England show that 2.5 per cent of adults responding scored 8 or more on the Problem Gambling Severity Index (PGSI), compared with less than half a per cent previously. [2]\nBased on the Office for National Statistics’ latest population estimates, this would imply that over one million adults in Great Britain are now problem gamblers and, if the same proportion holds here, more than 5,000 adults in Brighton and Hove.\nThe National Gambling Helpline also hit record-breaking service levels in 2023, receiving more calls and online chats than any previous year. A total of 52,370 calls and online chats were made to the Helpline, a 24 per cent increase compared with the year before, and August 2023 was the busiest month on record. December 2023 also saw a 39 per cent increase compared with the same month the year before, and this was the busiest Christmas period ever recorded by the helpline.\nReferences:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_author_green-party-admin/content_52.html": "23 July 2024 / 23 September 2024 by Green Party Admin\nThe Green Party is calling for the next government to save money and save lives by: Making the HIV prevention pill (“PrEP”) available beyond specialist sexual health services, such as in GP services and pharmacies\nRead more »",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_10_01_letter-on-immediate-action-to-end-use-of-snares/content_27.html": "Alongside my Green MP colleagues, I have written to the Department for Environment and Rural Affairs to urge immediate action to end the continued legality of snares in England. Many of our constituents have brought this issue to our attention through the campaign group Animal Aid.\nRead the letter in full here:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_news/content_43.html": "My Submission to Ofcom’s Universal Service Obligation consultation About Royal Mail 14 April 2025 / 14 April 2025 by matttraini Far too frequently, postal deliveries in my Brighton Pavilion constituency are very poor, andthe unreliable service means too many of my constituents don’t receive important post intime, such as medical appointment letters, benefit decisions, and legal documents. See my submission to Ofcom’s Universal Service Obligation consultation below: Read more »\nLetter to Liz Kendall about proposed welfare cuts 25 March 2025 / 26 March 2025 by victoria Ahead of the Equality Impact Assessment of the Government’s Green Paper on welfare reform, Siân Berry MP has written to Secretary of State for Work and Pensions, Liz Kendall setting out her concerns on the planned proposals. Read Siân’s letter below. The Rt Hon Liz Kendall MPSecretary of State for Work and PensionsBy Email Dear […] Read more »\nReacting to Labour’s Green Paper on welfare reform 18 March 2025 / 18 March 2025 by victoria Responding to the Government’s Green Paper on welfare reform, Green MP Siân Berry said: “I’ve heard nothing today that reassures me the Government will stop scapegoating and stigmatising those in need, while impoverishing them to the tune of £5 billion. Young and disabled people should have the support and backing of the Government but instead […] Read more »\nLetter to Labour MPs on proposed cuts to welfare benefits 14 March 2025 / 14 March 2025 by victoria Ahead of the upcoming Spring Statement and Green Paper on welfare, I have written to every Labour MP asking them to oppose strongly and vote against any proposed cuts to welfare benefits, which are rumoured to be as deep as £6 billion. Read my full letter below. Read more »\nWriting to all Labour MPs urging them to vote against cruel welfare cuts 14 March 2025 / 17 March 2025 by victoria Green MP Siân Berry has written to every Labour MP urging them to vote against the government’s planned cuts to welfare spending, highlighting the “catastrophic impact” the cuts would have on disabled people. [1] Figures from Scope this week suggested that the proposed changes will push an added 700,000 disabled households into poverty, as Starmer’s […] Read more »\nDefending new Sentencing Council guidelines 6 March 2025 / 12 March 2025 by victoria Responding to the news that the Justice Secretary will reject recommendations by the Sentencing Council to strengthen the need for pre-sentence reports for judges, Siân Berry Green MP for Brighton Pavilion said: “Failure to implement these changes would be a serious mistake, causing genuine harm to women, families and young people for whom these new […] Read more »\nLabour should listen to the public on Gatwick expansion 27 February 2025 / 12 March 2025 by victoria Responding to the Transport Secretary’s decision to pursue a positive decision for Gatwick Airport to bring its northern terminal into constant use, (1) Siân Berry Green MP for Brighton Pavilion said: “The Labour government is trashing its climate credentials one absurd decision at a time. Only one day after receiving critical advice from its own […] Read more »\nMy comments on Brighton and Hove City Council’s consultation on school admission arrangements. 19 February 2025 / 19 February 2025 by matttraini As the Member of Parliament for Brighton Pavilion I have written with my comments on Brighton and Hove City Council’s consultation on secondary school admission arrangements. See my full submission below. Read more »\nGreen MPs spending review submission 19 February 2025 / 19 February 2025 by matttraini With my fellow Green MPs, I have written a formal submission to the 2025 Spending Review, calling on the Government to take a long-term perspective on departmental spending and resource allocation. Our proposals cover Climate and Nature, transport, restoring public services and housing, including grants to support building social homes and to help councils buy […] Read more »\nExpanding Heathrow in the face of a climate emergency is the definition of irresponsible 29 January 2025 / 12 March 2025 by victoria Responding to the news that Rachel Reeves is backing the expansion of Heathrow Airport, Green Party MP, Sian Berry said, “The Chancellor talked about the ‘costs of irresponsibility’ but expanding Heathrow in the face of a climate emergency is the definition of irresponsible.” “Worst still, we’re also expecting formal planning decisions from ministers on Gatwick and […] Read more »",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_06_24_steve-coogan-endorses-sian-berry-in-brighton-pavilion/content_35.html": "Academy award nominated actor, comedian, and screenwriter Steve Coogan has today endorsed Siân Berry’s candidacy for Brighton Pavilion.\nMeeting a crowd of supporters in the Hanover area of the city today, Steve, who used to live in Brighton and still lives locally, said:\n“Caroline Lucas did a great job for the City and in Parliament. It is my hope that Siân will be elected to carry on the good work. Greens are a force for good on key issues like the environment and also more recently on issues close to my heart like justice in Gaza, and standing up to the corporate national press. Greens also support electoral reform where all votes count and that’s why I am happy to endorse Siân Berry here in Brighton Pavilion.”\nSiân Berry responded:\n“I’m deeply honoured to have Steve’s endorsement. He is a real star, coming in and backing our campaign at this time. Brighton people are also stars for the support they are showing to me and my team each and every day. I am incredibly flattered to have Steve’s support. It shows how much our momentum is growing right now and into the next crucial days. Brighton voters have a win-win opportunity to keep our city strong, green and independent on July 4. I’ll continue to give my all in securing every last, vital, vote until then.”\nENDS",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_10_14_my-submission-to-brighton-and-hove-city-councils-consultation-on-trans-inclusion-schools-toolkit/content_22.html": "I welcome Brighton and Hove City Council’s commitment to continue the offer of their Trans Inclusion Toolkit at a time when some other local authorities have paused or cancelled theirs. For local schools to have the option of this resource is not just invaluable in terms of harm reduction to trans and non-binary young people, as vital though that is, but it is of benefit to all children and young people in preparing them for life in the modern world.\nSee my full submission to the local consultation below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_author_sian-berry/content_29.html": "7 August 2024 / 23 September 2024 by Sian Berry\nI have written to the Home Secretary asking her a number of questions about the current wave of fascist violence on our streets.\nRead more »\n19 July 2024 / 23 September 2024 by Sian Berry\nToday, Carla Denyer MP and I wrote to the Secretary of State for Health and Social Care, Wes Streeting, expressing our serious concerns about his recent statement on puberty blockers. Trans young people need support, not to have their healthcare used as a political football. Medical decisions are for patients and doctors, not politicians.\n10 June 2024 / 10 June 2024 by Sian Berry\nThe Green Party MP candidate for Brighton Pavilion today issued a challenge to all other candidates to sign up to a Clean Campaign Promise. Siân Berry said: “Now we have the final list of people standing, I would like to challenge all the other candidates in Brighton Pavilion to agree to a Clean Campaign Promise […]\n2 June 2024 / 23 September 2024 by Sian Berry\nI wrote to Brighton and Hove’s planning committee asking them to vote down the planing permission for the expansion of the L3 Harris factor in Brighton. Read the letter here: https://sianberry.org.uk/wp-content/uploads/sites/248/2024/06/24_06_02_SB_L3Harris_objection_letter.pdf",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_05_23_greens-welcome-general-election-and-will-campaign-hard-to-retain-brighton-pavilion/content_68.html": "23 May 2024 / 4 June 2024 by Stewart Christie\nThe Green Party welcomes today’s announcement of a general election as the chance for voters to choose hope, respect and practical solutions to the crises facing the country.\nBrighton Pavilion parliamentary candidate Siân Berry said:\n“This isn’t a moment too soon. We have the policies, we are ready, and want as much as anyone to see the back of this disastrous Conservative government. With Labour on track to secure a landslide victory, we know the most effective way to do this in Brighton is to vote Green. “This government has failed on every measure, but they have been held to account by a pioneering Green MP who has represented Brighton for 14 years. Now is the chance to keep that strong, independent voice in Westminster and push the next government to be better. “I will continue to work for every vote to show people the difference a Green MP will go on making. I’ll campaign to defend the NHS, bring water back into public hands, get people into warm, affordable housing and keep pushing for action in the face of devastating climate change. “Brighton’s voters have been leading the way since 2010. With more Green MPs in parliament we can continue to make a fair future for all, and be a strong national opposition. I will be your fearless local advocate. Your vote on July 4 will uphold Brighton’s values, build a better future for our children and grandchildren while keeping a strong, independent voice in Parliament.”\n-ends-\nNOTES TO EDITORS\nThe Green Party of England and Wales will stand candidates in every constituency.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_11_27_my-letter-to-secretary-of-state-for-work-and-pensions-on-new-search-and-seizure-powers/content_38.html": "I have written to regarding the Secretary of State about the Government’s recent proposals in the Autumn budget to give Department for Work and Pensions (DWP) investigators new ‘search and seizure’ powers, via the Fraud, Error and Debt Bill. This is in addition to measures which allow for surveillance of the bank accounts of those who claim benefits, including Disabled people.\nI have received multiple messages from constituents in receipt of Personal Independence Payments (PIP) who are fearful about these plans and asked the Government to reconsider.\nMy full letter below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_02_27_gatwick-expansion-unwanted-says-sian-berry/content_6.html": "Responding to the Transport Secretary’s decision to pursue a positive decision for Gatwick Airport to bring its northern terminal into constant use, (1) Siân Berry Green MP for Brighton Pavilion said:\n“The Labour government is trashing its climate credentials one absurd decision at a time. Only one day after receiving critical advice from its own climate advisors on the need to lower flying demand, ministers continue to support yet more unnecessary expansion for the benefit of wealthy investors.\n“Pushing through these damaging plans shows such poor economic judgement. Over 100,000 extra flights a year won’t deliver for our communities. Labour should listen to the public who think airport expansion is the wrong priority. Most of us fly once a year if at all and would rather see cheaper train tickets and more bus routes instead to help with our daily journeys and create jobs where we live, in contrast with frequent flyers leaching money out of the economy.\n“The green economy grew by ten per cent last year, and this is where Labour should be investing to deliver high-wage, long-term jobs across the entire country.”",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_03_14_letter-to-labour-mps-on-proposed-cuts-to-welfare-benefits/content_24.html": "Ahead of the upcoming Spring Statement and Green Paper on welfare, I have written to every Labour MP asking them to oppose strongly and vote against any proposed cuts to welfare benefits, which are rumoured to be as deep as £6 billion. Read my full letter below.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_publications/content_17.html": "My recent letters and publications as a local MP and pushing the Government nationally to change policies.\n- My Submission to Ofcom’s Universal Service Obligation consultation About Royal Mail\n- Letter to Liz Kendall about proposed welfare cuts\n- Letter to Labour MPs on proposed cuts to welfare benefits\n- My comments on Brighton and Hove City Council’s consultation on school admission arrangements.\n- Green MPs spending review submission\n- Letter to Minister of State for Social Security and Disability on the Work Capability Assessment\n- Letter to Minister for Pensions on upcoming changes to the triple lock and state pension\n- My submission to the Planning Inspectorate regarding L3 Harris Release and Integrated Solutions Ltd\n- My Letter to Secretary of State for Work and Pensions on new ‘search and seizure’ powers\n- My Letter To Constituents On The End Of Life Bill\n- Letter to the Chancellor ahead of the Government’s first Budget\n- My submission to Brighton and Hove City Council’s consultation on Trans Inclusion Schools Toolkit.\n- My letter supporting grassroots music venue Alphabet\n- Letter on immediate action to end use of snares\n- Letter to the Foreign Secretary about Jagtar Singh Johal\n- Calling for more curbs on gambling premises in the city, and a ban on gambling adverts from council and government\n- My letter asking for Fire risk assessments to be made public for council tenants\n- Letter to Brighton and Hove City Council in support of Acorn’s “Boot the Bailiff” campaign\n- My letter to the Home Secretary about the fascist violence on our streets\n- Letter to the Chancellor calling for fairer taxes on the most wealthy\n- My letter with Carla Denyer to Wes Streeting about puberty blockers\n- My letter opposing Brighton’s L3 Harris weapons factory",
  "https_sianberry_org_uk_/https_sianberry_org_uk_author_matttraini/content_25.html": "14 April 2025 / 14 April 2025 by matttraini\nFar too frequently, postal deliveries in my Brighton Pavilion constituency are very poor, andthe unreliable service means too many of my constituents don’t receive important post intime, such as medical appointment letters, benefit decisions, and legal documents. See my submission to Ofcom’s Universal Service Obligation consultation below:\nRead more »\n19 February 2025 / 19 February 2025 by matttraini\nAs the Member of Parliament for Brighton Pavilion I have written with my comments on Brighton and Hove City Council’s consultation on secondary school admission arrangements. See my full submission below.\nWith my fellow Green MPs, I have written a formal submission to the 2025 Spending Review, calling on the Government to take a long-term perspective on departmental spending and resource allocation. Our proposals cover Climate and Nature, transport, restoring public services and housing, including grants to support building social homes and to help councils buy […]\n23 January 2025 / 23 January 2025 by matttraini\nI’m calling on the Government to create a more compassionate and supportive social security system, rather than one that pushes disadvantaged people further into hardship. My full letter below:\nI am concerned that many pensioners will be unknowingly pushed into paying income tax and face unexpected tax bills, especially given that the personal tax allowance is frozen at £12,570 until 2028 while the state pension is set to rise by 8.5 per cent in April 2024. Read my full letter below:\n18 December 2024 / 18 December 2024 by matttraini\nAs the MP for Brighton Pavilion, I have made a representation regarding the appeal: APP/Q1445/W/24/3355883 Emblem House Home Farm Business Centre, Hone Farm Road Brighton BN1 9HU. This relates to L3 Harris Release and Integrated Solutions Ltd (previously known as EDO MBM). This is a business that is currently potentially complicit in the violation of […]\n27 November 2024 / 27 November 2024 by matttraini\nI have written to regarding the Secretary of State about the Government’s recent proposals in the Autumn budget to give Department for Work and Pensions (DWP) investigators new ‘search and seizure’ powers, via the Fraud, Error and Debt Bill. This is in addition to measures which allow for surveillance of the bank accounts of those who claim benefits, including Disabled people. I have received […]\n26 November 2024 / 26 November 2024 by matttraini\nI will be voting to progress the Terminally Ill Adults (End of Life) Bill on Friday 29 November. I have received a very large number of emails, letters and postcards about this issue from constituents, and I have been really touched by how many people have told me about their own personal experience of loved […]\n17 October 2024 / 17 October 2024 by matttraini\nAhead of the Budget I have written to the Chancellor with proposals for good value capital investments and revenue spending, based on needs I have identified from my own constituency in Brighton Pavilion. I’m asking for capital investment in homes and active travel and revenue spending to support fire safety, local authority support for young […]\n14 October 2024 / 14 October 2024 by matttraini\nI welcome Brighton and Hove City Council’s commitment to continue the offer of their Trans Inclusion Toolkit at a time when some other local authorities have paused or cancelled theirs. For local schools to have the option of this resource is not just invaluable in terms of harm reduction to trans and non-binary young people, as […]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_07_23_green-party-calls-for-action-to-end-hiv-transmissions-by-2030/content_63.html": "The Green Party is calling for the next government to save money and save lives by:\n- Making the HIV prevention pill (“PrEP”) available beyond specialist sexual health services, such as in GP services and pharmacies\n- Continuing successful HIV testing programmes in A&E hospitals in areas of high HIV prevalence including London, Manchester, Blackpool and Brighton\n- Launching a scheme to find and help the 15,000 people diagnosed with HIV who have lost contact with health services.\n- Establishing a free postal STI testing service, as is available in Wales\nThe Green Party has today announced the policies needed to end new HIV transmissions by 2030, warning that the government’s HIV Action Plan for England expires next year.\nFigures compiled by the Terrence Higgins Trust show a dire situation for sexual health services:\n- Sexual health clinics have had a 29% real terms cut during the Conservative government;\n- 60% of people trying to get a prescription for the HIV prevention pill (PrEP) have to wait more than 12 weeks, and some people have acquired HIV while waiting;\n- Some people resort to buying PrEP online.\nThe Green Party is calling for expanding access to the PrEP pill, so that it can be obtained via GPs and pharmacies, will dramatically reduce HIV transmissions while reducing demand on overstretched specialist sexual health services. In Brighton, a pilot scheme has brought the waiting list down to zero and freed up 1,000 hours of capacity at sexual health services, by allowing people to reorder their PrEP prescriptions using an app.\nRoutine HIV testing has been highly effective: detecting thousands of undiagnosed HIV cases and saving almost £4 for every £1 spent. NHS England estimated that £2.2 million spent on this scheme saved £8 million in care costs. But funding is uncertain for this scheme, and must be renewed next year.\nThousands of people with HIV have dropped out of treatment and are “lost” to the health system, with the UKHSA estimating almost 15,000 people were “lost to care” in 2022. The Terrence Higgins Trust and Elton John Aids Foundation estimate that an investment of £7 million over two years could find these people and help them restart treatment, saving significant lifetime care costs and onward transmissions of HIV.\nMaking free postal STI and HIV testing available across England would help increase rates of diagnosis by allowing people to test at home without needing to travel to a clinic. Postal STI testing is already universally available in Wales, but is a postcode lottery in England.\nCarla Denyer, Co-Leader of the Green Party of England and Wales, said:\n“There’s a clear pathway towards ending HIV transmissions in the next Parliament. The simple, proven policies in our manifesto will save the NHS millions of pounds, but most importantly, they will save lives. The Green Party manifesto adopts the many sensible policies proposed by the Terrence Higgins Trust, and I am grateful for all their work to urgently improve the nation’s sexual health.”\nSian Berry, former Leader of the Green Party of England and Wales, said:\n“The government’s HIV Action Plan for England has nearly expired. Green MPs will campaign to end HIV transmissions in this five year Parliament, so that we can end HIV for future generations. The Green Party is calling on the next Government to end new cases of HIV by 2030 by increasing testing and making it easier for people to get their hands on the highly effective HIV prevention pill. These simple policies will save lives.”\nGreen Party Health and Social Care Spokesperson and GP, Pallavi Devulapalli, added,\n“Zero HIV transmissions is within our grasp. We have the medical knowledge to make the UK a world leader and to be the first country to end all HIV transmissions. All we need is for the political will and upfront financial backing to make it happen. The Green Party has set out a series of proposals for how we can properly fund initiatives like this that will not only save lives, but also over the long-term it will also save the NHS money as well.”\n[1] The Green Party manifesto carries a commitment to “work towards no more HIV transmissions by 2030, advocating for a joined-up approach using proven actions, including access to the HIV prevention pill online, in pharmacies and from GP services. We will renew successful optout HIV testing programmes in A&Es in all areas with a high prevalence of HIV” (Page 4)",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_10_17_letter-to-the-chancellor-ahead-of-the-governments-first-budget/content_26.html": "Ahead of the Budget I have written to the Chancellor with proposals for good value capital investments and revenue spending, based on needs I have identified from my own constituency in Brighton Pavilion.\nI’m asking for capital investment in homes and active travel and revenue spending to support fire safety, local authority support for young people, and teachers in further education.\nSee my full letter below.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_category_news/content_10.html": "18 March 2025 / 18 March 2025 by victoria\nResponding to the Government’s Green Paper on welfare reform, Green MP Siân Berry said: “I’ve heard nothing today that reassures me the Government will stop scapegoating and stigmatising those in need, while impoverishing them to the tune of £5 billion. Young and disabled people should have the support and backing of the Government but instead […]\nRead more »\n14 March 2025 / 17 March 2025 by victoria\nGreen MP Siân Berry has written to every Labour MP urging them to vote against the government’s planned cuts to welfare spending, highlighting the “catastrophic impact” the cuts would have on disabled people. [1] Figures from Scope this week suggested that the proposed changes will push an added 700,000 disabled households into poverty, as Starmer’s […]\n6 March 2025 / 12 March 2025 by victoria\nResponding to the news that the Justice Secretary will reject recommendations by the Sentencing Council to strengthen the need for pre-sentence reports for judges, Siân Berry Green MP for Brighton Pavilion said: “Failure to implement these changes would be a serious mistake, causing genuine harm to women, families and young people for whom these new […]\n27 February 2025 / 12 March 2025 by victoria\nResponding to the Transport Secretary’s decision to pursue a positive decision for Gatwick Airport to bring its northern terminal into constant use, (1) Siân Berry Green MP for Brighton Pavilion said: “The Labour government is trashing its climate credentials one absurd decision at a time. Only one day after receiving critical advice from its own […]\n29 January 2025 / 12 March 2025 by victoria\nResponding to the news that Rachel Reeves is backing the expansion of Heathrow Airport, Green Party MP, Sian Berry said, “The Chancellor talked about the ‘costs of irresponsibility’ but expanding Heathrow in the face of a climate emergency is the definition of irresponsible.” “Worst still, we’re also expecting formal planning decisions from ministers on Gatwick and […]\n21 January 2025 / 12 March 2025 by victoria\nIn response to rumours that the Government may soon sign off expansion proposals for Luton, Gatwick and Heathrow Airports, Siân Berry, Green Party MP for Brighton Pavilion said: “We must ask who these decisions would be made for and why. Whose advice is the Government listening to, when record-high wealth inequality is causing harm to […]\n9 January 2025 / 10 January 2025 by victoria\nGreen MP for Brighton Pavilion Siân Berry has gained cross party support for a bill which would force local authorities to phase out the use of harmful pesticides in public places. An Early Day Motion (EDM) tabled today (9 January), calls on the Government to pass the Plant Protection Products (Prohibition on Public Sector Use) […]\n9 January 2025 / 27 January 2025 by victoria\nSiân joined Greenpeace UK to hand in a petition signed by over 1.6 million people, calling for a total ban onbee-killing neonicotinoid pesticides from Government. These toxic chemicals -one teaspoon can kill one billion bees – were banned across Europe in 2018, but continue to be used on farms here after Conservatives gave ‘emergency’ permission […]\n19 December 2024 / 19 December 2024 by victoria\nResponding to the Government’s announcement* that it would not be offering financial compensation to women affected by changes to the state pension age, Siân Berry MP for Brighton Pavilion said: “This is a very harsh decision, admitting wrongdoing but offering a bitter dose of nothing to a generation of women, caught out by this, who […]\n17 October 2024 / 17 October 2024 by matttraini\nAhead of the Budget I have written to the Chancellor with proposals for good value capital investments and revenue spending, based on needs I have identified from my own constituency in Brighton Pavilion. I’m asking for capital investment in homes and active travel and revenue spending to support fire safety, local authority support for young […]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_11_26_my-letter-to-constituents-on-the-end-of-life-bill/content_19.html": "I will be voting to progress the Terminally Ill Adults (End of Life) Bill on Friday 29 November.\nI have received a very large number of emails, letters and postcards about this issue from constituents, and I have been really touched by how many people have told me about their own personal experience of loved ones facing really hard choices at the end of their lives.\nHere is my letter to constituents on why I will be supporting the bill.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_01_09_save-the-bees/content_33.html": "Siân joined Greenpeace UK to hand in a petition signed by over 1.6 million people, calling for a total ban on\nbee-killing neonicotinoid pesticides from Government.\nThese toxic chemicals -one teaspoon can kill one billion bees – were banned across Europe in 2018, but continue to be used on farms here after Conservatives gave ‘emergency’ permission four years ago.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_06_02_my-letter-opposing-brightons-l3-harris-weapons-factory/content_44.html": "I wrote to Brighton and Hove’s planning committee asking them to vote down the planing permission for the expansion of the L3 Harris factor in Brighton.\nRead the letter here:\nI wrote to Brighton and Hove’s planning committee asking them to vote down the planing permission for the expansion of the L3 Harris factor in Brighton.\nRead the letter here:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_category_news_page_3/content_46.html": "3 June 2024 / 3 June 2024 by Stewart Christie\nThe application for a controversial weapons factory in Brighton run by L3 Harris will be considered later this week. The manufacturing company is applying to retain a temporary extension to their premises in Home Farm Road. Many hundreds of local people have objected to the plans because the factory is thought to supply bomb racks […]\nRead more »\n23 May 2024 / 4 June 2024 by Stewart Christie\nThe Green Party welcomes today’s announcement of a general election as the chance for voters to choose hope, respect and practical solutions to the crises facing the country. Brighton Pavilion parliamentary candidate Siân Berry said: “This isn’t a moment too soon. We have the policies, we are ready, and want as much as anyone to […]\n10 February 2024 / 4 June 2024 by Stewart Christie\n10th February 2024 Siân Berry will reveal what voters in Brighton Pavilion have said they want from their next Green MP at an event held on Feb 10th 2024. The evening will be hosted by Zack Polanski, Deputy Leader of the Green Party, and also speaking is current MP for Brighton Pavilion, Caroline Lucas. Special […]\n3 February 2024 / 4 June 2024 by Stewart Christie\n3rd February 2024 Siân Berry, Green MP candidate for Brighton Pavilion, has shown her support for Patcham Memorial Hall and all community spaces through attendance this morning of the centenary celebrations for the hall. Today, Saturday the 3rd of February, Siân joined local residents of Patcham to celebrate the hall’s opening 100 years prior, on […]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_06_10_sian-berry-calls-for-election-candidates-to-agree-to-a-clean-campaign-promise/content_62.html": "The Green Party MP candidate for Brighton Pavilion today issued a challenge to all other candidates to sign up to a Clean Campaign Promise.\nSiân Berry said: “Now we have the final list of people standing, I would like to challenge all the other candidates in Brighton Pavilion to agree to a Clean Campaign Promise during this general election campaign.\n“Public regard for politicians has never been lower, and it is crucial that we help regain the public’s trust in the democratic process.”\nCandidates taking the pledge will commit to a positive and honest campaign, to refrain from personal attacks, and to make only honest claims about their record and those of others.\nSian continued: “Voters are tired of negative campaigning, of insults and innuendo.\n“I will continue to campaign on the issues that matter to local people including the NHS, sewage in our seas, renting and housing concerns, peace in Palestine and urgent climate action. I will conduct an honest campaign and not take part in any personal attacks.\n“I very much hope the other candidates will immediately confirm they are also happy to make this promise.”\n“If elected, I will serve the people of Brighton as an honest and independent voice, who will represent and fight for the issues that local residents care about.”\n“This is reflected in my campaign, which is why I have signed up to this Clean Campaign Promise today.”\nSiân Berry’s Clean Campaign Promise to Brighton:\n- To run a clean, positive and honest campaign around the issues that matter to local people.\n- To tell the truth about what I stand for and have achieved, and about the record of other candidates.\n- To respect my opponents and refrain from personal attacks.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_07_19_my-letter-with-carla-denyer-to-wes-streeting-about-puberty-blockers/content_47.html": "Today, Carla Denyer MP and I wrote to the Secretary of State for Health and Social Care, Wes Streeting, expressing our serious concerns about his recent statement on puberty blockers.\nTrans young people need support, not to have their healthcare used as a political football.\nMedical decisions are for patients and doctors, not politicians.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_08_28_letter-to-brighton-and-hove-city-council-in-support-of-acorns-boot-the-bailiff-campaign/content_36.html": "Sent by email to Cllr Gill Williams, Deputy Leader and Cabinet Member for Housing and New Homes.\nDear Gill,\nI hope that you are well.\nI’m writing regarding Acorn’s Boot the Bailiff campaign to ask that Brighton and Hove City Council commits to reviewing its bailiff contract and sets a goal of dramatically reducing its use of bailiffs to collect council tax arrears, and reviews its council tax policy to prevent more residents from running up debts they simply cannot afford.\nAcorn can provide significant testimony from local residents about their experience of bailiff use and how this has caused additional distress and exacerbated vulnerabilities for people already experiencing hardship, rather than supporting them to find workable ways forward with arrears.\nI’m aware that Citizens Advice previously collected evidence about the ineffectiveness of bailiff use in relation to Council Tax arrears, which further serves to highlight bailiff use is poor value for money. More humane and cooperative methods for negotiating with residents who have arrears is better for everyone and I strongly believe the council should consider it.\nI’m very open to hearing from BHCC if you think that there are remaining barriers within national legislation which it would be helpful for me to raise with Ministers. However, I am aware of several local authorities which have already committed to amending their approach in response to the campaign, including Bristol and Hammersmith and Fulham.\nIn addition, in the council I previously sat on in Camden, I was successful in working with Child Poverty Action Group to persuade the council to reinstate a zero rate of council tax for those most in need in 2017, which led to a dramatic reduction in arrears for those who simply could not pay, and a large reduction in bailiff use. I am therefore also asking that the council looks at its overall council tax reduction scheme policy, and it would be positive news if Brighton and Hove City Council would commit to similar action in response to the work Acorn is doing.\nIf you are also able to confirm the date BHCC’s current bailiff contract ends in reply, it would also be helpful, as I am keen to have further information about the current position regarding dates and opportunities for this to be reviewed and amended.\nBest wishes,\nSiân",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_01_21_sian-berry-mp-says-listen-to-science-not-the-aviation-lobby-in-response-to-airport-rumours/content_14.html": "In response to rumours that the Government may soon sign off expansion proposals for Luton, Gatwick and Heathrow Airports, Siân Berry, Green Party MP for Brighton Pavilion said:\n“We must ask who these decisions would be made for and why. Whose advice is the Government listening to, when record-high wealth inequality is causing harm to the economy and society in many different ways, and while frequent flying is the preserve of the super-rich?\n“The aviation lobby is loud and well-funded, but the Government should instead be listening to scientists and its own Climate Change Committee, which has already urged a halt to overall airport expansion. The previous Labour government’s poor record on airport expansion doesn’t have to continue.\n“If Ed Miliband is serious in his role as Net-Zero Minister, he will work to prevent the Chancellor and Transport Secretaries making a huge mistake, and advise the Chancellor to not make any dangerous new decisions until they have heard and listened to the new advice from the Climate Change Committee which is due in February.”\nENDS\nNotes:\n- Between 2011 and 2019, the UK’s wealth gap grew by 50% (https://blogs.lse.ac.uk/inequalities/2024/10/29/the-uks-wealth-gap-has-grown-by-50-in-eight-years/)\n- The Climate Change Committee’s 2023 Progress Report to Parliament calls for a halt to all UK airport expansion",
  "https_sianberry_org_uk_/https_sianberry_org_uk_news-all_page_2/content_66.html": "Letter to Minister of State for Social Security and Disability on the Work Capability Assessment 23 January 2025 / 23 January 2025 by matttraini I’m calling on the Government to create a more compassionate and supportive social security system, rather than one that pushes disadvantaged people further into hardship. My full letter below: Read more »\nLetter to Minister for Pensions on upcoming changes to the triple lock and state pension 23 January 2025 / 23 January 2025 by matttraini I am concerned that many pensioners will be unknowingly pushed into paying income tax and face unexpected tax bills, especially given that the personal tax allowance is frozen at £12,570 until 2028 while the state pension is set to rise by 8.5 per cent in April 2024. Read my full letter below: Read more »\nListen to science not the aviation lobby 21 January 2025 / 12 March 2025 by victoria In response to rumours that the Government may soon sign off expansion proposals for Luton, Gatwick and Heathrow Airports, Siân Berry, Green Party MP for Brighton Pavilion said: “We must ask who these decisions would be made for and why. Whose advice is the Government listening to, when record-high wealth inequality is causing harm to […] Read more »\nBrighton Pavilion MP wins cross-party support for national pesticide ban 9 January 2025 / 10 January 2025 by victoria Green MP for Brighton Pavilion Siân Berry has gained cross party support for a bill which would force local authorities to phase out the use of harmful pesticides in public places. An Early Day Motion (EDM) tabled today (9 January), calls on the Government to pass the Plant Protection Products (Prohibition on Public Sector Use) […] Read more » pesticides\nSave the bees! 9 January 2025 / 27 January 2025 by victoria Siân joined Greenpeace UK to hand in a petition signed by over 1.6 million people, calling for a total ban onbee-killing neonicotinoid pesticides from Government. These toxic chemicals -one teaspoon can kill one billion bees – were banned across Europe in 2018, but continue to be used on farms here after Conservatives gave ‘emergency’ permission […] Read more »\nResponse to the rejection of compensation for WASPI women 19 December 2024 / 19 December 2024 by victoria Responding to the Government’s announcement* that it would not be offering financial compensation to women affected by changes to the state pension age, Siân Berry MP for Brighton Pavilion said: “This is a very harsh decision, admitting wrongdoing but offering a bitter dose of nothing to a generation of women, caught out by this, who […] Read more »\nMy submission to the Planning Inspectorate regarding L3 Harris Release and Integrated Solutions Ltd 18 December 2024 / 18 December 2024 by matttraini As the MP for Brighton Pavilion, I have made a representation regarding the appeal: APP/Q1445/W/24/3355883 Emblem House Home Farm Business Centre, Hone Farm Road Brighton BN1 9HU. This relates to L3 Harris Release and Integrated Solutions Ltd (previously known as EDO MBM). This is a business that is currently potentially complicit in the violation of […] Read more »\nMy Letter to Secretary of State for Work and Pensions on new ‘search and seizure’ powers 27 November 2024 / 27 November 2024 by matttraini I have written to regarding the Secretary of State about the Government’s recent proposals in the Autumn budget to give Department for Work and Pensions (DWP) investigators new ‘search and seizure’ powers, via the Fraud, Error and Debt Bill. This is in addition to measures which allow for surveillance of the bank accounts of those who claim benefits, including Disabled people. I have received […] Read more »\nMy Letter To Constituents On The End Of Life Bill 26 November 2024 / 26 November 2024 by matttraini I will be voting to progress the Terminally Ill Adults (End of Life) Bill on Friday 29 November. I have received a very large number of emails, letters and postcards about this issue from constituents, and I have been really touched by how many people have told me about their own personal experience of loved […] Read more »\nLetter to the Chancellor ahead of the Government’s first Budget 17 October 2024 / 17 October 2024 by matttraini Ahead of the Budget I have written to the Chancellor with proposals for good value capital investments and revenue spending, based on needs I have identified from my own constituency in Brighton Pavilion. I’m asking for capital investment in homes and active travel and revenue spending to support fire safety, local authority support for young […] Read more »",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_10_08_my-letter-supporting-grassroots-music-venue-alphabet/content_59.html": "I’ve working with Alphabet, a brilliant grassroots music venue in my constituency, which has raised concerns about a planning application to develop a site next to the venue. The concerns being raised are due to the proximity of the site to this popular venue and the potential risk of noise complaints this could create – a view shared by a number of my constituents who have objected to the plans.\nSee my full objection letter below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_about/content_5.html": "In 2010 Brighton made history by electing Caroline Lucas as Britain’s first Green MP. Her impact has been phenomenal and support for her has only grown.\nPeople can see what a truly independent and strong representative can do, and I was honoured that the people of Brighton Pavilion have given me the opportunity to continue Caroline’s work.\nFor 8 years I held the Labour Mayor to account as a London Assembly Member on issues including Transport, Housing, and Planning and Regeneration Committees. During this time, I was proud to strengthen the rights of renters, improve sustainable transport services, and help win much-needed new funding for youth services.\nI was also a Borough Councillor in for 10 years and served two terms as co-leader of The Green Party. These roles have combined to give me the experience to be an effective, independent MP.\nI moved to London with an overdraft and a degree in 1997 and my previous, non-political work has been as a medical copywriter, PA, website manager, project manager for a digital start-up, author and transport campaigner.\nI was delighted that Brighton chose to continue having a powerful Green voice in Parliament, holding the government to high account and championing the concerns of constituents.\nSince moving here, I’ve been delighted to make Brighton my home. As your MP I will work hard for our city, and the brilliant people who make this such a special place to live.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_01_23_letter-to-minister-of-state-for-social-security-and-disability-on-the-work-capability-assessment/content_11.html": "I’m calling on the Government to create a more compassionate and supportive social security system, rather than one that pushes disadvantaged people further into hardship.\nMy full letter below:\nI’m calling on the Government to create a more compassionate and supportive social security system, rather than one that pushes disadvantaged people further into hardship.\nMy full letter below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_news-all_page_4/content_58.html": "My letter with Carla Denyer to Wes Streeting about puberty blockers 19 July 2024 / 23 September 2024 by Sian Berry Today, Carla Denyer MP and I wrote to the Secretary of State for Health and Social Care, Wes Streeting, expressing our serious concerns about his recent statement on puberty blockers. Trans young people need support, not to have their healthcare used as a political football. Medical decisions are for patients and doctors, not politicians. Read more »\nThank you for electing me as your new MP! 5 July 2024 / 23 September 2024 by Stewart Christie Thank you from the bottom of my heart to everyone in Brighton who has put their trust in me and the Green Party. This is a very special city, and together we’ve made history again. I promise to work hard as your new Green MP and make sure your voices are heard in Parliament. You […] Read more »\nSteve Coogan endorses Siân Berry in Brighton Pavilion 24 June 2024 by Stewart Christie Academy award nominated actor, comedian, and screenwriter Steve Coogan has today endorsed Siân Berry’s candidacy for Brighton Pavilion. Meeting a crowd of supporters in the Hanover area of the city today, Steve, who used to live in Brighton and still lives locally, said: “Caroline Lucas did a great job for the City and in Parliament. […] Read more »\nThe Women’s Equality Party endorses Siân as candidate in Brighton Pavilion. 20 June 2024 by Stewart Christie This week the Women’s Equality Party and the Green Party announced a shared vision for a green and caring economy. Both parties are feminist and inclusive, and both have a strong culture of listening and working in practical ways with the many campaigns and grassroots groups supporting women in our communities. As part of this, […] Read more »\nSiân Berry calls for election candidates to agree to a clean campaign promise 10 June 2024 / 10 June 2024 by Sian Berry The Green Party MP candidate for Brighton Pavilion today issued a challenge to all other candidates to sign up to a Clean Campaign Promise. Siân Berry said: “Now we have the final list of people standing, I would like to challenge all the other candidates in Brighton Pavilion to agree to a Clean Campaign Promise […] Read more »\nSiân Berry, Green MP candidate for Brighton Pavilion, intervenes on L3 Harris 3 June 2024 / 3 June 2024 by Stewart Christie The application for a controversial weapons factory in Brighton run by L3 Harris will be considered later this week. The manufacturing company is applying to retain a temporary extension to their premises in Home Farm Road. Many hundreds of local people have objected to the plans because the factory is thought to supply bomb racks […] Read more »\nMy letter opposing Brighton’s L3 Harris weapons factory 2 June 2024 / 23 September 2024 by Sian Berry I wrote to Brighton and Hove’s planning committee asking them to vote down the planing permission for the expansion of the L3 Harris factor in Brighton. Read the letter here: https://sianberry.org.uk/wp-content/uploads/sites/248/2024/06/24_06_02_SB_L3Harris_objection_letter.pdf Read more »\nGreens Welcome General Election and Will Campaign Hard to Retain Brighton Pavilion 23 May 2024 / 4 June 2024 by Stewart Christie The Green Party welcomes today’s announcement of a general election as the chance for voters to choose hope, respect and practical solutions to the crises facing the country. Brighton Pavilion parliamentary candidate Siân Berry said: “This isn’t a moment too soon. We have the policies, we are ready, and want as much as anyone to […] Read more »\nSiân Berry joined by climate youth movement in Green campaign package reveal for 2024 General Election 10 February 2024 / 4 June 2024 by Stewart Christie 10th February 2024 Siân Berry will reveal what voters in Brighton Pavilion have said they want from their next Green MP at an event held on Feb 10th 2024. The evening will be hosted by Zack Polanski, Deputy Leader of the Green Party, and also speaking is current MP for Brighton Pavilion, Caroline Lucas. Special […] Read more »\nSiân Berry Attends 100th year Anniversary Celebration for Patcham Memorial Hall 3 February 2024 / 4 June 2024 by Stewart Christie 3rd February 2024 Siân Berry, Green MP candidate for Brighton Pavilion, has shown her support for Patcham Memorial Hall and all community spaces through attendance this morning of the centenary celebrations for the hall. Today, Saturday the 3rd of February, Siân joined local residents of Patcham to celebrate the hall’s opening 100 years prior, on […] Read more »",
  "https_sianberry_org_uk_/https_sianberry_org_uk_author_victoria_page_2/content_41.html": "19 December 2024 / 19 December 2024 by victoria\nResponding to the Government’s announcement* that it would not be offering financial compensation to women affected by changes to the state pension age, Siân Berry MP for Brighton Pavilion said: “This is a very harsh decision, admitting wrongdoing but offering a bitter dose of nothing to a generation of women, caught out by this, who […]\nRead more »",
  "https_sianberry_org_uk_/https_sianberry_org_uk_author_matttraini_page_2/content_40.html": "8 October 2024 / 10 December 2024 by matttraini\nI’ve working with Alphabet, a brilliant grassroots music venue in my constituency, which has raised concerns about a planning application to develop a site next to the venue. The concerns being raised are due to the proximity of the site to this popular venue and the potential risk of noise complaints this could create – […]\nRead more »\n1 October 2024 by matttraini\nAlongside my Green MP colleagues, I have written to the Department for Environment and Rural Affairs to urge immediate action to end the continued legality of snares in England. Many of our constituents have brought this issue to our attention through the campaign group Animal Aid. Read the letter in full here:\n1 October 2024 / 17 October 2024 by matttraini\nEllie Chowns MP wrote on behalf of Green MPs about the case of Jagtar Singh Johal – a British citizen who has been detained in India since 2017. See her letter and the Secretary of State’s response below.\n20 September 2024 / 23 September 2024 by matttraini\nI have made calls for new action to reduce the harm caused by gambling in the city. My proposals were sent in response to the consultation on Brighton and Hove City Council’s draft Gambling Policy for 2025-27. In my submission, I requested a meeting with local councillors to discuss possible areas of joint work and proposed a range […]\n9 September 2024 / 3 October 2024 by matttraini\nFire risk assessments (FRAs) should be available and accessible to tenants but at present Brighton and Hove City Council does not publish copies of FRAs online. I’ve raised this with the Chief Executive of the council and Cabinet Member, Housing and New Homes. Read my letter below:\n28 August 2024 / 3 October 2024 by matttraini\nSent by email to Cllr Gill Williams, Deputy Leader and Cabinet Member for Housing and New Homes. Dear Gill, I hope that you are well. I’m writing regarding Acorn’s Boot the Bailiff campaign to ask that Brighton and Hove City Council commits to reviewing its bailiff contract and sets a goal of dramatically reducing its use of bailiffs […]\n26 July 2024 / 17 October 2024 by matttraini\nSian Berry and the group of Green MPs have written to the Chancellor, Rachel Reeves, ahead of the budget asking for fairer taxes on the most wealthy, which could raise up to £50 billion a year towards the NHS, schools and local authorities’",
  "https_sianberry_org_uk_/https_sianberry_org_uk_join/content_3.html": "I provide regular updates on social media, in newsletters through your door and by email to constituents in Brighton Pavilion.\nSign up here to hear from me by email.\nI will send messages no more than once at week, even at election time!\n#mc_embed_signup{background:#fff; false;clear:left; font:14px Helvetica,Arial,sans-serif; width: 600px;}\n/* Add your own Mailchimp form style overrides in your site stylesheet or in this style block.\nWe recommend moving this block and the preceding CSS link to the HEAD of your HTML file. */\n(function($) {window.fnames = new Array(); window.ftypes = new Array();fnames[0]=’EMAIL’;ftypes[0]=’email’;fnames[1]=’FNAME’;ftypes[1]=’text’;fnames[2]=’LNAME’;ftypes[2]=’text’;fnames[3]=’ADDRESS’;ftypes[3]=’address’;fnames[4]=’PHONE’;ftypes[4]=’phone’;fnames[5]=’BIRTHDAY’;ftypes[5]=’birthday’;fnames[6]=’COMPANY’;ftypes[6]=’text’;}(jQuery));var $mcj = jQuery.noConflict(true);\nSign up to hear about my work\n* indicates required\nAlbaniaAlgeriaAndorraAngolaArgentinaArmeniaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBosnia and HerzegovinaBotswanaBrazilBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaColombiaCongoCroatiaCyprusCzech RepublicDenmarkDjiboutiEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFijiFinlandFranceGabonGambiaGeorgiaGermanyGhanaGreeceGuamGuineaGuinea-BissauGuyanaHondurasHong KongHungaryIcelandIndiaIndonesiaIrelandIsraelItalyJapanJordanKazakhstanKenyaKuwaitKyrgyzstanLao People’s Democratic RepublicLatviaLebanonLesothoLiberiaLiechtensteinLithuaniaLuxembourgMacedoniaMadagascarMalawiMalaysiaMaldivesMaliMaltaMauritaniaMexicoMoldovaMonacoMongoliaMoroccoMozambiqueNamibiaNepalNetherlandsNetherlands AntillesNew ZealandNicaraguaNigerNigeriaNorwayOmanPakistanPanamaParaguayPeruPhilippinesPolandPortugalQatarReunionRomaniaRussiaRwandaSamoa (Independent)Saudi ArabiaSenegalSeychellesSierra LeoneSingaporeSlovakiaSloveniaSomaliaSouth AfricaSouth KoreaSpainSri LankaSurinameSwazilandSwedenSwitzerlandTaiwanTanzaniaThailandTogoTunisiaTurkiyeTurkmenistanUgandaUkraineUnited Arab EmiratesUruguayUSAUzbekistanVatican City State (Holy See)VenezuelaVietnamVirgin Islands (British)YemenZambiaZimbabweAntigua And BarbudaAnguillaAmerican SamoaArubaBrunei DarussalamBouvet IslandCook IslandsChristmas IslandDominican RepublicWestern SaharaFalkland IslandsFaroe IslandsGrenadaFrench GuianaGibraltarGreenlandGuadeloupeGuatemalaHaitiJamaicaKiribatiComorosSaint Kitts and NevisSaint LuciaMarshall IslandsMacauMartiniqueMauritiusNew CaledoniaNorfolk IslandNauruNiuePapua New GuineaPitcairnPalauSolomon IslandsSvalbard and Jan Mayen IslandsSan MarinoTongaTimor-LesteTrinidad and TobagoTuvaluSaint Vincent and the GrenadinesVirgin Islands (U.S.)VanuatuMayotteMyanmarSao Tome and PrincipeSouth Georgia and the South Sandwich IslandsTajikistanUnited KingdomCosta RicaGuernseyNorth KoreaAfghanistanCote D’IvoireCubaFrench PolynesiaIranIraqLibyaPalestineSyriaAaland IslandsTurks & Caicos IslandsJersey (Channel Islands)DominicaMontenegroSudanMontserratCuracaoSint MaartenSouth SudanRepublic of KosovoCongo, Democratic Republic of theIsle of ManSaint MartinBonaire, Saint Eustatius and SabaSerbia",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_09_09_my-letter-asking-for-fire-risk-assessments-to-be-made-public-for-council-tenants/content_32.html": "Fire risk assessments (FRAs) should be available and accessible to tenants but at present Brighton and Hove City Council does not publish copies of FRAs online.\nI’ve raised this with the Chief Executive of the council and Cabinet Member, Housing and New Homes.\nRead my letter below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_category_publication/content_54.html": "14 April 2025 / 14 April 2025 by matttraini\nFar too frequently, postal deliveries in my Brighton Pavilion constituency are very poor, andthe unreliable service means too many of my constituents don’t receive important post intime, such as medical appointment letters, benefit decisions, and legal documents. See my submission to Ofcom’s Universal Service Obligation consultation below:\nRead more »\n25 March 2025 / 26 March 2025 by victoria\nAhead of the Equality Impact Assessment of the Government’s Green Paper on welfare reform, Siân Berry MP has written to Secretary of State for Work and Pensions, Liz Kendall setting out her concerns on the planned proposals. Read Siân’s letter below. The Rt Hon Liz Kendall MPSecretary of State for Work and PensionsBy Email Dear […]\n14 March 2025 / 14 March 2025 by victoria\nAhead of the upcoming Spring Statement and Green Paper on welfare, I have written to every Labour MP asking them to oppose strongly and vote against any proposed cuts to welfare benefits, which are rumoured to be as deep as £6 billion. Read my full letter below.\n19 February 2025 / 19 February 2025 by matttraini\nAs the Member of Parliament for Brighton Pavilion I have written with my comments on Brighton and Hove City Council’s consultation on secondary school admission arrangements. See my full submission below.\nWith my fellow Green MPs, I have written a formal submission to the 2025 Spending Review, calling on the Government to take a long-term perspective on departmental spending and resource allocation. Our proposals cover Climate and Nature, transport, restoring public services and housing, including grants to support building social homes and to help councils buy […]\n23 January 2025 / 23 January 2025 by matttraini\nI’m calling on the Government to create a more compassionate and supportive social security system, rather than one that pushes disadvantaged people further into hardship. My full letter below:\nI am concerned that many pensioners will be unknowingly pushed into paying income tax and face unexpected tax bills, especially given that the personal tax allowance is frozen at £12,570 until 2028 while the state pension is set to rise by 8.5 per cent in April 2024. Read my full letter below:\n18 December 2024 / 18 December 2024 by matttraini\nAs the MP for Brighton Pavilion, I have made a representation regarding the appeal: APP/Q1445/W/24/3355883 Emblem House Home Farm Business Centre, Hone Farm Road Brighton BN1 9HU. This relates to L3 Harris Release and Integrated Solutions Ltd (previously known as EDO MBM). This is a business that is currently potentially complicit in the violation of […]\n27 November 2024 / 27 November 2024 by matttraini\nI have written to regarding the Secretary of State about the Government’s recent proposals in the Autumn budget to give Department for Work and Pensions (DWP) investigators new ‘search and seizure’ powers, via the Fraud, Error and Debt Bill. This is in addition to measures which allow for surveillance of the bank accounts of those who claim benefits, including Disabled people. I have received […]\n26 November 2024 / 26 November 2024 by matttraini\nI will be voting to progress the Terminally Ill Adults (End of Life) Bill on Friday 29 November. I have received a very large number of emails, letters and postcards about this issue from constituents, and I have been really touched by how many people have told me about their own personal experience of loved […]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_03_14_writing-to-all-labour-mps-urging-them-to-vote-against-cruel-welfare-cuts/content_39.html": "Green MP Siân Berry has written to every Labour MP urging them to vote against the government’s planned cuts to welfare spending, highlighting the “catastrophic impact” the cuts would have on disabled people. [1]\nFigures from Scope this week suggested that the proposed changes will push an added 700,000 disabled households into poverty, as Starmer’s claim that “if you can work, you should work” prompting comparisons with the previous Conservative Government’s attitude to welfare.\nIn her letter, Siân Berry reminded Labour MPs that those in receipt of health-related benefits already face inordinate hardships, with 50 per cent of people claiming Universal Credit who have limited capability for work are unable to heat their homes or pay their bills, or have low food security.\nShe wrote: “I know you didn’t campaign for this, and that you stood up at the election for a welfare system based on dignity and respect. Like me, I expect you feel alarmed at the rhetoric coming from the Government that is instead scapegoating disabled people. Pushing people who are in need into deeper poverty will do nothing to address the root issues that lead to welfare claims, namely housing insecurity, poor quality jobs, huge wage inequality and a soaring mental health crisis.”\nOn Monday, the Green MPs will put forward a motion opposing the cuts, and in her letter Sian Berry urged all Labour MPs to back the motion. [2]\nSiân Berry, Green MP for Brighton Pavilion, said:\n“This Government has a clear choice to make. It can continue the Conservative and New Labour legacy of shaming those in need, or it can address the issues that are widening inequality in our country; record high rents, food insecurity, poor-quality jobs and a billionaire class that avoids paying its fair share.\n“Cutting lifeline benefits for disabled people is not what Labour MPs were elected to do. People were promised ‘change’ and instead face cuts that even George Osborne considered a step too far.\n“Whatever the Prime Minister may say, there is simply no moral case for pushing more disabled households further into poverty. And I am pleading with my colleagues across the House, who I know want fiercely to protect their constituents, to take a stand against these unnecessary and cruel cuts.”\nEnds\n- Read the full letter to Labour MPs\n- Read the Early Day Motion",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_12_19_response-to-the-rejection-of-compensation-for-waspi-women/content_21.html": "Responding to the Government’s announcement* that it would not be offering financial compensation to women affected by changes to the state pension age, Siân Berry MP for Brighton Pavilion said:\n“This is a very harsh decision, admitting wrongdoing but offering a bitter dose of nothing to a generation of women, caught out by this, who faced so many hurdles and prejudices in respect of their careers and earnings.\n“I have so much respect for the brave WASPI women campaigners who, for nearly a decade, have campaigned hard on behalf of millions who were let down by this maladministration, just to be let down again today.\n“The Government should reconsider this decision and look at how it can also do more to help women born in the 1950s win the same security in retirement as enjoyed by their male counterparts.”\n*Response to PHSO report on communication of changes to women’s State Pension age [https://www.gov.uk/government/news/response-to-phso-report-on-communication-of-changes-to-womens-state-pension-age]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_06_20_the-womens-equality-party-endorses-sian-as-candidate-in-brighton-pavilion/content_45.html": "This week the Women’s Equality Party and the Green Party announced a shared vision for a green and caring economy.\nBoth parties are feminist and inclusive, and both have a strong culture of listening and working in practical ways with the many campaigns and grassroots groups supporting women in our communities.\nAs part of this, the Women’s Equality Party has endorsed Siân as candidate in Brighton Pavilion.\nBoth parties have set out their own models to achieve this vision in their respective manifestos and have their own candidates contesting the general election and championing their policies.\nCommenting on the endorsement, Siân said:\n“We agree that the challenges we face of discrimination, austerity, and so many policies that fail to take the specific needs of more than half our population into account, need mutual respect and cooperation between likeminded allies more than ever.\n“It’s vital that women’s voices are heard loud and clear under a new Labour government and all the ideas, issues and values our parties have in common are a key reason that elected Greens can be strong and independent representatives of these values, working with WEP members.\n“I am so grateful for Mandu, Catherine, and Sandi’s support in this constituency, and I look forward to closely working with WEP and its members to make sure their voices continue to be a force within Parliament after 4 July. In addition, I am pleased to be able to pledge that I and other Green MPs will join them to push for universal free childcare to be delivered in the lifetime of the new Parliament.\n“It makes no sense to deny government investment to truly comprehensive childcare for every family. In contrast, choosing to support childcare is choosing to support a stronger economy, one which allows every woman to realise our potential and contribute our experiences and skills to a better society.”\nCo-founder of the Women’s Equality Party, Sandi Toksvig, said:\n“I am thrilled to set out our joint vision for a green, caring economy. Cross-party collaboration is in the very fabric of the Women’s Equality Party and it is impossible, and undesirable, to separate our parties’ fights for gender equality and climate justice. So we thought we’d simply bring them together instead. The policies we need to push equality forwards are also the policies that will deliver urgent change to tackle the climate crisis. Investment in social care, childcare and social security would create some of the lowest carbon jobs in the world and transform our economy for women.”\nCo-founder and President of the Women’s Equality Party, Catherine Mayer, said:\n“A government minister last week warned voters against granting Labour a supermajority. While a Tory exit can’t come soon enough, change to a Labour-led government won’t be enough on its own. The issues that are the lifeblood and focus of the Women’s Equality Party and the Greens are far too urgent to be left to some unspecified point in the future. We need people like Sian Berry in Parliament to push Labour for transformative politics. We are delighted she supports our flagship policy of universal free childcare and that together with her party we have a shared and vital policy platform.\n“Caroline Lucas’s voice has had a disproportionate impact during her time in Westminster, on climate change and many other issues. The Women’s Equality Party wants to see Sian continue and extend Caroline’s legacy and challenge the next government to do more and more imaginatively, so we are backing her in Brighton Pavilion.”\n-ends-\nHere is some press coverage of the meeting where WEPs endorsement was discussed:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_03_06_1380/content_12.html": "| Responding to the news that the Justice Secretary will reject recommendations by the Sentencing Council to strengthen the need for pre-sentence reports for judges, Siân Berry Green MP for Brighton Pavilion said: |\n“Failure to implement these changes would be a serious mistake, causing genuine harm to women, families and young people for whom these new recommendations will create much safer sentencing.\n“Contrary to reporting, nowhere does the guidance focus primarily on ethnicity. Instead, the guidance, based on strong evidence, helps improve sentencing of women, pregnant people, parents, and young adults, for whom custodial sentences do huge amounts of harm including to their loved ones and wider society.\n“Ethnicity and other protected characteristics are mentioned simply so that judges are reminded to consider unconscious bias and that the personal circumstances of offenders may be different than assumed. Bowing to the opposition’s ridiculous accusation of ‘two tier justice’ clearly serves to divide people when we all want to build a genuinely fair and effective justice system.”\nENDS",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_12_18_my-submission-to-the-planning-inspectorate-regarding-l3-harris-release-and-integrated-solutions-ltd/content_34.html": "As the MP for Brighton Pavilion, I have made a representation regarding the appeal: APP/Q1445/W/24/3355883 Emblem House Home Farm Business Centre, Hone Farm Road Brighton BN1 9HU.\nThis relates to L3 Harris Release and Integrated Solutions Ltd (previously known as EDO MBM). This is a business that is currently potentially complicit in the violation of human rights, resulting in misery and death in global conflicts, and it cannot continue to be welcome in our city.\nConstituents and campaigners are calling for the Inspectorate to hold a public hearing about this case and, given the level of local concern about the factory’s presence in the city, I agree this would be an important exercise in openness and transparency.\nMy full submission below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_01_09_brighton-pavilion-mp-wins-cross-party-support-for-national-pesticide-ban/content_50.html": "Green MP for Brighton Pavilion Siân Berry has gained cross party support for a bill which would force local authorities to phase out the use of harmful pesticides in public places.\nAn Early Day Motion (EDM) tabled today (9 January), calls on the Government to pass the Plant Protection Products (Prohibition on Public Sector Use) Bill, which she introduced as a Private Members Bill to Parliament in October.\nSupported by Labour, Liberal Democrat, Plaid Cymru and Independent MPs, the EDM asks the Government to act and recognise that the most-used pesticide by local authorities to manage unwanted vegetation, glyphosate, carries health risks.\nIn Siân’s constituency, Brighton and Hove City Council has reinstated the use of toxic glyphosate in some areas, five years after councillors pledged to end its use, and many councils continue to spray the chemical onto paths and pavements in public spaces such as parks and housing estates.\nOver 100 local authorities across the UK have already chosen to end or significantly reduce their use of pesticides, the overuse of which destroys areas used by birds, insects, bees, and hedgehogs for food and shelter. The run-off of pesticides from pavements can contaminate water courses and damage aquatic life.\nSiân Berry, MP for Brighton Pavilion, said: “More must be done to stop councils using toxic chemicals in public places, which are a danger to people, pets and children using these spaces, and to the wider environment. There are alternatives and many councils are succeeding, but too many are failing to take action.\n“Across my constituency, resident groups are working hard to remove any plants causing problems in order to stop the council from using this chemical in their neighbourhoods, but the earlier ban needs to be reinstated and replicated across the country. I’m pleased to have won the support of parliamentary colleagues who agree with us that we should be defending, not poisoning our wildlife.\n“My Bill would stop the use of pesticides in public spaces, and I hope to see it passed so that every village, town and city across England will be protected from the harmful effects of these chemicals.”\nNick Mole, UK Policy Manager at PAN UK, said: “There’s absolutely no justification for using pesticides in our towns and cities. By ending the use of pesticides in public spaces, we will reduce the exposure of millions of UK citizens to potentially harmful chemicals and protect our precious urban biodiversity. We are delighted that Siân is championing this issue in parliament, building on the incredible work of thousands of dedicated local campaigners across the UK who have successfully lobbied their councils to go pesticide-free. It’s about time this policy was enacted at a national level.”\nMPs who have so far supported the Early Day Motion are Nadia Whittome MP for Nottingham East (Labour), Liz Saville Roberts MP for Dwyfor Meirionnydd (Plaid Cymru), Wera Hobhouse MP for Bath (Liberal Democrat), Ian Byrne MP for Liverpool West Derby (Independent) and Siân is urging people across the country to write to their MPs to add their names.\nENDS\nFor further information or to arrange media interviews, please contact [email protected]\n- Read the full Early Day Motion\n- ‘The run-off of pesticides from pavements can contaminate water courses and damage aquatic life.’ – Pesticide Action Network.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_news-all/content_64.html": "My Submission to Ofcom’s Universal Service Obligation consultation About Royal Mail 14 April 2025 / 14 April 2025 by matttraini Far too frequently, postal deliveries in my Brighton Pavilion constituency are very poor, andthe unreliable service means too many of my constituents don’t receive important post intime, such as medical appointment letters, benefit decisions, and legal documents. See my submission to Ofcom’s Universal Service Obligation consultation below: Read more »\nLetter to Liz Kendall about proposed welfare cuts 25 March 2025 / 26 March 2025 by victoria Ahead of the Equality Impact Assessment of the Government’s Green Paper on welfare reform, Siân Berry MP has written to Secretary of State for Work and Pensions, Liz Kendall setting out her concerns on the planned proposals. Read Siân’s letter below. The Rt Hon Liz Kendall MPSecretary of State for Work and PensionsBy Email Dear […] Read more »\nReacting to Labour’s Green Paper on welfare reform 18 March 2025 / 18 March 2025 by victoria Responding to the Government’s Green Paper on welfare reform, Green MP Siân Berry said: “I’ve heard nothing today that reassures me the Government will stop scapegoating and stigmatising those in need, while impoverishing them to the tune of £5 billion. Young and disabled people should have the support and backing of the Government but instead […] Read more »\nLetter to Labour MPs on proposed cuts to welfare benefits 14 March 2025 / 14 March 2025 by victoria Ahead of the upcoming Spring Statement and Green Paper on welfare, I have written to every Labour MP asking them to oppose strongly and vote against any proposed cuts to welfare benefits, which are rumoured to be as deep as £6 billion. Read my full letter below. Read more »\nWriting to all Labour MPs urging them to vote against cruel welfare cuts 14 March 2025 / 17 March 2025 by victoria Green MP Siân Berry has written to every Labour MP urging them to vote against the government’s planned cuts to welfare spending, highlighting the “catastrophic impact” the cuts would have on disabled people. [1] Figures from Scope this week suggested that the proposed changes will push an added 700,000 disabled households into poverty, as Starmer’s […] Read more »\nDefending new Sentencing Council guidelines 6 March 2025 / 12 March 2025 by victoria Responding to the news that the Justice Secretary will reject recommendations by the Sentencing Council to strengthen the need for pre-sentence reports for judges, Siân Berry Green MP for Brighton Pavilion said: “Failure to implement these changes would be a serious mistake, causing genuine harm to women, families and young people for whom these new […] Read more »\nLabour should listen to the public on Gatwick expansion 27 February 2025 / 12 March 2025 by victoria Responding to the Transport Secretary’s decision to pursue a positive decision for Gatwick Airport to bring its northern terminal into constant use, (1) Siân Berry Green MP for Brighton Pavilion said: “The Labour government is trashing its climate credentials one absurd decision at a time. Only one day after receiving critical advice from its own […] Read more »\nMy comments on Brighton and Hove City Council’s consultation on school admission arrangements. 19 February 2025 / 19 February 2025 by matttraini As the Member of Parliament for Brighton Pavilion I have written with my comments on Brighton and Hove City Council’s consultation on secondary school admission arrangements. See my full submission below. Read more »\nGreen MPs spending review submission 19 February 2025 / 19 February 2025 by matttraini With my fellow Green MPs, I have written a formal submission to the 2025 Spending Review, calling on the Government to take a long-term perspective on departmental spending and resource allocation. Our proposals cover Climate and Nature, transport, restoring public services and housing, including grants to support building social homes and to help councils buy […] Read more »\nExpanding Heathrow in the face of a climate emergency is the definition of irresponsible 29 January 2025 / 12 March 2025 by victoria Responding to the news that Rachel Reeves is backing the expansion of Heathrow Airport, Green Party MP, Sian Berry said, “The Chancellor talked about the ‘costs of irresponsibility’ but expanding Heathrow in the face of a climate emergency is the definition of irresponsible.” “Worst still, we’re also expecting formal planning decisions from ministers on Gatwick and […] Read more »",
  "https_sianberry_org_uk_/https_sianberry_org_uk_category_news_page_2/content_20.html": "1 October 2024 by matttraini\nAlongside my Green MP colleagues, I have written to the Department for Environment and Rural Affairs to urge immediate action to end the continued legality of snares in England. Many of our constituents have brought this issue to our attention through the campaign group Animal Aid. Read the letter in full here:\nRead more »\n20 September 2024 / 23 September 2024 by matttraini\nI have made calls for new action to reduce the harm caused by gambling in the city. My proposals were sent in response to the consultation on Brighton and Hove City Council’s draft Gambling Policy for 2025-27. In my submission, I requested a meeting with local councillors to discuss possible areas of joint work and proposed a range […]\n9 September 2024 / 3 October 2024 by matttraini\nFire risk assessments (FRAs) should be available and accessible to tenants but at present Brighton and Hove City Council does not publish copies of FRAs online. I’ve raised this with the Chief Executive of the council and Cabinet Member, Housing and New Homes. Read my letter below:\n28 August 2024 / 3 October 2024 by matttraini\nSent by email to Cllr Gill Williams, Deputy Leader and Cabinet Member for Housing and New Homes. Dear Gill, I hope that you are well. I’m writing regarding Acorn’s Boot the Bailiff campaign to ask that Brighton and Hove City Council commits to reviewing its bailiff contract and sets a goal of dramatically reducing its use of bailiffs […]\n26 July 2024 / 17 October 2024 by matttraini\nSian Berry and the group of Green MPs have written to the Chancellor, Rachel Reeves, ahead of the budget asking for fairer taxes on the most wealthy, which could raise up to £50 billion a year towards the NHS, schools and local authorities’\n23 July 2024 / 23 September 2024 by Green Party Admin\nThe Green Party is calling for the next government to save money and save lives by: Making the HIV prevention pill (“PrEP”) available beyond specialist sexual health services, such as in GP services and pharmacies\n5 July 2024 / 23 September 2024 by Stewart Christie\nThank you from the bottom of my heart to everyone in Brighton who has put their trust in me and the Green Party. This is a very special city, and together we’ve made history again. I promise to work hard as your new Green MP and make sure your voices are heard in Parliament. You […]\n24 June 2024 by Stewart Christie\nAcademy award nominated actor, comedian, and screenwriter Steve Coogan has today endorsed Siân Berry’s candidacy for Brighton Pavilion. Meeting a crowd of supporters in the Hanover area of the city today, Steve, who used to live in Brighton and still lives locally, said: “Caroline Lucas did a great job for the City and in Parliament. […]\n20 June 2024 by Stewart Christie\nThis week the Women’s Equality Party and the Green Party announced a shared vision for a green and caring economy. Both parties are feminist and inclusive, and both have a strong culture of listening and working in practical ways with the many campaigns and grassroots groups supporting women in our communities. As part of this, […]\n10 June 2024 / 10 June 2024 by Sian Berry\nThe Green Party MP candidate for Brighton Pavilion today issued a challenge to all other candidates to sign up to a Clean Campaign Promise. Siân Berry said: “Now we have the final list of people standing, I would like to challenge all the other candidates in Brighton Pavilion to agree to a Clean Campaign Promise […]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_10_01_letter-to-the-foreign-secretary-about-jagtar-singh-johal/content_49.html": "Ellie Chowns MP wrote on behalf of Green MPs about the case of Jagtar Singh Johal – a British citizen who has been detained in India since 2017.\nSee her letter and the Secretary of State’s response below.\nEllie Chowns MP wrote on behalf of Green MPs about the case of Jagtar Singh Johal – a British citizen who has been detained in India since 2017.\nSee her letter and the Secretary of State’s response below.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_02_19_green-mps-spending-review-submission/content_13.html": "With my fellow Green MPs, I have written a formal submission to the 2025 Spending Review, calling on the Government to take a long-term perspective on departmental spending and resource allocation.\nOur proposals cover Climate and Nature, transport, restoring public services and housing, including grants to support building social homes and to help councils buy from the existing stock.\nSee our joint letter below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_thankyou/content_37.html": "Thank you from the bottom of my heart to everyone in Brighton who has put their trust in me and the Green Party. This is a very special city, and together we’ve made history again.\nI promise to work hard as your new Green MP and make sure your voices are heard in Parliament. You have demanded action on the NHS, the water companies, housing, and the climate emergency, and I will be there to make sure the new Government delivers on all these priorities.\nI am infinitely grateful to Caroline Lucas for her support throughout the campaign, and for being such a model of how to be an effective MP for Brighton and the country.\nIt’s hard to express my delight at joining three other newly-elected Green MPs, Carla Denyer, Adrian Ramsay and Ellie Chowns, I know they will all be brilliant.\nI will make sure the Government takes up the good ideas in our Green manifesto without delay.",
  "https_sianberry_org_uk_/https_sianberry_org_uk/content_1.html": "Recent speeches, debates, and oral and written questions in the House of Commons\nIf you need help with a council service or issue\nMy latest news – more updates here\n- Reacting to Labour’s Green Paper on welfare reform\n- Writing to all Labour MPs urging them to vote against cruel welfare cuts\n- Defending new Sentencing Council guidelines\n- Labour should listen to the public on Gatwick expansion\n- Expanding Heathrow in the face of a climate emergency is the definition of irresponsible\n- Listen to science not the aviation lobby\nMy latest publications – see more letters and reports here\n- My Submission to Ofcom’s Universal Service Obligation consultation About Royal Mail\n- Letter to Liz Kendall about proposed welfare cuts\n- Letter to Labour MPs on proposed cuts to welfare benefits\n- My comments on Brighton and Hove City Council’s consultation on school admission arrangements.\n- Green MPs spending review submission\n- Letter to Minister of State for Social Security and Disability on the Work Capability Assessment\nMy recent work in Parliament – see more entries here\n- I hope the hon. Member was listening to my speech when I talked about the harm that might be caused by the delay in bringing in the really excellent parts […]\n- I associate myself with every single thing that the Mother of the House has just said, because I could not possibly live up to it. I genuinely believe that this […]\n- This is—\n- Yes, of course.\n- To return to the intervention from the hon. Member for Hinckley and Bosworth (Dr Evans), it is difficult for some to realise that with these guidelines, the definition of “normal”…\n- To ask the Secretary of State for the Home Department, pursuant to the Answer of 4 March 2025 to Question 33251 on Domestic Abuse: Parents, when she plans to publish […]\n- There is a lot I could say, but I will mainly just commend to Members my new clause 7, which would remove official error from the most punitive measures in […]\n- The independent person is required to produce an annual report on the use of the new powers, which, as the Minister has just laid out, are quite extensive. However, there […]\n- To ask the Secretary of State for Transport, pursuant to the Answer of 13 February 2025 to Question 29617 on Heathrow Airport, if she will update her Department's Appraisal of […]\n- To ask the Secretary of State for Environment, Food and Rural Affairs, what steps he is taking to monitor the effective implementation of Government consultation principles on the needs of […]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_category_publication_page_3/content_65.html": "19 July 2024 / 23 September 2024 by Sian Berry\nToday, Carla Denyer MP and I wrote to the Secretary of State for Health and Social Care, Wes Streeting, expressing our serious concerns about his recent statement on puberty blockers. Trans young people need support, not to have their healthcare used as a political football. Medical decisions are for patients and doctors, not politicians.\nRead more »\n2 June 2024 / 23 September 2024 by Sian Berry\nI wrote to Brighton and Hove’s planning committee asking them to vote down the planing permission for the expansion of the L3 Harris factor in Brighton. Read the letter here: https://sianberry.org.uk/wp-content/uploads/sites/248/2024/06/24_06_02_SB_L3Harris_objection_letter.pdf",
  "https_sianberry_org_uk_/https_sianberry_org_uk_sian-berrys-letter-on-l3-harris/content_57.html": "Skip to content\nSkip to footer\nSiân Berry MP\nMenu\nNews\nParliament\nPublications\nAbout Siân\nContact Siân\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nNews from Siân Berry MP\nSiân Berry’s letter opposing Brighton’s L3 Harris weapons factory\nSiân Berry’s letter opposing Brighton’s L3 Harris weapons factory\n24_06_02_SB_L3Harris_objection_letter\nDownload\nTo top",
  "https_sianberry_org_uk_/https_sianberry_org_uk_contact-sian-as-a-constituent/content_2.html": "Drop us a line\nIf you live in Brighton Pavilion and need support or advice you can call, email or write any time:\nEmail and telephone: [email protected] or call 01273 201130\nPostal address: Siân Berry MP, House of Commons, London SW1A 0AA\n(Please note: Siân’s post is screened by Parliament’s security service which may cause a slight delay)\nSiân also holds weekly surgeries to speak directly with constituents, and you can book an appointment at one of these using the contact details above.\nQuestions about Government policy or national issues: The best way to communicate with Siân if you need help or have questions is by email, though we understand of course this option is not available for everyone.\n[email protected]\nWe will put a telephone number here as soon as we can.\n*** Please include your full postal address however you choose to get in touch. This will help Siân and her team respond to your enquiry. ***\nPRIVACY STATEMENT\nIf you write to, email or call Siân, personal information which you supply may be used in a number of ways. For example:\n· To help resolve a problem you have asked for help with\n· To keep you updated about an issue you have raised\n· To support democratic engagement and voter accountability\n· For statistical analysis\nWe do not collect or hold data on individuals that comes from any sources other than those which you have provided or which is provided in the course of following up a case or enquiry you have raised with Siân.\nYour personal details will not be shared or passed on to anyone else without your active consent. We will seek your permission first if, for example, you have asked Siân to help you resolve an immigration or housing matter and we need to contact the relevant authorities. If you are not a constituent your emails or letters may be passed to your own MP, in line with parliamentary protocol.\nEmails, letters and other communications you send to Siân may be seen by her case workers and/or the other staff who work for her.\nSiân keeps a record of your correspondence and information about anything you have raised with her on file. You have a right to make a request verbally or in writing that we delete any information we hold and we will respond within one month. You can find out more about this right here. You also have the right to request information about what data we hold on you and to receive a response within one month.\nWe will occasionally contact you proactively to update you on Siân’s work specifically on the issues you have raised with her. You can opt out of receiving these updates at any time by replying and putting “opt out” in the subject line. You may opt out from updates on a given issue at any point in the future in the same way. We will never send you unsolicited general updates or communications without your consent.\nYou have a right to complain to the Information Commissioner’s Office if you think there is a problem with the way we are handling your data. There’s more details here.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_08_07_letter-to-home-secretary/content_51.html": "I have written to the Home Secretary asking her a number of questions about the current wave of fascist violence on our streets.\nSpeaking in my role as the Green MP leading on crime and justice issues, I made a statement naming this problem as fascism and rooted in racism and Islamophobia and commending those in the areas targeted who have united peacefully against this hate. Greens across the country are supporting community leaders and individuals who are working to bring communities together in the face of attempts to inflame divisions.\nIn the letter, I call for immediate action to protect and support all those subject to fascist intimidation, and for action on those inciting the violence on social media, including politicians. I also call for investment in positive interventions to tackle fascism and the spread of far right ideology, including funding for community cohesion and to restore the massive loss of youth services under the last government.\nRead the letter in full here:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_latest-news/content_16.html": "For further information or to arrange media interviews with Siân, please contact [email protected]\n- Reacting to Labour’s Green Paper on welfare reformResponding to the Government’s Green Paper on welfare reform, Green MP Siân Berry said: “I’ve heard nothing today that reassures me the Government will stop scapegoating and stigmatising those in need, while impoverishing them to the tune of £5 billion. Young and disabled people should… Read more: Reacting to Labour’s Green Paper on welfare reform\n- Writing to all Labour MPs urging them to vote against cruel welfare cuts Green MP Siân Berry has written to every Labour MP urging them to vote against the government’s planned cuts to welfare spending, highlighting the “catastrophic impact” the cuts would have on disabled people. [1] Figures from Scope this week suggested that the proposed changes will… Read more: Writing to all Labour MPs urging them to vote against cruel welfare cuts\n- Defending new Sentencing Council guidelinesResponding to the news that the Justice Secretary will reject recommendations by the Sentencing Council to strengthen the need for pre-sentence reports for judges, Siân Berry Green MP for Brighton Pavilion said: “Failure to implement these changes would be a serious mistake, causing genuine harm… Read more: Defending new Sentencing Council guidelines\n- Labour should listen to the public on Gatwick expansionResponding to the Transport Secretary’s decision to pursue a positive decision for Gatwick Airport to bring its northern terminal into constant use, (1) Siân Berry Green MP for Brighton Pavilion said: “The Labour government is trashing its climate credentials one absurd decision at a time.… Read more: Labour should listen to the public on Gatwick expansion\n- Expanding Heathrow in the face of a climate emergency is the definition of irresponsibleResponding to the news that Rachel Reeves is backing the expansion of Heathrow Airport, Green Party MP, Sian Berry said, “The Chancellor talked about the ‘costs of irresponsibility’ but expanding Heathrow in the face of a climate emergency is the definition of irresponsible.” “Worst still, we’re… Read more: Expanding Heathrow in the face of a climate emergency is the definition of irresponsible\n- Listen to science not the aviation lobbyIn response to rumours that the Government may soon sign off expansion proposals for Luton, Gatwick and Heathrow Airports, Siân Berry, Green Party MP for Brighton Pavilion said: “We must ask who these decisions would be made for and why. Whose advice is the Government… Read more: Listen to science not the aviation lobby\n- Brighton Pavilion MP wins cross-party support for national pesticide ban Green MP for Brighton Pavilion Siân Berry has gained cross party support for a bill which would force local authorities to phase out the use of harmful pesticides in public places. An Early Day Motion (EDM) tabled today (9 January), calls on the Government to… Read more: Brighton Pavilion MP wins cross-party support for national pesticide ban\n- Save the bees!Siân joined Greenpeace UK to hand in a petition signed by over 1.6 million people, calling for a total ban onbee-killing neonicotinoid pesticides from Government. These toxic chemicals -one teaspoon can kill one billion bees – were banned across Europe in 2018, but continue to… Read more: Save the bees!\n- Response to the rejection of compensation for WASPI womenResponding to the Government’s announcement* that it would not be offering financial compensation to women affected by changes to the state pension age, Siân Berry MP for Brighton Pavilion said: “This is a very harsh decision, admitting wrongdoing but offering a bitter dose of nothing… Read more: Response to the rejection of compensation for WASPI women\n- Letter to the Chancellor ahead of the Government’s first BudgetAhead of the Budget I have written to the Chancellor with proposals for good value capital investments and revenue spending, based on needs I have identified from my own constituency in Brighton Pavilion. I’m asking for capital investment in homes and active travel and revenue… Read more: Letter to the Chancellor ahead of the Government’s first Budget",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_06_03_sian-berry-intervenes-on-l3-harris/content_56.html": "- Candidate urges committee to act ‘morally and ethically’ in objection to controversial application\n- Will be available for interview outside Hove Town Hall while joining demonstrators on Wednesday\nThe application for a controversial weapons factory in Brighton run by L3 Harris will be considered later this week. The manufacturing company is applying to retain a temporary extension to their premises in Home Farm Road.\nMany hundreds of local people have objected to the plans because the factory is thought to supply bomb racks for fighter jets that are used by the Israeli air force.\nSiân Berry, Green MP candidate for Brighton Pavilion – who has supported local campaigners and their petition which now has 1,300 signatures [1] – has written to members of Brighton and Hove’s planning committee urging them to reject the application [2]. In her letter, she said:\n“There are very credible grounds to conclude that the bomb racks and bomb release mechanisms L3 Harris manufactures for F-16 and F-35 aircraft have been in use by the Israeli Air Force in its assault on Gaza. Caroline Lucas, our former MP, has raised this issue in Parliament and received no response that indicates this is not the case.\n“I also believe that recent statements by prosecutors at the International Court of Justice mean that the prevention of further deaths in Gaza among the vulnerable civilian population is a duty on all of us, so we must all take action, wherever we are able, to stop the assault and prevent it continuing in future.\n“Acting to refuse this application would be in line with this duty. Morally and ethically, there should never be any weapons made in Brighton for illegal military actions, and you can make a difference in your decision this week.”\nThe letter lays out a summary of recently obtained information, namely, that:\n- Recent statements by prosecutors at the International Court of Justice mean that the prevention of further deaths in Gaza among the vulnerable civilian population is a duty on all of us, so we must all take action, wherever we are able, to stop the assault and prevent it continuing in future; and\n- There is a clear legal basis, as set out in the letter [the council] received last week from Professor Anna Stavrianakis at the University of Sussex, that the ultimate impacts of the continued use of this land for military weapon system manufacturing may be taken into account if you [the council], as a decision maker, consider them relevant.\nSiân Berry will be at Hove Town Hall to watch the committee meeting on Wed 5 June at 2 pm. A gathering of objectors is planned outside ahead of the meeting from 1 pm.\nSiân Berry says:\n“This business is currently potentially complicit in the violation of human rights, resulting in misery and death in global conflicts, and it cannot continue to be welcome in our city. This is why I will be with protestors outside Hove Town Hall on Tuesday to say no to this application.”\n-ends-\nFor further information or to arrange an interview with Sian outside Hove Town Hall: Charlie Norman [email protected]\nNotes to editor\n[1] Petition asking councillors to vote with their conscience and reject L3 Harris Planning Application BH2023/ 0323\n[2] The full letter written by Sian Berry to all members of Brighton and Hove Planning Committee is viewable here\n[3] All documents relating to the application can be viewed through the Brighton and Hove online Planning Register by searching application BH2023/03236. https://planningapps.brighton-hove.gov.uk/online-applications/",
  "https_sianberry_org_uk_/https_sianberry_org_uk_author_stewart-christie/content_48.html": "5 July 2024 / 23 September 2024 by Stewart Christie\nThank you from the bottom of my heart to everyone in Brighton who has put their trust in me and the Green Party. This is a very special city, and together we’ve made history again. I promise to work hard as your new Green MP and make sure your voices are heard in Parliament. You […]\nRead more »\n24 June 2024 by Stewart Christie\nAcademy award nominated actor, comedian, and screenwriter Steve Coogan has today endorsed Siân Berry’s candidacy for Brighton Pavilion. Meeting a crowd of supporters in the Hanover area of the city today, Steve, who used to live in Brighton and still lives locally, said: “Caroline Lucas did a great job for the City and in Parliament. […]\n20 June 2024 by Stewart Christie\nThis week the Women’s Equality Party and the Green Party announced a shared vision for a green and caring economy. Both parties are feminist and inclusive, and both have a strong culture of listening and working in practical ways with the many campaigns and grassroots groups supporting women in our communities. As part of this, […]\n3 June 2024 / 3 June 2024 by Stewart Christie\nThe application for a controversial weapons factory in Brighton run by L3 Harris will be considered later this week. The manufacturing company is applying to retain a temporary extension to their premises in Home Farm Road. Many hundreds of local people have objected to the plans because the factory is thought to supply bomb racks […]\n23 May 2024 / 4 June 2024 by Stewart Christie\nThe Green Party welcomes today’s announcement of a general election as the chance for voters to choose hope, respect and practical solutions to the crises facing the country. Brighton Pavilion parliamentary candidate Siân Berry said: “This isn’t a moment too soon. We have the policies, we are ready, and want as much as anyone to […]\n10 February 2024 / 4 June 2024 by Stewart Christie\n10th February 2024 Siân Berry will reveal what voters in Brighton Pavilion have said they want from their next Green MP at an event held on Feb 10th 2024. The evening will be hosted by Zack Polanski, Deputy Leader of the Green Party, and also speaking is current MP for Brighton Pavilion, Caroline Lucas. Special […]\n3 February 2024 / 4 June 2024 by Stewart Christie\n3rd February 2024 Siân Berry, Green MP candidate for Brighton Pavilion, has shown her support for Patcham Memorial Hall and all community spaces through attendance this morning of the centenary celebrations for the hall. Today, Saturday the 3rd of February, Siân joined local residents of Patcham to celebrate the hall’s opening 100 years prior, on […]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_02_03_sian-berry-attends-100th-year-anniversary-celebration-for-patcham-memorial-hall/content_53.html": "3rd February 2024\nSiân Berry, Green MP candidate for Brighton Pavilion, has shown her support for Patcham Memorial Hall and all community spaces through attendance this morning of the centenary celebrations for the hall.\nToday, Saturday the 3rd of February, Siân joined local residents of Patcham to celebrate the hall’s opening 100 years prior, on the 2nd of February 1924.\nPatcham Memorial Hall was opened by Colonel Campion, then MP for Lewes, after the local community raised £750 to build it. What was a great example of local fundraising efforts then, remains a vital part of the Patcham Community today.\nSiân Berry says:\nSiân said in her speech that Patcham Memorial Hall is at the heart of the Patcham community, and that we must celebrate and safeguard this space that has continued to bring people together for 100 years. She concluded by congratulating its trustees and adding best wishes for another century of being at the heart of the community as she cut the Hall’s 100th birthday cake.\n-ends-\nNotes to editor\n- The hall hosts a range of yoga and other exercise classes, the Women’s Institute, as Patcham was one of the WI’s first chapters in England. As well as the U3A (University of the Third Age) who actively use the hall weekly, alongside dance groups from Scottish Dance, French Dance to Jive Devotees. In addition, the Patcham community’s local residents utilise the space to celebrate their lives: from weddings and christenings to children’s birthday parties, Patcham Memorial Hall has been bringing people together for 100 years.",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_03_25_writing-to-liz-kendall-about-proposed-welfare-cuts/content_9.html": "Ahead of the Equality Impact Assessment of the Government’s Green Paper on welfare reform, Siân Berry MP has written to Secretary of State for Work and Pensions, Liz Kendall setting out her concerns on the planned proposals.\nRead Siân’s letter below.\nThe Rt Hon Liz Kendall MP\nSecretary of State for Work and Pensions\nBy Email\nDear Liz,\nI am writing with initial questions and concerns following the publication by your department of the Green Paper, Pathways to Work, which I believe will be harmful to Disabled people and those unable to work due to health concerns.\nWhen I asked a question in the House following the publication of the Green Paper, I stressed how vital it is for the voices of Disabled people to be reflected in any proposals for changes to Personal Independence Payments (PIP) and disability benefits. I asked for co-production of any reforms, and cited a powerful letter sent by 25 Disabled people’s groups and charities ahead of your statement, which begged for their views to be reflected in plans to fix the flaws in current welfare policies and processes, not just consultation as an afterthought.\nWith over 100 groups and charities having now signed this open letter, Ministers need to provide meaningful opportunities to engage for these hugely respected organisations and offer assurances that the Government is willing to amend the Green Paper proposals. An equality impact assessment (EIA) should have been published alongside the Green Paper. I understand it will be published this week and believe it will show significant negative\nimpacts on many young and Disabled people, as well as those with mental health issues.\nCould you set out a clear timeframe for the next steps?\nCould you give me concrete details of how and when you will talk with the signatories of the open letter and take steps towards the co-production of any welfare changes?\nIf the proposals are assessed as harmful to Disabled people, young people and those with mental health issues, could you confirm that the plans will not proceed?\nIn response to my question, you invited me to write to you with particular issues and concerns and offered a meeting with your ministers. I look forward to that meeting and will respond to the consultation once I have discussed the plans further with constituents and representative groups, but I would also like to provide some initial observations here.\n1. Young people\nThe context for any changes to how young people can claim benefits is very important. Young people have been let down by multiple failures of multiple previous governments, coupled with the legacy of disruption caused by the pandemic.\nChild and Adolescent Mental Health Services (CAMHS) is often impossible for children and young people to access, with figures from 2022-2023 revealing that 6,300 children waited over two years, with an average wait of more than three years before finally receiving treatment. This must be addressed before your Government makes any moves to remove vital financial support.\nI fear that the proposal to delay access to the health element of Universal Credit for those under the age of 22 will be very harmful to vulnerable young adults, preventing them from accessing the support they need to thrive. Could you confirm which organisations representing young people you will be engaging with and that, if the proposals are assessed by the planned consultation to be harmful to under 22’s, the plans will not\nproceed?\n2. Accessibility and engagement\nThe failure to publish the Green Paper in an accessible format at the same time as presenting plans to Parliament is concerning. This approach to accessibility is not good enough. Will you firmly commit to publishing any further information about welfare changes in formats that can be accessed by Disabled people from the start?\nWill you also set out what further steps you will take to enable and encourage individual Disabled people to respond to the consultation?\n3. Increased resources for advocacy and community advice services\nAfter 15 years of local authority austerity, including cost pressures on the third sector exacerbated by recent changes to National Insurance, advocacy support to help people complete benefit applications is becoming harder to access for many people.\nA leading advice charity in Brighton and Hove which helps Disabled people to access work and welfare benefits has explained to me that:\n“Employment and Advice services are cut to our knees. Year-on-year cuts in funding through local government, cuts in support services through central and local funding, and grant bodies moving away from advice support. This upcoming year we will need to reduce our staff again by half. We are currently only able to open three days a week, but the number of enquiries is higher than when we were open every day.”\nWill you confirm that, if and when changes are progressed, advice services will be given additional resources to cope with the likely increased demand for support and independent advice?\n4. Divisive and stigmatising language\nAll people, irrespective of their health and subsequent ability to work, have the right to feel hope, dignity and self-respect. There has been a significant volume of loaded language in the lead up to the publication of the Green Paper which has concerned me greatly.\nMinisters have a moral responsibility to not stoke division and tensions in our communities but, in recent weeks the language used has exacerbated stigma and fear. Accusations of people being ‘trapped’ on benefits and the ‘overdiagnosis’ of mental health issues, in my view serve to stigmatise those who struggle to work.\nInstead, we should be rebuilding confidence in our social security system. Welfare reform pushed through under a cuts agenda to reduce national spending by £5 billion will not rebuild this confidence.\nGoing forward, I acknowledge the current work capability assessment (WCA) for Universal Credit and Employment Support Allowance (ESA) is not fit for purpose, we do not suggest a do-nothing approach.\nThere are alternatives and many people have been clear that the Government could and should consider a simple wealth tax to provide the investment in people that is sorely needed. A 2 per cent tax on assets over £10 billion would raise £24 billion a year; a measure supported by 68 per cent of the public.\nThis popular and fair tax option must be on the table alongside other measures which would increase the income generated from those most able to contribute to the welfare of society, and I hope that you will advocate for it within Cabinet.\nI look forward to your response to my questions above and further clarity on the next steps\nfrom your department on these policies.\nYours sincerely,\nSiân Berry MP\nGreen Party, Brighton Pavilion",
  "https_sianberry_org_uk_/https_sianberry_org_uk_tag_pesticides/content_42.html": "Brighton Pavilion MP wins cross-party support for national pesticide ban 9 January 2025 / 10 January 2025 by victoria Green MP for Brighton Pavilion Siân Berry has gained cross party support for a bill which would force local authorities to phase out the use of harmful pesticides in public places. An Early Day Motion (EDM) tabled today (9 January), calls on the Government to pass the Plant Protection Products (Prohibition on Public Sector Use) […] Read more » pesticides",
  "https_sianberry_org_uk_/https_sianberry_org_uk_author_victoria/content_28.html": "25 March 2025 / 26 March 2025 by victoria\nAhead of the Equality Impact Assessment of the Government’s Green Paper on welfare reform, Siân Berry MP has written to Secretary of State for Work and Pensions, Liz Kendall setting out her concerns on the planned proposals. Read Siân’s letter below. The Rt Hon Liz Kendall MPSecretary of State for Work and PensionsBy Email Dear […]\nRead more »\n18 March 2025 / 18 March 2025 by victoria\nResponding to the Government’s Green Paper on welfare reform, Green MP Siân Berry said: “I’ve heard nothing today that reassures me the Government will stop scapegoating and stigmatising those in need, while impoverishing them to the tune of £5 billion. Young and disabled people should have the support and backing of the Government but instead […]\n14 March 2025 / 14 March 2025 by victoria\nAhead of the upcoming Spring Statement and Green Paper on welfare, I have written to every Labour MP asking them to oppose strongly and vote against any proposed cuts to welfare benefits, which are rumoured to be as deep as £6 billion. Read my full letter below.\n14 March 2025 / 17 March 2025 by victoria\nGreen MP Siân Berry has written to every Labour MP urging them to vote against the government’s planned cuts to welfare spending, highlighting the “catastrophic impact” the cuts would have on disabled people. [1] Figures from Scope this week suggested that the proposed changes will push an added 700,000 disabled households into poverty, as Starmer’s […]\n6 March 2025 / 12 March 2025 by victoria\nResponding to the news that the Justice Secretary will reject recommendations by the Sentencing Council to strengthen the need for pre-sentence reports for judges, Siân Berry Green MP for Brighton Pavilion said: “Failure to implement these changes would be a serious mistake, causing genuine harm to women, families and young people for whom these new […]\n27 February 2025 / 12 March 2025 by victoria\nResponding to the Transport Secretary’s decision to pursue a positive decision for Gatwick Airport to bring its northern terminal into constant use, (1) Siân Berry Green MP for Brighton Pavilion said: “The Labour government is trashing its climate credentials one absurd decision at a time. Only one day after receiving critical advice from its own […]\n29 January 2025 / 12 March 2025 by victoria\nResponding to the news that Rachel Reeves is backing the expansion of Heathrow Airport, Green Party MP, Sian Berry said, “The Chancellor talked about the ‘costs of irresponsibility’ but expanding Heathrow in the face of a climate emergency is the definition of irresponsible.” “Worst still, we’re also expecting formal planning decisions from ministers on Gatwick and […]\n21 January 2025 / 12 March 2025 by victoria\nIn response to rumours that the Government may soon sign off expansion proposals for Luton, Gatwick and Heathrow Airports, Siân Berry, Green Party MP for Brighton Pavilion said: “We must ask who these decisions would be made for and why. Whose advice is the Government listening to, when record-high wealth inequality is causing harm to […]\n9 January 2025 / 10 January 2025 by victoria\nGreen MP for Brighton Pavilion Siân Berry has gained cross party support for a bill which would force local authorities to phase out the use of harmful pesticides in public places. An Early Day Motion (EDM) tabled today (9 January), calls on the Government to pass the Plant Protection Products (Prohibition on Public Sector Use) […]\n9 January 2025 / 27 January 2025 by victoria\nSiân joined Greenpeace UK to hand in a petition signed by over 1.6 million people, calling for a total ban onbee-killing neonicotinoid pesticides from Government. These toxic chemicals -one teaspoon can kill one billion bees – were banned across Europe in 2018, but continue to be used on farms here after Conservatives gave ‘emergency’ permission […]",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2024_07_26_letter-to-the-chancellor-calling-for-fairer-taxes-on-the-most-wealthy/content_55.html": "Sian Berry and the group of Green MPs have written to the Chancellor, Rachel Reeves, ahead of the budget asking for fairer taxes on the most wealthy, which could raise up to £50 billion a year towards the NHS, schools and local authorities’\nSian Berry and the group of Green MPs have written to the Chancellor, Rachel Reeves, ahead of the budget asking for fairer taxes on the most wealthy, which could raise up to £50 billion a year towards the NHS, schools and local authorities’",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_03_18_reacting-to-labours-green-paper-on-welfare-reform/content_4.html": "Responding to the Government’s Green Paper on welfare reform, Green MP Siân Berry said:\n“I’ve heard nothing today that reassures me the Government will stop scapegoating and stigmatising those in need, while impoverishing them to the tune of £5 billion. Young and disabled people should have the support and backing of the Government but instead they have been badly let down this month with the active trailing of terrifying plans.\n“It’s clear that these plans were plotted without the input of those whose lives will be most impacted. Disabled people must be listened to before any changes are made, and I hope that Labour backbenchers will join me in being their fiercest defenders and fight off the worst of these plans.\n“The Chancellor must listen as well, to growing calls from Green MPs, the public and even many millionaires for a wealth tax. How can she stoop so low as taking money away from disabled people rather than getting a grip on the obscene wealth being hoarded in this country? This morally indefensible choice will have devastating consequences, and the Government should be ready to answer for it.”\nENDS",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_01_29_expanding-heathrow-in-the-face-of-a-climate-emergency-is-the-definition-of-irresponsible-say-sian-berry-mp/content_31.html": "Responding to the news that Rachel Reeves is backing the expansion of Heathrow Airport, Green Party MP, Sian Berry said,\n“The Chancellor talked about the ‘costs of irresponsibility’ but expanding Heathrow in the face of a climate emergency is the definition of irresponsible.”\n“Worst still, we’re also expecting formal planning decisions from ministers on Gatwick and Luton airport expansion, which the Chancellor pre-empted today. Giving these permissions in the month before vital new advice is expected from the Climate Change Committee, today’s speech is nothing short of reckless.\n“The carbon cost of expanding Heathrow, Luton, and Gatwick together will cancel out the benefits of Labour’s keystone clean energy plan, making Net Zero minister Ed Miliband’s task almost impossible.\n“The Chancellor’s stated goal is ‘raising living standards in every part of the UK’ but more and bigger airports will serve only the very richest aviation bosses and the most frequent flyers whose wealth doesn’t help people’s daily lives get better.\n“Tackling inequality and building a greener future should go hand in hand. That must mean investment in warmer homes, green energy and the local transport people use every day, not these bleak proposals.”",
  "https_sianberry_org_uk_/https_sianberry_org_uk_2025_01_23_letter-to-minister-for-pensions-on-upcoming-changes-to-the-triple-lock-and-state-pension/content_18.html": "I am concerned that many pensioners will be unknowingly pushed into paying income tax and face unexpected tax bills, especially given that the personal tax allowance is frozen at £12,570 until 2028 while the state pension is set to rise by 8.5 per cent in April 2024.\nRead my full letter below:",
  "https_sianberry_org_uk_/https_sianberry_org_uk_home_work-in-parliament/content_15.html": "Here you can see a summary of my voting record and the most recent contributions I have made in the House of Commons, including oral and written questions, speeches and debates.\nI also propose and support a wide range of important Early Day Motions, and take part in debates in Westminster Hall, and in All-Party Parliamentary Groups (APPGs) to work cross-party on a number of issues.\nIf you are a constituent, please get in touch if you would like more information about my work on any particular topic you care about, or if you would like me to take up an issue that will help you.\nContributions in the House:\n- Siân Berry: I hope the hon. Member was listening to my speech when I talked about the harm that might be caused by the delay in bringing in the really excellent parts of the new guidelines that might help women and families. Are the Liberal Democrats asking for a delay, or would they like to […]\n- Siân Berry: To return to the intervention from the hon. Member for Hinckley and Bosworth (Dr Evans), it is difficult for some to realise that with these guidelines, the definition of “normal” has flipped away from the male, the white, the Christian and the majority to shine more of a light on people who are […]\n- Siân Berry: Yes, of course.\n- Siân Berry: This is—\n- Siân Berry: I associate myself with every single thing that the Mother of the House has just said, because I could not possibly live up to it. I genuinely believe that this Bill will undermine efforts to ensure that equality before the law is a reality for everyone. It flies in the face of expertise […]\n- Siân Berry: To ask the Secretary of State for the Home Department, pursuant to the Answer of 4 March 2025 to Question 33251 on Domestic Abuse: Parents, when she plans to publish the Government response to the consultation on the definition of child-to-parent abuse.\n- Siân Berry: There is a lot I could say, but I will mainly just commend to Members my new clause 7, which would remove official error from the most punitive measures in the second part of the Bill. I spoke against the whole suite of intrusive legislation in the second part of the Bill on […]\n- Siân Berry: There is a lot I could say, but I will mainly just commend to Members my new clause 7, which would remove official error from the most punitive measures in the second part of the Bill. I spoke against the whole suite of intrusive legislation in the second part of the Bill on […]\n- Siân Berry: The independent person is required to produce an annual report on the use of the new powers, which, as the Minister has just laid out, are quite extensive. However, there is no requirement for the DWP to adopt the report’s recommendations. In cases where it does not accept the recommendations, will the Government […]\n- Siân Berry: The independent person is required to produce an annual report on the use of the new powers, which, as the Minister has just laid out, are quite extensive. However, there is no requirement for the DWP to adopt the report’s recommendations. In cases where it does not accept the recommendations, will the Government […]\n- Siân Berry: To ask the Secretary of State for Transport, pursuant to the Answer of 13 February 2025 to Question 29617 on Heathrow Airport, if she will update her Department's Appraisal of sustainability for the proposed Airports National Policy Statement, published 5 June 2018, as part of her review of the Airports National Policy Statement.\n- Siân Berry: To ask the Secretary of State for Environment, Food and Rural Affairs, what steps he is taking to monitor the effective implementation of Government consultation principles on the needs of people affected by air pollution.\n- Siân Berry: To ask the Secretary of State for Housing, Communities and Local Government, with reference to the press release entitled £2 billion new investment to support biggest boost in social and affordable housebuilding in a generation, published on 25 March 2025, how many and what proportion of these homes will be social housing for […]\n- Siân Berry: To ask the Secretary of State for Education, with reference to the Office for Students' regulatory case report for the University of Sussex, published on 26 March 2025, whether the Office for Students plans to issue guidance to higher education institutions following the report.\n- Siân Berry: To ask the Secretary of State for Education, whether the Office for Students commissioned external legal counsel in relation to their (a) regulatory case report for the University of Sussex, published on 26 March 2025 and (b) investigation which led to that report.\n- Siân Berry: To ask the Secretary of State for Education, how many Office for Students’ staff hours were spent on work relating to the Office for Students' regulatory case report for the University of Sussex, published on 26 March 2025 broken down by grade.\n- Siân Berry: To ask the Secretary of State for Education, with reference to the Office for Students' regulatory case report for the University of Sussex, published on 26 March 2025, what was the cost to the public purse of the investigation which led to this report.\n- Siân Berry: To ask the Secretary of State for Health and Social Care, pursuant to the Answer of 28 March 2025 to Question 40020 on Chronic Fatigue Syndrome: Health Services, whether he has had discussions with the British Association of Clinicians in ME/CFS on the myalgic encephalomyelitis/chronic fatigue syndrome delivery plan; and whether that plan […]\n- Siân Berry: I am concerned about public health. We all know that diesel and petrol hybrids are not zero emission, we know that the 2035 extension is not about tariffs—it applies only to UK sales—and we know that the move was already on the cards since Labour ripped clean air out of its manifesto completely. […]\n>> You can see my full list of contributions since I was elected via They Work For You\nVoting record:\nMy voting record is available on the Parliament website here:\nhttps://members.parliament.uk/member/5314/voting\nEarly Day Motions:\nYou can see which Early Day Motions I am supporting in the current Parliament here:\nhttps://members.parliament.uk/member/5314/earlydaymotions\nAPPG officer roles:\nI am currently vice-chair of the APPG on Humanism."
}