{
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2023_01_14_cllr-imtiaz-ali-to-join-the-green-party-group/content_12.html": "Fletton and Woodston ward councillor Cllr Imtiaz Ali has resigned from the Labour Party to join the Green Party group on Peterborough City Council.\nIn a statement, Cllr Ali said: “I will continue to serve the Fletton and Woodston ward in order to improve the lives of people of the area. I want to continue to ensure that the voices of Fletton and Woodston’s residents are heard loud and clear by the city’s administration.\n“I am a resident of the ward since 2018 and have been involved in many local projects, demonstrating my absolute commitment to my local community. I will seek to continue this work beyond 2023.\n“Since being elected in 2021 I have served on the Education Scrutiny Committee as well as the Audit Committee where I am currently vice-chair. I also serve on the Financial Sustainability Working Group where I support the administration in addressing concerns raised by the Improvements Panel with respect to the financial situation that we find ourselves in.\n“The Green Party’s policies and values can help create fairer greener communities. I feel that Green policies align much closer to my views and I feel like a valuable member of the team working in the city’s interest with a spirit of collaboration. I am therefore delighted that the Green Party has welcomed me to join their strong team.\n“We are facing some challenging times with inflation rampant and the Cost of Living Crisis affecting most of our residents, particularly families on low income. We also continue to face a worsening climate crisis and weather seems to be in the news more and more, be it local, national or international. The Green Party know that we have to tackle the cost of living crisis and the climate crisis in combination and are supportive of green initiatives that generate wealth as well as offset our carbon footprint.”\nGreen Group Leader, Cllr Nicola Day added: “I am delighted that Cllr Ali has chosen to join the Green Party. He feels more aligned to Green Party policies is a hard working and well repsected local councillor. He has been developing some great projects his ward on behalf of Fletton and Woodston residents which has included the planting of wildflowers, planting of a mini forest, and championing a project at the council for a solar farm. In these times of extreme climatic crisis it has never been more important to have strong Green Party Councillors in local government. I wish him a very warm welcome and our Green Party team look forward to working with him.”",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2023_04_28_action-day-monday-1st-may-2023/content_2.html": "| This coming Bank Holiday Monday, leave the telly at home, get out in the fresh air and make a difference.\nMeet former Green Party Leader Baroness Natalie Bennett and like-minded people in Orton Longuville and help the Green Party to re-elected Heather Skibsted. We are so close to the finish line but just need your help this Monday to deliver their last leaflet and talk to voters. Please do come on May 1st either for a morning session from 11am or afternoon from 1pm. To register your interest and for full details please do click below Whether you can come for the full day or just morning or afternoon, we’d be thrilled to have you join us! Sign up now for information on where to meet us! |\n| Look forward to seeing you there! |",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_tag_banner/content_17.html": "Congratulations to our 2024 candidates! 10 April 2024 / 10 April 2024 by samcg We are delighted to announce that we are standing 22 candidates in wards across the city in the 2024 local elections. We wish to thank and congratulate all the candidates for standing and putting their names forward. Here are the candidates that are standing: Barnack – June Bull Bretton – Mark Williams Central – Mohammed […] Read more » banner election elections2024\nMeet the Greens 12 March 2024 / 16 March 2024 by samcg We are holding a ‘Meet The Greens‘ event at: Gladstone Park Community Centre896 Bourges Boulevard Central PETERBOROUGH, PE1 2AN29th March6pm – 8pm There will be key speakers from the local Peterborough Green Party, where we will outline some of our work, policy positions on the crisis in Gaza, and how you can get involved in […] Read more » banner event fundraising",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2024_03_12_meet-the-greens/content_13.html": "We are holding a ‘Meet The Greens‘ event at:\nGladstone Park Community Centre\n896 Bourges Boulevard Central PETERBOROUGH, PE1 2AN\n29th March\n6pm – 8pm\nThere will be key speakers from the local Peterborough Green Party, where we will outline some of our work, policy positions on the crisis in Gaza, and how you can get involved in some of our targeted ward campaigns. Our speakers will include:\nCllr Nicola Day\nGreen Group Leader and Peterborough Parliamentary Candidate for the Green Party\nImtiaz Ali\nGreen Party Chair and Candidate for the local elections\nIf you are fasting for Ramadan, we invite you to break your fast with the Greens, and we will have food and snacks available for those who wish to break their fast with us and join us for this special evening.\nThis event is free, although we will ask for donations to help with our local campaigns. Collections for donations will take place during the evening.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_author_mikewhittaker/content_10.html": "5 November 2023 / 22 March 2024 by PGP Webmaster\nThe Peterborough Green group on Peterborough City Council supported a new administration at the 1st of November council meeting. Peterborough first will lead this new administration, supported by Liberal Democrats, Labour and the Greens. We believe that Peterborough deserves and needs and fresh approach after 23 years of Conservative administration. We are supportive of the […]\nRead more »\n28 April 2023 / 22 March 2024 by PGP Webmaster\nOur candidates for the local council elections on May 4th are: Bretton – Barry WarneCentral – Raymond KnightDogsthorpe– Kelsey BraceEast – Luke ChapmanEye, Thorney & Newborough – Michael AlexanderFletton & Stanground – Danette O HaraFletton & Woodston – Imtiaz AliGlinton & Castor – Greg GuthrieHargate & Hempsted – Michael WhitakerNorth – Tracey ForemanOrton Longueville – Heather […]\nThis coming Bank Holiday Monday, leave the telly at home, get out in the fresh air and make a difference. Meet former Green Party Leader Baroness Natalie Bennett and like-minded people in Orton Longuville and help the Green Party to re-elected Heather Skibsted. We are so close to the finish line but just need your […]\n16 March 2023 / 22 March 2024 by PGP Webmaster\nMonday 20th March 2023 – from 6:30pm. Tickets are £20 each for a multi-course buffet meal in the delightful company of Peterborough Green Party councillors, activists and volunteers. You will be welcomed to the event by party leader Cllr Nicola Day and other Green Party Councillors. This is an great opportunity to have some fantastic food and great conversation […]\n14 January 2023 / 22 March 2024 by PGP Webmaster\nFletton and Woodston ward councillor Cllr Imtiaz Ali has resigned from the Labour Party to join the Green Party group on Peterborough City Council. In a statement, Cllr Ali said: “I will continue to serve the Fletton and Woodston ward in order to improve the lives of people of the area. I want to continue to ensure that the voices of […]\n23 December 2022 / 22 March 2024 by PGP Webmaster\nThe Peterborough Green Party are delighted to announce Cllr Nicola Day as their Peterborough Parliamentary Candidate. Cllr Day has been leading the way on climate change and environmental issues in the city and aims to highlight the Green party’s strong agenda on issues of social justice. Nicola says ‘ I am extremely concerned for the […]\n13 December 2022 / 22 March 2024 by PGP Webmaster\nIf you’re struggling with your finances over the Festive period Peterborough City Councils Winter Warmth Funding is here to help. There’s information in this post (click <Read More> if necessary), or click here to find out more.\nSupermarket vouchers for children eligible for free school meals will be automatically issued over Christmas. If you think your child might be eligible for free school meals, be sure to apply. It’s quick and confidential: just click here.\nPeterborough City Council’s Severe Weather Emergency Service for the homeless is in operation and will continue during the cold spell. To access it call 864064 office hours or 864157 out of office hours.\n8 September 2022 / 22 March 2024 by PGP Webmaster\nAs a mark of respect for the passing of Her Majesty Queen Elizabeth II, Peterborough Green Party is suspending all campaigning activities.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2024_04_10_congratulations-to-our-2024-candidates/content_18.html": "We are delighted to announce that we are standing 22 candidates in wards across the city in the 2024 local elections. We wish to thank and congratulate all the candidates for standing and putting their names forward.\nHere are the candidates that are standing:\nBarnack – June Bull\nBretton – Mark Williams\nCentral – Mohammed Aziz Munir\nDogsthorpe – Matthew Gray\nEast – Bismah Noor\nEye, Thorney and Newborough – Carol Sarah Johnson\nFletton and Stanground – Sam Creedon-Gray\nFletton and Woodston – Adam Warr\nGlinton and Castor – Greg Guthrie\nGunthorpe – Shazad Ali\nHampton Vale – Charles Rhys Coster\nHargate and Hempsted – Amanda Horne\nNorth – Misbah Shafiq\nOrton Longueville – Imtiaz Ali\nOrton Waterville – Ed Murphy\nPark – Iqra Ali\nPaston and Walton – Shokat Ali\nRavensthorpe – Qaiser Farid\nStanground South – Joe Horne\nWerrington – Katherine Ann Sharp\nWerrington – Barry Warne\nWest – Chelsea Windsor\nWe are delighted to be fielding such a strong slate of candidates for the local elections on May 2nd.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_06_09_councillor-julie-howell/content_22.html": "We regret to announce that Councillor Julie Howell has chosen to step down from the Green Party for personal reasons with immediate effect. We wish her well in her future endeavours.\nWe regret to announce that Councillor Julie Howell has chosen to step down from the Green Party for personal reasons with immediate effect. We wish her well in her future endeavours.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_get-involved/content_4.html": "Peterborough Green Party relies on its volunteers. Those that make up the Executive Committee, those that deliver leaflets or door knock for us and so much more. To continue to hold the Peterborough City Council to account and win local respresentation, we are always looking for more volunteers.\nOur election campaigns are built by volunteers with different backgrounds, skills and amounts of spare time, led by our Green Party group leader, Councillor Julie Howell.\n– Could you join the team delivering some newsletters or talk to people about key local issues?\n– Perhaps you would like to stand as a candidate in a local or Parish Council election?\n– Do you have a skill you could offer such as fundraising, volunteer co-ordination or policy work?\n– Perhaps you would like to join the Executive Committee?\nIf so why not contact us using the forms below\nExecutive Committee Vacancies\nWe currently have vacancies on the Executive Committee which are being covered by volunteers in other roles.\nSecretary\nElection Agent/Nomination Officer\nFundraising Officer\nIf you are interested in any of these roles please us the volunteering form above to contact us.\nInformation\nContact\nPeople\nPeterborough City Council\nNational\nThe Green Party of England & Wales\nYoung Greens\nLGBTIQA+ Greens\nGreen Party Women\nGreens of Colour\nGreen Party Disability Group",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2023_04_28_candidates-for-local-elections/content_8.html": "Our candidates for the local council elections on May 4th are:\nBretton – Barry Warne\nCentral – Raymond Knight\nDogsthorpe– Kelsey Brace\nEast – Luke Chapman\nEye, Thorney & Newborough – Michael Alexander\nFletton & Stanground – Danette O Hara\nFletton & Woodston – Imtiaz Ali\nGlinton & Castor – Greg Guthrie\nHargate & Hempsted – Michael Whitaker\nNorth – Tracey Foreman\nOrton Longueville – Heather Skibsted\nOrton Waterville – Nicola Day\nPark – Fiona Radic & Steve Wilson\nPaston & Walton – Simon Mayhew\nRavensthorpe – Edward Murphy\nStanground South – Stuart Middleton\nWerrington – Georgia Wade\nWest – Collette Francis",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_contact/content_7.html": "Skip to content\nSkip to footer\nPeterborough\nMenu\nNews\nGet Involved\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nGet in touch\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_tag_event/content_30.html": "Meet the Greens 12 March 2024 / 16 March 2024 by samcg We are holding a ‘Meet The Greens‘ event at: Gladstone Park Community Centre896 Bourges Boulevard Central PETERBOROUGH, PE1 2AN29th March6pm – 8pm There will be key speakers from the local Peterborough Green Party, where we will outline some of our work, policy positions on the crisis in Gaza, and how you can get involved in […] Read more » banner event fundraising",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_09_08_queen-elizabeth-ii-1926-2022/content_23.html": "As a mark of respect for the passing of Her Majesty Queen Elizabeth II, Peterborough Green Party is suspending all campaigning activities.\nAs a mark of respect for the passing of Her Majesty Queen Elizabeth II, Peterborough Green Party is suspending all campaigning activities.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_tag_elections2024/content_26.html": "Congratulations to our 2024 candidates! 10 April 2024 / 10 April 2024 by samcg We are delighted to announce that we are standing 22 candidates in wards across the city in the 2024 local elections. We wish to thank and congratulate all the candidates for standing and putting their names forward. Here are the candidates that are standing: Barnack – June Bull Bretton – Mark Williams Central – Mohammed […] Read more » banner election elections2024",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_07_19_well-respected-and-hard-working-councillor-leaves-labour-to-join-greens/content_34.html": "A councillor on Peterborough City Council has resigned from Labour and joined the Green Party. Cllr Heather Skibsted is now a Green councillor for Orton Longueville ward having been elected as ward councillor in 2019. She will seek reelection as a Green councillor in 2023.\nIn a statement, Cllr Skibsted said:\n“I will continue to serve the Orton Longueville ward in order to improve the lives of people of the area. I want to continue to ensure that the voices of Orton Longueville’s residents are heard loud and clear by the city’s administration.\n“I have been involved in many environmental and neighbourhood projects, demonstrating my absolute commitment to my local community. I will seek to continue this work beyond 2023.\n“The Green Party’s policies and values can help create fairer greener communities. I feel I have found my home, because Green policies align much closer to my views and I feel part of a team working in the city’s interest with a spirit of collaboration. I am therefore delighted that the Green Party has welcomed me to join their strong team.\n“We are facing severe social and economic issues – inflation and a cost of living crisis – which are bearing down on low income families. We also continue to face a worsening climate crisis. Greens know that we can tackle the cost of living and the climate crisis in combination through, for example, insulating homes which will slash energy bills.”\nGreen Group Leader, Councillor Nicola Day said:\n“I am delighted that Cllr Skibsted has chosen to join the Green Party. She feels more aligned to Green Party policies and has been doing some great work in her ward on behalf of Orton Longueville residents which has included environmental and biodiversity work. In these times of extreme climatic crisis it has never been more important to have strong Green Party Councillors in local government. I wish her a warm welcome and look forward to working with her”.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_news_page_2/content_19.html": "Severe Weather Emergency Service 13 December 2022 / 22 March 2024 by PGP Webmaster Peterborough City Council’s Severe Weather Emergency Service for the homeless is in operation and will continue during the cold spell. To access it call 864064 office hours or 864157 out of office hours. Read more »\nQueen Elizabeth II – 1926-2022 8 September 2022 / 22 March 2024 by PGP Webmaster As a mark of respect for the passing of Her Majesty Queen Elizabeth II, Peterborough Green Party is suspending all campaigning activities. Read more »\nWell respected and hard working councillor leaves Labour to join Greens 19 July 2022 / 22 March 2024 by PGP Webmaster A councillor on Peterborough City Council has resigned from Labour and joined the Green Party. Cllr Heather Skibsted is now a Green councillor for Orton Longueville ward having been elected as ward councillor in 2019. She will seek reelection as a Green councillor in 2023. In a statement, Cllr Skibsted said: “I will continue to […] Read more »\nCouncillor Julie Howell 9 June 2022 / 22 March 2024 by PGP Webmaster We regret to announce that Councillor Julie Howell has chosen to step down from the Green Party for personal reasons with immediate effect. We wish her well in her future endeavours. Read more »\nElection Results 9 May 2022 / 22 March 2024 by PGP Webmaster Huge thanks to everybody that voted Green in Thursday’s election. We’re very pleased to say that Cllr Julie Howell of Orton Waterville retained her seat, and with a huge majority too! Julie received more votes than any other candidate in the city. Name of candidate Party Number of votes Vince CARROLL Liberal Democrat 72 Julie HOWELL […] Read more »\nElections today! 5 May 2022 / 22 March 2024 by PGP Webmaster A reminder of your Green Party candidates in Peterborough today. 💚Polling stations are open until 10pm. 💚You don’t need your polling card or ID to vote. 💚 If you have an unused postal vote, you can still vote today by taking it to your polling station. Vote Green, for fairer, greener communities. Read more »\nMaking the most of Peterborough’s assets 17 April 2022 / 22 March 2024 by PGP Webmaster Nicola Day, Green group deputy leader on Peterborough City Council, talks to Peterborough Today about utilising existing facilities in the city. Article Link Read more »\nCandidates for 5th May Elections 13 April 2022 / 22 March 2024 by PGP Webmaster Peterborough Green Party have announced a list of candidates for the May 5th council elections. Central – Raymond Knight Dogsthorpe – Kelsey Brace East – Luke Chapman Eye, Thorney & Newborough – Michael Alexander Fletton & Woodston – David Stevenson Hampton Vale – Barry Warne Hargate & Hempsted – Michael Whitaker Orton Longueville – June Bull Orton […] Read more »",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2023_11_05_peterborough-city-council/content_3.html": "The Peterborough Green group on Peterborough City Council supported a new administration at the 1st of November council meeting. Peterborough first will lead this new administration, supported by Liberal Democrats, Labour and the Greens.\nWe believe that Peterborough deserves and needs and fresh approach after 23 years of Conservative administration. We are supportive of the new administration who have promised to deliver stability, better conduct and transparency. The public needs openness about the future of the Regional Pool, Green Spaces and the Hilton Hotel.\nWe trust that we can work together with our groups for the betterment of Peterborough and our residents. Peterborough First have also promised to continue to support Green Policies and strategies that we have been working on at the council.\nWe still have significant financial challenges ahead and we are still committed to working on those challenges with all parties.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2023_03_16_pgp-fundraiser-march-20th-2023/content_11.html": "Monday 20th March 2023 – from 6:30pm.\nTickets are £20 each for a multi-course buffet meal in the delightful company of Peterborough Green Party councillors, activists and volunteers.\nYou will be welcomed to the event by party leader Cllr Nicola Day and other Green Party Councillors.\nThis is an great opportunity to have some fantastic food and great conversation whilst helping to continue the great work we do in Peterborough.\nAs you know, Peterborough Green Party has been dedicated to creating positive change for our community and city, and we need your help to continue our work. By attending our fundraiser, you will not only enjoy a delicious multi-course buffet, but you will also have the opportunity to meet and mingle with our fantastic Green councillors, activists, and volunteers.\nWhat’s more, attending this event is a great way to support our campaign to see our Green councillors elected in May. Your contribution will help us reach more voters and spread our message of a fairer, greener city.\nTickets are limited to a seating of 60 persons.\nTo book your place – contact your Green Party Councillor: CIlr Imtiaz Ali, CIlr Nicola Day, Cllr Kirsty Knight and Cllr Heather Skibsted.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_05_09_election-results/content_21.html": "Huge thanks to everybody that voted Green in Thursday’s election. We’re very pleased to say that Cllr Julie Howell of Orton Waterville retained her seat, and with a huge majority too! Julie received more votes than any other candidate in the city.\n| Name of candidate | Party | Number of votes |\n| Vince CARROLL | Liberal Democrat | 72 |\n| Julie HOWELL | Green | 1907 (Elected) |\n| Henry MCKEARNEY | Labour | 217 |\n| Michael SAMWAYS | Conservative | 593 |",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_author_samcg/content_6.html": "10 April 2024 / 10 April 2024 by samcg\nWe are delighted to announce that we are standing 22 candidates in wards across the city in the 2024 local elections. We wish to thank and congratulate all the candidates for standing and putting their names forward. Here are the candidates that are standing: Barnack – June Bull Bretton – Mark Williams Central – Mohammed […]\nRead more »\n12 March 2024 / 16 March 2024 by samcg\nWe are holding a ‘Meet The Greens‘ event at: Gladstone Park Community Centre896 Bourges Boulevard Central PETERBOROUGH, PE1 2AN29th March6pm – 8pm There will be key speakers from the local Peterborough Green Party, where we will outline some of our work, policy positions on the crisis in Gaza, and how you can get involved in […]",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_tag_election/content_24.html": "Congratulations to our 2024 candidates! 10 April 2024 / 10 April 2024 by samcg We are delighted to announce that we are standing 22 candidates in wards across the city in the 2024 local elections. We wish to thank and congratulate all the candidates for standing and putting their names forward. Here are the candidates that are standing: Barnack – June Bull Bretton – Mark Williams Central – Mohammed […] Read more » banner election elections2024",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_news/content_5.html": "Congratulations to our 2024 candidates! 10 April 2024 / 10 April 2024 by samcg We are delighted to announce that we are standing 22 candidates in wards across the city in the 2024 local elections. We wish to thank and congratulate all the candidates for standing and putting their names forward. Here are the candidates that are standing: Barnack – June Bull Bretton – Mark Williams Central – Mohammed […] Read more » banner election elections2024\nMeet the Greens 12 March 2024 / 16 March 2024 by samcg We are holding a ‘Meet The Greens‘ event at: Gladstone Park Community Centre896 Bourges Boulevard Central PETERBOROUGH, PE1 2AN29th March6pm – 8pm There will be key speakers from the local Peterborough Green Party, where we will outline some of our work, policy positions on the crisis in Gaza, and how you can get involved in […] Read more » banner event fundraising\nPeterborough City Council 5 November 2023 / 22 March 2024 by PGP Webmaster The Peterborough Green group on Peterborough City Council supported a new administration at the 1st of November council meeting. Peterborough first will lead this new administration, supported by Liberal Democrats, Labour and the Greens. We believe that Peterborough deserves and needs and fresh approach after 23 years of Conservative administration. We are supportive of the […] Read more »\nCandidates for May 4th Local Elections 28 April 2023 / 22 March 2024 by PGP Webmaster Our candidates for the local council elections on May 4th are: Bretton – Barry WarneCentral – Raymond KnightDogsthorpe– Kelsey BraceEast – Luke ChapmanEye, Thorney & Newborough – Michael AlexanderFletton & Stanground – Danette O HaraFletton & Woodston – Imtiaz AliGlinton & Castor – Greg GuthrieHargate & Hempsted – Michael WhitakerNorth – Tracey ForemanOrton Longueville – Heather […] Read more »\nAction Day – Monday 1st May 2023 28 April 2023 / 22 March 2024 by PGP Webmaster This coming Bank Holiday Monday, leave the telly at home, get out in the fresh air and make a difference. Meet former Green Party Leader Baroness Natalie Bennett and like-minded people in Orton Longuville and help the Green Party to re-elected Heather Skibsted. We are so close to the finish line but just need your […] Read more »\nPGP Fundraiser – March 20th 2023 16 March 2023 / 22 March 2024 by PGP Webmaster Monday 20th March 2023 – from 6:30pm. Tickets are £20 each for a multi-course buffet meal in the delightful company of Peterborough Green Party councillors, activists and volunteers. You will be welcomed to the event by party leader Cllr Nicola Day and other Green Party Councillors. This is an great opportunity to have some fantastic food and great conversation […] Read more »\nCllr Imtiaz Ali to join the Green Party group 14 January 2023 / 22 March 2024 by PGP Webmaster Fletton and Woodston ward councillor Cllr Imtiaz Ali has resigned from the Labour Party to join the Green Party group on Peterborough City Council. In a statement, Cllr Ali said: “I will continue to serve the Fletton and Woodston ward in order to improve the lives of people of the area. I want to continue to ensure that the voices of […] Read more »\nParliamentary Candidate – Nicola Day 23 December 2022 / 22 March 2024 by PGP Webmaster The Peterborough Green Party are delighted to announce Cllr Nicola Day as their Peterborough Parliamentary Candidate. Cllr Day has been leading the way on climate change and environmental issues in the city and aims to highlight the Green party’s strong agenda on issues of social justice. Nicola says ‘ I am extremely concerned for the […] Read more »\nWinter Warmth Funding 13 December 2022 / 22 March 2024 by PGP Webmaster If you’re struggling with your finances over the Festive period Peterborough City Councils Winter Warmth Funding is here to help. There’s information in this post (click <Read More> if necessary), or click here to find out more. Read more »\nFree School Meals 13 December 2022 / 22 March 2024 by PGP Webmaster Supermarket vouchers for children eligible for free school meals will be automatically issued over Christmas. If you think your child might be eligible for free school meals, be sure to apply. It’s quick and confidential: just click here. Read more »",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_12_13_free-school-meals/content_14.html": "Supermarket vouchers for children eligible for free school meals will be automatically issued over Christmas.\nIf you think your child might be eligible for free school meals, be sure to apply.\nIt’s quick and confidential: just click here.\nSupermarket vouchers for children eligible for free school meals will be automatically issued over Christmas.\nIf you think your child might be eligible for free school meals, be sure to apply.\nIt’s quick and confidential: just click here.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_author_mikewhittaker_page_2/content_20.html": "19 July 2022 / 22 March 2024 by PGP Webmaster\nA councillor on Peterborough City Council has resigned from Labour and joined the Green Party. Cllr Heather Skibsted is now a Green councillor for Orton Longueville ward having been elected as ward councillor in 2019. She will seek reelection as a Green councillor in 2023. In a statement, Cllr Skibsted said: “I will continue to […]\nRead more »\n9 June 2022 / 22 March 2024 by PGP Webmaster\nWe regret to announce that Councillor Julie Howell has chosen to step down from the Green Party for personal reasons with immediate effect. We wish her well in her future endeavours.\n9 May 2022 / 22 March 2024 by PGP Webmaster\nHuge thanks to everybody that voted Green in Thursday’s election. We’re very pleased to say that Cllr Julie Howell of Orton Waterville retained her seat, and with a huge majority too! Julie received more votes than any other candidate in the city. Name of candidate Party Number of votes Vince CARROLL Liberal Democrat 72 Julie HOWELL […]\n5 May 2022 / 22 March 2024 by PGP Webmaster\nA reminder of your Green Party candidates in Peterborough today. 💚Polling stations are open until 10pm. 💚You don’t need your polling card or ID to vote. 💚 If you have an unused postal vote, you can still vote today by taking it to your polling station. Vote Green, for fairer, greener communities.\n17 April 2022 / 22 March 2024 by PGP Webmaster\nNicola Day, Green group deputy leader on Peterborough City Council, talks to Peterborough Today about utilising existing facilities in the city. Article Link\n13 April 2022 / 22 March 2024 by PGP Webmaster\nPeterborough Green Party have announced a list of candidates for the May 5th council elections. Central – Raymond Knight Dogsthorpe – Kelsey Brace East – Luke Chapman Eye, Thorney & Newborough – Michael Alexander Fletton & Woodston – David Stevenson Hampton Vale – Barry Warne Hargate & Hempsted – Michael Whitaker Orton Longueville – June Bull Orton […]",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_12_13_winter-warmth-funding/content_9.html": "If you’re struggling with your finances over the Festive period Peterborough City Councils Winter Warmth Funding is here to help. There’s information in this post (click <Read More> if necessary), or click here to find out more.\nIf you’re struggling with your finances over the Festive period Peterborough City Councils Winter Warmth Funding is here to help. There’s information in this post (click <Read More> if necessary), or click here to find out more.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_tag_fundraising/content_29.html": "Meet the Greens 12 March 2024 / 16 March 2024 by samcg We are holding a ‘Meet The Greens‘ event at: Gladstone Park Community Centre896 Bourges Boulevard Central PETERBOROUGH, PE1 2AN29th March6pm – 8pm There will be key speakers from the local Peterborough Green Party, where we will outline some of our work, policy positions on the crisis in Gaza, and how you can get involved in […] Read more » banner event fundraising",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_05_05_elections-today/content_31.html": "A reminder of your Green Party candidates in Peterborough today.\n💚Polling stations are open until 10pm.\n💚You don’t need your polling card or ID to vote.\n💚 If you have an unused postal vote, you can still vote today by taking it to your polling station.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_12_23_parliamentary-candidate-nicola-day/content_27.html": "The Peterborough Green Party are delighted to announce Cllr Nicola Day as their Peterborough Parliamentary Candidate. Cllr Day has been leading the way on climate change and environmental issues in the city and aims to highlight the Green party’s strong agenda on issues of social justice.\nNicola says ‘ I am extremely concerned for the most vulnerable in our city right now. With the huge hike in energy bills and rising food prices many people are suffering and are worried about turning on their heating. An inadequately heated house in winter can cause misery, dampness and ill-health. The Green party wants to see a windfall tax imposed on energy companies, which will be used to make our homes warmer and lead to energy bills being set back to October 2021 levels. We want to ensure energy companies are put back into the hands of the public through public ownership. I welcome the local community hubs which have been created by the council to offer warmth, support and advice. However, energy should be a right, and there is far more the government should be doing to make sure we are not freezing in our homes.\nI want to see Peterborough thrive. We have some fantastic cultural assets like the cathedral, museum, art gallery and Flag Fen. We should make the most out of these places and ensure they are accessible to everyone. Our arts and history should be cared for and cherished. All areas of the city centre should be accessible for those with disabilities. The city centre should be an inviting and safe space for families to visit at all times.\nEconomically Peterborough will not succeed on the old models of growth. Those models are tired and outdated. We should aspire to become one of the first cities to decarbonise and roll out a net zero carbon technology. We could do this by utilising our new university research centre and a new Green Skills Centre at the Peterborough Regional College. This would put Peterborough on the map as a manufacturing base and as a hub for net zero carbon technologies.\nI am Chair of the Peterborough City Council’s ‘Climate Change and Environment Committee’, and we are already making great strides with a ‘local area energy plan ‘ which was passed at the last full council meeting. This was one of the first to be passed in the country, having only been beaten to first place by Manchester.\nNow, more so than ever before, we need more Green’s at government level. We work hard and we have big hearts. We have the professionalism along with the policies in place to enable the great changes which should urgently happen. We are some of the hardest working politicians in the country, and we come from a place of love, compassion and unity. We need this approach more than ever after the recent years of austerity, covid, division and struggle.\nI feel humbled and honoured to have been asked to stand as the Green party Parliamentary Candidate for Peterborough. I was raised here, live here and work and play here. I owe a lot to this city, and if elected would work hard to represent the people who live here.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_category_local-news_page_2/content_32.html": "13 December 2022 / 22 March 2024 by PGP Webmaster\nPeterborough City Council’s Severe Weather Emergency Service for the homeless is in operation and will continue during the cold spell. To access it call 864064 office hours or 864157 out of office hours.\nRead more »\n8 September 2022 / 22 March 2024 by PGP Webmaster\nAs a mark of respect for the passing of Her Majesty Queen Elizabeth II, Peterborough Green Party is suspending all campaigning activities.\n19 July 2022 / 22 March 2024 by PGP Webmaster\nA councillor on Peterborough City Council has resigned from Labour and joined the Green Party. Cllr Heather Skibsted is now a Green councillor for Orton Longueville ward having been elected as ward councillor in 2019. She will seek reelection as a Green councillor in 2023. In a statement, Cllr Skibsted said: “I will continue to […]\n9 June 2022 / 22 March 2024 by PGP Webmaster\nWe regret to announce that Councillor Julie Howell has chosen to step down from the Green Party for personal reasons with immediate effect. We wish her well in her future endeavours.\n9 May 2022 / 22 March 2024 by PGP Webmaster\nHuge thanks to everybody that voted Green in Thursday’s election. We’re very pleased to say that Cllr Julie Howell of Orton Waterville retained her seat, and with a huge majority too! Julie received more votes than any other candidate in the city. Name of candidate Party Number of votes Vince CARROLL Liberal Democrat 72 Julie HOWELL […]\n5 May 2022 / 22 March 2024 by PGP Webmaster\nA reminder of your Green Party candidates in Peterborough today. 💚Polling stations are open until 10pm. 💚You don’t need your polling card or ID to vote. 💚 If you have an unused postal vote, you can still vote today by taking it to your polling station. Vote Green, for fairer, greener communities.\n17 April 2022 / 22 March 2024 by PGP Webmaster\nNicola Day, Green group deputy leader on Peterborough City Council, talks to Peterborough Today about utilising existing facilities in the city. Article Link\n13 April 2022 / 22 March 2024 by PGP Webmaster\nPeterborough Green Party have announced a list of candidates for the May 5th council elections. Central – Raymond Knight Dogsthorpe – Kelsey Brace East – Luke Chapman Eye, Thorney & Newborough – Michael Alexander Fletton & Woodston – David Stevenson Hampton Vale – Barry Warne Hargate & Hempsted – Michael Whitaker Orton Longueville – June Bull Orton […]",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_category_local-news/content_16.html": "10 April 2024 / 10 April 2024 by samcg\nWe are delighted to announce that we are standing 22 candidates in wards across the city in the 2024 local elections. We wish to thank and congratulate all the candidates for standing and putting their names forward. Here are the candidates that are standing: Barnack – June Bull Bretton – Mark Williams Central – Mohammed […]\nRead more »\n12 March 2024 / 16 March 2024 by samcg\nWe are holding a ‘Meet The Greens‘ event at: Gladstone Park Community Centre896 Bourges Boulevard Central PETERBOROUGH, PE1 2AN29th March6pm – 8pm There will be key speakers from the local Peterborough Green Party, where we will outline some of our work, policy positions on the crisis in Gaza, and how you can get involved in […]\n5 November 2023 / 22 March 2024 by PGP Webmaster\nThe Peterborough Green group on Peterborough City Council supported a new administration at the 1st of November council meeting. Peterborough first will lead this new administration, supported by Liberal Democrats, Labour and the Greens. We believe that Peterborough deserves and needs and fresh approach after 23 years of Conservative administration. We are supportive of the […]\n28 April 2023 / 22 March 2024 by PGP Webmaster\nOur candidates for the local council elections on May 4th are: Bretton – Barry WarneCentral – Raymond KnightDogsthorpe– Kelsey BraceEast – Luke ChapmanEye, Thorney & Newborough – Michael AlexanderFletton & Stanground – Danette O HaraFletton & Woodston – Imtiaz AliGlinton & Castor – Greg GuthrieHargate & Hempsted – Michael WhitakerNorth – Tracey ForemanOrton Longueville – Heather […]\nThis coming Bank Holiday Monday, leave the telly at home, get out in the fresh air and make a difference. Meet former Green Party Leader Baroness Natalie Bennett and like-minded people in Orton Longuville and help the Green Party to re-elected Heather Skibsted. We are so close to the finish line but just need your […]\n16 March 2023 / 22 March 2024 by PGP Webmaster\nMonday 20th March 2023 – from 6:30pm. Tickets are £20 each for a multi-course buffet meal in the delightful company of Peterborough Green Party councillors, activists and volunteers. You will be welcomed to the event by party leader Cllr Nicola Day and other Green Party Councillors. This is an great opportunity to have some fantastic food and great conversation […]\n14 January 2023 / 22 March 2024 by PGP Webmaster\nFletton and Woodston ward councillor Cllr Imtiaz Ali has resigned from the Labour Party to join the Green Party group on Peterborough City Council. In a statement, Cllr Ali said: “I will continue to serve the Fletton and Woodston ward in order to improve the lives of people of the area. I want to continue to ensure that the voices of […]\n23 December 2022 / 22 March 2024 by PGP Webmaster\nThe Peterborough Green Party are delighted to announce Cllr Nicola Day as their Peterborough Parliamentary Candidate. Cllr Day has been leading the way on climate change and environmental issues in the city and aims to highlight the Green party’s strong agenda on issues of social justice. Nicola says ‘ I am extremely concerned for the […]\n13 December 2022 / 22 March 2024 by PGP Webmaster\nIf you’re struggling with your finances over the Festive period Peterborough City Councils Winter Warmth Funding is here to help. There’s information in this post (click <Read More> if necessary), or click here to find out more.\nSupermarket vouchers for children eligible for free school meals will be automatically issued over Christmas. If you think your child might be eligible for free school meals, be sure to apply. It’s quick and confidential: just click here.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk/content_1.html": "Your local Green Party for all of Peterborough\nLatest News\n- Congratulations to our 2024 candidates!by samcgWe are delighted to announce that we are standing 22 candidates in wards across the city in the 2024 local elections. We wish to thank and congratulate all the candidates for standing and putting their names forward. Here are the candidates that are standing: Barnack – June Bull Bretton – Mark Williams Central – Mohammed… Read more: Congratulations to our 2024 candidates!\n- Meet the Greensby samcgWe are holding a ‘Meet The Greens‘ event at: Gladstone Park Community Centre896 Bourges Boulevard Central PETERBOROUGH, PE1 2AN29th March6pm – 8pm There will be key speakers from the local Peterborough Green Party, where we will outline some of our work, policy positions on the crisis in Gaza, and how you can get involved in… Read more: Meet the Greens\n- Peterborough City Councilby PGP WebmasterThe Peterborough Green group on Peterborough City Council supported a new administration at the 1st of November council meeting. Peterborough first will lead this new administration, supported by Liberal Democrats, Labour and the Greens. We believe that Peterborough deserves and needs and fresh approach after 23 years of Conservative administration. We are supportive of the… Read more: Peterborough City Council\n- Candidates for May 4th Local Electionsby PGP WebmasterOur candidates for the local council elections on May 4th are: Bretton – Barry WarneCentral – Raymond KnightDogsthorpe– Kelsey BraceEast – Luke ChapmanEye, Thorney & Newborough – Michael AlexanderFletton & Stanground – Danette O HaraFletton & Woodston – Imtiaz AliGlinton & Castor – Greg GuthrieHargate & Hempsted – Michael WhitakerNorth – Tracey ForemanOrton Longueville – Heather… Read more: Candidates for May 4th Local Elections\n- Action Day – Monday 1st May 2023by PGP WebmasterThis coming Bank Holiday Monday, leave the telly at home, get out in the fresh air and make a difference. Meet former Green Party Leader Baroness Natalie Bennett and like-minded people in Orton Longuville and help the Green Party to re-elected Heather Skibsted. We are so close to the finish line but just need your… Read more: Action Day – Monday 1st May 2023\nVolunteer to help get Greens elected in Peterborough\nUpcoming Events\n- No upcoming events",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_04_13_peterborough-greens-candidates-for-5th-may-2022-council-elections/content_33.html": "Peterborough Green Party have announced a list of candidates for the May 5th council elections.\nCentral – Raymond Knight\nDogsthorpe – Kelsey Brace\nEast – Luke Chapman\nEye, Thorney & Newborough – Michael Alexander\nFletton & Woodston – David Stevenson\nHampton Vale – Barry Warne\nHargate & Hempsted – Michael Whitaker\nOrton Longueville – June Bull\nOrton Waterville – Julie Howell\nPark – Fiona Radic\nPaston & Walton – Amanda Horne\nStanground South – Stuart Middleton\nWerrington – Georgia Wade",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_12_13_severe-weather-emergency-service/content_25.html": "Peterborough City Council’s Severe Weather Emergency Service for the homeless is in operation and will continue during the cold spell. To access it call 864064 office hours or 864157 out of office hours.\nPeterborough City Council’s Severe Weather Emergency Service for the homeless is in operation and will continue during the cold spell. To access it call 864064 office hours or 864157 out of office hours.",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_donate/content_15.html": "Skip to content\nSkip to footer\nPeterborough\nMenu\nNews\nGet Involved\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nDonate\nDonate\nTo top",
  "https_peterborough_greenparty_org_uk_/https_peterborough_greenparty_org_uk_2022_04_17_making-the-most-of-peterboroughs-assets/content_28.html": "Nicola Day, Green group deputy leader on Peterborough City Council, talks to Peterborough Today about utilising existing facilities in the city.\nNicola Day, Green group deputy leader on Peterborough City Council, talks to Peterborough Today about utilising existing facilities in the city."
}