{
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_category_uncategorised_page_3/content_24.html": "3 April 2023 by matthewsnedker\nRead more »\n28 March 2023 by matthewsnedker\n10 February 2023 / 10 February 2023 by matthewsnedker\nAs Britons turn down the thermostat – again, and many turn to food banks, Darlington Green Party Cllr Matthew Snedker believes it’s time for the Tories to accept responsibility for the disastrous outcome of their long years in power. The cost-of-living crisis is a direct result of their policies and lack of planning, he says. […]\n14 September 2021 / 14 September 2021 by matthewsnedker\nBryony and Matthew would like to thank the community groups and concerned individuals who worked with us to submit detailed evidence at the public examination to the Darlington housing plan. Recently, the Government has recalculated housing need using the very latest data and projections. They warn that the Local Plan would attempt to build 40% […]",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_donate/content_2.html": "The Green Party does not have corporate sponsors or wealthy donors – and we are proud that this sets us apart from other political parties.\nThis policy ensures our independence – and means that we can represent our local communities, without outside influence.\nIf you are in a position to help us financially, you have the option to support the Regional Party with a one off or a regular donation.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_10_21_councillor-matthew-snedker-selected-as-green-party-parliamentary-candidate-for-darlington/content_16.html": "The next general election will take place next year and Matthew will be standing as our Green Party candidate.\nMatthew said: “We’re facing a double crisis in our country, for our climate and for our democracy, but the Greens have the ideas and the political energy to push for progressive solutions. I’m both hopeful and proud to have been chosen to fight this election for the Green Party. We speak with one voice in saying ‘Yes’ to fairness and ‘No’ to climate chaos.”\nEven though we don’t know exactly when the election will be, we will be starting to prepare soon. Our election campaign will not be as intensive as it was in this year’s local elections but it will cover the whole constituency, not just a small number of wards.\nIn the meantime, we will continue supporting our councillors to represent their wards and carry out their council duties, but general election work will be going on behind the scenes. If any member wants to get more involved in the preparations, and in the campaign, we’d love to have you. Coming along to our local party meetings to find out more details.\nWe also need to increase funding to cover election expenses, please consider setting up a recurring donation to Darlington Green Party if you haven’t already (details below).\nMatthew’s candidacy announcement had good coverage in the Northern Echo.\nNominations are also being sought for candidates to stand in the Tees Valley Mayoral election which will be held in May next year. The deposit for these elections is £5,000 so the Tees Valley parties may decide to not go ahead if enough money is not raised.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2024_05_23_darlington-council-climate-change-working-group-recent-successes/content_13.html": "Earlier this year Matthew attended the annual APSE (association of public sector excellence) energy summit. He saw presentations from a wide range of local authorities who had shown innovation in reducing their direct carbon emissions or enabling their communities to realise savings. The CCWG has been putting the knowledge gained to good use. Here are some examples of recent successes.\nSolar panels on bin lorries\nAll bin lorries have batteries, which have a considerable load placed on them from the bin lifts and heaters. With conventional bin lorries, this means that the engine has to keep running to keep them working.Following the intervention of the CCWG, thin film solar photovoltaic panels have been installed on top of the bin lorries, which will reduce the need for the battery to be topped up through the alternator. This will save diesel, cut air pollution and reduce carbon emissions.\nMonitoring the council department’s carbon related decisions\nAll council departments are supposed to monitor how their decisions impact on the council’s move to net-zero carbon emissions. Currently the council is reliant on eagle-eyed Green Party councillors to spot and challenge statements about climate change that don’t add up. Through the CCWG Matthew is exploring an application that automatically tracks every paper created by council officers to ensure that the impacts on the climate are recorded accurately and signed off by senior managers.\nCouncil officers asking Green Party councillors’ advice on energy efficiency issues in the planning of new council housing\nSince Green Party councillors were first elected in 2019, they have been promoting long term improvements to council housing in the Borough. Bryony Holroyd has a huge amount of experience in the energy efficiency sector in relation to fuel poverty, having worked for National Energy Action (NEA). Matthew is a patron on the Passivhaus trust.Between them, Bryony and Matthew have made the case for building the very best quality homes. This will reduce the cost of living for tenants, improve health and reduce ongoing maintenance costs. But more importantly, building houses that are fit for the future will avoid the huge cost of retrofitting insulation and new heating systems further down the line, with all the extra expense and disruption this would create.\nThe Green Group of councillors have taken the opportunity of a new council plan, to press for a commitment to build all new council houses to Passivhaus standards. This sustained lobbying has resulted in officers now asking green councillors for advice on how to assess the benefits of these affordable to heat, healthy homes.\nExtending the range of plant based food offered by council catering services\nDarlington Green Party adopted the Plant Based Treaty last year, committing to reduce the use of animal derived products wherever possible. Matthew is bringing this initiative to the council by asking the catering services in the council to cut their carbon emissions by reducing their reliance on ingredients with a high carbon footprint. Initially this will examine the amount of beef, lamb and dairy products used and look at replacing them with plant based alternatives.\nReview of advertising and sponsorship on council communications\nA review is being carried out looking at all advertising and sponsorship that appears on council assets – print, online, billboards and events. The aim is to ensure council messaging does not promote activities which are potentially harmful or industries which are not socially responsible.This could mean banning the advertising of payday loans, alcohol, gambling, foods high in salt, fat or sugar and high carbon intensity products and services (including petrol or diesel vehicles and flying).",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_author_matthewsnedker_page_3/content_41.html": "3 April 2023 by matthewsnedker\nRead more »\n28 March 2023 by matthewsnedker\n10 February 2023 / 10 February 2023 by matthewsnedker\nAs Britons turn down the thermostat – again, and many turn to food banks, Darlington Green Party Cllr Matthew Snedker believes it’s time for the Tories to accept responsibility for the disastrous outcome of their long years in power. The cost-of-living crisis is a direct result of their policies and lack of planning, he says. […]\n14 September 2021 / 14 September 2021 by matthewsnedker\nBryony and Matthew would like to thank the community groups and concerned individuals who worked with us to submit detailed evidence at the public examination to the Darlington housing plan. Recently, the Government has recalculated housing need using the very latest data and projections. They warn that the Local Plan would attempt to build 40% […]",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_04_03_increasing-proportion-of-darlingtons-children-are-growing-up-in-poverty-after-a-decade-of-conservative-policies-that-harms-our-communities-it-is-time-for-a-fairer-kind-of-politics/content_19.html": "Cllr Matthew Snedker, Coordinator of Darlington Green Party said:\nThe government’s own figures highlight the plight of far too many children growing up in poverty. The Office for Health Improvement and Disparities scores Darlington on 30 measures against the national average.\nOf those 30 measures, which cover a wide range of indicators, Darlington is below the national average 22 times. Not one of these measures of quality of life is improving.\nFrom infant mortality to obesity, hospital admissions for injuries to self-harm and mental health conditions, the children and young people of Darlington are suffering long-term harm caused by the growing inequality and rising poverty directly caused by over a decade of austerity policies brought forward by the Conservative government.\nThe proportion of children growing up in low-income families continues to grow, and the proportion of children starting life in absolute poverty is also on the rise. More than one in four children will have to endure the blight and scaring effects of a poor start in life.\nWhat many people find particularly disgusting, is that this is happening in the seventh richest country on the planet.\nA country where average take home pay has stagnated for a decade, where inflation has steadily chipped away and eroded most people’s spending, stripping the joy and hope from their lives.\nWhile the number of people living in poverty has grown, the amount of help and support offered to them (measured as a percentage of government spending) has fallen. For the last eleven years, the proportion of spending directed their health and education has averaged 20%. In the previous eleven years that figure was 27%. A decision was made to reduce support and to weaken the safety net provided to catch those most in need.\nBut what of the wealthiest people in the UK?\nBetween 2010 and today, the richest sector of our country, the billionaires, have seen their wealth balloon from £200 billion to £653 billion.\nOur country does not have a problem generating wealth, it has a problem making sure that everyone gets a fair share of that wealth.\nWe now know that our millionaire Prime Minister pays an effective tax rate of 22%, lower than many nurses and teachers.\nThe effective tax rate (or withdrawal rate) for someone on the lowest of incomes, claiming universal credit starts at 55% and rises as high as 70%.\nThe policies implemented by successive Conservative governments over the last 12 years have been persistent as they have been cruel.\nThey have pushed more and more families into relative and absolute poverty.\nThe support for people struggling has been reduced.\nThe freedom for the richest to accumulate an ever greater proportion of the nation’s wealth has been increased.\nWe need a government that is committed and brave enough to implement progressive tax changes to ensure that will solve the current economic crisis, tackle the UK’s low productivity problem and restore our crumbling public services.\nA Green Government would; Apply a wealth tax on unearned wealth over £10 million, Equalise capital gains with income tax, Apply national insurance to investment income, End inheritance tax loopholes, Reform the rules on non-dom status, introduce a tax on corporate share buyback schemes.\nTaken together these measures would raise £50 billion per year that would be invested in; Supporting a public sector pay settlement of 7% to support staff retention in our NHS, Insulating people’s homes to lift people out of fuel poverty, Capping bus fares at £1 to lift people out of transport poverty, Extend free early years nursery provision to lift people out of childcare poverty.\nIf we are to avoid another decade of rising inequality, deepening poverty and lost opportunities, we need to print forward a range of bold and transformative policies, both nationally and locally.\nBy voting for Green Party candidates on 4th May voters can show this Conservative government that their time in charge is coming to an end and the public are no longer willing to put up with their cruel and damaging policies.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2025_03_26_darlington-residents-protest-against-plans-by-lolamcevoys-labour-government-to-slash-five-billion-poundsfrom-people-with-disabilities/content_9.html": "Experts at Scope say that seven-hundred-thousand disabled households will be pushed into poverty by the government’s planned changes to welfare.This is a deeply cruel choice for any government to make. And let’s be absolutely clear it is a choice. We could and should be choosing to tax the very wealthiest a small amount more instead. Sadly, though, Lola McEvoy’s Labour government has a growing track record here. They’ve chosen to place extra hardships on those already struggling – from cutting winter fuel payments to pensioners to refusing to reverse the two-child benefit cap, refusing to lift 540,000 children out of poverty. I know that this is not what people who voted Labour wanted, and I don’t think for a second this is what most Labour MPs came into politics to do. I know many Labour MPs will feel incredibly uncomfortable at the< moment. But feeling uncomfortable isn’t enough. We need these Labour MPs to have a moral backbone and vote for what they genuinely believe in to prevent these cruel, unnecessary policies from being enacted. The United Nations Committee on Economic, Social and Cultural Rights has called on the UK Government to take “corrective measures” to address the immense negative impact of welfare cuts introduced by successive Conservative Governments since 2010. Pressure from people like you has already won concessions from this Labour government. Keir Starmer had wanted to freeze inflation-linked rises to PIP payments but the outcry of protest has made him U-turn and throw out this terrible plan. As a Green Party candidate in the last general election, I campaigned for an end to 15 years of cruel and damagingausterity. I campaigned for a fair and appropriately funded social safety net. I spoke up for a system that treated disabled people with respect and gave them the support they needed for a dignified life. Green Party polices will make sure that everybody can lead full, meaningful lives, can work if they choose, and access the help and support they need. Disabled people have as much of a right to control their day-to-day lives and their long-term futures as nondisabled people. Despite the U-turn on inflation linked increases for PIP, I’ve heard nothing from Labour MPs that reassures me the Government will stop scapegoating and stigmatising those in need, while impoverishing them to the tune of £5 billion. Young and disabled people should have the support and backing of the Government but instead they have been badly let down this month with the active trailing of terrifying plans. It’s clear that these plans were plotted without the input of those whose lives will be most impacted. Disabled people must be listened to before any changes are made, and I hope that you will join me in being their fiercest defenders and fight off the worst of these plans. Lola McEvoy and the Labour government must listen as well, to growing calls from Green MPs, the public and even many millionaires for a wealth tax. How can she stoop as low as any Conservative Chancellor and take money away from disabled people rather than get a grip on the obscene wealth being hoarded in this country? This morally indefensible choice will have devastating consequences, and the Government should be ready to answer for it. The Green Party stands in solidarity with disabled people and will fight to reverse cuts by Conservative and Labour governments. We will fight to make sure that disabled people can live dignified lives as valued members of society",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2025_03_26_air-sourced-heat-network-being-explored-to-support-town-centre-and-hospital-decarbonisation/content_7.html": "Green house gas pollution in the UK is driven by three areas of the economy; transport, food and heat. Making buildings more energy efficient through insulation and draft proofing is a good way to reduce energy use, but new sources of energy for the remaining heating requirements will be needed as we realise the opportunities of a net-zero economy.\nDarlington Council’s Climate Change Working Group, Chaired my Cllr Matthew Snedker, has been scrutinising the opportunities for providing a low-carbon heat network for the town centre, extending as far as the Memorial Hospital.\nThe first proposal aimed to used a water sourced heat pump, based on the river Skerne. However, more detailed modelling showed that insufficient water flow in the summer months meant the heating and cooling load would not be deliverable.\nThe current plan on the table is with SSE[1] and is an air sourced system, which has a greater capacity for expansion in the future.\nThe heat network would supply consistent heating water to a number of commercial properties with hard to decarbonise heat requirements. Initial plans are looking to include the Town Hall, Dolphin Centre, government officers, hospital, university and college buildings. There is an aspiration that the project would also be capable of supplying mixed use developments in the town, as well as future mixed-use developments.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2024_09_13_pensioners-in-darlington-may-die-this-winter-unless-the-government-abandons-its-plans-to-stop-around-ten-million-people-from-getting-help-with-fuel-bills-says-a-leading-councillor/content_8.html": "Matthew Snedker, leader of the Green Party councillors in Darlington, today\ndemanded an about-turn on plans to scrap the universal winter fuel\nallowance.\n“I met with members of Age UK today because I am so worried about the way\nolder people in Darlington will be put at risk,” he said. “Labour themselves\nhave estimated that, in England, 4,000 people may die if the policy is\npursued.\n“I join with Age UK and other charities in calling on the Government to pause\ntheir means-testing decision until it can be properly considered as part of\nthe Spending Review next Spring, because we are hurtling towards up to ten\nmillion pensioners losing their Winter Fuel Payment imminently when they\nsimply can’t afford it.\n“In the past, Labour repeatedly warned Conservative governments against\ncutting universal fuel allowance because of the risks to older people. Now\nthey are doing it themselves.”\nChancellor Rachel Reeves announced in July that she intended to restrict\nthe payment to just those who get Pension Credit, which is received only by\nthe poorest old folk. Currently, Pension Credit tops up a single person’s\nweekly pension to £218.15 or £332.95 for a couple.\nThose who qualify currently get £200 to help with winter fuel payments or\n£300 for over-80s.\nCllr Bryony Holroyd, the Greens’ shadow heath and portfolio holder, said:\n“Pensioners in Darlington will be disproportionately affected because we\nhave older, more hard-to-heat properties, our pensioners tend to be less\nwell-off and in poorer health.\n“This Labour decision will deepen the divide between north and south, rich\nand poor.”\nShe said the Green Party supports the principle of universal benefits and are\nclear that many of those who will lose their automatic right to this allowance\nare likely to suffer distress, increased poverty and health impacts. As well as\nthe risk of leaving elderly people having to choose between heating and\neating, the switch away from universal benefits costs more in administration\nand will push up NHS costs as people fall ill and need expensive care in\nhospital.\n“Instead of cutting this allowance, Labour should be funding it through\nclosing tax loopholes and asking the very wealthy to pay a little more.”",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_author_matthewsnedker/content_21.html": "26 March 2025 / 26 March 2025 by matthewsnedker\nExperts at Scope say that seven-hundred-thousand disabled households will be pushed into poverty by the government’s planned changes to welfare.This is a deeply cruel choice for any government to make. And let’s be absolutely clear it is a choice. We could and should be choosing to tax the very wealthiest a small amount more instead. […]\nRead more »\nGreen house gas pollution in the UK is driven by three areas of the economy; transport, food and heat. Making buildings more energy efficient through insulation and draft proofing is a good way to reduce energy use, but new sources of energy for the remaining heating requirements will be needed as we realise the opportunities […]\n15 February 2025 / 15 February 2025 by matthewsnedker\nIntervention by a Green Party Councillor has made sure that Darlington Borough Council will make sure that tackling the climate emergency and protecting the natural environment will be on an equal footing as addressing inequality and efficient resource use. At a recent council meeting Matthew Snedker, leader of the Green Group, shared his concerns that […]\nThe ongoing saga of the indoor market continues as the Labour / Lib Dem cabinet heard confidential information regarding the financial arrangements between Darlington Borough Council and Market Asset Management (MAM) Green and Conservative councillors have protested that a report dealing with such large sums of money should have been scrutinised by the cross-party Economy […]\nDarlington Green Party have expressed their concerns about the LabourGovernment’s proposals to reform the structures of local government.The English Devolution White Paper was published in mid-December with theclaim that Government will devolve more powers to the local level and givepeople more power over the things that matter to them. The proposalsinclude developing new Strategic Authorities […]\n17 December 2024 by matthewsnedker\n14 October 2024 by matthewsnedker\n13 September 2024 by matthewsnedker\n18 June 2024 by matthewsnedker\n23 May 2024 by matthewsnedker",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_09_20_this-is-a-council-that-the-people-said-they-did-not-want/content_22.html": "For the next four years Darlington Council policies will be dictated by eight people whom most voters didn’t want.\nLabour received only 35.1 percent of the votes cast at this month’s elections but they will be in power despite nearly twice as many people voting against them as for them.\nThe leader of the 24 Labour councillors has forged a coalition with the borough’s three Lib Dem councillors, which means that the majority of voters – 60 per cent who chose other parties — have been betrayed, says the Green Party.\nLabour will stick to a cabinet-style system, under which all major policy is decided by just eight members of the “winning” coalition who are personally selected by the council leader.\n“That makes the new council even less democratic,” says Darlington Green Party group leader Matthew Snedker. “One of those eight will be a Lib Dem whose party won just 4.7 percent of the votes.\n“Concentrating all the power of the council in the hands of seven Labour and one LibDem councillors is anti-democratic and dangerous for the borough when most people wanted to be governed by neither party. In addition, there are fears of meddling by Labour’s National Executive Committee following a number of cases where they blocked decisions made by local parties.”\nHe said it was clear from the Green Party’s big gains, receiving 18.7 percent of the vote and five more councillors in Darlington, that people had moved on from two-party politics.\n“The people are calling for more cooperation between parties and are suspicious of any one group holding all the power,” he said.\n“In Darlington, the Green Party now has seven councillors. They understand the importance of avoiding the potential disruption of Labour trying to grab power when they have insufficient councillors to take overall control.\nSenior Green Party members in Darlington understand the need to step up and provide a democratic, stable and proportionate administration for the good of the town.\n“We talked to Labour about our preference for a more open, democratic process, replacing the cabinet system, as we favour committees containing people from all parties,” said Councillor Snedker. “However, Labour wanted to stick with the cabinet system with all the power centralised and decision making in the hands of just 8 controlling councillors.\n“We are deeply disappointed that the Lib Dems have agreed to continue with the controlling cabinet system, despite it being their party policy to improve democracy and transparency in local government.”\nHe said his party will continue to campaign for more open and transparent decision-making in Darlington where all voices are heard and all parties get a say in how our town is run.\n“And we will be standing firm on our pledges to be good stewards of Skerningham Woodland and the surrounding area , through a strong design code, and to take action to deliver a reliable and accessible bus service.\n“People who voted for us because we are the hardest-working party can be reassured that, whatever direction the new coalition takes, our growing Green group will continue to repay voters’ faith in us. Their interests are not only our first priority but our only priority.”",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2025_02_15_alarm-as-no-cross-party-scrutiny-of-new-deal-signed-to-keep-market-hall-operating/content_6.html": "The ongoing saga of the indoor market continues as the Labour / Lib Dem cabinet heard confidential information regarding the financial arrangements between Darlington Borough Council and Market Asset Management (MAM)\nGreen and Conservative councillors have protested that a report dealing with such large sums of money should have been scrutinised by the cross-party Economy and Resources Committee – instead of being rubber-stamped by cabinet.\nConcerns started not long after the Labour administration signed the deal with MAM when stories emerged of MAM’s complex financial arrangements along with offensive and inappropriate behaviour by one of the directors[1][2]. Questions still remain about whether the council received value for money from the contract they signed and are still dealing with today. This points to a lack of due diligence from the outset.\nCouncillor Roz Henderson said: “MAM has consistently over-promised and under delivered. The programme has been behind schedule and scaled back from the original proposal. The revolving door of food traders calls into question if they have chosen the right business model for the historic market building.\nCllr Henderson continued: “If, after proper scrutiny, there is to be an ongoing relationship between DBC and MAM this must be accompanied with much more transparency around the financial situation of the market and oversight by councillors and officers.”\nCllr Matthew Snedker concluded: “The Green Party will work to reinvigorate our town centre and see its future as a place for people to live, work and spend their free-time. We have all seen the town centre events growing in popularity year after year. Closer cooperation between the team who run the activity programme and the market should drive footfall and secure a brighter future for the market hall.”",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_councillors/content_4.html": "Cllr Matthew Snedker\nCollege Ward\nMatthew has three teenage children who all attended Abbey School. He wants to see everyone in College ward benefit from the town’s growth without losing our sense of community. You’ll often see him on his bike around the ward.\nTwitter – @MatthewSnedker\nFacebook – Matthew Snedker\nCllr Bryony Holroyd\nCollege Ward\nBryony has worked in the field of energy efficiency and fuel poverty. Now she divides her time between being a councillor, and caring for her mum. Her aims are to improve the town by making decisions that improve everyone’s health and opportunities for the future.\nTwitter – @CllrBHolroyd\nFacebook – Bryony Holroyd\nCllr Kate Mammolotti\nHummersknott Ward\nWhen Kate heard about the threatened cancellation of the No 16 bus, a vital lifeline for many residents, She joined with Green colleagues to listen to residents’ views. Following action and lobbying the No 16 bus service was saved.\nCllr Anna-Maria Toms\nHarrowgate Hill Ward\nAnna-Maria is a full-time unpaid carer and accomplished artist. She is a mother of six who has had a full and varied career. Her Art Studio is on Back Bowman Street, and her allotment is on Bensham Park. She is committed to speak up for you in council.\nCllr Richard Lawley\nHarrowgate Hill Ward\nRichard grew up in Harrowgate Hill, and lives on North Road with his wife and two children. He works as a data analyst in the telecoms industry . He is passionate about making sure residents are properly represented in Darlington.\nCllr Roz Henderson\nHarrowgate Hill Ward\nRoz lives in Harrowgate Hill and works in finance for a charity. She organised volunteers to support residents during covid & plants trees. She feels that the council should be challenged much more to consider residents and the environment.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_03_28_halt-to-all-dividend-payments-to-privatised-water-monopolies-until-they-stop-dumping-sewage-into-waterways-and-coastlines-say-darlington-green-party/content_12.html": "Darlington Green Party has called for a halt to all dividend payments to Northumbrian Water shareholders and those of Britain’s other privatised water monopolies until they stop dumping sewage into waterways and coastlines. For the first time, the party is contesting every ward at May’s Darlington Council elections and all its candidates are supporting the policy, which echoes a decision by the Green Party national conference at the weekend.\nThe party’s local spokesman, Cllr Matthew Snedker, said: “Our rivers and coastal waters are under constant assault from sewage and agricultural chemicals yet we have no real action from government, water companies or regulatory bodies.\n“What has happened to the precious wildlife that once graced the North East’s rivers must serve as a warnings.\n“Not one waterway, river, lake, estuary or coast in the North east is in good ecological and chemical health at present, with pollution from water treatment plants and agriculture the key sources of the damage.\n“Water companies can dump oceans of sewage apparently with no consequences. The Conservative government is accused of failing to comply with their duties in relation to regulations, including the monitoring and enforcement, of water companies’ own duties to manage sewage. [1]\n“The Conservatives complacency when it comes to our health and the state of our waterways is clear. Targets to clean up the majority of England’s rivers, lakes and coastal waters from a cocktail of agricultural and sewage pollution have been pushed back from 2027 to 2063. [2]\nThis cannot go on. We are calling for Northumbrian Water – and all our water companies – to halt all dividend payouts to shareholders until these deliberate spillages end.\n“The profits and dividends these companies make do not trickle down to customers in Britain. They largely go overseas. The Guardian found last November that around 70 percent of our water industry is in foreign ownership. [3]\n“Northumbrian Water is ultimately owned by CK Hutchison Ltd, a Hong Kong conglomerate registered in the Cayman Islands. Its shareholders received £999 million between 2013 and 2017 alone.”\nNorthumbrian Water’s accounts for the year ending March 2022, showed that revenue increased by nearly 3 percent to £780.1m. The company paid an interim dividend of £58.2m and a final dividend of £55.4m.\nGreen councillor Bryony Holroyd said: “Governments justified privatisation of public services with the mantra that private companies can run them so efficiently they can maintain and improve quality, while having enough left over to make a profit. This has been shown over and over to not be true.\n“In the case of the water companies, they should use their operating income to clean up their act – stop polluting our rivers, and fix all the leaks – only then, if money is left over, should dividends be paid.\n“Northumbrian Water should meet an adequate standard of operating while charging customers fairly – until then, all payouts to shareholders should stop.”\nWater regulator Ofwat says on its website: “In setting price controls our aim is to allow for a return on capital that is no more than necessary for an efficiently-run company to get the funding needed from capital markets.”",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_02_10_845/content_11.html": "As Britons turn down the thermostat – again, and many turn to food banks, Darlington Green Party Cllr Matthew Snedker believes it’s time for the Tories to accept responsibility for the disastrous outcome of their long years in power.\nThe cost-of-living crisis is a direct result of their policies and lack of planning, he says.\nHe blames the root cause of this nation’s suffering on the Tories’ failure to take decisive action over fossil fuels and energy efficiency measures that would save everyone money. The results are: inflation in double figures; food and other basics up a staggering 16.8 percent[1] and domestic gas and electricity rocketing by 132 percent[2] and 65 percent[3] respectively. Yet median wages have fallen since the Conservatives took office in 2010.[4]\nCllr Snedker said: “While people struggle to juggle final demands, all we hear from the Conservatives is excuses that blame other people. They refuse to accept any responsibility at all.\n“It is mainly our reliance on fossil fuels which stokes inflation and wrecks our economy. We have understood for decades that the price and supply of gas and oil is in the hands of dictators, despots and religious fanatics. By refusing to break the UK’s addiction to fossil fuels the Conservative government has left industries and consumers at the whim of international price fluctuations. The war in Ukraine caused this latest spike in prices but it is inevitable that other price shocks lie in the future.\n“It’s only the Conservatives’ unwillingness to act in the long-term interests of the UK as a whole that is preventing them shifting to an economy largely free from fossil fuels.\n“Even when they do intervene on fuel bills, they do it in a way that encourages unfettered profiteering by energy companies[5] and Shell[6] and BP[7] report record profits.\n“One of the best ways to literally insulate people from rising energy costs is to insulate their homes. Because the cheapest energy is the energy you never have to use.\n“Over the last 13 years, I have watched with growing frustration and anger as, time and again, the Conservatives have failed to meet even the most modest energy efficiency targets. Instead, their decisions have added over £2.5billion to the country’s energy bills and they slashed insulation programmes by 90 percent after David Cameron infamously decided to ‘cut the green crap’.[8]\n“So, don’t fall for Conservative hand-wringing and excuse-making, when they try to blame Vladimir Putin for the lengthening queues at food banks and people being forced onto pre-payment meters. See through the distraction when your shrinking pay-packet doesn’t go so far and Conservatives say you need to learn how to budget better.[9]\n“Of course, there are other reasons that the UK population are suffering more than all other major economies — including sanctions-hit Russia. There are long-running disadvantages from Brexit and the short-lived but spectacularly disastrous Liz Truss regime has raised mortgage payments up by £3,000 a year. [10]\n“There is no time to waste. We need to bring forward the Green Party’s affordable and sustainable plans to make fuel bills more affordable, make homes easier to heat and pay workers a decent wage for a day’s work. “We need to provide an emergency grant to homeowners, landlords and councils to fund immediate insulation improvements to those at risk of fuel poverty.[11]\n“We need to invest in domestic energy security by massively ramping up onshore and offshore wind and solar power and reintroduce the feed-in tariff at a high rate for homes and community projects.\n“We need to scrap the National Insurance (NI) increase, abolish the lower rate of NI on higher earnings and temporarily remove VAT from domestic fuel.\n“Our investment in insulating homes would generate well-paid, sustainable jobs, provide decent, warm homes and slash fuel bills by up to 90 percent.\n“All of this would bring a return to living our lives without daily fears of destitution. And it would ensure that profiteering energy corporations wouldn’t get their hands on people’s hard-earned income.”\nENDS\nContacts\nMatthew Snedker matthewsnedker@icloud.com\n07780807059\n[1] https://www.instituteforgovernment.org.uk/explainer/cost-living-crisis\n[2] https://www.ons.gov.uk/economy/inflationandpriceindices/timeseries/czda/mm23\n[3] https://www.ons.gov.uk/economy/inflationandpriceindices/articles/costoflivinginsights/energy\n[4] https://fullfact.org/economy/employment-since-2010-wages/\n[5] https://www.theguardian.com/business/2022/aug/02/big-oil-profits-energy-bills-windfall-tax\n[6] https://www.bbc.co.uk/news/uk-64489147\n[7] https://www.reuters.com/business/energy/bp-smashes-forecasts-with-82-billion-profit-2022-11-01/\n[8] https://www.carbonbrief.org/analysis-cutting-the-green-crap-has-added-2-5bn-to-uk-energy-bills/\n[10] https://www.independent.co.uk/news/business/mortgage-payments-2023-bank-of-england-b2244218.html\n[11] https://www.greenparty.org.uk/news/2021/09/20/emergency-insulation-grants-fuel-poverty/",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_09_20_darlington-waterways-at-risk-of-even-more-pollution-as-environmental-laws-are-ripped-up/content_34.html": "Darlington’s rivers, ponds and becks are now at greater risk of pollution after the Government ripped up laws that require house-building projects to protect water quality, say Darlington Green Party.\nThis can only worsen nitrogen pollution in the Skerne and Tees, which is already too polluted, according to Natural England. The “nutrient neutrality” laws were essential for protecting Darlington’s rivers, wildlife, and the Teesmouth & Cleveland Coast Special Protection area in the Tees estuary. Water quality in the Tees had decreased over recent years, reaching critical levels last year. Hence, Natural England put the whole river catchment – including Darlington – under the nutrient neutrality scheme.\nThese rules meant that local authorities shouldn’t approve any new development expected to add to river nutrients – through sewage from new homes and run-off from building sites – until such pollution was reduced to cause no overall increase. Under that UK law, home developers – such as the ones set to build Skerningham Garden Village and the Neasham Road development – had to pay for credits to offset water pollution from their housing developments. This should have protected the waterways close to the development sites or contributed to government approved schemes elsewhere, including creating new wetlands or planting new woodlands, to reduce nitrate pollution.\nYesterday’s announcement means that, in future, the taxpayer – not house-builders – will fund improvements needed to ensure no extra nutrient pollution. Local authorities will reportedly be able to choose whether to charge housing developers to cover the cost, or not. If that’s the case, Darlington Green Party await with interest what the borough council decides to do.\nThe Home Builders Federation stated the main barriers to house-building are high costs, skills shortages, and high interest rates, so relaxing these environmental rules may not “unblock” development as much as the government hopes.\nCllr Bryony Holroyd, deputy leader of the council’s Green Party group, says: “People are already in uproar about the state of our polluted rivers and coastal waters. Every time we have heavy rain, the Combined Sewage Outflow near South Park releases raw sewage into the Skerne.\n“Officially allowing developers not to have to provide, or pay for, ways to reduce the extra nutrients from the new homes, is accepting that this situation will get worse. Making the taxpayer pay for their pollution is also not acceptable. It IS possible to build homes carefully, without negatively affecting the environment, but this Conservative government are choosing to make it cheaper for house-builders – so they make more profits – rather than doing the right thing long-term.”\nDavid Clark, of Skerningham Woodland Action Group, says: “It is very upsetting for many of us who are concerned about our local environments and the wildlife that depend on them, especially after the mass die-offs we saw in the Tees estuary and coast in late 2021, cause unknown. We do know there are leaking sewage pipes (reported many times, to no avail) in Darlington to which more new homes are being connected, and the Environment Agency are concerned about our sewage treatment capacity. Every effort to keep pollutants from getting into the river Skerne, that flows into the Tees, must be made. We need major investment in our sewage treatment works, and upgrading pipe capacity before new homes are built. Sadly, residents get the feeling that money and more council tax revenue speaks louder than the concerns of Darlington residents.”",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_10_21_darlington-green-party-offer-solidarity-to-cepac-workers/content_40.html": "Dear CEPAC Workers,\nDarlington Green Party believes that working people should receive a decent, living\nwage and be entitled to a sufficient level of economic security to meet their needs.\nEvery worker should have the right to fair income security. This is a particularly\nimportant issue facing local people at the moment due to rising rents and energy bills.\nWe support the right of working people to form and join democratic and self-governing\ntrade unions, without restriction by employer or government. The Green Party share the\nunions’ belief in working together to give individuals more say in their own lives.\nWe understand that CEPAC Ltd has failed to enter into meaningful negotiations with you\nand is considering dismissing staff who are on strike. We support your strike action and\nurge CEPAC to reconsider their actions.\nIn solidarity,\nMartin Wood\nJoint- Coordinator,\nDarlington Green Party",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_09_28_councillor-activity-in-harrowgate-hill-and-hummersknott/content_33.html": "Our new councillors have been settling into their roles and have already done lots of work for their residents. These are the kinds of things our new Green councillors have been getting up to.\nHummersknott\nKate and Thom have had a great welcome and have held two councillor surgeries at Salutation Hall and one street surgery. The issues they’ve picked up on behalf of residents include: dealing with an abandoned car, quad bike joyriders near Baydale Woods, complaints about road surfaces on several streets, lots of tree issues and ongoing concerns regarding cuts to bus services.\nThom met with the local PCSO to go through crime associated issues across the ward and to organise a joint meeting with the Hummersknott and Carmel School Headteachers to discuss anti-social behaviour issues affecting school children.\nFor September they have planned a speedwatch session on Hummersknott Avenue, an action day tidying Cemetery Lane, school visits and a meeting with the council arborist (tree specialist) to try and resolve some of the more tricky tree cases.\nHarrowgate Hill\nAnna-Maria, Richard and Roz have held three councillor surgeries at St Mark’s Church Hall and one street surgery, and have regularly attended the Bread and Butter thing at Elim Church. They met with a great response and some residents commented how pleased they were to see their councillors active in their area. On behalf of their residents they’ve arranged for a tree to be cut back to allow access to a footpath and for the reinstatement of a parking bay at the Morrisons Local, got the council to clear up fly tips (and send letters to the residents they think may be responsible), got a damaged bus stop repaired and streets cleaned, and chased various incidents of anti-social behaviour.\nFor September they have planned another ward surgery, a Pick, Pie and Pint (litter picking) session, and Police And Communities Together (PACT) meeting.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_category_uncategorised/content_10.html": "26 March 2025 / 26 March 2025 by matthewsnedker\nExperts at Scope say that seven-hundred-thousand disabled households will be pushed into poverty by the government’s planned changes to welfare.This is a deeply cruel choice for any government to make. And let’s be absolutely clear it is a choice. We could and should be choosing to tax the very wealthiest a small amount more instead. […]\nRead more »\nGreen house gas pollution in the UK is driven by three areas of the economy; transport, food and heat. Making buildings more energy efficient through insulation and draft proofing is a good way to reduce energy use, but new sources of energy for the remaining heating requirements will be needed as we realise the opportunities […]\n15 February 2025 / 15 February 2025 by matthewsnedker\nIntervention by a Green Party Councillor has made sure that Darlington Borough Council will make sure that tackling the climate emergency and protecting the natural environment will be on an equal footing as addressing inequality and efficient resource use. At a recent council meeting Matthew Snedker, leader of the Green Group, shared his concerns that […]\nThe ongoing saga of the indoor market continues as the Labour / Lib Dem cabinet heard confidential information regarding the financial arrangements between Darlington Borough Council and Market Asset Management (MAM) Green and Conservative councillors have protested that a report dealing with such large sums of money should have been scrutinised by the cross-party Economy […]\nDarlington Green Party have expressed their concerns about the LabourGovernment’s proposals to reform the structures of local government.The English Devolution White Paper was published in mid-December with theclaim that Government will devolve more powers to the local level and givepeople more power over the things that matter to them. The proposalsinclude developing new Strategic Authorities […]\n17 December 2024 by matthewsnedker\n14 October 2024 by matthewsnedker\n13 September 2024 by matthewsnedker\n18 June 2024 by matthewsnedker\n23 May 2024 by matthewsnedker",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_11_21_latest-skerningham-consultation/content_23.html": "Some of you, although probably not many, would have spotted that a further step in the consultation process for the Skerningham development took place at the beginning of November. There has been deep dissatisfaction from residents about how this consultation has been set up and organised.\nUnbelievably, there was no advance announcement or publicity by the council for these “consultation events” about the builders’ master-planning stage. In fact, the council was later at pains to make it clear that the sessions had nothing to do with them and that they were arranged by the developers.\nThe first anyone knew about it was when leaflets arrived at just 4,000 households in the northern part of town (the rest of Darlington’s 108,000 population were left in the dark and even some houses very close to the proposed development didn’t get a leaflet). Even those lucky enough to be informed were given only a few days’ notice of just four events, all scheduled within working hours.\nPressure from Green Party councillors and local people led to one additional session being arranged, which took place at 5-8pm, and to the extension of the closing date for comments – November 30th instead of 19th.\nPeople who attended the events found out nothing new about the project, lots of questions remained unanswered, and there was one instance of two people asking the same question at different times and getting completely different answers.\nThe Masterplan itself is supposed to be a comprehensive planning document containing lots of details – this was definitely not comprehensive and, most worrying, there appeared to have been no changes made to the Design Code after previous consultations and workshops.\nAn overriding theme was the feeling that the whole thing was nothing more than a box-ticking exercise.\nAny comments on the scheme will only be considered if sent in writing to www.skerningham.co.uk by Thursday November 30th.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_about-us/content_30.html": "The Green Party is growing fast. We now represent people in Westminster and in a record number of local councils, as well as in the London Assembly.\nHere in Darlington, following the council elections in 2023, we have 6 Councillors\nWe’re working progressively on local issues; to improve the lives of all people in Darlington, and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies, we believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Darlington.\nThe Green Party Political Programme sets out what Greens are in politics to do: to end the system that keeps hurting the environment and all of us who rely on it – and to build a better alternative.\nThis Programme isn’t like other parties’ manifestos, it has not been squeezed through focus groups and stripped down according to the latest polling. Instead it has been built from policies proposed and voted on by our members, looking to secure the long term future of the places and people they love.\nIt’s a vision of a better world, and together we can deliver it.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_contact/content_27.html": "Skip to content\nSkip to footer\nDarlington\nMenu\nNews\nPeople\nCouncillors\nAbout us\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_03_28_voters-want-a-new-party-thats-us-say-darlington-green-party/content_38.html": "An opinion poll which shows nearly two-thirds of UK electors trust neither Tory nor Labour politicians is backed-up by doorstep canvassing in Darlington, say local Green Party councillors.\nAn annual survey has indicated that around 61 percent of people in the UK think the country “needs a completely new type of political party to compete with the Conservatives and Labour for power”.\n“We think that figure is about right,” said Green Councillor Matthew Snedker. “Our members have already been out talking to people about the forthcoming council election and they are hearing very similar comments.\n“We are increasingly confident that on polling day, 4th May, the old parties will be rejected by voters after their policies have led to poverty, inequality and division.\n“People are telling us that they are ready to give a new kind of politics a try and more people than ever are saying they will vote Green in May.”\nThree-quarters of people told communication firm Edelman’s annual “Trust Barometer” that they thought the UK was heading in the wrong direction, a record figure since the survey started in 2001. Two thirds thought inequality was increasing and one-in-five people were either considering using a local food bank or had already been to one.\nDarlington elected its first two Green councillors in 2019, since when the local party has increased membership and support. This rise in support means that they will be standing a candidate in every council seat.\nThe town’s other Green councillor, Bryony Holroyd, said the party’s growth was led by its members’ and supporters’ listening to local people and focusing on community issues, rather than ideological dogma.\n“We’ve been working with Darlington communities over many issues, particularly the new Local Plan for housing and controversial plans for Skerningham and Blackwell.\n“We’ve campaigned against cuts to bus services and for more effective measures to boost town centre businesses than just short-term cuts to parking fees on the run-up to an election.\n“We work hard all year round, supporting local communities to tackle the issues they care about, not pushing ever-changing policies dictated by party leaders in London who come and go.\n“On 4th May, every one of those Darlington people who told the Trust Barometer that they want a new kind of politics will now have the chance to vote for a fast-growing party that looks at the whole picture before making decisions that affect the lives and welfare of us all.”",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2024_10_14_darlington-council-cabinet-to-discuss-skerningham-masterplan-without-involvement-from-other-councillors/content_37.html": "On December 3rd, Darlington Council could put a freeze on the builders’ masterplan for 4,500 unnecessary houses on the rolling, rural acres of Skerningham. But they won’t.\nThat’s when the Council cabinet and officials will discuss Theakston Estates’ “masterplan” for a “garden village” there. They don’t have to. Nor does the full council. Legally, council officers could do the required check that the masterplan complies with the council’s Design Code and the Local Plan.\nBut objectors, including Skerningham Woodland Action Group (SWAG) have been so vocal and effective that the council wants to appear a bit sympathetic.\nWhen not in office, both Labour and Tory groups have cried crocodile tears about the despoilation of the borough’s rural “jewel in the crown” and the devastation of its rare animals, birds and vegetation, but when in power they let the scheme continue.So SWAG sent a questionnaire to every councillor asking whether they are for or against the whole scheme and whether they think the masterplan should go to full council. SWAG had replies from the deputy leader of the Labour group (but not his 23 Labour colleagues); three Conservatives (out of 13 councillors) ; six of the seven Green Party councillors, neither of the two Lib Dems and none of the four Independents.\nHere are their comments:\nLABOUR\nDeputy leader Chris McEwan (Haughton & Springfield ward)It has been the case, and has been for many years, that anyone – meaning residents and any Elected Member – can attend Cabinet and speak on any Agenda item. As I have said before, it is also the case that the Masterplan, which is not a Council document that would form part of the Council’s Policy Framework, does not need to be adopted through a decision at Full Council. Local Development Documents, such as the Design Codes for (Greater Faverdale) Burtree and Skerningham Garden Villages, have been presented to Full Council as their approval is governed specifically by legislation. In the case of the Skerningham Masterplan, there is a requirement for a technical assessment to ensure that a draft Masterplan conforms with the Local Development Plan (i.e. Darlington’s Local Plan 2016-2036) and the adopted Design Code. The nature of a Masterplan means that there is no governance requirement for a Decision on adopting the document to be made by Cabinet, Council, nor at any meeting in public. As I have also said, the current Cabinet have reflected on the strength of feeling within the community and have determined to bring the draft Masterplan to a future Cabinet meeting to allow for discussion of the proposal in public because, as per the above paragraph, Cabinet meetings are open for anyone to attend and express their thoughts on any item of business. Whether or not I agree, the principle of development for Skerningham Garden Village is established through its status as a housing allocation within the Local Plan. The Plan had been through Examination by an independent Inspector and found to be sound, including the allocation at Skerningham, and was adopted in February 2022 by the Conservative Council at the time. At the time of adoption, the Labour Group rejected the principle of Skerningham Garden Village and, working with other Parties within the Council, attempted to remove the allocation. Labour is focussed now on ensuring that any development that takes place within the allocated site is of the highest quality and will work to maximise the benefits of the development for residents, with a focus on protecting and enhancing the natural environment wherever possible, including Skerningham Woods. I hope this clarifies.\nCONSERVATIVE Scott Durham (Brinkburn & Faverdale)\nAs a member of Cabinet at the time I supported Cllr Bartch pausing of the design code in early 2023. He wanted to consult more with residents, look at how Skerningham could be more accessible and include protections for trees.\nWe also needed to look at how the design code could be used to restrict traffic from the sites down Barmpton Lane and Green Lane.\nUpon taking control the Labour Group ignored this and removed protections for Woodland put in place. It’s because of the above I am against the development.\nSimilarly In my ward we have Burtree Garden village where I spoke at planning asking them not to approve an application, as expected benefits ie link road at the moment will be a road with a dead end and put further pressure on the A68.\nIn terms of Council decisions I’m assuming your referring to the Masterplan? It’s obviously not a Council document, without a usual route to Full Council and therefore can be dealt with by the ruling cabinet, rather than Council as with the Design code.\nHowever in my opinion the ruling coalition needs to be seen to doing the right thing, listening and being as transparent as possible. For me they are missing an opportunity and should bring the paper to full council.\nAndy Keir (Whinfield)\nI do not support the Skerningham housing development and have objected due to the lack of highways infrastructure and for the disruption that it will cause in Whinfield ward because there is limited access without adequate roadways into that area. Absolutely the decision should go to full council and a named vote. Jamie Bartch (Whinfield)\nIn answer to your questions, I currently sit on the Darlington Planning Applications Committee and as such cannot have a predetermined position. I absolutely think the decision should come to full council.\nGREEN PARTY\nMatthew Snedker, Green group leader (College)\nI have been a long-term opponent of the Local Plan. It was built on inflated housing needs assessment, bought from a private company, when the ONS was unable to give a high enough figure. The plan was developed by the Labour group, in conjunction with the Conservative and LibDem groups.\nThe four-year hiatus in Labour’s decades of power, led to the plan becoming a political football. A process that generated more heat than light.\nThe new national Labour government has produces new housing needs assessments, that many are finding difficult to match to reality.\nThe new, centrally allocated, housing assessment for Darlington is only 8 higher per year that the one bought from ORS. Far from being a vindication of the Local Plan, this illustrates just how high the ORS figure was. While other local authorities gasp as the sky-high figure imposed on them from London, Darlington’s Labour administration imposed the figure on themselves.\nLet me be clear, Darlington does need new houses to buy. And the private rental sector also needs drastic reform. Our Right Home Right House, Right Price pledge would make sure that affordability, sustainability, and connectivity are all considered when planning the new communities we will build in our town. It will need action at a national level to unlock the strangle hold that land-banking and housing developers baked in 20% profit margin have on our housing market.\nMy answers: At some time in the future, I may have a vote on a planning application that flows from the current Local Plan, Design Code and /or Comprehensive Master Plan. The risk of displaying predetermination, is that I could be challenged and forced to absent myself from a vote.\nI am concerned that the Skerningham garden village will not be able to meet the needs of affordability, sustainability, and connectivity that the town needs. Any detailed planning applications that come forward would need to meet these three requirements at a very high level for my concerns to be assuaged.\nI understand that the CMP, unlike the LP and the DC, is not a council document. However, the view of the council as a whole on this important document should be sought.\nA vote at a meeting of the full council would be the appropriate place for members to express their views on the CMP.\nRichard Lawley (Harrowgate Hill\nI really appreciate everything you have been doing to help my residents understand the issues around the development. Unfortunately, as a member of the planning committee I can’t publicly commit to a stance on the development as it would show that I pre-empted the planning decision and could stop me being able to vote on the application. Apologies I can’t say more.\nRoz Henderson (Harrowgate Hill)\nI have many reservations about the building of Skerningham Garden Village. See below for the main themes. Loss of green space, specifically a road through Skerningham Woods Wrong type of housing and not the type we need Lack of ambition with regards future proofing of housing leading to need to retrofit in the future Lack of infrastructure, either short term, medium or long term. Includes medical facilities, schools, retail, employment opportunities Lack of a clear plan for sustainable transport which likely will lead to a much larger amount of traffic, congestion & emissions on the road I’ve spoken up about these concerns in the past both before and after I became a councillor, either by attending consultation meetings, asking questions at council meetings or putting in submissions to the various consultations. I personally feel we should be creative in finding space for the right type of housing before letting developers take the easy option to build on our precious green spaces. We should be maximising the targeting of empty houses, brownfield sites, retail units to convert into residential units and how we can better utilise the housing we already have. There should be wider reforms such as looking at the Right to Buy and rent controls. Q: Do you think the decision should go to full council? Are you happy for cabinet to decide? My preference would be for the comprehensive masterplan to go to full council. I feel this would better for democracy & transparency and involvement of residents. If the Masterplan does go to full council, I am keen to avoid any issue of predetermination on this post so that I am not forced to absent myself from the vote. I will consider what is in front of me with a fresh pair of eyes before I make my decision but I would be looking to see my concerns above being addressed. Should the masterplan not go to full council, I would encourage members of SWAG to attend to speak.\nAnna-Maria Toms (Harrowgate Hill)\nI attended the Design Code meetings before becoming a councillor and do not think that Skerningham is the most appropriate place to build houses, it was marked as the site of what was hoped to be a Tees Forest and houses many red and amber listed wildlife species, plus it is often flooded. However I do believe that we need many more houses because we will see a massive influx of environmental and war refugees in the next 30 to 50 years. We should be utilising brown sites to ensure as much farmland is retained for us to feed ourselves in the future. And any houses built should match the need of the town. Unfortunately the Local Plan is in effect now so my views are a mute point. Legally the Local Plan which both the Labour and Conservative councils previously heralded is a document that developers can demand be followed, the SPD that we have was developed with DesigNE and I do trust that they want to produce the best outcomes from the situation we are now in. They have been retained by the council as an independent body to ensure that any planning applications match the legally binding Local Plan and SPD. The masterplan should logically follow the Local Plan and SPD but it is not a council document, and is from my understanding akin to a designers mood board, a developers ideas document that holds a vision of what could be achieved. And that could is important because any application that goes to planning should be held to the legalities of the Local Plan not the masterplan. And that is where DesigNE come in again, and the councillors along with planning officers to ensure that developers are following the rules. Officers told us that this masterplan would not be adopted by the local authority as a supplementary planning document and as such does not hold the same weight as The Local Plan and current SPD. The masterplan in this state will be under regular review and flexible to adapt. For example, any road and proposed route may change due to cost/substrate. If that is the case I am happy to leave the planning committee and cabinet to ensure that it is fit for purpose as it is not my area of expertise, and it bears no significant relevance to the individual planning applications that will follow. If indeed it is to be adopted and become an SPD it definitely needs to come to full council, and councillors have time to properly engage with residents about it. Looking at the government website it states that ‘care should be taken to ensure that masterplans are viable and well understood by all involved and that graphic representations of what the development will look like do not mislead the public by showing inaccurate details or significant elements not yet decided upon.’ Paragraph 007 Reference ID 26-007-21091001. I am a realist and think that the best thing that I can do is to ensure that any planning application that comes into the council is carefully cross referenced againt the Local Plan and any SPDs, I rarely get chance to vote on these as I am not a member of cabinet or on the planning committee but I can point discrepencies out. As can any member of the public, and planning would like these to be pointed out as soon as possible so that they can be acted upon. Kate Mammolotti (Hummersknott)\nI do not support the Skerningham Housing scheme, as firstly, I am passionately opposed to Darlington’s equivalent of green belt being built on at all, for environment protection reasons. Most unfortunately it is not termed green belt, rather greenfield, otherwise we would not find ourselves in this current position. Secondly, this scheme does not reflect the kind of housing we actually do need in Darlington. I think the only democratic decision would be for it to go to full council.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_author_matthewsnedker_page_2/content_39.html": "18 March 2024 / 18 March 2024 by matthewsnedker\nRead more »\n21 November 2023 by matthewsnedker\n21 October 2023 by matthewsnedker\n28 September 2023 by matthewsnedker\n20 September 2023 by matthewsnedker",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_09_20_after-a-decade-of-grinding-austerity-council-tax-rise-may-be-the-last-straw-for-people-in-this-cost-of-living-crisis/content_31.html": "Green councillors in Darlington have written to Michael Gove, Secretary of State for Levelling Up, Housing and Communities, “to ensure proper funding of local services and sound policy that works for people, not profit.”\nGreen Party Councillor, Matthew Snedker has called for a three-year funding settlement, an increase in all council budgets in line with inflation, an increase in investment for retrofitting homes and in services for the most vulnerable, particularly adult and child social care.\nCllr Snedker says: “It makes no financial sense to cut local government funding to the point where we can no longer deliver even basic services. Quite apart from the devastating effect it has on people’s lives, it’s poor value for money as it increases costs in the long-term.”\n“Now is precisely the time for national government to fund Darlington Borough Council fully, so that we can work to protect the most vulnerable and build resilient, joyful communities, so we can serve our residents in the way they deserve and give them hope for the future.”\n“Our Council is at breaking point. Even when we factor in a 4.99% increase in council tax, the finances are in a mess. The projections are that the Conservative-led council will run at an average loss of £9,726,000 each year up to 2027. When the reserves have been spent, this will leave a £13 million black hole in the balance sheet with no sign of how it will be filled.\n“The Conservative head of the Local Government Association has said: ‘the numbers just do not add up,’ and added: ‘We desperately need to protect budgets and services from the impact of inflation, without which there will be real service cuts to some of the most vulnerable in our communities.’ [1].\nCouncillor Bryony Holroyd said: “As councillors, we work hard to build communities that are fairer, greener and healthier. We work to support local businesses, deliver vital services and protect and improve local environments.\n“To do so effectively, councils need a guaranteed 3-year funding settlement from Michael Gove sufficient to cover the essential services that they deliver – proportional to the need in their area – and increased in line with inflation.\n“Currently our council has to navigate a bewildering array of 448 different short-term grant and funding streams, often with short deadlines, this is no way to run an efficient local government. We need funding certainty so we can increase investment in adult and child social care. We need it to fund the insulation of our homes to make them more affordable and safer for residents to keep warm.\nCllr Snedker concluded: “Residents of Darlington have endured a decade of grinding austerity and council services have been stripped back to barely above the statutory minimum. Quite frankly the strain is showing. People are rightly asking which services will be cut back, or disappear for good but most of all I’m hearing from people who are worried that the increase in council tax is the last straw in this cost of living crisis.\nNOTES:",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2021_09_14_unsustainable-housing-plan-challenged/content_32.html": "Bryony and Matthew would like to thank the community groups and concerned individuals who worked with us to submit detailed evidence at the public examination to the Darlington housing plan.\nRecently, the Government has recalculated housing need using the very latest data and projections. They warn that the Local Plan would attempt to build 40% more houses than we need. We risk surrounding the town with part finished and abandoned speculative developments.\nYour Councillors are committed to avoiding these disastrous consequences by challenging the Plan.\nSee the crowd funded video that shows what could be lost, as Darlington’s Jewel in the Crown – Skerningham Community Woodland – is threatened with being razed to the ground. https://www.youtube.com/watch?v=e12GY0dkYYg\nTo help us fight this plan and save the towns from the unsustainable Darlington housing plan, join the Green Party.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_news_page_3/content_5.html": "Increasing proportion of darlington’s children are growing up in poverty – After a decade of Conservative policies that harms our communities it is time for a fairer kind of politics. 3 April 2023 by matthewsnedker Read more »\nVoters want a new party? That’s us, say Darlington Green Party 28 March 2023 by matthewsnedker Read more »\nGreen Party candidates call for clarity over decision to extend Teesflex bus service 28 March 2023 by matthewsnedker Read more »\nHalt to all dividend payments to privatised water monopolies until they stop dumping sewage into waterways and coastlines, Say Darlington green party 28 March 2023 by matthewsnedker Read more »\nTHIRTEEN years of incompetent government and disdain for ordinary people’s struggles have left Britain freezing and starving, says Darlington councillor. 10 February 2023 / 10 February 2023 by matthewsnedker As Britons turn down the thermostat – again, and many turn to food banks, Darlington Green Party Cllr Matthew Snedker believes it’s time for the Tories to accept responsibility for the disastrous outcome of their long years in power. The cost-of-living crisis is a direct result of their policies and lack of planning, he says. […] Read more »\nToo many houses in the wrong place! 14 September 2021 / 14 September 2021 by matthewsnedker Bryony and Matthew would like to thank the community groups and concerned individuals who worked with us to submit detailed evidence at the public examination to the Darlington housing plan. Recently, the Government has recalculated housing need using the very latest data and projections. They warn that the Local Plan would attempt to build 40% […] Read more »",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk/content_1.html": "Skip to content\nSkip to footer\nDarlington\nMenu\nNews\nPeople\nCouncillors\nAbout us\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nWelcome to Darlington Green Party\nYour local Green Party for all of Darlington\nHelp get Greens elected in Darlington\nLatest News\nDarlington residents protest against plans by LolaMcEvoy’s Labour government to slash five billion poundsfrom people with disabilities.\nby matthewsnedker\n26 March 2025\nAir sourced heat network being explored to support town centre and hospital decarbonisation.\nby matthewsnedker\n26 March 2025\nGreen Councillor’s intervention means that tackling climate change remain a top priority for darlington borough council.\nby matthewsnedker\n15 February 2025\nAlarm as no cross party scrutiny of new deal signed to keep market hall operating.\nby matthewsnedker\n15 February 2025\nLocal Government control eroded by so-called devolutionproposals\nby matthewsnedker\n15 February 2025\nUpcoming Events\nNo upcoming events\nTo top",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_10_21_report-from-the-latest-full-council-meeting-labour-tries-to-tighten-their-grip-on-power/content_26.html": "The latest full council meeting was held on 28th September. There was a big turnout from the public (around 45, which is a lot more than usual), lots of interventions from Green councillors, and it didn’t finish until 12.30am.\nDuring the proceedings Green councillors tabled three positive and well considered amendments but the Lib/Lab coalition voted en bloc against them all.\nOur first intervention was a proposed amendment to the Skerningham design code – see more about this below.\nThe Lib/Lab coalition claim to support greater cross-party cooperation and consultative policy development. Yet they brought forward a motion to set up a Scrutiny Committee Working Group to examine council decision making and scrutiny processes, with no advance warning or consultation.\nWorse still, the Labour group thought it acceptable to pack this working group with five of their members out of a total of ten.\nOur second proposed amendment was to correct this injustice by giving each party two seats on this working group and also include the one independent councillor. This was blocked by Labour and the Lib Dems (despite the Lib Dems saying that they agreed with our position).\nA party with only 32% of the popular vote (Labour) thought it acceptable to tell a party with 18% (Green) that this was balanced! The reason given was that scrutiny committees reflect the make-up of the council and they wanted to preserve the current system of allocating seats. But the fact that the council has dysfunctional processes is the reason reform is so badly needed. This gives us no confidence in their actual commitment to cross party collaboration.\nOur third amendment was to add to the terms of reference of this working group. We proposed that it should also include the consideration of alternative democratic decision-making structures. This would have provided the Council with an opportunity to make the process more open and inclusive, allowing a wider group of councillors to be involved and bringing these discussions into a public forum. This ammendment was also voted down by the administration.\nOur Green councillors will continue to fight for positive change in the council and we know this has the backing of hundreds of our members and supporters in the Borough. The high public turnout at the meeting and their carefully considered questions demonstrate this.\nIf we could keep up this level of visible public support it will put pressure on the ruling group to engage more meaningfully with the sensible, sustainable policies, and ways of working that Greens promote. If you can’t come to council meetings you can still contribute by writing to your councillors, sharing relevant messages on social media and writing to the Northern Echo letters page. If any member or supporter wants help with any of this, drop us an email.\nThe latest on the Skerningham development\nThe Skerningham housing development took another step forward at the council meeting but not before Green Councillors had tried to safeguard the woodland area and members of the public had given the scheme a grilling.\nThe Design Code, which gives the developers guidelines on style and quality, was finally approved at the meeting after a long process of consultation and amendments. Harrowgate Hill Green Councillor Richard Lawley proposed one final amendment to specifically prevent a road from cutting through the area’s woodland and to make it safe for pedestrians, cyclists, and others.\nThe amendment was carefully worded to add clarity and would have gone some way to give confidence to the public about the intention to protect the woodlands. Despite confirmation that our amendment did not conflict with the local plan nor the design code, Labour chose to block it and the amendment was defeated.\nCouncil Deputy Leader Chris McEwan said the current wording, advising that the road is to avoid woodland “as much as possible” was sufficient. It was apparent that the public, who came close to outnumbering the councillors, did not agree.\nTheir questions were answered by Cllr McEwan amicably but with little further light being shone on the issues, though he did say there had been no formal approach from Darlington FC about a new stadium in Skerningham.\nQuestions from the public included:- Why it was necessary to build so many relatively expensive houses on beautiful, rural land when Darlington already builds nearly four times the Government-advised number of houses each year and the real need is for small, affordable homes near existing facilities.\n- Whether account had been taken of the sensitivity surrounding the woodland site where at least three full-body burials had taken place among the extremely rare black poplar trees.\n- Why, when it came to calculating potential pollution impact, occupancy figures predicted were only 1.1 newcomers to the area in each house – half the current Darlington average of 2.2 occupants per house – greatly reducing pollution protection costs for the developers.\n- What happened in 2015 to make the council change its mind between first ruling that Skerningham was unsuitable for housing and then, only a few months later, approving such use.\n- Does the council have no concern for the impact on the area’s multifarious flora and fauna, which includes large numbers of critically endangered or “at risk” species, particularly if the woodland is bisected by a road.\nThe next stage of the Skerningham process will be for the builders to present a masterplan and phasing proposal which must be put out for consultation and then get council approval. A formal planning application can then be made. No doubt, controversy will resume.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_category_uncategorised_page_2/content_14.html": "18 March 2024 / 18 March 2024 by matthewsnedker\nRead more »\n21 November 2023 by matthewsnedker\n21 October 2023 by matthewsnedker\n28 September 2023 by matthewsnedker\n20 September 2023 by matthewsnedker",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2025_02_15_local-government-control-eroded-by-so-called-devolutionproposals/content_15.html": "Darlington Green Party have expressed their concerns about the Labour\nGovernment’s proposals to reform the structures of local government.\nThe English Devolution White Paper was published in mid-December with the\nclaim that Government will devolve more powers to the local level and give\npeople more power over the things that matter to them. The proposals\ninclude developing new Strategic Authorities in areas where they don’t\ncurrently exist and giving new powers to elected regional mayors.\nNot all Mayoral Combined Authorities will be treated the same. Kim\nMcGuinness, the Mayor covering the North East Combined Authority who was\nelected in May, will receive more powers as an Established Mayoral Strategic\nAuthority than Lord Houchen in Tees Valley. Houchen, who was elected in\n2017, was not deemed eligible for these enhanced powers.\nThe White Paper also sets out plans to replace the remaining two-tier district/\ncounty structures with unitary authorities, and to reform unitary councils\nwhere there is “evidence of failure” or where their size or boundaries are\nperceived as a problem. Any new unitary authorities are likely to have a\npopulation of 500,000 and upwards. Only one of the existing unitary\nauthorities in the North East, County Durham, has a population of that size.\nLocal government funding was cut by between 40% and 70% in the decade\n2010-20[1]. While the government has indicated that it will rebuild local\ngovernment, it has not promised to return their funding to 2010 levels.\nMatthew Snedker, leader of the Green Group on Darlington Borough Council\nsaid, “there is no question that local democracy is in urgent need of reform,\nbut these proposals do not deliver the change nor the resources that local\ncouncils and communities need. Instead, they risk undermining local\ndecision-making by concentrating power in remote super-councils and\nregional mayoral offices, stripping influence away from the very communities\nthese reforms claim to serve. I do not want to see Darlington merged into a\nTees Valley wide authority or taken over by Durham County Council, nor do I\nthink we should lose out because of the ineptitude\nof Ben Houchen.\n“Council finances have been cut to the bone, and democracy eroded as power\nis restricted to largely unaccountable Mayors and small and unrepresentative\ncabinets. The Green Party believes that devolution must mean real\ndecentralisation, not just a reshuffling of power to larger, more distant bodies.\nThat is why we will continue to stand up for local government, to ensure it\nremains truly local and becomes more democratic. Specifically, we are calling\nfor:\n· Decisions to be taken as close as possible to the people most affected;\n· Trusting local communities to know what is best for them;\n· Providing councils with the investment they need to deliver meaningful\nchange;\n· Fair voting in local elections through proportional representation.\nGreen MP Ellie Chowns spoke in the debate on this proposed legislation. She\nsaid, “I welcome the elements of this White Paper that are about devolution,\nbut we have to recognise that some elements are about concentration. The\nMinister has talked about the two-tier premium, but the reality is that his\nproposals mean that in some places a local tier will be replaced by a more\ndistant mayoral tier.\n[1]",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_news/content_3.html": "Darlington residents protest against plans by LolaMcEvoy’s Labour government to slash five billion poundsfrom people with disabilities. 26 March 2025 / 26 March 2025 by matthewsnedker Experts at Scope say that seven-hundred-thousand disabled households will be pushed into poverty by the government’s planned changes to welfare.This is a deeply cruel choice for any government to make. And let’s be absolutely clear it is a choice. We could and should be choosing to tax the very wealthiest a small amount more instead. […] Read more »\nAir sourced heat network being explored to support town centre and hospital decarbonisation. 26 March 2025 / 26 March 2025 by matthewsnedker Green house gas pollution in the UK is driven by three areas of the economy; transport, food and heat. Making buildings more energy efficient through insulation and draft proofing is a good way to reduce energy use, but new sources of energy for the remaining heating requirements will be needed as we realise the opportunities […] Read more »\nGreen Councillor’s intervention means that tackling climate change remain a top priority for darlington borough council. 15 February 2025 / 15 February 2025 by matthewsnedker Intervention by a Green Party Councillor has made sure that Darlington Borough Council will make sure that tackling the climate emergency and protecting the natural environment will be on an equal footing as addressing inequality and efficient resource use. At a recent council meeting Matthew Snedker, leader of the Green Group, shared his concerns that […] Read more »\nAlarm as no cross party scrutiny of new deal signed to keep market hall operating. 15 February 2025 / 15 February 2025 by matthewsnedker The ongoing saga of the indoor market continues as the Labour / Lib Dem cabinet heard confidential information regarding the financial arrangements between Darlington Borough Council and Market Asset Management (MAM) Green and Conservative councillors have protested that a report dealing with such large sums of money should have been scrutinised by the cross-party Economy […] Read more »\nLocal Government control eroded by so-called devolutionproposals 15 February 2025 / 15 February 2025 by matthewsnedker Darlington Green Party have expressed their concerns about the LabourGovernment’s proposals to reform the structures of local government.The English Devolution White Paper was published in mid-December with theclaim that Government will devolve more powers to the local level and givepeople more power over the things that matter to them. The proposalsinclude developing new Strategic Authorities […] Read more »\nDarlington Green Councillors working hard in council December 2024 17 December 2024 by matthewsnedker Read more »\nDarlington council cabinet to discuss Skerningham masterplan – without involvement from other councillors 14 October 2024 by matthewsnedker Read more »\nPensioners in Darlington may die this winter unless the Government abandons its plans to stop around ten million people from getting help with fuel bills, says a leading councillor. 13 September 2024 by matthewsnedker Read more »\nDarlington Green Party gearing up for the General Election on 4th July 18 June 2024 by matthewsnedker Read more »\nDarlington Council Climate Change Working Group – recent successes 23 May 2024 by matthewsnedker Read more »",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_03_28_green-party-candidates-call-for-clarity-over-decision-to-extend-teesflex-bus-service/content_28.html": "Green Party candidates at this May’s local council elections have serious concerns about the way the extension of the Tees Flex service has been handled. There are many problems with public transport in our region and this is just one example of poor management and poor policy making by Conservative administrations.\nThe initial contract for Stagecoach to run Tees Flex ran until 24 February. A review into the service was promised, and a decision about whether to carry on with the service was scheduled to be made at a meeting of the TVCA cabinet on 17 March – a gap of three weeks. Meanwhile, Stagecoach published a notice on their website saying the service would end on 24 February.\nHowever Ben Houchen, amazingly, stepped in just four days before the end of the contract to announce his decision to extend the service for another 18 months. Thus giving himself useful publicity, and giving the public the impression he had “saved Tees Flex” – less than three months before local elections in many parts of the region.\nThere are serious questions to be answered: what was the original plan to manage the end of the contract and the decision about to whether to extend it? Why the three week gap? What commercial impact has this had on Stagecoach (even on the day of the announcement, the Tees Flex website still said the service would end on 24 February)? Have stakeholders, including passengers, been meaningfully consulted? When will the results of the review be made public? Has the review been used to make improvements to the service?\nWe expect better – we expect our elected representatives to make sensible, timely and transparent decisions based on evidence, in the best interests of the public. Instead of a chaotic process, with announcements timed for political impact.\nYours Sincerely\nTerri Hankinson, Roz Henderson, Bryony Holroyd, Richard Lawley, Kate Mammolotti, Mike McTimoney, Thomas Robinson, Anna-Maria Toms",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2025_02_15_green-councillors-intervention-means-that-tackling-climate-change-remain-a-top-priority-for-darlington-borough-council/content_18.html": "Intervention by a Green Party Councillor has made sure that Darlington Borough Council will make sure that tackling the climate emergency and protecting the natural environment will be on an equal footing as addressing inequality and efficient resource use.\nAt a recent council meeting Matthew Snedker, leader of the Green Group, shared his concerns that recent speeches by Rachael Reeves had shown the Labour Party breaking a number of manifesto promises.\nMs Reeves speech at the exclusive Klosters ski resort on 22nd January set a new direction where growth overrules any other consideration and where nature should not get in the way of business.\nCllr Snedker said: “The idea that we have to choose between economic prosperity and safeguarding our children’s future is absolute nonsense – in fact it’s quite the opposite. There is clear evidence that sustainable businesses are where growth can be found in the UK. The UK’s net zero economy grew by 9%, in stark contrast to the 0.1% growth seen in the economy overall[1][2]. Taking action on climate change is good for business, good for people and good for the environment.\n“Ms Reeves strategy doesn’t add up and it felt more as if she was chasing headlines than chasing a sustainable, fairer future for the UK. By raising the point at the January council meeting I was able to hold the council to account and gain assurances that, as far as Darlington is concerned, action to cut harmful greenhouse gas emissions and protect our natural world will remain a top priority.”",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2024_03_18_darlington-council-stronger-communities-fund-harrowgate-hill-green-councillors-making-a-difference/content_35.html": "Darlington Borough Council has a “Stronger Communities Fund”, which allocates £1,000 to each elected councillor to spend in their wards to use for the benefit of their ward and its residents.\nThe funding must be used to:⦁ support individuals and groups to enhance access to opportunities to improve health and wellbeing outcome within their Wards; and\n⦁ invest in environmental improvements which improve the local area to the benefit of the local community.\nOur Green Harrowgate Hill councillors – Roz Henderson, Richard Lawley, and Anna-Maria Toms – have allocated all their funding this year on these projects:\n· Free Art Therapy Classes which were available to all residents.\n· Funding for Whessoe Parish Council to help with their Christmas Party and Summer Event both of which are for residents.\n· Maintenance work in Drinkfield Marsh nature reserve, which the Drinkfield Marsh Friends Group look after so well.\n· Providing pitch barriers for their matches at Darlington 21st Allstars Football Club, which is based at Longfield School.\n· Repairs to Salters Community Community Garden to help maintain this brilliant space.\nMore work is planned for the future, so watch this space",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2024_06_18_darlington-green-party-gearing-up-for-the-general-election-on-4th-july/content_20.html": "Matthew Snedker, Darlington’s Green parliamentary candidate, is a hard-working and well-respected Darlington councillor. First elected in 2019, he leads the Green group which increased to seven Darlington councillors in 2023. Matthew is an experienced activist, campaigner and local politician – he is increasingly well known in Darlington, regionally, and beyond.\nDarlington Green Party has ambitious aims for this General Election campaign. The purpose is to get as many Green votes as possible and to pave the way to further successes in the 2027 Local Elections and then the next General Election. We will have a real chance of winning many more councillor seats, and possibly even Darlington’s first Green MP.\nThe aims of this campaign are to:\n⦁ Retain the deposit (which means achieving at least 5% of the vote)\n⦁ Match the national Green Party vote share\n⦁ Achieve 3rd place in Darlington\n⦁ Get Darlington added to the list of the Green Party’s “development constituencies” for the next General Election – this would give us professional support and funding from the National Party so that we could run an even more effective campaign, on a much bigger scale, next time.\nDarlington Green Party has made huge progress over the past five years. We need to carry on our momentum – spreading the Green Party message, raising our profile, getting as many Green votes as possible in the general election, and paving the way to even greater success in the 2027 local elections.\nUnlike other parties we do not have large corporate or union donors – our strength is our people. Even if you’re not a member you can volunteer to help with our campaigns – if you’d like to get involved please email us at darlingtongreens@gmail.com.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_news_page_2/content_29.html": "Darlington Council Stronger Communities Fund – Harrowgate Hill Green councillors making a difference 18 March 2024 / 18 March 2024 by matthewsnedker Read more »\nDarlington Green Party offer solidarity to CEPAC workers. 21 October 2023 by matthewsnedker Read more »\nCouncillor Matthew Snedker selected as Green Party parliamentary candidate for Darlington 21 October 2023 by matthewsnedker Read more »\nReport from the latest full council meeting – Labour tries to tighten their grip on power 21 October 2023 by matthewsnedker Read more »\nCouncillor activity in Harrowgate Hill and Hummersknott 28 September 2023 by matthewsnedker Read more »\nAFTER A DECADE OF GRINDING AUSTERITY, COUNCIL TAX RISE MAY BE THE LAST STRAW FOR PEOPLE IN THIS COST OF LIVING CRISIS. 20 September 2023 by matthewsnedker Read more »\nTHIS IS A COUNCIL THAT THE PEOPLE SAID THEY DID NOT WANT 20 September 2023 by matthewsnedker Read more »\nDARLINGTON WATERWAYS AT RISK OF EVEN MORE POLLUTION AS ENVIRONMENTAL LAWS ARE RIPPED UP 20 September 2023 by matthewsnedker Read more »",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_people/content_36.html": "Mike McTimoney\nCoordinator\nMike has been an active member of Darlington Green Party since 2015. He has stood for election several times, most recently in Whinfield as a development candidate where he came third.\nMike has worked as a teacher for twenty-something years, teaching physics, IT and maths.\nMike likes the Green approach to politics, campaigning positively on the real important issues.\nCllr Bryony Holroyd\nCampaigns Coordinator\nBryony realised long ago that politics is something we should all do, rather than have done to us!\nShe was recruited by Matthew to help start up a Darlington Green Party in 2014. She’s stood for election in North Road in 2015, and was elected as a councillor for College ward in 2019. Until recently, she worked in the sustainability, energy efficiency & fuel poverty sector, and led on Darlington Green Party’s response to the Local Plan and its subsequent processes.\nTwitter – @CllrBHolroyd\nFacebook – Bryony Holroyd#\nRoz Henderson\nMembership Officer\nRoz, leads and supports the membership team to welcome, engage and retain Darlington Green Party members. She is also the link between the local and the regional party\nLouise Maddison\nSocial and Fundraising officer\nIan Macmurray\nSocial and Fundraising officer\nWe share the role of organising social events for our members and supporters as well as helping raise funds for our local party. We don’t take money from corporations or millionaires. We spend every penny raised very efficiently, so please click on the donate page and contribute to our election fund.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2024_12_17_darlington-green-councillors-working-hard-in-council-december-2024/content_17.html": "Darlington Green Party councillors work hard to represent their communities and fulfil their duties. As well as representing their ward residents, this means fighting for the best outcomes for all residents of Darlington Borough.\nOne of the ways they do this is to publicly hold the party running the council (currently a Labour / Lib Dem coalition) to account for its decisions. Highlighting and questioning decisions made and policies proposed forces the cabinet members and council officers to carefully consider all relevant factors when making a decision, and ensure they are in the best interests of local people. Decisions should be transparent, as well as fair and based on sound evidence.\nOur Green councillors do this all year round, for example, at the council meeting held on 8th October. Green councillors asked the following questions and made the following points:\nSenior management changes\nThe role of economic growth – we must make sure that the senior officer is focused on the right kind of growth – sustainable industries with secure jobs. We should be working to bring a greater proportion of the nation’s wealth to the North East, Teesside and Darlington. As the seventh richest country in the world, we should be splitting the ‘wealth pie’ more evenly rather than than pushing for damaging growth at all costs.\nReporting of Climate change progress for the Borough\nThe reporting of council and borough carbon emissions and the trajectory to net-zero should be comparable. We welcome the fact that the reporting method has now changed to show the progress of overall Borough emissions reductions, rather than only those that the Council is directly responsible for itself (through its own activities and service delivery).\nFunding for climate change investment\nSince we first declared a climate change emergency the council has saved £4.7 million in energy bills. What are the plans to re-invest some of these savings back into the climate change actions the council needs to undertake?\nHealth Impact Assessments (HIAs) for planning applicationsThe council needs to look beyond the new major planning applications for applying HIAs, and ensure that applications already ‘in the system’ meet the requirements as well. Just applying HIA to housing developments is not good enough, we must embed the consideration of health impacts on everything that the council does – in every department. The causes of poor health are wide and diverse. We have to act holistically to counter the declining health of many groups.\nSchool absence fines for SEND pupils\nFamilies with SEND children are facing fines for non-attendance. The procedure is that schools contact the Council’s ‘front door’ service in the first instance. This should allow the parent and children to work on the reasons behind school refusal and put in place a programme to help them return them to school. Instead, schools are going straight for issuing fines. This is not right and it needs to stop.\nSafer Routes to school\nIs the Abbey School scheme still going ahead as it was not mentioned in the programme of works published in the documents? We were reassured that it was omitted in error.\nSingle use plates at Hopetown\nThe plates and bowls use at Hopetown are made from palm leaves. This is better than plastic, but why didn’t we plan to use washable, and therefore reusable crockery?20,000 new trees – but how many are still alive?\nThere have been problems in the past of trees removed, mown down or areas with very low survival rate. Recording how many trees have been planted is not accurate. Can we have a list of areas planted, dates and numbers plus the survival rates?\nBus reliability\nBetter bus timetable information at bus stops is welcome, but what is being done to make the buses more reliable? There are economic knock-on effects when people can’t rely on buses to tun up on time or at all. Forcing people to turn to driving cars makes significantly worse economic sense than getting the bus service to run properly.\nCCTV not consulted about plans that affect them\nDarlington Borough Council operate CCTV cameras around the town centre and in several areas in the urban area. The cameras that are further afield use ‘line-of-sight’ signalling to bring images back to the control centre. When Darlington Borough Council approved the plans for the new train station car park it didn’t notice that the new building will cut off the signal to cameras in the east of the town.\nIn a related issue, the camera system for Hopetown was specified, commissioned and installed without consulting with the CCTV department. Now we find that the cameras are not compatible and they can’t be monitored from the control centre. More expense is required to put some compatible cameras on the outside of the building.\nBoth of these issues highlight that Council departments are not talking to each other.\nLack of any progress at Ashcourts\nWhy are there no Environment Agency updates or Compliance Assessment Reports published about the persistent stink coming forms the land fill operated by Ashcourts? Recent figures recorded are just as high as in January – before the remediation work was started. When will residents of the northern areas of town be able to enjoy their homes again?\nIndependent Autism advocacy\nWhen autistic patients are admitted to hospital, there is a need for independent advocacy. There is no service offered anywhere in the North East. The tragic consequences can be seen in a recent case where a patient took her own life. A group run by Saint John of God are active in the town, at the Edge Centre. We need to increase awareness of this group to ensure adults with autism can access the care they need.\nImpact on council of withdrawal of Winter Fuel Allowance\nWhen Labour removed this universal allowance, unbelievably they did not conduct a risk assessment. Has Darlington Borough Council conducted their own risk assessment? What extra cost burdens will be borne by Darlington Borough Council and the local NHS services as a result of the withdrawal of the Winter Fuel Allowance?\nReclaiming our Communities\nRecent work by Reclaiming Our Communities was very constructive. A recent meeting set out to ‘asset map’ voluntary and charitable organisations in the Borough. One week later we learned that another organisation, Youth Focus North East were commissioned to undertake very similar work. Why was this work duplicated? Can the ruling group be more transparent and open in their plans?Will Teesside Airport ever return to profit\nIn August Lord Houchen’s press team were gushing that Teesside Airport had returned to profit. However, looking at the accounts more closely shows that this is a very narrow definition of profit that excludes many costs. Not least among the reasons to doubt the financial stability of the airport is the growing debt mountain, which currently stands at £95.6 million. Given that no UK airport with fewer than 2 million passengers a year is running at a profit – will Darlington Council ever get their money back?\nSt Teresa’s loss of contract\nIt is deeply concerning to hear that the NHS have ‘out-bid’ St Teresa’s Hospice for the end of life care on-call service. The terms offered by the winning bid are far below the excellent care offered by St Teresa’s. They were reaching 98% terminally ill patients within two hours.\nLocal Cycling and Walking investment\nThe process of gaining ‘sign-off’ from Active Travel England (ATE) for the investment in walking and cycling infrastructure can lead to long delays. Are officers in Darlington Borough Council gaining sufficient training to ensure that plans are submitted right first time – to avoid time wasted by repeated re-submissions and corrections\nIt’s easy for any member of the public to get involved in local politics, or to just keep themselves informed about what the people who represent you are up to. Members of the public can attend full council meetings and cabinet meetings (both held every two months), and can submit questions, to which the council must give an answer.If you’re interested in finding out more, information is on this page of the Darlington council website [https://democracy.darlington.gov.uk/uuCoverPage.aspx?bcr=1], [any other good resource, maybe something from the AGC?). And the Green Darlington councillors are always happy to talk to Green Party members and volunteers and give information and advice when they can.\nIf you want to attend a meeting or submit a question and you’d like some help or guidance (or just someone to go with so you don’t have to turn up alone) please email us and someone will contact you.",
  "https_darlington_greenparty_org_uk_/https_darlington_greenparty_org_uk_2023_11_21_darlington-council-finances/content_25.html": "You may have read stories in the local press lately about the state of Darlington Council’s finances (https://www.thenorthernecho.co.uk/news/23897943.warning-black-hole-darlington-councils-finances/).\nThe new Labour led administration have warned that there are rough times ahead, but the former Conservative leader of the council has been at pains to point out that they built up reserves of more than £23 million before they left office – implying that they managed the finances well.\nAs with most things to do with economics or politics, it’s not that simple, so we thought we’d give an explanation from our perspective.\nDarlington Council’s income comes from central government grants, residents’ council tax, business tax and income from council-owned facilities like the Dolphin Centre.\nSome council spending is statutory, like social care for children and adults, neighbourhood services like libraries and rubbish collection, plus some aspects of transport, housing and education. Councils spend the little that’s left at their own discretion.\nSince 2010, government grants to local authorities have steadily reduced, making things really difficult for councils, and putting discretionary services at great risk. The grants were cut by 40% in real terms between 2009/10 and 2019/20, from £46.5bn to £28.0bn (2023/24 prices).\nHowever, during the pandemic, there was extra funding from the government (including things like business rates compensation and money to introduce free parking schemes).\nThese extra funding streams have now ended. And other costs are increasing, especially on things like adult and social care (which makes up 75% of council spending). It is a national trend that these cases are getting more and more complex – making it more and more difficult for the council to provide statutory services to the minimum standards, and putting discretionary services in severe jeopardy.\nBefore losing control in the May elections, the former Conservative Council set a four-year budget which would overspend by £7.5 million a year and wipe out the £23 million reserves.\nTake free parking, for instance. During the pandemic, the Tees Valley Combined Authority (TVCA) gave the council funds to provide free car parking to encourage people back to the shops – but for two years only. In this year’s local election campaign the Conservatives pledged to keep free town centre parking, despite the fact that the external grant to fund it had ended, and it would have cost the council £1.7 million a year – and they did not account for it in the budget they set.\nThe budget set by the Conservatives before leaving office would leave the borough bankrupt by 2027. So far, the new Lab-Lib council has not revealed any plans it might have to prevent this catastrophe, which could mean the Government taking over and selling-off council assets and massively increasing council tax.\nNationally and locally, Greens have a reputation for common sense policies and for taking a long-term, balanced view. Our seven Green councillors will do all they can to hold the council to account and to influence the vital decisions that need to be made in the coming four years."
}