{
  "https_www_shaunhughes_info_/https_www_shaunhughes_info/content_1.html": "a real\nShaun is a local entrepreneur, businessperson and current B&NES councillor for Midsomer Norton North, offering a real alternative to how we are represented. He is Independent from Party Politics and the squabbling between the main parties. Having lived in Midsomer Norton for 30 years where he has a successful business within the Electronics Industry.\nWith a proven track record of achieving change, Shaun believes that he possesses the skills and ambition to make a difference to our area.\nShaun lives, works, shops, walks his dogs, plays skittles and pays his taxes in Somerset. He is part of this community in every way and is one of the most pro-active Councillors in our area. Known for achieving objectives and encourages residents to judge him by his results.\nShaun is firmly of the opinion that potential MPs should be able to be judged by their track record within the community, believing that we need an MP who lives in the real world and understanding what it’s like to cope with the daily issues that surround us.\nWHY INDEPENDENT?\nThere are still too many party political games getting in the way of progress!\nWe need independent MPs that truly represent the residents of Frome and East Somerset who are not led by the political parties too concerned with winning power at any cost.\nConstant negativity between political parties is draining!\nMore and more people are becoming disillusioned with party politics. We have seen the current circus of political parties trading short term promises of tax cuts and public spending increases during election campaigns, regardless of long-term damage to our economy, rising public debt and ever-increasing borrowings.\nWe hear political parties offer and counteroffer trading away our future without any consultation with us, the result is no credible long-term plan.\nFight to support the needs of residents not party political agendas.\nWe need an MP who is fully aware of both National and local issues and will fight to protect us from the poor decisions being made by central government. We do not need to be dictated to by political party Head Quarters. We need to be heard.\nWhoever you decide to give your vote, let’s ensure there is a strong local track record of working for and supporting our community.\nWhat are my views?\nAs an Independent BANES councillor, I have worked tirelessly to fight poor planning proposals and overdevelopment both in BANES and Somerset. Opposing Lib-Dem council decisions that would have a negative effect on our residents finances and local economy.\nMy work as a councillor includes:\n- Independent BANES Councillor for Midsomer Norton North ward\n- Group spokesperson for the BANES Council Independent Councillors Group\n- Member of the Planning committee\n- Member of the Licencing committee\n- Councillor for Midsomer Norton Town Council\nWe need our voices to be heard! Committees are where decisions and new policies are made or scrutinised, so it’s important to be on them to influence what’s happening. I spend a large amount of my time on committees ensuring that we and our views are represented.\nPRIORITIES\nCommunity Care work – Under-appreciation of our community care workers needs to change. We need to make this a financially rewarding career option, as these amazing people are the key to unlocking the hospital bed shortages, whilst providing dignified support and allowing patients to be cared for at home.\nCommunity Healthcare – Underinvestment in our local medical services have left residents without access to dental care and queueing to grab emergency GP appointments. Government is putting pressure on councils to build houses without the additional infrastructure to support them which is ludicrous.\nRent – One of the biggest financial pressures felt by our residents is the cost of renting property. This is adding pressure to our social housing needs. We need action to support and protect residents from a high rental market. We need to give our younger residents hope that they can afford to access the house buying market.\nHouse building – Unrealistic house building targets from central government are forcing councils to consider large scale building on green space and agricultural land. Once destroyed it’s gone for ever. Also the lack of a structured plan to build social housing and prevent developers avoiding their obligations to provide affordable homes. Of course we need more housing, however, our current policies focus on building housing estates rather than communities.\nPublic transport – Poor and underinvested public transport combined with squabbling between a Labour Mayor and Lib-Dem council about who is responsible, meanwhile we are pressured into reducing our carbon footprints by leaving our cars at home but given no viable alternatives, it is also adding to the isolation experienced by our elderly residents. We need a radical change to how we provide and fund public transport and make it a preference not just a necessity for those who can not afford a car.\nAnimal Welfare – To most of us, our pets are family. Too often families are making difficult decisions due to high veterinary bills. We need a Government review of veterinary costs and charges. poor breeding practices need to be regulated out of existence and increased powers and punishment for animal cruelty. we also need to see an end to animal testing.\nPensions – Our older generations should be able to enjoy life and not just survive, no one of pensionable age should be living in poverty and it’s vital that we protect the triple lock, in the longer term the current system is not sustainable and will need review as it’s not feasible to continue increasing the pension age.\nEmployment – We need to be more ambitious in our plans to attract and create employment in our area, schemes such as the controversial SVEZ must deliver high quality employment with an emphasis on apprenticeships and provide viable careers not just jobs. This should be partnered with the need to move away from the existing high levels of commuting.\nBrexit – We hear daily now the mainstream parties are relying on business growth rather than taxation to increase income to pay for better public services however for this to succeed we need to review our relationship with Europe as the promises of Brexit have clearly not materialised.\nMy Objectives\nBuilding cross-party relationships at National level and working with Unitary Authorities to address issues with house building, rural policing, public transport and healthcare investment.\nContinue to be present and active within our communities and as usual easily contactable.\nMake our voices heard – be active on both local and national committees to ensure that Frome and East Somerset are fully represented.\nContinue the fight to protect our Frome and East Somerset from overdevelopment and push for infrastructure investments to better support access to social support and housing.\nProvide an Independent voice not dictated by narrow party political agendas, support all positive initiatives and strategies regardless of origin.\nTHANK YOU!\nI would like to thank all the residents who help fight poor budget and planning decisions. Plans in both BANES and Somerset such as South Road car park and Underhill Lane. We have achieved so much together in the past five years but there is so much more to do. To achieve this Somerset needs more independent MPs and fewer party political games.\nIMMIGRATION\nWhen managed correctly immigration is a good thing and often necessary provided the skills match the needs of the community. Our hospitals and local businesses have benefitted from this. I am in favour of a system where an application is considered by awarding points for factors that benefit our area such as skills, qualifications, family connections etc. Most importantly there should also be a work position available. Let’s not forget that nearly 50,000 of our nurses and 10,000 doctors are from outside the UK.\nSCHOOLS\nAlthough we are fortunate to have excellent local schools they desperately need investment. Let’s give our schools the funds and resource to support children from ALL backgrounds and create a LEVEL PLAYING FIELD regardless of family wealth. Providing better access and support for our students with special educational needs.\nWe should remove any stigma felt by children and parents due to differing incomes by providing nutritional meals and ensuring school uniforms and school trips are affordale for everyone.\nHOUSING\nWe have seen large increases in housing developments during recent years with many of our traditionally industrial areas now residential. It is critical that the development of our Hospital facilities, surgeries, schools and emergency services also keep pace.\nIt’s time to concentrate on making Frome and East Somerset better, not just bigger.\nWe need a viable social house building plan to take pressure off the private market and reduce rents for low income families.\nPOLICE\nWe are fortunate to live in an area with a relatively low level of crime, however, we lack the level of Police officers on regular patrol to tackle issues such as anti-social behaviour and the challenges around rural policing. This is of course a funding issue but also in part due to under-reporting of crime, due to fear of repercussion or a belief that no action will be taken. We need to encourage reporting of crime to ensure the Police have the statistics to fully understand the resources needed in Frome & East Somerset.\nOfficers on patrol as a deterrent and a reassurance to the public has diminished at a time when we have seen increases in anti-social behaviour, drugs, drug related crime and a reduction in the investigation of crime.\nSerious underinvestment in our police needs to be reversed so that we can return to police on the beat providing prevention, reassurance and protection. Combined with a review of the scope of activities as including the additional pressures placed on our officers be social workers.\nHEALTHCARE\nI am a strong supporter of our NHS and believe that treatment should be free to all UK residents, however, it is clearly not sustainable with the current structure, due to ever-increasing demands and rising costs. We are a victim of our own success as people live much longer and new treatments become available.\nSerious issues with A&E departments and lack of beds are clear indications that the system must change.\nOur social care work force have been undervalued by government, we need to make this a financially viable career path.\nWe need to recognise the work in our communities by care workers and the critical part they play in freeing up hospital beds. We should provide the salary levels they deserve. Bring back full cost NHS nursing bursaries to encourage young people into these professions.\nWHO IS SHAUN?\nShaun is passionate about the area he lives in and is part of the local community in every way. He has hands on experience on a daily basis of our area and the challenges we face. Shaun has lived in Midsomer Norton for the past 30 years, having grown up on a council estate on the outskirts of Portsmouth, where he attended a comprehensive school. Since 1994 he has managed his own successful business in the Avionics Electronics Industry. Shaun represents the people of Midsomer Norton as a B&NES Councillor for the Midsomer Norton North ward.\nShaun enjoys cycling, motorcycling, DJing, snowboarding and running. Having completed the London Marathon for Whizz-kidz to raise money for children in desperate need of wheel chairs and the New York Half to raise money for deprived children. Shaun also supports Cancer Research, the RSPCA and enjoys being part of the Distinguished Gentlemen’s Motorcycle Ride, raising money for “Movember”, raising awareness of prostate Cancer and men’s mental health.\nGET IN TOUCH\nIf you have any issues you would like to discuss, call me on 07860 128162, write to:\nShaun Hughes, Unit 11a Old Mills Industrial Estate, Paulton BS39 7SU\nor fill out the form below.",
  "https_www_shaunhughes_info_/http_www_shaunhughes_info/content_2.html": "a real\nShaun is a local entrepreneur, businessperson and current B&NES councillor for Midsomer Norton North, offering a real alternative to how we are represented. He is Independent from Party Politics and the squabbling between the main parties. Having lived in Midsomer Norton for 30 years where he has a successful business within the Electronics Industry.\nWith a proven track record of achieving change, Shaun believes that he possesses the skills and ambition to make a difference to our area.\nShaun lives, works, shops, walks his dogs, plays skittles and pays his taxes in Somerset. He is part of this community in every way and is one of the most pro-active Councillors in our area. Known for achieving objectives and encourages residents to judge him by his results.\nShaun is firmly of the opinion that potential MPs should be able to be judged by their track record within the community, believing that we need an MP who lives in the real world and understanding what it’s like to cope with the daily issues that surround us.\nWHY INDEPENDENT?\nThere are still too many party political games getting in the way of progress!\nWe need independent MPs that truly represent the residents of Frome and East Somerset who are not led by the political parties too concerned with winning power at any cost.\nConstant negativity between political parties is draining!\nMore and more people are becoming disillusioned with party politics. We have seen the current circus of political parties trading short term promises of tax cuts and public spending increases during election campaigns, regardless of long-term damage to our economy, rising public debt and ever-increasing borrowings.\nWe hear political parties offer and counteroffer trading away our future without any consultation with us, the result is no credible long-term plan.\nFight to support the needs of residents not party political agendas.\nWe need an MP who is fully aware of both National and local issues and will fight to protect us from the poor decisions being made by central government. We do not need to be dictated to by political party Head Quarters. We need to be heard.\nWhoever you decide to give your vote, let’s ensure there is a strong local track record of working for and supporting our community.\nWhat are my views?\nAs an Independent BANES councillor, I have worked tirelessly to fight poor planning proposals and overdevelopment both in BANES and Somerset. Opposing Lib-Dem council decisions that would have a negative effect on our residents finances and local economy.\nMy work as a councillor includes:\n- Independent BANES Councillor for Midsomer Norton North ward\n- Group spokesperson for the BANES Council Independent Councillors Group\n- Member of the Planning committee\n- Member of the Licencing committee\n- Councillor for Midsomer Norton Town Council\nWe need our voices to be heard! Committees are where decisions and new policies are made or scrutinised, so it’s important to be on them to influence what’s happening. I spend a large amount of my time on committees ensuring that we and our views are represented.\nPRIORITIES\nCommunity Care work – Under-appreciation of our community care workers needs to change. We need to make this a financially rewarding career option, as these amazing people are the key to unlocking the hospital bed shortages, whilst providing dignified support and allowing patients to be cared for at home.\nCommunity Healthcare – Underinvestment in our local medical services have left residents without access to dental care and queueing to grab emergency GP appointments. Government is putting pressure on councils to build houses without the additional infrastructure to support them which is ludicrous.\nRent – One of the biggest financial pressures felt by our residents is the cost of renting property. This is adding pressure to our social housing needs. We need action to support and protect residents from a high rental market. We need to give our younger residents hope that they can afford to access the house buying market.\nHouse building – Unrealistic house building targets from central government are forcing councils to consider large scale building on green space and agricultural land. Once destroyed it’s gone for ever. Also the lack of a structured plan to build social housing and prevent developers avoiding their obligations to provide affordable homes. Of course we need more housing, however, our current policies focus on building housing estates rather than communities.\nPublic transport – Poor and underinvested public transport combined with squabbling between a Labour Mayor and Lib-Dem council about who is responsible, meanwhile we are pressured into reducing our carbon footprints by leaving our cars at home but given no viable alternatives, it is also adding to the isolation experienced by our elderly residents. We need a radical change to how we provide and fund public transport and make it a preference not just a necessity for those who can not afford a car.\nAnimal Welfare – To most of us, our pets are family. Too often families are making difficult decisions due to high veterinary bills. We need a Government review of veterinary costs and charges. poor breeding practices need to be regulated out of existence and increased powers and punishment for animal cruelty. we also need to see an end to animal testing.\nPensions – Our older generations should be able to enjoy life and not just survive, no one of pensionable age should be living in poverty and it’s vital that we protect the triple lock, in the longer term the current system is not sustainable and will need review as it’s not feasible to continue increasing the pension age.\nEmployment – We need to be more ambitious in our plans to attract and create employment in our area, schemes such as the controversial SVEZ must deliver high quality employment with an emphasis on apprenticeships and provide viable careers not just jobs. This should be partnered with the need to move away from the existing high levels of commuting.\nBrexit – We hear daily now the mainstream parties are relying on business growth rather than taxation to increase income to pay for better public services however for this to succeed we need to review our relationship with Europe as the promises of Brexit have clearly not materialised.\nMy Objectives\nBuilding cross-party relationships at National level and working with Unitary Authorities to address issues with house building, rural policing, public transport and healthcare investment.\nContinue to be present and active within our communities and as usual easily contactable.\nMake our voices heard – be active on both local and national committees to ensure that Frome and East Somerset are fully represented.\nContinue the fight to protect our Frome and East Somerset from overdevelopment and push for infrastructure investments to better support access to social support and housing.\nProvide an Independent voice not dictated by narrow party political agendas, support all positive initiatives and strategies regardless of origin.\nTHANK YOU!\nI would like to thank all the residents who help fight poor budget and planning decisions. Plans in both BANES and Somerset such as South Road car park and Underhill Lane. We have achieved so much together in the past five years but there is so much more to do. To achieve this Somerset needs more independent MPs and fewer party political games.\nIMMIGRATION\nWhen managed correctly immigration is a good thing and often necessary provided the skills match the needs of the community. Our hospitals and local businesses have benefitted from this. I am in favour of a system where an application is considered by awarding points for factors that benefit our area such as skills, qualifications, family connections etc. Most importantly there should also be a work position available. Let’s not forget that nearly 50,000 of our nurses and 10,000 doctors are from outside the UK.\nSCHOOLS\nAlthough we are fortunate to have excellent local schools they desperately need investment. Let’s give our schools the funds and resource to support children from ALL backgrounds and create a LEVEL PLAYING FIELD regardless of family wealth. Providing better access and support for our students with special educational needs.\nWe should remove any stigma felt by children and parents due to differing incomes by providing nutritional meals and ensuring school uniforms and school trips are affordale for everyone.\nHOUSING\nWe have seen large increases in housing developments during recent years with many of our traditionally industrial areas now residential. It is critical that the development of our Hospital facilities, surgeries, schools and emergency services also keep pace.\nIt’s time to concentrate on making Frome and East Somerset better, not just bigger.\nWe need a viable social house building plan to take pressure off the private market and reduce rents for low income families.\nPOLICE\nWe are fortunate to live in an area with a relatively low level of crime, however, we lack the level of Police officers on regular patrol to tackle issues such as anti-social behaviour and the challenges around rural policing. This is of course a funding issue but also in part due to under-reporting of crime, due to fear of repercussion or a belief that no action will be taken. We need to encourage reporting of crime to ensure the Police have the statistics to fully understand the resources needed in Frome & East Somerset.\nOfficers on patrol as a deterrent and a reassurance to the public has diminished at a time when we have seen increases in anti-social behaviour, drugs, drug related crime and a reduction in the investigation of crime.\nSerious underinvestment in our police needs to be reversed so that we can return to police on the beat providing prevention, reassurance and protection. Combined with a review of the scope of activities as including the additional pressures placed on our officers be social workers.\nHEALTHCARE\nI am a strong supporter of our NHS and believe that treatment should be free to all UK residents, however, it is clearly not sustainable with the current structure, due to ever-increasing demands and rising costs. We are a victim of our own success as people live much longer and new treatments become available.\nSerious issues with A&E departments and lack of beds are clear indications that the system must change.\nOur social care work force have been undervalued by government, we need to make this a financially viable career path.\nWe need to recognise the work in our communities by care workers and the critical part they play in freeing up hospital beds. We should provide the salary levels they deserve. Bring back full cost NHS nursing bursaries to encourage young people into these professions.\nWHO IS SHAUN?\nShaun is passionate about the area he lives in and is part of the local community in every way. He has hands on experience on a daily basis of our area and the challenges we face. Shaun has lived in Midsomer Norton for the past 30 years, having grown up on a council estate on the outskirts of Portsmouth, where he attended a comprehensive school. Since 1994 he has managed his own successful business in the Avionics Electronics Industry. Shaun represents the people of Midsomer Norton as a B&NES Councillor for the Midsomer Norton North ward.\nShaun enjoys cycling, motorcycling, DJing, snowboarding and running. Having completed the London Marathon for Whizz-kidz to raise money for children in desperate need of wheel chairs and the New York Half to raise money for deprived children. Shaun also supports Cancer Research, the RSPCA and enjoys being part of the Distinguished Gentlemen’s Motorcycle Ride, raising money for “Movember”, raising awareness of prostate Cancer and men’s mental health.\nGET IN TOUCH\nIf you have any issues you would like to discuss, call me on 07860 128162, write to:\nShaun Hughes, Unit 11a Old Mills Industrial Estate, Paulton BS39 7SU\nor fill out the form below."
}