{
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mps-divide-over-safeguarding-rules/content_117.html": "MPs divide over safeguarding rules\nLast night, Parliament voted narrowly for a new set of rules regarding when MPs would be prevented from accessing the Parliamentary estate.\nIn a vote that was on a knife-edge, it was agreed that any MP who is accused of a serious crime - including physical or sexual assault - should be barred from attending Parliament at the point of arrest.\nThis was passed by just a single vote, with 170 MPs supporting the new rule and 169 instead arguing that this exclusion should only happen in instances when an MP is formally charged.\nLiberal Democrat MP for Tiverton & Honiton Richard Foord supported these restrictions kicking-in from the moment of arrest, arguing this brings Parliament into line with how other workplaces handle situations like this.\nEast Devon’s Conservative MP Simon Jupp was not present for the vote. The two sitting MPs are set to go head-to-head for the new Honiton & Sidmouth constituency at the next election.\nRichard Foord MP said:\n“Ever since I was first sent by the people of Mid and East Devon to Parliament, it’s struck me how the institution continues to lag behind when it comes to workplace norms. I have a deep respect for the customs and traditions of Parliament, but this is about something entirely different.\n“Last night’s vote was an important step forward. It will ensure that MPs who are subject to Police investigations sufficiently serious to lead to arrest cannot attend Parliament while the issue is investigated by the Police.\n“This change brings us into line with almost every other workplace, ensuring that MPs’ staff feel safe. It should not be an issue for such a prestigious institution as Parliament, but the reverence with which Parliament is held has proved recently to be misplaced in relation to some rogue MPs.\n“It was disappointing to see so many Conservative MPs oppose this move, arguing that MPs should be held to a different standard. We are elected to represent people, but that does not put us above workplace norms of behaviour. The public should be able to demand better of their MPs.\n“I’m proud that it is the Liberal Democrats who have been leading the charge against sleaze, and to clean-up Parliament. It was our amendment that secured this important change and I’m glad that my single vote was able to make such a change possible.\n“This shows why people need to think very carefully about who is best placed to be their voice at Westminster and the significance of the next election for people in the new Honiton & Sidmouth constituency”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-calls-on-govt-to-stop-shifting-the-goalposts-on-flooding-support/content_81.html": "Foord calls on Government to stop ‘shifting the goalposts’ on flood support\nRichard Foord MP has urged the Government to set out criteria for when the Flood Recovery Framework would be activated to help with the aftermath of flooding, after Ministers refused to in the wake of flooding along the River Otter last year.\nSpeaking in Parliament on Wednesday, the Liberal Democrat MP for Tiverton & Honiton called on Ministers to offer more robust flooding support and stressed that information about this support needed to be clearly set out and communicated to local people.\nHe highlighted the case of the flooding along the Otter Valley that occurred on 9th May last year. This damaged homes and businesses in communities along the river, including at Newton Poppleford, Ottery St Mary, and Tipton St John.\nMr Foord wrote to the Flooding Minister Rebecca Pow in the days after the waters receded, urging the Government to set out what support would be forthcoming from the Government to help with both the clean-up and repair work that was needed.\nIn her response, Ms Pow said she recognised the damage caused by the flood waters. However, she stated that “the scale of the flooding does not reach the required level to activate the Flood Recovery Framework and give access to central Government funding”.\nHowever, when Storm Henk hit the UK earlier this year, the Government did activate the Flood Recovery Framework and provided support to communities affected – stating that councils needed to have more than 50 properties affected to receive help.\nBased on these criteria, East Devon should have qualified for help through the Flood Recovery Framework as 113 properties were affected by the floods, including 55 in the village of Newton Poppleford alone.\nMr Foord has criticised this apparent double standard, claiming Ministers look to be ‘shifting the goalposts’ on when help can be unlocked - and criticising the Government for always seeming to be ‘on the back foot’ when it comes to flooding.\nRichard Foord MP said:\n“Flooding is far from a one-off event; it is a regular part of our lives here in rural Devon. That’s why it’s so frustrating for both residents and hardworking local Councillors that every time the waters rise, the Government seems to be caught on the back foot.\n“Last May we saw serious flooding occur along the River Otter. This caused huge damage and disruption, particularly in Newton Poppleford. I visited the village the day after the waters receded and saw first-hand just how tough the clean-up work was going to be.\n“That’s why I wrote to the Flooding Minister, urging her to set out what the Government would be doing to support this work. Almost a month later I got my answer: nothing, because the event was not bad enough to trigger the Flood Recovery Framework.\n“The Government provided support for councils with more than 50 properties hit by flooding in the wake of Storm Henk earlier this year. Yet the flooding here in Devon damaged more than 50 properties in Newton Poppleford alone, and we got nothing.\n“It seems that once again, Ministers are treating areas inconsistently; instead of setting out a simple framework for support that would help places like those on the River Otter, they’re shifting the goalposts when another flood event catches them unaware.\n“This isn’t good enough. We need a robust Flood Recovery Framework, with simple criteria for triggering support – and setting out what that support will be. This is the way to ensure we properly address the aftermath of flooding and support those affected.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-9/content_79.html": "Foord: Conservatives are letting South West Water off the hook\nLiberal Democrat MP, Richard Foord, has responded to the news that South West Water chose to ferry millions of litres of waste to a pumping station near Exmouth beach, despite knowing it would cause raw sewage to be spilled into the sea.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mobility-and-rural-life/content_73.html": "Mobility and Rural Life\nRural life has challenges that many city-dwellers do not see. Of all the things that people in our rural area raise with me in correspondence or in person, potholes top the list.\nWhen campaigning ahead of the General Election, a six-foot-five cyclist squared up to me and implored me to sort out the [insert swear word here] potholes. Parliament is not directly responsible for potholes – or for fixing them. Yet I am not keen on simply referring people to local councils, as if to shrug this off and point to someone else who is more responsible.\nWestminster is ultimately responsible for all Government matters, even if potholes are within the purview of Devon County Council. If you drive around the streets of Westminster, you won’t see a single pothole; the roads are as smooth as a baby’s skin. This is why it is necessary to get out of central London and experience rural life before debating matters that affect rural dwellers like us.\nThe potholes do need sorting out. Many people have talked to me about the money they have shelled-out on vehicle repairs. This is an area of public policy that is penny-wise for the taxpayer but pound-foolish for the individual who must spend large sums of money on new tyres and shock absorbers.\nIt is not only private individuals in rural areas whose costs of motoring are rising. Community groups play a vital role in keeping people connected across our towns and villages – and they are bearing additional costs too.\nEarlier in August I went to meet dedicated volunteers connected with TRIP in Honiton. For those who are not familiar with it, this is an organisation that offers a ‘ring and ride’ service, as well as volunteers who offer rides to medical appointments. This is even more convenient now that TRIP has moved to new premises next to Honiton surgery. Organisations like this one save the Government a lot of money – and I for one am hugely grateful for the volunteers who keep the service on the road.\nWhen I return to Parliament at the beginning of September, I will be ensuring that the Labour Government – made up as it is of many urban MPs – is made aware of this. It is just one of the additional challenges of rural life, for which volunteers in close-knit communities can only take us so",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_south-west-water-condemned-for-83-increase-in-sewage-spills/content_62.html": "South West Water condemned for 83% increase in sewage spills\nNew figures released by the Environment Agency have shown that South West Water discharged sewage into local rivers and waterways for a staggering 530,737 hours last year, an 83% increase on 2022.\nDevon’s Liberal Democrat MP Richard Foord has called the revelation ‘deeply shameful’ and called for the Government to finally act on the sewage scandal gripping local communities, by strengthening the powers available to regulators such as the Environment Agency.\nAcross East Devon, there are several of the most prolific discharge sites covered by South West Water. The worst local outlet was the storm overflow at Dulford, which discharged sewage into the River Weaver 258 times for a total of more than 5,212 hours.\nSeveral other notable sites include the overflow at Salcombe Regis, which saw 223 spills lasting 4,827 hours, the sewage treatment works in Honiton, which experienced 148 spills into the River Otter for more than 1,061 hours, and the overflow in Kilmington, which discharged into the River Axe for 1,391 hours over 171 individual spills.\nRichard Foord, MP for Tiverton & Honiton, has also demanded that the Government follow through on their promise to stop water firms “marking their own homework” and monitoring sewage spills in-house. He has demanded a deadline by when the Government will mandate this data to be gathered by the Environment Agency.\nThe Liberal Democrats have been calling consistently for the Government to crack down on negligent water companies and introduce a ban on bonuses for water company bosses whose firms have pumped sewage into our precious rivers and onto our flagship beaches.\nConservative MPs have consistently voted against measures which would have helped to tackle this scourge much sooner.\nRichard Foord MP said:\n“It is a complete scandal that untreated raw sewage is being spilled into Devon’s rivers and onto our premier beaches on an almost industrial scale. This is harming our natural environment and risks making our waterways unsafe for people to enjoy.\n“But it’s not just water companies who are at fault; Conservative MPs have voted time and time again to allow these polluting firms to get away with this environmental vandalism. Local people are rightly angry that the Conservatives have blocked tougher action to tackle this crisis.\n“Our towns and villages are fed-up with pollution warnings at our beaches; fed-up of not knowing whether their local river is safe for their children or pets to swim in. We need to see real action, not more warm words and far-off promises.\n\"The situation we now face is a result of years of neglect, not just by water companies but also from Government ministers – who have repeatedly hollowed out our environmental regulators, leaving them unable to properly police the sector and hold failing firms to account.\n“Liberal Democrats believe we need tougher action to stop sewage being dumped in local rivers and onto our beaches. This includes beefing up the Environmental Agency and stopping the perverse situation where water companies themselves report on sewage spills.\n“We have also led the way in calling for an outright ban on bonuses for water company top executives whose firms have allowed spills from combined sewage overflows into our waterways. Liberal Democrats want to be certain that big shareholder payouts do not come at the expensive of vital investment in our ageing infrastructure.\n“These new figures show just how bad things have become, and why we desperately need to see a gear-shift from Ministers, who seem oblivious to the real damage these sewage discharges are having on our rural and coastal communities.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_neighbourhood-health-centres-must-feature-eastern-devons-community-hospitals/content_72.html": "‘Neighbourhood health centres’ must feature Eastern Devon’s community hospitals\nFive community hospitals across the Honiton & Sidmouth constituency\nThere are five community hospitals across the Honiton & Sidmouth constituency at: Axminster, Honiton, Ottery St Mary, Seaton and Sidmouth, running a range of clinics, meaning local people can be seen close to their homes, for a variety of health problems, without needing to travel into Exeter, or further afield.\nThe hospitals already run an important wide range of clinics and services, including x-ray, optometry, surgery, pain management, audiology, urology and rheumatology.\nNeighbourhood Health Centres funding set to be announced as part of the Budget\nHealth Secretary Wes Streeting’s neighbourhood health centre proposal is part of the Government’s new 10-year plan for the NHS and recommends that GPs, district nurses, care workers and other medical professionals are based in the same building.\nFunding for the centres is expected to be announced as part of the Budget tomorrow (Wednesday 30 October).\nCommunity hospitals already provide a range of essential health services\nRichard said: “Any proposal that means improved health services at a local level is to be welcomed and I will be asking the Health Secretary to cherish and develop our five excellent community hospitals.\nLocal community hospital beds closed in the face of widespread and vociferous opposition\n“Our local community hospitals used to have inpatient beds. Then almost a decade ago, amid understandable widespread and vociferous opposition, the beds were closed. Only Sidmouth Hospital was spared, retaining some medical inpatient beds.”\nAny change must complement and enhance existing rural services\nMr Foord added: “The NHS was neglected by the former Conservative government over the course of the last decade. This is in evidence locally; we have some incredible NHS staff pulling off an incredible level of service for patients, in spite of the constraints that they are working under.\n“Our health services are in desperate need of support and attention. Any changes must complement and enhance existing rural services.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-demands-more-support-for-struggling-local-hospices/content_66.html": "Richard Foord MP demands more support for struggling local hospices\nRichard Foord was speaking in parliament yesterday evening (Monday) on behalf of three important local charities that provide palliative and end-of-life care across Mid and Eastern Devon.\nWith rising costs and a reduction in charitable donations due to increases in the cost-of-living, Sidmouth Hospice At Home, Seaton Hospice At Home and Hospiscare are struggling to make ends meet.\nThe forthcoming increase in National Insurance contributions will add further pressure to stretched services. Hospiscare, which receives some funding from NHS Devon, and provides some ‘at home’ services, was forced to slash its 12-bed unit in Exeter to eight last year, as well as make redundancies. Sidmouth Hospice At Home, which provides specialist palliative and end-of-life care in the Sid Valley, relies completely on local charitable donations, and offers 24/7 support, as well as daycare at its base in Sidford.\nSeaton Hospice At Home, which commissions and funds a specialist palliative care nursing team to provide 24/7 care to patients in their own homes across Seaton, Beer and the Coly Valley, also relies entirely on charitable donations, channelled through Seaton Hospital’s League of Friends.\nRichard said:\n“We have heard that a third of funding for hospices tends to come from the state, through the NHS. However, in Devon, it is less than a fifth.\n“For Hospiscare, a charity based in Exeter, the figure is 18 per cent, while for Seaton Hospice at Home and Sidmouth Hospice at Home, the figure is 0 per cent; they do not receive any funding at all from NHS Devon.\n“Last year, I got together with Ben Bradshaw and Simon Jupp, the former MPs for Exeter and for East Devon. We put aside our political differences and wrote to the chair of NHS Devon, and secured an extra £500,000 for hospice care in Devon. None the less, the charity Hospiscare, still has a deficit of £2.5 million per year.”\nThe rise in National Insurance contributions will be crippling\n“The forthcoming rise in National Insurance contributions are set to cripple these cherished organisations, at a time when they’re already under enormous pressure.\n“Local hospices save the local NHS a significant sum of money and are experiencing rapidly rising costs at the same time as an increased need for their services.\n“These charities step in where the NHS cannot, providing care central to the Government’s vision of shifting treatment from hospitals to communities.\n“Yet the current trajectory forces patients back into overstretched hospitals.\n“Hospices need tangible support, including full reimbursement for the rise in employer National Insurance contributions and funding for running costs.\n“We must not abandon essential organisations like Hospiscare in Honiton, Seaton Hospital at Home or Sidmouth Hospice at Home. Their dedicated staff, selfless volunteers, and the families who rely on their care deserve our full support.\n“Without urgent action, these vital services face severe cuts, leaving our most vulnerable without the care they desperately need.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-6/content_76.html": "Foord declares Honiton & Sidmouth a two horse race\nLiberal Democrat MP Richard Foord has said the upcoming fight in Honiton & Sidmouth at the General Election will be a “clear choice” between the Liberal Democrats and the “out-of-touch Conservatives.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_page-8/content_49.html": "Foord calls for action after 57% of burglaries go unsolved across Mid and East Devon\nThe Liberal Democrats have set out their aim of a Burglary Response Guarantee as new data uncovered by the party reveals the shocking scale of unsolved burglaries in local areas across England and Wales.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-blasts-conservatives-as-nhs-waiting-list-breaks-158000/content_124.html": "MP blasts Conservatives as NHS waiting list breaks 158,000\nLiberal Democrat MP Richard Foord has said the “stark” figures show Conservative Ministers have let Devon “grind to a halt” due to growing NHS backlogs, as research from the House of Commons Library reveals 123 in every 1000 patients are still waiting for treatment.\nThe research, commissioned by the Liberal Democrats, shows the number of people on an incomplete patient pathway has risen to 158,411, a record high for Devon. This means that thousands are being left waiting treatment for months on end.\nRichard Foord MP has criticised the Conservative government for failing to prioritise the NHS in the Autumn Statement late year, with no new measures to support healthcare services - despite the huge economic impact of people being unable to return to work because they are awaiting treatment.\nSeparate ONS figures show that a record high 2.6 million people are inactive across the country are out of work due to long-term sickness, up from two million in 2019.\nThe Liberal Democrats have set out a plan to help fix the crisis in NHS and care, including increasing training places for GPs; giving people a right to see their GP within seven days; increasing the Carer’s Minimum Wage to tackle soaring vacancies in social care; and giving people a guarantee to begin cancer treatment within 62 days of being diagnosed.\nTiverton & Honiton MP Richard Foord said:\n“People in coastal and rural communities across Devon deserve an NHS that is fit for purpose. Instead, this Conservative government has run our local health services into the ground.\n“It should not be too much to ask for those living in our neck of the woods to be able to get a GP appointment when they need one or get the treatment they deserve in a reasonable time.\n“The Prime Minister’s abject failure to bring down the NHS backlog is having real consequences for our communities. Far too many people are being left to suffer unnecessarily due to Conservative incompetence.\n“That is why the Liberal Democrats are calling for urgent investment in the NHS to bring down waiting lists as our frontline health service and staff are experiencing yet another challenging winter.\n“It’s also why I am pushing to protect Seaton Community Hospital from having a whole wing sold off or demolished. It supports those living across the Axe Valley and a new Care Hub would be a much more effective use of the hospital - which the community helped fund.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-hits-out-at-broadband-let-down/content_104.html": "Foord hits out at broadband let-down\nDevon’s Liberal Democrat MP Richard Foord has this week called for the Government to properly fund local councils, after it reported that Devon County Council is using money allocated for broadband improvement to cover its deficit.\nSpeaking in Parliament on Monday, the Tiverton & Honiton MP pressed the Secretary of State for Communities Michael Gove on the funding given to local councils, highlighting that the situation in Devon was so poor that the council was having to put their ‘hand down the back of the sofa’.\nThis comes in the wake of a cross-party letter which criticised the Government for not to properly funding local councils and highlighting the risks to frontline services because of this negligence.\nResidents across Mid and East Devon are already having to live with some of the worst broadband connectivity in the country, with communities such as Sidmouth, Axminster, and Seaton being in the worst 10% of the whole country for broadband as average local speed is less than half the national average.\nThe Minister failed to answer Mr Foord’s specific question, which the MP says shows the Government is ‘woefully out-of-touch’. He is now calling for a review of local government funding and a clear commitment to improving broadband connectivity.\nRichard Foord MP said:\n“The fact that Devon County Council is now having to reallocate money that was intended originally for improving broadband connectivity shows just how bad the situation has become.\n“People across Mid and East Devon are already having to live with appalling slow broadband speeds and the reality for many is that they simply cannot get the connection they need to properly get online.\n“With the Council having to raid funds allocated for this to balance the books, things really are worse than we thought. Yet rather than address these concerns, Ministers seem only to want to fling insults and political attacks instead.\n“The response I received in Parliament shows just how woefully out-of-touch this Conservative government is. They constantly throw around big numbers, ignoring the ground-truth that we are faced with in our towns and villages.\n“Years of Conservative cuts have pushed our Councils to the brink. We need a fair deal on local authorities’ funding, so they can focus on investing in our communities and providing the quality services that people deserve.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-8/content_90.html": "MP calls for investment in community policing in wake of Police front desk reopening\nHoniton's MP has called for extra investment in community policing after attending the re-opening of the front desk at the town's police station.\nHoniton's MP has called for extra investment in community policing after attending the re-opening of the front desk at the town's police station.\nDevon’s Liberal Democrat MP, Richard Foord, has welcomed the news that Aldi has agreed to establish a ‘Best of British’ section to help promote home-grown produce in their stores.\nSeaton Community Hospital has been granted the status of an ‘Asset of Community Value’ in a big win for the campaigners fighting to save an endangered wing at the hospital.\nDevon’s Liberal Democrat MP Richard Foord has this week called for the Government to properly fund local councils, after it reported that Devon County Council is using money allocated for broadband improvement to cover its deficit.\nLocal MP, Richard Foord, has responded to the news that the Government is ending the practice of allowing water companies to collect and report on their own data on sewage discharges.\nLiberal Democrat MP Richard Foord has called for the government to give new powers to the Grocery Code Adjudicator, so it can properly protect Devon’s farmers.\nSeaton’s Liberal Democrat MP has presented a petition in Parliament today opposing plans to strip out a whole wing that was funded by the community from the local community hospital.\nLiberal Democrat MP Richard Foord has launched his bid to be the next MP for Honiton & Sidmouth with a promise to fight for rural NHS services and be a voice for residents across East Devon.\ntest\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-demands-govt-take-responsibility-for-nhs-property-services/content_41.html": "MP demands Government take responsibility for NHS Property Services\nLiberal Democrat MP Richard Foord has demanded the Government step up and take responsibility for the oversight of NHS Property Services, after a debate in Parliament where Ministers once again tried to distance themselves from the company.\nOn Friday 23rd February, Richard Foord held a debate in Parliament on the accountability of NHS Property Services. This is a government-owned company, responsible for the management and rental arrangements for local healthcare facilities – including Seaton Hospital.\nIn the debate, Mr Foord called for greater flexibility when it comes to the cost of renting buildings from NHS Property Services – which currently charges £247 per square metre. Foord called in the debate for a concessionary rate for local and community groups.\nHe also posed three clear questions to the Health Minister Andrew Stephenson.\n- Does the Department for Health and Social Care set the rate at which NHS Property Services rents out facilities?\n- Can this Charging Policy be changed by the Secretary of State?\n- And why are Ministers refusing to hold their hands up when it comes to the relationship between the Department and NHSPS?\nThe Minister failed to answer any of Mr Foord’s questions, leading the MP to brand the whole situation ‘farcical’ and describe the current set-up as a ‘self-licking lollipop’.\nSpeaking after the debate, Tiverton & Honiton MP Richard Foord said:\n“The aim of my debate in Parliament was to get some insight into how NHS Property Services is overseen by the Health Secretary – who is the sole shareholder of the company.\n“However, what we got was a farce. The Government is still trying to duck responsibility for a company it owns. They cannot keep hiding behind officials and claiming that they cannot get involved.\n“The mark of leadership is standing up and taking charge, helping bring about change when it’s clearly needed. Sadly, we've seen none of that from Ministers.\n“The current system is effectively a self-licking lollipop, where the Government is passing taxpayers’ money around in a circle for NHS facilities – which in Seaton’s case includes a wing of a hospital that was entirely funded by the local community.\n“The risk to Seaton Hospital is real and serious. I am exasperated at the lack of interest from this Conservative Government to intervene in this issue, and their unwillingness to act.\n“I will continue to fight to save this cherished local hospital and to bring about real change for other community hospitals too, so we can protect our rural and coastal facilities – now and in the future.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_seaton-hospital/content_12.html": "Save Seaton Hospital\nBack Richard's campaign to save Seaton Hospital\nSeaton Hospital is a much-loved community asset. That's why it's deeply concerning that there are now proposals on the table to sell-off and demolish a whole wing of the facility.\nWe’ve seen the damage caused when community hospital facilities were scaled back. People struggle to get the care they need and it adds pressure at other hospitals like the Royal Devon & Exeter. I have constituents telling me that they don't feel able to look after their elderly spouse in their own home.\nThe local community came together to help raise the money to build this ward. Allowing NHS Property Services to strip it away now undermines all that hard work and puts the hospital's long-term future at risk.\nThat's why I am campaigning to stop these plans and instead allow the space to be given back to the community to deliver a new 'Care Hub' which can offer greater support for local people.\nIf you agree that our hospital is important and needs protecting, then please sign my petition and help us stand up for Seaton.\nSave Seaton Hospital\nSave Seaton Community Hospital from demoliton.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-rallies-community-at-packed-meeting-about-seaton-hospital/content_50.html": "Foord rallies community at packed meeting about Seaton Hospital\nLiberal Democrat MP Richard Foord has rallied the local community in the Axe Valley against plans that could see a whole wing of Seaton Community Hospital sold and demolished.\nSpeaking at a packed public meeting of more than 200 people at Colyford Memorial Hall, Mr Foord pledged to do all he can to prevent plans that would see the diminution of Seaton hospital.\nDue to financial pressures, Devon’s Integrated Care Board (ICB) is looking to transfer a wing of the hospital to NHS Property Services – a Government-owned company that rents out NHS facilities. Seaton Hospital was passed into the hands of NHS Property Services by the Conservative Government in 2016.\nRailing against the proposals, Tiverton & Honiton MP Richard Foord - who is the Parliamentary representative for Seaton and the surrounding communities - called for NHS Property Services to change the way it rents properties, to allow local community groups to use the space instead.\nUnder the current arrangement, rent and service charges for the space amount to £300,000 per year, due to it being classed as ‘clinical’ space. However, the wing in question has been largely unused since 2017, when a decision was made to remove beds from the hospital.\nThis week, Richard Foord helped bring NHS Devon, NHS Property Services, Seaton Hospital League of Friends and others around the table to discuss potential ideas that would see the space made available to charitable and community-based organisations.\nAddressing the crowd, the MP also called for the community to get involved in the fight and help oppose these “damaging” proposals.\nCommenting after the meeting, Richard Foord said:\n“The future of Seaton Community Hospital is one which concerns everyone living in and around the Axe Valley. Today’s packed public meeting, attended by hundreds of people, clearly demonstrates the strength of feeling locally.\n“The hospital belongs to the community. Members of the community and volunteer groups raised millions to help fund construction and equipment – including the very ward that is now threatened with demolition. We cannot allow it to be taken away from those who worked so hard to build it.\n“NHS Property Services needs to review the way they rent out facilities such as this. Seeking to charge local charities and community groups a market rate that has been pitched at the upper-end clinical rate is short-sighted and wrong.\n“I have met recently with NHS Devon, NHS Property Services, and the Seaton Hospital League of Friends charity. There are potential solutions, but we need the political will from those in Government who have the power to make these decisions.\n“NHS Property Services is a Government-owned company with just one shareholder, the Health Secretary Steve Barclay. He has the power to resolve this situation and secure the long-term future of our hospital, and other small rural hospitals across the country.\n“I will continue to raise the threat posed by these damaging proposals and fight to save the whole of this local hospital for the community. Local people have made plain to me this afternoon that they feel that the Hospital is theirs – and in their eyes – not available for NHS Property Services to sell.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_volunteer/content_3.html": "Become a volunteer\nHelp Richard Foord and the Liberal Democrats win in Honiton & Sidmouth.\nRichard is fighting hard to stand up for Devon and give our communities a strong voice in Parliament. However, in order to do this, he needs your help.\nAnything you can do will make a huge difference and help our fight for a fair deal. There's no obligation, and you can do as much as you feel able to.\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-brands-honiton-sidmouth-a-clear-liberal-democrats-vs-conservatives-fight/content_122.html": "Foord declares Honiton & Sidmouth a two horse race\nLiberal Democrat MP Richard Foord has said the upcoming fight in Honiton & Sidmouth at the General Election will be a “clear choice” between the Liberal Democrats and the “out-of-touch Conservatives.”\nIn his time as an MP, Richard has been campaigning to end the sewage scandal, protect local health services, and secure investment for rural Devon.\nHe was elected to Parliament in 2022, overturning one of the biggest parliamentary majorities in history at the Tiverton & Honiton by-election – which saw both Labour and the Green Party lose their deposits.\nThe Liberal Democrats won big at the District Council elections last May and have won four stunning parliamentary by-election victories since the last General Election.\nResponding to Rishi Sunak calling a General Election, Richard Foord said:\n“At this election, people’s choice here is a clear: a Liberal Democrat MP who fights for our rural communities or the out-of-touch Conservatives who have repeatedly taken us for granted. Labour are out of the race here and cannot win.\n“Since becoming your MP, I have been laser-focused on fighting for our towns and villages by standing up on the issues that matter to our area. I am determined to continue working hard for you and being the strong voice we need in Parliament.\n“This Conservative Government has failed Devon. After years of struggling to get an NHS dental appointment, soaring rents and mortgages, and our rivers being poisoned by raw sewage, it’s time for people to make their voices heard and give them some well-deserved time out.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-5/content_43.html": "‘South West Water has officially gone rogue’ – Foord\nRichard Foord has branded South West Water a 'rogue' firm after they gave their Chief Executive a £300,000 pay rise.\nRichard Foord has branded South West Water a 'rogue' firm after they gave their Chief Executive a £300,000 pay rise.\nThis week Rishi Sunak had a once-in-a-generation opportunity to pay his respects to our D-Day heroes, British veterans and our allies from the Commonwealth and the rest of the world.\nLiberal Democrat Defence Spokesperson Richard Foord has called for the Prime Minister to make up for skipping the main part of the D-Day ceremony by making a donation to veterans' charities.\nLiberal Democrat candidate Richard Foord has written to Cllr James McInnes, the new Leader of Devon County Council, urging him to focus on fixing Devon’s ‘pock-marked’ roads and get tough on the Government in Westminster over funding cuts.\nRichard Foord has called for a new protected status for local rivers and marine protected areas, after shocking figures reveal that South West Water dumped sewage 6,688 times across east Devon in 2023.\nThe Liberal Democrats have called out the Conservatives for “abandoning the South West”, with only one town in thirty in their town funding announcement today being from the region.\nThe Liberal Democrats have set out their aim of a Burglary Response Guarantee as new data uncovered by the party reveals the shocking scale of unsolved burglaries in local areas across England and Wales.\nThe Liberal Democrats have announced a five-year scheme to ensure patients in Devon can see a GP within a week, or 24-hours if in urgent need.\nRichard Foord has criticised South West Water for increasing their dividend payout – in spite of the contaminated water scandal in Brixham.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-slams-governments-family-farm-tax-following-obr-assessment/content_27.html": "Richard Foord slams government’s family farm tax following OBR assessment\nThe latest report from the OBR suggests that the government's changes to agricultural property relief will have little effect on public finances whilst impacting farming communities already struggling with declining incomes, high energy bills and botched trade deals.\nThe OBR said that its 'central estimate' was that the policy will raise £500m by 2029/30.\nMany farmers already make less than minimum wage and changes to inheritance tax will mean that farms are sold to larger, more corporate organisations, hurting family farms and local communities.\nFarmers in Devon have also been hit by changes to the Furnished Holiday Lets allowance, which has allowed small family farms to diversify and bolster their income in the face of rising costs.\nSpeaking in response to the OBR’s findings, Richard Foord Liberal Democrat MP for Honiton & Sidmouth said:\n\"Communities across Devon depend on family farms, and this report confirms what Liberal Democrats have been saying for months: that the government must urgently rethink and scrap the family farm tax.\n“It is deeply worrying to see that expected revenue from this cruel tax is uncertain and unstable for two decades, and just further proves that the government’s rationale simply doesn’t stack up.\n“The Conservatives neglected our farmers and our rural communities. They deserve better than to be hit with yet more cost pressures.\n“The Liberal Democrats will continue to urge the government to change course and to scrap the family farm tax.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-celebrates-big-win-as-northleigh-finally-gets-online/content_96.html": "MP celebrates ‘big win’ as Northleigh finally gets online\nLocal MP Richard Foord has welcomed the news that the village of Northleigh has finally seen fully fibre broadband rolled out to residents, after a strong campaign that he and the local community championed.\nNorthleigh, a small community near Honiton, had been left without full broadband connectivity for almost a decade. During this time, they have endured endless delays and been repeatedly let down by the Government.\nIn 2020, residents were able to get broadband installer OpenReach to connect 30 of the 120 local homes through a community fibre scheme. However, subsequent installation work stalled – leaving three quarters of the village cut off.\nAfter years of battling with Connecting Devon and Somerset – run jointly by Devon County Council and Somerset Council – and the Government’s ‘Project Gigabit’ programme, they were promised full fibre rollout by the end of 2023.\nYet this work was once again faced further delays. By mid-March it remained uncompleted and even the Daily Express visited the village to report on the almost decade-long battle for broadband rollout.\nAfter another big push by the Parish Council and Liberal Democrat MP Richard Foord, who represents the community, the work has now finally been completed – several years after it was initially promised.\nMr Foord has been a vocal supporter of the push to get the work completed. He raised the issue several times in Parliament and directly lobbied both the Secretary of State and OpenReach to speed up the rollout and get residents back online.\nHe says the news of the work finally being completed is a ‘big win’ for rural Devon and showed what can happen “when local people have an MP who champions them”.\nRichard Foord MP said:\n“Northleigh has endured years of unacceptable delays and neglect from both the Government and OpenReach. It should not take almost 10 years to get broadband installed for cut off communities.\n“The news that the rollout has finally been completed is a big win for rural Devon and a huge testament to the persistence of residents, who refused to roll over in their campaigning.\n“But despite this hard-fought win, there is still so much more to do. Many small villages remain cut off and left behind in parts of rural Devon like ours – that’s why I’ll continue to fight to ensure everyone can get a proper broadband connection, no matter where they live.\n“The success in Northleigh shows what can happen when local people have an MP who champions them and makes their voices heard in the corridors of power. This is what I’ve sought to do every day since I was elected, and I plan to continue doing just that for people across Mid and East Devon.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-calls-for-emergency-health-and-care-budget-after-election/content_99.html": "Richard calls for emergency Health and Care Budget after election\nRichard Foord has backed calls by the Liberal Democrats for an emergency budget to in the first weeks of the new Parliament, whatever the outcome of the election, so that health services in Devon can get the urgent support they need.\nThe Liberal Democrats have put saving the NHS at the heart of their manifesto, with proposals to boost GP numbers by 8,000, end dental deserts, ensure patients start cancer treatment within 62 days of an urgent referral, increase the number of hospital beds in both major and community hospitals, and to end excessive ambulance handover delays.\nThe Liberal Democrat manifesto has set out proposals for an extra £9.4 billion a year of spending on the NHS and care. This investment would be funded through closing loopholes in Capital Gains Tax and reversing the Conservative Party’s tax cuts for the big banks.\nIn addition, Mr Foord is calling for the new Government to act immediately to save Seaton Hospital by instructing NHS Property Services, which is government-owned company, to introduce a new rental tariff to allow community groups and charities to rent vacant space in existing NHS facilities for a nominal sum.\nRichard Foord said:\n“Here in Devon, our rural and coastal health services are on their knees. So many people I speak to on the doorstep have harrowing stories of not being able to get the care they need when they need it.\n“This includes long waits for an ambulance, being unable to get an NHS dentist, and struggling to see a GP when they are feeling unwell. This lack of emergency and preventative treatment is merely stacking up problems for the future.\n“We’ve also seen this Conservative government refusing to support our local community hospitals. Instead of securing the future Seaton Hospital, which is at risk of seeing a whole ward ripped away, they have chosen to keep its future in doubt.\n“Ending the crisis in our NHS must be the top priority of any government after the election. We must rescue our local health services, which have been pushed to the brink by the Conservative party, before they collapse around us.\n“An emergency budget right after the election is the only way we can start to repair the damage done to our communities' health services. People in Devon should not have to wait a moment longer to get the care they deserve.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_south-west-water-shamefully-pays-out-pound116m-in-dividends-despite-brixham-parasite-scandal/content_98.html": "South West Water shamefully pays out £116m in dividends despite Brixham parasite scandal\nRichard Foord has criticised South West Water for once again increasing their dividend payout – in spite of the contaminated water scandal in Brixham – and said the money should instead be used to bolster Devon's ageing water infrastructure.\nThe outbreak of cryptosporidiosis has resulted in more than 50 people being infected from drinking contaminated water, with two requiring hospital treatment, and thousands left without access to safe water for several days.\nThe Pennon Group, which owns South West Water, has blamed the outbreak on a faulty valve. However, despite this incident, the company has this week increased its dividend payout to shareholders yet again by a further 3.8%.\nThis means that shareholders will receive a roughly £116million payout at the same time that South West Water is hiking people's water bills, arranging compensation for the Brixham contamination, and facing millions in fines from the Environmental Agency.\nRichard Foord said:\n\"This saga is a disgrace and proof that the government has lost control of these profiteering water firms - who continue to prioritise dividends over much-needed investment.\n\"South West Water must not pay their Executives a single penny in bonuses this year. Instead, the money should be put towards compensation for those affected in Brixham, and ensuring this situation never happens again.\n\"Pennon bosses have a lot of questions to answer for, including why they're once again issuing huge shareholder payouts at the same time that our infrastructure is falling apart. This will be a hard pill to swallow for customers who are seeing their bills rise yet again.\n\"These companies are no longer fit for purpose. They need to be reformed from top to bottom; they must no longer put profit ahead of people's safety and our precious natural environment.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-demands-post-office-stop-running-down-rural-branches/content_88.html": "MP demands Post Office stop ‘running down’ rural branches\nLiberal Democrat MP Richard Foord has criticised the decision by the Post Office to not recruit a sub-postmaster for Raymond’s Hill Post Office, warning that not replacing it would be yet another example of rural services being diminished on the backs of local communities.\nToday, in a letter to residents’ representatives – including the local MP Richard Foord - the Business Minister Kevin Hollinrake confirmed that the Post Office would not be seeking to replace the Raymond’s Hill Post Office – now that the premises have become vacant.\nThis means that people in Raymond’s Hill seeking to access Post Office counter services will have to travel to Axminster, Uplyme, or further afield, in order to do so after this date.\nMr Foord has hit out at the decision by Post Office bosses in London. He has said the news is a huge blow for the area - and said he feared this could be just the start of a push to ‘run down’ the rural Post Office network.\nThis shock news comes in the wake of increased scrutiny of the way the Post Office is run, following ITV’s groundbreaking drama series Mr Bates vs the Post Office – which focused on action of senior bosses during the Horizon Post Office scandal.\nTiverton & Honiton MP Richard Foord said:\n“The news that the Raymond’s Hill village Post Office will be disappearing completely is a blow for the community and all those who rely on the service.\n“So much is done through the Post Office, especially in areas like ours where access to a physical bank branch is far harder to come by. I am concerned about the impact this closure will have, particularly on elderly residents who cannot travel as easily.\n“We all understand that sometimes circumstances change and services need to move where they operate out of, but by outright refusing to replace this service, the Post Office is signalling that they don’t care for areas like ours.\n“In recent years we’ve seen many services disappear from our towns and villages – particularly bank branches and local libraries. Now we are seeing more and more Post Office branches also threatened, and communities left wondering what will be left of them if this trend isn’t reversed.\n“Local sub-postmasters and those who work in our post offices are often at the heart of the community and help so many people. We cannot allow these vital hubs to be run-down and stripped away, while London-based executives reward themselves for consolidating their business.\n“I was contacted by a Raymond’s Hill constituent who inspired me to raise our objection with the Government Minister. He wrote to the Post Office to pass on that objection. I also encourage everyone who values our rural post offices to do the same and lodge your objection too. We should make plain to the Post Office that we won’t stand for this.”\nThose wishing to express their strength of feeling about this closure can do so:\nOnline: Postofficeviews.co.uk\nEmail: Comments@postoffice.co.uk\nLetter: FREEPOST Your Comments\nCall: 03452 66 01 15\nTextphone: 03457 22 33 55",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_default-defba4f4200713551fd0ed3d66974ada/content_120.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-calls-for-protected-status-for-rivers/content_64.html": "Foord calls for protected status for rivers after record sewage dumping uncovered\nThe Liberal Democrats have called for a new protected status for local rivers and marine protected areas, after shocking figures reveal that South West Water dumped sewage 6,688 times across east Devon in 2023.\nAnalysis of official data from the Environment Agency by the party shows that South West Water discharged sewage into local waterways for a staggering 66,598 hours in 2023.\nTo tackle sewage dumping, the Liberal Democrats have announced a massive expansion of marine protected areas and a new Blue Flag status for rivers will be included in the party’s general election manifesto.\nThe introduction of Blue Flag status would set legally binding targets to prevent sewage dumping in those sites, giving special protected status for swimmers and wildlife – allowing for stronger action from regulators.\nRichard Foord has consistently campaigned against sewage dumping, accusing the Conservatives of ‘neglecting’ the issue and branding South West Water a ‘polluting firm’.\nNationally the Liberal Democrats have announced they would abolish Ofwat, introducing a new regulator with greater powers, which would build upon their push for a ban on water company executive bonuses.\nRichard Foord, Liberal Democrat candidate for Honiton & Sidmouth, said:\n“Our cherished rivers and beaches have been flooded with filthy sewage due to years of a Conservative government that has sat back and let water firms get away with environmental vandalism.\n“It is time we got tough on these polluting and profiteering water firms, yet at every turn Conservative MPs have shirked taking real action and stood by whilst swimmers have become ill and local wildlife has been killed by sewage discharges.\n“This sewage scandal must end now. The Conservative party has failed to protect swimmers and wildlife, voting to allow 15 more years of sewage dumping and is letting these wayward firms off the hook.\n“The Liberal Democrats will have the boldest manifesto on cleaning up our rivers and coastlines. Families should be free to swim safely in the knowledge that our waters are not polluted with sewage.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-demands-action-on-disgusting-south-west-water-sewage-spills/content_2.html": "Richard Foord MP demands action on “disgusting” South West Water sewage spills\nRichard Foord MP has demanded action on the shocking number of sewage spills into the rivers and coast around Mid- and East Devon, following last week’s release of data by the Environment Agency.\nMany sewage pumping stations in the Honiton & Sidmouth constituency are now regularly discharging untreated sewage into ailing local rivers, that ultimately end up in East Devon’s coastal waters.\nMr Foord said:\n“Beautiful Salcombe Regis near Sidmouth, made national news last week as the place raw sewage was dumped most often by South West Water in 2024 – 366 times. That’s effectively a discharge for every single day of the year.”\n“Water companies are making a total mockery of the legal position that rules sewage spills are permitted in ‘exceptional circumstances’ only, such as during heavy rainfall.\n“I’ve been looking at some of the 2024 spill data for the area that I represent, and I am disgusted by the level of wilful neglect.\n“The level of raw sewage dumped is not only deterring people from swimming, but the pathogens are decimating marine life too.\n“To add insult to injury, South West Water has had the audacity to significantly increase residents’ bills this month, with some people being charged double compared with last year.”\n“Instead of continuing to pay shareholders and senior management enormous dividends and salaries, the company must fully invest in its creaking infrastructure using those proceeds. We’re at this point due to years of neglect.”\nSome of the worst places for sewage dumping in the Honiton & Sidmouth constituency are:\n- Dulford Pumping Station – spilt 283 times for 6,198 hours into the River Weaver\n- Payhembury Wastewater Treatment Works – spilt 279 times for 5,373 hours into the Little Mere River\n- Honiton Wastewater Treatment Works – spilt 219 times for 3,808 hours into the River Otter\n- Feniton Wastewater Treatment Works – spilt 114 times for 1,886 hours into the River Otter\n- Stoneyford Treatment Works (Cullompton) – spilt 99 times for 1,782.98 hours into the River Ken\n- Kilmington Wastewater Treatment Works – spilt 158 times for 1,181 hours into the River Axe\n- Gittisham Pumping Station – spilt 82 times for 930 hours into the River Otter\n- Aylesbeare Sewage Treatment Works – spilt 103 times for 779 hours into the Aylesbeare Brook\n- Broadhembury Pumping Station – spilt 56 times for 679 hours into the River Otter\n- Fluxton Wastewater Treatment Works – spilt 89 times for 522 hours into the River Otter\nLast December, the Office for Environmental Protection (OEP) said that the government and regulators had broken the law by being too lenient on water companies that spill sewage.\nMr Foord added: “The last government had almost no interest in environmental regulation, which helped explain why Ofwat repeatedly failed to hold South West Water properly to account. The Government should scrap Ofwat and create a Clean Water Authority, along with implementing a total ban on water company executive bonuses until sewage dumping ends.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-warns-of-dental-timebomb-as-axminster-practice-goes-private/content_35.html": "Foord warns of ‘dental timebomb’ as Axminster practice goes private\nHoniton & Sidmouth MP Richard Foord has warned that time is running out to stop the ticking ‘dental timebomb’ across rural Devon, as Axminster Dental Practice becomes the latest local dentist to stop taking NHS patients and shift to only offering private care.\nIn a letter to residents of Axminster, the practice confirmed that the NHS dental contract was no longer able to meet the needs of providing this important treatment and from 1st October all patients will have to shift to a private dental plan.\nBecause of this change, people will be left facing substantially higher bills to receive the same care. For example, the cost of a twice-yearly dental check-up is currently £52 but under the new Dental Plan this will rise to £144 a year – a staggering 174% increase.\nLiberal Democrat MP Richard Foord has warned that the increasing number of dentists dropping NHS work in favour of more rewarding private care, as is happening in Axminster, will leave thousands across rural Devon unable to get the important care they need.\nHe’s calling for the new Government to urgently reform the NHS dental contract, in line with recommendations from the British Dental Association, that would ensure this work pays fairly and offers greater incentives for dentists who have went private to once again offer NHS care.\nRichard Foord MP said:\n“Right across our towns and villages, people are left struggling to get the dental care they need. The news that Axminster Dental Practice will shift away from NHS work from October is yet another blow to residents, many of whom were already struggling to find NHS dental care.\n“Our area has seen a swathe of dentists going private in recent years because the current NHS contract does not pay fairly for the work they do. Many dentists face no choice but to offer more private care in order to cover their costs, leaving us paying higher bills for treatment or simply having to go without.\n“Having access to NHS dentistry is vital to people’s health. Too many people - including thousands of children - have been left suffering with dental pain. Some people have needed to be admitted to hospital because of undiagnosed or untreated oral health issues, and some have even resorted to DIY dentistry and removed their own teeth at home.\n“The previous Conservative government offered only warm words about NHS dentistry, while also failing to take real action to stop this decay. Now, we face a situation where not a single dentist in all of Devon is taking on new NHS patients.\n“The Labour government must urgently commission a full review of the NHS dental contract, working with the British Dental Association to make NHS work pay fairly and train up a new wave of dentists. They should also make it easier while we await new dentists to come on-stream for dentists from Europe to practice here in the UK.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-conservatives-are-letting-south-west-water-off-the-hook/content_123.html": "Foord: Conservatives are letting South West Water off the hook\nResponding to the news that South West Water chose to ferry millions of litres of waste to a pumping station near Exmouth beach, despite knowing it would cause raw sewage to be spilled into the sea, Liberal Democrat MP Richard Foord said:\n“South West Water has repeatedly claimed that sewage spills are unavoidable. Now they have been caught cack-handed ferrying millions of tons of waste to a pumping station they knew wouldn’t be able to process it.\n“This is more than just incompetence; this is outright environmental vandalism on an industrial scale. The fact they continue to allow raw sewage to pollute our rivers and beaches wantonly is a scandal and we need tougher action to bring them into line.\n“While this Conservative Government continues to sit idly by, the Liberal Democrats have repeatedly demanded tougher action.\n“We have pushed for a sewage tax on the companies and their executives, as well as a beefed-up regulator. The regulator needs teeth to clamp down on practices which water companies try to get away with when they think we were not looking.\n“Sadly, Conservative MPs, including the current MP for Exmouth, have blocked these measures at every turn. Their disregard for this issue is letting water companies get away with choking our waterways.\n“As a Lib Dem MP for much of East Devon's beautiful coastline, I will continue to stand up for people across our communities who are impacted by these spills, until we see South West Water brought into a line by a Government that can grip this issue.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-secures-promise-of-review-into-local-railway-improvements/content_116.html": "MP secures promise of review into local railway improvements\nA recent bout of adverse weather saw huge levels of rainfall, which triggered a landslide near Crewkerne. This caused train services to be cancelled for more than a week, as there is only a single track on this section of the route.\nThis was not the first time this route has been blocked following heavy rain. In November 2022, the service between Exeter-Waterloo had to terminate at Axminster for several days due to a landslip near Honiton. These outages have been exacerbated by a failure to provide rail-replacement services.\nSpeaking in Parliament this week, Tiverton & Honiton MP Richard Foord raised the case directly with the Rail Minister, Huw Merriman, and urged action to dual the line between Chard Junction and Axminster, as well as adding that a passing loop at Whimple would allow trains to pass.\nIn response to Mr Foord’s calls, the Minister committed to reviewing the proposed project and said he would take extra steps to reduce disruption for people living in East and Mid Devon.\nCommenting, Tiverton & Honiton MP Richard Foord said:\n“Everyone living in our corner of Devon knows just how well-used our rail services are. They offer a vital commuter link to Exeter and London, as well as being a gateway to the wider West Country for tourists and visitors.\n“However, we’ve seen multiple issues in recent years that have caused many trains to be cancelled or delayed. In particular, the fact that there is only a single track between Chard and Axminster throttles capacity, meaning that one minor issue can derail services for everyone.\n“Solutions could include dualling the line, or adding a passing loop, so that services can move back and forth more easily. We also need to see greater investment in flood defences along our railways, to avoid more damaging landslips that can block the line.\n“I am glad that the Minister agreed to look into these proposals, which would benefit our communities and everyone who regularly uses rail services. I will continue to push for the signal to go green, so that this much-needed work can begin.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news/content_5.html": "Eastern Devon MP urges residents to “buy local” as fears grow over Trump tariffs\nRichard Foord, MP for Honiton & Sidmouth, has urged Eastern Devon residents to “buy local”, after he listened to business people at Sidmouth Chamber of Commerce last week.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_search/content_7.html": "Sidmouth Action Day Saturday April 26th\n📮 Final Saturday before polling – Saturday 26th April This is a big one! We’ll be knocking on doors, getting our personalised letters and new leaflet out to residents, we need a major push to…\n📮 Final Saturday before polling – Saturday 26th April This is a big one! We’ll be knocking on doors, getting our personalised letters and new leaflet out to residents, we need a major push to…\nRichard Foord, MP for Honiton & Sidmouth, has urged Eastern Devon residents to “buy local”, after he listened to business people at Sidmouth Chamber of Commerce last week.\nResidents across Mid- and East Devon are struggling to pay enormous new water bills, and charges are far in excess of the average rise recommended by Ofwat.\nWe need people to be at polling stations to feed back information to HQ about Voter Registration numbers, wearing rosettes to smile ina friendly manner and ask for numbers. Normally people are…\nHoniton & Sidmouth MP Richard Foord has written to the Chief Executive of the Royal Devon & Exeter following a decision by some Devon GP surgeries to cease providing blood tests for patients managed…\nAre you able to have a stake board, or even a super board? Even better if you are in a visible area (next to a main road, or a busy footpath or cycle path). Large garden posters (aka stake…\nSupport with household bills On 1st April, the energy price cap rose by 6.4%, with the average annual energy bill estimated at £1,849 per year. Combined with increases in water bills and taxes,…\nRichard Foord MP has demanded action on the shocking number of sewage spills into the rivers and coast around Mid- and East Devon, following last week’s release of data by the Environment Agency.\nRichard Foord, MP for Honiton & Sidmouth has highlighted the growing social care challenge in Devon, proposing an increased gambling tax to fund a higher minimum wage for social care workers.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-backs-pound300m-pothole-plug-fund-to-fix-devons-crumbling-roads/content_101.html": "Foord backs £300m ‘pothole plug fund’ to fix Devon's crumbling roads\nThe Liberal Democrats have today set out new proposals to fix Devon’s roads through a new emergency pothole fund.\nThe party would see £300million invested directly into fixing potholes over the next Parliament, which could see around 1.2 million potholes filled each year as a result.\nThis would be achieved by redirecting some of the funding currently allocated for new road building projects to ensure road maintenance and improvements are properly funded.\nAcross rural Devon, potholes continue to erode local roads and cause huge damage to drivers’ vehicles as the backlog of repairs has spiralled to more than £200million.\nThe poor state of local roads is also costing Devon County Council huge sums in compensation, with over £1million of claims being submitted in just eight months.\nRichard Foord has repeatedly pushed for greater investment to fix our crumbling roads, writing to the new leader of Devon County Council urging them to get tough on the Government over the need for more road repair funding.\nRichard Foord said:\n“This Conservative government has let our roads crumble around us. Some roads are now almost impassable due to the level of postholes and drivers are suffering as a result.\n“It isn’t fair that families across Devon are left paying the price for their neglect, when they have a duty to ensure our roads remain safe.\n“Ministers have overseen sweeping cuts to our transport network, maintenance works have seen severe delays, and the state of our roads across the board has gotten worse.\n“For all their lip service to motorists, it's clear this Conservative government simply does not care about drivers here in Devon and is content to keep taking us for granted.\n“The Liberal Democrats are serious about fixing our roads and understand that the only way to do this is through fair funding for our local councils. This will allow them to put more into road maintenance and start the tackle the huge backlog of repairs.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_volunteer_sidmouth-action-day-saturday-april-26th/content_46.html": "📮 Final Saturday before polling – Saturday 26th April\nThis is a big one! We’ll be knocking on doors, getting our personalised letters and new leaflet out to residents, we need a major push to get them out! Whether you are happy to door knock, or would rather leaflet, and can do a full round or just your street, every little helps. Please complete the form to let us know if you can help, thanks!\nSidmouth deserves better and we have to give it everything now we are so close to the finish line! It would be fantastic to have a real show of strength around the area - the more the better.\n2025 Saturday April 26th Action Day Sidmouth\nAction Day! Door knocking and leafleting all day Saturday April 26th. Meeting 10.00 outside The Balfour, Sidmouth EX10 9UZ, morning session 10-12.30, break for lunch at The Balfour, then continue later 1.30-4.00. We have two MPs coming - Richard Foord MP, and visiting us is Edward Morello MP (West Dorset). Please support!",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_new_campaigns_broadband/content_23.html": "Get Rural Devon Online\nRight across rural Devon, residents are being let down by poor broadband connectivity.\nWhile urban areas race ahead, villages and hamlets across our area been left lagging behind, with some unable to get even a basic connection.\nVillages like Northleigh endured a nine-year battle to get plugged in, while other communities almost totally cut off.\nThe Conservatives repeatedly promised to fix this problem, yet after years of waiting East Devon still has some of the worst broadband speeds in the country.\nIt's time for the government to urgently step-up work to fill in these internet black holes and ensure everyone can access decent broadband – regardless of where they live.\nWe need better rural broadband!\nPeople in Mid- and East Devon demand better",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_lib-dems-announce-pound10m-fund-for-new-sewage-inspectors-to-crack-down-on-dumping/content_84.html": "Lib Dems announce £10m fund for new Sewage Inspectors to crack down on dumping\nThe Liberal Democrats have announced plans to increase the number of water inspections after sewage was dumped 40 times in 2023 in waterways in Devon.\nThe party has pledged £10 million per year to deliver new water quality inspectors, as part of an ambition to recruit at least one hundred new ‘sewage-busters’.\nThe new water quality inspectors would work for the party’s new water regulator, the Clean Water Authority, giving it the capacity to deliver unannounced inspections, ensuring water firms cannot cover up pollution.\nUnder the party’s proposals, the water regulator Ofwat would be replaced with a new Clean Water Authority which would take on relevant powers to inspect and clean up waterways in England from the Environment Agency.\nRichard Foord, Liberal Democrat candidate for Honiton & Sidmouth, has said this “ambitious plan of oversight” would save waterways across Mid and East Devon – which have been deluged with sewage in recent years.\nRichard Foord said:\n“It is a scandal that this Conservative government has continued to allow water firms to mark their own homework.\n“They’ve turned a blind eye to the sewage scandal that is destroying our beautiful countryside, hurting both our local environment but also our tourist industry.\n“That’s why we need urgent changes, to ensure South West Water cannot continue to get away with polluting our treasured rivers and beaches.\n“The Liberal Democrats would reform the environmental regulator and hire a new team of sewage-busting inspectors to help put a stop to this dreadful scandal.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-meets-with-mental-health-service-after-shock-funding-cut/content_102.html": "MP meets with mental health service after shock funding cut\nRichard Foord MP has today met with volunteers and users of the Devon Recovery Learning Community in Honiton and promised to demand protection for the service, after it was confirmed their funding from NHS Devon would no longer be continued.\nThe Devon Recovery Learning Community (DRLC) has been operating since 2013, offering courses and drop-in sessions to support people struggling with their mental health and wellbeing to people across Devon.\nDevon Partnership NHS Trust is now seeing to wind-up the service, in a bid to save money, but has come under fire after the decision was taken without any prior discussion. It was only after the funding cut was confirmed that a limited consultation with service-users was announced.\nThis decision comes after a controversial planned cut to Devon County Council’s homelessness prevention fund was dropped following widespread opposition, with many citing the pressure this would add to services further down the line.\nLiberal Democrat MP Richard Foord, who represents rural East and Mid Devon, has called the planned cut ‘smoke and mirrors’, saying these services were a ‘vital frontline for those in need’ and that their impact is far reaching.\nHe is urging the Devon Partnership Trust to reconsider, highlighting that cutting preventative services like those offered by DRLC leads to more people needing serious treatment – costing more in the future.\nRichard Foord MP said:\n“Meeting with volunteers, employees and those who have used the services offered by the Devon Recovery Learning Community this morning was really eye-opening. Their impact on people’s lives is huge, with so many benefiting from the services they offer.\n“One service user told me how the decision to end this support left them feeling isolated and having nowhere to go, whilst another told me how, in her words, the service ‘literally saved my life’. This shows just how important DRLC’s work is.\n“The work of an organisation like this one is vital in protecting people’s health and wellbeing. We know that preventative treatment is far better – both in terms of cost and outcomes – for patients and the NHS.\n“That’s why the apparent decision to cut this service is a huge disappointment. It’s supposedly being done to save money, but that would be short-sighted and yet another case of smoke and mirror cuts – saving a small amount now, only to end up paying more in the coming years.\n“Services like DRLC offer hope for those otherwise at the end of their tether and the value of their work cannot be overstated. I am urging the Devon Partnership Trust to reconsider and will be writing to them to look again at how we can keep funding this critical local source of mental health support.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_page-5/content_51.html": "Chancellor's cutbacks point to straitened times ahead\nRichard Foord has responded to the Chancellor's announcement on public finances, describing them as \"grim reading\", but welcomed the commitment to projects in Devon including the re-opening of Cullompton Railway Station.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_page-7/content_63.html": "‘South West Water has officially gone rogue’ – Foord\nRichard Foord has branded South West Water a 'rogue' firm after they gave their Chief Executive a £300,000 pay rise.\nProud to represent Honiton, Axminster, Seaton, Cullompton, Sidmouth, Ottery St Mary, and surrounding villages.\nRichard Foord has branded South West Water a 'rogue' firm after they gave their Chief Executive a £300,000 pay rise.\nThis week Rishi Sunak had a once-in-a-generation opportunity to pay his respects to our D-Day heroes, British veterans and our allies from the Commonwealth and the rest of the world.\nLiberal Democrat Defence Spokesperson Richard Foord has called for the Prime Minister to make up for skipping the main part of the D-Day ceremony by making a donation to veterans' charities.\nLiberal Democrat candidate Richard Foord has written to Cllr James McInnes, the new Leader of Devon County Council, urging him to focus on fixing Devon’s ‘pock-marked’ roads and get tough on the Government in Westminster over funding cuts.\nRichard Foord has called for a new protected status for local rivers and marine protected areas, after shocking figures reveal that South West Water dumped sewage 6,688 times across east Devon in 2023.\nThe Liberal Democrats have called out the Conservatives for “abandoning the South West”, with only one town in thirty in their town funding announcement today being from the region.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-backs-move-to-give-patients-in-devon-right-to-see-a-gp-within-a-week/content_100.html": "Foord backs move to give patients in Devon right to see a GP within a week\nThe Liberal Democrats have announced a five-year scheme to ensure patients in Devon can see a GP within a week, or 24-hours if in urgent need, will be at the heart of their General Election manifesto.\nLast year there were more than 1.7 million appointments that took over two weeks in Devon, equating to almost one-fifth of appointments. This included a staggering 554,027 which took longer than a month, 6.2% of all appointments.\nThe number of long waits in Devon has been getting worse. In 2022, there were 1,389,593 that involved a wait of two weeks, 16.8% of all appointments. Last year this shot up drastically to 1,707,985 or 19.2% of all appointments.\nThe Liberal Democrats have said that under their scheme, patients will no longer be left waiting for an appointment and risk their conditions getting worse.\nThe party will deliver this by:\n- Increasing the number of full-time equivalent GPs by 8,000, half by boosting recruitment and half from retaining more experienced GPs.\n- Freeing up GPs’ time by giving more prescribing rights and public health advisory services to qualified pharmacists, nurse practitioners and paramedics.\n- Introducing a universal 24/7 GP booking system.\n- Removing top-down bureaucracy to let practices hire the staff they need and invest in training.\nRichard Foord, Liberal Democrat candidate for Honiton & Sidmouth, has said that the Conservative government had “abandoned local health services” and called for a “fair deal for patients”.\nRichard Foord said:\n“Under this Conservative government thousands of patients across Mid and East Devon are now facing agonisingly long waits, sometimes in terrible pain, to see their GP. This in spite of the hardwork of our GPs and surgery staff - who are doing all they can with limited resources.\n“The Conservative party have proven themselves totally unfit to manage our NHS properly. They have abandoned local frontline health and social care, allowing services to wither away while patients and our selfless staff bear the brunt of their neglect.\n“It should not be too much to ask for you to be able to see your GP when you need to, instead of having to sit by the phone every morning and pray you are lucky in getting through to claim one of the dwindling number of available appointments.\n\"Liberal Democrats would give you the ability to see a GP within a week by boosting the number of GPs and making booking an appointment easier. This will ensure that we get the fair deal we deserve and help address medical problems before they get worse.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_page-6/content_58.html": "Foord backs £300m ‘pothole plug fund’ to fix Devon's crumbling roads\nThe Liberal Democrats have today set out new proposals to fix Devon’s roads through a new emergency pothole fund of £300million, which could see an extra 1.2 million potholes filled each year.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-slams-south-west-water-as-execs-rake-in-more-than-pound1mn-in-pay-perks/content_47.html": "MP slams South West Water as execs rake in more than £1mn in pay & perks\nTiverton & Honiton MP Richard Foord has slammed “eye-watering payouts” as the Lib Dems reveal South West Water paid their executives £1,188,000 in pay and perks last year, while new analysis of Company House records has revealed the country’s water industry paid out a staggering £10 million in executive salaries last year - the highest on record.\nSouth West Water rewarded their two executives with a staggering £784,000 in base pay, alongside more than £400,000 in bonuses and pensions. This is despite the firm pumping raw sewage into the local area, including the River Culm, River Sid and on our beaches.\nSince 2020, executives at the water firm have paid themselves more than £5.8 million in pay and perks.\nLiberal Democrats have called for a ban on all CEO bonuses within the water industry, as well as the firms to be reformed as “public benefit companies”. The reforms would put an end to profit before the environment and ensure their boards including environmental experts.\nRichard Foord MP said:\n“Our local waterways have been subject to unauthorised sewage spills, and this whilst the water firm hand its top bosses insulting pay-outs. These salaries and perks have reached eye-watering levels, yet Conservative Ministers refuse to act.\n“I was shocked that there was literally no mention of sewage in the King’s Speech. Everyone here in our corner of Devon knows the scale of the problem, and yet the Government seems to take little interest.\n“The water industry in the UK has become a gravy train where sewage and money flow freely. These bonuses and perks shouldn’t be possible at a time when the sewage scandal continues. Bonuses should be a reward for success, not for committing environmental damage.\n“It is also time to ensure that South West Water can no longer put profit before the environment. The firm is clearly not working in the way that it should and is not listening to local concerns on sewage discharges.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-calls-for-action-after-57-of-burglaries-go-unsolved-across-mid-and-east-devon/content_103.html": "Foord calls for action after 57% of burglaries go unsolved across Mid and East Devon\nRichard Foord has called for action to ensure local burglaries are properly investigated, after new data uncovered by the Liberal Democrats reveals the shocking scale of unsolved burglaries in local areas across England and Wales.\nThe figures were compiled from a series of Freedom of Information requests by the party, which have broken down unsolved burglaries data by local area.\nThe number of burglaries that went unsolved across Exeter, East and Mid Devon in 2023 was 57%. Of the 674 cases, 385 had their investigation completed with no suspect identified.\nNationally, official government figures show that nearly 76% of burglaries went unsolved in 2023.\nIt comes as Liberal Democrat Leader Ed Davey has announced his aim of a national Burglary Response Guarantee will be part of the party’s manifesto. The party’s proposals would ensure that all domestic burglaries are attended by the police and properly investigated.\nHoniton & Sidmouth candidate Richard Foord MP said:\n“Too many people across Mid and East Devon are being left feeling unsafe in their own homes because this Conservative Government has spent years decimating frontline policing.\n“Victims are being denied justice because Conservative ministers can’t even get the basics right, with over half of all burglaries going unsolved.\n“That is why the Liberal Democrats would deliver a Burglary Response Guarantee, to ensure all home burglaries are attended by the police swiftly and are properly investigated.\n“People are sick of seeing their local communities plagued by crime and just want to know that when they call 999 they will get the proper help they need.\n“The only way to restore frontline community policing is to give the tired and out of touch Conservatives some well-deserved time on the bench.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-tables-bill-to-beef-up-sewage-reporting/content_87.html": "Foord tables bill to beef up sewage reporting\nLiberal Democrat MP Richard Foord has tabled a bill in Parliament to increase the powers of the Environment Agency, to give them greater responsibility and new powers to improve reporting on sewage discharges.\nResponsibility for collecting data on sewage discharges is with water companies – where it has been since 2009. This change came about as the Government sought to offload the cost of collecting this important information.\nHowever, this means they are also the only ones able to properly gather data and report on findings in relation to sewage discharges. Data collection and assessment is done ‘in-house’, with little oversight from Government or environmental regulators.\nThis has led to claims that water companies are ‘marking their own homework’, as the true scale of sewage discharges continues to be unclear. Last year alone, South West Water dumped raw sewage into Devon’s rivers and onto the local coastline for hundreds of thousands of hours.\nLib Dem MP Richard Foord, who represents Tiverton & Honiton and is standing for Honiton & Sidmouth at the next election, has tabled a Bill that places a legal responsibility on the Environmental Agency to assess the data collected by water companies and offer their own assessment of the situation.\nThis includes duties for the Government regulator to expand the testing regime, given that responsibility currently lies with water companies.\nThe Bill could be debated on Friday 23rd February 2024 and Mr Foord hopes that this will force the Government to put a greater focus on tackling the ongoing sewage scandal that is hurting coastal communities - and further expose some of the water companies’ sharp practices that investigative journalists have revealed in recent weeks.\nRichard Foord MP said:\n“The current water regulators, Ofwat and the Environment Agency, are clearly not fit for purpose. They lack the powers to properly hold water companies to account and even to properly scrutinise water companies’ actions.\n“Last year, South West Water oversaw hundreds of thousand of hours of sewage dumping. They allowed millions of litres of water to be lost due to leaky pipes and received a one star rating from the Environment Agency - yet they still paid out millions in bonuses and dividends.\n“This is simply scandalous. It cannot be right that the data on sewage spills is collected privately by water companies and then assessed ‘in-house’. This leaves water bosses to effectively mark their own homework and keeps the rest of us in the dark about the true scale of the crisis.\n“We need to beef-up our regulators, by giving them a legal duty to assess this information and offer their own reporting. Since the Conservative Government has failed to take this crisis seriously and act, I have now taken matters into my own hands.\n“I have tabled a Bill in Parliament that would mandate the Environment Agency to independently assess the data collected. This way, we will get a clear picture of what is going on and will be able to hold these firms to account for poisoning our rivers and beaches.\n“I hope MPs from all parties will get behind this push and back my Bill, so we can end this sewage scandal and protect our precious natural environment, which brings so many to our part of the world.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_hopes-for-january-decision-on-seaton-hospital-community-business-case/content_92.html": "Hopes for January decision on Seaton Hospital community business case\nThe Seaton Hospital Steering Group, which met in early December, alongside MP, Richard Foord, has been waiting for a response to a business case for a community health and wellbeing hub.\nThe initiative would be based in a part of the hospital that previously accommodated 18 beds, which were closed in 2017.\nSince the beds closed, NHS Property Services, which took over the ownership of Eastern Devon community hospitals around a decade ago, started charging the local NHS £300,000 a year rent for the now empty wing.\nNHS Devon, one of the most financially challenged health organisations in the country, has previously set out a range of options for the wing, one of which included sale and demolition.\nThe steering group’s chair, Cllr Jack Rowland, explained:\n“Residents were understandably outraged when they heard that their beloved hospital, built just 35 years ago, was proposed to be partly demolished a few years after losing all its in-patient beds. Many of them helped fundraise millions of pounds to get the hospital rebuilt in the first place, so it was a double blow.”\nMore than 400 residents attended a public meeting in November 2023 about the risk to the hospital and over 9000 people in the town later signed a petition to protect the hospital.\nCllr Rowland continued:\n“A group of us set up Seaton Hospital Steering Group and have been working with NHS Property Services and representatives from NHS Devon’s Integrated Care Board for many months. We came up with a comprehensive business plan for a community health and wellbeing hub, encompassing 18 organisations providing dementia services, as well as early years care, which we submitted in June.\n\"We’re hoping that a decision now looks closer as NHSPS is in the process of rewriting their social prescribing policy that should be concluded next month.”\nThe steering group successfully registered the building as an Asset of Community Value earlier this year, which they also hope will protect it.\nRichard Foord, who attends the steering group meetings and is working to save all of the hospital, said:\n“A reply from health minister, Karin Smyth, to my most recent letter requesting protection for the hospital, suggested that due to its new status as an Asset of Community Value, in her view, demolition would only take place as a last resort, but this doesn’t seem reassuring.\n“I urge NHS Property Services and NHS Devon to look positively on our business plan to create a health and wellbeing hub in the hospital. It’s just a shame that the community has had to fight so hard to retain something so obviously cherished - and by rights, that should be owned - by the local community.\n“The system of charging one cash-strapped NHS organisation huge sums of money to keep a hospital wing open, which could lead to an almost new building being demolished, is a very strange way to run the NHS in my opinion and I demand a more sensible way of managing our NHS property.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-1/content_31.html": "Eastern Devon MP urges residents to “buy local” as fears grow over Trump tariffs\nRichard Foord, MP for Honiton & Sidmouth, has urged Eastern Devon residents to “buy local”, after he listened to business people at Sidmouth Chamber of Commerce last week.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_newsletter/content_9.html": "Reporting Back\nAs your Member of Parliament, I am determined to keep in touch with residents all year round and to update you of my work both here in Devon and in Westminster.\nTo do this, I run a regular community newsletter - sharing key information and allowing me to report back directly to you.\nIf would like to sign up to receive my newsletters, then fill in the form below. You can also find all previous editions linked below.\nSign up for email updates\n2025\n-\nApril 2025\n-\nMarch 2025\n-\nFebruary 2025\n-\nJanuary 2025\n2023/24\n-\nDecember 2024\n-\nNovember 2024\n-\nOctober 2024\n-\nSeptember 2024\n-\nAugust 2024\n-\nJuly 2024\n-\nJune 2024\n- The newsletter was postponed in June 2024 due to the general election\n-\nMay 2024\n-\nApril 2024\n-\nMarch 2024\n-\nJanuary 2024\n-\nDecember 2023\n-\nNovember 2023\n-\nOctober 2023\n-\nSeptember 2023\n-\nJuly 2023\n-\nJune 2023\n-\nMay 2023\n-\nApril 2023",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_pm-should-donate-hester-pound5-million-to-veterans-charities/content_110.html": "PM should donate Hester £5 million to veterans' charities\nCommenting on the Prime Minister skipping part of the D-Day anniversary event in Normandy yesterday, Liberal Democrat Defence Spokesperson and veteran Richard Foord said:\n\"The Prime Minister has badly let down veterans and our country. He disrespected his office and the United Kingdom.\n\"Yesterday it emerged that the Conservative Party accepted another £5m from Frank Hester, a man who has made the most appalling racist and misogynistic comments.\n\"Rishi Sunak must personally ensure this money is donated instead to veterans' charities as an apology for his absence yesterday. It's the least that our veterans and service personnel deserve.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_big-win-as-seaton-hospital-secures-community-asset-status/content_97.html": "Big win as Seaton Hospital secures ‘Community Asset’ status\nSeaton Community Hospital has been granted the status of an ‘Asset of Community Value’ in a big win for the campaigners fighting to save an endangered wing at the hospital.\nBeing listed as an ‘Asset of Community Value’ means the facility provides a positive benefit for the local community and should be protected. Once listed, the local community will be informed if they are listed for sale or removal.\nThe community can then enact the Community Right to Bid, which gives a six month pause in the selling process, to try and source alternative ways to repurpose the building.\nThis decision represents a big win for campaigners, who are opposed to plans to turn a whole wing of the facility – that was build using money raised by the local community – over to NHS Property Services, for onward disposal.\nNHS Property Services is a Government-owned company responsible for the management of NHS facilities. The transfer of the ward away from NHS Devon brings with it a real risk that the space could be demolished or sold-off.\nIn response to this decision, Seaton’s MP Richard Foord and the Seaton Hospital League of Friends charity are calling on NHS Property Services not to appeal this decision, and instead work constructively with the community to bring the space back into use as a new Care Hub.\nSeaton's MP Richard Foord said:\n“Seaton Hospital being listed as an Asset of Community Value is a big win for all those seeking to stop plans to drive a wrecking ball through our cherished local hospital.\n“We know the huge value it delivers to both Seaton and other communities across the Axe Valley, providing care both at the hospital and directly to people’s front doors. To see it stripped away would be a travesty.\n“With over 9,000 people backing my campaign to save our hospital, the strength of feeling is clear to see. They paid for this wing; they are not going to let it be taken away by this private company – which is solely owned by the Conservative Health Secretary.\n“The ball is now in NHS Property Services' corner. I am calling on them to drop their plans to take back ownership of this wing and instead work with both myself, the League of Friends, and East Devon District Council to find a way forward.”\nDr Mark Welland, Chair of the Seaton Hospital League of Friends, commented:\n“This decision is to be warmly welcomed and reflects the positive work of everyone in our health care services. Our community hospital is on the frontline every day, delivering vital care to those living across the local area.\n“I hope that NHS Property Services will recognise that there are many other ways the space can be used to boost care and improve the lives of everyone across our communities, and that they will now focus their efforts on working with us to develop a new future for that wing of the hospital.”\nCllr Paul Arnott, Leader of East Devon District Council, added:\n“I have been clear from the outset that East Devon Council backs our local hospitals and stands ready to do all we can to protect them.\n“This status now offers increased protection for Seaton hospital, but this is not the end of the line. Now the ball is in NHS Property Services’ corner, and I hope they will not seek to fight us on this.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_devon-becoming-a-childcare-desert-as-number-of-providers-falls-by-almost-a-quarter/content_118.html": "Devon becoming a ‘childcare desert’ as number of providers falls by almost a quarter\nLiberal Democrat MP Richard Foord has warned that Devon is on the verge of becoming a ‘childcare desert’ as new research reveals the number of childcare providers in Devon has fallen by almost a quarter since 2019, resulting in 1,254 fewer placements.\nThe House of Commons Library research, commissioned by the Liberal Democrats, shows that in Devon the number of childcare places has fallen by 9% since 2019 from 13,931 to 12,677. This represents 1,254 fewer places available for local parents.\nIt also reveals that childminders were the most affected providers – with the number available dropping by 35% in just five years. These shock findings come as applications open for parents to register for 15 hours of free childcare for children 9 months+ from September.\nThe situation is equally dire nationally, with the number of childcare providers (including nurseries and childminders) shrinking by a fifth since 2019. This has meant every area in the country, except the City of London, has seen a fall in the number of providers.\nThe Liberal Democrats have said the fall in providers was putting this new childcare offer at risk of being undeliverable and threatens to leave parents “without options”, with Tiverton & Honiton MP Richard Foord warning the crisis was even worse for rural families.\nLast month the National Audit Office criticised the Government’s childcare rollout, saying that dates for the scheme were decided without a clear understanding of whether the sector could actually provide the number of places needed to meet this increased demand.\nIn response to these findings, Richard Foord MP is calling on the Government to review the rates paid to rural childcare providers for this new coverage, to ensure they pay fairly and meet the actual costs of delivering the high-quality local children deserve.\nLiberal Democrat MP for Tiverton & Honiton, Richard Foord, said:\n“Childcare here in Devon has stripped bare by years of neglect from this out of touch Conservative Government. Local parents have been left completely without options and unable to get the affordable childcare they need.\n“Offering more free hours is pointless if parents can’t find a nursery or childminder close to where they live – and thanks to this Conservative government's underfunding, many parents will now find this all but impossible.\n“Our towns and villages on the verge of becoming a childcare desert and this is just unacceptable. We need less gimmicks aimed at grabbing headlines and instead need to see real work put in to support hardworking parents.\n“Ministers must urgently review the amount they pay providers to cover the free childcare allowance, to ensure it covers the actual costs of delivering high-quality childcare and early years education – especially in rural areas like ours.\n“We also need to see a real push to stop the mass exodus of childminders we have seen in recent years. We need more incentives to get people back into the sector and ensure everyone, no matter where they live, can access professional and affordable childcare when they need it.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-calls-for-investment-in-community-policing-in-wake-of-police-front-desk-reopening/content_127.html": "MP calls for investment in community policing in wake of Police front desk reopening\nHoniton's MP has called for extra investment in community policing after attending the re-opening of the front desk at the town's police station.\nOn Tuesday, Richard Foord MP joined Police Officers, civic leaders across East Devon, and pupils from local schools to cut the ribbon and celebrate the reopening of the front desk at Honiton.\nIt will be an access point for much of East Devon, with Councillors present from as far away as Axminster and Sidmouth.\nThe desk will be staffed by Police Enquiry Officers and will enable members of the public to speak to an Enquiry Officer face to face. The hope is that this will make it easier for people to report crimes and offer greater reassurance to residents.\nHowever, Mr Foord is now calling for the reopening to be matched with a renewed focus on investing in grassroots community policing – as well as reversing the 60% cut in Police and Community Support Officers that has taken place since 2015.\nCommenting, Liberal Democrat MP Richard Foord said:\n“The re-opening of the front desk at Honiton Police station represents real progress - particularly in terms of our push to restore fully the bond between the officers who keep us safe and local residents.\n“People feel more safe and secure when we prioritise grassroots community policing, with officers who are well known within the community. People appreciate visible and accessible neighbourhood teams, so that crime can be prevented or is easy to report when it occurs.\n“The number of Police Community Support Officers across Devon and Cornwall has been cut by 60% since 2015. Our neighbourhood teams cannot be everywhere at once, so these PCSOs play a vital role in helping bridge that gap.\n“We have so many outstanding local community support officers. They really are at the heart of their communities and the role they play is invaluable – that’s why we need to bring back the hundreds of PCSO roles that have been cut back.\n“This, combined with further front desk re-openings across our towns, will ensure more residents feel safe where they live. I am urging both the Government and Police & Crime Commissioner to make this a priority.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-hosts-final-parliamentary-debate-of-2023/content_91.html": "Foord hosts final Parliamentary debate of 2023\nSpeaking for over 15 minutes, Mr Foord set out the case for building the long-promised Cullompton town centre relief road, a railway station and funding improvements at Junction 28. These would ease congestion in the town, make the town fit for cycling or walking, and reduce air pollution.\nThe current plans for the Culm Garden Village are at risk of stalling, as National Highways, Cullompton Town Council and now the MP will not endorse growing the town significantly until there is investment in local transport infrastructure.\nIn his remarks, Devon’s Lib Dem MP Richard Foord said that the relief road costs could easily be met by central Government and would deliver real benefit to both those living in and around the town, as well as those who commute to school or work.\nMid Devon District Council twice bid to the Government in Westminster for Levelling-up funding to enable the town centre relief road to advance, after securing £10million of funding from Homes England, but the bids were rejected each time. This has led to concern that the town is once again being overlooked.\nSpeaking after his debate in Parliament, Richard Foord said:\n“It was a great honour to lead the final debate of the year in Parliament today, and to raise the lack of action that has dogged Cullompton, in terms of its local transport infrastructure.\n“We cannot keep building houses without the appropriate infrastructure to support them. This includes GPs’ surgeries and schools, but it also includes transport infrastructure so that new road, cycle, and rail projects can ease congestion.\n“We have seen little action from this Government to deliver on their promises. Mid Devon Council residents should complete the Devon County Council official consultation in relation to the Junction 28 and relief road options, and not get it confused with the recent party-political survey from the Conservatives.\n“Everyone who gets snarled-up in the town - idling in traffic - knows who is to blame for their misery. I used my debate today to ask the Government to deliver the people of Cullompton the Christmas gift everyone has been requesting for years - and finally give the Cullompton town centre relief road the green light.\n“I will continue to raise this issue and fight to deliver the road that the town desperately needs.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-calls-for-devon-council-leader-to-get-tough-on-govt-over-potholes/content_112.html": "Foord calls for Devon Council Leader to ‘get tough’ on Govt over potholes\nLiberal Democrat candidate Richard Foord has written to Cllr James McInnes, the new Leader of Devon County Council, urging him to focus on fixing Devon’s ‘pock-marked’ roads and get tough on the Government in Westminster over funding cuts.\nIn his letter to Cllr McInnes, Mr Foord highlighted that the total cost of clearing the backlog of road repairs in Devon has spiralled to almost £200million – far outstripping the recent additional funding announced for pothole repairs.\nHe went on to say that the lack of serious action on potholes shows that Conservative Ministers in London are not taking the issue seriously and urged the incoming leader to take a tougher stance and put extra pressure on the Government to act.\nRichard Foord repeatedly raised the dangers and damage caused by potholes. He spoke about the issue in Parliament, criticising the extra pothole funding announced as insufficient and pressing Ministers to do more to fix Devon’s crumbling roads.\nRichard Foord, Liberal Democrat candidate for Honiton & Sidmouth said:\n“Anyone who drives round our local roads knows just how bad they have become in recent years. I am sure you can find fewer craters on parts of the moon than won’t hold a candle to the state of some of our rural roads.\n“The truth of the matter is that this Conservative Government has repeatedly slashed the funding for local councils, something voted through by Conservative West Country MPs. This has left Devon unable to keep up with road maintenance, leading to a £200million backlog of repair work.\n“Ministers have then announced small token sums of money, which go nowhere close to addressing the scale of issue and expect us all to be grateful. This is frankly insulting and shows that the Conservatives are continuing to take towns and villages across Devon for granted.\n“Cllr McInnes has recognised that road maintenance is a growing concern, now he must force the issue and demand change from Westminster. We cannot begin to properly fix our roads till we see Devon get a fair funding deal, which reflects our expansive rural road network.\n“I hope he will agree to join me in demanding better for people right across our county.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-welcomes-u-turn-on-ticket-office-closures/content_75.html": "Foord welcomes u-turn on ticket office closures\nLiberal Democrat MP for Tiverton & Honiton Richard Foord has welcomed the news that railway ticket offices at Feniton, Honiton, Axminster and Tiverton Parkway will remain open.\nThe recent u-turn from the Government comes after weeks of speculation about their fate, after proposals to close all ticket offices - put forward by rail operating companies - were put to an extensive public consultation.\nDespite huge backlash, Conservative Ministers initially defended the proposals. In a debate in Parliament, Rail Minister Huw Merriman stating that the proposals were aimed at getting \"ticket office staff to come from behind the ticket office and interact with passengers, customers, on the platform\".\nIn the wake of the announcement, Richard Foord raised the issue multiple times in Parliament and wrote to both South Western Railway and Great Western Railway about the impact closing ticket offices would have on local people. The MP has said that today's is a big win for all the community campaigners who have been vocal in opposing the plans.\nCommenting, Richard Foord MP said:\n“The scrapping of plans to close our local ticket offices is welcome news. We know how helpful they are to elderly and vulnerable passengers, and the huge benefit that ticket office staff offer rail users.\n\"The question is - why did it take the Government so long to act? The damage that these changes would have caused was visible from space. The public backlash showed a strength of feeling that makes it plain this decision should have been made ages ago.\n\"Ministers at the Department for Transport chose to sit on their haunches for months until we campaigners forced them go into reverse. So this is a big win for our corner of Devon and everyone who uses our railways.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-sunak-has-abandoned-the-south-west/content_67.html": "Foord: Sunak has abandoned the South West\nThe Liberal Democrats have called out the Conservatives for “abandoning the South West”, with only one town in thirty in their town funding announcement today being from the region.\nThe Long Term Plan for Towns has only ever included one other town in the South West since it was launched in 2023.\nBy contrast, six towns in the West Midlands, six in the East Midlands and four in the North West are on today’s Conservative list.\nRichard Foord, the party’s candidate for Honiton and Sidmouth, says that “Rishi Sunak has clearly forgotten” about the South West and called for the region to get its fair share of funding.\nRichard Foord said:\n“The Conservatives have almost abandoned the West Country entirely with this announcement. Our region has been let down and taken for granted yet again, just as it has been for years. Their hollow ‘levelling up’ agenda has failed to deliver and forced areas to compete with one another for crumbs from the table.\n“The South West is struggling with the continuing cost-of-living pressures, raw sewage tainting our rivers and beaches, and our rural health services that have been pushed to breaking point.\n“But Rishi Sunak seems to be living in a fantasy land and has clearly forgotten about what our region needs - proper funding for local councils, alongside the power to make investments that will improve people’s lives.\n\"Liberal Democrats will put our communities and high streets first, by reforming the outdated business rate system to encourage new businesses to invest in our high streets. We would invest in our rural communities properly, rather than leaving them behind like the Conservatives.\n“Voters know that the Liberal Democrats are the principal challenger to the Conservatives across rural and coastal parts of the South West. It’s time to elect a local champion who will put our communities first.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_wollaston-resignation-shows-nhs-in-devon-is-at-breaking-point/content_71.html": "Wollaston resignation shows NHS in Devon is at breaking point\nLiberal Democrat candidate for Honiton & Sidmouth Richard Foord has warned that Devon’s NHS is ‘at breaking point’, as Dr Sarah Wollaston resigns as Chair over looming cuts.\nDr Sarah Wollaston today announced she had resigned as Chair of NHS Devon, given her reluctance to sign off further cuts to services – stating that the “elastic [has] already stretched too far” in relation to capital spending.\nShe said that “the state of our infrastructure in too many places is frankly shocking” and warned that a decision had been made to ‘punish’ parts of the NHS with penalties on capital spending budgets.\nRichard Foord has long called for the Government to invest more in local community health facilities, including protecting Seaton Hospital from having a community-funded ward sold off by NHS Property Services.\nCommenting on the situation, Richard Foord said:\n“Dr Wollaston has taken a brave decision by resigning as Chair of NHS Devon, in protest at further cuts to local facilities.\n“The fact she felt the need to do so highlights just how bad things have become under this Conservative government, with community health services here in Devon at breaking point due to damaging cutbacks.\n“We’ve seen this first-hand in Seaton, where I’ve been leading a campaign to stop a whole ward of the hospital being ripped away from the community who paid for it, to be sold off to help fill Treasury coffers in London.\n“I am proud to be a champion for our NHS. The Liberal Democrats recognise the scale of the challenge; that is why we are pushing for an NHS Rescue Package - to deliver the investment needed to improve frontline health and care services.\n“Every vote for the Liberal Democrats at this election is a vote to fix our NHS and ensure people here in rural and coastal Devon get the care they need.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-leads-call-for-improved-resilience-to-protect-uk-citizens/content_114.html": "Richard Foord MP leads call for improved resilience to protect UK citizens\nOn the fifth anniversary of the start of the COVID-19 pandemic, Richard Foord, MP for Honiton & Sidmouth, will call on ministers to properly protect UK citizens from the impact of overseas malign governments, potential food and medicine shortages and a future pandemic.\nMr Foord said: “Five years ago this month, a pandemic erupted across the globe, throwing governments and societies into chaos, and causing over 200,000 deaths in the UK alone.\n“A new pandemic is just one of the many threats facing the UK.”\nThere are few food reserves\nMr Foord explained: “The ‘just in time’ food supply chain leaves us alarmingly vulnerable to disruptions, as we witnessed during the COVID-19 pandemic when supply chain issues led to empty supermarket shelves. There are very few food reserves and the risks are considerably greater when climate change and the degradation of prime agricultural land is considered.\nForeign governments pose an ongoing risk\n“The historical lack of investment in our defence means that we are woefully underprepared for a potential war, both in terms of military equipment, personnel or for handling casualties.\n“And it’s becoming ever more urgent to arm our children and indeed all our people, with the ability to determine false information from genuine facts, to avoid serious threats to our democracy.”\nReferring to the risks of a new pandemic, Mr Foord added: “The Conservative government should have been prepared, it was explicitly informed what it needed to do. But ministers ignored official advice and a series of disastrous decisions followed. This sort of carelessness with people’s lives must never be repeated.”\nSenior doctors and health managers have said that this month is a critical time for the NHS. That pressures have never been so great and there is a chronic shortage of beds.\nDevon’s NHS is particularly challenged as it has been forced to slash services due to a £200m deficit. This month there is set to be a (mitigated) shortfall of over 500 acute hospital beds across the county.\nToday, Mr Foord will call on ministers to:\n- commit to implementing the UK COVID-19 Inquiry’s recommendations to strengthen our emergency preparedness\n- prioritise a national food security plan to ensure resilience against climate change and supply chain disruption\n- outline what steps the Government will take to develop a comprehensive strategy to counter hybrid threats",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_1598-patients-in-royal-devon-trust-waiting-more-than-two-months-to-start-treatment/content_109.html": "1,598 cancer patients trust waiting more than two months to start treatment at Royal Devon\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral, as part of a plan to boost survival rates and improve treatment for those affected by the disease.\nThe latest NHS figures show that, in the last year, over 100,000 cancer patients in England were left waiting more than 62 days to start treatment after an urgent referral.\nThis includes 1,589 cancer patients at the Royal Devon, an increase of 300% compared to 2015/16. This means only 36% of patients in the area were treated within two months, far below the government’s target of 85%.\nLaunching the Liberal Democrat election manifesto this week, Liberal Democrat Leader Ed Davey has set out the party’s proposals to invest an extra £8.4 billion a year in the NHS and social care.\nThe Liberal Democrats aim to boost cancer survival rates by increasing the number of radiotherapy machines, cutting the time for new medicines to reach patients, a new cancer research law, and improved support for cancer patients and their families.\nThe policy builds on existing proposals from the party on health, including introducing a right to see a GP within a week and expanding NHS dentistry so people aren’t forced to pay for private dental treatment.\nRichard Foord, Liberal Democrat candidate for Honiton & Sidmouth, said:\n“Right across rural Devon, almost every family know the anguish of seeing their lives turned upside down by cancer.\n“Far too many people across our countryside are waiting far too long for a diagnosis, or to start treatment after being diagnosed.\n“We must do right by them and get them the care they need as soon as possible.\n“The Liberal Democrats would give cancer patients a new, legal right to treatment within two months of an urgent referral, to make sure they get the timely care they deserve.\n“This forms part of our ambitious aim to end unacceptable cancer delays and boost survival rates.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_morrisons-launch-british-section-online-after-campaign-backed-by-local-mp/content_119.html": "Morrisons launch ‘British’ section online after campaign backed by local MP\nA campaign for a ‘Buy British’ section on supermarkets’ online stores supported by Devon’s Liberal Democrat MP Richard Foord has first major success as Morrisons launch ‘British’ section online.\nIn August 2023 Mr Foord, Member of Parliament for Tiverton & Honiton, joined with 120 other cross-Party MPs to sign an open letter calling on supermarkets to highlight the very best of British produce by implementing a ‘Buy British’ section online.\nThe letter stated ‘Our ask is simple, create a tab that collates produce from farmers,’ citing consumer choice, environmental benefits and support for farmers as reasons to make the change.\nNow, Morrisons Chief Executive Rami Baitiéh confirm that “we have implemented a ‘British’ section to morrisons.com which enables customers to quickly navigate to British [produce]”. This includes homegrown meat, dairy, fish and vegetables.\nThis new section of the website, which groups together key British lines, can be found via the ‘Shop Groceries’ drop-down menu on the morrisons.com homepage, with Morrisons saying they “intend to continue developing this section of the website and highlight new lines as they come into season.” Food has been increasingly imported in recent years, which is unhelpful for local producers and bad for the environment.\nIn addition to the letter, over 27,000 people have signed a National Farmers Union (NFU) petition in support of a ‘Buy British’ section online and on Back British Farming Day, September 13th, the Government endorsed the campaign and called for industry-led action by supermarkets.\nCommenting on the news, Richard Foord MP said:\n“I applaud Morrisons for making this small but meaningful change to help customers know how they can buy British produce more easily. We know that Devon has some of the best farmers in the world, and it’s right that we showcase them.\n“The reaction to this campaign has been overwhelmingly positive, with producers across the country supporting the call and consumers asking why supermarkets weren’t doing it already.\n“The ball is now firmly in the courts of other supermarkets. I hope they will follow suit and implement the ‘Buy British’ section soon. I look forward to seeing the new display at the Tiverton store in the coming weeks.”\nMinette Batters, President of the National Farmers Union, said:\n“It’s great to see Morrison’s launching a ‘British’ section online to signpost shoppers to British produce – something we have been asking retailers to commit to since 2016.\n“We know from our own independent survey that 86% of the public want to buy more British food and this simple change with an online button will help shoppers just do that.\n“I hope today’s news will pave the way for other supermarkets to follow suit.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_page-2/content_13.html": "Richard Foord MP calls for rethink to “rejuvenate” market towns, as Mid- and East Devon miss out on funding\nRichard Foord, MP for Honiton & Sidmouth, is calling on the Government to think again on its decision last week to plough funding into 75 areas, that saw the South West almost entirely excluded from the £1.5bn announcement.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_remembering-britains-nuclear-weapons-tests/content_53.html": "Remembering Britain’s nuclear weapons tests\nI joined with veterans and members of the Royal British Legion on Saturday 31st August, at the parish church in Sidmouth to lay a wreath at the town’s war memorial. More than two months early, you might suppose? Yet we were there to pay tribute to nuclear test veterans.\nOver 22,000 service personnel were nuclear test veterans, who observed in the 1950s and 1960s detonations of nuclear weapons by the UK, in the Pacific. Four of them were represented at the service last Saturday.\nMaria from Axmouth was there for her late husband Tony, who served in the Royal Navy. Tony died in 2022 without knowing that he would receive recognition. Maria was awarded a medal at Axminster in January this year on behalf of her late husband.\nI met also with Brian from Honiton. Brian served in the Royal Engineers and was tasked to extend the runway at Christmas Island to accommodate the bomber aircraft that dispatched the hydrogen bomb over an island in the Pacific.\nThere are some fascinating accounts available online of what it was like to observe the detonations. One veteran describes how, despite being asked to turn away from the blast and cover his eyes, he could see his finger bones through his skin when an incredibly bright flash followed the detonation.\nPersonally, I have mixed feelings about Operation Grapple, in which they were engaged.\nI defy you to meet the veterans and their spouses and fail to be impressed by their fortitude. Yet some of them served through no choice of their own, as national servicemen. Most were kept in the dark about what would be required of them; many were ignorant of the fact that they would be observing the detonation of a thermonuclear device until it happened. Some suffered from illness in later life that has been attributed to the fallout.\nWith ever fewer people having served in our dwindling Armed Forces, it is vital that this generation of politicians and the public is educated about the scale of the devastation that could be wreaked. I am grateful to those surviving veterans who saw the detonation of a hydrogen bomb saw fit to remind the rest of us of what they observed of these awesome, awful weapons.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_volunteer_2025teller/content_57.html": "We need people to be at polling stations to feed back information to HQ about Voter Registration numbers, wearing rosettes to smile ina friendly manner and ask for numbers. Normally people are happy to help (because it stops us knocking on their doors). This means we can concentrate our door knocking on those who have not yet voted. Please help if you can.\n2025 Polling Stations\nCan you wear a rosette, smile, and ask voters if you can have their voter ID number? It will really help us with the Get Out The Vote push.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_volunteer_stake-board/content_8.html": "Are you able to have a stake board, or even a super board? Even better if you are in a visible area (next to a main road, or a busy footpath or cycle path).\nLarge garden posters (aka stake boards) are a great way to show your support for our campaign and every extra poster puts us a little closer to winning here.\nBy completing this form, you are giving permission for the Liberal Democrats to put up a stake board poster on your property during the election campaign. We’ll come back after the election to remove it.\nIf you have any specific instructions for where you would like the poster to go, or you can accommodate one of our super sized boards, please email denise.bickley@libdems.online (organiser).\nStake Board or Super Board Signup\nPlease complete this form and click 'Yes please' if you are happy for us to install a stake board at your property for the duration of the election.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_nature-is-in-crisis-richard-foord-mp-calls-for-environment-to-be-at-the-heart-of-government-work/content_70.html": "Nature is in crisis: Richard Foord MP calls for environment to be at the heart of government work\nRichard Foord, the MP for Honiton & Sidmouth, whose constituency spans some of the most sensitive landscapes in the country, is robustly backing the Climate and Nature Bill (CAN) Bill which will be debated on Friday (24 January).\nThe Private Members Bill is being championed by the trans-Atlantic rower and Liberal Democrat MP Roz Savage. It proposes a legally-binding mission statement to ensure policy and action on the climate and nature crisis is science-led and people-oriented.\nDozens of constituents have written to Richard urging him to back the Bill.\nHe said: “Our natural world is in crisis and needs urgent action. It is precious and essential for the survival of the human race, yet governments continue to allow the planet’s temperature to soar, while species such hedgehogs, some birds, bees and other insects, once common-place in the UK just a few decades ago, have seen their numbers plummet.”\nAccording to the State of Nature report 2023, essential pollinators such as bees, hoverflies and moths decreased by 18 per cent on average since 1970, whilst predatory insects, like the two-spot ladybird which helps control crop pests, have declined by more than a third.\nMany other flowering plants and other species have dramatically fallen.\n“Almost one in six species in the UK are now threatened with extinction.\n“These losses have been caused largely by changes in the way we manage our land, climate change and development.\n“We need to get smarter about following the science on both the decline of nature and on the heating of our planet.\n“And we must reject defeatism, just because one or two other countries are going in the opposite direction. The majority are working to prevent catastrophic climate change and nature loss. Enacting the Climate and Nature Bill would help do that.”\nEast Devon contains some of the most beautiful landscapes in the country, including the highly protected Aylesbeare Common – designated a Site of Special Scientific Interest (SSSI).\nIt also covers some of the Jurassic coastline at Sidmouth, Seaton and Beer, where marine life is suffering due to sewage spills, overfishing, plastic pollution and climate change.\nRichard added:\n“Unfortunately, the Conservative government largely ignored nature, seeing it as a ‘nice to have’ and cut to the bone the budgets of statutory bodies such as Natural England.\n“The new government is putting in place plans to mitigate climate change. However, its approach to the biodiversity crisis has been so far disappointing. I am troubled that contrary to scientific advice, ministers appear to be planning to re-licence some bee-killing \"neonicotinoids\", which would break a manifesto pledge.\n“It’s essential that we follow the science and that ministers are not unduly influenced by lobby groups who have something to gain. Voting against the Bill in my view, would be unconscionable.”\nThe Climate and Nature Bill needs at least 102 MPs present on Friday 24 January to be heard. If it fails to get that many MPs attending to support the Bill, it may fall.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-calls-for-new-powers-to-shield-farmers-from-supermarket-exploitation/content_126.html": "MP calls for new powers to shield farmers from supermarket exploitation\nLiberal Democrat MP Richard Foord has called for the government to give new powers to the Grocery Code Adjudicator, so it can properly protect Devon’s farmers.\nThe Adjudicator oversees the interactions between farmers and retailors, with a focus on ensuring fair play. However, it current lacks the power to properly investigate incidents where supermarkets take advantage of small family-run farms and producers.\nSpeaking in Parliament, Mr Foord showcased the huge importance of farmers to rural communities and how vulnerable many currently are due to uncertain financial conditions, which puts the future of traditional market towns at risk.\nHe criticised the government for their lack of support for British farmers with their push for new trade deals which undermine our food and animal welfare standards and their botched phasing out of the Basic Payment – which has seen many farms lose a substantial amount of their income.\nHe also highlighted that while the big six supermarkets made bumper profits last year, a survey by Riverford Organic Farmers found that 49% of farmers fear going out of business next year with 75% citing supermarket pressure as their main pressure.\nThe Tiverton & Honiton MP recently helped secure a 'Buy British' section from Morrisons to promote local produce. He is now pushing Ministers to properly empower the Adjudicator so it can ensure farmers get the fair deal they deserve.\nSpeaking after the debate, Richard Foord MP said:\n“Here in our beautiful part of Devon, our farmers are the beating heart of our communities.\n“Not only do they grow the food for our tables, they can also play a huge role in tending the countryside and protecting our natural environment. They are key allies in our fight to reduce carbon emissions and tackle persistent flooding.\n“That’s why it’s so disappointing to see this Conservative Government continue to let down our farmers. They have completely bungled the transition away from the Basic Payment and signed new trade deals that allow lower-quality meat from abroad to undercut our home-grown produce.\n“At present farmers have little protection against the big supermarkets. The big six supermarkets seem more focused on paying rock-bottom prices to pad-out their profits, instead of ensuring farmers get a fair share. This has to change.\n“The so-called 'Groceries Code Adjudicator' needs to be properly empowered so it can ensure farmers get a fair price for their goods, but also that they are not left waiting months for payment.\n“With more than 1,500 people across Mid- and East Devon backing the petition, it’s vital that the\nGovernment takes action - and does so swiftly.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-budget-is-a-missed-opportunity-for-the-west-country/content_45.html": "Foord: Budget is a missed opportunity for the West Country\nResponding to the Spring Budget, Liberal Democrat MP Richard Foord said:\n“Today’s budget was a missed opportunity, as this Conservative Government limps desperately towards the finish line.\n“Their flagship announcement of cutting National Insurance does nothing for pensioners and those on fixed incomes, who have already been squeezed by high inflation and rising bills.\n“There was also almost nothing in it for the NHS and care services, many of which are hard-pressed. Local communities are seeing their services wilting around them, while the Chancellor looks the other way.\n“This was a missed opportunity to properly support our public services. We need people who are out of work due to ill health can get the care they need in order to return to work, pay taxes and be part of improved public services.\n“But what we need most of all is an election - so voters have the chance to relegate this out-of-touch government and vote for real change.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-calls-for-more-joined-up-rail-and-bus-services/content_42.html": "MP calls for more joined-up rail and bus services\nLiberal Democrat MP Richard Foord has raised the issues of repeated delays on Devon’s buses and urged the Government to help improve the coordination of rail and bus services, to ensure students have reliable travel options.\nSpeaking in Parliament on Thursday (21st March), Mr Foord – a regular bus user himself – highlighted the challenges facing pupils trying to get to and from college due to unreliable buses, with some failing to appear altogether.\nBecause of the rural nature of Devon, many bus services run long routes on infrequent timetables, with some operating one bus an hour or fewer. This means any delay or breakdown can have a huge impact.\nIt also means that a bus not turning up can lead to people missing vital railway connections, further compounding their travel woes. This is a big issue for students seeking to commute to college in Exeter, who rely on being able to catch one of the scarce early services.\nMr Foord, the Liberal Democrat MP for much of Mid- and East Devon, also highlighted that doing so will benefit parents as well as pupils. When buses don’t turn up, it is often parents who are called on to step-in and ferry their children to the nearest railway station, making them late to work themselves.\nThe Tiverton & Honiton MP is urging the Transport Secretary to do more to support rural bus services and ensure that people across Mid- and East Devon have regular and reliable routes that enable them to travel with confidence, especially at peak times.\nRichard Foord MP said:\n“Anyone who lives or works in a rural area knows the pain of waiting ages in the cold at a bus stop, only for no bus to ever round the corner. This can be incredibly frustrating, especially for people trying to get to work, school, or college in the early morning.\n“In areas like ours the buses are not reliable as they need to be. This can have a huge impact, particularly on those trying to make a connecting train.\n“The huge distances between places also means that if you are not able to use public transport it can take a long time to complete your journey by other means. This can trap many people, particularly older people and those without cars, in their local area.\n“This is particularly hard on parents, who can often have to turn up late to work due to having to run their children to the nearest railway station or to college when the bus doesn’t show up. This isn’t good enough and we need action to address it.\n“That is why I am urging the Government to step up to the plate and work constructively with MPs like myself and with Stagecoach South West, so we can support our rural bus services properly and ensure we have a functioning bus network that meets the needs of local people.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_new_campaigns/content_39.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_page-3/content_36.html": "Richard Foord MP demands more support for struggling local hospices\nThe MP for Honiton & Sidmouth has called on the government to provide more support for struggling local hospices, during what has become an ongoing traumatic financial period for the organisations.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_west-country-mps-secure-meeting-with-transport-secretary-over-stations-for-wellington-and-cullompton/content_25.html": "West Country MPs secure meeting with Transport Secretary over stations for Wellington and Cullompton\nSpeaking in the House of Commons last month, Mr Foord asked Heidi Alexander to reassure him that the Cullompton station project is “in no way disadvantaged, compared with those transport authorities in urban areas that have mayors?”\nLiberal Democrat colleague, Gideon Amos, MP for Taunton & Wellington was present at a meeting last week to promote the joint Wellington-Cullompton rail project, which would involve the development of both stations.\nSpeaking with Heidi Alexander on 6 February, Mr Amos emphasised the value of the joint Wellington-Cullompton railway station project. While Ms Alexander said she was not able to make any commitments until the Government’s Spending Review had concluded, she was positive in recognising the strength of the case for the project.\nRichard Foord said:\n“It was very disappointing to learn last summer that the Conservative Government had not identified funding for stations that they had indicated could be built. This disappointment has to be seen in the light of the hard work over many years of many councillors at Mid Devon, of the previous MP, Neil Parish, and members of the community, to press the case for Cullompton station. Lately, we have been working on these developments with GWR and Network Rail too, at a Board that Gideon and I co-chair every three months.”\nLast autumn, Richard worked with local councils to compile data on the business case. This was after he met with the Rail Minister and former Chair of Network Rail, Lord Peter Hendy. Lord Hendy asked for the most compelling information that Richard could gather that might bolster the case for the station.\nRichard continued:\n“The case for reopening the railway station in Cullompton would be strong, even if there were no plans for more housing. It is needed already to address the existing traffic problems at junction 28 of the motorway, as residents commute to and from Exeter for work. Yet to meet the demands of significant housing growth over the next few years, this railway station is essential.\n“I believe that there must be a railway station installed before the development of 5,000 houses at the so-called “Culm Garden Village”\nThe Government must get into the practice of providing appropriate infrastructure before permitting large-scale housing projects, or else we will end up with chaos, particularly on the roads. This applies in relation to other essential services too, such as in healthcare and education.\n“In addition to appropriate infrastructure, governments also have a duty to provide sustainable travel options. Our roads are extremely busy; even our country lanes seem to have more cars on them these days. The return of former railway stations with reliable services would help take cars off the road and get people to their destination faster, and with less stress.\n“We were pleased Ms Alexander’s officials confirmed that the project had strong credentials. I will continue to press decision-makers for the re-opening of Cullompton railway station.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-3/content_15.html": "Hundreds of farms across mid and east Devon could be hit by new “family farm tax\"\nLAST week in parliament, local MP, Richard Foord, spoke against a new “family farm tax” that the Government says could affect more than 250 farms across mid and east Devon.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-calls-for-urgent-plan-to-fix-south-west-dental-desert/content_85.html": "Richard Foord MP calls for urgent plan to fix South West “dental desert”\nThe discussion was initiated by Richard Foord, MP for the Honiton & Sidmouth constituency, who has described Devon as a \"dental desert”, amid scores of complaints from constituents, some of whom are forced to pull out their own teeth.\nMr Foord, who has been campaigning on the lack of dentistry services since his election in 2022, said that due to years of neglect by the Conservative government, the number of adults able to access an NHS dentist locally has plummeted since 2015.\nThe number of people seeing an NHS dentist in the South West and Devon has fallen sharply\nAccording to parliamentary data, in 2015, just over half (51 percent of adults) in the South West saw a dentist, slightly above the English average of 50 per percent. But by 2024, this figure has fallen to just over one third (34 percent), well below the current English average of 40.3 percent.\nThe situation is even bleaker in Devon. In 2015, 55 per cent of adults were able to see a dentist, but this number has now plunged to just over 37 percent.\nThe number of NHS dentists in Devon has reduced from 549 to 497 over the past decade.\nSome of my constituents are forced to pull out their own teeth\nMr Foord said, “The situation is dire. In Devon, it’s come down to a choice for some of my constituents: either pull out your own teeth or pay thousands for private care.\n“This unacceptable decline is the direct result of 14 years of Conservative neglect of our health services.”\nOne of Mr Foord’s constituents from Axminster, who prefers to remain anonymous, has shared his experience.\nThree years ago, after not being able to get an NHS dental appointment the constituent removed his tooth himself describing it as “gruesome but fine.”\nHe told Richard that he’s “not complaining at all” about having to pull out his own tooth.\nMr Foord added: “Each NHS dentist in Devon is now responsible for 2,480 people. While the numbers are grim, the effect it is having on my constituents’ lives troubles me the most.\n“In desperation, my constituents are contacting NHS England, Devon Healthwatch, and even the complaints department at NHS Devon, who admitted the dire state of the system but could offer no real solutions.\n“Local people spend hours on the ‘Find an NHS dentist’ website, only to find practices listed that in reality, had no availability for new patients. When there was an available clinic it is often around 100 miles away. It’s not an option for many people to travel that far, especially for several treatments.”\nMr Foord added: “Dentists appear to be either busy, crowded or not accepting patients, leaving my constituent in the dark, he reached out to me having nowhere else to go.\nDental health is not a luxury, it is a basic right\n“Dental health is not a luxury; it is a basic right. Yet, despite this, the Conservatives allowed NHS dentistry to collapse.”\nRichard Foord today calls on the health secretary to urgently implement a raft of measures\nToday, Richard Foord is calling on the health secretary to urgently implement a raft of measures, including:\n- An increase to the number of dentist training places in the UK\n- Recognition of EU trained dentists’ qualifications\n- Rural areas in the South West receiving the same provision of NHS dentistry as those in urban areas\n- Urgent implementation of the government’s manifesto commitment of 700,000 more dental appointments",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_south-west-water-has-officially-gone-rogue-foord/content_113.html": "‘South West Water has officially gone rogue’ – Foord\nResponding to the news that the CEO of South West Water, Susan Davy, has been awarded a £300,000 pay rise – despite the recent poor performance of the company and the Brixham contaminated water scandal – Liberal Democrat candidate for Honiton & Sidmouth Richard Foord said:\n“This new bumper pay rise is a slap in the face for billpayers across the South West.\n“Our communities are facing higher bills, contaminated water, and raw sewage poisoning our rivers and beaches – all while the top bosses at South West Water are lining their own pockets at our own expense.\n“South West Water has officially gone rogue. These wayward firms are totally not fit for purpose and we need urgent action to crack down on their profiteering.\n“For too long this Conservative Government has given water companies a free pass by gutting the regulators meant to hold them in check and allowing them to commit environmental vandalism on an industrial scale.\n“If you want real action to fix our water industry and crack down on the sewage scandal – then vote Liberal Democrat on 4th July.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-cancer-patients-need-nhs-dental-fast-track/content_83.html": "Foord: Cancer patients need NHS dental fast-track\nLiberal Democrat MP Richard Foord has called on the Government to ensure that cancer patients have the ability to access NHS dental care in their local area.\nSpeaking in a debate in Parliament last week, Richard Foord, the MP for Tiverton & Honiton, highlighted the huge challenges facing rural dentists – with the Government recently introducing one-off payments to entice dentists to move to more isolated areas like Devon.\nDuring the debate, Mr Foord highlighted the case of Robin Whatling from Tiverton. Mr Whatling is battling advanced cancer yet saw his NHS dental appointment cancelled just days before it was due because the practice had opted to no longer treat NHS patients.\nAfter weeks of being unable to get an appointment, the pain became too much and Robin ended up performing ‘DIY Dentistry’ on himself – removing one of his teeth himself at home. He has still been unable to get an appointment.\nThe British Dental Association has warned that DIY Dentistry is on the rise, warning that 8-in-10 dentists are seeing incidents of this painful and potentially dangerous practice and calling on the Government to take real action to fix the crumbling state of NHS dental services.\nMr Foord has echoed these calls and urged Ministers to set out a scheme to help fast-track cancer patients for NHS dental work and reverse the £1billion real terms cut to the NHS dental budget that has taken place under this Conservative Government.\nRichard Foord MP said:\n“NHS dental services have been decaying before our very eyes. They are now all but a distant memory for our rural communities, yet Ministers seem to be living in a fantasy-land and believe everything is more or less fine.\n“Cancer patients like Robin are some of the most stoical people in our society. He’s battling a life-threatening condition but, despite working hard and paying into the system for years, he cannot even get an emergency dental appointment when he needs one.\n“This is shameful and a shocking indictment of this Conservative government’s record. They continue to do next to nothing while rural areas like ours quickly become dental deserts – with people having to travel huge distances of pay huge sums for private dental work.\n“More patch-up jobs and temporary fillings are not going to cut it. The Government needs to reform the NHS dental contract to boost the number of appointments and set up a fast-track access scheme, so those living with advanced cancer can access NHS dentals services.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-unites-sewage-campaigners-in-parliament/content_111.html": "Foord unites sewage campaigners in Parliament\nLiberal Democrat MP Richard Foord has hosted a reception in Parliament, bringing together key sewage campaigning organisations to push the Government to do more to tackle sewage pollution.\nThe event, hosted in conjunction with the End Sewage Pollution coalition - including Surfers Against Sewage - was attended by MPs from a range of political parties.\nMr Foord also hosted prominent Exmouth campaigner Jo Bateman, who is suing South West Water and whose campaign has gained national prominence.\nSpeaking at the event, Mr Foord stressed that the power to address illegal sewage spills lies squarely with the Government. He said it was their responsibility to ensure the regulators had the resources needed to enforce the law and hold polluting firms to account.\nWater Minister Robbie Moore was invited to speak at the reception but pulled out at the last minute. This meant there was no formal representative of the Government at the event.\nTiverton & Honiton MP Richard Foord said:\n“The ongoing sewage scandal is an issue that affects everyone in our area.\n“People across the West Country are rightly angry that their bills are increasing, and dividends for shareholders are increasing, while South West Water continues to pollute our coastline.\n“We’ve had enough warm words from the Government. We need to see real action to beef-up our regulators and give them the tools needed to enforce the law.\n“It’s disappointing that there was no Minister present at the event to see the strength of feeling from campaigners. It does feel like the Government wishes simply to pass the buck.\n“I will continue to hold South West Water to account and fight for independent collection of data around sewage discharges. I will also demand action from the government, who must not wash its hands of its responsibility.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-intervenes-over-gp-blood-test-changes/content_6.html": "Richard Foord MP intervenes over GP blood test changes\nRichard Foord, MP for Honiton & Sidmouth has written to a local NHS boss, following a decision by some Devon GP surgeries to cease providing blood tests for ill patients who are managed by hospital consultants.\nPeople in the area of Devon that Mr Foord represents have written to him about the change. For some, it will mean they will be required to travel long distances to the Royal Devon & Exeter Hospital.\nMr Foord explains: “I understand that it is a funding problem; that one quarter of GP surgeries in Devon are no longer able to afford providing this service without putting other services at risk, because their costs are no longer fully covered.\n“I am worried about the impact on unwell constituents of them having to travel, even if they have the means of getting themselves to the hospital. Many won’t of course. In particular, I am concerned about the effect of frequent visits to a large hospital on immuno-compromised patients, or those who are very weak.\n“We have five community hospitals in the Honiton and & Sidmouth constituency which are run by the Royal Devon & Exeter Hospital, so I have written to Chief Executive, Sam Higginson, asking him what the Trust’s plans are for running local blood test clinics, to avoid unnecessary travel for very unwell people.\n“It’s essential that we make the most of our valued local community hospitals.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_donate/content_4.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowDonate to the Honiton, Sidmouth and Tiverton Liberal Democrats\nHelp Richard Foord and the local Lib Dem team win for Devon.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-autumn-statement-misses-the-mark/content_77.html": "Foord - Autumn Statement ‘misses the mark’\nResponding to the Government’s new Autumn Statement, Liberal Democrat MP for Tiverton & Honiton Richard Foord said:\n“Today’s Autumn Statement is tone-deaf and completely misses the mark.\n“As the winter cold begins to set in, the Chancellor has failed to offer help for those struggling to put the heating on. Crucially, he has also given no extra support for our already overstretched health services - inviting another miserable winter.\n“After years of economic turmoil and tax hikes, the Conservatives are now trying to cynically brand themselves as the party of tax cuts. But they cannot escape their record.\n“They've repeatedly hiked taxes by freezing tax thresholds, despite rampant inflation. This means that millions of people have been pushed into paying additional tax.\n“It used to be said that Conservative Governments wanted to have their cake and eat it. Yet this Conservative Government has taken our cake and wants us to be grateful for the crumbs they have left on the plate.\n“It’s clear the Government is out-of-touch and out of ideas. We need to get them out of power so we can deliver the fair deal for everyone living in the West Country.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_page-4/content_17.html": "Hundreds of farms across mid and east Devon could be hit by new “family farm tax\"\nLAST week in parliament, local MP, Richard Foord, spoke against a new “family farm tax” that the Government says could affect more than 250 farms across mid and east Devon.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-budget-has-more-holes-than-the-a373/content_60.html": "Foord: ‘Budget has more holes than the A373’\nSpeaking in Parliament, Liberal Democrat MP Richard Foord hit out at the Conservative Government’s Budget as nothing more than a patch-up job, which fails to fix Devon’s crumbling roads, support health & social care services, or offer relief to those pensioners who are only just scraping by.\nIn the final day of debate on the Budget, Mr Foord urged MPs to avoid getting wrapped up in the ‘Westminster Bubble’ and think instead about how the budget would impact people living in communities across the country.\nHe talked about Devon’s notorious potholes, which continue to plague roads across rural Devon, and which for many people symbolise our decaying infrastructure under this Conservative Government.\nLast year, Devon County Council admitted they could no longer continue to maintain all local roads. Instead, they would focus on maintaining ‘priority’ roads, whilst others would undergo a ‘managed decline’.\nThis is due to years of budget squeezes by Westminster, which have seen cutbacks to core services – including road maintenance. Just 18.6 miles of road were resurfaced in Devon last year, compared to 273.6 miles five years previously.\nThe Conservative leader of the Council, Cllr John Hart, has spoken about additional funding for pothole repair being a “drop in the ocean” - and how sums from the Westminster Government last year were almost totally wiped out by inflation.\nTiverton & Honiton MP Richard Foord said:\n“Rather than taking action to fill the holes in our crumbling roads, the latest Conservative Budget is merely another patch-up job and is not designed to last.\n“For the first time in over one hundred years, it’s almost more reliable to traverse parts of Devon’s countryside on horseback rather than behind the wheel of your car. This is a dire state of affairs, resulting from Conservative mismanagement of our public finances.\n“Just five years ago, over 270 miles of road were repaired every year. Last year, it was just 18 miles, because the Council simply does not have the means to provide essential infrastructure on which communities and local businesses depend.\n“Our towns and villages deserve better than managed decline. They deserve roads that are safe and well maintained – so they can travel without fear of wrecking their car – or worse. Sadly, this Government is failing on every measure.\n“The Conservatives are puffed out and limping to the finish line. Here in the West Country, it’s time to demand better than this failing Government and elect a strong team of Liberal Democrat MPs to demand better of the next Government for our communities.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-warns-of-banking-isolation-as-lloyds-announce-end-of-mobile-banking-service/content_108.html": "MP warns of ‘banking isolation’ as Lloyds announce end of mobile banking service\nLiberal Democrat MP Richard Foord has expressed concern about older residents being left unable to access their own money as Lloyd Bank announces the end of their mobile banking service from May next year.\nThe Mobile Branch currently operates every fortnight and runs between Budleigh Salterton, Ottery St Mary, Cullompton, and Lyme Regis. The branch stops for roughly two hours in each location, offering people a chance to access these important banking services.\nIn the twelve months to July, 1,296 personal transactions were conducted using this service, with a further 498 business transactions. Half of those who use the service are over 75, leading to concerns that withdrawing this service could leave them cut-off.\nWith this service set to disappear in under six months’ time, customers would face long journeys to access a bank branch. Those living in Budleigh Salterton are worst affected, with their nearest branch being over 15 miles away in Seaton.\nIn response, Richard Foord MP - who is standing for Honiton and Sidmouth at the next election - has called for greater public consultation on changes to mobile banking services and for more work to be done to fast track the establishment of Community Banking Hubs, like the one he recently opened in Axminster.\nCommenting, Richard Foord MP said:\n“The decision by Lloyds to scrap their Mobile Branch service from May next year is deeply concerning. People here in our corner of Devon already face huge challenges to access in-person banking, and this will just make things worse.\n“I am particularly concerned about the impact this will have on older people, who make up roughly half of those who currently use this service. We risk seeing them being left in banking isolation, with their closest branch being miles away and hard to get to.\n“So many people benefit from being able to access in-person banking services. It offers people greater independence and security, allowing them to be able to manage their money and discuss things with trained professionals, who help to answer customers’ questions.\n“In recent years, too many banks have been shutting their branches and withdrawing from our communities here in rural Devon. We need to ensure that any change to these vital services is subject to a full public consultation, including looking at ways to keep them here on the ground.\n“But it’s clear that this alone is not enough to stop the decline. What we need now is a renewed focus on Community Banking Hubs, to enable local people to access a full range of banking services – regardless of who they bank with – under one roof.\n“We’ve seen the success these projects can have, and it was great to open the new Hub in Axminster last week. We need to see similar progress on the proposed Hub for Sidmouth, and other places in East Devon that no longer have a local bank branch.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_devon-mp-slams-govt-for-abandoning-south-west-in-levelling-up-funding-row/content_78.html": "Foord slams Govt for ‘abandoning’ South West in Levelling-up funding row\nLiberal Democrat MP Richard Foord has criticised the Conservatives for continuing to take the South West for granted as the third round of Levelling-up funding saw just three projects having their bid approved, with no additional cash for Cornwall.\nThe new round of funding saw £1bn handed out to enable 55 projects across England, Scotland and Wales. Unlike the two previous allocations, there was no opportunity to submit new bids – with successful projects being drawn from previously unsuccessful bids.\nOne project was selected for funding from each of the local authority areas in Somerset, Torbay and Plymouth. Yet vast swathes of the South West were overlooked. The whole of Cornwall and large chunks of Devon were overlooked, with Mid-Devon’s bid for funding to build the much-needed Cullompton Relief Road once again spurned.\nSpeaking in the House of Commons, Levelling-up Minister Jacob Young listed five regions of England in the north and midlands that had benefited from the funding, but failed to mention the South West at all. Tiverton & Honiton MP Richard Foord hit out at the Government’s failure to level-up the South West.\nMr Foord also highlighted that the Conservatives should not claim to be focused on Levelling-up when Conservative-led Devon County Council “cannot even level-up the potholes”. Foord is calling for more funding to be invested in the South West, to deliver on vital projects.\nCommenting on the announcement, Richard Foord MP said:\n“The Conservative Government’s claim to be Levelling-up the South West is a sham. This new announcement today did not see a single project in Cornwall or in my corner of Devon given any new funding.\n“Our rural communities in the West Country have been given the cold shoulder and means all the work put in to producing these bids by local authorities has amounted to nothing. It’s a farce.\n“This funding is vital to unlocking the potential of our towns and villages. One bid that was rejected yet again is for cash to build the much-needed Cullompton relief road, in my patch.\n“This would ease congestion, reduce air pollution, and breathe new life into the town centre. Everyone who gets gridlocked in the middle of the town has Conservative Ministers to thank.\n“We need investment, not warm words. Ministers need to get their act together and deliver the fair deal that our communities need, with proper levels of investment.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_eastern-devon-mp-welcomes-nhs-review-into-devon-minor-injuries-units/content_29.html": "Eastern Devon MP welcomes NHS review into Devon minor injuries units\nRichard Foord, who is a strong advocate for community hospitals, has been concerned about the opening hours at Honiton Hospital’s minor injuries unit (MIU), following frequent closures, due to staffing issues in recent months.\nHoniton Hospital is one of only two remaining community facilities that have minor injuries units in Eastern Devon, following service closures at Axminster, Seaton, Ottery St Mary and Sidmouth Hospitals, around a decade ago.\nThe issue was discussed at a broad-ranging meeting with NHS Devon Chief Executive, Steve Moore and Acting Chief Financial Officer Kirsty Denwood, last Monday (27 January). The meeting was arranged following Richard’s concern for patient care, as the cash-strapped organisation is under the cosh to make swingeing budget cuts – £213.3m this year alone – in a bid to balance the books.\nNHS Devon is one of three integrated care boards nationally subject to special “oversight” measures and has been monitored by the Recovery Support Programme at NHS England.\nRichard said:\n“It was a constructive meeting. We talked about the pressures, and the complex funding formula which seems to me to disadvantage rural and coastal areas like ours. We also talked about the problems that dog NHS dentistry, which are national, but are particularly serious here in the south west of England.\n\"Steve reassured me that Honiton Hospital’s Minor Injuries Unit is now on a more secure footing in terms of opening hours, with fewer instances of short-notice closures.”\nWorsening health in all age groups and an ageing population has contributed to the pressure in Devon’s health services, as have significant staff vacancies, although recruitment and retention is now improving.\nRichard added:\n“We all rely on the NHS being effective at preventing serious illness, as well as stepping-in as a life-saving service. I remain concerned about cuts that must be made next year and the ability of the NHS to work effectively at preventing ill-health.\n“I will be glad of the wider review of minor injuries services across the county if it results in Honiton Hospital MIU being put on a secure footing for the long-term. I like to think that it might result in local people avoiding having to travel into Exeter unnecessarily, which puts additional pressure on the Emergency Department at the RD&E.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-opens-revolutionary-banking-hub-in-axminster/content_74.html": "Foord opens ‘revolutionary’ banking hub in Axminster\nLocal MP Richard Foord joined with community leaders to open a new Community Banking Hub in Axminster, a year after the town lost their only remaining bank branch.\nThis new Banking Hub is a shared banking space, offering face-to-face service for customers of all major banks and building societies to allow them to access a full range of banking services.\nThe Community Bankers will work on rotation, with a different bank available on each day of the week to provide regular service. It will be open Monday to Friday between 9am-5pm, enabling regular access for local people.\nThe Hub was established by Cash Access UK, an organisation set up to protect nationwide access to cash. It is based in the former Lloyds branch and will be operated by the Post Office.\nIt is the second Banking Hub to open in Devon, part of 18 across England and Wales. There are 76 additional banking hubs have been recommended, primarily in rural areas, including a proposed hub in Sidmouth.\nMr Foord, who represents Axminster in Parliament, joined with local community leaders and the Mayor of Axminster to cut the ribbon and formally open the site on Friday.\nRichard Foord MP said:\n“This new banking hub will make a huge difference. It will enable local people to access a full range of banking services in their own community and will help resuscitate the high street.\n“Rural areas have lost so many bank branches in recent years. Many towns have seen every branch close; that is what happened in Axminster.\n“This new hub shows that when we apply pressure to Government and to big business, we can protect vital services like face-to-face banking, which are essential to small businesses and older residents in particular.\n“I will continue to advocate for more action by the Government to speed up the delivery of banking hubs across our corner of Devon, so as to protect people's access to cash close to where they live.\n“In particular, I will be pressing for similar progress with a proposed banking hub in Sidmouth – which has been roundly endorsed by the local Chamber of Commerce there.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-cutbacks-point-to-straitened-times-ahead/content_38.html": "Chancellor's cutbacks point to straitened times ahead\nResponding to the Chancellor of the Exchequer’s announcement of government cutbacks – including changing the eligibility for the Winter Fuel Payment – to mitigate a £22billion financial blackhole, Liberal Democrat MP for Honiton & Sidmouth Richard Foord said:\n“The changes announced today by the Chancellor make for pretty grim reading and rightly have left many people concerned about the future.\n“Restricting the Winter Fuel Payment will have a big impact on pensioners across Devon, especially given we know that many people already miss out on Pension Credit.\n“However, I am heartened to hear a clear commitment that projects which have already had funding committed, such as the re-opening of Cullompton railway station, will still go ahead.\n“The re-opening is vital to improving local connectivity and helping ease congestion in, and around, the town – especially as it looks to expand in the coming years.\n“The economic mismanagement of the Conservatives continues to have a lasting impact and we face straitened times, with the threat of more cutbacks in October’s budget.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-celebrates-win-as-govt-agrees-to-end-water-company-self-monitoring/content_115.html": "Foord celebrates win as Govt agrees to end water company self-monitoring\nResponding to the news that the Government is ending the practice of allowing water companies to collect and report on their own data on sewage discharges, Liberal Democrat MP Richard Foord said:\n\"I am delighted that Minister have agreed to adopt my proposal, which ends the farce of water companies marking their own homework on sewage spills.\n“Now we need to see the Government go further and beef-up our regulators with the power to properly crack down on this negligence.\n“These negligent firms have been allowed by the government to get away with this for so long and it must be addressed.\n“I will not stop fighting to ensure that Conservatives hear the anger from people across the West Country.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_lets-give-our-verdict-on-this-conservative-government/content_89.html": "Let's give our verdict on this Conservative government\nHappy 2024. The beginning of a new year is a time when many of us round off our Christmas reflections about the year before with resolutions about the year ahead. New year’s resolutions are often about personal development; some people resolve to be healthier or fitter; to visit the gym more, for example. Yet new year’s resolutions also offer an opportunity to think about our duty to others.\nWe might resolve in 2024 to spend more time with the people we love. We might resolve to really listen to our loved ones – carefully, and attentively. Some of us will also want to think about duty to the wider community. I spent some time over the Christmas break knocking on the doors of people in Honiton to find out what they are thinking. We Liberal Democrats do this all year round, rather than just at election time.\n2024 is very likely to be one in which we have a General Election. I am looking forward to the opportunity to be undistracted by Westminster and have an election campaign in which I can spend time focusing on doorstep conversations. Over the Christmas break, I was hearing from people who are waiting for operations or hospital appointments. There are now over 100,000 vacancies in the NHS and over 7.7m people on NHS waiting lists. This is affecting people’s ability to work, to earn, to contribute to society and to pay taxes; we need to break this vicious cycle.\nA General Election also means that at long last, people have an opportunity to return a verdict on this strained Conservative Government. Rishi Sunak has had conversations just recently with the notorious advisor Dominic Cummings, with a view to bringing Cummings back on board in 2024. This, you will recall, is the same advisor who drove from London to Barnard Castle in County Durham, so that he could “test his eyesight”. Sunak should be getting more than just his eyes tested; this calls into question the Prime Minister’s own judgement.\nI gather on doorsteps that many people share my view that we are fed up of Government ministers and advisors setting rules that they are unwilling to abide by themselves. At last, people will have an opportunity to return a verdict on this Conservative Government. Then we can spend the rest of the new year getting back to our hopes and aspirations for our personal development, for our families and for our communities.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-votes-for-compensation-for-waspi-women-in-eastern-devon/content_37.html": "Richard Foord MP votes for compensation for WASPI women in Eastern Devon\nThe move follows an independent report that found they had suffered an injustice due to a failure to properly inform them of pension age changes.\nRichard said he felt it was important to support a bill that would have righted a “deep injustice”.\nHe said he was disappointed that the majority of MPs had failed to back it and promised to continue to insist that the 7,150 WASPI women in the local area get the compensation and justice they are owed.\nRichard, who is a member of the Liberal Democrats, explained:\n“I have already heard from many women in our area who have suffered due to this scandal.\n“For Conservative and Labour MPs to fail to back these women is a big disappointment. The Liberal Democrats will continue to stand up for the WASPI women at every turn and keep fighting until they get the justice that they deserve.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-7/content_30.html": "MP meets with mental health service after shock funding cut\nRichard Foord MP met with volunteers and users of the Devon Recovery Learning Community in Honiton and promised to demand protection for the service, after it was confirmed their funding from NHS Devon would no longer be continued.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mid-devon-celebrates-the-scrapping-of-the-government-plan-to-close-rail-ticket-offices/content_86.html": "Mid Devon celebrates the scrapping of the Government plan to close rail ticket offices\nMid Devon Liberal Democrats are delighted they have played a part in the Government's U-Turn following the news that our local railway ticket offices will remain open. The proposed closure would have affected Tiverton Parkway and Exeter St David’s.\nScrapping the plan to close rail ticket offices is great news”, says Mid Devon District Council Leader, Councillor Luke Taylor. “Our August Cabinet decision to lobby the Government and write to rail chiefs has worked. This, along with the online petition led by Tiverton & Honiton MP, Richard Foord, has resulted in our local voices being heard.”\nPassengers can be confident they can get the right help at the right time”, commented Councillor Steven Keable, Mid Devon Cabinet Member for Planning and Economic Regeneration and Metro Board member for the planned Cullompton Station. “With the promised investment into railways, access is important for all especially those with disabilities, our older people, and those who don’t have smart phones to book tickets and plan travel.\"\nMP for Tiverton & Honiton Richard Foord was a prominent advocate against the closure of railway station ticket offices and led calls in Parliament to stop the plans. In response to this critical issue, constituents have been in touch with Richard Foord MP to describe how they would be impacted by the proposal to close the ticket offices.\nCommenting, Richard Foord MP said: “The scrapping of plans to close our local ticket offices is welcome news. We know how helpful they are to elderly and vulnerable passengers, and the huge benefit that ticket office staff offer rail users.\n\"The question is - why did it take the Government so long to act? The damage that these changes would have caused was visible from space. The public backlash showed a strength of feeling that makes it plain this decision should have been made ages ago.\n\"Ministers at the Department for Transport chose to sit on their haunches for months until we campaigners forced them go into reverse. This is a big win for our corner of Devon and everyone who uses our railways.\"\n“The online petition to support our MP has resulted in the fastest turnaround ever”, said Liberal Democrat Tiverton & Honiton Constituency Chair, David Wulff.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-south-west-water-must-have-formal-role-in-planning-process/content_40.html": "Richard Foord MP: South West Water must have formal role in planning process\nRichard Foord, MP for Honiton & Sidmouth, has argued that the region’s water company should be a formal consultee on all major planning applications.\nSuch a role would serve to reduce the pressure on local sewage infrastructure, as well as mitigating flood risk and pollution.\nMr Foord made the case during a debate on Wednesday (12 March) at Westminster Hall, about the role of water companies in the planning process.\nCurrently, it is good practice for local authorities to seek the views of water companies on large-scale planning applications, but it is not a statutory requirement.\nThis month, a meeting will take place between Mr Foord’s office, Feniton Parish Council, and representatives from South West Water. It follows many years of flooding and sewage problems in the village, which residents fear could get worse, as further development is set to take place.\nSpeaking after the debate, Mr Foord explained:\n“The village’s £6m flood alleviation scheme will be completed later this year. However, residents are concerned it will not resolve the flooding from proposed new development, nor will it resolve the foul smells, or the sewage issues that affect some properties.\n“If water companies were legally required to give a view on large-scale applications, it would force developers to consider sewage infrastructure capacity early in the planning process. It would mean that potential pollution issues would have to be addressed upstream.\n“Any settlement near a watercourse or the coast would benefit from this law change. It would reduce the damage caused by pollution and storm overflows.\n“Growth is vitally important for this country, yet with the significant increase in housing targets, it’s also essential that communities are not sacrificed on the altar of untrammelled development, regardless of the capacity of infrastructure. I hope ministers will take action on this.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-condemns-jupp-for-voting-to-weaken-water-regulator/content_121.html": "Foord condemns Jupp for voting to weaken water regulator\n- New law results in the weakening of Ofwat enforcement powers against water companies\n- Richard Foord MP opposes move, as Simon Jupp ignores environmental groups and backs controversial changes to Ofwat’s powers\n- Liberal Democrats say vote will leave water industry regulator watching companies “with a blind eye”\nConservative MPs, including East Devon MP Simon Jupp, voted in favour of limiting the water services regulator’s powers - and hampering their ability to take enforcement action against polluting water companies.\nYesterday, MPs voted on the Government's new proposals to ensure any regulator imposing a fine or action on a company, must take account of the impact on economic growth.\nThis new vote in Parliament for a so-called “Growth Duty” could allow water companies to escape fines for sewage dumping.\nEnvironmental groups including the Wildlife and Countryside Link and Surfers Against Sewage warned the changes will diminish the regulator, with the Wildlife and Countryside Link CEO warning they could lead to weaker enforcement and promote deregulation of the UK’s environmental laws.\nConservative MPs voted to downgrade Ofwat’s enforcement powers, despite Liberal Democrat opposition in the House of Commons.\nRichard Foord, the Liberal Democrat MP for Tiverton & Honiton, has called Mr Jupp’s vote ‘shameless’ and said this is another example of the ‘simple choice’ for voters at the General Election.\nRichard Foord MP said:\n“It was awful to see Conservative MPs shamelessly vote to help water firms prioritise economic over environmental concerns. Ofwat will now be scrutinising South West Water with a “blind eye”.\n“People across Devon are rightly angry at the levels of raw sewage being dumped into our waterways. They tell me that they want MPs to walk the walk, and back tough action on these polluting firms using their votes in Parliament.\n“Yet again, East Devon’s Conservative MP chose to ignore this and put his party first. This Conservative government continues to let water firms rake in massive profits and reward themselves with huge bonuses and shareholder payouts.\n“East Devon deserves better than a Conservative MP who actively votes to ditch important regulations on water firms. This shows the simple choice people in our area face at the next election – an MP willing to care for our environment, or one who in his actions shows he does not.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-calls-for-expanded-fuel-duty-relief-to-cut-rural-petrol-prices/content_56.html": "Foord calls for expanded Fuel Duty Relief to cut rural petrol prices\nThe Liberal Democrats have announced plans to support motorists in rural areas by doubling the scope of the Rural Fuel Duty Relief scheme to include another 21 rural areas. This would also involve expanding the existing discount that exists in small parts of Devon, saving drivers 5p a litre at the pump.\nRural Fuel Duty Relief helps to bring costs down for drivers in rural areas, who previous research has found spend an average of £800 more on fuel costs a year than those in urban ones.\nThe scheme is currently applied to just 21 areas across the UK – including Lynton in North Devon and the Isles of Scilly. Fuel retailers in these areas can apply for relief of 5p per litre of petrol or diesel, which is passed on to consumers through lower prices at the pump.\nLiberal Democrats are proposing to double the number of areas covered by the scheme, meaning an additional 21 areas across the UK will benefit from the Relief, by doubling the funding to £14 million.\nThe party has proposed a consultation to determine the areas which could receive the new Relief within England, focusing in on those areas where the number of forecourts is limited and those most rural areas.\nThe Liberal Democrats have also committed to introducing a Pumpwatch scheme, to allow drivers to directly compare fuel prices and protect them from rip-off prices. The government has previously said it would introduce such a scheme, but never did.\nRichard Foord, Liberal Democrat candidate for Honiton & Sidmouth, said:\n“People across rural and coastal Devon have been hit hard by the cost-of-living crisis, especially when it comes to fuel prices. The average price in areas like ours is artificially high, despite the fact we are more reliant on our cars than other parts of the country.\n“The Conservatives have let the cost-of-living crisis hit communities like Devon the hardest. They have ignored Liberal Democrat calls to expand rural fuel duty relief, left our roads to crumble, and cut funding for public transport - including rural bus routes.\n“When I was first elected back in 2022, the first thing I did on day one was table a motion in Parliament demanding the Government take action to cut prices at the pump. Shamefully, they refused to act and we’re now paying the price for their negligence.\n“I am determined standing up for rural Devon after years of Conservative chaos and neglect. Every vote for the Liberal Democrats at this election is a vote for a strong local champion who will fight for the fair deal our towns and villages deserve.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_rishis-retreat-from-normandy-shames-the-conservatives/content_69.html": "Rishi’s retreat from Normandy shames the Conservatives\nThis week Rishi Sunak had a once-in-a-generation opportunity to pay his respects to our D-Day heroes, British veterans and our allies from the Commonwealth and the rest of the world.\nFor reasons only he can explain, rather than clear his diary to stand shoulder to shoulder with other world leaders for this momentous occasion, Sunak sloped off early.\nSunak’s abrupt farwell from the event sent a clear message to our military veterans: ‘I’ve got more important things to be getting on with.’ His decision to walk away from this historic event shames the office of Prime Minister and the Conservative party.\nThis was a dereliction of duty of the highest order.\nIn the context of the Conservative Government’s treatment of the Armed Forces, perhaps we shouldn’t be surprised by the Prime Minister’s casual disregard for our D-Day heroes.\nAfter all, let’s not forget that the Conservative Government has prioritised soundbites and flash announcements over keeping our country safe. The result is an Army which is being cut by almost 10,000. Our Army is now smaller than it’s been for 200 years.\nOn top of that, the Conservatives have been negligent in their support for military personnel. The families of service personnel are too frequently an afterthought, for example, spouses receive important information about their lives - where they are moving to for example - secondhand, through their serving partner.\nAnd we will all be familiar with how some veterans have fallen through gaps in support and found it impossible to get the support they need - especially for those who suffer from mental ill health.\nOur Armed Forces personnel, veterans, and their families deserve better. They deserve a fair deal, and the Liberal Democrats will bring that fair deal for our military service personnel.\nWe will reverse the cuts to our Armed Forces, recruiting an extra 10,000 soldiers to the Army. We will strengthen the Armed Forces Covenant, imposing a duty to ensure that ministers take it into account when they make decisions.\nAnd we will improve the standard of Ministry of Defence housing - starting with reviewing the maintenance contracts which are worth huge sums of money. It is appalling that so many serving personnel and their families live in disgraceful conditions.\nThese people put their lives on the line for our country - they should be treated with the respect and dignity they deserve.\nFrom Boris Johnson’s Partygate to the destructive budget of Liz Truss, to Rishi Sunak’s decision to retreat from his duty as PM yesterday, the Conservatives have proven time and again that they are not fit for office.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-4/content_48.html": "Foord writes to Health Secretary on first day to demand action to save Seaton Hospital\nNewly re-elected MP Richard Foord has written to the new Health Secretary Wes Streeting on his first day in the job to raise concerns about the future of Seaton Hospital and inviting them to visit the Hospital.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-to-urge-education-secretary-to-act-over-flood-hit-tipton-st-john-primary-school/content_44.html": "BUDGET: Richard Foord MP to urge Education Secretary to act over flood-hit Tipton St John Primary School\nRichard Foord, Member of Parliament for the Honiton & Sidmouth constituency, will urge the Education Secretary to take action on Tipton St John Primary School, following the Chancellor’s pledge to plough £6.7bn into school rebuilding, nationally.\nThe school has a long history of flooding and its teachers, governors and parents, as well as local representatives have campaigned tirelessly for it to be rebuilt outside the floodzone.\nRichard said:\n“I will be reminding the Education Secretary about the plight of Tipton St John Primary School, following the encouraging news about the £6.7bn investment for school rebuilding. Tipton St John School has been beset by flooding problems for years, with the Environment Agency declaring a risk to life a decade ago.\n“The Conservative government made various promises but delivered little, however the determination of the community, including Devon County Councillor, Jess Bailey, has kept the issue alive.\n“I very much hope that there will be soon be positive news for the residents of Tipton St John, with the funding made available to rebuild the school outside the flood zone, and within the village.\nLocal health services\nMr Foord continued:\n“Concern about local health services makes up around one quarter of my postbag and I have been calling for significant investment in the NHS across my constituency since I was first elected to parliament in 2022.\n“I am very disappointed that there was no specific mention in the budget for NHS dentistry or social care. Nor was there much mention of the challenges around patients getting an appointment with a GP. Despite the magnificent work of local NHS staff, these services have been under huge pressure for many years, with local people experiencing unnecessarily poor health as a result.\nSocial care\n“Well funded social care underpins the effective working of a modern day health service. If there aren’t enough paid carers available to look after people in their own homes, or care home places on offer, people are unable to leave hospital. That can prevent other people from being admitted. Unfortunately, we’re familiar with the horrendous queues of ambulances outside A&E departments.\n“Hopefully, the Government has a plan on these areas that they will share with us soon.”\nFamily farm tax (Agricultural Property Relief changes)\n“I am very worried about the impact of the changes in the Budget on rural areas like ours, including the family farm tax which risks becoming a disaster for local farmers and small businesses.\n“I spoke yesterday in Parliament about this very issue. It’s essential that we support those people who are responsible for growing our food and helping protect our beautiful landscapes. This is especially vital in Devon, which has many small family farms struggling to make ends meet.\n“My Liberal Democrat colleagues and I will demanding that the Government looks again at these proposed changes.\n“At the last election, Liberal Democrats backed British farmers by demanding an extra £1bn to support the agricultural transition, and we’ll keep being a strong voice for our rural communities.”\nEmployer’s National Insurance – tax the big banks and social media giants instead!\n“I am also very concerned about the impact of the Government’s increase to employers’ National Insurance, which could have a crippling effect on small- and medium sized businesses. The Government should instead be raising the money we need by reversing tax cuts for the big banks and asking the social media giants to pay a bit more.”\nWinter Fuel payment cut could hit over 8,000 people who are over 80, locally\n“Finally, I am deeply disappointed to see the government push ahead with cuts to the winter fuel allowance which could plunge a vast number of people into crisis. Over 8,000 people aged over 80, across the Honiton & Sidmouth constituency will be subject to these cuts. It’s appalling!\n“Hundreds of people have written to me, extremely worried about how they’re going to keep warm or buy enough food this winter.\n“I will continue to vociferously oppose these cuts that will harm people, many of whom are already struggling.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_conservatives-raid-tiverton-honiton-pensioners-of-pound15m/content_24.html": "Conservatives raid Tiverton & Honiton pensioners of £15m\n- Conservative Government looks set to have taken over £15.5m from pensioners in the Tiverton & Honiton constituency since 2022.\n- Failing to properly implement the triple lock in 2024 could result in a hit of over £1.7m for the constituency’s pensioners next year.\n- This comes after pensioners suffered a major cut in 2022, when the Government opted not to uprate the state pension in line with earnings.\nThe Conservative Government is reportedly set to break the triple lock once again by not uprating the state pension fully in line with earnings. Rather, the Government is reportedly planning to exclude bonuses. This means pensioners will receive a 7.8% rise in the state pension, not the 8.5% the triple lock should guarantee them.\nLiberal Democrat analysis has estimated that this would amount to a cut of over £1.7m for pensioners in Tiverton & Honiton. It comes on top of an even bigger hit that pensioners suffered in 2022, when the government did not uprate pensions in line with earnings as the triple lock requires.\nThe effect of both cuts could result in an eye-watering hit for local pensioners of more than £15.5million over three years. That equates to each pensioner living in the Tiverton & Honiton constituency receiving a cut of over £550.\nThe Liberal Democrat party is, as things stand, the only major party to commit to the triple lock in full ahead of the next General Election, offering pensioners security during the ongoing cost of living crisis.\nLiberal Democrat Member of Parliament for Tiverton & Honiton, Richard Foord said:\n“Rowing back on the triple lock would be yet another in a long list of broken promises from this Conservative Government.\n\"Pensioners in Devon should not be forced to suffer due to out-of-touch Conservative Ministers turning their backs on them, especially given ongoing cost-of-living challenges.\n“These are people who have worked hard and contributed to society for decades. The least we can do is ensure that they get a fair deal when it is time for them to retire.\n\"The only way to deliver this and offer much-needed certainty for people is to protect the triple lock in full. Instead, Rishi Sunak and his Government look set to short-change them by hundreds of pounds, all to make up for his own party crashing the economy.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-writes-to-health-secretary-on-first-day-to-demand-action-to-save-seaton-hospital/content_107.html": "Foord writes to Health Secretary on first day to demand action to save Seaton Hospital\nNewly re-elected MP Richard Foord has written to the new Health Secretary Wes Streeting on his first day in the job to raise concerns about the future of Seaton Hospital and inviting them to visit the Hospital to discuss the fight to save it from being hollowed out.\nIn October, Mr Foord raised the alarm about plans by NHS Devon to turn over a whole wing of the hospital - built for using funds raised by the local community - over to NHS Property Services due to being unable to afford the almost £300,000 a year rental charge.\nThis would mean that NHS Property Services, a government-owned company whose operations are conducted within the guidelines set out by the Department for Health & Social Care, would then look to either sell off or demolish the wing and leave the hospital diminished.\nThe wing in question used to provide a number of local community hospital beds, until they were cut in 2017. Mr Foord raised these concerns repeatedly with the previous Conservative Government, however Ministers failed to act and instead insisted the issue was nothing to do with them.\nBecause of this inaction, Richard Foord has been working with the League of Friends charity, that supports the hospital, and the Seaton Hospital Steering Committee, elected at a large public meeting in November, to develop alternative plans that would see the space transformed into a new 'Care Hub'.\nIn his letter to Wes Streeting, he called for the Health Secretary to commission a review into how NHS Property Services charges local NHS Integrated Care Boards (ICBs) for facilities - to ensure the rents are fair and to establish a new rental tariff to allow empty buildings to be repurposed by local communities instead of being sold off.\nRichard Foord MP said:\n\"People are fed up with warm words, they want to see action. That's why on my first day as MP for Honiton & Sidmouth, I have written to the new Health Secretary Wes Streeting to demand action to save all of Seaton Hospital.\n\"For months I tried to get the Conservatives to act, yet they chose not to. This has left the local community without certainty about the future of their cherished hospital.\n\"With a new Parliament, and a new Government, I am renewing the fight to protect our rural NHS and community hospitals - even if that means banging down the door of the Health Secretary on his first day.\n\"One way to safeguard our small rural hospitals and community health services is to ensure those no longer in clincal use can be repurposed for health and social care, instead of being sold off.\n\"That's why I'm pushing for a new rental tariff that would allow NHS Devon to pay a peppercorn rent, in partnership with local charities and community organisations, for unused NHS buildings.\n\"This will ensure hospitals like Seaton can remain safe in the hands of the people who use the services and, in many cases, those who helped pay for them.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_page-1/content_16.html": "Eastern Devon MP urges residents to “buy local” as fears grow over Trump tariffs\nRichard Foord, MP for Honiton & Sidmouth, has urged Eastern Devon residents to “buy local”, after he listened to business people at Sidmouth Chamber of Commerce last week.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-calls-for-govt-to-tackle-devons-broadband-not-spots/content_125.html": "MP calls for Govt to tackle Devon’s broadband ‘not-spots’\nDevon’s Liberal Democrat MP has called for urgent work to be taken to improve broadband accessibility across rural communities and tackle so-called ‘not-spots’, where connectivity is particularly poor.\nSpeaking in Parliament, Richard Foord MP highlighted the case of two communities who have been left lagging behind on broadband – the villages of Northleigh near Honiton and All Saints near Axminster where residents struggle to get even a basic internet connection.\nIn his remarks, the Tiverton & Honiton MP highlighted that while the South West as a whole was already worse for connectivity than the UK average communities, it was rural areas in East Devon where speeds were the slowest, clocking in at almost half the UK average.\nCommunities such as Sidmouth, Axminster, and Seaton rank in the worst 10% of the whole country for broadband. Even places like Honiton, where speeds are notionally better, the average connectivity is still in the worst 30% in the country.\nHighlighting the impact this patchy connectivity has on people’s ability to access things like online banking, to work from home, and stay in touch with loved ones, Richard Foord is now calling for the Government to step-up efforts. In Parliament, Richard called on the Minister to get people online with speeds that bring people into the 2020s.\nRichard Foord MP said:\n“It’s a scandal that rural towns and villages like ours are being left struggling to get even basic broadband access, all while urban areas surge ahead.\n“In recent years we’ve seen so many banks close branches on our high streets, forcing people to rely upon online banking to manage their finances. There’s also been a rise in online bookings for travel, particularly when it comes to our railways.\n“But all of this isn’t possible if you cannot get a reliable connection. For far too long, people in our part of the world have been neglected by this Government, which seems out-of-touch with some of the challenges we face on a daily basis.\n“Devon is tired of being left at the back of the queue. That’s why we need to see real action to fix this situation and to help our communities get online, ensuring that the South West – and East Devon in particular – catches up with the rest of the country.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-calls-for-rethink-to-rejuvenate-market-towns-as-mid-and-east-devon-miss-out-on-funding/content_14.html": "Richard Foord MP calls for rethink to “rejuvenate” market towns, as Mid- and East Devon miss out on funding\nDuring a parliamentary debate last Tuesday (4 March), Mr Foord paid tribute to six towns across his constituency – Axminster, Cullompton, Honiton, Ottery St Mary, Seaton and Sidmouth - all of which have special and important features and would significantly benefit from the £20m per area designed to ‘tackle deprivation and turbocharge growth.’\n£20m each for 75 areas, but just one in the South West\nThe UK Government announced last Tuesday that it was going to award £20 million to each of the 75 areas selected across the UK. But the only community in the whole of the South West region earmarked for funding was in south Devon.\nMr Foord said: “Many businesses and organisations in market towns across Mid- and East Devon feel abandoned by successive governments and the distribution of additional funding has meant the South West and Devon has been almost entirely forgotten. Funding for vital local projects would revitalise our towns and ensure they are fit for the future.”\nMr Foord has long called for better funding for towns in the South West, and has described the region as “abandoned by the government.” Consistent with that, the Government announcement about the so-called ‘Plan for Neighbourhoods’ had the South West as the lowest recipient of funding by region, behind ten other nations and regions of Great Britain.\nIn Parliament, Mr Foord has demanded better funding by the Government to “rejuvenate market towns” in Mid- and East Devon.\nIn a debate last Tuesday (4 March) Mr Foord spoke warmly of the six market towns located in the area that he represents: Axminster, Cullompton, Honiton, Ottery St Mary, Sidmouth and Seaton.\nHe has been a champion of market towns since his election win in 2022. That summer, he visited a Honiton maker of a lace jabot and cuffs with the Speaker of the House of Commons, Sir Lindsey Hoyle. The Speaker then wore them at King Charles’ coronation in 2023.\nHistorical significance of market towns in South West England\nDuring the debate last Tuesday, Mr Foord talked about how market towns “tell a story of resilient, creative and proud communities”. He cited Ottery St Mary - one of Devon's oldest market towns – and its tar barrels festival; also Axminster, for its fine carpets.\nFollowing the debate, Mr Foord highlighted how market towns need investment in order to flourish in future. He said: “Market towns are the hubs for our communities, and provide us with much of our history and culture. We have a rich heritage here in Devon, but we can’t rely solely on that for future prosperity. We need investment in projects such as Cullompton railway station, so that people can both learn more about our history, and contribute to their future.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_about-richard/content_33.html": "About Richard\nRichard Foord is your Liberal Democrat MP for Honiton & Sidmouth.\nRichard is fighting to demand better for rural and coastal communities across Devon.\nRichard Foord lives in Uffculme with his family. He grew up in the West Country before going on to serve in the Army for more than a decade, reaching the rank of Major. He completed tours in Iraq and the Balkans, serving as a UN peacekeeper in Kosovo.\nBefore being elected as an MP in 2022, Richard worked for the University of Exeter and the University of Oxford. He is a passionate local activist, and has raised thousands of pounds for charities - including running the London Marathon for the Royal British Legion.\nHe represented the people of Tiverton & Honiton as their Member of Parliament from June 2022, when he overturned a staggering Conservative majority of over 24,000 in a crucial by-election that sent shockwaves through Westminster, and is now the MP for the new Honiton & Sidmouth constituency.\nRichard wants to see a fair deal for rural and coastal Devon. His top priorities are: protecting community health and social care, including fixing NHS dentistry; urgent action to cut the cost of living; and to crack down on the water and sewage industry, which this Conservative Government has allowed to go rogue.\nRichard writes: \"I love Devon and am proud to call it my home. I have watched my children grow up here and am determined to make our area the best place for people to work, retire and live.\nOur towns and villages are full of character. People who live here deserve a strong, independent-minded MP who will put local people first. I’m standing to make sure we get that strong representation that our communities deserve.\"\nUntil September 2024, Richard served as the Liberal Democrat spokesperson for Defence. In this role he called for more action to support the Ukranian people in the wake of Putin's illegal invasion. He has also pushed to end to violence raging in the Middle East through an immediate ceasefire, to protect lives and allow space for a two-state solution.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_contact/content_28.html": "By Email\nRichard.Foord.MP@parliament.uk\nBy Post\nRichard Foord MP\nEast Devon Business Centre,\nHeathpark Way,\nHoniton\nEX14 1SF\nBluesky\nbsky.app/profile/richardfoordld.bsky.social\nRichard.Foord.MP@parliament.uk\nRichard Foord MP\nEast Devon Business Centre,\nHeathpark Way,\nHoniton\nEX14 1SF\nbsky.app/profile/richardfoordld.bsky.social",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-calls-for-energy-bills-to-be-frozen-and-winter-fuel-payments-to-be-reinstated-after-energy-price-rise/content_105.html": "Richard Foord calls for energy bills to be frozen and Winter Fuel Payments to be reinstated after energy price rise\nLiberal Democrat MP for Honiton & Sidmouth, Richard Foord, has called on the government to freeze energy bills following Ofgem’s announcement that the energy price cap will rise again in January.\nMr Foord also called on the government to reinstate Winter Fuel Payments or risk pensioners in rural areas being clobbered in the coming months by bill rises and cuts to support.\nOfgem announced today that the energy price cap will rise to £1,738 a year in January, following the previous 10% rise in October. The Liberal Democrats are calling on the government to cancel this rise in energy bills so that households don’t face even higher energy costs in the new year.\nLiberal Democrat MP for Honiton & Sidmouth, Richard Foord, said:\n“People in rural Devon are facing the prospect of having to fork out even more for their energy bills this winter. Many cannot afford for this energy price rise to go ahead.\n“I have heard already from countless people in our area about how worried they are that this winter.\n“For many pensioners here, this price rise coincides with the cut to the Winter Fuel Payment - bill rises and less support will leave many struggling to keep warm this winter.\n“This follows years of neglect for schemes that would have made homes warmer and more efficient. Had these schemes been funded properly, bills would be significantly lower today.\n\"The new government has pledged to bring down energy bills. It is time for them to live up to their word, cancel this bill rise and protect families and pensioners here in Honiton & Sidmouth this winter.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_household-bills/content_18.html": "Support with household bills\nOn 1st April, the energy price cap rose by 6.4%, with the average annual energy bill estimated at £1,849 per year. Combined with increases in water bills and taxes, this is having an impact upon families across Devon. To help with this, my team and I have prepared some links to relevant companies, charities, and organisations to help residents with their bills. If there is anything we can do for you, please write to me at Richard.Foord.MP@Parliament.uk\n-\nAdvice\n-\nLocal help\n-\nOfgem\n-\nUK Government",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-presents-seaton-hospital-petition-to-parliament/content_93.html": "Foord presents Seaton Hospital petition to Parliament\nSeaton’s Liberal Democrat MP has presented a petition in Parliament today opposing plans to strip out a whole wing that was funded by the community from the local community hospital.\nThe petition forms part of a wider campaign that has received the support of more than 9,000 people from across the Axe Valley and calls for the affected wing to be turned over from the NHS to the local community, so it can be used to benefit local people.\nSince the announcement that NHS Devon was looking to turn a wing of the facility over to NHS Property Services, which could see it demolished or sold off, Richard Foord has been leading a grassroots campaign opposing the plans.\nHe was the first to raise the issue in Parliament, quizzing both the Health Secretary and the Prime Minister over the plans, and has convened meetings with NHS Devon, local community groups and charities, and NHS Property Services.\nBy presenting the petition in Parliament, Mr Foord has formally placed the concerns of local people on the record with MPs and called on the Government to act.\nSpeaking after presenting his petition, Richard Foord MP said:\n“Plans to allow a wrecking ball to be driven through a wing of Seaton hospital would be hugely damaging - not just for Seaton, but for everyone living in the Axe Valley who rely on this facility for treatment.\n“With this petition, the local community has spoken. In just a few weeks, over 9,000 people got behind my grassroots campaign and demonstrated their support for our hospital. It’s now time for Ministers to wake up, listen, and take action.\n“Seaton Hospital is owned by NHS Property Services, a government-owned company with a single shareholder - the Health Secretary. With a single stroke of his pen, he could turn this building over to the local community and ensure it is protected for local people's health.\n“The fact they have so far been unwilling to do this shows the disregard with which they hold our corner of East Devon. People here won’t stand for it. We need more than warm words; we need action.\n“There are so many possibilities for this wing. A new care hub would offer greater levels of tailored care for elderly residents. I will continue to demand that the future of both Seaton Hospital, and all our Community Hospitals, are protected.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-responds-to-kings-speech/content_20.html": "Richard Foord MP responds to King’s Speech\nResponding to the King’s Speech, Liberal Democrat MP for Honiton & Sidmouth, Richard Foord said:\n“Today’s King’s Speech set out a whole range of new measures, as always, the proof will be in the pudding.\n“New laws to address the crisis facing our mental health services and to crack down on rogue water companies are welcome progress, after years of inaction from the previous Conservative government.\n“However, we need to see more action to tackle the immense challenges facing our community after years of Conservative chaos, especially when it comes to dentistry.\n“I am deeply concerned that NHS dentistry didn't get a single mention in the speech today. This is despite the rapidly expanding dental desert across Devon.\n“We’ve seen this first-hand in Axminster where, just days after the election, Axminster Dental Practice announced they will stop treating NHS patients from October due to the flawed dental contract.\n“Labour said in the election that they would ‘make sure everyone who needs a dentist can get one’. I am going to hold them to it and keep pushing for action before it’s too late.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_lib-dem-mp-leads-debate-in-parliament-on-levelling-up-east-devon/content_94.html": "Lib Dem MP leads debate in Parliament on levelling-up East Devon\nLiberal Democrat MP Richard Foord has blasted the Government for its failure to invest in coastal communities in East Devon during a debate in Parliament.\nDespite East Devon District Council submitting bids during each levelling-up round, no project in the Honiton area has been granted support from the Government – at the expense of projects that would have transformed coastal communities from Uplyme to Sidmouth.\nSpeaking in the House of Commons, Tiverton & Honiton MP Richard Foord hit out at the Government’s failure to support coastal communities in east Devon, describing it as “jam tomorrow”, and comparing local roads to the surface of the moon.\nMr Foord highlighted how funding in the first round amounted to just £23 per person in the south west. This, he said, was equivalent to filling half a pothole. Foord is calling for more funding to be invested in the West Country, and for East Devon District Council to be able to redistribute unused funds, rather than having to hand them back to Westminster.\nFollowing the debate, Richard Foord MP said:\n“The Conservative Government’s claim to be levelling-up our coastal communities is disingenuous at best. Despite repeated consideration of bids for funding to support Seaton and Axminster, much of east Devon has been overlooked, allowing our towns and villages to be left behind yet again.\n“Of the UK’s twelve regions, the south west was ranked near the bottom of the league at ninth, in terms of round one levelling-up funding, equating to just £23 per person. Considering this isn’t even enough for a single train ticket from Honiton to Plymouth, how does the Government think it’s enough to support local businesses, protect local services, or repair roads which resemble the surface of the moon?\n“Of the one award that has been allocated to East Devon, it is all chalked-up for spending on Dinan Way in Exmouth, now that the 'Exmouth Gateway' project has been dispensed with. While we don’t yet know what will happen to the money that had been allocated to Exmouth Gateway, I am certain that it would be better spent on improving our coastal communities, rather than handed back to central Government.\n“To protect and sustain our coastal communities, east Devon needs support from central Government. Instead, what we’re seeing is ‘jam tomorrow’.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_many-mid-and-east-devon-residents-are-struggling-with-huge-water-bill-increases-richard-foord-mp-tells-parliament/content_11.html": "Many Mid- and East Devon residents are struggling with huge water bill increases, Richard Foord MP tells Parliament\nResidents across Mid- and East Devon are struggling to pay enormous new water bills. The hiked charges are far in excess of the average rise recommended by Ofwat, the MP for Honiton & Sidmouth told representatives in Parliament on Tuesday.\nRichard Foord informed MPs that some Devon residents who are seriously ill, as well as others who are not connected to South West Water’s sewers have been hit with huge increases.\nHe said: “Ofwat ruled last December that bills can rise by 36 per cent on average over five years, before inflation.”\nBut residents across the Honiton & Sidmouth constituency tell a different story.\nMr Foord described the situation of an Aylesbeare resident. Even though he is not connected to South West Water’s sewerage system, his annual bill is now £761, up from £486 last year; a jump of over 56 per cent.\n“As the resident has cancer and weakened immunity, to protect himself he boils his water before drinking it, because he is conscious that South West Water had an outbreak of the cryptosporidium parasite last year.”\nAnother resident from Sidmouth contacted Richard “in disbelief” about her bill. Her ten instalments per year are increasing from £49 to £70.\nWhen she raised concerns, a customer service agent offered what sounded like a helping hand: to reduce the instalments to £58.60.\nShe later worked out that this was because the instalments would be spread over twelve months rather than ten. “It was a cloak for no bill reduction whatsoever,” emphasised Mr Foord.\nResidents are also facing lengthy waits to talk to customer services representatives.\nSouth West Water’s automated voice service has been telling anxious residents when they call, that they’re in a queue of over 100 people, waiting for advice on their much-increased charges.\nConstituents have informed Mr Foord that they have been 178th in the queue, 106th, 94th, and on a quieter day, 87th and 74th – while waiting to speak to someone from the company.\nMr Foord added: “That is absolutely crazy, from a water company hiking people’s bills in some instances by 56%.\n“South West Water is proposing to spend £3.2 billion on infrastructure improvements, but the crying shame is that it has failed to invest in its infrastructure in years gone by.\n\"… since privatisation, South West Water has paid out more than £4.5 billion in shareholder dividends.\n“This week, we have learned that the PR side of the business is going to be joined by none other than the former MP for East Devon, Simon Jupp. He is going to speak for South West Water, having attacked it while he was a Member of Parliament.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_number-of-devon-dentists-quitting-nhs-work-rises-by-more-than-half/content_80.html": "Number of Devon dentists quitting NHS work rises by more than half\nThe number of dentists quitting NHS work in Devon has risen by more than 53% since 2018/19 new research has revealed, as the Liberal Democrats announce their push for a £750 million ‘rescue package’ for dentistry.\nUnder the Liberal Democrat proposals, the NHS dentistry budget in England would see a significant cash injection on top of its current funding, which would help reform the NHS contract to encourage more dentists to take on NHS work.\nThis would act as a ‘rescue package’ for dentistry in Devon, which saw 66 dentists leave the NHS in 2022/23. That is a rise of 23 on the number of leavers compared with 2018/19, or an increase of 53.5% overall.\nIt was first reported in 2021 that no dentist in Devon was taking on new NHS patients. This was confirmed to still be the case last year, and in January Richard Foord raised the case of a 75 year old couple in Parliament who called over 20 dental practices and still could not find one taking NHS patients.\nThis dire situation threatens to get worse with 17% of NHS dentists in Devon nearing retirement age, creating the potential for even fewer dentists to cope with already overstretched services.\nAcross England, the number of dentists leaving the NHS has risen by a third in the past four years. A further 3,532 dentists are nearing retirement age, over one in seven (14.6%) of the total dentists in the country.\nThe Liberal Democrats are calling for urgent reforms to the dental contract to deliver more NHS dentist appointments and free check-ups for children. This, backed by funding of £750m a year by the end of the Parliament, would allow them to:\n- Bring dentists back to the NHS from the private sector by fixing the broken NHS dental contract and using flexible commissioning to meet patient needs.\n- Introduce an emergency scheme to guarantee access to free NHS dental check-ups for those already eligible: children, new mothers, those who are pregnant and those on low incomes.\nLiberal Democrat Candidate for Honiton & Sidmouth, Richard Foord said:\n“People across Devon are going without what should be the very basic of dental care, with it now being seemingly impossible for most to get an appointment when they need one.\n“It cannot be acceptable that people across our county are forced to wait in pain, not knowing if they will even be able to register with a dentist - let alone get an appointment.\n“This Conservative Government has pushed local health and dental services to the brink, and it is people in our community paying the price. They’ve let our services decay around us while taking little action to meaningfully address this crisis.\n“The Liberal Democrats are calling for a Dental Rescue Package. This would fix the dental contract, keep dentists practicing here in the UK, and tackle the crisis in frontline care. Every vote for the Liberal Democrats is a vote for real action to fix NHS dentistry.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_eastern-devon-mp-urges-residents-to-buy-local-as-fears-grow-over-trump-tariffs/content_26.html": "Eastern Devon MP urges residents to “buy local” as fears grow over Trump tariffs\nRichard Foord, MP for Honiton & Sidmouth, has urged Eastern Devon residents to “buy local”, after he listened to business people at Sidmouth Chamber of Commerce last week.\nThe town’s traders told him of their fears about the impact of disastrous US tariffs - imposed by President Trump - when Mr Foord met with them last week.\nThe trade barriers were imposed as National Insurance contributions soar – a double whammy for local businesses to cope with.\n“Many of our businesses here are worried about the damage that Trump’s trade war will do, especially after being hammered by the rise in the Chancellor’s ‘jobs tax’, that came into force a few days ago.\n“When I met with Sidmouth Chamber of Commerce last Wednesday (9 April), business owners told me they were concerned about the rise in employer’s national insurance, in addition to the impact that trade uncertainty and tariffs are having on consumer confidence.\n“Some are worried that even harder times are coming for town centres.\n“The Government has a fine line to tread, of course, but it feels very much as though we’re not standing up for our businesses – and they desperately need some good news, after years of hardship.\n“We have some excellent producers, manufacturers and retailers in this part of Devon. The Government should be supporting them, rather than leaving them at the mercy of Donald Trump’s next whim.\n“I know people here are ready and willing to support our local businesses and ‘buy local'. Whether family farms, tourism and hospitality, or our manufacturing sector, Liberal Democrats will always back local businesses and join with them to stand up to Trump’s assault on the global economy.”\nAfter speaking with businesses in Sidmouth, Mr Foord visited Supacat at Dunkeswell, as they hosted the head of the British Army – the Chief of the General Staff.\nThe visit reinforced Mr Foord's view that Government procurement would do well to \"buy British\" too - a cause that the Liberal Democrats have taken up in the media and in Parliament.\nRichard Foord continued: “Businesses here in Mid- and East Devon will be disappointed that the Government has not embraced the campaign to “buy local” in this time of need. I hold out hope that they will yet come up with a package of measures that will help sustain businesses across our towns and villages.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_dentists/content_32.html": "Fix NHS Dentistry\nIn rural areas like ours, NHS Dentistry is often seen as more of a myth than a reality, with it being almost impossible to get an appointment locally when you need one.\nThere is not a single dental surgery in Devon taking new NHS patients and many are only offering private treatment.\nIt's unacceptable that we either have to travel for hours to find a dentist still offering NHS care or shell out hundreds of pounds to go private.\nThe Government cannot ignore this crisis. We need urgent action to fix the NHS dental contract and boost the number of appointments. I am calling for:\n- An increase to the number of dentist training places in the UK\n- Recognition of EU trained dentists’ qualifications\n- Rural areas in the South West receiving the same provision of NHS dentistry as those in urban areas\n- Urgent implementation of the government’s manifesto commitment of 700,000 more dental appointments\nIf you agree, then sign my petition.\nFix NHS Dentistry\nIt's time to fix NHS Dentistry here in the South West. Please, sign my petition today",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-2/content_54.html": "Richard Foord slams government’s family farm tax following OBR assessment\nShocking figures reveal inheritance tax hike will “barely move the dial” on public finances.\nShocking figures reveal inheritance tax hike will “barely move the dial” on public finances.\nIn a vote in Parliament on tuesday, Richard Foord, MP for Honiton & Sidmouth, supported a bill paving the way to give compensation to an estimated 7,150 WASPI women in his constituency.\nThe MP has declared that the UK’s nature is in crisis and needs urgent action, ahead of a key vote calling on the government to put environmental issues firmly at the heart of its work.\nThe MP for Honiton & Sidmouth has called on the government to provide more support for struggling local hospices, during what has become an ongoing traumatic financial period for the organisations.\nA Devon MP will lead a debate this afternoon (Tuesday) on the importance of comprehensive government preparedness against a range of pressing threats to the UK.\nA community group working to save an East Devon community hospital wing from demolition, is hoping to have an answer to its business plan next month.\nRichard Foord, MP for Honiton & Sidmouth, has called for clarity over sewage spills, following discharges into the East Devon coast.\nLiberal Democrat MP for Honiton & Sidmouth, Richard Foord, has called on the government to freeze energy bills following Ofgem’s announcement that the energy price cap will rise again in January.\nRichard Foord is calling for an urgent plan to boost the numbers of NHS dentists across the region, at a debate held in Parliament on 12th November.\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-backs-ceasefire-and-calls-for-peace-talks-to-end-violence-in-gaza/content_55.html": "Foord backs ceasefire and calls for peace talks to end violence in Gaza\nResponding to tonight's vote in Parliament on an amendment to the King's Speech which called for a ceasefire in the Israel and Gaza conflict, Liberal Democrat MP for Tiverton & Honiton Richard Foord said:\n\"Tonight, I voted to demand the UK Government calls for a ceasefire between Hamas and Israel.\n\"It has been several weeks since the fighting began and there is no military solution to the terrible insecurity that both sides feel. It is unconscionable that thousands of innocent lives have been lost. There is a growing humanitarian catastrophe in Gaza. Israel continues to be subject to rocket attacks, and there are over 200 people being held hostage, or as prisoners of war.\n\"We have to try something different. We need to break the deadlock and stop the fighting. For the security of Israelis and the future of Palestinians, Hamas cannot be allowed to continue in charge of Gaza. Liberal Democrats support a political solution via an immediate bilateral ceasefire.\n\"A ceasefire cannot be a goal in itself. It is contingent upon both parties adhering to it. On 7th October, Hamas broke the previous ceasefire to launch their violent terrorist attack on Israeli civilians. So a ceasefire that is not adhered to by both sides does not advance us towards lasting peace. It is not enough to simply freeze the conflict; a long-term solution is required that provides peace and security for both Israelis and Palestinians.\n\"I will continue to push for a ceasefire, so we can secure the release of hostages and get both Israel and the Occupied Palestinian Territories around the negotiating table. A lasting peace and a two-state solution is the way to guarantee the dignity and security which both Palestinians and Israelis deserve.\"",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_page-10/content_21.html": "Foord opens ‘revolutionary’ banking hub in Axminster\nLocal MP Richard Foord joined with community leaders to open a new Community Banking Hub in Axminster, a year after the town lost their only remaining bank branch.\nLocal MP Richard Foord joined with community leaders to open a new Community Banking Hub in Axminster, a year after the town lost their only remaining bank branch.\nLiberal Democrat MP for Tiverton & Honiton Richard Foord responds to the Autumn Statement\nLiberal Democrat MP Richard Foord has criticised the Conservatives for continuing to take the South West for granted as the third round of Levelling-up funding saw just three projects having their bid approved, with no additional cash for Cornwall.\nRichard Foord MP tonight voted for an amendment to the King's Speech which called for a ceasefire in the Israel and Gaza conflict\nDevon MP Richard Foord calls on water firm to crack down on excessive pay and is “amazed” at no mention of sewage crisis in King’s Speech, despite pay and pension payouts for water executives rising to a new high of £10 million\nLiberal Democrat MP Richard Foord has rallied the local community in the Axe Valley against plans that could see a whole wing of Seaton Community Hospital sold and demolished.\nLiberal Democrat MP for Tiverton & Honiton Richard Foord has welcomed the news that railway ticket offices at Feniton, Honiton, Axminster and Tiverton Parkway will remain open.\nMid Devon Liberal Democrats are delighted they have played a part in the Government's U-Turn following the news that our local railway ticket offices will remain open. The proposed closure would have affected Tiverton Parkway and Exeter St David’s.\nThe Conservative Government is reportedly set to break the triple lock once again by not uprating the state pension fully in line with earnings by excluding bonuses. This means pensioners will receive a 7.8% rise in the state pension, instead of 8.5%.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_sewage/content_34.html": "Stop Sewage Dumping\nBack Richard's campaign to stop sewage being dumped into our rivers and coastlines.\nWater companies are dumping thousands of hours of raw sewage into our rivers and coastlines - whilst paying out huge bonuses.\nThe last Conservative government let them get away with it and wanted taxpayers to pay to fix the problem.\nWater companies need to clean up their own mess and stop dumping sewage in our rivers and lakes.\nIt's time for a 16% sewage tax on their £2.2 billion annual profits to improve our sewage system and protect our rivers and lakes.\nStop Sewage Dumping\nTax water companies' huge profits and fix our sewage system.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-calls-for-government-action-on-social-care-staffing-crisis/content_10.html": "Richard Foord MP calls for Government action on social care staffing crisis\nRichard Foord, MP for Honiton & Sidmouth has highlighted the growing social care challenge in Devon, proposing an increased gambling tax to fund a higher minimum wage for social care workers.\nMr Foord was contributing to the Terms and Conditions of Employment debate on Tuesday evening where he described a burgeoning crisis for Devon’s social care sector, after more than a decade of swingeing funding cuts by the Conservatives, leaving Devon County Council in a perilous financial position.\nHigher than average staff turnover in Devon\nHe told MPs: “The turnover rate for social care staff in Devon is 27 per cent. That is not only higher than the national average, but roughly double the figure for other sectors. That is why I want a separate, higher minimum wage for social care.\n“A striking 16 per cent of social care workers cited low pay as the primary reason why they left the job.\n“In a rural county such as Devon, people have to travel long distances between the people for whom they care, which sometimes means that their real income is less than the national minimum wage.\nA shortage of social care beds\n“We in Devon are looking at a shortage of social care beds. Devon County Council projects that by 2027, Devon will face a shortfall of 270 care home beds for older people with complex needs. Looking further ahead, the situation gets worse. By 2033, in Honiton, the unmet need will be 72 care beds; in Cullompton, the need will be 79 care beds. In Seaton and Ottery St Mary, an additional 40 care beds will be required by then.”\nA higher gambling tax could be the answer – social care workers must be paid more\nMr Foord continued: “According to Skills for Care, increasing pay by between £1 and £2 per hour above the national minimum wage for care workers could save up to £947 million from reduced hospital admissions, but there would need to be some funding up front to make that happen. I suggest that the remaining funding comes from an additional tax on the gambling industry, which, according to Public Health England, costs the UK economy about £1.4 billion annually due to the financial, physical and mental impacts of problem gambling and the resulting crime and loss of productivity.\n“It is time that the Government acted to ensure that those who profit from gambling contribute more to the public good. Increasing pay for the lowest-paid social care workers is a simple, effective step to attract and retain staff, and ensure that people in our communities receive the care that they require.\n“We must go further and pay our social care staff more, recognising their vital role in looking after the elderly and vulnerable.\nSpring Statement was a missed opportunity\nCommenting on Wednesday’s Spring Statement, Mr Foord, said: “It was a missed opportunity for many of the people who I represent. We need to boost health and social care in fairer and more effective ways, such as from the banking, tech and gambling giants; rather than the businesses on our high streets, older and vulnerable people, or the farmers in our community.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_community-banking/content_22.html": "Protect local banking services\nAcross our towns and villages, nearly three quarters of local bank branches have closed since 2015. This forces many to take round-trips of up to 40 miles just to access full banking services.\nThe decisions by big banks to close branches is incredibly short sighted and will cause huge disruption to both local people and our high street businesses.\nWe must act to protect local banking services and access to cash. Sign the petition and make your voice heard!\nSave Our Cash!\nAccess to cash is vital for people in Honiton & Sidmouth. We need a new solution that works for rural communities. Sign the petition to save our cash!",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_dartmoor/content_19.html": "Save Dartmoor Camping\nAs a child, I wild camped on Dartmoor when training for the Ten Tors expedition and for the Duke of Edinburgh Award. It gave kids like me a taste of the outdoors and allowed us to see more of our beautiful part of the world. However, a High Court ruling has put our historic right to wild camp on Dartmoor at risk.\nIt shouldn’t be the case that a small number of wealthy landowners are able to hold our National Parks to ransom.\nBy restricting people’s right to respectfully enjoy Dartmoor, people are being denied the opportunities we've enjoyed for years.\nBack my campaign to change the law and protect our right to respectfully enjoy our countryside.\nRestore the right to wild camp\nJoin the campaign to allow wild camping on Dartmoor and protect our right to respectfully enjoy our countryside.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_hundreds-of-farms-across-mid-and-east-devon-could-be-hit-by-new-family-farm-tax/content_52.html": "Hundreds of farms across mid and east Devon could be hit by new “family farm tax\"\nLAST week in parliament, local MP, Richard Foord, spoke against a new “family farm tax” that the Government says could affect more than 250 farms across mid and east Devon.\nRichard Foord MP represents Honiton & Sidmouth – a rural constituency that has almost 1000 farms (978 holdings).\nMinisters have said that 27 per cent of farms will be affected by the changes, which would cut the level of inheritance tax relief for farmers.\nBut the Country and Land Association says the number affected could be higher - in the region of 70,000 farms across the UK, many of which are in Devon.\nIt’s a move that Mr Foord believes will make farmers lives tougher, with a risk that many will need to sell machinery, land or livestock in order to pay the necessary new taxes, meaning the shrinking of family farms over time to such a size as to make them not viable.\nHundreds of farms across the Honiton & Sidmouth constituency could be hit\nAccording to Government figures, around 264 farms in the Honiton & Sidmouth constituency are set to be hit with the new tax.\nMr Foord, who observes that farm businesses are often asset-rich but cash-poor, is now calling on the Government to scrap the new tax.\nHe said: “The Government must urgently think again on the “family farm tax.” I am very concerned for the future of our local farmers, many of whom are struggling to make ends meet as it is. This follows the last Government’s disastrous record on botched trade deals, resulting in cuts to farmers’ incomes.\nFarmers need solid support from the Government to ease the transition to nature-friendly practices and food security\n“I am also worried that the tax could inadvertently worsen the biodiversity crisis and damage our food security. Money is being spent on supporting farmers to adopt sustainable practices, such as reducing pesticide use, planting hedgerows and managing soil to reduce erosion and pollution - and secure the very future of food production on those farms.\n“To achieve these things, farmers need solid and long-term support from government.\n“The decline in nature is predicted to result in a 12% loss of UK GDP in the coming years. Climate change and nature loss are two of the greatest threats posed to the UK’s food security; the Liberal Democrats propose that farmers should receive an additional £1 billion a year in support to aid the transition.\n“The Chancellor should urgently reverse course, scrap the family farm tax and take up Liberal Democrat proposals.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_40000-local-pensioners-to-be-hit-by-pound1000-stealth-tax-bombshell/content_95.html": "40,000+ local pensioners to be hit by £1,000 stealth tax bombshell\nNew analysis by the Liberal Democrats has revealed that 40,284 pensioners across East and Mid Devon are set to be hit with a £40m stealth tax following the Budget.\nResearch by the Resolution Foundation think tank has found pensioners are set to lose out from this week’s Budget. This is due to the Conservative government’s decision to freeze income tax thresholds, which will see £8 billion extra tax paid by pensioners across the country by 2027-28 – averaging roughly £1,000 each.\nFurther analysis by the Liberal Democrats suggests this will impact on the estimated 40,284 pensioners across East and Mid Devon who pay income tax.\nLiberal Democrat MP Richard Foord has hit out at the news and said that this showed the Conservative Party has “abandoned” pensioners who are already struggling to pay the bills.\nThe Liberal Democrats were the first party to commit in full to the triple lock for the upcoming election, which ensures pensions will see an increase by whichever is highest of average earnings growth, CPI inflation, or 2.5%.\nLiberal Democrats have also called on the government to double the Winter Fuel Allowance to offer extra help to pensioners, paid for by a proper windfall tax on the oil and gas companies.\nCommenting on the findings Tiverton & Honiton MP Richard Foord said:\n“Pensioners who have worked hard and paid taxes all their lives are now being punished by this Conservative government. Their cruel decision to freeze the threshold at which people start paying tax leaves many retirees now facing a £1,000 stealth tax bill.\n“Many elderly people are already struggling to make ends meet because of sky-high heating bills and the cost of their weekly shop going through the roof. Now, these Conservative tax hikes will only pile on the misery.\n“The Liberal Democrats were the party to introduce the triple lock to protect people’s pensions, giving people peace of mind when they retire. But the Conservatives are now hanging our pensioners out to dry with their neglect.\n“I’ve been pushing for on the Government to double the Winter Fuel Allowance, tackle the huge backlog of people awaiting operations, and not clobber the most vulnerable with stealth tax rises like this.\n“I will be voting against this damaging budget next week, and every Conservative MP who actually cares about supporting our pensioners should do the same.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-kicks-off-re-election-bid-with-pledge-to-fight-for-rural-nhs/content_106.html": "Foord kicks off re-election bid with pledge to fight for rural NHS\nLiberal Democrat MP Richard Foord has today launched his bid to be the next MP for Honiton & Sidmouth with a promise to fight for rural NHS services and be a voice for residents across East Devon.\nSpeaking to a packed room of supporters in Ottery St Mary, Mr Foord laid into the Conservatives for ‘letting down’ rural communities and criticised his Conservative opponent for ‘sitting back and toeing the party line’, while highlighting his own commitment to always speak out on local issues.\nAt the rally Mr Foord was joined by Claire Wright, the former independent candidate for East Devon who received the support of more than 24,000 people at the last General Election, and former Devon County Councillor Martin Shaw – both of whom are supporting his election campaign.\nSpeaking of his priorities, Mr Foord spoke about his focus on supporting rural health and social care services, cracking down on water companies to end the sewage scandal, and supporting the environment through protecting the countryside and biodiversity.\nThe event was attended by more than fifty people, with many heading out afterwards to start knocking on doors and delivering leaflets for Richard’s campaign.\nSpeaking after the event, Richard Foord said:\n“At the next election, the choice facing people in our corner of Devon is plain. They either get a hardworking local champion fighting their corner, or yet another Conservative MP who is content to defer to the party whips and toe the party line.\n“Our country is in dire need of change. We have an NHS crumbling before our very eyes, our rivers and beaches are awash with sewage, and our rural market towns are at risk of becoming hollow shells of their former selves, as businesses and services wilt away.\n“The Conservatives have shown time and again that they simply do not care about areas like ours. They continue to take us for granted, preferring to funnel funding into the Midlands and North in a desperate attempt to shore up their ‘red wall’ seats.\n“My campaign is focused on showing people the real difference a hardworking local MP committed to fighting their corner can have. This is something we’ve seen since my election last summer – with new announcements secured in relation to Tiverton High School, and a pledge of the opening of a railway station at Cullompton.\n“I am humbled to have the support of people like Claire Wright and Martin Shaw, who have been real champions for our towns and villages. The message is plain: the only way to change things for the better is to vote Liberal Democrat and kick out this out-of-touch Conservative Government.”\nAnyone wishing to find out more about Richard Foord or support his campaign can do so by visiting RichardFoord.org.uk",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk/content_1.html": "Eastern Devon MP urges residents to “buy local” as fears grow over Trump tariffs\nRichard Foord, MP for Honiton & Sidmouth, has urged Eastern Devon residents to “buy local”, after he listened to business people at Sidmouth Chamber of Commerce last week.",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-hails-new-chapter-with-win-in-honiton-sidmouth/content_65.html": "Foord hails 'new chapter' with win in Honiton & Sidmouth\nResponding to Liberal Democrat wins across the South West, including his win in Honiton & Sidmouth, Richard Foord MP said:\n“I am deeply humbled and honoured to be re-elected to fight for Devon, the place I am proud to call home.\n“This result marks the beginning of a new chapter. People don’t want politicians to promise miracles, but they do want someone who is willing to roll up their sleeves and get to work on the everyday challenges they face.\n“Today, people have stood up to demand better and shown that the Liberal Democrats are the true champions of the rural West Country.\n“I promise to do all that I can to repay the trust you have placed in me, working night and day to demand better for our rural and coastal communities.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_foord-slams-feeble-govt-response-to-seaton-hospital-petition/content_82.html": "Foord slams ‘feeble’ Govt response to Seaton Hospital petition\nSeaton’s Liberal Democrat MP has hit out at the Conservative Government for failing to agree to act to save Seaton Community Hospital, in response to a petition signed by more than 9,000 Axe Valley residents.\nTowards the end of last year, it emerged that Devon’s Integrated Care Board was looking to transfer a whole wing of the Seaton facility over to NHS Devon. This put the facility at risk of being sold off and even demolished.\nThis decision caused a huge uproar from the local community, who raised the money to build the ward in the first place. In the wake of the plans becoming public, Richard Foord MP has been working with the Seaton and District League of Friends and other community groups to oppose the plans.\nEarlier this month, Mr Foord presented a petition to Parliament calling for the Government to act to protect Seaton Hospital. The petition garnered the support of more than 9,000 people and required the Government to respond to it.\nHowever, in their response to the petition, the Department of Health and Social Care declined to take any action – instead stating: “The Government believes that ICBs are best placed to make decisions on commissioning services…”\nRichard Foord MP has called the response ‘feeble’ made up of ‘weasel words’, highlighting that the ultimate power to act to change the situation facing Seaton Hospital rests with the Conservative Health Secretary.\nMr Foord has secured a debate in Parliament on Friday on the accountability of NHS Property Services by the Government, in which he plans to push Ministers to come clean on the exact arrangements regarding how it is overseen by the Department for Health and Social Care.\nCommenting, Tiverton & Honiton MP Richard Foord said:\n“When I presented our petition to Parliament, backed by over 9,000 local people, I hoped it would be a wake-up call for the Government – that it would finally spur them to sit up and take notice. Sadly, they continue to take us for granted.\n“Their response to the calls from our community is insulting, frankly. Rather than face up to the influence they could exercise, the Government in London is instead content to hide behind weasel words, once again trying to pass the buck to anyone but themselves.\n“This is feeble. With a single stroke of her pen, the Conservative Health Secretary could change the rental framework and enable this community-funded wing to be let at a reasonable price. This would enable us to save it from sale, or even demolition, and repurpose it as a new Care Hub.\n“The Conservatives’ talk is cheap. They have repeatedly failed to listen to the voices of our community and are desperate to blame anyone but themselves. I will continue to fight to get real change so we can protect the future of Seaton Hospital.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_richard-foord-mp-calls-for-transparent-monitoring-of-sewage-spills/content_68.html": "Richard Foord MP calls for transparent monitoring of sewage spills\nMr Foord spoke in a Parliamentary debate on Wednesday 27 November (see attachment) where he raised the issue of spills at Sidmouth. He will meet Susan Davy, the Chief Executive of South West Water in early December.\nAside from the unacceptable level of spills at Sidmouth, local residents are frustrated that there is a discrepancy between reports listed on Water UK’s Stormwater Hub, and the data available on South West Water’s Waterfit Live map.\nAccording to the Rivers Trust, in 2023 Sidmouth’s sewer storm overflow spilled 96 times for a total of 1,554 hours.\nReporting measures differed during Storm Bert in late November, for example.\nWater UK’s National Storm Overflow Hub showed that on Friday 22 November at 11.30am, sewage was spilling at sea in Sidmouth. On Monday 25 November at 7.45pm, the same source showed Sidmouth was still 'spilling' at sea.\nYet SWW's Waterfit Live map indicated that the discharge started Saturday 23 November 10.49am and ended at 7.38pm the same day.\nSWW reporting measures lack transparency\nMr Foord said: “It is essential that we have a single reliable source of information in order to significantly improve water quality. However, SWW's Waterfit Live map lacks transparency, as it displays information about discharges from the two Sidmouth outlets in just one location. Water UK clearly distinguishes both sites on its hub.\n“SWW is currently upgrading Sidmouth’s sewerage system, reducing infiltration by repairing pipes and relining some. This will reduce the volume of surface water reaching the sewers. This is welcome and is very much needed.\n“However, the problem of sewage in our river and coastal waters continues to be unacceptable. It is essential that we have a trusted a reliable reporting measure, if bathers are to have confidence that the sea is safe, the health of life within our rivers and coastal waters is to improve and we are properly able to hold water companies to account.”\nMr Foord, who has since written to Environment Minister Emma Hardy about the issue, added: “Unfortunately, South West Water’s reporting does not appear to be entirely transparent. I am sure that people in and around the towns of Sidmouth, Seaton and Beer - and inhabitants of coastal towns across the country - would appreciate Government leadership on having one reliable comprehensive reporting measure for sewage spills.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mps-demand-answers-over-railway-station-re-openings/content_59.html": "MPs demand answers over railway station re-openings\nLiberal Democrat MPs Richard Foord (Honiton & Sidmouth) and Gideon Amos (Taunton & Wellington) have challenged Ministers over plans to re-open railway stations at Cullompton and Wellington, after having been told last week that the projects would go ahead.\nSpeaking in the House of Commons on Monday 29 July, Gideon Amos MP pressed the Chancellor of the Exchequer Rachel Reeves on the future of the planned re-openings. Mr Amos sought reassurances from the Chancellor that the winding-up of the Resorting Your Railway scheme would not affect projects that were already in progress.\nIn response, the Chancellor said: “I assure him that projects that have already started, such as the station he mentions [Wellington], will go ahead.”. However, just days later, this appeared to have been contradicted by a letter from the Minister of State for Rail.\nWriting to both MPs, Lord Hendy of Richmond Hill stated that the re-openings would not be funded under the programme and offered only a vague commitment to “attempt to consider” the Cullompton and Wellington project, as part of the wider review of government-backed transport initiatives.\nIn response, Richard Foord and Gideon Amos have jointly written to Lord Hendy, raising the assurances offered by the Chancellor and demanding that the Department for Transport continues to commit to funding this important project.\nCullompton MP Richard Foord said:\n“Having spent over two years pressing the last Government to honour its commitments and re-open Cullompton station, I’ve seen the hard work and dedication that has gone in to helping get things off the ground.\n“Yet now we find out that, despite direct promises from the Chancellor in the House of Commons, the Department for Transport may be seeking to quietly side-line the project.\n“The re-opening of stations at Cullompton and Wellington are vital to ensuring our railways serve the needs of our communities.\n“People have had enough of hollow promises. The Chancellor must honour her word and press the Department for Transport to release the funding for the re-opening of these vital commuter stations.”\nLiberal Democrat MP for Taunton & Wellington Gideon Amos added:\n“I was delighted that the Chancellor, Rachel Reeves, confirmed to me in the House of Commons that this Station project ‘will go ahead’. However, recent correspondence from the Department for Transport does not give the same assurance - far from it.\n“I’ve supported this project ever since it was put forward by Jeremy Browne in Parliament in 2014 and since Liberal Democrat councillors kickstarted its funding in 2019.\n“Together Somerset and Devon have put up over £6 million of the funding. To delay now would be totally the wrong decision.\n“I’m going to keep pushing as hard as possible for our station until the Chancellor’s own commitment is honoured and the station gets built.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_news_article_mp-welcomes-aldis-agreement-to-promote-british-produce/content_128.html": "MP welcomes Aldi’s agreement to promote British produce\nDevon’s Liberal Democrat MP Richard Foord has welcomed the news that Aldi has agreed to establish a ‘Best of British’ section to help promote home-grown produce in their stores.\nThe announcement from Aldi comes after another leading supermarket Morrisons announced in December that they would introduce a ‘Buy British’ section, following pressure from Richard Foord and a cross-party group of MPs.\nRichard Foord recently spoke in Parliament about the importance of ensuring “fair play” between supermarkets and farmers. He called for actions to be taken to beef-up the Groceries Code Adjudicator, so it can crack down on wayward practices.\nAldi is one of the top supermarkets in the country, with 80% of its produce being grown here in the UK and the company has held the top spot in the Groceries Supplies Code of Practice annual survey for an unprecedented ten years – due in part to its fairness to farmers.\nIn the wake of this news, Richard Foord is now calling for other supermarkets to follow suit and give British produce the pride of place it deserves.\nRichard Foord MP said:\n“Here in the UK, we produce some of the best produce in the world. Devon’s farmers are well known for their quality and commitment to high standards.\n“That is why it’s so welcome to see another big supermarket has now heeded my push for a specific section dedicated to promoting our home-grown goods. I am looking forward to seeing these sections in the Cullompton, Seaton and Honiton stores.\n“Farmers often get a rough deal from the supermarkets, with many retailers focusing on paying rock bottom prices to pad their profits. This simply isn’t good enough.\n“We need to see fair play and a fair deal between producers and retailers, with a commitment to delivering quality goods at a fair price. That is why I support improving the current regulator.\n“I hope other supermarkets across our market towns will also follow suit and value the work of local farmers by showcasing their products.”",
  "https_www_richardfoord_org_uk_/https_www_richardfoord_org_uk_dccblueletterday/content_61.html": "2025 Blue Letter Action Day March 29th\nCan you help out with our Blue Letter Action Day in Honiton to get all our letters addressed? Tea and coffee provided!\nCan you help out with our Blue Letter Action Day in Honiton to get all our letters addressed? Tea and coffee provided!"
}