{
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_saveourhrc/content_4.html": "Max Wilkinson Says: Save Our Recycling Centre\nCheltenham Borough Council faces a £1 million upgrade bill to keep the Swindon Road recycling centre open. This bill would need to be paid to meet new standards set by the Environment Agency.\nThe Local Government Association says Cheltenham is the only district-level authority in the country running a specialist Household Recycling Centre. The facility is funded entirely by Cheltenham taxpayers and has long subsidised the rest of the County. Waste recycling centres across the rest of the County are run by Gloucestershire County Council, which has the statutory responsibility for waste disposal.\nThe facility is due to close indefinitely from January 10th. It is vital that the County Council, as waste disposal authority, works closely with the Borough Council to restore a service for Cheltenham without delay - at Swindon Road or at an appropriate nearby location.\nSave our recycling centre\nWe, the undersigned, support Max Wilkinson MP’s call for the councils to work together to save Cheltenham's Recycling Centre.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_page-2/content_7.html": "Taking on Trump & Farage – and fixing church roofs\nLeader's Speech to Spring Conference 2025\nMax is Cheltenham's man in Westminster. Elected as our MP in July 2024, he is already hitting the ground running, campaigning for our town.\nLiving in Fairview with his wife and daughter, Max has helped Cheltenham make progress on issues ranging from affordable housing to the environment and the cost of living over a decade as a Councillor.\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nKeep up to date with Max's work as your MP for Cheltenham.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_search/content_12.html": "Save Our Recycling Centre 2025\nMax Wilkinson Says: Save Our Recycling Centre Cheltenham Borough Council faces a £1 million upgrade bill to keep the Swindon Road recycling centre open. This bill would need to be paid to meet…\nMax Wilkinson Says: Save Our Recycling Centre Cheltenham Borough Council faces a £1 million upgrade bill to keep the Swindon Road recycling centre open. This bill would need to be paid to meet…\nCheltenham Needs A New GP Surgery Cheltenham’s Conservative MP previously announced plans to bring back 24/7 doctor-led A&E at Cheltenham General and improve GP services. As I speak to…\nMax's Plan for our NHS He’s fighting for a fair deal after the Conservatives left the NHS in a mess. Maternity Services Fixing our local NHS has been Max’s top priority since being…\nFix Our High Street Cheltenham’s High Street and Promenade has benefited from millions of pounds of investment in new paving in recent years. But when expensive paving slabs break, they’re…\nMax is fighting against Winter Fuel cuts Liberal Democrat MP for Cheltenham, Max Wilkinson, has backed a motion in Parliament to block government plans to scrap Winter Fuel…\nContact Max Contact Max Wilkinson MP ✉️ For Max Wilkinson, 16 Hewlett Road, Cheltenham GL52 6AA 💻 max.wilkinson.mp@parliament.uk 📱twitter.com/mpmwilko 🖥️…\nDon't Let Cheltenham Lose Its Voice The government’s plans for English Devolution will mean big changes for our local democracy. Max backs plans to remove power from Westminster and give it to…\nBack Jools' Law Cheltenham MP Max Wilkinson has launched a new push to support bereaved parents seeking answers from social media giants. His Jools’ Law Bill backs the work being done by…",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_fixourhighstreet/content_19.html": "Fix Our High Street\nCheltenham’s High Street and Promenade has benefited from millions of pounds of investment in new paving in recent years. But when expensive paving slabs break, they’re replaced by tarmac. Local representatives were told that this would end with the installation of the new paving outside John Lewis. But even this expensive new paving has been repaired to low standards with tarmac.\nMax Wilkinson MP says this ‘cow-patting’ approach to maintenance is an embarrassment to our town.\nThe County Council is primarily responsible for highways maintenance. The Borough Council has in the past paid for a higher quality of paving. The two authorities must work together on a solution, including bringing to a close any outstanding issues relating to the failure to have the John Lewis paving formally adopted as highway.\nBack Max’s campaign to sort out our High Street paving\nWe call upon the County Council as highways authority and our Borough Council to find a long-term solution to maintenance that preserves the look of our High Street, respects our town’s heritage, and looks after public money.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_raceweek/content_6.html": "Max on Race Week\nRace week brings huge investment to Cheltenham and sustains a lot of our local businesses. But it also presents challenges. Max has been working for years to clean up bad behaviour by a minority of racegoers.\nPublic Urination\nPublic urination is unacceptable, but in race week it has become rife. In 2023, Max launched the War On Wee to call on the police, local councils and racecourse to work together.\nSince then, a combination of extra temporary loos, the use of anti-pee paint and an award-winning high profile marketing and media campaign has helped reduce public urination.\nMax will continue to run the War On Wee. Cheltenham people shouldn’t have to put up with it.\nSEV Liscensing\nLicensing laws allow the bizarre practice of ‘pop-up’ sexual entertainment venues. An exemption supported by the Conservative government and retained by the new Labour government means that local people have no effective control over licensing during race week. A ban on sexual entertainment in race week is therefore impossible.\nMax is particularly concerned about the safety of the women working in unlicensed sexual entertainment premises and the limited powers of the Council to prevent them from operating.\nHe is campaigning in Parliament to close the loophole. He has brought the issue to the attention of the government and will keep the pressure on until the loophole is closed.\nWhatever your opinion on sexual entertainment, everyone agrees that a proper system without loopholes improves safety.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_localdemocracy/content_2.html": "Don't Let Cheltenham Lose Its Voice\nThe government’s plans for English Devolution will mean big changes for our local democracy. Max backs plans to remove power from Westminster and give it to regions and local areas. But there’s a risk that the government's new plans could rob Cheltenham of its historic voice.\nMax says that devolution must mean more power for local areas, not less. But under plans proposed by the local Conservatives, Cheltenham Borough Council will be abolished and merged into a county-wide Unitary Authority, placing the local centre of power in Gloucester. Meanwhile, a new regional Mayor will be given new powers – but the Conservatives on the County Council don’t even have a formal proposal on which region we should join.\nDon't Let Cheltenham Lose Its Voice\nMax is fighting to ensure power is kept as close to Cheltenham as possible. He is pushing to create a new Cheltenham Town Council, so that Cheltenham retains its historic voice, with significant powers and funding to run local cultural and heritage assets. He’s opposing us becoming part of one countywide unitary Council too. If you back Max’s plan to stop Cheltenham’s voice being taken away, back his campaign here.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_page-3/content_11.html": "Free To Be Who You Are\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nMax is Cheltenham's man in Westminster. Elected as our MP in July 2024, he is already hitting the ground running, campaigning for our town.\nLiving in Fairview with his wife and daughter, Max has helped Cheltenham make progress on issues ranging from affordable housing to the environment and the cost of living over a decade as a Councillor.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nKeep up to date with Max's work as your MP for Cheltenham.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_maxwilkinson_meetmax/content_3.html": "Max Wilkinson\nMax is Cheltenham's new Lib Dem MP\n- A decade of service to our town\n- Fighting for a fair deal for Cheltenham\n- Fixing our NHS and cutting the cost of living\n- A positive plan to get a fairer deal for Cheltenham\nWe need more MPs like Max - people who love Cheltenham and want to get things done for our town.\nPeople across Cheltenham backed local resident Max Wilkinson to be our new MP.\nMax Wilkinson is a well-known face around Cheltenham. He's served the town as a local councillor for more than ten years and lives in Fairview with his wife and daughter.\nMax worked as a journalist and moved to Cheltenham twelve years ago when he got a job on the local paper. His time as a reporter in Cheltenham deepened his love for the town, but also highlighted so many areas where things could be better, including housing and looking after our precious environment.\nDuring his decade of service to our town, Max helped Cheltenham make progress on issues ranging from affordable housing to the environment and cost of living. He is already deeply embedded in the community and he knows how this town works. He’s ready to hit the ground running as our new MP.\nMax was a local councillor until May 2024, when he stepped aside to focus on his campaign to become the MP. In his early years as a councillor, he led the fight for more affordable housing, leading to Cheltenham’s £180million investment in homes.\nHe spent two years fighting for our planet as Cabinet Member for Climate Change, leading on the introduction of a climate action plan and tough new rules on planning so we can get a better deal from developers.\nHe moved on to a role focused on the economy and wellbeing. In that role, he worked closely with our arts and culture sectors and worked on a new plan to enhance the prosperity of our High Street. Max also worked on the cost of living, securing more money for food banks and support for food bank users.\nMax's CV - A record of action for Cheltenham\nParliamentary candidate – Cheltenham Liberal Democrats\nCabinet Member for Economic Development, Culture, Tourism and Wellbeing May 2022 - 2024\n- Working on high street prosperity\n- Working on health and well-being including projects with the NHS and launching the new Leisure for All leisure centre concession card for foodbank customers\n- Member of Cheltenham Culture Board, including saving Cheltenham Paint Festival\nCabinet Member for Climate Emergency Sept 2020 - May 2022\n- Leading on climate emergency action plan to shape our town's journey to Net Zero by 2030\n- Initiating and leading on new green planning guidance and the Connecting Cheltenham Report, a strategy for sustiainable travel across our town\n- Helped to deliver Cheltenham’s first carbon neutral council houses\nCheltenham Borough Council Councillor 2014 - 2024\n- Successfully led campaign for investment in affordable housing, resulting in £180million investment for local families\n- Introduced climate emergency declaration and ran public forum to inform future policy\n- Introduced motion to declare Cheltenham a Town of Sanctuary for refugees and those in need\n- Was the first ever Walking and Cycling Champion for Cheltenham\n- Represented diverse communities across the town\n- Campaigning for Cheltenham General Hospital and our A&E department\nCommunications consultant 2014 - 2021\n- Community relations on large infrastructure and planning projects in the public and private sectors\nEducational communications officer 2012 - 2014\nI'm backing Max Wilkinson\nShow your support for Cheltenham's Lib Dem MP Max Wilkinson.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_joolslaw/content_21.html": "Back Jools' Law\nCheltenham MP Max Wilkinson has launched a new push to support bereaved parents seeking answers from social media giants.\nHis Jools’ Law Bill backs the work being done by Cheltenham resident Ellen Roome, whose son Jools Sweeney tragically took his own life aged just 14.\nMax’s Bill would give parents automatic access to their deceased children’s social media accounts – a key request from Ellen and other parents in the Bereaved Families for Online Safety group. Parents currently face out-of-date regulations and other barriers when they seek access to their deceased children’s social media accounts.\nEllen’s son Jools tragically took his own life in 2022.\nIn her search for answers, Ellen found she was blocked from accessing her son’s accounts by the social media giants. She has since campaigned for a change in the law to give parents this right if their child has died, as well as for other action to give children protection on social media.\nMax Wilkinson MP has tabled the Social Media (Access to Accounts) Bill on Ellen's behalf, joining this campaign. You can show your support by signing the petition below.\nBack Jools' Law\nWe the undersigned back Max Wilkinson's Jools’ Law Bill to support parents in battle with social media giants.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_sunshinebill/content_13.html": "Back My Sunshine Bill\nSolar Generation for our generation\nBack Max's Sunshine Bill\nMax Wilkinson MP's Private Members Bill calls for developers to put solar energy generation equipment on new homes - saving you money, and saving the planet. Support his bill by signing below.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_news/content_9.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_environment/content_18.html": "Max's Plan to tackle the climate crisis\nMax has a strong record of action from his time as a Councillor, where he led Cheltenham in being the first Council to declare a climate emergency, established the Cheltenham Green Deal, and set up the Council's dedicated climate change department. He is building on this record as Cheltenham's MP and has wasted no time in pushing the government to go further on tackling climate change. After joining Parliament as an MP, one of Max’s first actions was to join a cross-party group of MPs campaigning on the environment.\nThe Sunshine Bill\nThe Sunshine Bill is a simple measure that will make a huge difference. Max was lucky enough to win a ballot to try and change the law.\nHe developed the Sunshine Bill, which will mandate all new homes are built to include solar generation\ntechnology as standard. Powering our homes with renewable technology will help bring bills down for homeowners and make our homes better for the planet. It's a win-win.\nPolling shows it is a popular policy - 74% of people back it.\nYou can support the Sunshine Bill too. Sign Max’s petition backing the Sunshine Bill here.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_donate/content_16.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowPolitics is a mess and the current government is a disgrace. Only the Liberal Democrats have the vision to get through this crisis. The next general election, whenever it arrives, will be a fight for a more liberal, internationalist and tolerant future. If I’m going to win, I need your help to deliver our message across the constituency. No donation is too big or too small, so please give what you can.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_page-1/content_5.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nMax is Cheltenham's man in Westminster. Elected as our MP in July 2024, he is already hitting the ground running, campaigning for our town.\nLiving in Fairview with his wife and daughter, Max has helped Cheltenham make progress on issues ranging from affordable housing to the environment and the cost of living over a decade as a Councillor.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nKeep up to date with Max's work as your MP for Cheltenham.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_page-4/content_17.html": "Britain must lead on defence and aid\nThe UK needs to strengthen both our Armed Forces and our soft power.\nMax is Cheltenham's man in Westminster. Elected as our MP in July 2024, he is already hitting the ground running, campaigning for our town.\nLiving in Fairview with his wife and daughter, Max has helped Cheltenham make progress on issues ranging from affordable housing to the environment and the cost of living over a decade as a Councillor.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.\nKeep up to date with Max's work as your MP for Cheltenham.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_contactmax/content_22.html": "Contact Max\nMax Wilkinson is your MP for Cheltenham. Working for you all year round, not just at election times.\nContact Max Wilkinson MP\n✉️ For Max Wilkinson, 16 Hewlett Road, Cheltenham GL52 6AA\nHelpful contacts\nOther sources of help and support.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org/content_1.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nMax is Cheltenham's man in Westminster. Elected as our MP in July 2024, he is already hitting the ground running, campaigning for our town.\nLiving in Fairview with his wife and daughter, Max has helped Cheltenham make progress on issues ranging from affordable housing to the environment and the cost of living over a decade as a Councillor.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nKeep up to date with Max's work as your MP for Cheltenham.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_winterfuel/content_10.html": "Max is fighting against Winter Fuel cuts\nLiberal Democrat MP for Cheltenham, Max Wilkinson, has backed a motion in Parliament to block government plans to scrap Winter Fuel Payments for most pensioners.\nA typical pensioner household faces a £670 hit this winter, through rising energy bills, the end of the Pensioner Cost of Living Payment and the Government’s withdrawal of universal Winter Fuel Payments.\nIf passed, the Liberal Democrat motion would protect local pensioners by blocking the government’s changes and restoring their winter fuel payments. It is set to be tabled as soon as Parliament returns next week and has been backed by all 72 Liberal Democrat MPs.\nAcross the country, 11 million pensioners are set to lose their winter fuel payment under the government’s plans, including two million that the charity Age UK has said will struggle to afford their energy bills as a result. This is despite the average energy bill being set to rise by £149 a year from October.\nThe Liberal Democrats are urging the government to think again to protect poorer and more vulnerable pensioners from being forced to choose between eating and heating this winter.\nAn estimated 800,000 pensioners aren’t claiming the Pension Credits that they are entitled to, the means-tested benefit that will be the new cut off for Winter Fuel Allowance payments. You can find out if your eligible by going to: www.gov.uk/pension-credit\nProtect the Winter Fuel Allowance\nI/We the undersigned call on the Government to scrap the proposed cuts to Winter Fuel Allowance.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_campaigns_ilkinson_gpsurgery/content_8.html": "Cheltenham Needs A New GP Surgery\nBack Max's campaign for the local healthcare we deserve\nCheltenham’s Conservative MP previously announced plans to bring back 24/7 doctor-led A&E at Cheltenham General and improve GP services. As I speak to residents across Cheltenham, facing ever-longer waits for appointments and basic services, they're asking me what went wrong.\nDemand for appointments is increasing because of failures elsewhere in the healthcare system. Local surgeries have warned that GPs are working long hours without breaks.\nThat's why I'm launching this campaign: local people deserve better than these Tory failures on the health service.\nI'm in discussions with our local health service and have called on local councils to put this project on their infrastructure funding list.\nWill you sign my petition to help show local health bosses that Cheltenham needs a new GP surgery?\nBack Max's Campaign for a new GP surgery\nA new GP surgery is needed in Cheltenham to help people get quicker appointments to see their doctor. Back my campaign to secure the funding we need for the health service we deserve.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_campaigns_ilkinson_nhs/content_15.html": "Max's Plan for our NHS\nThe NHS has been a top priority for Max since his first day as Cheltenham’s MP.\nHe’s fighting for a fair deal after the Conservatives left the NHS in a mess.\nMaternity Services\nFixing our local NHS has been Max’s top priority since being elected and he has led to build a cross-party consensus on a solution in Westminster. Max is committed to supporting the Government and the NHS to see these services reinstated. He has now received assurances that the NHS is working hard to reinstate maternity services safely with a new recruitment plan. He will keep the pressure up, fighting for the maternity service Cheltenham deserves.\nA New GP Surgery\nCheltenham has long needed a new GP Surgery to meet the demands of the growing population. Max has made protecting local NHS services his top priority as Cheltenham’s MP.\nToo many people are left struggling on NHS waiting lists and more GPs will help more people get the help they need. Max is pushing the government to improve GP recruitment plans so that more GPs are available\nto meet local demand in Cheltenham.\nAn A&E for Cheltenham\nThe A&E department was downgraded from a 24/7 doctor-led service to an overnight nurse-led service in 2013. The previous two MPs fought to overturn the downgrade, but the service remains as it was in 2013, with some associated services salami sliced away.\nMax's first action as MP was to call the Chief Executive of the local NHS to discuss Cheltenham’s hospital, specifically the A&E department. Max is opposing further downgrades to the service and has won agreement from local NHS bosses that consultation on any changes will be more accessible and locally focused in future.\nNothing is more important to me than protecting our NHS and making sure people get help when they need it.\nMax Wilkinson MP",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_campaigns/content_14.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_maxwilkinson_org_/https_www_maxwilkinson_org_economy/content_20.html": "Max's Plan for our economy\nCheltenham is a thriving town at the heart of the national picture for arts and culture\nMax is fighting for economic opportunities for our town, ensuring that the benefits of growth are felt by the people of Cheltenham.\nHospitality\nAs the Festival Town, Cheltenham relies on its hospitality sector. Cafes, bars, pubs and restaurants provide thousands of jobs in the town and bring millions of pounds to the local economy. But they have been hit hard in recent years by the pandemic, cost of living crisis.\nMax is determined to fight their corner and get a fairer deal for these businesses. Max has called for reforms for business rates and has raised solutions to help smaller businesses.\nHospitality businesses are the backbone of Cheltenham’s local economy, and Max is committed to fighting for a fairer deal for them.\nThe Golden Valley\nMax is backing the Golden Valley development to support the development of Cheltenham's cyber industry, which is driving Cheltenham’s economy.\nCheltenham has the largest number of cyber businesses outside of London and is home to GCHQ. The town is a national hub of cyber technology and Max is campaigning to bring investment in to make it a success, backing local Lib Dem plans.\nSince being elected, Max has championed Cheltenham's cyber industry. In his first week in Parliament, he questioned Ministers about funding for the Golden Valley after the Conservatives failed to deliver on their promises to the town.\nMax made the case repeatedly, before a £20 million grant was confirmed by the new government. He has\nraised Cheltenham’s cyber future with Ministers regularly, gaining recognition for the local sector and CyNam.\nHe is a founding member of the Cyber Innovation group of MPs and will ensure this platform is used to support Cheltenham’s cyber businesses at every opportunity.\nHousing\nCheltenham is one of the least affordable places to live in our region. While not everybody struggles, the system works for very few of us. And lack of affordability means local businesses and public services find it harder to recruit.\nAs a Councillor, Max led the campaign to ensure Cheltenham invested more in affordable housing for local people, resulting in the town's £180m investment plan. Now as an MP, Max is campaigning to raise the standard of new homes with the Sunshine Bill, which will mandate solar energy generation in all new builds.\nIt's a win-win saving homeowners on their energy bills while making our homes better for the planet.\nTown Centre Action Plan\nHigh streets across the country are struggling after a difficult few years. In Cheltenham, there are many empty units in the town centre which could be put to better use.\nBefore he was elected, Max pioneered the empty shops report. This aims to fill empty premises, take enforcement against the owners of dilapidated shops and ensure that we repurpose underused spaces to meet Cheltenham’s housing demand.\nBoosting the housing supply in the town centre will help young people get on the property ladder while bringing\npeople closer to the shops, helping the businesses in and around the high street. It’ll help us preserve green spaces too."
}