{
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_campaigns_shore-wind-farms/content_9.html": "Dear Constituent,\nThank you for your correspondence regarding on-shore wind farms.\nThis debate seems to have re-opened yet again, but it is only just a few years ago that we dealt with a proposal for a massive on-shore windfarm at Hemswell.\nThat plan would have blighted many of our beautiful views across Lincolnshire and threatened the dominance of the great crossing tower of Lincoln Cathedral. People were pessimistic about our chances, but we managed to defeat it.\nBy all means, renewable energy has a central role to play in generating electricity for Lincolnshire and for the United Kingdom. Since 2010 the renewable infrastructure for energy generation has expanded massively, and these environmentally friendly systems are now providing us with a greater proportion of our electricity than ever before.\nWe already have a highly successful record in off-shore wind energy that I do not see any reason why we should re-visit our previous battle by trying to impose massive fields of on-shore wind turbines on local communities.\nWe’re already having enough of a battle to keep solar farms from taking up our valuable and productive agricultural land. We should keep solar on brownfield sites and on rooftops, keep wind farms offshore, and foster a diversity of modes of cheaper and cleaner energy production – including nuclear – to keep Britain going.\nThank you for taking the time to write to me.\nYours,\nEDWARD LEIGH MP",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk/content_1.html": "Sir Edward Leigh MP\nWelcome to my website. I am the Conservative Member of Parliament for the Gainsborough constituency.\nHere you can read my most recent news and find out about my work as an MP, whether in Parliament or in the constituency. I am here to help everyone of the inhabitants of the Gainsborough constituency. I am at your service!",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_parliament/content_13.html": "Tweet You can read Sir Edward Leigh's latest speeches and appearances in Parliament below (provided by theyworkforyou):-\nParkinson’s Awareness Month | Backbench Business | Commons debates The hon. Gentleman must be congratulated on bringing forward this most important debate.\nBritish Steel | Commons debates Let me ask a question on behalf of my constituents who have sweated blood to keep the blast furnaces going.\nBritish Steel | Commons debates Let me ask a question on behalf of my constituents who have sweated blood to keep the blast furnaces going.\nUkraine Update | Commons debates What worries me is that President Putin has said he will not accept NATO troops on the ground.\nUkraine Update | Commons debates What worries me is that President Putin has said he will not accept NATO troops on the ground.\nSteel Industry (Special Measures) Bill | Commons debates I have just come off the phone to Tom Smith, the trade union convenor at the blast furnaces, on behalf of my many constituents who work ne",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_gainsborough-constituency/content_11.html": "The Gainsborough Constituency was created for the 1885 general election, after the extension of the franchise through the Representation of the People Act 1884 and the reorganisation of constituencies through the Redistribution of Seats Act 1885. From 1983, it was named Gainsborough & Horncastle Constituency. The modern Gainsborough Constituency was formed in 1997 when the constituency reverted to being 'Gainsborough' following boundary changes, which resulted in the loss of Horncastle.\nThe constituency is entirely within Lincolnshire and has a total population of 81,596. The main population centre is the town of Gainsborough, secondary to this is the village of Welton, to the north of Lincoln. The constituency also includes the market towns of Wragby, Market Rasen and Caistor and the various villages and rural communities of the West Lindsey District. The constituency also comprises a number of villages and rural communities of the Wragby ward of the East Lindsey District.\nSir Edward Leigh was first elected to represent the people of the Gainsborough constituency in the general election of 1983. At the 2017 general election, Sir Edward was re-elected with 31,790 votes (a majority of 17,023) out of 51,575 votes cast.",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_campaigns_workers-rights-after-brexit/content_19.html": "Dear Constituent,\nThank you for contacting me about workers’ rights.\nI was disturbed by the rumoured rollback of workers’ rights that the left-wing press has been peddling. These untruths play on the fears of often very vulnerable people with the aim of creating an atmosphere of distrust.\nThe Government has at all times proclaimed its commitment to maintaining and enhancing workers’ rights following our departure from the EU. The Secretary of State for Business has made clear that the Government has absolutely no intention of lowering the existing protections and standards for workplace safety and employment. On the contrary, he expressed a desire to protect and enhance workers' rights going forward.\nA review into how best to deliver workers’ rights had been planned, but with all that the Government is having to deal with it has understandably been scrapped.\nUltimately, the UK has one of the best records on workers’ rights in the world, going further than the EU in many areas, and I am determined to build on this progress.\nThank you again for taking the time to contact me.\nYours,\nEDWARD LEIGH MP",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_news_tea-hackthorn/content_12.html": "We had an excellent tea at Hackthorn Village Hall today.\nMy thanks to all the wonderful volunteers and guests who attended.\nVillage halls are the lifeblood of so many of our Lincolnshire communities and they rely on a steady stream of people to keep them going and organise events.\nWe mustn't take them for granted!",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_news_sir-edward-save-our-scunthorpe/content_16.html": "The House of Commons was recalled today to deal with measures to keep the blast furnaces going at Scunthorpe. The text of my speech in the debate is below and you can view the video of my contribution in a Twitter thread here.\nI have just come off the phone to Tom Smith, the trade union convenor at the blast furnaces, on behalf of my many constituents who work next door in Scunthorpe. My primary concern today is with the nearly 3,000 people who work in this plant. Let us be clear: we have been making the best quality steel in the world for 135 years in Lincolnshire, and we intend to go on doing it. We are not going to allow cheap, inferior Chinese steel to kill off our industry. The workers of Scunthorpe are breathing a sigh of relief.\nWe can be party political. I have to say that I thought the Chairman of the Business and Trade Committee made an excellent speech—he was positive and talked in strategic terms—but I do not know what the Liberal Democrat spokesman, the hon. Member for St Albans (Daisy Cooper), achieved by constantly attacking the Conservative party on what is a very complex issue. Of course we can be criticised because we sold this company to Jingye—yes, I agree—but how many voices on the Liberal Democrat Benches were speaking up at the time? Were they speaking up when Greg Clark, our then Business Secretary, paid the wages of the Scunthorpe steelworkers for many months? Were they speaking up when we saved Sheffield Forgemasters? This is a highly complex issue and we should be working together, so I support the Bill.\nI know that we can be critical of the Government. Perhaps we should have acted sooner—my hon. Friend the Member for Brigg and Immingham (Martin Vickers) has been raising this point; I was sitting beside him at the end of March when he raised it and called for nationalisation of the industry—but we have now got to work together to save our steelmaking capacity.\nWe know, though, that this Bill is a bit of a sticking plaster. It is quite dangerous. Quite extensive powers are being taken by the Government, so there has to be a sunset clause. We are giving unprecedented powers to the Government. We can criticise them for not acting sooner, but this is a sticking plaster on a gaping wound.\nLet us be honest: steelmaking in this country is under extreme stress. And why is that? Why are we loading the most expensive energy costs on to our own steel production? Why is Scunthorpe paying almost twice as much in energy costs as those in South Korea or in America? High energy prices make UK steel expensive to produce and uncompetitive versus that produced by our European counterparts. In 2024-25, the average price paid by UK steelmakers was £60 a kWh, compared with the German price of £50 and the French price of £43. We are making our own steel industry uncompetitive. We have to stop these green energy costs. We have to be realistic. The Secretary of State for Energy Security and Net Zero has now left, but we need to get real. We can take steel into public ownership now, but if we go on loading costs on our industry, we will have to come back month after month and year after year.\nWe will support the Bill, although we want a sunset clause. But we have to get real about China, too. Was it not obvious for weeks and, indeed, for months? This is a so-called private company, but there is no such thing as a private company in China. They are all under the cosh of the Government, under an autocratic regime. What do they care about the steelworkers in Scunthorpe? What do they care about our national interest? Never again, colleagues, must we allow such a strategic industry to fall into the hands of the Chinese, the Russians or anybody else.\nWe now know the true nature of our Chinese friends. We support the Bill. Let us make our steel industry really competitive again and let us make Great Britain great again.",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_business-and-trade/content_14.html": "On this page you will find campaign responses related to the Department of Business and Trade. The department is responsible for:\n- business\n- industrial strategy\n- science, research and innovation\n- energy and clean growth\n- climate change\nCampaigns\nSee Also",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_campaignresponses/content_4.html": "Because of the high volume of mass campaign emails I now receive it is no longer possible for me to respond to each one of them individually, as I would prefer.\nInstead, responses to campaign emails are posted here, the most recent appearing at the top of the list below. On the lefthand menu you will see listed government departments, responses are grouped onto these pages. If you can't find what you are looking for please try the search function by clicking here.\nSometimes it may take a week or two to get a campaign response up, so please check back to see if one has been posted.\nConstituents who write to me personally will be answered to by letter, as mentioned on the contact page.",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_cookies/content_3.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_accessibility/content_7.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_campaigns_cats-are-family-too-campaign-kept-animals-bill/content_8.html": "Dear Constituent,\nThank you for contacting me about cats and the Animal Welfare (Kept Animals) Bill.\nThe United Kingdom has some of the highest animal welfare standards in the world and we should what we can to protect our world-leading standards. The Animal Welfare (Kept Animals) Bill will bring in some of the world’s strongest protections for pets, livestock, and kept wild animals.\nThe Bill includes new restrictions on pet movements into Great Britain, which covers the non-commercial movements of cats, as well as dogs and ferrets. The Bill also contains powers to restrict the import of cats, dogs and ferrets on welfare grounds.\nIn August 2021, the Government launched an eight-week consultation on proposed restrictions to the commercial and non-commercial movement of pets into Great Britain. This consultation proposed to maintain the existing requirements for cats as there is currently limited evidence of a significant illegal trade in cats or significant numbers of low welfare movements.\nThe Bill includes a new offence of taking and detaining a dog in response to a recommendation made by the Pet Theft Taskforce. The offence, which was added to the Bill at its Commons Committee stage, is initially limited to the abduction of dogs in recognition of the Taskforce's finding that seven out of 10 pet abductions in England and Wales involved dogs. The Bill also includes a power to extend the offence to other pets, including cats, if necessary. The Government listened to the views expressed at Committee Stage and is considering the issue carefully.\nThe Bill was carried over into the 2022-23 parliamentary session and will return to the House as soon as parliamentary time allows.\nThank you again for taking the time to contact me.\nYours,\nEDWARD LEIGH MP",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_news_category_European-News/content_18.html": "In Strasbourg: We Must Stop the Boats 25th April 2023 Today I spoke at the Council of Europe in Strasbourg. I warned that unless the European Court of Human Rights returns to the original Convention and gives up... European News\nSir Edward Welcomes Government Support for Ukrainian Refugees 2nd March 2022 Sir Edward Leigh, the Conservative Member of Parliament for Gainsborough, has congratulated the Government for plans to welcome as many as 200,000 Ukrainian... European News\nThe Prime Minister is Right 29th August 2019 The Prime Minister is right – both politically and constitutionally – in seeking the prorogation of Parliament. The outrage about No Deal is bogus: the... European News\nIndicative Votes 2nd April 2019 Many constituents have written in asking how I've voted in the numerous indicative votes that have been placed before us in the House of Commons recently. I... European News\nConstructive proposal on limiting the backstop 7th February 2019 In the hope of ensuring we leave the European Union on time I have shared with Conservative colleagues and members of the DUP what I hope is a constructive... European News",
  "http_www_edwardleigh_org_uk_/https_www_edwardleigh_org_uk_search/content_5.html": "Today I visited Tennyson Wharf Care Home in Burton Waters.They were marking the tenth anniversary of the home with a party — it was great that ABBA turned up to sing to us!\nToday I was in Caistor canvassing local residents.I was joined by our Lincolnshire mayor candidate Rob Waltham and County Councillor Tom Smith.They are working hard to preserve what we love most about Lincolnshire and make it a better place as well.There is a lot of work that needs to be done.\nThe Government has taken measures to help British Steel keep going.I believe we need to keep the blast furnaces operating and maintain our ability to make virgin steel.Electric arc technology is simply not good enough.My constituents have sweated blood to keep the blast furnaces going.I asked the Go\nSir Edward Leigh, the Conservative Member of Parliament for Gainsborough, has condemned the Home Office’s confirmation that it will put the former RAF base at Scampton on the open market.Dame Angela Eagle MP, the Minister for Border Security & Asylum, wrote to the local MP to inform him that the\nI had a question to the Foreign Secretary today.I told him I am a simple soul so I trust him completely.I asked him to assure me that nothing in the Product Regulation and Metrology Bill which we're debating this afternoon would in any way nullify Brexit by limiting our deal to make our own decision\nWe had an excellent tea at Hackthorn Village Hall today.My thanks to all the wonderful volunteers and guests who attended.Village halls are the lifeblood of so many of our Lincolnshire communities and they rely on a steady stream of people to keep them going and organise events.We mustn't take them\nThe Minister of State for Industry was called to the House to answer an Urgent Question regarding the Scunthorpe steelworks.I asked her:Scunthorpe neighbours my constituency, and many of my constituents who work there will be desperately worried today. This is a vital national interest—a crisis.\nHere in Lincolnshire we are blessed to have the amazing St Barnabas Hospice to look after people at the end of their earthly lives.They do so with care, kindness, and devotion.Unfortunately the Government's decision to increase National Insurance contributions has hit them very badly.When I visited,",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_campaigns_fuel-poverty-and-cold-homes/content_22.html": "Dear Constituent,\nThank you for contacting me about improving home energy efficiency and tackling fuel poverty.\nImproving the energy efficiency of existing homes will play a critical role in delivering the UK’s greenhouse gas emission reduction targets, including net zero by 2050 as well as lifting households out of fuel poverty.\nLet me be clear, no-one should be struggling to afford to keep their home at a reasonable temperature in a modern society, and although we have seen progress toward this goal, there is still so much my colleagues and I can do to make this a reality.\nOne of the principal ways in which we can tackle fuel poverty in the long-run is to improve the energy efficiency of homes. In the Clean Growth Strategy, the Government set out its aspiration for as many homes as possible to be Energy Performance Certificate Band C by 2035 where cost effective, affordable and practical, and to reach this standard by 2030 for fuel poor homes. I am glad that the Government has set interim milestones for England to improve as many fuel poor homes as is reasonably practicable to a minimum energy efficiency rating of band E by 2020, band D by 2025, and band C by 2030, in line with the UK's 2030 fuel poverty target for England.\nWork is already underway to make as many homes as possible reach Energy Performance Certificate (EPC) Band C by 2035 where practical, cost-effective, and affordable.\nHouseholds struggling with their bills are eligible for insulation measures, including solid wall insulation, through the Energy Company Obligation (ECO) scheme. Homeowners and those in privately rented homes who are on specific benefits may also be eligible for support towards heating improvements, including oil-fired boiler replacements, through ECO Affordable Warmth.\nThe Warm Home Discount is a key policy in the Government’s programme to tackle fuel poverty and the effects of rising energy prices on low-income households. Launched in April 2011, it has helped over 2.2 million low-income and vulnerable households, including individuals with a disability, each year with their energy costs. I am pleased that the Energy White Paper committed to extending the scheme to at least 2025/26 and the Government is committed to expanding the spending envelope from the current £351 million to £475 million (in 2020 prices) per year, to reach over 750,000 more households in, or at risk of, fuel poverty. Furthermore, later this year the Government will consult on reforms to the scheme from 2022 to better target fuel poverty.\nIn addition, the Government is boosting funding for the Social Housing Decarbonisation Fund (investing a further £800 million over 2022/23 to 2024/25) and Home Upgrade Grant (investing a further £950 million over 2022/23 to 2024/25), which aim to improve the energy performance of low income households’ homes, support low-carbon heat installations, help to reduce fuel poverty and build the green retrofitting sector to benefit all homeowners.\nElderly people are some of the most at-risk individuals when it comes to fuel poverty. Winter Fuel Payments are the largest benefit paid to pensioners, and will continue to be available to all pensioners. In addition to Winter Fuel Payments, Cold Weather Payments are available and the Warm Home Discount provides over one million vulnerable pensioners with a £140 rebate on their energy bills.\nThank again for taking the time to contact me.\nYours,\nEDWARD LEIGH MP",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_campaigns_minimum-service-laws/content_10.html": "Dear Constituent,\nThank you for your correspondence regarding minimum service laws.\nWorkers’ ability to organise and work collectively is a fundamental part of our free society and of a free market. Unfortunately, some sectors of the economy exercise an undue influence because so many of us are reliant upon them for a basic service.\nTrade union laws are designed to support an effective and collaborative approach to resolving industrial disputes. While the Government and I continue to support the right to strike, this should always be a last resort. As you may be aware, the Government is not responsible for decisions on pay. Well-established independent pay review process is the right way to set public sector pay – it provides independent, expert advice and is a neutral process in which all parties play a role.\nA balance must be struck between giving workers a fair and reasonable settlement and taking steps to continue to bring down inflation and protect households’ budgets. In this time of economic difficulties, inflation-matching pay awards that many of the unions are demanding will make the fight against inflation more challenging, risking interest rates, mortgage payments and bills rising for people as a result. This would erode the value of any pay increase for public sector workers and hurt households across the country.\nThe rights of some workers to strike must be balanced against the rights of the wider public to get on with their daily lives. Strikes can, and do, cause significant disruption. That is particularly the case when they take place in important public services such as transport or education. It cannot be right that trade unions can, as we saw in the case of the recent rail strikes, seek to hold the country to ransom if their demands are not met.\nThe Government has a duty to the public to ensure their safety, protect their access to vital public services, and help them go about their daily lives.\nThank you for taking the time to write to me.\nYours,\nEDWARD LEIGH MP",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_parliament-0/content_17.html": "On this page you will find campaign responses related to the House of Parliament - the House of Lords and the House of Commons.\nCampaigns\nSee Also\nOn this page you will find campaign responses related to the House of Parliament - the House of Lords and the House of Commons.",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_campaigns_retained-eu-law/content_21.html": "Dear Constituent,\nThank you for contacting me about the Retained EU Law (Revocation and Reform) Bill.\nThe European Union (Withdrawal) Act 2018 brought a large number of EU laws and regulation into our domestic law. This was called Retained EU Law (REUL), and had special status, reflecting the supremacy of EU law, European Court of Justice case law and EU legal principles. In September 2022, the Government introduced the Retained EU Law (Revocation and Reform) Bill. The Bill will abolish this special status and will enable the Government, via Parliament, to amend more easily, repeal and replace REUL.\nAs the Bill is currently drafted, almost all REUL is automatically revoked at the end of 2023, unless a statutory instrument is passed to preserve it. This is known as a ‘sunset’ provision. The Government has tabled an amendment for Lords Report, which will replace the current sunset in the Bill with a list of all of the EU laws that it intends to revoke under the Bill at the end of 2023. The remainder will continue in force without the need to pass extra legislation. By making it clear which regulations will be removed from our statute book, businesses and all those affected by these laws will have certainty. The Government will retain the vitally important powers in the Bill that allow it to continue to amend REUL, so more complex regulation can still be revoked or reformed after further assessment and consultation.\nAmendment 76 (the Hamilton-Hope amendment)) would impose a novel and untested scrutiny requirement on regulations made. The Government believes that the purpose of this Bill is to ensure that we have the right regulations in place which are right for the whole of the UK. I would like to reassure you that the Government will ensure that any significant retained EU law reforms will receive the appropriate level of scrutiny by the relevant legislatures and will be subject to all of the usual processes for consultation and impact assessment. However, the Government also believes that it has to ensure that the limited amount of parliamentary time that is available is used most appropriately and most effectively. Requiring that the powers be subject to additional scrutiny is neither appropriate nor necessary in this case.\nThe Government is committed to upholding workers’ and consumers' rights, as well as environmental protections, following the UK’s departure from the EU. The Working Time Directive has been transposed into UK law; our consumer protections will remain some of the best in the world; and the Government has recently legislated to strengthen environmental protection in the form of the Environment Act 2021.\nUnder the EU (Withdrawal) Act 2018, workers' rights have been retained in UK law. The Working Time Regulations regulations provide that, subject to certain exceptions where the nature of the work makes it impractical, employees cannot work more than 48 hours a week averaged, normally, over a period of 17 weeks. It is possible for employees, as it was before we left the EU, to opt out of this provision voluntarily and in writing, either indefinitely or for a specified period. Employers can request that an employee opts out but cannot terminate their employment or treat them unfairly if they decline. Under current EU law, the regulations also impose burdensome recording keeping and reporting requirements on employers, that do not add benefits to workers but impose significant costs to the business. That’s why the Government has announced that it will be consulting on alleviating these requirements, which could save businesses £1 billion without reducing the protections for workers.\nUltimately, the UK has one of the best records on workers’ rights, going further than the EU in many areas, and I am determined to build on this progress. By further protecting workers, supporting business to comply with the law, and preventing them from being undercut by a minority of irresponsible employers, the UK can continue to have a high-wage, high-employment economy that works for everyone as we build back better from the pandemic.\nThe Government provides 52 weeks of maternity leave, with the option to convert it to shared parental leave. In comparison, the EU requirement for maternity leave is just 14 weeks The right to flexible working for all employees was introduced in the UK in the early 2000s, whereas the EU agreed its rules only recently and offers the right only to parents and carers. The UK introduced two weeks’ paid paternity leave back in 2003, and the EU legislated for this only recently.\nI would like to reassert that women's rights have never been dependent on the UK's membership of the EU, nor will they be affected by the revocation of retained EU Law.\nCore consumer protections, as set out in the Consumer Rights Act 2015, remain unaffected by the REUL Bill. The Government will maintain its international commitments on consumer protection. The Government says it will bring forward proposals to address REUL that impacts consumer protection using the powers in the Bill or other available legislative instruments. The UK regime sets some of the highest standards of consumer protection in the world, and this will continue to be the case.\nThis Bill will benefit people and businesses across the United Kingdom and end the supremacy of EU law. What we want to see is meaningful reform which not only removes unnecessary red tape, but allows us to tailor regulation to our needs and for the UK to secure its own path. Already, over 1,000 laws have been revoked or reformed since Britain's exit from the EU. This Bill would revoke around 600 more and other legislation will revoke a further 500. The Bill now provides certainty for business by making it clear which regulations will be removed from the statue book, instead of highlighting only the REUL that would be saved. Crucially, the powers included in the Bill that allow us to continue changing REUL have been retained. As such, more complex regulation can still be revoked or reformed after proper assessment and consultation.\nFinally, you will be reassured to know that the Government remains committed to protecting the rights of passengers when travelling by air.\nThank you again for taking the time to contact me.\nYours,\nEDWARD LEIGH MP",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_news_keep-scunthorpe-open/content_6.html": "The Government has taken measures to help British Steel keep going.\nI believe we need to keep the blast furnaces operating and maintain our ability to make virgin steel.\nElectric arc technology is simply not good enough.\nMy constituents have sweated blood to keep the blast furnaces going.\nI asked the Government to make a clear commitment today to maintaining our permanent ability to make virgin steel.",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_about-rss/content_15.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_map-locations/content_2.html": "Skip to main content\nSir Edward Leigh MP\nMember of Parliament for the Gainsborough constituency\nMain navigation\nHome\nNews\nAbout Sir Edward Leigh\nAbout the Constituency\nCampaign Responses\nIn Parliament\nContact\nMy map",
  "http_www_edwardleigh_org_uk_/http_www_edwardleigh_org_uk_international-trade/content_20.html": "On this page you will find campaign responses related to the Department for International Trade. The department is responsible for:\n- bringing together policy, promotion and financial expertise to break down barriers to trade and investment, and help businesses succeed\n- delivering a new trade policy framework for the UK as we leave the EU\n- promoting British trade and investment across the world\n- building the global appetite for British goods and services\nCampaigns\nSee Also"
}