{
  "https_chrisdey_uk_/https_chrisdey_uk_2021_05_23_no-confidence-vote_comment-page-1/content_2.html": "I have zero confidence in Enfield Council especially after the shenanigans this week. The no confidence vote was an utter joke on Thursday. Members of the public who pay their Council Tax are understandably furious. I recorded this short film when I got home from the meeting on Thursday night. This captures the mood of the majority of reasonable Enfield residents.\nWe all know Enfield council has been taken over by a group of people to line their pockets & do dodgy deals for their friends. What happened to the parliamentary investigation???\nLikeLike",
  "https_chrisdey_uk_/https_chrisdey_uk_2020_11_19_will-enfield-go-bust/content_17.html": "At the meeting of The Full Council on November 18th, I challenged the administration on it’s £1bn of debt. The annual interest payments alone are £27m which is coming out of council tax revenue. The debt mountain will still be being paid off by our children and grand children. With Croydon going bust will Enfield be next under Labour’s mismanagement?",
  "https_chrisdey_uk_/https_chrisdey_uk_2021_11_18_council-meeting-nov-2021/content_8.html": "Council Meeting Nov 2021 My thoughts on last night and this out of control Labour Administration in Enfield Vlog 18/11/21 Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Related",
  "https_chrisdey_uk_/http_chrisdey_uk/content_10.html": "Chris Dey was elected as a Local Councillor in May 2018. Chris represents Grange Park Ward in the London Borough of Enfield. Chris was born in the borough at Chase Farm Hospital. Attending St Andrews Primary School in Churchbury Lane and then Bishop Stopford’s Secondary School in Brick Lane.\nGet in Touch\nCllr. Chris Dey\nEdmonton and Winchmore Hill Conservative Association, C/O 276 Baker Street, Enfield. EN1 3LD.\nm. 07971 672798\nSend me a message\nFollow me on Social Media:\nOn Instagram\nOn X\nPromoted by A. Mulvey of Edmonton and Winchmore Hill Conservative Association, c/o 276 Baker Street, Enfield. EN1 3LD\nCopyright Cllr. Chris Dey 2018 – All rights reserved",
  "https_chrisdey_uk_/https_chrisdey_uk_members-questions-answers/content_3.html": "Enquiry to me about the Splash Park in Enfield Town Park which I asked the relevant Officer to respond to. The Splash Park hasn’t been working all summer!\nDear Councillor Dey\nI apologise that the re-opening of the Splash Pads has been delayed and for the impact this is having on our communities. We have been working hard since April to get the borough’s five Splash Pads maintained and re-opened, however the extended period of closure due to the Covid-19 pandemic has exacerbated their condition and major repairs are required.\nThe essential repairs at Ponders End, Enfield Library and Durants Park were completed ahead of 15 August and the Splash Pads appeared to operate, however Enfield Library and Durants have failed again due to filtration faults that only presented after the initial repair.\nEnfield Town Park has a Pseudomonas contamination and needs a thorough chlorination disinfection and a water tank replacement. Chase Green has an unrelated power supply fault so we are working with UKPN to have this fixed.\nIn addition to the immediate repairs needed to re-open the Splash Pads, we are also considering substantial refurbishment of the Splash Pads at Enfield Town Park and Durants Park. If approved, this work may commence late 2022 and be ready for the 2023 summer season.\nYours sincerely,\nResidents Enquiry to me (Box Junction) Junction London Road/Silver St/The Town Aug 2020\nDear Cllr. Dey,\nAttached is a copy of a letter I have sent to NSL, who operate the Council’s parking enforcement. It relates to a PCN I received today, for infringing the box junction at the junction of London Road, Southbury Road, and Silver Street.\nWhilst I cannot deny, that I did stop on the box junction, as stated in my letter to NSL, I feel that enforcing the regulations, when clearly the flow of traffic is impeded, is somewhat harsh. Can you find out if the issue of PCN’s for this offence at this junction have increased since the introduction of the wider pedestrian paths, and if so by how much?\nThank you for your attention in this matter.\nYours Sincerely\nMy Question to Enfield Council\nDear Dept,\nI hope you are well?\nMr Cxxxxxxxx asks a fair question in my mind and I’d like to know the stats. Please can you arrange for the relevant officer to provide them to me?\nWith regard to the PCN I agree with the resident that enforcement is harsh when the carriageway has been halved to aid social distancing. Can the council look kindly on this situation and cancel the PCN under the current circumstances?\nMany thanks\nCouncillor Christopher Dey\nEnfield Council response\nDear Cllr Dey\nThank you for your enquiry on behalf of your constituent.\nThe enforcement of the box junction started at the beginning of 2020. This was implemented to help the traffic flow especially in Silver Street which would often tail back due to the exit by the Lloyds bank being blocked by traffic from London Road/Church Street.\nInitially we only enforced vehicles entering the box from London Road and not from Church Street. However, we saw a significant amount of contravening vehicles entering the box junction from the Church Street direction. This was implemented at the end of March but due to the Covid restrictions, the enforcement from both directions has only occurred in any significant numbers since the lockdown has eased.\nWe have seen a significant amount of non-compliance at this location, however whether this has seen an increase due to the social distancing measures in place is unclear. We will treat this motorist the same as all others, the issue of the PCN if appealed will be reviewed and cancelled/enforced as is necessary. If enforced, the motorist can take the matter to the Independent Adjudication Service if they do not agree with the Council’s decision.\nFull July figures are not available yet as PCNs are still being processed:\nJan 318\nFeb 456\nMar 289\nApr 15\nMay 89\nJune 1276\nI trust the above information will enable you to respond to your constituent.\nMy letter to the releavnt Senior Officer\nDear xxxxxxxx\nI trust you are keeping well?\nThank you for getting this reply send to me. Please can I ask that you review this situation?\nThere was a post about this junction on Love Your Doorstep, Enfield last week and reading through the comments lots of residents have been caught out.\nI quite agree that people travelling from Silver St or Church St can see into the junction and shouldn’t enter the box until it is clear and deserve a PCN if they do so. However as the road has been narrowed to aid social distancing people turning right from London Road can’t see round the corner. Motorists set off when the lights change and then run into the traffic and have to stop in the box. I walked down to the junction the other day and saw the problem first hand for myself and I agree with residents.\nResidents are saying the Council has done this deliberately to earn extra money. While I realise that this isn’t true I can understand why many have formed this view. When you look at the figures for June three times more residents have been issued with PCN’s than in Jan before the pavements were temporarily widened.\nDue to the number of residents who have been penalised, quite unfairly in my opinion, can I suggest that we temporarily stop issuing PCNs for vehicles who are turning right out of London Road? Obviously this can resume when the roads are returned to usual. They can’t reasonably see around the corner and with normal traffic flow i.e. one lane closed to widen the pavement this wouldn’t be an issue. Furthermore can the Council cancel and refund any PCNs issued to people who have turned right from London Road.\nPerhaps go and look at the junction yourself, only a short walk from the Civic, and let me know what you think?\nKind regards\nA further letter to the Director of the Environment and Executive Director of Place send Saturday 22nd August 2020.\nI hope you are well?\nThank you for getting David Morris to respond to me regarding this issue. I am not happy with the response and I don’t think my requests with regard this matter have been taken at all seriously by officers.\nIt is clear that PCNs have increased by at least 2/3rds from Feb, before lockdown, to June once the lane narrowing has been implemented. We await July’s figures! I was hoping my earlier e-mail to you would have brought about a change in thinking and some sensible review of PCNs issued. At the time I could understand that the measures had been implemented in a hurry and the impact of these not thought through. What I am finding impossible to reconcile is that now I have flagged this the Council is continuing with the same approach.\nI can 100% understand why residents are feeling this is deliberate trap set by the Council to fleece them of their hard earned cash. I have been reassuring residents this isn’t the case. However after my involvement as there has been no change you can understand why they have formed their opinions accordingly.\nPlease can I ask once again that while the temporary lane reductions remain in place that the Council;\ni) carefully assesses each PCN before it is issued. Choosing not to issue them to motorists who enter the junction from London Road. These motorists would reasonably expect to be able to make the turn without having to stop in the box.\nii) That all PCNs issued since the installation of the temporary lane reductions are reviewed and those issued to motorists entering the junction from London Road are cancelled and refunded.\niii) Mr Carter’s points below are given consideration\nAs you know I fully support the council fining selfish motorists who deliberately block the junction for other road users but I feel a total sense of injustice as to how this is being handled.\nI have now copied in Sarah too so that this matter can also be on her radar, it isn’t going away. There continues to much outrage by hundreds of residents on Love Your Doorstep on this specific matter.\nI look forward to hearing your thoughts on the matter.\nKind regards\nChris\nCouncillor Christopher Dey\nMember for Grange Ward\nLondon Borough of Enfield\n📧 cllr.chris.dey@enfield.gov.uk\nFacebook: https://m.facebook.com/ChrisDey4Grange/\nTwitter: @chrisdey4grange",
  "https_chrisdey_uk_/https_chrisdey_uk_2021_09_08_destruction-of-the-green-belt/content_4.html": "Destruction of the Green Belt Enfield’s Labour run Council wants to concrete over our Green Belt. Watch this short video in which I speak out against these disastrous plans. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Related\nCllr Chris Dey Why not get supermarkets to build flats above their stores like Tesco did in Woolwich. There are plenty of supermarkets throughout the country where we need housing. LikeLike Reply\nCllr Chris Dey\nWhy not get supermarkets to build flats above their stores like Tesco did in Woolwich. There are plenty of supermarkets throughout the country where we need housing.\nLikeLike",
  "https_chrisdey_uk_/https_chrisdey_uk_2021_02_03_enfield-council-finance-chaos/content_15.html": "I held the administration to account for their appalling handling of the Council’s finances and their politically motivated letter to the Chancellor of the Exchequor.\nI held the administration to account for their appalling handling of the Council’s finances and their politically motivated letter to the Chancellor of the Exchequor.",
  "https_chrisdey_uk_/https_chrisdey_uk_blog/content_12.html": "Conservatives vote against Labour’s inflation busting Council Tax rise\nMy Conservative Colleagues and I strongly oppose Labour Enfield’s ‘robbery’ of Enfield residents had earned income in their inflation busting Council Tax raid.\nLabour vote to water down Scrutiny\nOn 15th May 2024 the Labour Party who rule Enfield Council voted to water down the important Scrutiny function. This is shameful and running away from being held to account by the opposition and the public.\nAs the first speaker for the Conservative opposition party this is what I had to say.\nA very sad day – The Destruction of Enfield as we know it\nTonight (19th March) the Labour Council voted through a disastrous draft local plan that, if enacted, will change the Borough forever. Labour plans to dedesignate huge swathes of Green Belt land, destroying the farmers fields by building all over them. Furthermore building concrete jungle tower blocks in every part of our borough.\nIt seems that nowhere will be safe from Labour’s clutches. I’m proud that each and every Conservative Councillor voted against Labour’s frightful plan.\nListen to what I had to say when I spoke up for my residents in the Council Chamber.\nEnfield Council – Budget Meeting 22nd February 2024\nI stood up for residents in Grange Park Ward and across the borough on Thursday 22nd February. I voted against Labour’s 5% Council Tax increase which means a resident in a band D property will pay over £2,000 of council tax for the first time ever. I also voted against the removal of Council Tax Support from the poorest and most needy residents of Enfield.\nLabour have trashed the Borough and are completely incompetent when it comes to money matters. £31m is being removed from front line services to pay their debt interest, 10% of their total revenue budget.\nHere what I have to say in the chamber in this short video…..\nEmergency Meeting of Enfield Council – February 2023\nThe debacle that has been the Labour Administrations handling of the Shires Estate is shocking and disgraceful. As ever they try and avoid scrutiny and attempt to blame the government for their failings. We, The Conservative Opposition, called an Emergency Meeting of the Council to stand up for the residents of The Shires Estate in Edmonton. Proud of all my colleagues who spoke on this tonight.\nLabour have made it into the National Press on this for all the wrong reasons and have damaged the reputation of Enfield Council as a result of their catastrophic failings.\nBudget Meeting of Enfield Council – February 2023\nTonight at the Budget Meeting Enfield Conservatives supported Government Policy to help pay for Adult Social Care through a 2% increase in Council Tax.\nWe then voted against Labour’s expensive additional 3% increase in ordinary Council Tax. Labour have totally mismanaged the money in Enfield and shouldn’t be charging Council Tax Payers more for their incompetence.\nStanding up for hard pressed tax payers.\nMeeting of Enfield Council – January 2023\nMy speech this evening in response to Enfield’s Labour Council trying to justify why they at £1bn in debt. Rapidly heading the way of Croydon and going bust.\nOctober Meeting of Enfield Council\nOn the 12th October Enfield Labour Party put forward an Emergency Motion on the Cost of Living. Instead of focusing on helping the people of Enfield, who we were all elected to serve they decided to bash the Government. I spoke on this motion, see the below video.\nTribute to Her Late Majesty Queen Elizabeth II\nMy Tribute to Her Late Majesty Queen Elizabeth The Great at the Special Meeting of Enfield Council on 21st September 2022",
  "https_chrisdey_uk_/https_chrisdey_uk_2020_10_01_full-council-30th-september-2020/content_7.html": "Sadly the Labour Party in Enfield used a motion at Council on September 30th to score cheap political points against the Government. What they should be doing is working with the Government to help fight this wicked disease. We will win the war on Coronavirus if we all follow the advice and support the Government. We are dealing with a International crisis and we need to unite as a nation to defeat this disease. I pointed this out to the administration in my speech which you can watch here.",
  "https_chrisdey_uk_/https_chrisdey_uk_2021_05_23_no-confidence-vote/content_19.html": "I have zero confidence in Enfield Council especially after the shenanigans this week. The no confidence vote was an utter joke on Thursday. Members of the public who pay their Council Tax are understandably furious. I recorded this short film when I got home from the meeting on Thursday night. This captures the mood of the majority of reasonable Enfield residents.\nWe all know Enfield council has been taken over by a group of people to line their pockets & do dodgy deals for their friends. What happened to the parliamentary investigation???\nLikeLike",
  "https_chrisdey_uk_/https_chrisdey_uk_2022_05_06_election-2022/content_9.html": "Election 2022 Thank you so much to the residents of Grange Park Ward who have re-elected Andy Milne and I as their Councillors. The results and acceptance speeches. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Related",
  "https_chrisdey_uk_/https_chrisdey_uk_author_cdey1/content_11.html": "Election 2022\nThank you so much to the residents of Grange Park Ward who have re-elected Andy Milne and I as their Councillors. Continue reading Election 2022\nThank you so much to the residents of Grange Park Ward who have re-elected Andy Milne and I as their Councillors. Continue reading Election 2022\nTonight at the meeting of the Full Council Meeting of the London Borough of Enfield I stood up for our local Enfield Residents. Continue reading Standing up for Enfield\nMy thoughts on last night and this out of control Labour Administration in Enfield Continue reading Council Meeting Nov 2021\nI have zero confidence in Enfield Council especially after the shenanigans this week. The no confidence vote was an utter joke on Thursday. Members of the public who pay their Council Tax are understandably furious. I recorded this short film when I got home from the meeting on Thursday night. This captures the mood of the majority of reasonable Enfield residents. Continue reading No confidence vote\nAt the full meeting of Enfield Council on 28th January 2021. We Conservatives stood up to this undemocratic rotten Labour administration. The Leader, Caliskan and her Deputy Leader, Barnes continue to impose their will on the people when a clear majority are opposed to their ideological LTN scheme. We ran out of time for my speech but below is what I would have said. Continue reading Council Dictatorship\nI held the administration to account for their appalling handling of the Council’s finances and their politically motivated letter to the Chancellor of the Exchequor. Continue reading Enfield Council Finance Chaos\nAt the meeting of The Full Council on November 18th, I challenged the administration on it’s £1bn of debt. The annual interest payments alone are £27m which is coming out of council tax revenue. The debt mountain will still be being paid off by our children and grand children. With Croydon going bust will Enfield be next under Labour’s mismanagement? Continue reading Will Enfield go Bust?\nWe used opposition priority business at the full meeting of Enfield Council on 30th September 2020 to hold the administration to account for their incompetence and inability to get Council services open again. Continue reading Enfield Council – Closed for Business\nSadly the Labour Party in Enfield used a motion at Council on September 30th to score cheap political points against the Government. What they should be doing is working with the Government to help fight this wicked disease. We will win the war on Coronavirus if we all follow the advice and support the Government. We are dealing with a International crisis and we need to unite as a nation to defeat this disease. I pointed this out to the administration in my speech which you can watch here. Continue reading Full Council – 30th September 2020",
  "https_chrisdey_uk_/https_chrisdey_uk_blog_some-short-videos/content_5.html": "Election 2022\nThank you so much to the residents of Grange Park Ward who have re-elected Andy Milne and I as their Councillors. Continue reading Election 2022\nThank you so much to the residents of Grange Park Ward who have re-elected Andy Milne and I as their Councillors. Continue reading Election 2022\nTonight at the meeting of the Full Council Meeting of the London Borough of Enfield I stood up for our local Enfield Residents. Continue reading Standing up for Enfield\nMy thoughts on last night and this out of control Labour Administration in Enfield Continue reading Council Meeting Nov 2021\nI have zero confidence in Enfield Council especially after the shenanigans this week. The no confidence vote was an utter joke on Thursday. Members of the public who pay their Council Tax are understandably furious. I recorded this short film when I got home from the meeting on Thursday night. This captures the mood of the majority of reasonable Enfield residents. Continue reading No confidence vote\nAt the full meeting of Enfield Council on 28th January 2021. We Conservatives stood up to this undemocratic rotten Labour administration. The Leader, Caliskan and her Deputy Leader, Barnes continue to impose their will on the people when a clear majority are opposed to their ideological LTN scheme. We ran out of time for my speech but below is what I would have said. Continue reading Council Dictatorship\nI held the administration to account for their appalling handling of the Council’s finances and their politically motivated letter to the Chancellor of the Exchequor. Continue reading Enfield Council Finance Chaos\nAt the meeting of The Full Council on November 18th, I challenged the administration on it’s £1bn of debt. The annual interest payments alone are £27m which is coming out of council tax revenue. The debt mountain will still be being paid off by our children and grand children. With Croydon going bust will Enfield be next under Labour’s mismanagement? Continue reading Will Enfield go Bust?\nWe used opposition priority business at the full meeting of Enfield Council on 30th September 2020 to hold the administration to account for their incompetence and inability to get Council services open again. Continue reading Enfield Council – Closed for Business\nSadly the Labour Party in Enfield used a motion at Council on September 30th to score cheap political points against the Government. What they should be doing is working with the Government to help fight this wicked disease. We will win the war on Coronavirus if we all follow the advice and support the Government. We are dealing with a International crisis and we need to unite as a nation to defeat this disease. I pointed this out to the administration in my speech which you can watch here. Continue reading Full Council – 30th September 2020",
  "https_chrisdey_uk_/https_chrisdey_uk_2020_10_01_enfield-council-closed-for-business/content_18.html": "We used opposition priority business at the full meeting of Enfield Council on 30th September 2020 to hold the administration to account for their incompetence and inability to get Council services open again.\nWe used opposition priority business at the full meeting of Enfield Council on 30th September 2020 to hold the administration to account for their incompetence and inability to get Council services open again.",
  "https_chrisdey_uk_/https_chrisdey_uk_the-next-m-p-for-enfield-north/content_13.html": "Thank you event\nOn the evening of Friday 19th July the volunteers and teams from across all three Enfield Conservative Associations gathered so that my fellow candidates and I could thank them all for their hard work.\nThe Result!\nThe result isn’t what I would have wanted both locally or nationally. However after a period of fourteen years in Government it is in part due to the electoral cycle where people feel it is time for the other side to have a go.\nI would like to thank the 8,632 who voted for me and am eternally grateful that the Conservative Party were not relegated to third or even fourth place as we have been elsewhere. The full results can be found here on the Enfield Council website .\nI would also like to take this opportunity to thank several people. Firstly my Agent, Mark Bellas, who worked tirelessly in our campaign headquarters producing literature. My office also responded to thousands of emails asking for my views on all sorts of topics, from the situation in the middle east to cats protection. Mark and his team ensured that each one received a response. Then to my Association Chairman, Penny Heathwood, for her unstinting support and warmth throughout the campaign. To our fabulous team of campaigners across Enfield North and to all those who displayed a poster, stuffed envelopes, delivered leaflets, knocked and doors or who made financal donations to my campaign. Special mention to my Parent’s, Margery and Tony, for their support and encouragement and for their generous donation to my campaign funds.\nIt feels somewhat strange to be waking up to a Labour Government and reading the papers filled with details of who has been appointed into Sir Kier’s first cabinet. The results show that there is not an overwhelming desire for this Labour Party. With just 34% of the vote share Labour have ended up with 63% of the seats in Parliament, as more eletors chose smaller parties splitting the vote and in so doing allowing Labour Candidates to win. There isn’t a majority for their manifesto so the Labour Government must now govern in the national interest.\nAs a Councillor here in Enfield I will continue to apply pressure to our utterly useless Labour controlled Council to clean up our filthy Borough. I will continue to fight to save our precious Green Belt and I shall hold our M.P. Feryal Clark to her word in the hustings that the Green Belt should not be released until all the brown field sites have been exhausted.\nMy team and I spent the vast majority of our time in Chingford and Woodford Green campaigning incredibly hard for Sir Iain Duncan Smith. I am therfore delighted that he has been returned as the Member of Parliament. I got to know Iain well over the last six weeks and I know he will a strong voice in Parliament not just for his constituency but for London. He will also help us all stand up against the total distaster that is a the Mayor of London.\nFollow my campaign……\nMy Final campaign video\nWhat do you really want?\nPerhaps you are feeling fed up? Frustrated? Let down? Before your decide watch these the videos from Michael Gove, Boris Johnson and the Prime Minister. Then decide who you should back on Thursday…..\nWhy should you vote for me on 4th July?\nFed up of Labour’s War on the Motorist?\nWatch my short video on the subject!\nStop Enfield’s Green Belt Destruction\nLabour plan to destroy Enfield’s Green Belt and concrete all over it! Vote for me on July 4th to have an M.P. who will fight to save it.\nMy first campaign video was recorded on Tuesday 4th June. You can watch it here:",
  "https_chrisdey_uk_/https_chrisdey_uk/content_1.html": "Chris Dey was elected as a Local Councillor in May 2018. Chris represents Grange Park Ward in the London Borough of Enfield. Chris was born in the borough at Chase Farm Hospital. Attending St Andrews Primary School in Churchbury Lane and then Bishop Stopford’s Secondary School in Brick Lane.\nGet in Touch\nCllr. Chris Dey\nEdmonton and Winchmore Hill Conservative Association, C/O 276 Baker Street, Enfield. EN1 3LD.\nm. 07971 672798\nSend me a message\nFollow me on Social Media:\nOn Instagram\nOn X\nPromoted by A. Mulvey of Edmonton and Winchmore Hill Conservative Association, c/o 276 Baker Street, Enfield. EN1 3LD\nCopyright Cllr. Chris Dey 2018 – All rights reserved",
  "https_chrisdey_uk_/https_chrisdey_uk_2021_02_04_council-dictatorship/content_14.html": "At the full meeting of Enfield Council on 28th January 2021. We Conservatives stood up to this undemocratic rotten Labour administration. The Leader, Caliskan and her Deputy Leader, Barnes continue to impose their will on the people when a clear majority are opposed to their ideological LTN scheme. We ran out of time for my speech but below is what I would have said.",
  "https_chrisdey_uk_/https_chrisdey_uk_work-around-grange-ward-2/content_20.html": "Greenways Update – Feb 2023\nI noticed recently while out running 🏃♀️ in my ward that some of the Greenways signs were missing while others were facing the wrong way.\nThis isn’t helpful for walkers or cyclists who wish to use the Greenway so I raised with officers and got the following response which is helpful.\nThank you to officers for listening and agreeing to take action to resolve.\nWard Forum – 21/07/20\nArticle written by Enfield Town Residents Association\nThis week Grange Ward made history by being the first Enfield Ward to hold a ‘virtual’ ward forum. And jolly good it was too. Even arch-technophobe moi had to admit that it\nwas easier than I had expected. The images were clear and – perhaps of\nmost importance for those of us d’un certain age, it was actually a lot easier\nto HEAR WHAT WAS BEING SAID than is often the case in the Dugdale or St Peter’s Church. So it is with more confidence than usual that I can report that Sarge reported that – perhaps unsurprisingly, given the situation over the last few months – house burglaries and robberies had gone down. Thefts from persons have been ‘up and down’. The main\nissue for police – and residents – for the past few months has been motor vehicle crime: thefts of, from and vandalism. However, he reported that information fed to the police by our various WhatsApp groups has led to the police now pursuing an investigation of one person who appears to have been regularly involved in motor vehicle thefts and other offences. So that’s something of a result!\nThe police have also been attempting to tackle speeding offences – these can have a double ‘pay-off’ as often a stop leads to discovery of documentation ‘issues’ (I think that translates as ‘a lack of’), for instance, that the driver has been driving uninsured. As a result the police have seized around 20 vehicles over the past few weeks. Speeding offences – you will probably not be the slightest bit surprised to hear – occur most often on Cecil Road, Old Park Ridings and London Road.\nThe councillors then gave updates on local issues.\nChris Dey reported that he was pleased to be able to say that the Council’s response to the COVID situation had been good, in particular the food hub on the A10 and the weekly food parcels distributed to vulnerable people around the borough. Regarding the ‘one-way’ system along the New River path in Town Park, it transpired that our councillors had asked for a one-way system to be installed because it is too narrow for people to pass whilst out walking. Unfortunately the message got somewhat garbled in the telling, leading to officers first of all closing off the footpath! Cllr Terry Neville had given them some ‘robust feedback’ (his words!) and (as you are all probably aware) it is now open for use again.\nTerry then gave an account of the proposals currently being pitched by the Deutsche Bank group for the Precinct. The plan is to open up the precinct and make it brighter, make the access points on Church Street and Cecil Road more welcoming and make it more feasible to develop a ‘night time economy’. One of the more exciting suggestions being pitched is that we might get a ‘boutique’ cinema – possibly an Everyman… (oh please, please, pleeeeaaase).\nWaitrose, M&S and Boots are viewed as key retailers and Deutsche Bank are keen to keep them onsite. Apparently our Waitrose (blessed be its name) is the branch with the lowest turnover in – er, it was either north London, the whole of London or perhaps the UK, but I must have been refilling my glass distracted at that point and can’t quite recall. Well, suffice it to say that our branch of Waitrose is not doing as well as it ought, and the feeling is that this is because of its limited opening hours. So it is hoped that by opening up the precinct and increasing evening opening hours will strengthen Waitrose’s performance (and that of the other retailers) hence helping ensure Waitrose stays put. The plan is to reconfigure the development by opening up the entrance to Church Street (beside Waterstones) and creating a new route through the precinct from Church Street towards the westbound bus stops on Cecil Road (in place of the rather narrow alley beside M&S). In addition the creation of a new pedestrian link to Library Green is proposed.\nHowever, while it is keen to retain the ‘big names’ in the precinct, Deutsche Bank is nonetheless\naware that retail is changing. Its proposal therefore is to have fewer, but better, retail outlets in theprecinct. Harsh words were aimed by councillors and residents at some of the current offerings; it’s probably best to avoid saying anything further regarding which specific ones were pointed out in order to avoid legal challenges…\nThe proposal also includes the introduction of some residential accommodation as part of the\nchanges, and in order to bring in some funding to support the remainder of the work. Councillors\nhad emphasised that any such proposals must respect and be in keeping with the heights of local\nresidences. You can find the ETRA response to the Deutsche Bank proposals summarised in the section that follows the remainder of the Ward Forum report.\nCllr Neville went on to report on our councillors’ meeting with Dominvs, the group proposing to\nbuild two blocks of flats on the site currently occupied by the Metaswitch site at 100 Church Street.\nLike the ETRA committee they believe it is important to keep some space between the flats and the\npavement and to maintain the green space. Like us they too have concerns about the viability of\nflats with no parking whatsoever. The fear has to be that we will end up seeing a re-run of the\nproblems encountered with the Burleigh Way development – the lack of parking there resulted in\nfew being sold. Cllr Andy Milne then took over and reported on the Ross House site proposals. These, it had been felt, were for ‘identikit tower block buildings’ ‘of no architectural merit’. The architect apparently had difficulty defending the proposals for that site and as far as our councillors are aware the proposal is currently being revised.\nCllr Chris Dey then gave an update on the New River Loop. As we have reported in several recent\nnewsletters there has been a problem with pumps along the New River and consequently water\nlevels along the New River and in the Town Park Wetlands have been low. The main problem now\nappears to be that Thames Water fixed the last of the pumps that needed attention, but then\nsubsequently isolated it – but have not given an explanation for why they have done this. An LBE\nofficer is apparently dealing with this but is having trouble getting answers out of Thames Water.\nCllr Dey said if anyone wants to be kept in the loop about this issue to please contact him and he will include you in the growing list of people being cc’ed into the correspondence.\nLastly, Cllr Dey spoke on the death of Chris Bond, one of the Southbury Ward councillors. Although\non opposite sides of the political divide, all recognised Cllr Bond’s passion and enthusiasm for the\ntown centre. He had had a long career in local government and Cllr Dey praised his commitment to the borough.\nGrange Park Residents Association – Crime Meeting 13/02/19\nLast night I attended a meeting organised by Grange Park Residents Association. The sole agenda item was the Crime Wave hitting the N21 postcode in recent weeks and months. It was well attended by 200 residents from surrounding streets. Thanks to Fr Stephen from St Peters Church for opening up the Church and allowing it to be used to host the meeting.\nThe Metropolitan Police, Grange Ward Safer Neighbourhoods team were in attendance and updated the meeting on the latest crime figures for the ward. They were questioned by members of the public about some of the recent break-ins and the detection rate.\nMy colleagues and I addressed the meeting and praised the safer neighbourhoods team for their hard work. We pointed out that crime across the Borough had increased by 10% over the last 12 months. This is compared to a 1% increase over the rest of London. We are calling into the question the strategy and effectiveness of the Borough Commander and her leadership team.\nMy colleagues and I said that we would write to the Borough Commander and request a meeting with her. We would invite also invite representatives from the Grange Park Residents Association and key Neighbourhood Watch Residents. We would ask what she could do to address the concerns of residents? Particularly focus on the response times and detection rates.",
  "https_chrisdey_uk_/https_chrisdey_uk_2022_01_27_standing-up-for-enfield/content_16.html": "Tonight at the meeting of the Full Council Meeting of the London Borough of Enfield I stood up for our local Enfield Residents.\nTonight at the meeting of the Full Council Meeting of the London Borough of Enfield I stood up for our local Enfield Residents.",
  "https_chrisdey_uk_/https_chrisdey_uk_2021_09_08_destruction-of-the-green-belt_comment-page-1/content_6.html": "Destruction of the Green Belt Enfield’s Labour run Council wants to concrete over our Green Belt. Watch this short video in which I speak out against these disastrous plans. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Related\nCllr Chris Dey Why not get supermarkets to build flats above their stores like Tesco did in Woolwich. There are plenty of supermarkets throughout the country where we need housing. LikeLike Reply\nCllr Chris Dey\nWhy not get supermarkets to build flats above their stores like Tesco did in Woolwich. There are plenty of supermarkets throughout the country where we need housing.\nLikeLike"
}