{
  "https_nickbuckley4parliament_co_uk/https_nickbuckley4parliament_co_uk_volunteers/content_2.html": "Volunteers In order to win, I need your help! Please let me know how you can volunteer below. Your name Your e-mail Your mobile number Your address and postcode Subject Let me know how and when you can help Submit",
  "https_nickbuckley4parliament_co_uk/https_nickbuckley4parliament_co_uk_my-plan/content_4.html": "My Plan\n5 Promises\nPromises are easily made by someone who is seeking your vote. If they are not successful in the election then the promise is worthless. If they happen to win then a broken political promise is acceptable and expected. It must be for it seems that everyone does it. Am I any different than other politicians?\nI am making five promises to the people of Oldham East & Saddleworth if they choose to elect me on the 5th of July 2024 as their Member of Parliament. I promise safer streets, a grooming gang report, no congestion charges, to save the greenbelt, and clean up Oldham Council.\nThese sound great slogans but where is the detail? Is there any detail? Have I just made them up?\nI have spent 18 months speaking to the people of Greater Manchester and many from Oldham East & Saddleworth. It should come as no surprise that we all have the same issues and problems. The only one of my promises which is not universal is saving the greenbelt – this becomes more of a priority the more you move out of Manchester city centre.\nSafer Streets: I will create a new crime reduction partnership consisting of the police, council, and housing providers. I will personally Chair this meeting and hold to account all agencies that contribute to safer neighbourhoods. I will help design an overarching community safety plan that delivers real crime reduction. Local community groups will feed into this strategy and the meeting will be answerable to the people. Yearly evaluations will be shared with residents so they can judge us all on our success or failure.\nExperience: I have spent two decades fighting crime, I have a cabinet of awards for this work, and have advised three different Prime Ministers on crime reduction. I spent a decade working at Manchester Council in their Crime & Disorder Team and Chaired many similar meetings to hold partner agencies to account. I then set up a crime reduction charity with my redundancy payout to work on the streets to stop young people getting involved in crime and antisocial behaviour – this charity is now a multi-award winning charity. Our late Queen awarded me with an MBE for this work.\nGrooming Gang Report: Labour-run Oldham Council have announced that they will commission a public inquiry into the grooming gangs and potential cover-up. After years of rejecting such requests, they have finally been persuaded to take this action so they can keep themselves in power. They do not have enough councillors to control the council so have had to do a deal with independent councillors. I will insist that I am part of the set-up of this inquiry to create the terms of reference and guidance for whoever is chosen to lead it. I also want a say on who leads on it.\nExperience: Over decades, I have stopped the rape of 15 girls and 1 boy – I have had offenders arrested and prosecuted. In 2015, I won a national award for this work which concentrates on prevention and early intervention.\nNo Congestion Charges: I will work with public groups such as Rethink The Clean Air Zone to ensure we have an early warning system to make us aware of what is coming down the line in terms of charging motorists. The current Clean Air Zone may be dead in the water according to our Mayor, but this is only a ploy. This project will be rebranded and reintroduced once Labour takes power. People power stopped this project and attack on the motorist and we can do it again if we are prepared and forewarned.\nExperience: I have been fighting the Clean Air Zone for nearly four years – before anybody had even heard of it. I told people what Andy Burnham was going to introduce and many people did not believe me until the signs went up. I will never allow motorists to pay extra to drive on the roads they have already paid for through taxation.\nSave The Greenbelt: I will pull together all local campaign groups to maximise this fight and together create a new strategy that strikes at the heart of the matter – council planning permission. We will highlight councillors who vote to destroy the greenbelt in the hope that local people will punish them at the local elections. The new Greater Manchester-wide housing plan needs to be rejected. If we are serious about reducing the housing crisis, then we need to reduce mass immigration, not sacrifice our green and pleasant land.\nExperience: My mayoral campaign showed how much people care about the Greenbelt. The people of Oldham and Saddleworth are blessed with beautiful countryside – we need to keep it that way for our children and grandchildren.\nClean Up Oldham Council: The fact that this is one of my promises shows how far we have fallen as a nation. This council seems it be rotten to its core. What exactly is wrong is anyone’s guess but the fact it needs cleaning up is very clear. I will set up a confidential, anonymous reporting system for council employees to report incompetence, corruption, and cover-ups within this tax-funded body. I will shine a huge light and expose what I find. Then the people can administer their punishment at the next local election.\nExperience: I have worked for a council and seen incompetence and mismanagement. Part of my mayoral campaign was to set up a reporting system to report those who waste our taxes. This project will be scaled down to focus purely on Oldham Council.\nIf I am lucky enough to be elected, I will be like no other MP. I have been training for this position for over two decades and will hit the ground running. The fact I am not a careerist means I can focus on what I need to do, and not on furthering my career through shady deals or breaking my promises. I need to fight and that fight starts on day one.\nI am not pursuing this position for me. I am not pursuing it for you. I am doing this to improve my country. Not because I am special, but because I know someone must try before it is too late.\nIf I do not try then I am simply a coward. Someone who has taken all the benefits on offer in this amazing country, but is not prepared to fight for a better tomorrow for those that come after me. This is selfish, wrong and to some degree – traitorous.\nI know I am flawed. I am not the man I wish I was or could be. But I am an Englishman nevertheless and England expects every man to do his duty.\nI pray I do not let myself down.\nCountdown to the election – make sure you vote on 4th July 2024!\nDay(s)\n:\nHour(s)\n:\nMinute(s)\n:\nSecond(s)",
  "https_nickbuckley4parliament_co_uk/https_nickbuckley4parliament_co_uk/content_1.html": "Many parts of Oldham East & Saddleworth have been left behind and forgotten.\nThis has been happening for decades and under all political parties. The message they have sent us is clear: YOU DO NOT MATTER. I happen to disagree.\nThe current MP, Debbie Abrahams, has been in Parliament for 13 years and achieved absolutely nothing. Unless you want to include stopping foreign convicted criminals from being deported from the UK. In this one act alone, she has placed us all in more danger. I say we all deserve better from our elected members of Parliament.\nParty politics is a huge problem. Politicians spend too much time serving their party bosses instead of the people they are supposed to represent. We are not their boss. People sitting in Party HQ in London are their bosses.\nThis is a continuing problem unless you vote Independent – then the people really are the boss.\nI have no puppet masters or people pulling my strings. It is just me. The only boss I want is you – the people of Oldham East & Saddleworth.\n5 Key Promises:\n– ensure the police, council and housing tackle crime and antisocial behaviour\n– never pay to drive on the roads we have already paid for\n– stop building on the greenbelt\n– full public inquiry into the grooming gangs and cover-up\n– tackle the corruption and incompetence in Oldham Council\nI have spent two decades fixing social problems and have the experience ready to improve your neighbourhood and the lives of your children and grandchildren. With my hands on the levels of power, I can bring the change I have been working towards all my life. I am all set to be unpopular within the civil service and local council for my only concern will be to ensure YOU get a better service.\nI had a grand plan ready to go if I had been elected Mayor of Greater Manchester a few weeks ago, but unfortunately, Andy Burnham won again. I have now scaled down this plan to purely focus on Oldham East & Saddleworth. This will be a huge benefit to local people and improvements will be seen almost immediately.\nMany people from across Greater Manchester invited me to stand in their area, but I chose Oldham East & Saddleworth – you voted for me in twice the numbers than anywhere else. You stood by me for Mayor, so now I will stand by you to tackle the council and improve services.\nI have worked in Oldham off and on for nearly four decades. Starting on Oldham market, alongside Oldham Council tackling antisocial behaviour, and more lately with my charity stopping kids getting involved in crime. Oldham has a very special place in my heart.\nThe real choice you have at this general election is between Labour, George Galloway’s party and me. The Tories and Reform cannot win. Only I can keep these two disasters out of power in Oldham East & Saddleworth – a vote for anyone else is a wasted vote.\nIf you want change, then I am the most experienced candidate to deliver such a request.\nVote #NickBuckley4Parliament\nCountdown to the election – make sure you vote on 4th July 2024!\nDay(s)\n:\nHour(s)\n:\nMinute(s)\n:\nSecond(s)\nPromoted By Nick Buckley Of 7A Porchfield Square, Manchester, M3 4FG",
  "https_nickbuckley4parliament_co_uk/https_nickbuckley4parliament_co_uk_about-nick/content_3.html": "I am a doer, not a talker.\nI grew up in a single-parent household on a council estate. I went to a failing school and wasted the first part of my life refusing to accept my personal responsibility. I eventually realised I was holding myself back and my life started to improve immediately.\nI started my first business as a market trader, moved into wholesale, and then started a completely different career at Manchester Airport. I had an industrial accident so had to leave. I found a new job at Manchester Council as a Youth Intervention Officer and then as a Community Safer Coordinator. During this time, I won a handful of awards for reducing crime and antisocial behaviour. I have also advised three different Prime Ministers on crime reduction and tackling rough sleeping.\nWhen austerity hit in 2011, I took redundancy and used my payout to set up and fund a charity to help young people avoid a life of crime. My charity, Mancunian Way, set up projects to also address homelessness and helped to uncover child rape cases. The charity is now multi-award winning and in 2019 I was awarded an MBE for this work from our late Queen.\nLast year, I finally realised my country was failing so decided to run for Mayor of Greater Manchester against Andy Burnham. I came third place and beat the LibDems, Greens and Reform UK. After the election, I knew my fight was not over. I had lost a battle, not the war.\nSolving social problems has been my career for two decades. Experience has taught me that problems are resolved through hard work, dedication, and holding people accountable. I do not have time for pink and fluffy nonsense, incompetence or excuses.\nI do not need to be popular, liked or admired. I only need to be respected as someone who does as he says. I say a lot and I will do a lot.\nThe first step of introducing honour into our political system is to vote into office someone who already possesses it.\nCountdown to the election – make sure you vote on 4th July 2024!\nDay(s)\n:\nHour(s)\n:\nMinute(s)\n:\nSecond(s)"
}