{
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_helen-backs-affordable-homes-first-time-buyers-manifesto-pledge/content_12.html": "Everyone needs a hand up to get on to the housing ladder - the keys to your first home are priceless - a first place you can call your own, security and safety and something you can be proud of and something you can work for and something you can share with someone who you love and who loves you. A space of our own is a place we call Home.\nThat dream has become harder and harder.\nBut it has always been a bedrock conservative aspiration that has built our country. So under the conservatives in our manifesto we have set out a route map for how we can help young people to own their first home.\nWe have made it possible for young people to get a degree without borrowing through out apprenticeship programme where young people can earn and learn skills which companies need and get straight into a well paid job without debt.\nWe have developed a 95% mortgage for first time buyers so that you only have to save for the first 5%.\nAnd we have waived stamp duty completely for first time buyers for properties up to £425k.\nNow we are building the houses you want where you want them.\nI started my life in a maisonette in Chessington. It was all we could afford. My mum was 21 and my Dad was 25. And it was a great starter home. A roof over our head and everything to fight for in the first steps of family life. Im super proud of my parents and their start in life and their fight for family and work.\nLabour’s First-Time Buyers Tax\nLabour have refused to match our tax cut to Stamp Duty for first-time buyers.\n- Owning a home makes people more financially secure and gives them a stake in society. As the party of the property-owning democracy, we want to give more people the chance to buy their own home, which is why we will ensure the vast majority of first-time buyers pay no stamp duty at all.\n- By refusing to back our plans, Labour will introduce a new First-Time Buyers Tax, making it harder to save for a deposit with up to £11,250 in higher tax and blocking the dream of homeownership for many young people.\n- Only Rishi Sunak and the Conservatives have a clear plan for bold action to secure the future of homeownership by permanently raising the threshold at which Stamp Duty is paid. Labour’s First-Time Buyers Tax would hike up the cost of buying a home, taking the country back to square one.\nLabour will impose a new First Time Buyers Tax:\n- Keir Starmer will cut the Stamp Duty threshold for first-time buyers from next year, introducing a new First-Time Buyers Tax and blocking the dream of homeownership. Labour has refused to match our commitment to abolish Stamp Duty for first-time buyers of homes up to £425,000. Instead, they have confirmed that stamp duty will rise for first-time buyers as the threshold above which the tax is paid on first-time property purchases would be reduced to £300,000 from April 2025.\n- Labour’s First-Time Buyers Tax comes on top of the planned £2,094 tax hike for every working family. Labour already have a £38.5 billion black hole in their spending plans which will need to be paid for by tax rises on hardworking people. Their plan for a First-Time Buyers Tax shows that, if Keir Starmer is handed a blank cheque and unaccountable majority, £2,094 in tax rises is just the beginning.\nThe Conservatives have a clear plan:\n- Raising the threshold at which a first-time buyer pays stamp duty from £300,000 to £425,000, meaning the majority of first-time buyers do not pay Stamp Duty. We will ensure the vast majority of first-time buyers pay no Stamp Duty at all, by making permanent the increase to the threshold at which first-time buyers pay Stamp Duty to £425,000 from £300,000, which we introduced in 2022, saving thousands of first-time buyers up to £11,250.\n- Launching a new and improved Help to Buy scheme, helping more first-time buyers take their first step onto the housing ladder. Under the new scheme first-time buyers will be offered a 20 per cent equity loan towards a new build property, enabling them to buy their first home with a five per cent deposit. The scheme will be available to hundreds of thousands of families.\nQ: Building enough homes?\nSince April 2010, we have delivered over 2.5 million additional homes, with the four highest annual rates of housing supply in 30 years all coming since 2018. The last Labour Government oversaw the lowest level of housebuilding since the 1920s.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_campaigns_preserving-our-environment/content_24.html": "Preserving our Environment\n- Protecting Thames Riverside, Richmond Park and our precious green belt south of the borough\n- Building on our work cleaning up rivers, including Thames Tideway London's Super Sewer due next year stopping 95% of all upstream spills and the new large septic tank construction at Hogsmill",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_helens-flagship-women-work-campaign-returnership/content_22.html": "Apprenticeships and Women back to Work\nA subject close to my heart ... getting us women back to work after the family years for fulfilment, status, finances and pension... checkout \"returnerships\" on gov.uk website or try Euan Blair's Multiverse apprenticeships. Go for it Ladies! Let's find our young ambition again!\nhttps://www.thetimes.co.uk/.../euan-blair-i-can-get-over....",
  "https_www_helenedward_uk_/https_www_helenedward_uk_campaigns_right-homes-right-places/content_20.html": "The Right Homes in the Right Places\n- Getting new affordable starter homes like the maisonette I was born in in Chessington\n- Protecting the suburban character\n- Preventing over development and ugly high rise buildings\nThe Right Homes in the Right Places\n- Getting new affordable starter homes like the maisonette I was born in in Chessington\n- Protecting the suburban character\n- Preventing over development and ugly high rise buildings",
  "https_www_helenedward_uk_/https_www_helenedward_uk_privacy/content_13.html": "This document outlines how Helen Edward processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Helen Edward\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Helen Edward.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Helen Edward, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Helen Edward via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news/content_3.html": "Justice for Children with SEND and Neurodivergence Wednesday, 23 April, 2025 The report on Justice for Children with SEND and Neurodivergence is published today by the Michael Sieff Foundation, a charity based in East Sheen, which has been working in the child welfare field for forty years. The Foundation does not do face to face work with children but seeks to improve policy and practice. Eighty per cent of children cautioned or sentenced in the youth justice system have... Articles\nPreparing for an Ageing Society: Britain can't afford to sideline older workers any longer 22nd April 2025 Britain can’t afford to sideline older workers any longer. The House of Lords today debated Preparing for an Ageing Society, the economic implications of our... Articles\nTurn the Tables: Govt vs The Hospitality Sector 22nd April 2025 Turn the Tables: Govt vs The Hospitality Sector Conservatives warned voters that Labour would “ Tax, Tax, Tax .. it’s in their DNA”, we warned. Just weeks into... Articles\nOlder Women Health and The Fall 13th March 2025 Dying naturally of old age is one thing - but there is nothing natural about a Fall. So often the Fall is the beginning of the end: the pivot from active... Articles\nWhat Kingston Thinks 4th March 2025 Fascinating launch today of 'What Kingston Thinks' at The Rose Theatre in the heart of Kingston by Charity Kingston Charitable Foundation now rebranded as... Local News\nHelen frames the choice 1st July 2024 What's the choice again? Here are our key pledges to secure a strong economy, the future of young people and local communities, women and childcare and... Local News\nHelen backs Affordable Homes for First Time Buyers with Manifesto Pledge 30th June 2024 Everyone needs a hand up to get on to the housing ladder - the keys to your first home are priceless - a first place you can call your own, security and safety... Local News\nHelen talks about being a mum and Rishi's new childcare plan 30th June 2024 What will the conservative manifesto do for mums? How does this sound ? £6900 free childcare and family hubs are a game changer for Kingston Mums and it would... Local News\nHelen campaigns for better parking at Kingston Hospital 30th June 2024 I have received so many letters and requests to get more parking for Kingston Hospital Patients to address what can be a high stress experience adding to... Local News\nHelen welcomes SW Rail to Chessington FC to help us find solutions for pitch flooding 29th June 2024 Great to welcome David Wilby from SW Rail to @Chessington Football Club yesterday with Manager Andrew Ellis and Coach Leigh to take a look at the embankment and... Local News",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_helen-campaigns-better-parking-kingston-hospital/content_16.html": "I have received so many letters and requests to get more parking for Kingston Hospital Patients to address what can be a high stress experience adding to already high levels of anxiety for patients coming for operations, appointments and emergency care.\nSo Ive written to Kingston Hospital Management Team and Patient Experience Team.\nDear Patient Experience Team\nPatient Parking shortages at Kingston Hospital has been coming up a lot in my email box.\nI know that many patients stress about finding a parking space and being late for their appointment.\nOne person suggested to me that an electronic gate that doesnt let additional cars in once it is full might solve some of the circling which currently exacerbates the jams in the parking and stress on hovering.\nThere are other tech solutions around that monitor the number of parking spaces available too.\nPerhaps we could also look at a park and ride scheme from a larger car parking facility.\nAnother thought is to link parking to appointments:\nWould it be possible to pre-book a parking space for an appointment for example ?\nOr perhaps create bookable only mobility spaces for disabled or non mobile patients?\nTheres a link to a national campaign too which many residents have pointed too.\nWould you be able to share Kingston Hospital’s views on parking provision and any plans there are to review?\nMany thanks\nHelen Edward | Parliamentary Candidate Kingston & Surbiton\n3 Bridle Cl, Kingston upon Thames KT1 2JW\nSee the National Petition here\nhttps://organise-speakout.s3.eu-west-1.amazonaws.com/NHS+Parking+for+st…",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_helen-welcomes-sw-rail-chessington-fc-help-us-find-solutions-pitch-flooding/content_17.html": "Great to welcome David Wilby from SW Rail to @Chessington Football Club yesterday with Manager Andrew Ellis and Coach Leigh to take a look at the embankment and grounds and discuss the pitch and flooding.\nStill working on solutions for our 200 children who live for football. We want to get this sorted for you.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_helen-talks-about-being-mum-and-rishis-new-childcare-plan/content_6.html": "What will the conservative manifesto do for mums?\nHow does this sound ? £6900 free childcare and family hubs are a game changer for Kingston Mums and it would have been a game changer for me.\nAs a mum we are always the backstop when things go wrong. I see it first hand in Kingston Hospital A&E where we all go when we are worried about our kids our parents our partner - there's always a mum. In Jan 2020 when my daughter got covid (before anyone knew what it was) then sepsis shock and the paramedics said her blood pressure was 48/24 and I only just got there in time .. we were in the ICU 3 days before they told me that she would live .. that's why I volunteer .. I have more than enough to be grateful for don't I?\nSo it's always hard to make the choice to go back to work because you never know when you're going to be called upon next.\nBut if you had reliable free childcare what would that mean to you ? Would it mean that you could get your career back? Could you step outside the Catch 22 of childcare and caring ?\nA childcare offer of £6900 free childcare of 30 hours a week could be a game changer for most mums leaving them with enough time to do a proper job again, rebuild their confidence, their financial security and their long term pension security - plus their independence and resilience against all the stuff life throws at us from divorce to the loss of our parents and partners ..\nKeeping our careers in play is a flood defence against the extreme climate change of life. So this childcare offer is a game changer for women for early education and for the economy retention of 51% female faction of the workforce !\nAnd then there's Family Hubs, brilliant new addition to our community provision for U5 activities alongside mental health, welfare, nutrition and financial and legal support. And our first family hub is coming to Kingston Borough in the New Malden Childrens centre this September. A great way for new mums to network. overcome loneliness and get the advice they need to navigate the difficult first months of new born and motherhood.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_map-locations/content_7.html": "Skip to main content\nMain navigation\nHome\nAbout Helen\nNews\nContact\nMy map",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_what-kingston-thinks/content_8.html": "Fascinating launch today of 'What Kingston Thinks' at The Rose Theatre in the heart of Kingston by Charity Kingston Charitable Foundation now rebranded as Kingston Giving where I was previously a trustee.\nThe research was conducted by the brilliant Rocket Science and funded by City Bridge Foundation over 9 months with great local researchers with support from Kingston University.\nResidents were asked 'How do you feel about the following aspects of your life?'\nResidents were asked how satisfied they were with Kingston as a place to live .. with 94% reporting Very and Somewhat Satisfied.\nThen they were asked to rate by green amber and red the following areas, covered in order of red highest to lowest:\nMental health and wellbeing 39% said it was not going well\nPhysical health 31%\nDisability and caring 30%\nIncome and Finances 28%\nEmployment 23%\nFeeling connected 22%\nTraining and education 19%\nGreen spaces culture and leisure 18%\nGetting around 18%\nHousing and Homelessness 17%\nEssential shops and services 17%\nFeeling safe 16%\nCaring 11%\nDigital access and connectivity 72%\nMental Health\nDissatisfied respondents cited access and long waiting times for CAHMS with comments such as \" 8-9 months waiting to be seen when they are at crisis point\" exacerbating the downward spiral.\nPhysical Health\nDissatisfied respondents cited access and long waiting times and rescheduling for appointments. The long promised never delivered Leisure Centre was also referenced as a disappointment which left residents unable to exercise as private clubs were unaffordable.\nDisability and Caring\nResidents discussed the shortage of SEND facilities and funding and the frustration of fighting the system.\nIncome and Finances\nResidents raised points including income inequality despite the median wage of £46k higher than London and UK average. Many argued that the level of council tax was unfair with declining services especially set in context of higher fuel bills and food costs and inflationary price increases on everything and low wage growth. Housing affordability and availability came very high on the list for young people, important not least for students at Kingston University, as well as for first time buyers priced out of the market by high interest rates and rising ratio to salary and mortgage payers whose payments have doubled.\nGreen Spaces\nResidents raised again their lack of access to affordable leisure facilities and a swimming pool. One resident said \"We are privileged to have so many green spaces but many could be better maintained and more accessible.\"\nPublic Transport\nResidents described the roadworks as being \"never-ending\" poorly coordinated casuing delays and confusion making travelling \"unpleasant by any means\".\nHousing\nRented accommodation and Housing associations has been singled out for Neglect with poor maintenance, mould, dampness, inadequate repairs and no landlord accountability. Cambridge Road Estate ranks amongst the 20% most deprived neighbourhoods in England and was brought up frequently in reference to crime, ASB and drug taking and personal safety. Homelessness was also highlighted as a growing concern with visible rough sleeping as well as over crowding and sofa surfing.\nThank you to Kingston Giving kingstongiving.org.uk for undertaking and presenting this insightful research on quality of life in Kingston Borough.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_about-rss/content_19.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_helenedward_uk_/https_www_helenedward_uk/content_1.html": "Hi, I'm Helen Edward, the a community champion in South West London and Surrey. I am passionate about our local area and I want to improve things for everyone. On this website you can find my news, campaigns and more about me. I'm here to help, so please don't hesitate to get in touch.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_justice-children-send-and-neurodivergence/content_2.html": "The report on Justice for Children with SEND and Neurodivergence is published today by the Michael Sieff Foundation, a charity based in East Sheen, which has been working in the child welfare field for forty years. The Foundation does not do face to face work with children but seeks to improve policy and practice.\nEighty per cent of children cautioned or sentenced in the youth justice system have special education needs or disabilities. The Foundation convened an expert working group to consider what reforms would enable these children to avoid contact with the justice system, and if they do enter the system, what would help them to lead well-functioning, fulfilled and productive lives.\nThe Report makes a number of recommendations to improve the system. Expert economic analysis reports that the cost of implementation would be in the region of £16m per year, with economic benefits of £191m.\nHaving just completed my PEx training and facing my first case I look forward to bringing this researched report to bear on our board consideration.\nFull Report here\nhttps://www.michaelsieff-foundation.org.uk/wp-content/uploads/2025/04/S…",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_helen-edward-returnership-and-future-work/content_21.html": "Have we ever seen such phenomenal transformations in our workplace - and all at once - as in 2023? The Kingston Chamber of Commerce Future of Work Summit at Kingston University Campus chimed a crucial chord on June 16th.\nAn unpredictable recipe of global, economic, and technological mixers created this signature commercial cocktail. Post-pandemic virtual home-working practices using the latest tech has become a new way of working and in a record full employment context, now 1m more than pre-covid levels, employees have the balance of power. Graduates and young people prioritise values and culture, mental health, and work/life balance, often above even pay and conditions. With over a million vacancies today, many businesses are exploring how to make their culture more attractive to recruit and retain staff without trading productivity, while keeping a close eye on the seismic arrival of AI and its transformative potential. KCoC Board Members, CE Forbes Low, VP Chris Hirsch and Dr Martha Mador put these exhilarating and urgent questions to Kingston business and education panellists and a Hackathon audience, for dynamic teamwork solutions.\nWhile recruitment in today’s nationally record high employment environment is competitive, anyone who remembers graduating in a recession with record unemployment will see it as a bonus for Kingston residents’ general standard of living. Here in Kingston, we have a 98.4% employment rate with average salaries of an impressive £39,843 and we have one of the most academically educated working age populations in the country. (Source https://www.varbes.com/economy/kingston-upon-thames-economy)\nCompanies looking to fill their vacancies are looking further afield and especially at attracting older workers back to work. One in three people in 2023 of working age are over 50 and over 3 million 50 to 65s quit the workforce after covid. Jeremy Hunt recently increased the pension pot tax allowance in the spring budget to entice surgeons in the NHS and senior management ‘back off the golf course!’ Another significant group are women who take on a disproportionate amount of unpaid care work in Britain: career-break mothers and carers with tapering caring responsibilities, looking to balance the ‘Housewife Penalty’, their pension expectations, subsidise childcare or reboot their professional status. Divorced or bereaved women from all backgrounds can be less secure financially or pension-wise and keen to get back into the workplace and boost their independence.\nWith this group in mind, last October I submitted a policy proposal to the DWP (Department for Work and Pensions) designed at offering ‘Returnerships’, a second internship to build new skills and confidence among older people looking to restart their career later in life. I was thrilled to see the government have developed the concept brilliantly with several business partners with their ‘Returnership Toolkit’.\nA ‘Returnership’ is a fixed-term contract with an employer, usually 3-6 months and competitively paid. There is a strong likelihood of a permanent role at the end if it goes well for both returner and employer. Support, such as coaching, mentoring and training, is usually provided for the placement period.\nThere’s never been a better time to be a Returner. More companies are investing in Returner programmes, and more employers are waking up to the value of Returners’ skills, experience, and maturity.\nMany of the Returner programmes target high demand sectors such as social work, health, tech and construction. Many programmes address flexible working to tackle barriers for Returners with continuing caring commitments. In pilots run by partner “Timewise’, (https://timewise.co.uk/social-impact/) Returners reported benefits in health and wellbeing, decreased stress, and an uplift in productivity.\nPartner ‘Women Returners’ (https://womenreturners.com) has partnered on Returner programmes with over 150 private and public sector employers in the last 5 years, showcasing many inspiring role models, https://womenreturners.com/returners/success-stories/\nIf you are interested in finding Returnership availability look no further than the government skills bootcamp with brilliant firms like Black Rock, AWS, and more. New skills training includes cloud tech, data analytics and engineering, cyber security, digital marketing, project management – and much of it conveniently online.\nhttps://www.gov.uk/guidance/find-a-skills-bootcamp/london\nGot a Returnership story to tell? Any Future of Work policy idea you would like to submit? Interested in getting into politics? Let me know [email protected]\nHelen Edward",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_category_Opinions/content_10.html": "Michael Gove: Here are some of the achievements of the past 14 years. Do we really want to go back to square one? 29th January 2024 Michael Gove is Levelling Up Secretary, and is MP for Surrey Heath. In his speech to the Labour Party conference in October 2009 Gordon Brown opened with a riff... Opinions",
  "https_www_helenedward_uk_/https_www_helenedward_uk_cdn-cgi_l_email-protection/content_25.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_myplan/content_14.html": "Strong Communities\n- Protecting High Streets and Hospitality\n- Protecting Kingston Heritage\n- Championing Culture and Events\n- Campaigning for a new Kingfisher Leisure Centre and funding for Chessington Football Club\nBetter Healthcare Supporting Kingston Hospital where I volunteer and my mum was a theatre nurse and I am now an elected governor - Backing the work in Kingston Hospital A&E to manage patient flow and excess demand - Backing the new ICU\nImproving Education\nSupporting Local schools where I am a school governor\n- Fighting Labours Parent Tax and VAT on independent schools\n- Championing our record on choice, standards and achievement\nThe Right Homes in the Right Places\n- Getting new affordable starter homes like the maisonette I was born in in Chessington\n- Protecting the suburban character\n- Preventing over development and ugly high rise buildings\nProtecting Women and Preventing Crime\n- Standing up for women rights\n- Protecting women's safe spaces\n- Keeping women safe\n- Building on govt 20k new police to tackle crime\nCampaigning for a new Kingfisher leisure centre following the Lib Dem’s demolition of the old Kingfisher without serious costed plans for a replacement, which is limiting opportunities for the next generation to learn to swim locally, and to improve facilities for families across the Borough.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_campaigns_protecting-women-and-preventing-crime/content_18.html": "Protecting Women and Preventing Crime\n- Standing up for women rights\n- Protecting women's safe spaces\n- Keeping women safe\n- Building on govt 20k new police to tackle crime\nProtecting women and girls\nIssue: On 3 June 2024, we pledged to define the protected characteristic of sex in the Equality Act as biological sex.\nLabour passed the Equality Act more than a decade ago, but it is now clear there is a lack of clarity in the law, leaving s\nCELEBRATING INTERNATIONAL WOMEN’S DAY\nAs Conservatives, we believe in equality of opportunity for all, so everyone across our United Kingdom – no matter their gender, race, or background – can reach their full potential.\nHere is the answer I received today.\nDear Helen,\nKingston council was the lead council who applied for the Safer Streets funding on behalf of Kingston, Richmond, Merton and Wandsworth boroughs. A total of £183,000 was received to carry out work across the\nI wrote to Chris Jones, Programme Director Kingfisher Leisure Centre today about the new Kingfisher Leisure Centre design for single sex changing facilities, a campaign close to my heart as mum of two girls ...\nHave we ever seen such phenomenal transformations in our workplace - and all at once - as in 2023? The Kingston Chamber of Commerce Future of Work Summit at Kingston University Campus chimed a crucial chord on June 16th.\nAn unpredictable recipe of global, economic, and technological mixers cre",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_preparing-ageing-society-britain-cant-afford-sideline-older-workers-any-longer/content_4.html": "Britain can’t afford to sideline older workers any longer.\nThe House of Lords today debated Preparing for an Ageing Society, the economic implications of our ageing society. It was a thoughtful discussion — but tellingly, led entirely by older men. No women. No younger voices. That absence matters. Because what we urgently need is a shift in how we talk — and act — on age and work in Britain.\nWe face a demographic squeeze: people are living longer, having fewer children, and dropping out of the workforce in their 50s. The old-age dependency ratio is heading towards 50% and beyond. Without action, the burden on taxpayers, the NHS and the care system will become unsustainable.\nBut here’s the point too often missed: older people aren’t the problem. They’re a massive part of the solution — if we support them to stay in or return to work.\nThe crisis isn’t age — it’s inaction.\nMy father-in-law Arnold turns 99 in two weeks. He started his own business with his army pension in the 1950s, built it into a thriving company, and although he no longer drives the Rolls Royce he once earned, he still works every day, plays golf weekly, and never misses a Chelsea match. And his generosity has supported our younger generation. That spirit — of contribution, connection, and sheer determination — has kept him fit in every sense. He’s not the exception. He’s an example of what’s possible when we don’t write people off.\nYet today, thousands of over-50s are pushed out of the labour market long before they’re ready. Once they've left it's hard to get back in. Ageism in recruitment, rigid roles, and the subtle shift toward digital-only hiring have created invisible barriers. If we want to grow the economy without relying solely on immigration or borrowing, we must unlock the potential of older workers.\nRaising pension age? Then raise support too. Calls to raise the state pension age are growing louder. But unless we also enable people to work longer, we’re simply moving pressure to pensions and welfare.\nWe need:\n- Employer incentives to take on midlife candidates\n- Flexible roles tailored to older employees\n- “Returnerships” and Mid-career retraining schemes\n- A government-led campaign to tackle age discrimination\nAge is a protected characteristic under the 2010 Equality Act. So why are so many HR systems devoted to DEI still screening out older applicants without ever seeing their CVs?\nNot just older workers: what about younger ones? This isn’t just about older people. One million 16–23-year-olds are currently classed as NEETs — not in education, employment or training. That’s a crisis too.\nDigital-first recruitment, impersonal application processes, and over-reliance on pre-screening for DEI targets are making it harder than ever for young people to get a first break. And older workers are facing the same locked doors — often for opposite reasons.\nIf we’re serious about equality, we need to bring HR back to human. Face-to-face interviews, experience over tick-boxes, and fair treatment across all ages should be the baseline. Diversity must include age — and so should our hiring practices. Chronological age is less a determinant of productivity than health and fitness, education and environment.\nIf we want people to work longer, they need to stay healthier for longer. A shift from treatment to prevention in our NHS — especially around Alzheimer’s and chronic illness — isn’t just morally right, it’s fiscally urgent. Quality care homes are unaffordable for most. And no one knows the cost of their end of life so we need a commercial insurance product. Family comes first and many women are locked into Caring roles and this also inhibits their potential to participate in work and this hidden cost is not reflected in GDP or productivity data.\nI work with Brave Starts, a social enterprise helping people over 50 re-enter the workforce with confidence, skill and purpose. We're proving what's possible — but we can't do it alone.\nIf the government wants to boost productivity and reduce welfare bills, the answer is right in front of us: support people aged 55–65 to stay active and employed. The gains are economic, social, and personal.\nWe’ve adapted before — we can again.\nThe entry of women into the workforce was once seen as radical. Now it’s essential. We need the same mindset shift on ageing. This isn't about charity — it's about growth.\nDemography is not destiny. Japan, Singapore, S Korea and others are adapting. So must we. If we delay, as Lord Lamont warned today, the bill will only grow — in borrowing and debt, interest rates, pensions, care costs, and wasted talent.\nThe question isn’t whether we can afford to support older workers. The question is: can we afford not to?\nBecause this isn’t just about “them.” It’s about all of us. We will all one day be old.\nLet’s stop talking about ageing as decline — and start seeing it as potential waiting to be unlocked.\nWe can’t afford to let a generation of experienced workers — or a generation of ambitious young people — sit on the sidelines. Let’s make work work for everyone.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_helen-shares-her-electoral-address/content_23.html": "We've achieved so much together now I'm asking you to put your trust in me and Vote Conservative for Helen Edward for Kingston and Surbiton on July 4th.\nWe've achieved so much together now I'm asking you to put your trust in me and Vote Conservative for Helen Edward for Kingston and Surbiton on July 4th.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_contact/content_9.html": "Skip to main content\nMain navigation\nHome\nAbout Helen\nNews\nContact\nContact\nLeave this field blank\nCampaign Office\n3 Bridle Cl, Kingston KT1 2JW\n[email protected]\nHelen on Facebook\nHelen on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_turn-tables-govt-vs-hospitality-sector/content_15.html": "Turn the Tables: Govt vs The Hospitality Sector\nConservatives warned voters that Labour would “ Tax, Tax, Tax .. it’s in their DNA”, we warned.\nJust weeks into the new budget the personal stories abound of financial pain that will fundamentally change the decisions and lifestyle of businesses and customers around the UK: in the spotlight, the National Insurance Impact on High Street Hospitality, Bars and Restaurants.\nAfter covid lockdowns and social distancing, inflation, eye-watering energy bills, alcohol tax increases, tronc legislation, calories and ingredients declaration regulations, ULEZ and train strikes, business rates, the end of VAT relief and the end of tourist tax relief - the hospitality sector is only just getting back its determination to succeed against the odds. The National Insurance tax rises, Minimum Wage increase, and New Workers Rights this month have hit the sector for six – Again. Can it survive? In France we have seen many small restaurants open to set hours reservations only run by an over-worked and underpaid skeleton staff. Will that be the inevitable business model here too ?\n“Had I known what the current financial climate was going to be like now, and the lack of consumer confidence, I wouldn’t have bought this place,” Collins, a city hospitality owner who has just opened a new site investing £1.2m, told The Telegraph. “It was quite a tricky deal. It took a lot longer than expected, and since then the world’s got worse, which no one was expecting. So, if I could turn back the clock, I wouldn’t have done it. I can’t see us making any money in the next financial year, and that’s with opening a brand-new site, so the coffers are empty. We did our calculations in November, and just with the national insurance rise and the living wage rise, we needed to find, as of 1 April, an extra £300,000 per year. Lunch has just fallen off a cliff, and you’re now up against everyone discounting, especially the groups that have private equity backing.”\nCollins is also facing pressure from suppliers who are attempting to pass the impact of the tax rises down the supply chain. “Our big food supplier has just tried to pass on the 5% uplift,” he said. “Everyone’s trying to pass it on someone else. It’s a never-ending story.” Ultimately, he said, it would be a lot easier to just “shut up shop”, but said the company employs 220 people and “we’re not going to let them go”. He added: “We’re a key pillar of the economy. We support jobs, communities, recovery. Hospitality brings people together. It’s full of passion and potential. The red tape needs to be cut, the tax load needs to be eased, and then we can just do what we do best.”\nThis story is repeated many times over in this critical sector which employs one in ten people in the country many of them young and often their first job playing a crucial role in training. New sites mean more employees and therefore more PAYE tax for the government – so the NI increases are a home goal against growth and against jobs. Pubs, Bars and Restaurants are at the heart of our community, social fabric and lifestyle – so this phenomenon impacts everyone. “The impact on the economy will be enormous, but the long-term damage to our unique heritage and the social fabric of our nation will be devastating,” Collins said.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_helen-shares-her-election-address/content_11.html": "Dear Resident\nPolls tell us we are days away from a Labour government with a massive majority led by Angela Rayner and Keir Starmer.\nBig issues face us with advances in AI and technology at a time of deep global uncertainty with unprecedented risks. How can you trust Angela Rayner, who voted against Trident, and Keir Starmer with our National Security? And we have seen that Labour’s Tax Trap Manifesto would take the tax burden to its highest level in British History, with NO tax cuts – just tax rises.\nLabour will tax your car, your pension, your house and your work.\nBut you have a vote. You can decide who will be your voice in Westminster.\nThis choice is important. Keir Starmer is asking you for a blank cheque and we still do not know what he really stands for. A vote for the Lib Dems or Reform will be a vote for Keir Starmer. Or you can vote for a Compassionate Conservative who will stand up for you in parliament to protect your car, your pension, your house and family and your work.\nI was born in Chessington and my mother was a theatre nurse in Kingston hospital where I now volunteer in A&E. After my career in business for Mars, the RAC and a Director at a £500m Logistics Plc, and family, my work has included charities such as Kingston Charitable Foundation, Home-Start Kingston, The Children’s Trust and City Harvest London, as well as being a school governor at a local Chessington Academy and mentor at Kingston Uni and the Princes Trust. I recently ran the Kingston Half-Marathon to raise money for the Mayor’s charities and I support local business through our Chamber of Commerce.\nCauses close to my heart include children, young people, education, health, returnerships and food waste.\nSince I was selected as your candidate 18 months ago, I have been holding the terrible Lib Dem council to account on their shambolic management of Kingfisher Leisure Centre closed in 2019 now not due before 2027 and working hard to raise funds for Chessington Football Club to solve the flooding. I’ve been taking on case work to help frustrated residents on council housing problems and understanding homelessness including volunteering in the winter homeless shelter.\nI’ve also consulted with Kingston Hospital management and Healthwatch on A&E customer experience, patient flow, waiting lists, strikes, and preventative and post-op care fitness in the community with Malden Leisure Centre where I secured a government grant, as well as Tolworth Hospital redevelopment for mental health provision and the police role in emergency response.\nI backed £183k Home Office government funding for safer streets and worked with community police on safety walks for women and girls, weapons sweep in our local parks, shop-lifting and car theft. I have covered all of our wonderful community events from the Holocaust Remembrance to Thai Pongal and Holi Festival. I’ve followed Kingston Society and campaigned against the over-development of Surbiton station tower blocks. I’ve supported older people and work by proposing a second internship ‘Returnership’ which is now in main government policy.\nWhile Ed Davey is gallivanting around the country pulling embarrassing stunts and focussing on national ambitions over local interests, I will be a local MP working really hard for residents to solve our problems.\nThe Lib Dems can’t form the next government but they can give Labour unconstrained power over us to dictate record taxes, kill off the economic growth we’ve only just returned to after covid and the war in Ukraine, and putting our national security at risk in a dangerous world.\nOn Thursday 4th July, please vote for me and a safer securer future that recognises your hard work, your savings and your choice.",
  "https_www_helenedward_uk_/https_www_helenedward_uk_news_category_Local-News/content_5.html": "What Kingston Thinks 4th March 2025 Fascinating launch today of 'What Kingston Thinks' at The Rose Theatre in the heart of Kingston by Charity Kingston Charitable Foundation now rebranded as... Local News\nHelen frames the choice 1st July 2024 What's the choice again? Here are our key pledges to secure a strong economy, the future of young people and local communities, women and childcare and... Local News\nHelen backs Affordable Homes for First Time Buyers with Manifesto Pledge 30th June 2024 Everyone needs a hand up to get on to the housing ladder - the keys to your first home are priceless - a first place you can call your own, security and safety... Local News\nHelen talks about being a mum and Rishi's new childcare plan 30th June 2024 What will the conservative manifesto do for mums? How does this sound ? £6900 free childcare and family hubs are a game changer for Kingston Mums and it would... Local News\nHelen campaigns for better parking at Kingston Hospital 30th June 2024 I have received so many letters and requests to get more parking for Kingston Hospital Patients to address what can be a high stress experience adding to... Local News\nHelen welcomes SW Rail to Chessington FC to help us find solutions for pitch flooding 29th June 2024 Great to welcome David Wilby from SW Rail to @Chessington Football Club yesterday with Manager Andrew Ellis and Coach Leigh to take a look at the embankment and... Local News\nHelen shares her Electoral address 25th June 2024 We've achieved so much together now I'm asking you to put your trust in me and Vote Conservative for Helen Edward for Kingston and Surbiton on July 4th. Local News\nHelen talks to local Kingston mums about the impact of Labours VAT on schools 25th June 2024 Labour's VAT on independent schools will hurt children, some of whom will not be offered a local place, will hurt hard working families who make sacrifices to... Local News\nHelen shares her Election Address 21st June 2024 Dear Resident Polls tell us we are days away from a Labour government with a massive majority led by Angela Rayner and Keir Starmer. Big issues face us with... Local News"
}