{
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_news-1_mike-visits-hull-badminton-club/content_18.html": "Ed Davey: Mike Ross is set to win in Hull and East Yorkshire\nEd Davey has backed Lib Dem candidate Mike Ross to win the Hull and East Yorkshire Mayoral Election and make history for the party, which is eyeing up its first ever metro mayor.\nThe Liberal Democrats have run a massive campaign in Hull and East Yorkshire. This is Ed’s second visit to the area for the campaign. The party has also sent a dozen Parliamentarians and hundreds of activists to the region.\nThe Liberal Democrats are the largest party across Hull and East Yorkshire with 50 Councillors across the respective councils - more than either the Conservatives or Labour.\nLiberal Democrat Leader Ed Davey said:\n“On Thursday, a vote for the Liberal Democrats is a vote for real and positive change. Mike Ross is the best candidate for the job and can win.\n“People across Hull and East Yorkshire are disappointed with the bad decisions Labour are making in government. Only a vote for the Liberal Democrats can send them a message this week.\n“While the Liberal Democrats have been working hard all year round, Reform UK have only turned up at election time. Nigel Farage doesn’t care about people around here, he just wants to use them for his own political gain.\n“Mike has a plan to improve transport and get action on the cost of living crisis. With your support, he will be banging on the door of the Government to make sure your community is no longer forgotten.”\nCommenting, Liberal Democrat candidate for Hull and East Yorkshire Mayor, Cllr Mike Ross said:\n“I love Hull and East Yorkshire. I’m the candidate with the right experience to do this job and I’m ready to hit the ground running from day one.\n“I want the best for people here. As Mayor, I could do so much more for our area, and I’ve got the right experience to deliver change.\n“I’ll fight tooth and nail to fix so many of the things that feel broken at the moment.\n“One thing is clear - on doorstep after doorstep, people are saying how let down they are by this Labour Government. If you want to send Keir Starmer a message this May, you need to vote Liberal Democrat.”",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_donate/content_12.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowDonate to help Mike Ross in his campaign to be the first elected Mayor for Hull and East Yorkshire\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_fairdeal/content_8.html": "Mike's Plan for Our Region\nA Fair Deal For Hull and East Yorkshire\nMike Ross is standing to be the first Mayor of Hull and East Yorkshire because he believes our area deserves better. With over 20 years of local service and a proven track record as Leader of Hull City Council, Mike has always put our communities first — and now he’s ready to be a real champion for the whole region. As Mayor, Mike Ross will bring a fresh, positive approach to local leadership, focused on real priorities that matter to people across Hull and East Yorkshire.\nBetter Roads and Transport\nUnder both Labour and the Conservatives, local roads have crumbled and major improvements were scrapped. Mike will:\n- Fight to get the cash needed to improve local roads, particularly the A1179 & A166.\n- Expand public transport and campaign for a Beverley–York rail line\n- Build on his successful pothole-busting work in Hull to improve roads across the region\nFixing Local Healthcare\nMike knows the NHS is in crisis. Too many people are struggling to see a GP or facing long waits for treatment.\nAs Mayor, Mike will:\n- Demand investment in local health services and social care\n- Fight for action to cut waiting times and improve access to GPs\n- Fight to bring back services at Bridlington and Goole Hospitals.\nTackling Crime and Antisocial Behaviour\nFeeling safe in your community shouldn’t be a luxury. Mike has already set up a Crime Safety Fund in Hull — and as Mayor he’ll:\n- Fight for more frontline police and community safety funding\n- Work with local residents to deliver safer streets\n- Target anti-social behaviour head-on\nProtecting Green Spaces\nOverdevelopment has threatened the character of East Yorkshire. Mike will:\n- Oppose inappropriate housing developments\n- Fight for the infrastructure we are owed\n- Protect our green spaces.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_search-1/content_10.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_back/content_7.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_contact/content_11.html": "Mike always has time for local residents and will be available to explain his exciting plans for our region!\nContact Mike\nTwitter\ncllrmikeross\nMail\nUnit 2, K3 Business Park, 200 Clough Road, Hull, HU5 1SN\nMike always has time for local residents and will be available to explain his exciting plans for our region!\nTwitter\ncllrmikeross\nMail\nUnit 2, K3 Business Park, 200 Clough Road, Hull, HU5 1SN",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_volunteer/content_4.html": "Volunteer\nHelp us make history in Hull and East Yorkshire\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_page-1/content_9.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nThe Liberal Democrats are now the bookies’ favourite to win the Hull and East Yorkshire Mayoralty, with candidate Mike Ross saying “the momentum is with the Liberal Democrats in Hull and East Yorkshire”.\nThe odds on Mike winning have now shortened to 6/4, as the Lib Dem campaign aims to land a historic victory.\nWinning the Hull and East Yorkshire Mayoral election would be the first time ever the Lib Dems have won a Metro Mayor.\nThe Liberal Democrats are warning voters that choosing the Conservatives, Reform or other parties will split the vote and let Labour win.\nThe Liberal Democrats are campaigning for:\nLib Dem candidate Mike Ross said:\n“The momentum is with the Liberal Democrats in Hull and East Yorkshire, we’re the bookies favourites to win. Voting for the Conservatives and Reform will just let Keir Starmer’s Labour win.\n“We have to send Labour a clear message - that they can’t let us down any longer.\n“From scrapping Winter Fuel Payments to introducing a new tax on family farmers, many people are feeling betrayed by Keir Starmer. Our area has been ignored by people in Westminster for too long.\n“The choice is clear - only the Liberal Democrats can beat Labour. A vote for anyone else means Keir Starmer will keep taking Hull and East Yorkshire for granted.”\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_stop-reform/content_16.html": "Which candidate is best placed to stop Reform UK?\nThe facts speak for themselves:\nFact 1\nThe Liberal Democrats are the biggest party right across our area in local government…\nThursday’s election covers the whole of Hull and East Yorkshire.\nThis is the number of councillors per party across both council areas combined.\nThe Liberal Democrats are the biggest party in local elections across our region.\nThey have the most councillors in Hull and made big gains on the East Riding last time.\nThe Conservatives have no presence in Hull - and in much of rural East Yorkshire the Labour Party has no support.\nFact 2\nTactical voting websites now say a Lib Dem vote is the best way to beat Reform here…\nTactical voting website ‘StopReformUK’ is saying a vote for Lib Dem Mike Ross on Thursday is the best way to stop Reform UK winning in Hull and East Yorkshire.\nVisit their independent website to learn more: stopreformuk.vote/mayor/hull-and-east-yorkshire-ca\nFact 3\nPolling company YouGov has the Lib Dems second to Reform here - with Labour third...\nRespected national polling company YouGov has conducted voting intention polls for decades on UK politics.\nBetween 9th and 23rd April this year they conducted a poll across Hull and East Yorkshire for the Mayor Election.\nThe YouGov poll has Lib Dem Mike Ross in second place, as the clearest challenger to Reform UK in first.\nLabour’s candidate was in third place in YouGov’s poll.\nFact 4\nSupport for the Labour Party has fallen since they formed a Government last July…\nWhatever you may think about Keir Starmer’s Labour Government, opinion polling shows support for the Labour Party has fallen since the General Election.\nIn Hull, Labour were overtaken by the Lib Dems in local elections even before last year. The national media are saying they aren’t likely to do better now that they’re in Government.\nBut support for the Lib Dems is growing - in the fact of the threat of Reform UK.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_news-1_mike-announces-pound200000-for-tree-maintenance-and-gully-cleaning/content_14.html": "Ed Davey: Mike Ross is set to win in Hull and East Yorkshire\nEd Davey has backed Lib Dem candidate Mike Ross to win the Hull and East Yorkshire Mayoral Election and make history for the party, which is eyeing up its first ever metro mayor.\nThe Liberal Democrats have run a massive campaign in Hull and East Yorkshire. This is Ed’s second visit to the area for the campaign. The party has also sent a dozen Parliamentarians and hundreds of activists to the region.\nThe Liberal Democrats are the largest party across Hull and East Yorkshire with 50 Councillors across the respective councils - more than either the Conservatives or Labour.\nLiberal Democrat Leader Ed Davey said:\n“On Thursday, a vote for the Liberal Democrats is a vote for real and positive change. Mike Ross is the best candidate for the job and can win.\n“People across Hull and East Yorkshire are disappointed with the bad decisions Labour are making in government. Only a vote for the Liberal Democrats can send them a message this week.\n“While the Liberal Democrats have been working hard all year round, Reform UK have only turned up at election time. Nigel Farage doesn’t care about people around here, he just wants to use them for his own political gain.\n“Mike has a plan to improve transport and get action on the cost of living crisis. With your support, he will be banging on the door of the Government to make sure your community is no longer forgotten.”\nCommenting, Liberal Democrat candidate for Hull and East Yorkshire Mayor, Cllr Mike Ross said:\n“I love Hull and East Yorkshire. I’m the candidate with the right experience to do this job and I’m ready to hit the ground running from day one.\n“I want the best for people here. As Mayor, I could do so much more for our area, and I’ve got the right experience to deliver change.\n“I’ll fight tooth and nail to fix so many of the things that feel broken at the moment.\n“One thing is clear - on doorstep after doorstep, people are saying how let down they are by this Labour Government. If you want to send Keir Starmer a message this May, you need to vote Liberal Democrat.”",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_page-2/content_17.html": "Taking on Trump & Farage – and fixing church roofs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrats are now the bookies’ favourite to win the Hull and East Yorkshire Mayoralty, with candidate Mike Ross saying “the momentum is with the Liberal Democrats in Hull and East Yorkshire”.\nThe odds on Mike winning have now shortened to 6/4, as the Lib Dem campaign aims to land a historic victory.\nWinning the Hull and East Yorkshire Mayoral election would be the first time ever the Lib Dems have won a Metro Mayor.\nThe Liberal Democrats are warning voters that choosing the Conservatives, Reform or other parties will split the vote and let Labour win.\nThe Liberal Democrats are campaigning for:\nLib Dem candidate Mike Ross said:\n“The momentum is with the Liberal Democrats in Hull and East Yorkshire, we’re the bookies favourites to win. Voting for the Conservatives and Reform will just let Keir Starmer’s Labour win.\n“We have to send Labour a clear message - that they can’t let us down any longer.\n“From scrapping Winter Fuel Payments to introducing a new tax on family farmers, many people are feeling betrayed by Keir Starmer. Our area has been ignored by people in Westminster for too long.\n“The choice is clear - only the Liberal Democrats can beat Labour. A vote for anyone else means Keir Starmer will keep taking Hull and East Yorkshire for granted.”\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk/content_1.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nThe Liberal Democrats are now the bookies’ favourite to win the Hull and East Yorkshire Mayoralty, with candidate Mike Ross saying “the momentum is with the Liberal Democrats in Hull and East Yorkshire”.\nThe odds on Mike winning have now shortened to 6/4, as the Lib Dem campaign aims to land a historic victory.\nWinning the Hull and East Yorkshire Mayoral election would be the first time ever the Lib Dems have won a Metro Mayor.\nThe Liberal Democrats are warning voters that choosing the Conservatives, Reform or other parties will split the vote and let Labour win.\nThe Liberal Democrats are campaigning for:\nLib Dem candidate Mike Ross said:\n“The momentum is with the Liberal Democrats in Hull and East Yorkshire, we’re the bookies favourites to win. Voting for the Conservatives and Reform will just let Keir Starmer’s Labour win.\n“We have to send Labour a clear message - that they can’t let us down any longer.\n“From scrapping Winter Fuel Payments to introducing a new tax on family farmers, many people are feeling betrayed by Keir Starmer. Our area has been ignored by people in Westminster for too long.\n“The choice is clear - only the Liberal Democrats can beat Labour. A vote for anyone else means Keir Starmer will keep taking Hull and East Yorkshire for granted.”\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_page-3/content_2.html": "Free To Be Who You Are\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats are now the bookies’ favourite to win the Hull and East Yorkshire Mayoralty, with candidate Mike Ross saying “the momentum is with the Liberal Democrats in Hull and East Yorkshire”.\nThe odds on Mike winning have now shortened to 6/4, as the Lib Dem campaign aims to land a historic victory.\nWinning the Hull and East Yorkshire Mayoral election would be the first time ever the Lib Dems have won a Metro Mayor.\nThe Liberal Democrats are warning voters that choosing the Conservatives, Reform or other parties will split the vote and let Labour win.\nThe Liberal Democrats are campaigning for:\nLib Dem candidate Mike Ross said:\n“The momentum is with the Liberal Democrats in Hull and East Yorkshire, we’re the bookies favourites to win. Voting for the Conservatives and Reform will just let Keir Starmer’s Labour win.\n“We have to send Labour a clear message - that they can’t let us down any longer.\n“From scrapping Winter Fuel Payments to introducing a new tax on family farmers, many people are feeling betrayed by Keir Starmer. Our area has been ignored by people in Westminster for too long.\n“The choice is clear - only the Liberal Democrats can beat Labour. A vote for anyone else means Keir Starmer will keep taking Hull and East Yorkshire for granted.”\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_news-1_mike-pushes-for-a-better-environment-in-hull-and-east-yorkshire/content_15.html": "Ed Davey: Mike Ross is set to win in Hull and East Yorkshire\nEd Davey has backed Lib Dem candidate Mike Ross to win the Hull and East Yorkshire Mayoral Election and make history for the party, which is eyeing up its first ever metro mayor.\nThe Liberal Democrats have run a massive campaign in Hull and East Yorkshire. This is Ed’s second visit to the area for the campaign. The party has also sent a dozen Parliamentarians and hundreds of activists to the region.\nThe Liberal Democrats are the largest party across Hull and East Yorkshire with 50 Councillors across the respective councils - more than either the Conservatives or Labour.\nLiberal Democrat Leader Ed Davey said:\n“On Thursday, a vote for the Liberal Democrats is a vote for real and positive change. Mike Ross is the best candidate for the job and can win.\n“People across Hull and East Yorkshire are disappointed with the bad decisions Labour are making in government. Only a vote for the Liberal Democrats can send them a message this week.\n“While the Liberal Democrats have been working hard all year round, Reform UK have only turned up at election time. Nigel Farage doesn’t care about people around here, he just wants to use them for his own political gain.\n“Mike has a plan to improve transport and get action on the cost of living crisis. With your support, he will be banging on the door of the Government to make sure your community is no longer forgotten.”\nCommenting, Liberal Democrat candidate for Hull and East Yorkshire Mayor, Cllr Mike Ross said:\n“I love Hull and East Yorkshire. I’m the candidate with the right experience to do this job and I’m ready to hit the ground running from day one.\n“I want the best for people here. As Mayor, I could do so much more for our area, and I’ve got the right experience to deliver change.\n“I’ll fight tooth and nail to fix so many of the things that feel broken at the moment.\n“One thing is clear - on doorstep after doorstep, people are saying how let down they are by this Labour Government. If you want to send Keir Starmer a message this May, you need to vote Liberal Democrat.”",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_page-4/content_5.html": "Britain must lead on defence and aid\nThe UK needs to strengthen both our Armed Forces and our soft power.\nThe Liberal Democrats are now the bookies’ favourite to win the Hull and East Yorkshire Mayoralty, with candidate Mike Ross saying “the momentum is with the Liberal Democrats in Hull and East Yorkshire”.\nThe odds on Mike winning have now shortened to 6/4, as the Lib Dem campaign aims to land a historic victory.\nWinning the Hull and East Yorkshire Mayoral election would be the first time ever the Lib Dems have won a Metro Mayor.\nThe Liberal Democrats are warning voters that choosing the Conservatives, Reform or other parties will split the vote and let Labour win.\nThe Liberal Democrats are campaigning for:\nLib Dem candidate Mike Ross said:\n“The momentum is with the Liberal Democrats in Hull and East Yorkshire, we’re the bookies favourites to win. Voting for the Conservatives and Reform will just let Keir Starmer’s Labour win.\n“We have to send Labour a clear message - that they can’t let us down any longer.\n“From scrapping Winter Fuel Payments to introducing a new tax on family farmers, many people are feeling betrayed by Keir Starmer. Our area has been ignored by people in Westminster for too long.\n“The choice is clear - only the Liberal Democrats can beat Labour. A vote for anyone else means Keir Starmer will keep taking Hull and East Yorkshire for granted.”\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_news-1/content_13.html": "Ed Davey: Mike Ross is set to win in Hull and East Yorkshire\nEd Davey has backed Lib Dem candidate Mike Ross to win the Hull and East Yorkshire Mayoral Election and make history for the party, which is eyeing up its first ever metro mayor.\nThe Liberal Democrats have run a massive campaign in Hull and East Yorkshire. This is Ed’s second visit to the area for the campaign. The party has also sent a dozen Parliamentarians and hundreds of activists to the region.\nThe Liberal Democrats are the largest party across Hull and East Yorkshire with 50 Councillors across the respective councils - more than either the Conservatives or Labour.\nLiberal Democrat Leader Ed Davey said:\n“On Thursday, a vote for the Liberal Democrats is a vote for real and positive change. Mike Ross is the best candidate for the job and can win.\n“People across Hull and East Yorkshire are disappointed with the bad decisions Labour are making in government. Only a vote for the Liberal Democrats can send them a message this week.\n“While the Liberal Democrats have been working hard all year round, Reform UK have only turned up at election time. Nigel Farage doesn’t care about people around here, he just wants to use them for his own political gain.\n“Mike has a plan to improve transport and get action on the cost of living crisis. With your support, he will be banging on the door of the Government to make sure your community is no longer forgotten.”\nCommenting, Liberal Democrat candidate for Hull and East Yorkshire Mayor, Cllr Mike Ross said:\n“I love Hull and East Yorkshire. I’m the candidate with the right experience to do this job and I’m ready to hit the ground running from day one.\n“I want the best for people here. As Mayor, I could do so much more for our area, and I’ve got the right experience to deliver change.\n“I’ll fight tooth and nail to fix so many of the things that feel broken at the moment.\n“One thing is clear - on doorstep after doorstep, people are saying how let down they are by this Labour Government. If you want to send Keir Starmer a message this May, you need to vote Liberal Democrat.”",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_meetmike/content_6.html": "About Mike\nI have lived in Hull for decades and am really proud to call East Yorkshire my home.\nMy Background\nMy wife Shirley and I have been married for 17 years and together we raise two children. I love my family – they’re at the heart of everything I do to try to make this area a better place.\nShirley has worked in the East Riding for 20 years, both children are at the local school. Together, we enjoy walks in the countryside, seaside trips and sometimes the kids get to enjoy a Campaign Action Day or two!\nThis area is at the heart of our lives and I care so deeply about it. That’s why I’ve dedicated all my life to improving and serving it.\nMy Political Motivation\nPublic service, improving communities and caring for local people are the things that have got me up every morning of my 22 years as a Councillor.\nMy dad was a GP and my mum was a Councillor herself. Growing up and seeing their sense of duty and service is still what drives me today.\nMy values of Liberalism run through me. Fairness. Equality. Community. Those values matter deeply to me and I try to carry them through every role I have.\nThis is a massive election – for the people of East Yorkshire and the entire future of the region. Now more than ever we need someone with the energy, experience and connections to grab this political moment and make it a historic one for our area, our party and our people.\nMy Record of Campaigning for you\nI have lifelong experience as a campaigner. I delivered my first Lib Dem leaflet when I was 10 years old, my Mum was a Councillor in the 90’s and when I moved to Hull I was delighted to be elected to Hull City Council for the first time in 2002.\nSince then, not a year has gone by where I haven’t had a leading role in the City of Hull or a community campaign. I’ve worked with MPs, MEPs, business leaders, local community leaders and more – with it comes the responsibility of answering to local people at all times. I know what it takes to organise, inspire others, execute and deliver successful outcomes.\nMany of you reading this know the important work in being a local champion and that’s why I’m so excited to have the opportunity to fight this with you, together.",
  "https_www_mike4mayor_org_uk_/https_www_mike4mayor_org_uk_record/content_3.html": "Meet Mike Ross\nIn this local election, Mike Ross is best choice to deliver a fair deal for our community.\nMike has lived in Hull for over 20 years. He has dedicated his working life to tackling the challenges people in our city face and working on solutions.\nAs council leader, Mike has delivered real action to repair our roads, deal with congestion and support local communities in tackling crime. He has led campaigns to bring jobs and investment into our city - and is determined to get a fair deal for Hull.\nAs our new Mayor, Mike would give Hull a real voice - and make the sure the politicians down in London listen to us. He is the best candidate in this local election to fight Hull and East Yorkshire’s corner.\nMike’s Record of Change\nMike has a strong track record of getting things done for Hull and East Yorkshire.\nHe played a leading role in securing the region’s devolution deal – giving Hull and East Yorkshire the chance to elect its first metro mayor and unlock millions of pounds of investment from Westminster. As Leader of Hull City Council, Mike has shown he can deliver real change for our area.\nHis Work as a Councillor\n- Mike is the current Leader of Hull City Council (since 2022).\n- He’s previously been in charge of key areas like Education, Highways, and Community Safety.\n- He led the ‘Building Schools for the Future’ programme, rebuilding all of Hull’s secondary schools.\n- He’s chaired the Council’s Finance Scrutiny committee.\n- He’s represented Hull on both the Police Authority and the Fire Authority.\n- Mike has worked with local business groups – including the Institute of Directors, Hull Chamber of Commerce, and the Federation of Small Businesses – to raise Hull and East Yorkshire’s profile nationally.\n- He created the Crime Prevention Fund, which has put hundreds of thousands of pounds into improving community safety in Hull.\n- Mike has been elected as a local councillor eight times since 2002.\nIn the Community\n- Mike has been a school governor at Newland School and Lambert Nursery.\n- After the floods, he gave Ed Balls a tour of the damage to highlight the urgent need for better flood protection.\n- He helped stop the closure of St Nicholas Primary School.\n- He chairs the Laburnum Trust, which gives small community grants thanks to a bequest from Lord Wilson, a former Liberal MP and Peer.\nWorking with Local Business\n- Mike sits on the Humber Leaders Board, working with other council leaders on major issues like economic growth, transport and the Freeport.\n- He’s involved with Humber Future, promoting local business and attracting investment to the region.\n- He set up a group bringing together key business stakeholders across Hull and East Yorkshire.\n- Mike was part of the Humber Local Enterprise Partnership, which helped lay the foundations for the devolution deal.\n- And he worked with both businesses and government to help deliver the Hull and East Yorkshire devolution deal."
}