{
  "https_chionwurahmp_com_/https_chionwurahmp_com_mps-report-newsletter/content_12.html": "My latest Dear Newcastle Constituency Report is now up, check out what I’ve been up to & who I’ve been meeting as your MP – in Newcastle, UKParliament & online! OpenMP\nDear Newcastle April 2025: Dear Newcastle April 2025\nDear Newcastle March 2025: Dear Newcastle March 2025\nDear Newcastle February 2025: Dear Newcastle February 2025 Final\nDear Newcastle January 2025: https://chionwurahmp.com/wp-content/uploads/Dear-Newcastle-January-2025-1.pdf\nDear Newcastle March 2024: https://chionwurahmp.com/wp-content/uploads/Dear-Newcastle-March-2024-Final-1.pdf\nDear Newcastle April 2023 Final (1)\nClick below to read the February 2023 newsletter:\nClick below to read the January 2023 newsletter:\nClick below to read the December newsletter:\nClick below to read the November newsletter:\nClick below to read the October newsletter:\nClick below to read the August-September newsletter:\nDear Newcastle August-September\nClick below to read the June-July newsletter:\nClick below to read the May newsletter:\nClick below to read the March- April Newsletter!",
  "https_chionwurahmp_com_/https_chionwurahmp_com_constituency-corner/content_2.html": "Skip to content\nHome\nAbout Me\nMy Record\nMeet the Team\nNews\nNewsletter\nConstituency Corner\nFind Support\nContact Me\nHome\nAbout Me\nMy Record\nMeet the Team\nNews\nNewsletter\nConstituency Corner\nFind Support\nContact Me\nSearch\nSearch\nConstituency Corner",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2015_11_chi-thoughts-on-syria-and-voting-intention/content_23.html": "Dear Newcastle Central Constituents\nI have spent much of the weekend considering how I will vote on the question of whether the UK should extend airstrikes against Daesh/ISIS from Iraq to Syria, seeking out and weighing the evidence and the risks.\nI want to thank all of you who have written, emailed, tweeted, facebooked or stopped me in the street to share your thoughts. Most of you recognised what a difficult and complex decision it is. When I was selected to be the Labour Party Candidate for Newcastle Central I was asked what I thought would be the hardest part of being an MP. I said it would be this. I am not a pacifist, I believe our country is worth defending and our values worth fighting for. But the decision to send British Armed Forces into action is, rightly, a heavy responsibility.\nFor me it comes down to two key questions. The security of United Kingdom citizens, and the avoidance of civilian casualties. These are separate operational and moral questions but they are linked in that it is civilian casualties which help fuel the Daesh ideological that we cannot respect and value the lives of those who do not believe as we do. There is also the important question of solidarity with the French in the wake of their grievous and devastating loss; I shall come to that later.\nI listened very carefully to the Prime Minister as he set out the case for airstrikes on Thursday and I share his view that Daesh represents a real threat to UK citizens. However he did not convince me that UK airstrikes at this time would materially reduce that threat. The Prime Minister was clear that Daesh cannot be defeated from the air. The situation in Syria is complex and factionalised, with many state and non-state actors who may be enemies of our enemy and yet not our friend. The Prime Minister claimed there were 70,000 ground troops in the moderate Free Syrian Army but many experts dispute that number and the evidence does not convince me that they are in a position to lead an effective ground campaign. Bombs alone will not prevent Daesh obtaining money, arms and more recruits or launching attacks on the UK. The Prime Minister did not set out how we would do that, his was not a plan for security and peace in Syria with airstrikes a necessary support to it, but a plan to bomb Syria, with peace and security cited in support of it. That is not good enough for me.\nDaesh are using civilian population as human shields. Syrians in exile speak of the impossibility of targeting the terrorists without hitting innocent bystanders. I fear that bombing Raqqa to eliminate Daesh may be like bombing Gaza to eliminate Hamas – hugely costly in terms of the civilian population and ultimately ineffectual.\nYet the evil that Daesh perpetrate demands a response. President Hollande has called on us to join with French forces. I lived in Paris for three years, I spent time in just about every location that was attacked two weeks ago, I have many friends living in Paris now, I believe the French are our friends and allies and we should stand and act in solidarity with them, and all those who have suffered in Mali, Kenya, Nigeria, Lebanon, Tunisia and around the world.\nBut there are other ways to act as well as airstrikes. Britain is the only G7 country to meet its International Development commitments, we are already one of the biggest humanitarian contributors to stemming the Syrian crisis, we can do more not only in terms of supporting refugees but helping those still in Syria, whether living in fear of Daesh or Assad. We can show the world that our response is to build rather than bomb. The Prime Minister argues that without taking part in the bombing we will not have a place at the table for the reconstruction. I would think our allies would be reluctant to overlook our financial commitment.\nWe can also do more to cut off Daesh funding, targeting their oil wells, their revenues, their customers and their suppliers. This may not be as immediately satisfying as bombing the terrorists but it is a more effective means of strangling them.\nThe vast majority of the constituents who contacted me were against airstrikes. I agree with them for the reasons I set out above. I should say that I have had no experience of bullying or attempts at intimidation in reaching this decision, Newcastle Central is too friendly, frank, comradely and Geordie a constituency for that. But some have suggested that I should vote against airstrikes to ensure a ‘clear conscience’ ’. This is not the case. There will be more killings and innocent deaths whether there are UK airstrikes or not, we will all bear a portion of responsibility for them.\nI agree with everything you have said.\nI think Nigel Todds analysis is also very cogent. Initially after the Paris massacre I felt incensed. I too love France and first visited Paris in 1966 to see the finish of the Tour de France. I go back to France every year.\nBut in the cold light of day I cannot see what a UK contribution to the bombing would achieve. My mum was in London during the blitz and at the time of the V1 and 2 raids. She said it hardened rather than weakened people resolve. In fact she thinks that people adjusted to it as much as they could.\nAt this time the case for bombing isn’t compulsive in my view.\nHi Chi I totally agree with the decision this is something we should not become involved with as they: are already in our country and others they don’t need a reason to attack\nWell said, without a clear plan and a clear vision of what is to be achieved it is best not to act\nAs a member of your constituency I’m really pleased to read such a thoughtful statement and thrilled that you’ll be voting against air strikes. Thank you.\nHi Chi\nThanks for your thoughtful statement and I respect your decision. Heaven knows, I’d hate ever having to make such a decision myself.\nMy hope is that the Shadow Cabinet/PLP go for a free vote otherwise the consequences to the Party will be incalculable.\nYou’re right about Newcastle Central being an open minded branch and long may it continue\nNick\n.\nYour decision is the only credible one that can be made.\nI think all those who are pushing for more conflict are either being bribes, blackmailed, or stupid.\nThis is a no brainer. Stick with the trueth and you will do well 🙂\nGood for you on this decision, doing what is right is not difficult. I will tell you this one little thing, what we all want and need is PEACE, where can that be found? We have been steadily ruining this planet, OUR HOME for goodness sake, why? We have forgotten how to get in touch with the PEACE that lives within our heart and how can we possibly have peace if we do not know where it is or how to find it. It takes a special kind of person to show us how, so to this end I direct you to wopg.org, words of peace global and find YOUR peace then you can find out how to KNOW, not have an idea.\nDear Chi\nI do not live in Newcastle but I want to thank you from the bottom of my heart for coming to this decision and for going public with it. I have wanted to join the Labour Party all my political life but firstly I live in an area where the only realistic alternative was Lib Dem and supporting them kept a Tory out and secondly I could never forgive Blair and his team for taking us into more than 1 illegal war. Jeremy Corbyn has changed all that and I now feel I am a member of the party that is my spiritual home. As a mother and more recently a grandmother I hold all human life as sacrosanct – even those who perpetrate evil deeds and I am completely against war (although if any one tried to invade our country I would be there with my poker I assure you).\nI know you have had a difficult decision to make but the majority of Labour Members are anti bombing and those who voted for Jeremy knew his views and gave him the mandate anyway – I hope you can convince others in the PLP to vote against too.\nWith very best wishes\nMary Graham\nhi Chi,\nits a long time since we were both at kenton comprehensive you went and persued your carrier and i thought i was clever and left school and went into the army instead of staying on and taking a levels but the answer to your question is correct that air strikes in their present form wont make much of a differance and what we really need is a combined effort between air-strikes and boots on the ground even though i think the SAS is already there from what i was picking up from former colleagues of mine who are in the know!!!! this is the only way we are going to defeat ISSiS\nTime for the UK to lead the world in peace rather than being the USA’s wingman. Today I watched a footage of a Syrian father collecting the shreds of his children’s flesh from rubble created by Russian bombs. There has to be another way.\nFurthermore, I to listened to the Cameron’s statement; despite his conciliatory manner, I didn’t trust a word he said. I’ve yet to see him and this Government do anything that is the ‘interests of us all.\nI am heartened to read this. Thank you.\nWell set out argument. Thanks for sharing and thank you for voting against air strikes.\nI think you are making the right decision. To bomb Syria is going to harm civilians, cause more refugees, and entrench the support Isis has. As you say there must be better ways to harm Isis and their support.\nThank you for this reasoned outline which has helped me immensely to decide my position on this issue. May I take this opportunity to commend you for your thoughtful and compassionate approach.\nDear Chi\nThank for taking the time to so eloquently set out your thoughts and decision. I agree it is not an easy decision to make, and one that brings great responsibility. I agree with your position, and I also believe that bombing Syria is in effect playing into the hands of Daesh, as they want “the West” to be seen as aggressors.\nSo glad you’re voting against. Have asked my M.P. to do the same but sadly she’s a Tory and will vote for. Thanks for your integrity and courage. Bless you!\nI’m with you Chi\nYou’re doing the right thing, for the right reasons. Good on you.\nDear Chi,\nThank you for your concise explanation regarding your commitment to vote against British involvement in airstrikes on Syria.\nYour decision was obviously reached after long deliberation and for personal reasons. As a constituent and long-term West End resident may I applaud and support you in your stance on this issue.\nDrone and bombing campaigns will always cause more civilian casualties and are largely ineffective against guerrilla forces without accurate intelligence.\nMay I urge you to contnue to vote against the escalation of violence in the Middle East and bring up links between Britain/Saudi Arabia and Saudi?Daesh in the House.\nCheers,\nAdam Kasar\nI agree. Well done Chi!\nThank you, well reasoned and balanced comment, I totally agree with your decision\nBombing Syria will make a bad situation worse for so many reasons. Without ground troops there is no way bombing innocent civilians (ISIS will disappear, temporarily, whilst bombing takes place) can be justified.\nChi I think for absolutely spot on with this matter. The Americans have been bombing for a while now and has there been any real achievement? No. I’m pleased you have come to this decision and listened to a lot of people on this matter. We need to be doing a lot of other things first before we resort to air strikes.\nWell said!\nPlease do not vote to bombing Syria. I do not minimise the horror of the attacks in Paris, but adding more innocent deaths to the hundreds of thousands already killed in Syria is ineffective and immoral. The rage of revenge always causes more revenge in turn. Innocent people are always killed, some of the survivors will be in dispair, others will become terrorists.\nAlso there is no hard evidence that there is an army suitable for us to work with.\nI am in complete agreement with your views and pleased that you have referred to listening to the voices of the majority of Newcastle voters. Thank you for setting out your reasons for deciding to vote as you plan to – you have my support.\nThank you for your thoughtful response. I think it will help a lot of people who are wavering and may even change some minds. Best wishes. Ann\nI vote Labour however I am not a member of the party. I am relieved to read your response to the current situation regarding Daesh/IS with which I agree. Air strikes in Syria are not the answer to this problem and I support your activity to pursue a wider range of options to ultimately eliminate this threat. It is easy to write these words yet the effort to find the solution is going to take a lot of hard work and energy. I wish you well as you seek a way forward.\nThank you.\nThank you from the innocents who might now live because of your decision. They might not know that this debate is about to happen, but imagine how terrified they would be if they read our newspapers or watched our ‘news’.\nThank you\nVery proud of your stance, shows courage and common sense in equal measure.\n‘respect’, Chi: immensely glad hear u voting ‘gainst in th Vote: even more, your reflected rationale …\nWell put Chi thank you for stating your position on the action proposed by the prime minister, we have to find an alternative to the tried and failed actions, its easy to bomb but extremely hard to find a peaceful settlement. I wouldn’t trust any of the 70k friendly troops, there are some nasty groups with their own self interest. Keep arguing the case.\nVery well said Chi.\nSo glad you are voting against Syrian airstrikes. I am one of your constituents and am so relieved to discover you are taking this stance. Not an easy decision to make but I am content that this is the right approach.\nI support you and your decision which I believe is the right one\nDear Chi,\ni would just like to say I am immensely relieved at your decision not to sanction further violence, inevitably against the innocent.\nBest Wishes\nFarah\nReading this thoughtful, well argued, humanitarian responsé makes me proud to have voted Labour, and proud to have you as my MP.\nThank you for voting against this action and publicly and openly making it clear that your reasons for doing so were considered and based on evidence, not intimidation.\nI can’t convey my disapointment with the result, but it’s reassuring to know that the person who represents me and Newcastle Central voted with and for the people of the UK and the people of Syria.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_privacy-policy/content_6.html": "Privacy Policy\nLast updated: 12th April 2021\n1. Who we are\nOur website address is: https://chionwurahmp.com/\nThis page explains how we collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data. This is separate to how the national Labour Party uses your personal data and you should refer to their privacy policy for further information about this: www.labour.org.uk/privacy-policy\nThe Office of Chi Onwurah MP is the data controller as defined under the General Data Protection Regulation (“GDPR”) and responsible for your personal data (referred to as “we”, “us” or “our” in this privacy policy).\n2. Our contact details\nName: Office of Chi Onwurah Member of Parliament for Newcastle upon Tyne Central\nAddress: 24, 7-15 Pink Lane, Newcastle upon Tyne\nPhone Number: 0191 232 5838\nE-mail: chi.onwurah.mp@parliament.uk\n- Purpose of this Privacy Policy\nThis privacy policy aims to give you information on how we collect and process your personal data through:\n- your use of this website (including, but not limited to, any data you may provide through this website by, for example, signing up as a to receive communication’s on Chi Onwurah parliamentary activities.\n- engaging with us on third party websites and platforms.\n- Casework.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n- The type of personal information we collect\nThe office of Chi Onwurah MP will only collect and use personal information for the specific purpose for which it has been obtained.\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data), or data related to deceased individuals.\nWhen submitting sign up forms on this website, you may be asked for personal information. In each case, we will ask for your consent to use your information, and we will only use it for the purposes for which you provide it.\nWe currently collect and process the following information:\n- Names and email addresses of individuals who submit information to receive emails from Chi Onwurah MP to receive news and updates about her Parliamentary work.\n- How we obtained your personal information and why we hold it\nMost of the personal information we process is provided to us directly by you for one of the following reasons:\nProvided by you – directly\n- Because you have submitted information by email or via the website: https://chionwurahmp.com/ to receive emails from Chi Onwurah to receive news and updates about her Parliamentary and work;\n- Because you have contacted us by phone, WhatsApp, Facebook, Twitter or other social media\nProvided by you – indirectly\n- Your name and address is legally taken from the electoral register, in order for us to participate in the democratic process;\n- As you interact with our website, we will automatically collect technical data about your equipment, browsing actions and patterns – where this is strictly necessary to enable the delivery of the website to you, then these cookies will be downloaded automatically. We collect this personal data by using cookies and other similar technologies. We may also receive technical data about you if you visit other websites employing our cookies. Please see our cookie notice further down in this Privacy Policy for further information. You will have the option of declining cookies which are not strictly necessary for the delivery of the website if you do not wish to provide this kind of data to us.\n- Donating to the Party\nThe information we ask for is used to process your donation and, if you donate more than £500, to check that you are on the electoral register which is a legal requirement under the Political Parties, Elections and Referendums Act 2000. If you donate more than £1,500 to a Labour Party accounting unit (eg. Constituency Labour Party or the Scottish Labour Party) or more than £7,500 to the Labour Party nationally in the course of a calendar year, your name and the amount of your donation will be reported to the Electoral Commission for publication on their public register of donations to the Labour Party. Donation information will be stored in our membership database and used to keep you informed of Labour news, campaign and other opportunities to support the Party.\n- Legal basis to process personal data\nUnder the General Data Protection Regulation (GDPR), the lawful bases we rely on for processing this information are:\n- Your consent. You are able to remove your consent at any time. You can do this by contacting onwurash.mp@parliament.uk\n- Legal entitlement. MPs have a legal entitlement to your name and address from the electoral register, even where you have asked not to be contacted.\n- Public task. This may be used where we process personal data in the public interest (which has a clear basis in law).\n- Legitimate interests. We may contact you by post using this lawful basis, but we always ensure we balance your rights and freedoms against our proposed legitimate interest.\n- If you are a member of the Labour Party, we may rely on this lawful basis to contact you, where it is defined within the Party’s Rule Book.\n- How we store and retain your personal information\nYour information is securely stored at the Office of Chi Onwurah at 24, 7-15 Pink Lane, Newcastl upon Tyne NE1 5DW\nInformation submitted is securely stored and may be uploaded to our secure case work system https://conwurah.caseworkermp.com\nWe will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy.\nWe will regularly review the personal information we hold to ensure that its use is necessary and proportionate.\nWe will then securely and permanently dispose of your information by a secure shredding service and/or deletion from our computer system and electronic records\n9. Cookies and Analytics\n9.1 What are cookies?\nCookies are small text files that web servers give to browsers to store on users’ machines (computers, tablets or mobile devices). They enable the website to recognise requests as coming from the same browser. Cookies are designed to allow the website to recognise its users on subsequent visits, or to authorise other designated websites to recognise these users for a particular purpose. Cookies can be essential for the operation of an application or to improve the user experience. They can also be used to track user behaviour.\nInformation collected by cookies is classed as personal data.\nFor more information on cookies, their use and how to block them, you may want to visit www.aboutcookies.org.\n9.2 Managing cookies\nYou can set your browser to not accept cookies, but this may limit your ability to use the Services. You can also opt out of receiving interest-based ads from certain ad networks here (or if located in the European Union, here).\nIn your web browser (for example, Google Chrome, Microsoft Internet Explorer, Mozilla Firefox or Apple Safari), you can control which types of cookies you allow. Most browsers accept cookies automatically, but you can alter the settings of your browser to erase cookies or prevent automatic acceptance if you prefer. You can turn cookies on or off using your browser’s settings and you can also delete cookies and clear your browser’s cache (also known as your internet viewing history). Visit the ‘Options’ or ‘Preferences’ menu on your browser to change settings, and check the following links for more browser-specific information:\n- Google Chrome: https://support.google.com/chrome/answer/95647?hl=en\n- Microsoft Internet Explorer: https://support.microsoft.com/en-us/help/17442/windows-internet-explorer-delete-manage-cookies\n- Mozilla Firefox: https://support.mozilla.org/en-US/kb/cookies-information-websites-store-on-your-computer?redirectlocale=en-US&redirectslug=Cookies\nThe Information Commissioner has also provided guidance here: https://ico.org.uk/your-data-matters/online/cookies/\n-\nThird Party Links\nThis website may contain links to other websites, or embedded content from other websites. We are not responsible for the content or privacy practices of these websites.\nThis website may include links to third party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n- Information rights\nUnder data protection laws, you have rights including:\nYour right of access – You have the right to ask us for copies of your personal information.\nYour right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure – You have the right to ask us to erase your personal information in certain circumstances.\nYour right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights, though we may apply a basic administration fee where your information right is determined as being either “manifestly unfounded” or “manifestly excessive”. If you make a request, we have one month to respond to you, though an additional two months may be applied subject to the application of an exemption available to data controllers.\nPlease contact us at:\nAnthony Bone, 24, 7-15 Pink Lane, Newcastle upon Tyne NE1 5DW\n- How to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at:\nAnthony Bone, 24 , 7-15 Pink Lane, Newcastle upon Tyne NE1 5DW\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk\n- Changes to the Privacy Policy\nWe keep our privacy policy under regular review (at least on an annual basis) and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website and we encourage you to regularly check back for any updates about how your data is used",
  "https_chionwurahmp_com_/https_chionwurahmp_com_news/content_11.html": "I publish a newsletter every month discussing my work as the MP for Newcastle Central and West: Dear Newcastle. You can find copies of the newsletter here on the website.\nConstituency Corner\nAs part of my commitment to transparency, I publish statistics on the top issues constituents contact me about.\nYou can find these by searching for “Issues raised by constituents” or using the feed below.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_05_individual-issues-raised-by-constituents-april-2025/content_10.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2022_05_individual-issues-five-year-data-2016-to-2021/content_14.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2022_05_policy-issues-raised-by-constituents-2021-to-2022/content_16.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_05_policy-issues-raised-by-constituents-april-2025/content_3.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_01_policy-issues-raised-by-constituents-december-2024/content_13.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2017_02_chis-vote-on-article-50/content_20.html": "Chi voted against Article 50 tonight, and has recorded a video for her constituents to explain why.\nNeeds subtitles\nYour email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.\nNeeds subtitles",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2022_05_ppolicy-issues-five-year-data-2016-to-2021/content_18.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_about-me/content_4.html": "I was born in Wallsend, grew up on Hillsview Avenue in Kenton and went to Kenton School before studying Electrical Engineering in London. I have lived in many different cities around the world, without ever for a moment forgetting where I am from: Newcastle. My values and beliefs were formed in Newcastle based on the people I grew up with and my own experiences.\nMy family\nMy maternal grandfather was a sheet metal worker in the shipyards of the Tyne during the depression. My mother grew up in poverty in Garth Heads on the quayside. In the fifties she married my father, a Nigerian student at Newcastle Medical School. In 1965 I was born, whilst they were living in Long Benton where my father had a dental practise. I was still a baby when my father took us to live in Awka, Nigeria. But two years later the Biafran Civil War broke out bringing famine with it and, as described vividly in an Evening Chronicle article in 1968, my mother, my brother and sister and I returned as refugees to Newcastle, whilst my father stayed on in the Biafran army.\nThis early experience of the impact of war on ordinary families left me with a strong sense of my own good fortune in living in a peaceful parliamentary democracy where it is possible to bring about change without taking up the gun or the sword. I am not a pacifist, I believe that our country is worth defending and fighting for. But we do live in a democracy and, increasingly, there are international institutions at the European and global level to enable us to pursue and defend our legitimate interests through debate and discussion.\nMy education\nI benefited from a comprehensive, inspirational and free education for which I will always be grateful. I attended Hillsview nursery, infants and junior schools. A good start in a good school is critical in determining a child’s experience of education and the opportunities that it can bring. At Hillsview I learnt to enjoy learning, and to think that anything was possible. My mother made sure I understood how lucky I was to be able to walk two hundred yards to a great school when some children had to walk for hours to share a classroom with a hundred others.\nAt 11 I went to Kenton Comprehensive School. I studied for my O and A levels, but also played for our netball and hockey teams, had my first taste of public speaking and learnt to play the saxophone moderately badly. My education enabled me to hold my own with people from every walk of life, and to earn my living doing something I love, engineering. I want every child in Newcastle to have that opportunity. When I was 17 I was elected Kenton School’s MP in a mock election.\nMy working life\nNewcastle’s great industrial past was my inspiration to become an engineer and I enjoyed a fulfilling career in engineering after I graduated from Imperial College in 1987. I worked in hardware and software development, product management, market development and strategy for a variety of mainly private sector companies in a number of different countries – UK, France, US, Nigeria, Denmark. During this time I also studied for an MBA from Manchester Business School and gained Chartered Engineering status. As an engineer I specialised in building out infrastructure in new markets and standardising wholesale Ethernet access. My last role before entering parliament was as head of Telecoms Technology for Ofcom the Communications Regulator\nMy interests\nI have always campaigned for the causes I believed in. As a student I campaigned against the Federation of Conservative Students at Imperial College. Later I was very active in the Anti Apartheid Movement, and spent many years on its National Executive, and that of its successor organisation, ACTSA. Anti apartheid was one of the most successful popular movements ever and undermines the claims of those that believe real people are never interested in politics. People are interested in the politics that matters to them. Before being selected as Labour’s candidate for Newcastle I was on the Advisory Board of the Open University Business School, reflecting my belief in educational opportunity at every stage in life and for every level of ability.\nOutside of politics and work I enjoy music, reading and long walks in the countryside.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_03_policy-issues-raised-by-constituents-february2025/content_26.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_meet-the-team/content_8.html": "Tony\nSenior Caseworker\nBased in Newcastle in Chi’s constituency office, Tony deals with policy and individual issues.\nEmail: anthony.bone@parliament.uk\nAnne-Marie\nSenior Executive Assistant\nBased in the constituency office in Newcastle. Responsible for Chi’s diary in both Westminster and Newcastle, and co-ordinates roundtables and visits.\nEmail: annemarie.burke@parliament.uk\nEmma\nParliamentary Researcher\nBased in Westminster, assists Chi with her parliamentary duties, carrying out research into local, regional and international issues as required.\nEmail: emma.sharp@parliament.uk\nHolly\nCaseworker\nBased in Chi’s Newcastle constituency office, Holly deals with policy, individual issues and manages social media and events.\nEmail: hollynorthmore@parliament.uk\nRobert\nParliamentary and Policy Intern\nBased in Westminster . Responsible for Policy matters, social media management and Parliamentary business.\nEmail: robert.shannon@parliament.uk\nLucie\nCaseworker\nBased in Newcastle in Chi’s constituency office, Lucie deals with individual issues.\nEmail: lucie.francis@parliament.uk",
  "https_chionwurahmp_com_/https_chionwurahmp_com_my-record/content_9.html": "January 2022 – December 2023\nWorking for Newcastle\nAs part of my commitment to openness and transparency, I have published the constituency casework figures on my website each month, together with details of my meetings, visits and speeches.\nIn 2022 and 2023, I have worked closely with the Council, local and regional businesses, community groups, charities and universities to improve the lives of residents and speak up for the region. I have taken action on 6,631 cases raised by constituents who have contacted me for help with individual issues, and responded to a further 8,146 policy issues raised by constituents.\nWestminster Hall is a smaller debating chamber in Parliament for MPs to raise issues with Ministers. I secured and led a debate in Westminster Hall on the potential merits of Government support for the 200th anniversary of Robert Stephenson’s works. I also introduced a Ten Minute Rule bill to the House, the Bowel Conditions Assessment Bill, which required the Government to publish an assessment of incidences of bowel conditions and diseases.\nWorking for a fairer and better society\nI regularly spoke up for Newcastle on everything from the economy, jobs and skills to local health and transport services, to arts and culture. In September 2023, I was asked by Keir Starmer to continue in the role of Shadow Minister for Science, Research and Innovation in the new Science, Innovation and Technology team. I regularly speak about how science and innovation are key to our economy, key to our regional growth, and key to improving people’s quality of life. I have provided constructive criticism to the government, who continue to be mired in scandal: the Horizon Post Office Scandal, Partygate, and the ongoing cost of living crisis due to never ending Tory mismanagement.\nAs Shadow Minister for Science, Research and Innovation, I have spoken at many science-related events discussing Labour’s plans for government, from increasing women in STEM to the role of science and innovation in building up self-sufficient regional economies and tackling climate change. I have spoken for Labour in multiple debates on science and innovation. I also spoke in two Westminster Hall debates, called by colleagues, on Artificial Intelligence: Intellectual Property Rights and the Future of the Postal Services.\nWorking in Parliament:\nInside Parliament I have been very active. I asked 105 oral questions in 2022 and 2023, which is well above the average of 43 oral questions asked by MPs.\nI asked 1,202 written questions, while the average for most MPs is 338.\nMy attendance record at votes is also above average, at 77.7% in 2022 and 82.4% in 2023.\nAs a Chartered Electrical Engineer in the House of Commons, I have focussed on increasing the availability of independent, balanced and accessible analysis of science and technology issues.\nI am chair of the All-part parliamentary group for Africa & of the APPG for Diversity and inclusion in STEM, and of the APPG Creative Diversity. I am a member of APPGs on: Bangladesh, Commonwealth, Engineering, Ethnic Minority Business Owners, Infrastructure, Internet, Communications and Technology, Jazz Appreciation, Nigeria, North East, Nutrition: Science and Health, Open Banking and Payments, Scientific, Space, Trade out of Poverty.\nExpenses\nMy expenses are published regularly by the Independent Parliamentary Standards Authority (IPSA). You can view them on the IPSA website here.\nHow I have voted\nMy voting record is public and you can read more here.\nI have voted against a score of terrible pieces of government legislation, which fail to address the needs of people in Newcastle Central, e.g., the Anti-Strike Bill and the Public Order Bill.\nAs a front-bencher, I worked constructively with the government on the Draft Trademarks regulations, the draft Product Security and Telecommunications Infrastructure Regulations 2023 and the Draft Radio Equipment Regulations 2023, trying to improve the legislation where possible. I also scrutinised and tried to improve the Professional Qualifications Bill, the Draft Trademarks Regulations, the Data Protection and Digital Information Bill, and the Powers of Attorney Bill.\nWorking to change Parliament\nBeing an MP is an immense privilege. It is one I believe should be open to more people from different backgrounds, particularly women, those with disabilities, those from working class backgrounds and black and ethnic minorities. These are the groups which are under-represented in Parliament today.\nI have visited and spoken at many primary and secondary schools in Newcastle to emphasise the work done in Parliament and how this should be accessible to everyone. I have also spoken on request at many different organisations on the different ways to become an MP and the importance of holding MPs to account.\nI have encouraged constituents to visit me in Parliament and arranged many tours for them. I have met and spoken with hundreds of different community organisations, charities and businesses on many issues and been able to raise issues on their behalf as well as encouraging their participation in Parliament. I hope that in future Parliament will look more like the people we see on Northumberland Street.\n2021-2022\nWorking for Newcastle\nI have published the constituency casework figures on my website each month, together with details of my meetings, visits and speeches.\nDuring this year in Parliament, I collaborated with a wide range of businesses from Newcastle Central and the North East, as well universities, colleges and charities to represent the region and support my constituents. This year I took action on 3,559 cases raised by constituents who have contacted me for help with individual issues, and responded to a further 4,237 policy issues raised by constituents. These included individual queries for 1,196 constituents and 1,295 policy issues on a variety of Covid related matters.\nI secured and led two debates in Westminster Hall on Hadrian’s Wall in the west end of Newcastle and celebrating the Tyne Bridge.\nWorking for a fairer and better society\nI consistently spoke up for my constituents in Newcastle Central, and until November I was a joint Shadow Minister across the Department for Culture Media and Sport and the Department for Business Energy and Industrial Strategy (BEIS). Since November 2020, my brief covers only BEIS, as shadow minister for Science, Research and Innovation. The focus of my role has changed, but at the core has always been science and research, and its role in driving prosperity and security.\nI have frequently offered constructive criticism to the government, who in the last year have become increasingly mired in scandal: second jobs, Partygate, fraudulent Covid claims and now a cost of living crisis they seem unable to even understand let alone act on.\nWorking in Parliament\nInside Parliament I have been very active. I spoke 172 times – well above the average amongst MPs. I ask more written questions than most MPs – 630 in this time period.\nMy attendance record at votes is also above average, at 81% during this time period.\nAs a Chartered Electrical Engineer in the House of Commons, I strived to ensure that analysis of science and technology issues was fair and accessible.\nI am chair of the All-part parliamentary group for Africa & of the APPG for Diversity and inclusion in STEM, and of the APPG Creative Diversity. I am a member of APPGS on: Angola, Bangladesh, Commonwealth, Engineering, Ethnic Minority Business Owners, Infrastructure, Internet, Communications and Technology, Jazz Appreciation, Markets, Open Banking and Payments, Scientific, Space\nExpenses\nMy expenses are published regularly by the Independent Parliamentary Standards Authority (IPSA). You can view them on the IPSA website here.\nHow I have voted\nMy voting record is public and you can read more here..\nI have voted against a score of terrible pieces of government legislation, which fails to address the needs of people in Newcastle Central, e.g. Police, Crime, Sentencing and Courts Bill, the Elections Bill, the Health and Care Bill, Nationality and Borders Bill most of which reached completion in the final weeks of the parliamentary session. As a front-bencher, I worked with the government on the ARIA and National Security and Investments Acts, trying to improve the legislation where possible, as well as on the early stages of the Online Safety Bill. I also scrutinised and tried to improve the Telecoms Security and Telecoms Infrastructure Acts.\nWorking to change Parliament\nDespite the challenges of Covid19 I have visited and spoken at many primary and secondary schools in Newcastle to emphasise the work done in Parliament and how this should be accessible to everyone. I have spoken on request at many different organisations on the different ways to become an MP and the importance of holding MPs to account. In the constituency I have met with more than ten faith groups, forty community and charity groups and fifty local businesses.\n2016-2021\nWorking for Newcastle 2016-2021\nBetween 2016 and 2021 I took taken action on behalf of 14,679 cases raised by constituents who have contacted me for help with individual issues, and responded to 17,868 policy issues raised by constituents.\nEach week, I received around 2,000 emails, letters and phone calls. An uplift in enquiries as a result of the Covid pandemic was noticeable from March 2020, with around 100 individual and 100 policy queries additional each month.\nDiscussing the issues needing to be addressed by the Online Harms Bill\nDuring this time I secured and led three debates in Westminster Hall, on Internet of Things regulation, the State pension for WASPI women and Martin Luther King’s visit to Newcastle.\nI secured five Adjournment debates, on Visa Processing Algorithms, Electric Car Batteries, Newcastle United FC and regulation, Sexual exploitation in Newcastle, and the leasehold for St Mary Magdalene Holy Jesus Trust.\nI presented four petitions on behalf of constituents, on violence in Lagos, on Premier League Transparency, Football club ownership, and the implementation of 1995 and 2011 Pension Acts.\nWorking for a fairer and better society 2016-21\nAs well as frequently speaking up for Newcastle, I have been a Shadow Minister to the Department for Business Energy and Industrial Strategy (BEIS). The focus of my role has changed, but at the core has always been science and research, and its role in industrial strategy.\nLocal meeting in Newcastle central to discuss ASB issues\nI was also a Shadow Minister in the Department for Culture Media and Sport from 2020-21. My focus was on the digital economy, and I pushed the government on online safety, data protection and regulation for new technologies e.g. the Internet of Things, AI.\nI was also proud to be the shadow minister for the Post Office. I led the response on the Horizon scandal in the Post Office, where thousands of postmasters and postmistresses were falsely accused and even imprisoned for fraud they did not commit, one of the greatest injustices of our time.\nI have also scrutinised legislation on committees. Most of the committee work focused on legislative changes for leaving the EU, e.g., on Intellectual Property, Electronic Communications, changes to the Communications Act (2003).\nWorking in Parliament 2016-2021\nInside Parliament I have been very active. I spoke 758 times – well above the average amongst MPs. I asked more written questions than most MPs – 1951 in this time period, which averages 2.6 questions per sitting day of Parliament.\nMy attendance record at votes was also above average, rising to 81% in the 2017-19 period from 72% in 2015-17.\nExpenses\nMy expenses are published regularly by the Independent Parliamentary Standards Authority (IPSA). You can view them on the IPSA website here.\nHow I have voted: 2016 – 2021\nMy voting record is public and you can read more here.\nThe legislative agenda from 2016-19 was dominated by leaving the EU. Most notably, I voted against triggering ‘Article 50’ to leave the EU and I explain why here. I consistently voted for a ‘soft’ as possible Brexit, as I believed the impact of leaving the EU would be hugely damaging for my constituents. I did so respecting the outcome of the referendum, but wanting to see the UK get the best deal out of the negotiations.\nSince re-election in 2019, I have voted against a score of terrible pieces of government legislation, which fails to address the needs of people in Newcastle Central, e.g. Police, Crime, Sentencing and Courts Bill, the Elections Bill, the Health and Care Bill. As a front-bencher since 2019, I worked with the government on the ARIA and National Security and Investments Acts, trying to improve the legislation where possible.\nClearly, Covid-19 was the most important issue facing the country from 2020. I gave constructive criticism to the government in a time of national crisis along with Labour colleagues, trying to keep people safe and prevent the fraudulent and corrupt activities that we are now getting the full detail of.\nWorking to change Parliament 2016-2021\nI was temporarily successful in securing online voting and participation in debates as an important safety measure during the pandemic, which the government have sadly since reversed despite it being a success and having the potential to free up MPs from having to always be in Westminster.\nFrom 2016-2021 I have visited and spoken at many of the primary and secondary schools in Newcastle to emphasise that Parliament belongs to everyone and should be accessible to everyone. I have encouraged constituents to visit me in Parliament and arranged dozens of tours for them. I have met and spoken with hundreds of different community organisations, charities and business on many issues and been able to raise issues on their behalf encouraging their participation in Parliament.\n2010-2016\nWorking for Newcastle 2010-16\nBetween 2010 and 2015, I took action on 15,478 cases raised by constituents who have contacted me for help with individual issues, and responded to a further 23,516 policy issues raised by constituents.\nI secured and led eleven debates in Westminster Hall, including a debate on Housing in Newcastle. Topics of debates I have secured include North East council funding, the internet of things, health inequalities in the North East, transport in the North East and mitochondrial disease (which Newcastle University has been pioneering research). I have also secured several Adjournment Debates – short debates at the end of each parliamentary day. One such debate on the planned closure of the Richardson Eating Disorder Unit in Newcastle resulted in a Ministerial meeting which saved the unit – the only one in the region – from closure.\nSchool visit and discussion in Newcastle Central\nI presented three petitions on behalf on constituents, one on the Blaydon Races, one opposing plans for a Drivethru McDonalds at Kenton Lodge and one on young people and body image.\nAs a Chartered Engineer I campaigned to make ICT and engineering more accessible to all, particularly girls, and to bring engineering and ICT jobs to the North East.\nWorking for a fairer and better society 2010-16\nAs well as regularly speaking up for Newcastle, I was the Labour Party’s Shadow Minister for Culture and the Digital Economy. It was my job to scrutinise the Government on its disastrous broadband policies and to speak up for libraries and the importance of the digital economy to the UK.\nI then became the Shadow Cabinet Office Minister for Digital Government, cyber security and social enterprise. In this role I commissioned a Review of Digital Government, set out how a Labour Government will support social enterprise, and led the Opposition’s scrutiny at all stages of the Deregulation Act 2015 in the House of Commons. I promoted the North East as a hub for both digital industries and social enterprise, holding a seminar in Newcastle on how small businesses could benefit from digital government.\nI also sat on the Business, Innovation and Skills Select Committee and scrutinised themEnterprise, Regulatory Reform Act 2013 as a Shadow Business Minister.\nWorking for Parliament 2010-16\nInside Parliament I was very active, speaking 48 times since being re-elected in May 2015 – well above the average amongst MPs. I asked more written questions than most MPs – 214 since the election – and my attendance record at votes was also above average, at 77%.\nAs well as continuously speaking up on the need for independent and accessible analysis of science and technology issues as a Chartered Electrical Engineer, I was on the board of Parliament’s Office of Science and Technology.\nI was chair of the All-party parliamentary group for Africa and co-chair of the all-party Parliamentary Internet, Communications and Technology Forum that works to keep MPs, Peers and other interested groups informed of digital issues in Parliament.\nExpenses\nMy expenses are published regularly by the Independent Parliamentary Standards Authority (IPSA). You can view them on the IPSA website here.\nHow I have voted: 2015 – 16\nMy voting record is public and you can read more here.\nI voted against George Osborne’s Budget cuts to Personal Independent Payments for disabled people and his disgraceful plans to cut £4.4bn in tax credits to working families. The Government eventually backed down on both.\nI voted in favour the ‘Dubs Amendment’ to act on Save the Children’s call for Britain to take 3,000 unaccompanied refugee children.\nI voted against the Government’s forced academisation plans. The Education Minister has since announced that they are abandoning the plans.\nI voted against the Government’s politically motivated attacks designed to permanently weaken the opposition and the trade union movement in the Trade Union Bill. The Government eventually backed down on\nOn Syria, I asked constituents to send me their views on whether the UK should extend airstrikes against Daesh/ISIS from Iraq to Syria. The vast majority of the constituents who contacted me were against airstrikes and after thinking very carefully about it, I agreed with them and voted against the proposal. I set out my reasoning here.\nI opposed the Tory Housing Bill, which will leave a £593m hole in our city’s long term plan for social housing as well as forcing the council to sell off higher value properties. In May 2016 I secured a debate in Parliament on Housing in Newcastle.\nI voted repeatedly against the Government’s vicious bedroom tax.\nI voted against the Government’s £3bn reorganisation of the NHS at every opportunity. I voted against marketisation and in favour of restricting the use of NHS services for private patients. I also moved to block regulations that would open the NHS up to further marketisation.\nOn tax, I voted against the Government’s tax cut for millionaires and corporation tax. I have voted against rising VAT, as it hits the poorest hardest.\nI voted against raising tuition fees cap to £9,000.\nI voted against this Government’s unfair council funding allocations, which meant that Newcastle had to make £100m of cuts, whereas some Councils in richer areas ended up with few or even no cuts to make.\nMany constituents contacted me about the vote for equal gay rights and same-sex marriage. A large majority wanted me to support it, and I did.\nI voted against the privatisation of Royal Mail and restrictions on legal aid.\nI voted to recognise Palestine as a state and believe that both Israel and Palestine deserve safety and security and control over their own destinies.\nI also voted against selling off our forests, which was stopped.\nWorking to change Parliament 2010-16\nI visited and spoke at every secondary school in Newcastle and 24 of the 26 primary schools to emphasise that Parliament belongs to everyone and should be accessible to everyone. I have encouraged constituents to visit me in Parliament and arranged dozens of tours for them. I have spoken on request at many different organisations on the different ways to become an MP and the importance of holding MPs to account.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_04_nhs-waiting-lists-fall-every-month-for-the-last-6-months/content_5.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_04_very-sad-to-hear-of-prohibition-closing-ive-heard-such-great-music-there/content_19.html": "Very sad to hear of Prohibition closing – I’ve heard such great music there\nVery sad to hear of Prohibition closing, I’ve heard such great music there, jazz, blues, soul, folk, as well as playing bingo and celebrating important birthdays.\nI am hoping we can find a way to keep this great Newcastle live music asset.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_05_chi-holds-debate-in-parliament-on-the-occupied-palestinian-territories/content_24.html": "Occupied Palestinian Territories – debated on Wednesday 30 April 2025\nChi Onwurah\n(Newcastle upon Tyne Central and West) (Lab)\nIt is a great privilege to have secured this Adjournment debate on Government support for the people in the Occupied Palestinian Territories, but I regret immensely the need to do so. I, like most of the world, was horrified by Hamas’s attack on Israel and Hamas’s killing and kidnapping of Israeli citizens. I supported, and continue to support, Israel’s right to self-defence in response to that attack.\nI also know that today—at least when the sun sets—will be Yom Ha’atzmaut. That is Israel’s Independence Day, when many Israelis will be celebrating their country. None the less, I am here today to ask three principal questions of the Government. First, what more can they do to support the people of Palestine? Secondly, what can the British public, particularly my constituents in Newcastle upon Tyne Central and West, do as individuals and as a community to support the people of Palestine? Thirdly, if the Government believe that there is nothing more we as a Government, as a nation or as individuals can do to support the Palestinians, could the Minister please inform the House, so that we may so inform our constituents? I said I had three questions, but in actual fact I have 12 questions for my hon. Friend the Minister, and that I will be counting them as I ask them and as she replies; this is a very important subject, and there is a lot to cover.\nThe north-east of England may seem far away from Gaza and the west bank—it may even seem far away from London to some—but 24 hours a day the consequences of Israel’s humanitarian blockade and use of weapons of modern warfare against civilians plays out on family televisions and social media platforms in the north-east, as it should. My constituents watch as the body of a five-year-old girl is pulled from beneath the wreckage of a car she was riding in with her family—a car that the Israel Defence Forces attacked with the most powerful weapons of modern warfare. My constituents watch a 20-day-old baby in Gaza, wrapped in a blanket by that baby’s hysterical relatives, frozen to death in a sub-tropical country—the fifth child to die from hypothermia in Gaza in six days last winter. My constituents watch one by one the deaths of the 100 Palestinian children the Israel Defence Forces killed or maimed every day in the 10 days from 21 to 31 March.\nI know that my constituents see this because they stop me in the street in Newcastle—in Grainger Market when I am buying my vegetables, on the West Road when I am visiting local businesses, when I play bingo in Blakelaw, when I visit cultural centres in Benwell and Scotswood, support community centres in Fenham and knock on doors in Lemington. They ask me, “What can we do to stop the suffering we see?”\nI also know this because they write to me. One wrote:\n“I kindly request that you please advocate for the people of Gaza in Parliament, as they too have the right to defend themselves, they too have the right to feel safe, to live in peace and enjoy freedom and liberty without occupation, colonisation or terrorism.”\nAnother said:\n“As a Jewish constituent of yours, I am very concerned about our Government’s relative silence regarding Israel’s abandonment of the Gaza ceasefire agreement, brokered by Qatar and Egypt. It is utterly deplorable that Israel is once again slaughtering Gazan civilians.”\nI quote another constituent:\n“What is the Government doing to stop the killing of Palestinian people?”\nAnother wrote:\n“We are witnessing the most horrific of nightmares unfold. Trapped. Starved. Bombed. Surrounded by Israeli forces, with many of those who try to flee being shot at. Palestinians in north Gaza are living under a suffocating siege. Children are being bombed when they play on street corners. In central Gaza, people are being burnt alive in tents that were made to protect them. The UK must act urgently to protect Palestinians from extermination in Gaza.”\nFinally, a constituent said:\n“Last week, a new UN report detailed Israel’s sexual and reproductive violence: like the killing of pregnant women, the rape of male detainees, the destruction of an IVF clinic with its 4,000 embryos. Waging war on Palestinians’ ability to reproduce were termed ‘genocidal acts’. Last week, Israel’s environment Minister declared the ‘only solution for the Gaza strip is to empty it of Gazans’. I could go on as it seems there are limitless examples of other such acts. How can these actions so documented, evidenced and confessed to—facilitated by western weapons and diplomatic support—continue? No one in UK politics or media circles can plausibly say, ‘I did not know what was really happening’.”\nI thank my hon. Friend for his intervention. I am pleased, though not surprised, to hear that the people of Wolverhampton West and the people of Newcastle upon Tyne Central and West, as well as people across our country, have a similar response to the horrific acts and suffering they are seeing. As I will set out in my remarks, my objective is to ask—indeed, to demand—what more we can do, and will do, to ensure that the suffering comes to an end.\nThe examples that I read out are just a minute sample of what my constituents write and say to me. I have had hundreds and hundreds of emails, letters and exchanges on the streets of Newcastle. I emphasise that while many of the constituents who raise issues are Muslim or of Muslim heritage, many more are not. Many Christians were particularly appalled by the Israeli Government’s Palm Sunday attack on the al-Ahli hospital in Gaza, run by the Anglican diocese of Jerusalem—as a statement from the House of Bishops, supported by the Right Reverend the Lord Bishop of Newcastle Helen-Ann Hartley, has emphasised. That is why I am here: to address and demand action in relation to the horror and despair my constituents feel about the consequences of the Israeli Government’s blockade on humanitarian\naid to Gaza and the Israeli Defence Forces’ killing of Palestinian civilians, particularly children, in Gaza and the west bank.\nMy constituents simply do not believe that we as a nation, a people and a leading voice in the world community are helpless to affect in any way the behaviour of the Government of Israel—a nation with which for decades we have enjoyed friendly relations and strong diplomatic ties. It is a nation that many of us believed shared our values, our commitment to human rights and democracy, and our principled opposition to racism and ethnic cleansing.\nAt some level, we are all aware of the extremely long and complex history of what is now the state of Israel and the Occupied Palestinian Territories of the west bank and Gaza, and the intertwining of the modern part of that history with both the British empire and the Holocaust. I do not wish to retell that story, as although I think this Adjournment debate will go on for longer than was anticipated, it cannot be long enough to do full justice to that history, so instead I will start from 7 October 2023.\nOn that day, Hamas and other armed Palestinian groups based in Gaza launched a sickening attack on Israel that killed over 1,200 Israeli men, women and children in horrific circumstances. Hamas and their allies kidnapped 251 Israelis and other nationalities and held them as hostages. My constituents were, as I was, absolutely horrified by those events, and supportive of the Israelis as victims of horrible crimes and, as a nation like ours, entitled to exercise their right to self-defence.\nThe stories of the experiences of Israelis—some facing their last moments—inspired huge sympathy and understanding among the people of the north-east. We stood with Israel in its demand that the hostages be immediately released and recognised that Israel had a right to defend itself and a right to strike against Hamas.\nFive hundred and seventy-one days of violence have followed, with two periods of ceasefire—seemingly endless days of the world’s most powerful weapons being used against civilians by one of the world’s most powerful militaries. I just want to emphasise that Israel is the 15th most powerful nation in total firepower, according to Global Firepower. Gaza’s Hamas-controlled Ministry of Health has reported that between 7 October 2023 and 8 April 2025, the Israel Defence Forces have killed 51,000 Palestinians and injured over 100,000. Their numbers include 166 journalists and media workers, 120 academics and more than 224 humanitarian aid workers.\nEstimates of the proportion of the dead in Gaza who are civilians range from the Israeli newspaper Haaretz’s 61% to the Euro-Med Human Rights Monitor’s estimate of 90%. A detailed study of bodies found in Gaza residential buildings by the United Nations High Commissioner for Human Rights found that 44% were children and a further 27% were women, which makes a total of 71% and suggests that the total when civilian men are included is likely to be closer to 90% than 61%. A joint report by Oxfam and Action on Armed Violence in October 2024 found that the Israeli military had killed more women and children in Gaza than had been killed in any other conflict around the world in the past two decades. These numbers do not include deaths from disease and malnutrition.\nIsrael has contested some numbers provided by the Gaza Health Ministry, but early in the war, Israel Defence Forces officials told The Times of Israel that approximately 66% of the Palestinian casualties in Gaza were civilians. Given that Israel does not provide its own figures for civilians killed in Gaza, nor does it permit UN fact-finders, international journalists or the BBC to enter Gaza, we must go with other sources. In January 2025, a peer reviewed study in The Lancet, the UK’s premier medical journal, suggested that the Gaza Ministry of Health was undercounting the death toll by 41%. If that study is accurate, it is likely that the death toll in Gaza as a result of Israel’s military operations today stands at over 90,000. In addition, 70% of all structures in Gaza have been destroyed by the Israelis.\nThere were audible sighs of relief across the country, and indeed the world, at the ceasefire of 19 January this year. However, on 18 March, Israel launched what it called “extensive strikes” in Gaza. Earlier in March, Israel’s Government blocked humanitarian aid from entering Gaza. No supplies, including food and medicine, have entered Gaza in over seven weeks and 95% of aid operations in Gaza have been suspended or dramatically cut back. A joint statement issued on 17 April by a dozen aid organisations based in multiple countries, including Oxfam, CARE and Save the Children, confirmed that they had all the means necessary to deliver aid, but were being denied access to Gaza by Israeli authorities.\nInfectious diseases, particularly those that affect children, are now on the rise. The World Food Programme announced three days ago that despite more than 116,000 tonnes of aid being ready at the border, 91% of Gaza’s population, which is 1,802,000 people—human beings —face\n“high levels of acute food insecurity”.\nThat is basically international aid jargon that means malnutrition and actual starvation. This is my fourth question for my hon. Friend the Minister. Can she confirm that that is the Government’s understanding of the humanitarian situation in Gaza today?\nI will move on to what can be done to support the Palestinians in Palestine. I know that the Government are taking action by pressing for an immediate ceasefire and the release of the hostages, increasing funding to the United Nations Relief and Works Agency, signing a memorandum of understanding with the leader of the Palestinian Authority, condemning settlements and settler violence in the occupied west bank, sanctioning settler groups involved in violence, and undertaking a comprehensive review of arms sales to Israel, which has resulted in the suspension of some arms transfers. I have also been advised that pressure on Israel would be more effective if the Palestinian high commissioner in Jerusalem and the UK ambassador to Israel in Tel Aviv were able to work more closely together. Could the Minister tell me if that is happening or if that is the case? That is question five.\nI greatly welcome the fact that the Prime Minister of the United Kingdom has stated that the Israeli Government’s\nHowever, the Israeli Government continue to kill Palestinian civilians, particularly children, and continue to prevent the flow of food, medicine and other humanitarian supplies into Gaza. My constituents ask me what the Government are doing to end that, and that is the question that I repeat to my hon. Friend the Minister. Specifically—question six—will the UK respond to the International Court of Justice’s summer ruling on the legality of the Israeli occupation, and will the UK support the current case before the ICJ on humanitarian access in order to better hold the Israeli Government to account?\nI shall turn now to what my constituents can do directly to support the Government in supporting Palestine, and to support Palestine directly. Newcastle, as I hope all Members are aware, has a long history of support for social justice and international solidarity. The people of Newcastle upon Tyne Central and West want to know how they can support the people of Palestine, so can the Minister tell me if the Government support the right of my constituents to protest and to show their horror at the death and destruction in Palestine? If so, how?\nMoney matters, so can my constituents support the people of Palestine through the way in which they spend or do not spend their money? Are there goods and services that they can buy from Palestinians? Is it clear what goods are from the illegally occupied Palestinian territories and what goods are from Israel? How can my constituents distinguish between the two? That is question eight.\nGeordies are famously generous, and my constituents want to know how they can help Palestinians through their charitable giving without helping Hamas. With aid rotting at the border, which non-governmental organisations or charities does the Minister recommend my constituents support to ensure that aid gets through? On social media, there are regular appeals from GoFundMe accounts to help victims of Israeli military strikes or the blockade individually. Does the Minister recommend that my constituents provide funding to those appeals, and if not, how can they provide support to the people they are watching die on their screens?\nAlternatively, are there other organisations to support advocacy efforts, legal aid and other forms of assistance that do not rely on physical access to Gaza itself? The UN Human Rights Council has identified what it calls “clear evidence” of war crimes being committed by Israel in its conflict with the Palestinians. The International Criminal Court intends to investigate the evidence of war crimes, but—question 11—what can my constituents do to support the survivors of war crimes on the ground? Finally, how can my constituents support constructive engagement between Palestinians and Israelis? That is question 12.\nEvery day, the people of Newcastle express to me how intensely they want their Government to act and how intensely they wish to directly and personally support the people of Palestine and help end their suffering. In the future, I believe we will all be asked what we did in the face of this horror. I urge the Minister to advise the people of Newcastle what the Government are doing to stop the Israeli Government’s killing of civilians, particularly children, and their blockade on food and medicine reaching the people of the Gaza strip, and to advise us on what we as individuals and as a community can do. If nothing more can be done by the British Government, in addition to what the Minister and the Foreign Office have talked about and the announced actions that have not resulted in the lifting of the blockade or the ending of Israeli strikes on Gaza, can the Minister be clear about that? If my constituents are condemned to watch the Israeli Government use their tanks, artillery and war planes against apartment buildings, tent encampments and family cars, and to watch dead toddlers being pulled from the rubble of their homes on the 10 o’clock news every night, please tell us.\nI thank the Minister for her comments. She mentioned that the settlements in the Occupied Palestinian Territories are illegal. One of the questions I put to her was about distinguishing between goods from illegal settlements in the Occupied Palestinian Territories and goods from Israel so that my constituents can make decisions about what they purchase.\nhttps://hansard.parliament.uk/Commons/2025-04-30/debates/DBF3934D-6077-4928-89E3-76AA76AA34B3/OccupiedPalestinianTerritories#contribution-9BE234B0-8C9E-4DEA-A70E-BA6A9CEAE53A\nRelated",
  "https_chionwurahmp_com_/https_chionwurahmp_com/content_1.html": "Your strong, local voice in Parliament\nWritten questions submitted\n0\n+\nTimes spoken in the House of Commons\n0\n+\nTimes voted in the House of Commons\n0\n+\nConstituent cases helped\n0\n+\nLatest News\nMay 2, 2025\nNo Comments\nMay 2, 2025\nNo Comments\nMay 1, 2025\nNo Comments\nApril 29, 2025\nNo Comments",
  "https_chionwurahmp_com_/https_chionwurahmp_com_find-support/content_7.html": "If you’re a constituent in Newcastle Central and West and are experiencing difficulty, please contact me at any point if you think I can assist you. I am here to work for you and I have supported over 49,000 constituent cases since I was first elected in 2010.\nMany organisations in Newcastle can provide help and advice if you are experiencing difficulty. National charities can also be a source of assistance.\nMy team can help signpost you to places that can help you, or take up issues on your behalf, but the details of these organisations are provided below if you wish to contact them directly.\n- Newcastle City Council: https://www.newcastle.gov.uk/cost-living-support\n- Food Banks in Newcastle: https://www.informationnow.org.uk/article/food-banks-in-newcastle/\n- Connected Voice: http://www.connectedvoice.org.uk/cost-living-support\n- CAB Newcastle: Tel: 0808 278 7823 http://www.citizensadvice-newcastle.org.uk\n- Newcastle Welfare Rights: Tel: 0191 277 2627 https://www.newcastle.gov.uk/services/welfare-benefits/welfare-rights\n- Disability North: Tel: 0191 284 0480 Email: reception@disabilitynorth.org.uk\n- Warm Places & Wellbeing Hubs: http://www.newcastle.gov.uk/cost-living-support/winter-wellbeing-hubs\n- National Energy Action: Tel: 0800 304 7159 http://www.nea.org.uk/get-help/\n- Help for Households: https://tiny.cc/hza1vz\n- Age UK Information and Advice: Tel: 0800 055 6112\n- Tyneside Mind: Tel: 0191 477 4545 https://www.tynesidemind.org.uk\n- Information for People in Newcastle: https://mailchi.mp/3d1321ef078c/infonow-news-is-out-now?e=ae9f0d7461\n- James Place (Help for Suicidal Men): https://www.jamesplace.org.uk/",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2022_05_individual-issues-raised-by-constituents-2021-to-2022/content_22.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_04_house-of-commons-adjournment-debate-on-wednesday-30th-april-on-government-support-for-people-in-the-occupied-palestinian-territories/content_17.html": "Skip to content\nI have secured a House of Commons Adjournment debate on Wednesday 30th April on Government support for people in the Occupied Palestinian Territories.\nIf you are a constituent and have ideas for support for Palestinians or other points to make email: chi.onwurah.mp@parliament.uk\nRelated",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_01_individual-issues-raised-by-constituents-december-2024/content_15.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed.",
  "https_chionwurahmp_com_/https_chionwurahmp_com_contact-me/content_25.html": "How Can I Help YOU?\nI can raise your issues with government departments, agencies, and local businesses.\nI can also raise your issues in parliament including petitions, questions, debates, an amendment to a bill, your very own bill, local issues, and guidance.\nGet in touch with your issues or speak to me directly via our digital surgeries.\nPlease note that due to strict Parliamentary protocol, I am only able to assist Newcastle Central and West constituents. If you live in another constituency, please contact your local MP.\nSurgeries\nMy surgeries are now held at the central library or online on the 1st and 3rd Friday of every month. To make an appointment please contact my office by:\nemailing chi.onwurah.mp@parliament.uk\nor calling 0191 232 5838.\nWhen contacting us please include your name, address, phone number and an outline of the issues you wish to discuss, including relevant reference numbers or times & dates of the events, thank you.\nNext Surgeries\nI offer both Face to Face and online surgeries.\nPlease book a session slot before you turn up.\nFace to Face surgeries take place:\n1.00pm-2.00pm on First and Third Friday of the month at Central Library\n4.00pm-4.45pm on First Friday of the month at West End Service Centre\nOnline surgeries are held via Zoom:\n10.00am-11.00am on First Saturday of the month\nEmail: chi.onwurah.mp@parliament.uk or ring 0191 232 5838 to book a place.\nPlease note that surgeries will not take place on Bank Holidays or in the month of August.\nSocial media\nI am active on all of my socials, please follow me for constituency updates and news:\nTwitter: @ChiOnwurah\nFacebook: @newcastlechi\nInstagram: chionwurahnclmp",
  "https_chionwurahmp_com_/https_chionwurahmp_com_2025_03_individual-issues-raised-by-constituents-february-2025/content_21.html": "Your email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nNotify me of follow-up comments by email.\nNotify me of new posts by email.\nΔ\nThis site uses Akismet to reduce spam. Learn how your comment data is processed."
}