{
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com/content_1.html": "Member of Parliament for Chester South and Eddisbury\nI'm Aphra Brandreth, the Conservative Member of Parliament for Chester South and Eddisbury. On this website you can find out more about my political work, what I stand for and how to get in touch.\nSay NO to the Winter Fuel Payment Cut\nJoin my mailing list\nMy map\nAphra holds roundtable regarding 20% VAT private school proposal",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_category_Westminster-News/content_12.html": "Aphra Brandreth MP stands in solidarity with Cheshire Farmers at Westminster Protest 20th November 2024 The MP for Chester South and Eddisbury, Aphra Brandreth, joined local farmers from Cheshire to protest the Government’s changes to Agricultural Property Relief... Westminster News\nAphra Brandreth MP holds Adjournment Debate on mental health in rural and agricultural communities 12th November 2024 Aphra Brandreth MP has held her first Adjournment Debate on the subject of mental health in rural and agricultural communities. The Member of Parliament spoke... Westminster News\nAphra Brandreth MP asks for a debate on improving mental health in agricultral communities 21st October 2024 Aphra Brandreth, Member of Parliament for Chester South and Eddisbury, has asked the Leader of the House of Commons, the Rt Hon Lucy Powell MP, if the House can... Westminster News\nCelebrating Inspirational Women at 10 Downing Street 21st May 2024 A celebration of Inspirational Women has been held at Number 10 Downing Street. Aphra Brandreth was joined by other female candidates from across the country... Westminster News\nAphra Brandreth made honorary Vice President of the CWO 11th May 2024 Aphra Brandreth has been made an honorary Vice President of the Conservative Women’s Organisation at the National AGM on Saturday. The CWO is the oldest women’s... Westminster News\nStrengthening our national defence 26th April 2024 The Government has announced the biggest strengthening of our national defence for a generation. Aphra spoke with Grant Shapps, Secretary of State for Defence... Westminster News\nAphra Brandreth welcomes Conservative Government funding to support children with SEND across Cheshire 27th March 2024 Aphra Brandreth welcomes Conservative Government funding of £5,803,255 in Cheshire East and £4,278,091 in Cheshire West & Chester to support children with SEND... Westminster News\nAphra welcomes Government plans to tackle violence against women and girls 22nd January 2021 The views of women and girls across the country are being sought to help shape government strategy to tackle violence and abuse. The Government is updating the... Westminster News\nLocal Covid Alert Levels Guidance 16th October 2020 Yesterday the Health Secretary updated the House of Commons on the latest measures we are taking to suppress the virus, protecting our NHS and saving lives... Westminster News",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_category_Speeches/content_19.html": "Panel discussion on the Future of Energy in the UK 1st October 2023 Aphra Brandreth organised and chaired a panel at today's Conservative Party Conference in Manchester discussing the Future of Energy in the UK. Aphra was joined... Speeches\nExpert Panel on Campaigning on the Environment 1st March 2023 Aphra Brandreth joined a panel of experts to discuss Campaigning on the Environment organised by the Conservative Environment Network in association with the... Speeches\nAddressing the Godolphin & Latymer School Politics Society 20th January 2023 Aphra was delighted to be invited to speak to the Politics Society at Godolphin and Latymer School in Hammersmith, London. Aphra shared her journey in politics... Speeches\nTalk for the Conservative Foreign and Commonwealth Council 18th January 2023 Aphra was delighted to speak at the Conservative Foreign and Commonwealth Council's first event in 2023 alongside her father Gyles Brandreth, and H.E. Kevin M... Speeches\nGuest speaker at MBC Conservatives Annual Dinner 27th October 2022 Aphra Brandreth was delighted to speak at the annual dinner for the Mortlake and Barnes Common Conservatives. The event held at a local restaurant was supported... Speeches\nSpeaking at the Stratford-upon-Avon Conservative Association 21st July 2022 Aphra was delighted to be invited to speak at the South Warwickshire Conservatives' fundraising afternoon tea today. Joining local members in Stratford-upon... Speeches",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_winner-best-female-entrepreneur/content_17.html": "Aphra Brandreth was the winner of the Best Female Entrepreneur in this year's Richmond Business Awards for her role in founding Pet People Veterinary Clinic.\nRichmond Chamber of Commerce’s (RCC) Richmond Business Awards (RBA) are founded on strengthening the economy, celebrating what is great about our businesses and networking the business and wider community.",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_cookies/content_11.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_share-your-views/content_4.html": "Tweet I want to listen to your priorities, please take a few minutes to complete this survey and share your views. What matters to you? Current You local priorities National Issues Get involved Your details Leave this field blank 1.1 What are the top three issues for you locally? Improving local transport links Fixing potholes Parking availability Access to GP & medical services Supporting high streets & small businesses Better mobile phone coverage Feeling safe & secure with more visible policing Backing British farming & growing the rural economy More school places & better education Special educational needs provision Child care & pre-school provision Protecting the countryside & local environment Tick up to three 1.2 Are there any local issues not listed that are priorities for you? 1.3 Thinking about crime and policing locally, what measure would make you feel safer in your community? More visible policing on the streets Additional CCTV Better Street Lighting A neighbourhood watch scheme Tougher sentencing Better public information (e.g. how to spot warning signs of certain crimes) More support for domestic violence victims More safe space locations for women Support to stay safe from cyber crime & scams Advice and safety support for elderly and vulnerable residents Other… Enter other… Tick all that apply 1.4 How concerned are you about cyber crime & scams? Very concerned Somewhat concerned Not concerned 1.5 Thinking about local transport, what are your top three priorities? Fixing potholes More Parking More frequent local bus services More local bus routes Lower bus fares Re-opening Beeston Castle and Tarporley Station More trains between Chester and Manchester Faster trains on the line between Crewe & Chester Other… Enter other… Tick all that apply 1.6 Thinking about health care provision, which of the following would you like to have great local provision and support? Access to GP appointments NHS dentist provision Better provision for mental health services Local access for Cancer checks and scans Well-man health checks Well-woman health checks Menopause clinics and advice Support for new babies and mums Support for elderly patients and this with Dementia Other… Enter other… Tick all that apply",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_mobile-phone-connectivity-survey/content_6.html": "Mobile phone connectivity in our local area is not good enough. Like you, I rely on my mobile phone for getting in touch with my family when I am out and about, reaching out to friends, for work purposes and so much more. It is hard to function without a mobile phone these days and that is why improving mobile connectivity is one of my top priorties.\nI have met with all of the network providers who cover Chester South and Eddisbury and I have raised this issue directly with Ministers. But there is more to be done and I am determined to continue campaigning and working towards full coverage across all of Chester South and Eddisbury.\nI would really appreciate it if you could take the time to complete my survey below and together we can improve mobile coverage in Chester South and Eddisbury.\nAphra Brandreth MP\nMember of Parliament for Chester South and Eddisbury",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_campaign-aphra/content_9.html": "Tweet Volunteer with Aphra Leave this field blank Would you be interested in finding out more about helping Aphra campaign for our area by: Delivering a few leaflets locally now and again Joining a local canvassing team Helping in the office Helping to organise fundraising events Hearing about social events and ways to be involved First name Last name Email Phone Postcode I would like to be kept up-to-date by the Conservatives on future issues that matter to me: Yes There will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our Privacy Policy.",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_accessibility/content_5.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_keep-touch/content_15.html": "I will be keeping constituents regularly updated on my work in Westminster and across Chester South & Eddisbury. If you would like to receive my newsletters, you can sign up at the top of this page.\nI will be keeping constituents regularly updated on my work in Westminster and across Chester South & Eddisbury. If you would like to receive my newsletters, you can sign up at the top of this page.",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_category_Opinions/content_16.html": "Read my article on the Lib Dem leadership contest on Conservative Home 5th August 2020 Davey would take the Lib Dems backwards; Moran to the Left. But whichever direction, does it matter? As I write, the Liberal Democrat’s 115,000 members are... Opinions\nAphra shares her views on Brexit 31st October 2019 I receive lots of emails asking me about my views on Brexit, so I’ve put together a brief summary to set out my thoughts on this big issue. This has been one of... Opinions",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_violence-against-women-girls-panel-discussion/content_18.html": "Aphra Brandreth organised and chaired a panel at today's Conservative Party Conference in Birmingham addressing Violence Against Women and Girls - How do we break the cycle.\nAphra was joined on the panel by Katherine Fletcher MP - Minister for Women, Donna Jones PCC for Hampshire and the Isle of Wight, and Cllr Rebecca Smith.\nAphra says: \"Violence against women and girls can take many forms, it can include sexual assault, domestic abuse and violence, stalking, drink spiking, honour based abuse, rape and homicide. And the impacts can be long-lasting and traumatic, potentially leading to mental health issues, suicide attempts and homelessness. Sadly, many women feel that sexual harassment and violence is almost an inevitable part of being a woman, we need to ensure that women have the support to know that they will be taken seriously. This is such a vital issue to address, and I was pleased to get the opportunity to chair this panel and raise awareness of a number of these issues.\"",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_aphra-brandreth-mp-stands-solidarity-cheshire-farmers-westminster-protest/content_13.html": "The MP for Chester South and Eddisbury, Aphra Brandreth, joined local farmers from Cheshire to protest the Government’s changes to Agricultural Property Relief (APR).\nOver 10,000 farmers staged a demonstration in Whitehall to voice their anger at the Government’s decision that farms valued at over 1 million pounds would face inheritance tax charged at a rate of 20%.\nThe Treasury estimates that around 500 farming estates will be affected by the change each year, although farming unions like the NFU point to data from the Department for Environment, Food and Rural Affairs (DEFRA) suggesting closer to two thirds of farms might be liable.\nThe National Farmers Union (NFU) also organised an event at Church House in Westminster, where 1,800 of its members from across the country met with their respective local MPs to raise the impact changes to APR will have on the farming industry.\nAphra Brandreth MP, who represents the largely rural constituency of Chester South & Eddisbury said she had been contacted by many farmers following the Government’s changes to APR at the Budget. The MP hosted farming constituents in Parliament on Tuesday for a roundtable discussion about how changes to Agricultural Property Relief would affect their family farms and make them more difficult to pass on to future generations.\nCommenting after the protest, Aphra Brandreth MP said:\n‘It was important for me to stand in solidarity with our British farmers to protest Labour’s tax raid on our farming communities.\nFarmers are the lifeblood of this country, and our local farmers in Cheshire are some of the hardest working people I know. After an incredibly difficult few years for farmers, now is the time to be supporting them, not saddling them with higher taxes and increased regulation.\nI had the pleasure of hosting more than 20 local farmers in Parliament where we had a conversation about the real-life impact that this policy will have on family farms in Cheshire. The consequences of this policy should not be understated. Without farmers we have nothing, and I call on the Government to think again about this policy.’",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_category_Articles/content_8.html": "Aphra Brandreth MP speaks up for local hospices and SEND Children 21st March 2025 Aphra Brandreth MP has spoken in favour of, and supported Lord's Opposition amendments to the National Insurance Contributions Bill. The measures introduced in... Articles\nAphra Brandreth visits Cotebrook Shire Horse Centre 31st July 2024 Aphra Brandreth, Member of Parliament for Chester South & Eddisbury, has visited Cotebrook Shire Horse Centre to meet with Janet King and to hear about the work... Articles\nAphra Brandreth visits Meadow to highlight sustainable farming and food production 30th July 2024 Aphra Brandreth, Member of Parliament for Chester South and Eddisbury, has visited Meadow’s Headquarters in Chester. She met with Chief Executive Officer, Mr... Articles\nAphra Brandreth attends The King's Speech and meets the Speaker of the House 18th July 2024 His Majesty The King has visited Parliament to deliver the King’s Speech and to officially commence a new Parliamentary year. The King addressed both Houses of... Articles\nAphra Brandreth elected as Member of Parliament for Chester South & Eddisbury 8th July 2024 Aphra Brandreth has been elected as the Member of Parliament for Chester South & Eddisbury after receiving 19,905 votes resulting in a majority of 3,057... Articles\nViolence Against Women & Girls - Panel Discussion 3rd October 2022 Aphra Brandreth organised and chaired a panel at today's Conservative Party Conference in Birmingham addressing Violence Against Women and Girls - How do we... Articles\nAphra new National Deputy Chairman of the CWO 5th March 2022 At today's Conservative Women's Organisation (CWO) AGM and Conference, Aphra became the new National Deputy Chairman alongside Neeti Gupta and Rushi Millns. The... Articles\nGyles Brandreth and his daughter, Aphra, on knitwear and integrity 25th October 2020 Family is incredibly important, now more than ever. I was delighted to share my experiences recently for the Relative Values article in The Sunday Times The... Articles\nPress Release: Thanks to the Conservatives, a record number of people are in work 14th August 2019 Official ONS figures show that in London, there are 4,667,097 people in work – meaning that, under the Conservatives, 883,958 more people have been able to... Articles",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_cdn-cgi_l_email-protection/content_2.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_aphra-brandreth-mp-holds-roundtable-regarding-20-vat-private-school-proposal/content_7.html": "Aphra Brandreth MP has met with the headteachers and senior staff of Abbey Gate College, King’s School Chester, Queen’s School Chester, The Grange and The Firs at Abbey Gate College to hear how the 20 per cent VAT on private school fees will affect students, families and the schools.\nDuring the roundtable, headteachers and senior staff shared how the proposed changes would impact students, parents, families and wider school community, threatening the future of the schools.\nAphra Brandreth, Member of Parliament for Chester South and Eddisbury said:\n“I am grateful to all the headteachers and senior staff who attended my roundtable on the 20 per cent VAT proposal on private school fees at Abbey Gate College. There is a plethora of consequences that this policy creates but it is abundantly clear from this roundtable that headteachers in Cheshire are most concerned about the impact on children. They ought to be at the centre of any policy regarding education, however this Government has failed to do that.\n“The idea that private schools provide for a privileged few is completely false. I have heard how each of the schools who attended the roundtable provide an education for SEND children who need specialist provision, military families and for the children of hardworking parents who make sacrifices to send their children to the most suitable school.\n“There are also a number of operational issues that make this policy unsuitable. For instance, financial departments have not had the necessary time to train and prepare to deal with VAT. Children and families who will no longer be able to afford to attend these schools will have no choice but to change curriculums and exam boards. And the impact of children leaving private schools will put undue pressure on state schools, many of which are already full.\n“I am very grateful to all who attended for taking the time to share the impacts that this policy will have on each of their schools, children, families and staff. I know that the schools have written to the Secretary of State for Education to voice their concerns and I will be doing so also, as well as using opportunities in Parliament to ask the Government to reconsider this proposal.”\nFollowing the roundtable, Aphra Brandreth MP spoke on the policy proposal at a Westminster Hall debate. You can watch her contribution here.",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_about-aphra-brandreth/content_3.html": "I’m an economist, I’ve run an award winning small business, and above all I’m a mum who cares passionately about community and making a difference. I want to listen to your views and to be your voice in Westminster, so that together we can continue to make Chester South and Eddisbury an even better place to live and work.\nI’ve visited businesses, farms, community groups, and charities across our community, and I’ve spoken to hundreds of people to hear about the issues that matter most to you. I care passionately about our area, this is where my husband was brought up and where I spent my formative teenage years. There is so much we can do to help, support, build and champion our community, and I am committed to working tirelessly to deliver for you.\nBelow is a bit more information about me. Thanks for taking the time to visit my website.\nAphra Brandreth is an Entrepreneur, Economist, Conservative Activist and Podcaster. She is the Conservative Member of Parliament for Chester South and Eddisbury, and Honorary Vice President of the Conservative Women’s Organisation.\nEducation\nAphra studied Economics at University College London and has a Masters degree in Environmental Economics where she graduated top of her year.\nBusiness\nHaving worked as an Economic Adviser for the Government in the Department for the Environment, Food and Rural Affairs for 10 years. Aphra then went on to set up a successful veterinary business with her husband Ian. Together they founded and grew a successful family run group of veterinary clinics. They have recently embarked on a new venture with a veterinary clinic which opened its doors in 2022.\nPolitics\nAphra is the Member of Parliament for Chester South and Eddisbury, Following her election, Aphra said \"it is a huge honour to be elected as the Member of Parliament for Chester South and Eddisbury, our new constituency. Chester South and Eddisbury has a special place in my heart. My father was the Member of Parliament for the City of Chester and it is were I grew up. My husband, Ian, also grew up in Chester South and Eddisbury so it is a privilege to now be able to represent it as the Member of Parliament. Constituents can be assured of a visible, accessible, hard-working local MP.\"\nAphra is an honorary Vice President of the Conservative Women’s Organisation. She is passionate about supporting more women on their political journey.\nA former Conservative Councillor and deputy leader of the Conservative Group on Richmond Council from 2018 to 2022.\nAphra is an active campaigner for the Conservative party. She has been involved in politics since being a ‘junior member’ of her father’s campaign team up in Chester over 20 years ago.\nPodcast & Public Speaking\nAphra currently presents the Commonwealth Poetry Podcast, going on a virtual journey to all 56 Commonwealth countries to discover more about each country through its poetry. The podcast has had thousands of downloads in over 77 countries.\nAphra regularly speaks at Conservative Associations as well as conferences and events.\nFamily Life\nLiving close to Tarporley in the centre of the constituency, Aphra is married with three teenage children. Her husband was brought up in Cuddington and went to school locally.",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_news_strengthening-our-national-defence/content_14.html": "The Government has announced the biggest strengthening of our national defence for a generation. Aphra spoke with Grant Shapps, Secretary of State for Defence, about this commitment to invest an unprecedented £75 billion in defence over the next 6 years to reach 2.5% by 2030.\nGiven the recent global turbulence, the Government is rightly focussing on spending in this critical area. As part of our NATO commitment in 2014, members agreed to commit a minimum of 2% of their GDP to ensure military readiness. The UK has consistently met that NATO pledge, something that only a third of NATO members have managed. As we are seeing more instability, happening more quickly, in more places this increased funding is vitally important to ensure that our armed forces have the equipment, training and support they need. This uplift sees the UK continue to lead the way in Europe, securing our position as the second largest spender in NATO.\nThis increased investment is fully funded, with no increase in borrowing or debt, alongside a clear plan for what it will be spent on, with the immediate areas of focus being:\n- Firing up the UK defence industrial base, including with a new munitions strategy;\n- Accelerating investment in new technology for defence; and\n- Guaranteeing support to Ukraine for the long term.\nAphra said: 'I very much welcome the new funding pledge of a further £500m to support Ukraine, and our largest ever donation of military equipment, taking our total support to £3bn this year. Current global instability and threats mean that we must be prepared, and this is a very welcome decision by the Government to prioritise keeping our people and our country safe.\"",
  "https_www_aphrabrandreth_com_/https_www_aphrabrandreth_com_map-locations/content_10.html": "Skip to main content\nMain navigation\nHome\nAbout Aphra\nNews\nOur Plan\nCampaign with Aphra\nShare Your Views\nContact\nMobile Phone Connectivity Survey\nRegular Newsletters\nMy map"
}