{
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_tag_latest/content_10.html": "Within the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇\nWithin the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_tag_news/content_9.html": "Within the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇\nWithin the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_index_php_contact/content_18.html": "Get Involved Get involved in the Campaign, simply complete the form below and we will get back to you shortly Please enable JavaScript in your browser to complete this form.Name *FirstLastPhone numberEmail *Submit",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_pledges/content_13.html": "A Campaigning MP\nI am an organiser with a record of winning tough elections on the ground, taking the fight to the Tories street by street. Working for Debbie Abrahams MP in a marginal seat, I ran effective campaigns to keep the seat against all odds. As part of Andy Burnham’s successful Greater Manchester Mayoral campaign in 2017, I helped write his manifesto and develop key policies such as ending rough sleeping and bringing buses under public control. Let’s build our campaign together.\nA Grassroots Champion\nMy teacher, Mrs Perry at Fartown High School believed\nin me and I have always believed in our community. I\nwill bring my experience and Huddersfield’s community values to Parliament. Nationally, I will stand up for our community organisations that I supported as Councillor. When we work together, using the talents of our party and community, we can build a Huddersfield which we can all be proud of.\nin me and I have always believed in our community. I\nwill bring my experience and Huddersfield’s community values to Parliament. Nationally, I will stand up for our community organisations that I supported as Councillor. When we work together, using the talents of our party and community, we can build a Huddersfield which we can all be proud of.\nBringing our Labour Values into Government\nI believe in compassionate, values driven politics. We will campaign hard and win a Labour Government. As an MP I will make sure that our Government will deliver and address social and climate injustice, building a Britain that works for everyone in our community.\nMy Pledges for Huddersfield\nA Better Deal on Public Transport\nAs a public transport user, I know that our current system\ndoesn’t work for the people and communities it serves. I will fight with you for publicly owned services that deliver cheap fares and are reliable so our communities are no longer cut off or disconnected.\ndoesn’t work for the people and communities it serves. I will fight with you for publicly owned services that deliver cheap fares and are reliable so our communities are no longer cut off or disconnected.\nA Stronger Economy for All\nI will always campaign for investment in people alongside infrastructure investment for our town. We must utilise the skills and passion of all the people in our town, no matter their background.\nTackle Climate Change Together\nI will work with the Mayor, Council and local people and\nbusinesses to practically reduce emissions. We need a comprehensive climate action plan that includes all of our communities and creates well paid, skilled jobs.\nbusinesses to practically reduce emissions. We need a comprehensive climate action plan that includes all of our communities and creates well paid, skilled jobs.\nPublic Service, Public Good\nWorking for NHS England gave me first-hand experience of\nthe pressures on health services and what we can do\nto improve them. I also saw the difference my late mum\nmade as a care worker, I will fight for NHS and social care\nservices that are delivered in the public interest, not for\nprofit including wages carers can live on.\nthe pressures on health services and what we can do\nto improve them. I also saw the difference my late mum\nmade as a care worker, I will fight for NHS and social care\nservices that are delivered in the public interest, not for\nprofit including wages carers can live on.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_about-me/content_16.html": "On the 16th July we will be selecting our Labour Party candidate to be our next MP. I am standing to be the first ever woman to represent Huddersfield in Parliament, the town where I was born, grew up, went to school, have represented in council, and where I live. Our community and its people mean so much to me and it would be the honour of my life to be their voice in Westminster.\nHuddersfield has so much going for it and through my work as a councillor I have met so many community organisations, businesses and faith leaders who are doing amazing things to make our town a fantastic place to live. But let’s not kid ourselves, we have real problems too. 12 years of Tories have furthered deep social inequalities that we need to fix. We need an MP with strong values who cares deeply about social justice to work every day in Parliament and in the community to tackle problems and bring about real change in people’s lives.\nThrough my work with Debbie Abrahams MP, I have seen the difference an MP can make on individual cases and the power they have to bring people and organisations together to build great things in the community.\nBut I also know that it is only through achieving a Labour Government that we are going to see the changes that we really need. That means we must elect someone who knows what it means to build a campaign, who has taken on the Tories street by street and won. I will use my experience of building and leading successful campaigns, to build a campaigning and winning constituency Labour Party, that contributes to a Labour majority in Parliament.\nI am proud to have the backing of leading figures such as Andy Burnham, but I am also so proud and humbled by the support I have been getting from local people and party members. I want to thank everyone who I have spoken to so far and look forward to talking to many more over the next week about your ideas for our town and country.\nIf you would like for me to get in touch, please let me know here.\nHowever you vote on Saturday, I hope that you come and take part in what will be a vital hustings for our town.\nOn the 16th July we will be selecting our Labour Party candidate to be our next MP. I am standing to be the first ever woman to represent Huddersfield in Parliament, the town where I was born, grew up, went to school, have represented in council, and where I live. Our community and its people mean so much to me and it would be the honour of my life to be their voice in Westminster.\nHuddersfield has so much going for it and through my work as a councillor I have met so many community organisations, businesses and faith leaders who are doing amazing things to make our town a fantastic place to live. But let’s not kid ourselves, we have real problems too. 12 years of Tories have furthered deep social inequalities that we need to fix. We need an MP with strong values who cares deeply about social justice to work every day in Parliament and in the community to tackle problems and bring about real change in people’s lives.\nThrough my work with Debbie Abrahams MP, I have seen the difference an MP can make on individual cases and the power they have to bring people and organisations together to build great things in the community.\nBut I also know that it is only through achieving a Labour Government that we are going to see the changes that we really need. That means we must elect someone who knows what it means to build a campaign, who has taken on the Tories street by street and won. I will use my experience of building and leading successful campaigns, to build a campaigning and winning constituency Labour Party, that contributes to a Labour majority in Parliament.\nI am proud to have the backing of leading figures such as Andy Burnham, but I am also so proud and humbled by the support I have been getting from local people and party members. I want to thank everyone who I have spoken to so far and look forward to talking to many more over the next week about your ideas for our town and country.\nIf you would like for me to get in touch, please let me know here.\nHowever you vote on Saturday, I hope that you come and take part in what will be a vital hustings for our town.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_2022_07_05_139/content_6.html": "Within the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇\nCategories\nWithin the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_category_uncategorized/content_17.html": "Almost four decades ago, Margaret Thatcher’s government boldly predicted that privatising Britain’s bus sector would lead to “lower fares, new services, and more passengers”, while removing “any potential future liability on the taxpayer”. Well, we all know what happened next….\nAs a public transport user, I know that our bus and rail services don’t work for the people and communities they purport to serve.\nA privatised system with only a handful of companies running routes and setting fares has led to rising ticket prices without the reliability to go with it. In addition, this Tory Government haven’t supported our bus and rail workers, many of whom worked through the pandemic and are now having to fight for decent wages. Yet Johnson and his gang have had no qualms about lifting the cap on city bonuses.\nSimply put the system does not work. London’s relatively well-run and highly regulated system is, in fact, an outlier in Britain. Here in Huddersfield and in many parts of the North we have been let down by successive governments.\nWhen I worked on Andy Burnham’s mayoral campaign in 2017, I helped write his manifesto and developed key policies such as bringing buses under public control – policies that are now being implemented. Here in West Yorkshire, Tracy Brabin also has a strong focus on improving bus services and is already making progress. As a Councillor and member of the West Yorkshire Economy Scrutiny Panel I have advocated for publicly owned bus and rail services.\nI will bring my experience to work with Labour colleagues to deliver a system with cheaper fares that are more reliable. I will work closely with the Mayor of West Yorkshire, our local councils and trade unions to ensure we have the right change that works for us.\nMost importantly, I will fight with you for publicly controlled services so our communities are no longer cut off or disconnected. I will work to legislate minimum service levels, overturn the ban on municipal bus companies and throw financial and political support behind public control of our bus and rail services because we know it will work for us and not shareholders.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_category_latest/content_8.html": "I am a firm supporter of PR and I was really pleased to hear my union, Unison backed PR at it’s conference last month. I believe First Past the Post is an outdated system which leaves people excluded from our political system. In fact we know that many democracies now use a form of PR. My sister has recently returned from Australia where they use a form of PR and saw a Labour government elected this year. PR is widely used across Europe, the Scottish, Welsh and Northern Irish devolved bodies and for local government in Scotland and Northern Ireland. Elections for mayors in England and Wales, and for Police and Crime Commissioners also use a PR system. In fact, it is the Tories that are trying to roll back PR in mayoral elections because they see it as a threat!\nI would work with MPs across Parliament to bring in PR and make the UK a fairer place. I want a participatory democracy in which everyone feels they have a meaningful stake and a politics which works to bring people together. Our current system doesn’t engage the vast majority of the people in our country. We should never be afraid of a system that brings more people to the table, that allows people to be further engaged and know that their vote counts.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_2022_07_09_social-care-matters-and-it-is-time-parliament-took-it-seriously/content_15.html": "My late mum was a home care worker for over 18 years here in Huddersfield. She loved her job because she made a difference in the lives of the people she cared for. However, like the many women who work in the sector, their roles aren’t valued and they are expected to do more with less.\nMy mum worked directly as a care worker for Kirklees Council. She received strong support from her union, Unison, and had regular hours and wages, receiving training and qualifications (all under a Labour government). Now the sector has sadly seen a denigration in work patterns and conditions. This means less time spent with the individuals they care for, travel expenses that aren’t covered properly and pay levels which are frankly shameful.\nNationally, governments have failed to tackle the problems of a fragmented care system which does little to support the people at the centre of it as local authorities face dwindling budgets and increased pressures. I was delighted to read this week that Labour are introducing plans for a National Care Service. Under the proposal backed by Unison, the Fabian Society will review how a care service could be structured and funded. Following the review, recommendations will be made to the Labour party policy review and to the Shadow Health and Social Care Secretary.\nWe need to see a national care service delivered on the same terms as the NHS; publicly owned, publicly funded and free at the point of use. We need to make sure we have national standards for care users and better pay and conditions for staff who work in the sector.\nWhen my mum was diagnosed with a brain tumour, she became the person we cared for with her former colleagues providing additional support to our family. We saw the kindness these women brought not only to our mum but to our whole family. But we also saw a system that needed fixing. I was so proud of the work my mum did and the difference she made.\nThis fight is personal and I can promise you that I will always strive for a system that works for all of us.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_2022_07_08_its-time-to-make-votes-matter/content_12.html": "I am a firm supporter of PR and I was really pleased to hear my union, Unison backed PR at it’s conference last month. I believe First Past the Post is an outdated system which leaves people excluded from our political system. In fact we know that many democracies now use a form of PR. My sister has recently returned from Australia where they use a form of PR and saw a Labour government elected this year. PR is widely used across Europe, the Scottish, Welsh and Northern Irish devolved bodies and for local government in Scotland and Northern Ireland. Elections for mayors in England and Wales, and for Police and Crime Commissioners also use a PR system. In fact, it is the Tories that are trying to roll back PR in mayoral elections because they see it as a threat!\nI would work with MPs across Parliament to bring in PR and make the UK a fairer place. I want a participatory democracy in which everyone feels they have a meaningful stake and a politics which works to bring people together. Our current system doesn’t engage the vast majority of the people in our country. We should never be afraid of a system that brings more people to the table, that allows people to be further engaged and know that their vote counts.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_endorsements/content_4.html": "Skip to the content\nHarpreet for Huddersfield\nHuddersfield's Community Champion\nMenu\nHome\nAbout Me\nGet Involved\nLatest News\nPledges\nEndorsements\nEndorsements",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_2022_07_09_a-joined-up-plan-for-transport/content_3.html": "Almost four decades ago, Margaret Thatcher’s government boldly predicted that privatising Britain’s bus sector would lead to “lower fares, new services, and more passengers”, while removing “any potential future liability on the taxpayer”. Well, we all know what happened next….\nAs a public transport user, I know that our bus and rail services don’t work for the people and communities they purport to serve.\nA privatised system with only a handful of companies running routes and setting fares has led to rising ticket prices without the reliability to go with it. In addition, this Tory Government haven’t supported our bus and rail workers, many of whom worked through the pandemic and are now having to fight for decent wages. Yet Johnson and his gang have had no qualms about lifting the cap on city bonuses.\nSimply put the system does not work. London’s relatively well-run and highly regulated system is, in fact, an outlier in Britain. Here in Huddersfield and in many parts of the North we have been let down by successive governments.\nWhen I worked on Andy Burnham’s mayoral campaign in 2017, I helped write his manifesto and developed key policies such as bringing buses under public control – policies that are now being implemented. Here in West Yorkshire, Tracy Brabin also has a strong focus on improving bus services and is already making progress. As a Councillor and member of the West Yorkshire Economy Scrutiny Panel I have advocated for publicly owned bus and rail services.\nI will bring my experience to work with Labour colleagues to deliver a system with cheaper fares that are more reliable. I will work closely with the Mayor of West Yorkshire, our local councils and trade unions to ensure we have the right change that works for us.\nMost importantly, I will fight with you for publicly controlled services so our communities are no longer cut off or disconnected. I will work to legislate minimum service levels, overturn the ban on municipal bus companies and throw financial and political support behind public control of our bus and rail services because we know it will work for us and not shareholders.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_author_harpreetu/content_5.html": "Almost four decades ago, Margaret Thatcher’s government boldly predicted that privatising Britain’s bus sector would lead to “lower fares, new services, and more passengers”, while removing “any potential future liability on the taxpayer”. Well, we all know what happened next….\nAs a public transport user, I know that our bus and rail services don’t work for the people and communities they purport to serve.\nA privatised system with only a handful of companies running routes and setting fares has led to rising ticket prices without the reliability to go with it. In addition, this Tory Government haven’t supported our bus and rail workers, many of whom worked through the pandemic and are now having to fight for decent wages. Yet Johnson and his gang have had no qualms about lifting the cap on city bonuses.\nSimply put the system does not work. London’s relatively well-run and highly regulated system is, in fact, an outlier in Britain. Here in Huddersfield and in many parts of the North we have been let down by successive governments.\nWhen I worked on Andy Burnham’s mayoral campaign in 2017, I helped write his manifesto and developed key policies such as bringing buses under public control – policies that are now being implemented. Here in West Yorkshire, Tracy Brabin also has a strong focus on improving bus services and is already making progress. As a Councillor and member of the West Yorkshire Economy Scrutiny Panel I have advocated for publicly owned bus and rail services.\nI will bring my experience to work with Labour colleagues to deliver a system with cheaper fares that are more reliable. I will work closely with the Mayor of West Yorkshire, our local councils and trade unions to ensure we have the right change that works for us.\nMost importantly, I will fight with you for publicly controlled services so our communities are no longer cut off or disconnected. I will work to legislate minimum service levels, overturn the ban on municipal bus companies and throw financial and political support behind public control of our bus and rail services because we know it will work for us and not shareholders.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_contact/content_7.html": "Get Involved Get involved in the Campaign, simply complete the form below and we will get back to you shortly Please enable JavaScript in your browser to complete this form.Name *FirstLastPhone numberEmail *Submit",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com/content_1.html": "Home Sign up to hear about my campaignPlease enable JavaScript in your browser to complete this form.Name *FirstLastPhone number (mobile if poss)Email *I am happy to be added to a Whatsapp broadcast group to hear moreYes please!No thanksDon't have WhatsappSubmit Endorsed By Get Involved",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_tag_pledges/content_11.html": "Within the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇\nWithin the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_latest-information/content_2.html": "Almost four decades ago, Margaret Thatcher’s government boldly predicted that privatising Britain’s bus sector would lead to “lower fares, new services, and more passengers”, while removing “any potential future liability on the taxpayer”. Well, we all know what happened next….\nAs a public transport user, I know that our bus and rail services don’t work for the people and communities they purport to serve.\nA privatised system with only a handful of companies running routes and setting fares has led to rising ticket prices without the reliability to go with it. In addition, this Tory Government haven’t supported our bus and rail workers, many of whom worked through the pandemic and are now having to fight for decent wages. Yet Johnson and his gang have had no qualms about lifting the cap on city bonuses.\nSimply put the system does not work. London’s relatively well-run and highly regulated system is, in fact, an outlier in Britain. Here in Huddersfield and in many parts of the North we have been let down by successive governments.\nWhen I worked on Andy Burnham’s mayoral campaign in 2017, I helped write his manifesto and developed key policies such as bringing buses under public control – policies that are now being implemented. Here in West Yorkshire, Tracy Brabin also has a strong focus on improving bus services and is already making progress. As a Councillor and member of the West Yorkshire Economy Scrutiny Panel I have advocated for publicly owned bus and rail services.\nI will bring my experience to work with Labour colleagues to deliver a system with cheaper fares that are more reliable. I will work closely with the Mayor of West Yorkshire, our local councils and trade unions to ensure we have the right change that works for us.\nMost importantly, I will fight with you for publicly controlled services so our communities are no longer cut off or disconnected. I will work to legislate minimum service levels, overturn the ban on municipal bus companies and throw financial and political support behind public control of our bus and rail services because we know it will work for us and not shareholders.",
  "https_harpreet4huddersfield_com_/https_harpreet4huddersfield_com_tag_endorsements/content_14.html": "Within the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇\nWithin the next few days all Huddersfield Labour members will be receiving a copy of my letter. If your eager to see it here it is 👇"
}