{
  "http_www_arthurprice_net_/http_www_arthurprice_net/content_1.html": "Dear Folks of Central Devon,\nWith less than a week to go until election day I'm focussing my attention on all those reluctant 'tactical' voters who'll be trying to unseat Mel Stride by voting Labour.\nI want to see the back of this corrupt government as much as anyone else, but I can't help feeling we'd just be replacing one Tory with another in our constituency. Most Labour voters I've spoken to reluctantly agree but feel they have no choice, so they'll be holding their noses when they put the X in the box on July 4th.\n'Changed' Labour? New Conservatives, I think. And there are thousands more who agree, who feel unrepresented by the party they no longer recognise as their political home.\nAs I've said many times during my campaign, you own your vote. So, in 5 years from now when no council houses have been built, when the NHS is stuffed full of private profiteers, when thousands of people are still living in poverty in Devon, when kids in the Middle East are still dying at the end of weapons supplied via the UK...that's on you. Because you voted for it. Voting tactically does not excuse you from the blame.\nLook at it this way - if Central Devon was a close call between the Tories and Reform, would you vote tactically for the Tories?\nI doubt you would.\nYou'd be so appalled at the dismal choice on offer, you'd tick the box for another candidate, the one that most closely represents your views.\nWell, that's where I am with the choice between the Tories and 'Changed' Labour.\nAnd that's why I'm here. To give you the chance to vote with your conscience.\nRegardless of what happens in Central Devon, Labour are on course for a historic landslide victory. What happens here is just a sideshow.\nIf you haven't already done so, please watch my videos (there's more coming, right up til election day), follow my Facebook page at www.facebook.com/freedomfordevon and if you see anything that resonates with you please share to your local Facebook community pages and beyond.\nGood luck on July 4th, I hope you walk away from your polling station with a clear conscience.\nThank you for reading.\nYours in Solidarity,\nArthur Price.\n29th June 2024."
}