{
  "https_www_werahobhouse_co_uk_/https_www_werahobhouse_co_uk/content_1.html": "Wera Hobhouse praises “valuable” work of local training provider\n12 July 2024\nOn Friday 12th July, Wera Hobhouse, in her first Bath visit following her re-election as the city’s MP, visited staff and clients of Seetec.\nAdd your name to our mailing list to stay up-to-date:\nThe Liberal Democrats will use your contact details to send you information on the topics you have requested. Any data we gather will be used in accordance with our privacy policy. To exercise your legal data rights, email data.protection@libdems.org.uk.\n12 July 2024\nOn Friday 12th July, Wera Hobhouse, in her first Bath visit following her re-election as the city’s MP, visited staff and clients of Seetec.\n12 July 2024\nOn 12th July, Wera Hobhouse, Liberal Democrat MP for Bath, in one of her first engagements as the city's newly re-elected Member of Parliament, met with students from St. Martin’s Garden Primary School to attend their Careers Week. The visit aimed to inspire and educate students about careers in politics and public service.\n10 July 2024\nNewly re-elected Liberal Democrat MP for Bath, Wera Hobhouse, has called for an emergency Health and Care Budget to support local health services on the brink.\n“I’d waited 8 months for the DVLA to clear me to drive after a medical incident. Wera wrote to DVLA and got me cleared within three weeks.”\n“Wera achieved in a few days what weeks of fruitless phone calls and emails to the DWP on my part could not, and resolved what was a distressing and financially difficult time for me. I was impressed and delighted with her efforts!”\n“Wera understands the annual misery caused to Bath residents by noisy, messy urban gulls breeding in the centre of Bath and has confronted the government minister in charge of Natural England about the need for more effective control of gull numbers. She’s backing the council too in its campaign to proof their roofs against gulls. At last, an MP taking some action on this urban menace!”"
}