{
  "https_portsmouth_greenparty_org_uk_/https_portsmouth_greenparty_org_uk_donate/content_5.html": "We’re powered by people, not big business\nYour donation will help us get Greens elected.\nThe Green Party is funded through donations by individuals like you. We don’t take donations from businesses that are trying to sway our politics. Politics is about people, and delivering a society that puts them first. Can you donate to help us get Greens elected?",
  "https_portsmouth_greenparty_org_uk_/https_portsmouth_greenparty_org_uk_news/content_3.html": "Skip to content\nSkip to footer\nPortsmouth\nMenu\nNews\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nPortsmouth Green Party\nTo top",
  "https_portsmouth_greenparty_org_uk_/https_portsmouth_greenparty_org_uk/content_1.html": "We’re working hard to improve your area\n🚮\nRegularly reporting fly-tipping to make the area clean and safe for local residents.\n📃\nRegularly surveying residents to find out what local issues are important, and identify problems in the area.\n🌳\nProtecting local trees and encouraging more to be planted. Cleaning up the air.\nImproving public transport\nEngaging with schools\nEngaging with local NHS\nHelp get Greens Elected in Portsmouth\nNews\nFind out what we’ve been up to, about issues in your area, and see the work we’ve done in the past.\nUpcoming Events\nGet involved to help get Greens elected. A Green Councillor can make a world of difference to your local area.\n- No upcoming events",
  "https_portsmouth_greenparty_org_uk_/https_portsmouth_greenparty_org_uk_people/content_4.html": "Your Local Candidates\nJay Mercer (they/them)\nCommitted. Generous. Energetic. That’s what Portsmouth Green Party members said when we asked them to describe our candidate for St Thomas Ward, Jay Mercer.\nWhile Jay may be young at just 21, they know what many in Westminster fail to grasp after decades in power; politics is all about helping people.\nJay, who will soon graduate from the University of Portsmouth with a BA in politics, campaigned during the local and general elections this year, meeting many of you on the doorstop for chats about your concerns and our candidates, and was excited and energised by the connections they made.\nThey’ve made a home in Portsmouth with their partner and intends to make things better for our community with safer streets, reduced air pollution, and action on the climate crisis; reaching across the aisle for a bipartisan solution. After all, as Jay often says, it’s not important who gets the credit, only who gets the help they need.\nJay said after their selection:\n“I will fight for improved housing, affordable bus fares and inclusivity within our community. I regularly engage in local political activism, where I’ve campaigned for issues ranging from access to gender affirming care, an end to the genocide in Palestine and combating the climate crisis.“\nElliott Lee\nIt’s evident that traditional politics has failed to address the pressing issues we face today, leaving our communities longing for hope, ambition, and a commitment to a fairer, greener society. As a young queer person with a disability, I am puzzled by the lack of progress and the harmful, backward policies that persist. I want more for our country, I want better for Portsmouth South.\nI am confident that the Green Party offers a vision for real change amoungst our communities. But what change is needed? Real consideration for our environment, investment into health and social care, a commitment to seeing out global peace, electoral reform and promoting inclusion & diversity within society. There is no doubt this is a big task, yet I know with politics done differently like this a Green MP is up for the task. I am proud to be taking on this challenge in the city I have made home. Let’s Turn Pompey Green Together!\nTwitter: @Elliott000_\nYour Local Officers\nElliott Lee, co-Coordinator, Election Agent\nSee above\nMenno Groen (he/him), co-Treasurer\nHarry Mallinder, co-Treasurer\nTamara Groen (she/her), co-Membership Officer\nMaja Poppe (they/them), co-Membership Officer\nEmma Murphy (she/her), co-Social Media Officer, Equity, Equality, Diversity, and Inclusion Officer\nAlexa Gill (she/her), co-Social Media Officer\nStan Marlow, Trade Union Officer, co-Policy Officer\nDavid Simpson, co-Policy Officer\nJay Mercer (they/them), Young Greens Officer\nSee above",
  "https_portsmouth_greenparty_org_uk_/https_portsmouth_greenparty_org_uk_contact/content_2.html": "Skip to content\nSkip to footer\nPortsmouth\nMenu\nNews\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nContact Us\nYour name\nYour email\nSubject\nYour message (optional)\nTo top"
}