{
  "http_www_andrewgwynne_co_uk/https_www_andrewgwynne_co_uk/content_4.html": "ABOUT ME\nHi, I'm Andrew\nWHERE I COME FROM\nBorn in Manchester in 1974, I attended what is now Denton Community College, before studying at Tameside College in Ashton. I gained my Bachelors degree in Politics and History from the University of Salford in 1998.\nI continue to live in my hometown of Denton, with my wife Allison, my children and my grandson.\nWHAT I'VE BEEN DOING\nFirst elected at the age of 21 in 1996 as a Councillor to the Denton West Ward, I've served my local community for nearly 30 years.\nIn 2005 I was elected as the Member of Parliament for the Denton and Reddish constituency. In my time in parliament, I have held several roles, including Parliamentary Private Secretary to a number of Ministers.\nIn 2010 I became Shadow Transport Minister, and in 2011 I became the Shadow Minister for Health, a role I held until 2016. Since then, I've been the National Campaign Coodinator for Labour, the Shadow Secretary of State for Communities and Local Government, and the Shadow Minister for Health and Social Care.",
  "http_www_andrewgwynne_co_uk/https_www_andrewgwynne_co_uk_accessibility-statement/content_5.html": "The purpose of the following template is to assist you in writing your accessibility statement. Please note that you are responsible for ensuring that your site's statement meets the requirements of the local law in your area or region.\n*Note: This page currently has two sections. Once you complete editing the Accessibility Statement below, you need to delete this section.\nTo learn more about this, check out our article “Accessibility: Adding an Accessibility Statement to Your Site”.\nAccessibility Statement\nThis statement was last updated on [enter relevant date].\nWe at [enter organization / business name] are working to make our site [enter site name and address] accessible to people with disabilities.\nWHAT WEB ACCESSIBILITY IS\nAn accessible site allows visitors with disabilities to browse the site with the same or a similar level of ease and enjoyment as other visitors. This can be achieved with the capabilities of the system on which the site is operating, and through assistive technologies.\nACCESSIBILITY ADJUSTMENTS ON THIS SITE\nWe have adapted this site in accordance with WCAG [2.0 / 2.1 / 2.2 - select relevant option] guidelines, and have made the site accessible to the level of [A / AA / AAA - select relevant option]. This site's contents have been adapted to work with assistive technologies, such as screen readers and keyboard use. As part of this effort, we have also [remove irrelevant information]:\n-\nUsed the Accessibility Wizard to find and fix potential accessibility issues\n-\nSet the language of the site\n-\nSet the content order of the site’s pages\n-\nDefined clear heading structures on all of the site’s pages\n-\nAdded alternative text to images\n-\nImplemented color combinations that meet the required color contrast\n-\nReduced the use of motion on the site\n-\nEnsured all videos, audio, and files on the site are accessible\nDECLARATION OF PARTIAL COMPLIANCE WITH THE STANDARD DUE TO THIRD-PARTY CONTENT [ONLY ADD IF RELEVANT]\nThe accessibility of certain pages on the site depend on contents that do not belong to the organization, and instead belong to [enter relevant third-party name]. The following pages are affected by this: [list the URLs of the pages]. We therefore declare partial compliance with the standard for these pages.\nACCESSIBILITY ARRANGEMENTS IN THE ORGANIZATION [ONLY ADD IF RELEVANT]\n[Enter a description of the accessibility arrangements in the physical offices / branches of your site's organization or business. The description can include all current accessibility arrangements - starting from the beginning of the service (e.g., the parking lot and / or public transportation stations) to the end (such as the service desk, restaurant table, classroom etc.). It is also required to specify any additional accessibility arrangements, such as disabled services and their location, and accessibility accessories (e.g. in audio inductions and elevators) available for use]",
  "http_www_andrewgwynne_co_uk/https_www_andrewgwynne_co_uk_terms-and-conditions/content_8.html": "Terms & Conditions\nA LEGAL DISCLAIMER\nThe explanations and information provided on this page are only general and high-level explanations and information on how to write your own document of Terms & Conditions. You should not rely on this article as legal advice or as recommendations regarding what you should actually do, because we cannot know in advance what are the specific terms you wish to establish between your business and your customers and visitors. We recommend that you seek legal advice to help you understand and to assist you in the creation of your own Terms & Conditions.\nTERMS & CONDITIONS - THE BASICS\nHaving said that, Terms and Conditions (“T&C”) are a set of legally binding terms defined by you, as the owner of this website. The T&C set forth the legal boundaries governing the activities of the website visitors, or your customers, while they visit or engage with this website. The T&C are meant to establish the legal relationship between the site visitors and you as the website owner.\nT&C should be defined according to the specific needs and nature of each website. For example, a website offering products to customers in e-commerce transactions requires T&C that are different from the T&C of a website only providing information (like a blog, a landing page, and so on).\nT&C provide you as the website owner the ability to protect yourself from potential legal exposure, but this may differ from jurisdiction to jurisdiction, so make sure to receive local legal advice if you are trying to protect yourself from legal exposure.\nWHAT TO INCLUDE IN THE T&C DOCUMENT\nGenerally speaking, T&C often address these types of issues: Who is allowed to use the website; the possible payment methods; a declaration that the website owner may change his or her offering in the future; the types of warranties the website owner gives his or her customers; a reference to issues of intellectual property or copyrights, where relevant; the website owner’s right to suspend or cancel a member’s account; and much, much more.\nTo learn more about this, check out our article “Creating a Terms and Conditions Policy”.",
  "http_www_andrewgwynne_co_uk/https_www_andrewgwynne_co_uk_contact/content_3.html": "top of page\nCONTACT\nReach Me Anytime\nIf you are a constituent of Gorton and Denton, which covers Denton, Burnage, Gorton & Abbey Hey, Levenshulme and Longsight please do reach out to me with any issues, casework, or questions you may have, and myself and my team will get back to you.\n📮\nConstituency Office\nDenton Town Hall\nMarket Street Denton\nM34 2AP\n📧\nandrew.gwynne.mp@parliament.uk\n📞\n0161 320 1504\nbottom of page",
  "http_www_andrewgwynne_co_uk/https_www_andrewgwynne_co_uk_privacy-policy/content_2.html": "Privacy Policy\nA LEGAL DISCLAIMER\nThe explanations and information provided on this page are only general and high-level explanations and information on how to write your own document of a Privacy Policy. You should not rely on this article as legal advice or as recommendations regarding what you should actually do, because we cannot know in advance what are the specific privacy policies you wish to establish between your business and your customers and visitors. We recommend that you seek legal advice to help you understand and to assist you in the creation of your own Privacy Policy.\nPRIVACY POLICY - THE BASICS\nHaving said that, a privacy policy is a statement that discloses some or all of the ways a website collects, uses, discloses, processes, and manages the data of its visitors and customers. It usually also includes a statement regarding the website’s commitment to protecting its visitors’ or customers’ privacy, and an explanation about the different mechanisms the website is implementing in order to protect privacy.\nDifferent jurisdictions have different legal obligations of what must be included in a Privacy Policy. You are responsible to make sure you are following the relevant legislation to your activities and location.\nWHAT TO INCLUDE IN THE PRIVACY POLICY\nGenerally speaking, a Privacy Policy often addresses these types of issues: the types of information the website is collecting and the manner in which it collects the data; an explanation about why is the website collecting these types of information; what are the website’s practices on sharing the information with third parties; ways in which your visitors and customers can exercise their rights according to the relevant privacy legislation; the specific practices regarding minors’ data collection; and much, much more.\nTo learn more about this, check out our article “Creating a Privacy Policy”.",
  "http_www_andrewgwynne_co_uk/https_www_andrewgwynne_co_uk_home/content_7.html": "top of page\nNEWS\nABOUT ME\n28 Years of service\nDenton born, raised and proud to serve. I was first elected as a councillor for Denton West in 1996, and entered the house of commons in 2005 as the MP for the Denton and Reddish Constituency. Since then, I have fought tirelessly for my constituents and have been honoured to be re-elected on 5 occasions. I am now delighted to serve as the first MP for Gorton and Denton.\nI am 50 years old, a proud father to 3 children, and a grandad. I still live in Denton, a town I'm proud to call home.\nI am honoured to serve in the government as the Parliamentary Under-Secretary of State for Public Health and Prevention\nbottom of page",
  "http_www_andrewgwynne_co_uk/http_www_andrewgwynne_co_uk/content_1.html": "ABOUT ME\nHi, I'm Andrew\nWHERE I COME FROM\nBorn in Manchester in 1974, I attended what is now Denton Community College, before studying at Tameside College in Ashton. I gained my Bachelors degree in Politics and History from the University of Salford in 1998.\nI continue to live in my hometown of Denton, with my wife Allison, my children and my grandson.\nWHAT I'VE BEEN DOING\nFirst elected at the age of 21 in 1996 as a Councillor to the Denton West Ward, I've served my local community for nearly 30 years.\nIn 2005 I was elected as the Member of Parliament for the Denton and Reddish constituency. In my time in parliament, I have held several roles, including Parliamentary Private Secretary to a number of Ministers.\nIn 2010 I became Shadow Transport Minister, and in 2011 I became the Shadow Minister for Health, a role I held until 2016. Since then, I've been the National Campaign Coodinator for Labour, the Shadow Secretary of State for Communities and Local Government, and the Shadow Minister for Health and Social Care.",
  "http_www_andrewgwynne_co_uk/https_www_andrewgwynne_co_uk_news/content_6.html": "top of page\nAndrew Gwynne MP\nGorton and Denton\nContact\nMore\nUse tab to navigate through the menu items.\nCONTACT\nSUBSCRIBE\nThe Latest Updates\nAll Articles\nSearch\nCheck back soon\nOnce posts are published, you’ll see them here.\nbottom of page"
}