{
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_sir-geoffrey-clifton-brown-learns-about-innovative-road-repair-techniques/content_18.html": "This morning, I visited a site just east of Cheltenham, along with Max Wilkinson MP, to meet representatives from Gloucestershire Highways and Gloucestershire County Council.\nCouncillor Stephen Davies, Leader of Gloucestershire County Council, Jason Humm, Director of Transport and Highways and other members of Ringway and Gloucestershire Highways were on site to discuss highway operations and recent progress.\nWe were shown a number of different methods currently being used to repair and maintain our county's roads including the Spray Injection and Roadmender machines.\nThe Roadmender is a relatively new addition to Gloucestershire Highways and uses around 80% of recycled materials, including nine vehicle tyres, in every tonne of material produced. It is also a very quick process, to both apply and use almost immediately afterwards.\nGloucestershire Highways are on track to have carried out 90,000 minor road repairs by the end of this financial year and more than 100 miles of the county’s roads have been resurfaced.\nIf you would like to alert Gloucestershire County Council to an area that needs repair, please use Fix My Street at https://fixmystreet.gloucestershire.gov.uk/",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_pac/content_20.html": "“I am honoured to have been elected by so many of my colleagues. It’s a massive task but I have been on the committee for the last seven years as the longest-serving deputy chair, so I understand how the committee works in enormous detail.”\nPublic Accounts Committee\nSir Geoffrey is Chair of the Public Accounts Committee. He was elected in September 2024.\nSir Geoffrey Clifton-Brown MP\nLatest from the Public Accounts Committee\nClifton-Brown calls for more joined-up NHS and urgent reform of adult social care\n5 March 2025\nChair of the Public Accounts Committee, Sir Geoffrey Clifton-Brown, opens the Estimates Day debate on the Department of Health and Social Care's spending plans. He emphasises the need for better coordination within the NHS, greater focus on preventive care and public health, and an urgent overhaul of the adult social care system.\nPublic Accounts Committee: Mobile Connectivity\n24 April 2024\nSir Geoffrey Clifton-Brown raises with senior officials during a Public Accounts Committee inquiry the issue of broadband poles that have been blighting villages including Willersey, notspots, and the future of satellite technology to help improve coverage in rural areas",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_sir-geoffrey-clifton-brown-challenges-defras-sudden-halt-sustainable-farming-incentive/content_33.html": "Following the Government response to the Urgent Question on DEFRA’s sudden decision to stop the sustainable farming incentive, Sir Geoffrey Clifton-Brown questions the decision, which was made with no notice and no consultation, and asks the Minister to outline plans for a replacement.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nThe announcement was sneaked out with no notice last night. If the Minister knows anything about farming, he will know that it takes months, if not years, to plan. Farmers had no notice of this. Will he tell us what will replace the SFI, when he will consult, and when it is likely to come into operation?\nThe Minister for Food Security and Rural Affairs (Daniel Zeichner)\nOver the next few months, through the spending review, we will review how we can improve the scheme to avoid the very point that the hon. Gentleman has just made, and I will report back to the House later in the summer.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_caged-farm-animals/content_29.html": "I would like to assure you that my ministerial colleagues and I take the welfare of all animals seriously. Since publishing the Action Plan for Animal Welfare, the Government has delivered an ambitious legislative programme, bringing significant improvements for animals both in the UK and abroad. Ministers are firmly committed to maintaining the UK’s strong track record on animal welfare and to delivering continued improvements, both in the course of this Parliament and beyond.\nI understand that my ministerial colleagues do not believe that the time is right to consult on cage reforms, recognising some of the challenges that numerous sectors have faced in recent years. I am informed that the market is already driving the move away from using cages for laying hen production, with over 60 per cent of eggs coming from free range production. Regarding pigs, the UK also has a significant outdoor pig sector, with 40 per cent of the national sow breeding herd farrow freely on outdoor pig units with no option of confinement.\nI am assured that the Government will continue to work with the sector to maintain and enhance high standards of welfare. For example, the Animal Health and Welfare Pathway will prioritise areas for additional improvement in the health and welfare for pigs, cattle, sheep and poultry. I know that one of the Government’s priorities for the pathway includes supporting producers to transition away from confinement systems.\nOf course, if you have specific concerns about the welfare of an animal, I recommend reporting it to the police or the RSPCA.\nAnimal Welfare Standards in International Trade -\nI am assured that the Government continues to advance international co-operation on animal welfare and to promote high welfare standards. I am aware that production methods such as sow stalls and battery cages are already not permitted in the UK. I welcome that the Prime Minister has confirmed that the Government will safeguard the UK’s ability to maintain high animal welfare, food and environmental standards in new trade agreements.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_sir-geoffrey-clifton-brown-urges-public-scrutiny-ps25-billion-steel-funding-commitment/content_7.html": "Sir Geoffrey Clifton-Brown, Chair of the Public Accounts Committee, queries the Government on the £2.5 billion committed to supporting steel and asks for a timeline for publishing the required accounting officer assessment so the Public Accounts Committee can verify compliance with public spending rules.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nI take at face value what the Minister has said today about British Steel having a bright future. However, she did not mention any figures, other than a global figure of £2.5 billion floating around somewhere. Will she tell the House when she expects to publish the accounting officer assessment that is required when public money is committed? We can then test in the Public Accounts Committee whether those rules for spending public money are being adhered to, particularly in terms of feasibility.\nThe Minister for Industry (Sarah Jones)\nThe hon. Gentleman makes a really good point: we are spending public money, and we need to be incredibly careful in the way we do that. Of course, what we spend will be accounted for in the Department for Business and Trade annual accounts, as the insolvency costs were when we were in this position in 2019. We will update the House and bring forward whatever we can on those figures. He is right to raise that. I want to reassure him that the £2.5 billion is not floating around; it is a commitment in the Labour manifesto, and it is budgeted for. How we might spend that money is what we are trying to devise through the plan for steel, which will rightly have a lot of scrutiny from this House, the Public Accounts Committee and others.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_future-local-government-meeting/content_5.html": "19 March 2025\nFuture of Local Government Meeting\nOn Friday, Sir Geoffrey Clifton-Brown attended an event held at St Laurence’s Church in Stroud to discuss the future of local government with other local politicians.\nHe said:\n“There was high turnout of interested residents, and we had a very productive meeting.\n“The final submission will be going to central government on 28 November 2025. I look forward to working with all parties and community groups to ensure that we get the optimum local government structure in Gloucestershire to provide our people with the very best and workable services. They deserve no less from their politicians.”",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_sir-geoffrey-clifton-brown-signs-letter-home-secretary-opposing-245-shotgun-certification-fee/content_47.html": "Today [30 January 2025] the Shadow Home Secretary Chris Philp MP has joined the Chairman of the All-Party Parliamentary Group on Shooting and Conservation (APPG), Sir Geoffrey Clifton Brown MP in writing to the Home Secretary Yvette Cooper to oppose the proposed 245 per cent increase to shotgun certifications.\nIn a letter open to signatories from all parties, they have described the increases as ‘exorbitant’. This follows news that the Government plans to increase the fees for owning a licenced firearm by 4.5 times inflation since 2015 (when the fees were last set).\nChris Philp MP, MP for Croydon South and Shadow Home Secretary, says:\n“These are hugely exorbitant increases and will put pressure on hundreds of thousands of people in rural communities who have already suffered under this government’s choices.\n“Labour are increasing a shotgun certificate grant from £79.50 to £194 – 244% of the current fee, while a shotgun certificate renewal will increase from £49 to £126 – 257% of today’s fee.\n“Inflation since 2015 has been 35%, meaning these increases are up to a disproportionate 4.5 times inflation. This is wholly unjustified and only adds insult to injury for the hard-working people in rural communities whose livelihoods the Labour government has already threatened.”\nSir Geoffrey Clifton Brown, MP for North Cotswolds and Co Chair of the APPG for Shooting and Conservation, says:\n“These extortionate fee increases imposed by the Government without any consultation are completely unacceptable.\n“Following on from the family farm tax, this is yet another attack on the rural communities.\n“I sincerely hope that as a result of bringing this to the attention of the Home Secretary, she will reconsider the level of fee increases and ensure that all police forces offer a quick and efficient service.\n“I look forward to discussing this further with her.”",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_sir-geoffrey-clifton-brown-visits-henley-bank-high-school/content_41.html": "17 February 2025\nSir Geoffrey Clifton-Brown visits Henley Bank High School\nOn Friday 14th February, Sir Geoffrey Clifton-Brown MP visited the recently re-opened sixth form at Henley Bank High School in Brockworth.\nSir Geoffrey spoke about his career and role as a Member of Parliament and then answered questions from the students.\nHe said,\n“The questions were very well prepared and on a range of topics including President Trump, the economy, being an opposition MP and how I take my constituent's views into account when voting.\"\nIf you would like Sir Geoffrey to visit your school please contact his office at cliftonbrowng@parliament.uk",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_statement-assisted-dying/content_17.html": "I know coping with terminal illness is obviously deeply upsetting and difficult both for the patient and their families. Cases such as these are truly moving and evoke the highest degree of compassion and emotion. As the Member of Parliament for North Cotswolds, I have been contacted by a number of families sharing their experiences on this matter and I am very saddened to hear their stories.\nI fully accept that assisted dying is a subject on which it is entirely possible for people to hold widely different but deeply held opinions. This is why any change of the law in this area is not a matter of party politics but of conscience, and any vote should be a free one should the law in this area be altered.\nI accept that there are imperfections and problems with the current law. However, a change in the law on assisted dying is one of the most difficult conscience issues that any Member of Parliament must weigh up and extremely carefully consider before casting their vote.\nOn the one hand there are tragic cases of patients suffering and the consequent heartbreak for close relatives; on the other hand there is enormous pressure on the medical profession, to decide when the thresholds, which would have to be included in any change of legislation, are met.\nI have now read the Private Members Bill. All the time I have been a Member of Parliament, I have listened very carefully to the arguments on both sides. I do not believe that the Bill is materially different to one that came to the floor of the House in 2015 which is one I voted against. The wording of this bill does not provide sufficient details of the safeguards in place to protect those that are vulnerable and the medical profession. I also disagree that a Bill of this magnitude should be rushed through, with a maximum of five hours on floor of the house.\nThe more I have heard over this week, the more resolute I am that I would vote against this Bill. The pressure on the court system would be untenable with public hearings only being able to be heard at the Family Division of the High Court. The current backlog means these decisions might take longer than six months.\nFurthermore, even though the bill does state that those found guilty of coercion would be sentenced up to 14 years, it fails to define what behaviour would be considered as coercion. This could include family members coercing their elderly relations to consider this option, or doctors even bringing it up to vulnerable patients who had never thought of it as an option.\nI know that I will have disappointed some in my response, but I have been deeply touched by the cases of families that have written to me, and the strong view of arguments of varying opinions.\nI will continue to raise the problem of funding hospices which is currently very variable, often relying on donations. Everyone deserves the best possible quality of care towards the end of their life, and more could in this area so I have raised a written question on hospice funding, and I will continue to pursue this matter in Parliament. More needs to be done to ensure that we improve the quality of our end of life care, and I will support any further work on this issue.\nI regret that I will not be able to attend the Private Members Bill debate on 29 November as a close family member has been given their operation date on the Thursday and it is critical that I am home to care for them the next day.\nThank you for contacting me on this matter.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_sir-geoffrey-clifton-brown-highlights-vehicle-weight-concerns-ev-transition-debate/content_9.html": "During a debate on regulations aimed at supporting the transition to zero-emission vehicles, Sir Geoffrey Clifton-Brown highlights vehicle weight as a potential key factor influencing a person's decision to switch from an internal combustion engine to an electric vehicle, particularly for those needing to tow a trailer when their driving licence has a 7 tonnes GVW restriction.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nIt is interesting, when sitting in the Chamber, to hear colleagues’ expertise on subjects that we did not know they had expertise in. I wish to draw my hon. Friend back to a slightly different subject, which he was beginning to touch on. Electric vehicles, which of course have batteries, tend to be far heavier than equivalent vehicles with an internal combustion engine. Some of the vehicle combinations that the Minister talked about—for example, he mentioned a vehicle and a trailer not exceeding 7 tonnes gross vehicle weight—would vary in weight depending on whether the car or van was electric. That might affect a person’s decision to change from a vehicle with an internal combustion engine to an electric vehicle.\nGreg Smith (Mid Buckinghamshire) (Con)\nMy hon. Friend makes an accurate point. In some ways, the statutory instrument seeks to address that point. However, he is right that when real people out there in the country make choices on their vehicles, they will make practical decisions such as the one outlined by my right hon. Friend the Member for North West Hampshire (Kit Malthouse), rather than looking at some of the other things the Government from time to time wish they were thinking about when they make those choices.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_sir-geoffrey-clifton-brown-visits-cotswold-farm-park/content_2.html": "Today Sir Geoffrey visited Cotswold Farm Park to show support for local tourism as part of English Tourism Week 2025.\nTourism plays a vital role in the Cotswolds economy and businesses like Cotswold Farm Park are driving growth by evolving and diversifying to meet visitor needs.\nSir Geoffrey said:\n“I was given a tour of the attraction by Graham Barclay, who has been nominated as one of VisitEngland’s Tourism Superstars 2025. This prestigious national award recognises individuals who go above and beyond to ensure visitors have a memorable experience. The Cotswolds as a destination has yet to claim a winner in this competition, and everyone from our destination organisations to staff in the Farm Park are encouraging locals and visitors alike to vote now for Graham.\n“I am also pictured with Olivia Grimsdell from Cotswold Wildlife Park and Sally Graff from the Cotswold & West Oxfordshire Tourism Team.\n“Graham Barclay’s dedication to ensuring visitors have an unforgettable experience makes him a truly deserving finalist in the Tourism Superstar competition. I have cast my vote and encourage everyone to get behind Graham’s nomination and show their support for our region.\n“Please vote for Graham, using the following link - https://visitenglandawards.secure-platform.com/tourismsuperstar/gallery?roundId=373”",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_dementia-diagnosis-and-research-0/content_25.html": "There are currently 900,000 people living with dementia in the UK and this is projected to rise to 1.6 million by 2040, so research is crucial to understanding the condition and improving outcomes for those affected.\nThe Government is committed to supporting research into dementia and has committed to double funding for dementia research, to £160 million per year by 2024/25.\nIn August 2022, the Dame Barbara Windsor Dementia Mission was launched along with £95 million of government funding. The mission is part of the commitment to double dementia research funding and aims to speed up the development of new treatments.\nThis was followed by the announcement of £6 million funding in March 2024 to boost clinical trials and innovation, including work in Northern Ireland on how AI can be used to support dementia diagnosis, and research in Scotland looking at how ‘biomarkers’ found in blood can help detect the disease early.\nA new taskforce – made up of industry, the NHS, academia and families affected by dementia – will lead this work to allocate dementia funding. You can register your interest to take part through the Join Dementia Research website here: https://www.joindementiaresearch.nihr.ac.uk/\nThe National Institute for Health and Care Research has also launched a number of new initiatives to support dementia research, such as investing nearly £11 million to develop new digital approaches for the early detection and diagnosis of dementia.\nFinally, the Government has announced its intention to develop and publish a Major Conditions Strategy. Dementia is one of the six major conditions included in the strategy.\nLast year, the Government held a call for evidence for the Major Conditions Strategy. The Government is analysing evidence received and will respond in due course.\nDelivery Plan for the Dame Barbara Windsor Dementia Mission\nI note your concerns over the timeline and delivery plan for the Government's Dame Barbara Windsor Dementia Mission. I am reassured that the Government remains strongly committed to supporting research into dementia, including its commitment to double funding for dementia research. The Government has a strong record in this area, having spent over £454 million on dementia research from 2018/19 to 2022/23.\nLecanemab and Donanemab\nI am greatly encouraged by the clinical trial results for Lecanemab and Donanemab, the first drugs of their kind to demonstrate a reduction in the rate of decline in people's memory and thinking in clinical trials. These findings will bring hope to the many thousands of people affected by dementia, and I look forward to receiving further updates about the development of these drugs. Research conducted and funded by medical research charities is critical to discovering new treatments and interventions for diseases like dementia, and I congratulate Alzheimer's Research for the work that has led to these findings.\nNew medicines must receive authorisation from the Medicines and Healthcare products Regulatory Agency (MHRA) and a recommendation from the National Institute for Health and Care Excellence (NICE) to demonstrate clinical and cost effectiveness before they can be made routinely available to National Health Service patients in England.\nNICE’s appraisals of Lecanemab and Donanemab for treating early Alzheimer's disease are currently underway and, subject to licensing, NICE expects to publish final guidance in summer 2024 as close to licence as possible.\nNICE has begun work in readiness for the companies submitting their evidence. This includes work done by NICE’s Health Technology Assessment Innovation Laboratory (HTA Lab) to identify the key issues that might arise during planned and future evaluations, based on current knowledge, publicly available evidence and in-depth discussions with researchers, patient groups and National Health Service colleagues.\nThe NICE HTA Lab report found that NICE’s methods and processes for evaluating new treatments for use in the NHS are appropriate for the new class of Alzheimer’s drugs and identified key issues that need to be considered during evaluation.\nDementia Diagnosis\nDue to the impact of the pandemic, the estimated dementia diagnosis rate fell below the national target for the first time since 2016. While the rate has recovered slightly since the early part of the pandemic, there is more to do if we are to reach the national target for two thirds of people with dementia to be formally diagnosed. In 2021-22, £17 million was made available to Clinical Commissioning Groups to address dementia waiting lists and increase the number of diagnoses, which I hope will have an impact in our local area.\nIn December 2022, the recovery of the dementia diagnosis rate to the national ambition of 66.7 per cent was included in the NHS priorities and operational planning guidance as part of the refined mental health objectives for 2023/24. This reinforces dementia as a key priority for NHS England and provides a clear direction for integrated care boards to support delivery of timely diagnoses within systems. The estimated dementia diagnosis rate has been increasing throughout 2023 and in October reached 64.5 per cent.\nFurthermore, the Office for Health Improvement and Disparities’ Dementia Intelligence Network has been commissioned by NHS England to develop a resource to support investigation of the underlying variation in dementia diagnosis rates. The aim of this work is to provide context for variation and enable targeted investigation and provision of support at a local level to enhance diagnosis rates. The tool has been released and is available via the NHS Futures Collaboration platform.\nDementia Research\nThe Department, via the National Institute for Health and Care Research (NIHR), invests in world-class facilities, expertise and a skilled delivery workforce for clinical research in the NHS and wider health and care system. This includes the Dementia Translational Research Collaboration, which plays a critical role in coordinating UK dementia research in early phase clinical trials and the NIHR Clinical Research Network Dementias and Neurodegeneration Specialty, which supports patients, the public and health and care organisations across England to participate in dementia research spanning the full translational research pathway.\nThe multi-year Vision for the Future of UK Clinical Research Delivery was published in 2021, setting out the Government's ambition to create a patient-centred, pro-innovation and digitally enabled clinical research environment. The Government also commissioned Lord O’Shaughnessy to conduct a review into commercial clinical trials following a drop in the UK’s performance during and following the pandemic. The Government published the full response to the Lord O’Shaughnessy review in November 2023.\nIn the Autumn Statement 2023, the Chancellor announced that the Government is launching the first Clinical Trials Delivery Accelerator (CTDA) focused on dementia, with up to £20 million of the £121 million funding announced for clinical trials at the May life sciences moment, to help innovation reach NHS patients even faster.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_flooding-updates-cirencester-town-council-environment-agency-and-thames-water/content_19.html": "Please find below the latest flooding updates from Cirencester Town Council, the Environment Agency and Thames Water.\nCirencester Town Council: Update October 2021\nEnvironment Agency: Updated 29 June 2021\nThe following Environment Agency update provides an overview of its flood risk activities in the Cotswolds Constituency since the Cotswolds annual flood forum meeting on 5 March:\nMaintenance overview\nWe continue to deliver our flood risk maintenance programme in the Cotswolds as planned and have completed some extra work that we received additional funding to deliver. This includes maintenance to all of the tributaries of the River Churn in the Preston & Siddington areas, reducing flood risk by removing some very large blockages and returning the flow back to those channels. Funding for this work will not be available every year so in the future it will fall to the riparian owners to be aware of the ongoing maintenance requirements through their stretch of the river and to undertake the maintenance that they deem necessary.\nCirencester\nWe continue to support Cirencester Town Council in relation the Memorandum of Understanding they have with local land owners to operate sluice gates in the town centre. An exercise to run through the operation of the Memorandum of Understanding with the Town Council is being planned.\nWe have received funding to complete routine river maintenance on behalf of the riparian owners this year and have completed river channel and bank clearance. In the autumn, we plan to remove trees which have fallen into the upper reaches of the River Churn.\nWe and other partners attended the recent Cirencester Flood Risk Management Group meeting which was led by Gloucestershire County Council. One of the key outputs of the meeting was to explore further the impact of groundwater levels on flooding in the area which will involve input from our hydrogeologists.\nWe have submitted a bid for government funding to improve the flood defences in Watermoor. Subject to the success of this funding bid, we will carry out an inspection to identify the remediation options available.\nBledington\nWe and other partners have been involved in supporting the work of the Bledington Flood Group. We have provided technical input on flood risk activity permitting and further flood risk measures. We have also brought forward our maintenance work which is scheduled to start during the week commencing 2 August.\nThames Water: Updated October 2021\nWe are absolutely committed to protecting and enhancing our rivers and supporting the communities who love them. Putting untreated sewage into rivers is unacceptable to us, to our customers and to the environment. We're working hard to make discharges unnecessary, with the help of the government, Ofwat and the Environment Agency. Our current business plan, spanning 2020-2025, will deliver environmental improvements to 745km of rivers across the region. The use of digital technology to create a more intelligent sewer network and enabling more proactive maintenance and repairs will help us to drive a reduction in untreated sewer discharges.\nEliminating discharges is not going to be quick, easy, or inexpensive and we welcome the continued support of our customers and regulators, who are equally passionate about this topic, as well as extensive collaboration with local communities and other stakeholders, to achieve cleaner rivers.\nSpecific questions regarding Apney St Peter (responding to development and recreational use of the river):\nI’d like to reassure you we are significantly investing in Ampney St. Peter Sewage Treatment Works (STW). Ampney St. Peter STW has been upgraded numerous times over the years to comply with the new discharge permits and storm tank improvements. We are currently planning a ‘flow to full treatment upgrade’ which put simply means the treatment process will be increased to accept more flow for treatment and reduce the amount of untreated sewage going into our storm tanks or discharging to the environment. The project, alongside a number of other STW upgrades are being reviewed at the moment but we expect the upgrade to be completed no later than March 2025. In order to size the upgrade sufficiently we have also delivered some additional onsite flow monitoring this year which will allow us to better understand the volumes of flow coming in and out of the site.\nIn reference to the pumping arrangements. In 2017/18 we installed a second wet well (underground storage tank) adjacent to the original Ampney St. Peter pumping station and separated the two incoming sewer networks serving the STW. The original pump station now only serves the network from Ampney Crucis, whilst a new pump station serves Ampney St. Peter and Ampney St. Mary. This scheme substantially reduced the risk of flooding in the catchment.\nWe recognise more work needs to be done, particularly when it comes to infiltration. This occurs predominantly during winter/spring months when groundwater levels are high, resulting in clean water infiltrating into the sewer network or through manholes from surcharging highway/land drainage. Ampney St. Peter catchment suffers from this seasonal infiltration, and this affects the sewer network at the same time placing significant pressure on STWs. We are working to tackle some of the root causes and in the short term our operational teams have been working hard carrying out lift and look surveys & CCTV investigations to identify sources of water ingress. As a result, we have repaired sections of high risk sewers and sealed a number of manhole covers.\nLooking further ahead we are developing a Groundwater Impacted System Management Plan (GISMP) for the Ampney St. Peter sewerage system. GISMPs are agreed with the Environment Agency and published on our website. They outline the short, medium and long term interventions to tackling infiltration in the sewerage system. https://www.thameswater.co.uk/about-us/regulation/drainage-plans. We are building evidence for a more strategic wholesale approach to sewer lining to line large portions of the network in the high-risk groundwater areas of the network for each system. We are not funded to deliver this level of lining in this period (2020-25), however, where interventions can be undertaken as part of routine sewer maintenance activities these will be communicated and progressed separately.\nAmpney St. Peter STW is also being assessed under the Environment Agency SOAF (Storm Overflow Assessment Framework) programme. The framework ensures that we are proactively monitoring and managing the performance of our overflows considering the pressures of growth and changing rainfall patterns. Stage 1 and 2 assessments which investigates the root cause of the spills and quantifies environmental impact is due to be complete for Summer 2022. Interventions identified as part of this process will be included in our next business plan (2025-2030).\nDevelopment\nWe have a duty to provide maintain and extend our sewer network to accommodate new development. For STW upgrades we are funded through our 5 year business plan and for sewer enhancements we are funded via infrastructure charges from developers. To help us understand what development is coming forward we monitor local plans which give a longer-term view of development, up to 20 years, as well as planning applications which give a 1 – 5 year view.\nAs you may be aware, Water and Sewerage companies are not statutory consultees in the planning process and have limited powers to prevent connection to our networks. We therefore work closely with developers and planning authorities to ensure any upgrades needed to serve a new development are delivered in line with the new development’s needs/timescales. When commenting on planning applications we undertake desktop assessments to calculate any potential impact on the existing infrastructure and in some cases we may seek an appropriately worded planning condition to ensure occupation of the development doesn’t outpace the delivery of the infrastructure.\nWhen assessing new development it is important to understand whether surface water flows are proposed to discharge into our system. Foul flows from new development are often very small in comparison to the existing sewerage systems – we often refer to 100 houses of foul flow being equivalent to one house with their roof drainage connected into the foul. Therefore when we undertake desktop assessments for foul flow the impact is often assessed as negligible in comparison to the existing situation, assuming new surface water flows are managed on site and not connected to our system. So discharges from Ampney St. Peter are a result of infiltration into the sewers, not from over development and our efforts in the catchment are to restore the headroom by reducing the infiltration flows.\nAll discharges from STWs are regulated by the Environment Agency. We monitor spills from STWs over a long period of time (multiple years as weather patterns are varied) to understand the impact surface water/infiltration is having and if triggers are met we will instigate a STW study and plan upgrades as appropriate to remain compliant within our consent. We recognise the lag effect this causes, and we are working with WaterUk and DEFRA to challenge a developers right to connect.\nRecreational use of the river\nWe fully appreciate just how well loved these rivers and stream are and why people want to use them for recreation. However, we need to gently remind people that sewage discharges aren’t the only sources of pollutants, nor are water companies responsible for river quality generally. Animal faeces from livestock and wildlife, along with run-off from farms and roads, also contribute to the hazards. It really is up to individuals to make informed decisions based on numerous factors and we support the government’s advice on open water swimming: https://www.gov.uk/government/publications/swim-healthy-leaflet/swim-healthy\nThe wider health of the river concerns us, though formal assessments are part of the Environment Agency’s role. We certainly recognise that real-time discharge notifications of sewage discharges play an important part in helping people make informed decisions about whether to use the river or not. We're currently trialling these notifications around Oxford to support an application for bathing water status. Details on this can be found here (www.thameswater.co.uk/riverhealth). We're looking to adopt a similar approach for our other wastewater catchments in the future. The Environment Agency are responsible for river health and undertake regular monitoring to better understand areas that require additional investment and interventions, either from water companies, councils or private landowners. Long term monitoring can be an expensive and resource intensive activity and as such is usually targeted to hotspot areas and for a finite period. Our Oxford trial will run for at least a year and will be the longest bacterial monitoring programme on a watercourse in England. The learnings from this will help us better understand the general health of the river and what proportion of the perceived poor water quality is linked to sewage spills/effluent, under a range of conditions.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_contact/content_8.html": "Contact\nWrite:\nSir Geoffrey Clifton-Brown MP\nHouse of Commons\nLONDON\nSW1A 0AA\nTelephone:\n020 7219 5147\nemail:\nCLIFTONBROWNG@parliament.uk\nPlease include your full name and postal address, including post code, in any email correspondence with Sir Geoffrey Clifton-Brown.\nProtecting Your Data:\nMy office will not use your personal data in any way that goes beyond your reasonable expectations in contacting me. Please see my Privacy Notice.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_public-accounts-committee-report-cross-government-working/content_46.html": "The Public Accounts Committee investigated cross-government working, publishing a report into the inquiry this year. Insufficient or lacking data is impeding collaboration among government departments on various projects.\nA recent report emphasises the need for enhanced transparency in reporting across multiple policy domains, including achieving net zero emissions, improving health and social care, and addressing regional disparities.\nThe Public Accounts Committee (PAC) underscores the imperative for effective interdepartmental cooperation, urging both HM Treasury and the Cabinet Office to take proactive measures to facilitate and enhance such collaboration. The PAC highlights recurring obstacles that hinder cross-government initiatives, such as bureaucratic barriers, unclear ministerial priorities, inconsistent allocation of resources, inadequate data sharing, and limited mechanisms for sharing best practices.\nNumerous cross-government endeavours reviewed by the PAC suffer from data deficiencies, notably in areas like the criminal justice system and monitoring net zero investments. The report underscores persistent challenges in data management, citing technical complexities and departmental reluctance to share information as major impediments to collaborative efforts.\nMoreover, the report highlights the lack of clarity regarding departmental responsibilities for policies spanning multiple domains. Key policy areas like achieving net zero emissions, improving healthcare, and promoting regional development lack consistent reporting mechanisms, prompting the PAC to urge the Cabinet Office to enhance transparency in reporting on these cross-cutting objectives.\nWhile initial efforts have been made to assess cross-government collaboration, the PAC urges HM Treasury to exert further influence. This includes scrutinizing proposed projects to ensure alignment with cross-cutting objectives, incorporating robust evaluation plans, and specifying expected cross-government outcomes and outputs.\nThe Full Report –\nhttps://committees.parliament.uk/publications/43286/documents/215470/default/\nDetails on the Inquiry –\nhttps://committees.parliament.uk/work/7941/crossgovernment-working",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_gallery/content_3.html": "Gallery Pagination Current page 1 Page 2 Page 3 Page 4 Page 5 Page 6 Page 7 Page 8 Page 9 … Next page Next › Last page Last »",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_we-will-give-taxpayers-aerial-view-how-their-cash-being-spent/content_37.html": "Sir Geoffrey Clifton-Brown writes for The House Magazine.\nOver the past few weeks, the reconstituted Public Accounts Committee (PAC) has been gearing up to scrutinise policy delivery across government. Having served as deputy chair of the PAC for seven years under Meg Hillier’s excellent chairmanship, the privilege of my election as committee chair has felt rather like a homecoming.\nWhat feels equally familiar in these early days of the committee’s work is the plethora of ongoing challenges for government in delivering its planned policies. So, as we shift from assessing the effectiveness of the previous government’s delivery to that of the incumbents, we will not be resting on our laurels; for there is much to do.\nWithin a couple of days of the appointment of the committee’s membership, we had launched 18 inquiries. These aim to tackle an illuminating cross-section of areas including health, homelessness, the environment, tax, transport, education, technology, and the asylum and justice systems.\nWe will aim to use the PAC’s uniquely wide focus across government to provide the aerial view of how well taxpayers’ money is being spent across the public realm. As chair, I will ensure that the committee continues to keep at the heart of its work the ways in which our constituents are impacted by government policy.\nNowhere is that impact more widely felt than in the NHS. The National Audit Office (NAO) found in July that the system was in danger of breaking; the current government’s position is that it is broken. These descriptions of services on which all of us depend are a landmark moment of alarming enormity, and we will be looking with great urgency at how well operational improvements are implemented.\nOur committee will also be probing the systemic failure of dangerous cladding. According to the NAO, of the 9,000 to 12,000 buildings over 11m in height that the government estimates need remediation, up to 60 per cent are yet to be identified, with work still to start on half those that have been.\nI met a number of residents who were completely traumatised by the Grenfell fire shortly after it had happened. As a chartered surveyor I take a personal interest in building safety. I know I speak for all our members when I say we want to do everything in our power to make sure Grenfell can never happen again.\nThere is not space here to go into detail on the full range of the PAC’s programme, but I would like to mention our inquiry into the use of artificial intelligence (AI) in government. In an environment in which the civil service is under constant pressure to do more with less, many believe digital and other technologies like AI could offer solutions. It has the potential to both transform and disrupt almost every area of life, with implications for a multitude of the policy areas under PAC’s remit.\nOur committee shall be exploring how AI will change government’s operations, and how government in turn is mitigating any risks involved. We will want to make sure any adoption is done in a way that both safely and ethically augments services.\nI’ve also laid down a marker to all government departments, with whom the PAC will continue to provide that effective challenge. Any inadequate responses to our inquiries will be given short shrift. I’ve also told departments to routinely consider the diversity of those they send to give evidence, in order that we can be confident our inquiries hear from the widest possible range of voices.\nAs chair, I will be doing everything possible to empower our new members to take full part in the committee’s scrutiny. My door is also open to any colleagues who have relevant issues which they feel should be raised in our inquiries. The administration may have changed, but the PAC’s role in holding government accountable for delivering for those who most rely upon it certainly has not.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_global-plant-based-treaty/content_39.html": "As you will likely know, the UN's Intergovernmental Panel on Climate Change has concluded that the world is warming faster than anticipated, the effects of which are being seen in every single region of our planet. Urgent action is needed to limit global warming and put nature on a path to recovery, and I am encouraged that the Government is already taking decisive action to this end, being the first G7 country to legislate to achieve net zero by 2050 and the fastest decarbonising G20 country.\nHowever, the UK's efforts will not be sufficient alone. That is why the Government has been calling for global ambition and action to reduce emissions across all sectors, including in agriculture, forestry and other land use, which is collectively responsible for roughly 23 per cent of global emissions. Recognising the need to reform the way we grow and consume food in order to tackle climate change, the UK seized the opportunities of our G7 and COP26 Presidencies to drive international action and commitments to this end.\nFor instance, in May 2023, G7 Leaders reaffirmed their commitment to accelerate an inclusive global transition to sustainable and climate resilient agriculture and, at COP26, over 140 world leaders joined the Glasgow Leaders’ Declaration on Forests and Land Use (GLD). This committed them to “halt and reverse forest loss and land degradation by 2030 while delivering sustainable development and promoting an inclusive rural transformation”, and was backed by a financial package of $19.2 billion.\nNevertheless, as demand for food increases, further action on land use and environmental degradation is urgently needed. To this end, the Prime Minister announced £65 million for the Nature, People and Climate Programme at COP27, which supports indigenous and local forest communities. This funding will drive forward agricultural innovations and measures to boost sustainable livelihoods, as well as support work to conserve and restore millions of hectares of forest.\nIt is for the reasons outlined here that I do not believe it necessary to sign the Plant Based Treaty at this time. While this may be disappointing to you, I hope I have reassured you that the Government recognises the need to accelerate the shift towards sustainable food systems and considerable work is ongoing to this end.\nDomestic Efforts\nDomestically, the Government advocates for a healthy and balanced diet based on the national food model the Eatwell Guide. The evidence is clear that our diets should include more fibre, fruit and vegetables. I am also aware that meat and dairy can both be an important part of a balanced diet. While the Government encourages people to eat sensibly, I believe it is for each individual to decide how much meat and dairy is in their diet.\nThe Government’s Food Strategy sets out the importance of maintaining and boosting our food security. It commits to broadly maintaining the current level of food that we produce domestically and boosting production in sectors where there are the biggest opportunities, such as horticulture and seafood. Through harnessing new technologies and innovation, we will grow and eat more of our own food, which will unlock jobs across the country, grow the economy, and help to reduce pressure on food prices.\nThe Government also launched a call for evidence to better understand the opportunities and challenges associated with the use of feed products that can reduce methane emissions from livestock. Following this call for evidence, the Department for Environment, Food and Rural Affairs committed to working closely with the industry and farmers to develop a mature market and mandate the use of safe and effective methane suppressing feed products in suitable cattle.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_search/content_16.html": "Skip to main content\nMain navigation\nHome\nAbout Sir Geoffrey\nNews\nIn Parliament\nPublic Accounts Committee\nCampaign Responses\nGallery\nContact\nSearch\nToggle navigation\nMain navigation\nHome\nAbout Sir Geoffrey\nNews\nIn Parliament\nPublic Accounts Committee\nCampaign Responses\nGallery\nContact\nSearch\nSearch\nSearch\nSearch",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_public-accounts-committee-mobile-connectivity/content_36.html": "The Cotswolds MP raised with senior officials during a Public Accounts Committee inquiry the issue of broadband poles that have been blighting villages including Willersey, notspots, and the future of satellite technology to help improve coverage in rural areas. The Public Accounts Committee held an inquiry on the progress of UK-wide reliable mobile connectivity, with a public meeting on Monday 22 April. MPs including Sir Geoffrey Clifton-Brown who is the Deputy Chair, questioned a panel of senior officials including the Permanent Secretary of the Department for Science, Innovation, and Technology.\nSir Geoffrey began the inquiry by asking about the installation of broadband poles in areas, such as Willersey, where adequate systems installed in underground ducts already exist. He suggested that the Electronic Communications Code Regulations 2003 need to be amended as well as planning legislation to prevent this from happening in the future, at least in national parks or areas of outstanding national beauty.\nNotspots and partial notspots for mobile signal are an issue across rural areas, Sir Geoffrey raised the Fossebridge on the A429 which despite being a major arterial road, has a particular stretch with no signal. As well as raising 4G and 5G coverage problems raised by a constituent in Coln St Aldwyns.\nHe also raised the use of low-orbit satellites, such as Elon Musk’s Starlink, which could fill many of the notspot gaps in broadband roll-out and in mobile phone technology in rural areas. The Permanent Secretary confirmed that the Government is currently running trials in 15 sites to assess the cost-effectiveness and the success at supporting hard-to-reach areas compared with traditional infrastructure.\nCommenting on the inquiry, Sir Geoffrey Clifton-Brown said:\n“The Public Accounts Committee (PAC) is a great opportunity to raise issues in the constituency with some of the most senior officials in Government. Now that the public meeting is over the PAC will write a report and a series of recommendations to the Government, which they are required to respond to usually within six weeks.\n“There are particular problems in rural areas, in remote areas receiving superfast broadband, the same is true for mobile phone reception, although the locations are not always the same. My campaigning on the public accounts for super-fast broadband has affected a recent contract signed by the government to invest in east Gloucestershire. Hopefully, similar campaigning on mobile signal in the constituency will have similar results.”",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_call-evidence/content_42.html": "On Monday 22 April, I will be leading a Public Accounts Committee inquiry on Supporting Mobile Connectivity. We will be questioning senior officials including the Permanent Secretary at the Department for Science, Innovation, and Technology. I would like to raise the issue of rural ‘not-spots’, geographical areas with no coverage. I have examples already noted from my own experience of being in certain areas in the constituency and having no network. But if you have any examples you would like me to include, email my office at cliftonbrowng@parliament.uk.\nThe Inquiry\nThe Government has set a challenging ambition to deliver UK-wide reliable mobile connectivity. Its plans for 5G coverage are reliant on private sector investment, action from multiple departments and bodies, and learning lessons from the past. In March 2020, the Department for Science, Innovation and Technology (DSIT) launched a connectivity improvement programme the Shared Rural Network (SRN), which has led to 4G mobile coverage increasing from 91.4% in 2020 to 92.7% in 2023, against a target of 95% by 2025.\nThe National Audit Office (NAO) has found that the SRN is behind schedule, with three out of the UK’s four network operators admitting they may not be able to deliver the coverage required within current grant funding. It further found that government is not currently monitoring progress effectively, and does not have the information to understand what the programme is costing.\nIn 2021, the Committee’s report on Improving Broadband warned that digital inequality was compounding the economic inequality exposed by the COVID-19 pandemic. The Committee concluded that government’s pledge to deliver nationwide gigabit broadband coverage was unachievable, and that the hardest-to-reach premises may struggle with fixed broadband for years to come.\nBased on the NAO report, the Committee will take evidence from senior officials from DSIT and its agency, Building Digital UK, on subjects including progress on plans to deliver UK-wide reliable mobile connectivity, and the current picture for the SRN.\nThe PAC held an inquiry in 2021 on Improving Broadband, details of this inquiry and copies of the final report can be found following the link below\nhttps://committees.parliament.uk/work/709/improving-broadband/publications/\nNational Audit Office\nThe Public Accounts Committee uses the reports produced by the National Audit Office, the link below provides more detail on the NAO report and copies of publications.\nhttps://www.nao.org.uk/reports/supporting-mobile-connectivity/",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_public-accounts-committee-report-hs2-and-euston/content_35.html": "HS2 verdict: Scheme now very poor value for money after Northern leg cancellation.\n- Report calls for answers from Govt to questions raised by decision to cancel HS2 Phase 2\n- Failure of governance and oversight over spiralling costs following years of warnings\nFollowing the truncation of the High Speed 2 (HS2) programme to only its Phase 1, connecting London to the West Midlands, concerns were raised regarding its value for taxpayers. The Public Accounts Committee (PAC) has released a report scrutinising both the high-speed rail project and Euston station, adding to over a decade of scrutiny.\nThe government acknowledges that completing only Phase 1 would not yield sufficient value for money, as costs outweigh benefits significantly. However, the Department for Transport (DfT) argues that proceeding with Phase 1, excluding previous expenditures and factoring in avoided remediation costs, is still preferable. The Department for Transport (DfT) told the PAC it was still better to complete Phase 1 – a calculation made by excluding the £23bn spent to date, and including as a benefit of the project avoiding approximately £11bn of remediation costs from cancelling entirely. Nevertheless, the PAC remains unconvinced by the calculations and demands a clear assessment of Phase 1's benefits.\nThe cancellation of HS2's Northern leg raises uncertainties regarding to various implications. These include the disposal of unused land and property, consideration of taxpayer and local interests, fairness to those whose properties were compulsorily purchased, impacts on related rail projects, utilisation of redirected funds, and the operational challenges of slower high-speed trains on unsuited tracks. Persistent cost overruns and delays indicate governance and oversight failures at HS2 Ltd and DfT. The estimated cost of the completion of Phase 1 with inflation range as high as £67bn. The report demands explanations within six months on how these issues will be rectified.\nUrgent decisions are also required regarding funding for the development of HS2 Euston, reliant on attracting private investment. The absence of a government plan raises doubts about the feasibility of attracting the necessary investment within the required timeframe, according to the PAC.\nDuring the public hearing held back in November, I asked the Senior Officials about the individuals who have had their properties compulsorily acquired, often against their wishes or under the threat of compulsory acquisition.\nThe Full Report –\nhttps://publications.parliament.uk/pa/cm5804/cmselect/cmpubacc/67/report.html\nDetails on the Inquiry -\nhttps://committees.parliament.uk/work/7884/hs2-and-euston-recall/publications/\nOral Evidence of the Session -",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_sir-geoffrey-clifton-brown-gains-pms-backing-m5-junction-12-upgrade-meeting/content_34.html": "Sir Geoffrey Clifton-Brown secures the Prime Minister's support for a meeting with the Planning Minister to push for the much-needed £250m to upgrade Junction 12 on the M5.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nQ13. Most people would accept that we need more housing in this country, yet so often it is not accompanied by the necessary infrastructure. In my constituency, thousands of houses are proposed, yet without £250 million to upgrade junction 12 of the M5, the inspector is likely to rule our plan unsound. Will the Prime Minister use his upcoming Planning and Infrastructure Bill to see how developer and landowner contributions can more effectively build this vital infrastructure, which would benefit communities up and down the country? (903155)\nThe Prime Minister (Keir Starmer)\nThe hon. Gentleman is right: we have to get the houses that we need built in his constituency and elsewhere—something that the Conservative party failed to do. That is why we have introduced the infrastructure Bill, which I think he welcomes. That Bill will get Britain building, so that we can deliver on those 1.5 million new homes through our plan for change. On the issue he raises, he and my hon. Friend the Member for Stroud (Dr Opher) have been working together to try to resolve this issue, as I understand it, and I am happy to ensure that he gets a meeting with the relevant Minister, if that would help in taking it further.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-responses/content_13.html": "Campaign groups like 38 degrees often organise e-mail write-in campaigns to MPs. Here are some of Sir Geoffrey’s responses to these campaigns.\nI know coping with terminal illness is obviously deeply upsetting and difficult both for the patient and their families.\nCoping with terminal illness is obviously deeply upsetting and difficult both for the patient and their families.\nI welcome that the Animals (Scientific Procedures) Act 1986 (ASPA) provides protections for animals bred in the UK for use in scientific procedures.\nThere are currently 900,000 people living with dementia in the UK and this is projected to rise to 1.6 million by 2040, so research is crucial to understanding the condition and improving outcomes for those affected.\nI would like to assure you that my ministerial colleagues and I take the welfare of all animals seriously.\nAs you will likely know, the UN's Intergovernmental Panel on Climate Change has concluded that the world is warming faster than anticipated, the effects of which are being seen in every single region of our planet.\nThe Government recognises the importance of climate action and I welcome that the UK was the first G7 country to legislate to achieve net zero by 2050 and is decarbonising faster than any G20 country.\nCanals form an important part of the Government’s work in reintroducing biodiversity in nature.\nAll children should be able to access healthy food at school every day.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_about-sir-geoffrey-0/content_14.html": "Geoffrey was the Member of Parliament for Cirencester & Tewkesbury from 1992-1997, and has been the Member for the Cotswolds since 1997.\nSince becoming an MP in 1992 Geoffrey Clifton-Brown MP has served as the Parliamentary Private Secretary to the Rt. Hon Douglas Hogg QC MP, the Minister for Agriculture, Fisheries and Food; a Member of the Environment Select Committee and a Member of the Public Accounts House of Commons Select Committee. In October 2001, he was appointed a Shadow Frontbench Spokesman for Transport, Local Government & the Regions. In June 2002, he became a Shadow Minister for Local & Devolved Government Affairs. In March 2004, he was appointed as an Opposition Whip and in May 2005, he became Assistant Chief Whip. He is an active member of the Finance and Services Committee of the House since 2005. When David Cameron was elected as Leader of the Conservative Party, Geoffrey was appointed the Shadow Minister for Trade & Foreign Affairs. Geoffrey was later appointed in 2007 the Shadow Minister for International Development and Trade with responsibility for encouraging inward investment, promoting British business overseas and the World Trade Organisation, a role in which he served until the 2010 General Election.\nBetween 2010 and 2015, Geoffrey was Chairman of the Conservative Party International Office, which saw him oversee all activity of the international wing of the party. This included the Westminster Foundation for Democracy, Conservative Friends of Groups, Conservatives Abroad, the Conservative Party’s Sister parties around the world and the Alliance of Conservative Reformists in Europe (ACRE) in Europe. He is the Vice-President of the ACRE.\nSir Geoffrey is currently Chairman of the All Party Parliamentary Group on Shooting and Conservation, Treasurer of the 1922 Committee, Deputy Chair of the Public Accounts Committee, Chairman of the Conservative Friends of The Chinese and Member of the Finance Committee.\nHe was knighted for Political and Public Service in 2018.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_condition-and-maintenance-local-roads-england/content_38.html": "18 January 2025\nCondition and maintenance of Local Roads in England\nYesterday I appeared on BBC Points West to discuss the Public Account Committee’s latest report on the condition and maintenance of local roads in England.\nWhether travelling by car, public transport or bike, nearly everyone relies on local roads to go about their daily lives. Yet local road conditions in England are getting worse, with people increasingly unhappy with the state of disrepair and with increasing damage to vehicles from potholes.\nThe Department for Transport must lead efforts to avoid further deterioration of our local roads and tackle the backlog, which industry estimates as costing over £15 billion to fix.\nYou can read the full report here.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_visit-fire-service-college/content_26.html": "Yesterday I visited the Fire Service College, Moreton-in-Marsh, to meet with Hume Jones, Managing Director of Capita Fire and Rescue, and local District Councillor, Daryl Corps.\nWe covered many topics including the varied work of the college, and the interest expressed by London Ambulance and Met Police in training at the College. We also talked about their tri-service training and liaison with the army.\nThey have unique facilities at the college, which I hope they will invest more in to secure the site for the future. I emphasised the importance of the college for local employment and the local economy.\nWe discussed Cotswold District Council’s local plan update, and the concerns of residents about the scale of the proposed development and potential impact on the college site.\nWe also discussed soil contamination on the site caused by the historical use of Aqueous Film Forming Foam (AFFF) for fire suppression. While highly effective in extinguishing fires, AFFFs contain substances called poly- and perfluoroalkyl (PFAS), commonly referred to as \"forever chemicals,\" a major source of pollution across the globe since the 1940s, which do not easily degrade in nature. The foam had been used at the college dating back to when it was an RAF base, and there are many RAF bases across the country which have in the past used this foam.\nThe College are working closely with the Environment Agency to see what can be done to remediate this historic pollution problem.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_sir-geoffrey-clifton-brown-calls-fair-funding-rural-councils-audit-reform-and-clarity/content_32.html": "Sir Geoffrey Clifton-Brown speaks in a debate on local government finance highlighting the need for financial efficiency and the need for rural councils to receive fair funding. He also raises concerns about the backlog in local government audits and calls for urgent improvements, and seeks clarity on the timetable for restructuring of two-tier councils.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nI am pleased to follow my very hard-working, excellent deputy on the Public Accounts Committee, the hon. Member for Sheffield South East (Mr Betts), who has huge knowledge on local government matters. In fact, whenever we come to local government matters in the Committee, we always defer to him.\nI echo the opening remarks by my hon. Friend the Member for Thirsk and Malton (Kevin Hollinrake) about our hard-working councillors up and down the country, whatever their political persuasion. Often, they work many hours and do not get much pay for it. They do it because they want to improve the lot of their local communities, so I warmly welcome that. I even echo his opening remarks to the Local Government Minister, who I always think is a fair and reasonable man. He has dealt with this matter in a knowledgeable and professional way, and I pay tribute to him.\nI want to pick up on a couple of things from the excellent speech by the Chair of the Levelling Up, Housing and Communities Committee, the hon. Member for Vauxhall and Camberwell Green (Florence Eshalomi). She is very knowledgeable on this whole matter. First, the local health grant, which has been picked up by others, is peanuts in comparison with the total health budget, but if we can keep the population more healthy through the things that she said and other preventive measures, it would be far better for them and far cheaper for the country in the longer run. I do not know why Governments of all colours have not paid more attention to that.\nSecondly, I want to pick up on local housing allowances, which the hon. Member for Sheffield South East also mentioned. As he said, the impact on homelessness has not really been calculated, which our PAC report made perfectly clear. The Minister needs to look at that relationship and how we can get a closer, more targeted local housing allowance or another allowance to alleviate the problem of some of the poorest in our society who cannot afford the houses that they live in, and who have to be subsidised to a considerable extent by the local authority, putting even more pressure on it.\nOften, local government is not understood by our constituents, but they certainly know when they are not getting the services they pay for from their council. Council tax bills are increasing up and down the country. I was shocked to read that some people’s council tax is going up by as much as 10%, as the Secretary of State has given permission to override the legislation in place for a referendum to be called if council tax is raised by more than 5%. I remind the House, as my hon. Friend the Member for Thirsk and Malton did, that the Prime Minister stated in Bristol that he would freeze council tax bills for all. Clearly, that is not the case. I would love it if he was able to, but clearly when he said it, it was not realistic.\nThe Public Accounts Committee, which I have the great honour to chair on behalf of this House to try to expose how the taxpayer’s pound is spent—well or not, as the case may be—has taken a strong interest in local government. We will shine a light on the areas needed, as will the Chair of the Levelling Up, Housing and Communities Committee. Together, hopefully we can make a real positive difference in the way that services are delivered for people up and down this country.\nIt is clear that local government finances have increasingly become more dependent on council tax rather than central Government grants. I listened to the speech by the Liberal Democrat spokesman, the hon. Member for Woking (Mr Forster) about his local council, but it cannot be denied that some councils have managed their budgets better than others.\nI welcome the multi-year settlements that this Government have introduced. We often criticise the Government, but I think these settlements will be warmly welcomed by councils, and would, I think, be welcomed in other areas of Government spending, too. Like a business, local authorities will be able to plan, investing taxpayers’ money into longer-term projects with more certainty, and therefore hopefully using money more efficiently.\nI urge the Government in their review of the funding formula to keep in mind the rural-urban divide, which we have had quite a lot of discussion about this evening. In what I am going to say, I do not to wish pit one council against another in any way—that is not the object of what I am saying. I simply say that if we put the emphasis more on one facet and less on the other, we will benefit some councils and disadvantage others. The problem with rural councils is that in many cases it costs more for them to deliver services, which is not properly reflected in the grant. Even the House of Commons Library says that scrapping the rural service grant and replacing it with a recovery grant already demonstrates a divide. According to the Library, which is supposed to be independent, the change in methodology for allocating money has meant that rural areas are losing out to urban areas and city centres.\nNow, I do not want to get into deep water, but a need is a need. Adult and children’s social services, which have been mentioned today, are both high-consuming, voluntary parts of the budget, and are increasing. If the Government take away the needs basis and put it into deprivation basis, they will benefit some councils and disadvantage others. I repeat: a need is a need. That includes adult social services and children’s social services; it also includes SEND—our Committee produced a report on SEND, which said the system is broken—which is a hugely consuming part of the budget, and is consuming a greater and greater percentage.\nGareth Snell\nWill the hon. Gentleman give way?\nSir Geoffrey Clifton-Brown\nJust a second. Another part of the budget that is consuming more and more is temporary housing accommodation; this, again, needs a fix in some way or another. Structurally, we cannot let these areas of spending go on unreformed, so that they continue to put huge pressure on the finances of all councils.\nI give way to a former member of the Public Accounts Committee.\nGareth Snell\nI thank the hon. Gentleman for giving way—I did enjoy my time on the Public Accounts Committee.\nFor two years, I led a small shire district council. We were often told that there would be money for county councils, because that is where the greatest need was in terms of adult and children’s social care, and various other demand-led services. I do not even think the divide is urban-rural; it can sometimes be between county and district, in the same locality. Is this the hon. Gentleman’s quiet way of telling us that when the Government bring forward the orders for reorganisation, his party will be supporting that, to take out that one element of potential divide in our funding systems?\nSir Geoffrey Clifton-Brown\nI am really pleased that the hon. Gentleman has raised the whole business of devolution, because I am going to come on to that at the end of my speech. What I think we should do is build it from the bottom up, as we did, and let local people have a real say in what they want for the future of the delivery of their local services. I am going to say a little bit more about that and ask the Local Government Minister some quiet questions about it at the end.\nI turn to a matter that is bread and butter for the Public Accounts Committee, which the hon. Member for Vauxhall and Camberwell Green, the Chair of the Housing, Communities and Local Government Committee, also raised, which is the whole business of local auditing. Without proper auditing, there is no guarantee that all the money—I say “all the money”, but I just mean “the money”—that councils get from both council tax and local government grants, in one form or another, is being spent wisely and providing value for money. The shocking position that we find ourselves in with local auditing at the moment is not, I think, helping the whole system.\nThe Public Accounts Committee recently held an evidence session on the whole of Government accounts, as the hon. Lady referred to, where we found that 44% of councils did not submit any data at all to those whole of Government accounts, and that 46% of accounts had not been audited for nearly five years, in some councils’ cases. The Local Government Minister has laid before the House measures to ameliorate the timing of producing local audits. Hopefully, we can get to a situation where we can start those local audits and get a set of figures we can begin to rely on. The next year, once we have started with an established set of figures, we hopefully ought to be able to get a properly audited set of accounts.\nJim McMahon\nWill the hon. Gentleman give way?\nSir Geoffrey Clifton-Brown\nI will in just a second, but I want to make a really important point to the Minister about why all this matters.\nWhy does it matter? If we do not have a set of properly audited accounts, we do not have a sound basis on which to know what we are spending money on. As the Local Government Minister knows only too well, it is not only the audited accounts that are important but the assurance that goes with them, so that council officers, councillors and the public—the council tax payers—can begin to get an idea of whether something is going wrong with their council. I say to him gently that if more councils knew that, we might not run into a situation where they issue section 114 notices. However we cut the cake, when a section 114 notice comes into effect and the Government send in officials to run the council, it always ends up with local people getting a poorer service—they have their services cut—that is more expensive in council tax. It is really bad when a council gets into that situation, and that is why we need proper audited accounts.\nJim McMahon\nI am only intervening given the hon. Gentleman’s position as Chair of the Public Accounts Committee. I think that this is a common interest for the PAC, Parliament and the Government. I do not want to labour the points about the past; the question now is how we move forward. From our perspective, it is not acceptable at all that the whole of Government accounts cannot be reconciled because of local government audit backlogs, so we want to address that. More importantly—this is definitely where there is a common interest—we must rebuild the early warning system, because what we cannot pick up effectively enough is whether there are systemic problems, which are more than just one council beginning to wobble, that we should be aware of and take action on.\nSir Geoffrey Clifton-Brown\nThe Local Government Minister must be clairvoyant—or he must be reading my notes.\nI warmly welcome the Government’s consultation on local audit reform, which would establish a statutory and independent local audit office. It would be responsible for the co-ordination of the system to provide the quality oversight and reporting that is currently missing. There is even talk about setting up some form of backstop public auditing system. A lot of reforms are being consulted on, which is to be warmly welcomed, and the Government are to be congratulated on tackling this subject. I really hope, as Chairman of the Public Accounts Committee, that the Local Government Minister and the Government succeed in that quest, because if we do it, we will begin to make local government much more efficient. We have not talked much about efficiency, but it is common across public services that if we improve efficiency, we make taxpayers’ money go further.\nThe consultation document—this is the core of the matter—states that\n“just one per cent of councils and other local bodies publishing audited accounts on time last year and a backlog of nearly 1,000 outstanding audits dating back to 2015/16”.\nThat demonstrates that real reform is needed, and quickly. We are in total agreement, and we will go on examining the matter and pushing the Government to see how we can do that.\nI will move on and make some remarks of my own on Gloucestershire county council. First, I pay tribute to the chief executive, Pete Bungard, who has run the council for 27 years—as I will say in a minute, it has been pretty well run financially—and to the retiring council leader, Councillor Mark Hawthorne, who has led the council so well. They will both be sorely missed. It is because it has had such constant leadership that I believe Gloucestershire county council is in a strong financial position today. As a Conservative-led council, it is one of the few that is not raising council tax to the full 5%. It is raising it by only 2.99%. That means, based on a band D property, that residents will pay only an additional £6.65 each month. That is a very creditable performance.\nI am pleased that Gloucestershire is on track to invest an additional £32.7 million in local services in critical areas for its residents. That includes £10 million towards road improvements, with a focus on rural roads, as part of a £100 million four-year programme in Gloucestershire. The Public Accounts Committee recently focused on the condition of local roads. Over £1 billion a year is spent on that, but the Department for Transport admitted—this is something we really need to concentrate on—that it did not know exactly how local authorities spent that money, as it is not ringfenced. As with a lot of areas of government, we need better data on how councils are spending money to make sure we get better maintenance of our roads and avoid potholes. I am sure that all Members of Parliament find, whether they are looking through their postbags or knocking on doors, that everyone raises the issue of potholes.\nI am pleased that the county council will be investing £12.8 million in a 200-place special school for Gloucestershire. Sending special needs children out of county is one of the most expensive actions that any council has to undertake, and I think that, in the long term, building our own facility in Gloucestershire will be good value for money. As I have said, the Public Accounts Committee carried out an inquiry into special needs, and we reported that the system was broken. This comes back to my earlier point: just spending more and more money when the structure needs to change is not the answer. It does not matter whether we are talking about special needs, children’s social services, mental health services or adult social services; it is just not the answer. We need longer-term structural reform, and I hope we may see some proposals for that from the Government. As the Committee discovered, in the last 10 years the cost of SEND services has doubled, but we are not getting double the service. That demonstrates that the system is well and truly broken.\nLet me now say something about a point raised by the hon. Member for Stoke-on-Trent Central (Gareth Snell), my former colleague on the PAC. During the exchanges on the statement this afternoon, I said to the Secretary of State and Deputy Prime Minister that people in Gloucestershire would be pleased that they now have certainty that our elections will take place this year, which means that a new county council will be elected. Can the Minister give any indication—I asked his boss this question—of a timetable for when he expects my council to move towards devolution? I am not against devolution at all, but what I will say loud and clear is that I would like adequate time to be provided for a wide consultation to take place in Gloucestershire so that we can have the wholesale backing of its people and know what they really want the structures for the delivery of local government services to be in the future. If they have bought into it, they will be much happier with any change that may take place.\nI should be grateful if we could have that timetable either tonight or in the relatively near future, and if the Minister could explain how a transition might work in Gloucestershire. Will the new council stay in place for four years, albeit perhaps towards the end of those four years shadowing a new unitary authority, so that we do not have elections again within the four-year cycle? That would be very helpful information.\nJim McMahon\nOn the timetable point, all councils in the 21 two-tier areas for reorganisation will receive their statutory elections. Individual councils will need to decide whether to apply for the process or not. If they choose to apply, we would expect their proposals to be submitted to the Government by November. That is quite a short period for them to work up the proposals, but there will be support in terms of capacity along the route. As for how that unlocks devolution a bit further down the line, we are obviously concentrating on the devolution priority programme at the moment and getting the mayors in place, but the door is always open to areas that want to talk about mayoral devolution.\nSir Geoffrey Clifton-Brown\nThe Minister has partly answered the question, but he did say that it was a very short timeframe. I understand that we will receive the letter very soon and that is great, but how long will there be after that for the county council to work up a proposal that might be acceptable to the Government? That is what it will want to know. I request earnestly that we have enough time to consult people as widely as possible, for the reasons that I have just given. [Interruption.] The Minister is indicating that he will write to me; that would be very helpful. Perhaps he will put a copy in the Library so that everyone else can benefit, and also respond to the question about whether the newly elected council will be in place for four years or not.\nThis has been a very constructive debate, as is often the case when there are relatively few Members present. When Members on both sides of the House can get our teeth into a subject like this and come up with constructive proposals on behalf of our constituents, which is what we are here for, we really are achieving something. Thank you, Madam Deputy Speaker, for allowing me to catch your eye.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_climate-and-nature/content_45.html": "The Government recognises the importance of climate action and I welcome that the UK was the first G7 country to legislate to achieve net zero by 2050 and is decarbonising faster than any G20 country.\nMinisters are bolstering domestic renewable energy production through the Energy Security Strategy. This sets out plans to accelerate the deployment of wind, new nuclear, solar and hydrogen, while supporting the production of domestic oil and gas in the nearer term – which could see 95 per cent of electricity being low carbon by 2030. New ambitions include producing up to 50GW of offshore wind by 2030 – more than enough to power every home in the UK.\nThe Government remains firmly committed to its net zero target. However, oil and gas will be required in the transition to net zero, and simply turning off the taps would mean we would have to import oil and gas, leaving us susceptible to global circumstances. The Government is therefore boosting our energy security by committing to hundreds of new oil and gas field licences in the North Sea, making sure we are not reliant on expensive, foreign imports.\nI would like to assure you that I fully recognise the valuable work of our farmers across the country. The Government has committed to maintaining the £2.4 billion annual farming budget in England over this parliament. The Sustainable Farming Incentive pays farmers for actions that support food production and can help improve farm productivity and resilience, while protecting and improving the environment. Actions on offer cover areas include soil health and moorland, as well as new actions on hedgerows, integrated pest management, nutrient management, farmland wildlife, buffer strips, and low input grassland.\nFinally, I am aware that agricultural expansion is the biggest driver of deforestation. It is a huge threat to rainforests, which are vital in absorbing gases and providing a home to thousands of animals and species. The Government is introducing legislation through the Environment Act 2021 which will see businesses that have a global annual turnover of over £50 million and use over 500 tonnes of regulated commodities a year banned from using them if sourced from land used illegally. These businesses will also be required to undertake a due diligence exercise of their supply chains and to report on this exercise annually for transparency.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_animal-testing-beagles-edm-25/content_30.html": "21 May 2024\nAnimal Testing (Beagles) EDM 25\nI welcome that the Animals (Scientific Procedures) Act 1986 (ASPA) provides protections for animals bred in the UK for use in scientific procedures.\nI am aware that all establishments licensed to breed protected animals under ASPA are required to comply with the published Code of Practice, which sets out standards for the appropriate care and accommodation of animals, including dogs.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament/content_12.html": "Sir Geoffrey Clifton-Brown, Chair of the Public Accounts Committee, queries the Government on the £2.5 billion committed to supporting steel and asks for a timeline for publishing the required accounting officer assessment so the Public Accounts Committee can verify compliance with public spending rules.\nDuring a debate on regulations aimed at supporting the transition to zero-emission vehicles, Sir Geoffrey Clifton-Brown highlights vehicle weight as a potential key factor influencing a person's decision to switch from an internal combustion engine to an electric vehicle, particularly for those needing to tow a trailer when their driving licence has a 7 tonnes GVW restriction.\nSir Geoffrey Clifton-Brown intervenes in a debate on the Planning and Infrastructure Bill raising concerns over the exclusion of local communities from the planning process. He also calls for water companies to become statutory consultees to ensure that new housing does not result in extra sewage going into our rivers.\nFollowing the Government response to the Urgent Question on DEFRA’s sudden decision to stop the sustainable farming incentive, Sir Geoffrey Clifton-Brown questions the decision, which was made with no notice and no consultation, and asks the Minister to outline plans for a replacement.\nChair of the Public Accounts Committee, Sir Geoffrey Clifton-Brown, opens the Estimates Day debate on the Department of Health and Social Care's spending plans. He emphasises the need for better coordination within the NHS, greater focus on preventive care and public health, and an urgent overhaul of the adult social care system.\nSir Geoffrey Clifton-Brown speaks in a debate on local government finance highlighting the need for financial efficiency and the need for rural councils to receive fair funding. He also raises concerns about the backlog in local government audits and calls for urgent improvements, and seeks clarity on the timetable for restructuring of two-tier councils.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_sir-geoffrey-clifton-brown-calls-local-voices-planning-and-stronger-protections-rivers/content_43.html": "Sir Geoffrey Clifton-Brown intervenes in a debate on the Planning and Infrastructure Bill raising concerns over the exclusion of local communities from the planning process. He also calls for water companies to become statutory consultees to ensure that new housing does not result in extra sewage going into our rivers.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nI welcome much of what the Bill will do. It will speeding up the planning system, which as a chartered surveyor who has practised in planning is I know desperately needed if we are to get more houses built. However, the one area of the Bill that I have concerns about is what she has just come on to. If local people feel completely overridden by their planning system, they will feel very hard done by. If we are to override local people, we might just as well have a nationally directed planning system rather than a local planning system. Will she think carefully about that balance?\nThe Secretary of State for Housing, Communities and Local Government (Angela Rayner)\nI recognise the hon. Gentleman’s expertise in this area, and he is absolutely right to say that there has to be a balance; that is why the Bill sets out that controversial schemes will still go to full planning committees. I am sure he would recognise that there are other areas where local planners could do some of that work. If we set out the rules clearly, we can make the process better, so that where there is more need for that engagement—with the mandatory training for those on planning committees—we will get a better result. I hope the hon. Member will continue to engage with us in that vein.\nSir Geoffrey Clifton-Brown\nOn the point about not doing any harm to nature, would the hon. Member’s party support the water companies becoming statutory consultees so that we can ensure that, with any new housing, not a litre of extra sewage goes into our rivers?\nGideon Amos (Taunton and Wellington) (LD)\nWe would support that, as we did in a Westminster Hall debate very recently. We should be hearing such voices in the planning system, not shutting them out of the planning system.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_sir-geoffrey-clifton-brown-slams-spring-statement/content_10.html": "Sir Geoffrey writes for the Wilts and Glos Standard.\nI was sitting in the chamber when the Chancellor delivered her greatly disappointing Spring Statement.\nThis is always an important fiscal event as it does affect all my constituents, their jobs, savings and their businesses.\nI am aware times have been tough, but I don’t think that this Government has made things easier for anyone, let alone ‘working people’ who work for and run businesses and contribute to the local economy.\nWithout a thriving wealth creating private sector, we cannot pay for the tax consuming public sector which is now consuming more than our total earnings. The Chancellor is now learning this the hard way at the expense of all of us.\nThe Prime Minister started PMQs by saying that economy has grown ‘further and faster’ since the Labour Party took office. Yet, the figures from the OBR show that we are moving further and faster into debt.\nSince the Autumn Budget, the Chancellor confirmed that the growth prediction has now halved from two per cent to just one per cent.\nEven worse, she confirmed that growth is not due to be more than 1.8% by 2029, which is four years away.\nThe Chancellor also confirmed that our tax burden in 2027/28 is going to be the highest it has been since the second world war, a record of 37.7% of GDP.\nWhen taxes such as National Insurance (NI), the family farm tax, very large increases in the minimum wage all come into effect on 6th April and provisions in the Employment Rights Act estimated to cost £5 billion are literally sucking the life blood out of the business so they cannot grow.\nBusiness is not encouraged to employ under these conditions.\nRather than rethink her policy on these taxes, she has double downed on them. In addition, because of freezing the tax bands, a record 36 million are paying a higher tax rate for the first time.\nI have had many businesses and charities write to me raising concerns about what effects the rise in NI will have on their running costs, including hospices, charities and GP surgeries.\nThe Labour Government voted down our amendment that would have made these organisations exempt, and have not provided any more money for them to cover their costs.\nNot only has this NI rise led to business confidence sinking to the lowest since the pandemic, but it has led to a hiring freeze and an increase in unemployment.\nUnemployment is now the highest it has been since the pandemic at 4.4%, especially for young people, and will keep rising year on year.\nInstead, the Chancellor stood at the despatch box stating that the opposition did not have any better ideas.\nWhen we left office, inflation was down to 2%, interest rates were coming down, and taxes for working people were cut. Jobs particularly amongst young people were at record levels since the war.\nNow, inflation is at 2.8% meaning that interest rates are staying higher for longer. The Bank of England expects inflation to rise further due to increases in energy bills, council bills and water bills which are hitting doorsteps this month.\nThis all means less money in people’s pockets as prices are higher and mortgages cost more.\nWe are yet to hear the spending reviews for each department which are due in June 2025, but from the news that has been dripping out, further savings and cuts will have to be made.\nSo borrowing and taxes are at a record high, unemployment particularly amongst the young is up, inflation up, interest rates remain high, and growth is very weak.\nSadly this means that the chance the economy will go into recession remains a real possibility and the Chancellor will have to pursue a second instalment of tax increases.\nI hope this is not the case.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_public-accounts-committee-progress-implementing-universal-credit/content_23.html": "Sir Geoffrey led in a Public Accounts Committee inquiry into Progress in implementing Universal Credit. The Government is being urged to better support benefit claimants transferring from older ‘legacy’ benefits onto the Universal Credit (UC) system replacing them. In a report published on Friday 26 April, the Public Accounts Committee (PAC) urges the Department for Work & Pensions (DWP) to better help claimants make the switch, while reiterating warnings over fraud and error rates and expressing scepticism on UC’s hoped-for economic benefits.\nThe DWP is in the process of moving 900,000 claimants of legacy benefits to UC. The DWP expects around 4% of claimants of its own legacy benefits would not switch to Universal Credit. DWP said it was not concerned that so far 21% of tax credits claimants had not transferred to Universal Credit when invited to do so, even though it has only limited assurance that people who did not switch over are not missing out on benefits they are entitled to. The report warns that even a small proportion of people not transferring to UC could translate into substantial numbers facing financial hardship. To address this, the DWP should explain how it will ensure it is providing the right level of support to claimants moving to Universal Credit, including face-to-face support and through the “Help to Claim” service – especially for vulnerable claimants – that it funds Citizens Advice to provide.\nThe PAC is not convinced that UC is achieving the scale of expected economic benefits. The Government predicts that UC will generate £10.4bn of benefits a year once fully rolled-out, with £6.1bn coming from increased employment. However, analysis of DWP’s evidence base that UC is benefiting the labour market found that the DWP cherry-picked positive facts and also made other assumptions not supported by empirical evidence.\nUC was intended to generate significant benefits by reducing fraud and error, but changes during and since the pandemic, including in the easing of controls, mean the DWP no longer feels able to assess the impact of UC on fraud and error compared with legacy benefits. The proportion of UC overpaid was 12.8% (£5.5 billion) in 2022-23, down from 14.7% (£5.9 billion) in 2021-22 but still significantly above pre-pandemic levels.\nThe PAC’s inquiry questioned whether, given high levels of fraud and error compared with the past, UC really is less prone to fraud and error compared with the legacy benefit systems. Rather than providing assurance about the actions it is taking, the DWP fell back again on its explanation of a societal increase in the propensity to commit fraud, but the PAC is not convinced why this must inevitably lead to growing losses to the taxpayer. The report encourages future Committees to keep a close eye on the issue and to continue to hold the DWP to account for its progress.\nThe Full Report –\nhttps://committees.parliament.uk/publications/44438/documents/220821/default/\nDetails on the Inquiry –\nhttps://committees.parliament.uk/work/8152/progress-in-implementing-universal-credit\nOral Evidence of the Session –",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_sir-geoffrey-clifton-brown-calls-government-action-tackle-reoffending/content_6.html": "Sir Geoffrey Clifton-Brown highlights the huge cost of reoffending driven by prison overcrowding and early releases, and calls on the Government to outline its plans to reduce reoffending.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nBecause our prisons are running at about 98% capacity, not only are existing prisoners more likely to reoffend but, sadly, as we allow more prisoners to be released early, more people on probation will do so. Apart from the terrible effect on victims, the Ministry itself estimates that this costs a staggering £18 billion a year in England and Wales. What is the Minister’s policy to help reduce reoffending?\nThe Parliamentary Under-Secretary of State for Justice (Sir Nicholas Dakin)\nWe have only just taken over a system that was struggling under the weight of 14 years of mismanagement, and we are doing our very best to get on top of it. We have set in train an independent sentencing review, and are committed to appointing 1,300 new probation officers by this time next year.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_privacy/content_21.html": "This privacy notice relates to the personal data processed by the Office of Sir Geoffrey Clifton-Brown MP in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is Sir Geoffrey Clifton-Brown MP.\nWhat does the office do?\nWe conduct casework and respond to policy queries, for which we must process people's personal data. We also manage a small, non-political mailing list for the purpose of sending Sir Geoffrey’s newsletter and information about upcoming advice surgeries.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent.\nWe are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted Sir Geoffrey about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you such as local authorities, government agencies, public bodies, health trusts, regulators and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe will not share the personal information of members of Sir Geoffrey’s mailing list or those in receipt of our newsletters.\nIn any case, we will not use your data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Unless specifically requested by you, we feel it is reasonable that our office will hold your personal data for the duration of Sir Geoffrey’s time as representative for The Cotswolds Constituency. Following an election, if unsuccessful, all records will be destroyed within one calendar month of the election.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page.\nPlease note that we will ask for identification (passport, driving license, utility bill from the last 3 months) should you choose to exercise any of the above rights in relation to personal data we hold.\nComplaints\nIn the event that you wish to make a complaint about how your personal data is being processed by this office, or how your complaint has been handled, you have the right to lodge a complaint directly with the Information Commissioner’s Office www.ico.org.uk\nSir Geoffrey Clifton-Brown MP\nHouse of Commons\nLONDON\nSW1A 0AA\nTelephone:\n020 7219 5147\nemail:\nCLIFTONBROWNG@parliament.uk",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_assisted-dying-private-members-bill/content_40.html": "Coping with terminal illness is obviously deeply upsetting and difficult both for the patient and their families. Cases such as these are truly moving and evoke the highest degree of compassion and emotion. As the Member of Parliament for The North Cotswolds, I have been contacted by a number of families sharing their experiences on this matter and was very saddened to hear their stories.\nI fully accept that suicide, assisting or encouraging suicide, assisted dying and euthanasia are all subjects on which it is entirely possible for people to hold widely different but deeply held opinions. This is why the substance of the law in this area is not a matter of party politics but of conscience, and any vote would be a free one should the law in this area ever be altered.\nI accept that there are imperfections and problems with the current law. However, a change in the law on assisted dying is one of the most difficult conscience issues that any Member of Parliament must weigh up before casting their vote.\nOn the one hand there are tragic cases of patients suffering and the consequent heartbreak for close relatives; on the other hand there is enormous pressure on the medical profession, to decide when the thresholds, which would have to be included in any change of legislation, are met. This will place great burdens on those making those decisions. Equally, there is the whole issue of either those involved themselves or their relatives, to make decisions which may be premature.\nAll the time I have been a Member of Parliament I have listened very carefully to the arguments on both sides, and I have always come down on the side of the status quo and have voted against legislation on the ‘right to die’. This is because I think it is almost impossible to frame a bill with sufficient safeguards that will protect people with vulnerabilities and one which would make the remit of doctor's actions clear without ending up in court.\nSo, although I have still not decided how I will vote on this issue because I am yet to see the actual wording of the bill, I can assure you that the deeply felt cases of families who have written to me, and the strong views and arguments of varying opinions, which have been highlighted such as yours, will be uppermost in my mind when I make that decision.\nI have to say, whilst I will examine this bill very carefully, and the safeguards it contains, I think it is unlikely that I will support it when it comes before Parliament.\nHowever, allied to this issue is the problem of funding hospices which is currently quite patchy. Everyone deserves the best possible quality of life, right up to the time they die. I will be continuing to pursue this matter in Parliament.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_homepage/content_4.html": "Last week, Sir Geoffrey Clifton-Brown visited Alderman Knight School in Tewkesbury to meet school leaders from across the county to discuss key issues surrounding SEND (Special Educational Needs and Disabilities) provision.\nSir Geoffrey Clifton-Brown, Chair of the Public Accounts Committee, queries the Government on the £2.5 billion committed to supporting steel and asks for a timeline for publishing the required accounting officer assessment so the Public Accounts Committee can verify compliance with public spending rules.\nDuring a debate on regulations aimed at supporting the transition to zero-emission vehicles, Sir Geoffrey Clifton-Brown highlights vehicle weight as a potential key factor influencing a person's decision to switch from an internal combustion engine to an electric vehicle, particularly for those needing to tow a trailer when their driving licence has a 7 tonnes GVW restriction.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_sir-geoffrey-clifton-brown-questions-government-armed-forces-retention/content_31.html": "Sir Geoffrey Clifton-Brown questions the Government on efforts to improve armed forces recruitment and retention.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nIn recent years, for every 100 servicemen recruited, 130 have left. That is completely unsustainable. What is the Minister doing to ensure that we retain more troops, with not only the package within our armed forces, but competitive packages in the private sector?\nThe Minister for the Armed Forces (Luke Pollard)\nThe hon. Gentleman is entirely right about the terrible state of armed forces retention that we inherited. We have seen armed forces morale drop from 60% in 2010 to just 40% last July. We need to invest more in our armed forces, which is why we have introduced the biggest pay rise in 20 years and why we are bringing defence housing back under public control, so that it can be invested in. It is also why we are creating the Armed Forces Commissioner, who will provide an independent champion for service welfare matters for those who serve. We do need to invest more, which is why my ministerial colleagues and I have created an armed forces recruitment and retention board within the MOD to focus efforts on improving service life for all those who serve and their families.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news/content_24.html": "Last week, Sir Geoffrey Clifton-Brown visited Alderman Knight School in Tewkesbury to meet school leaders from across the county to discuss key issues surrounding SEND (Special Educational Needs and Disabilities) provision.\nNews\nSir Geoffrey Clifton-Brown signs letter to Home Secretary opposing 245% shotgun certification fee hike\n30 January 2025\nToday the Shadow Home Secretary Chris Philp MP has joined the Chairman of the All-Party Parliamentary Group on Shooting and Conservation (APPG), Sir Geoffrey Clifton Brown MP in writing to the Home Secretary Yvette Cooper to oppose the proposed 245 per cent increase to shotgun certifications.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_sir-geoffrey-clifton-brown-meets-local-school-leaders-discuss-send-provision/content_11.html": "Last week, I visited Alderman Knight School in Tewkesbury to meet school leaders from across the county to discuss key issues surrounding SEND (Special Educational Needs and Disabilities) provision.\nI was joined by fellow Gloucestershire MPs Alex McIntyre, Cameron Thomas, and Simon Opher. We were kindly hosted by Clare Steel, the school's headteacher, and the meeting was chaired by Roy Blatchford on behalf of the Gloucestershire Education Forum.\nThe discussion and questions covered a wide range of issues, including:\n- The challenges of supporting SEND pupils in mainstream school settings\n- Concerns that the Government’s School and Wellbeing Bill contains very little on SEND\n- Teacher retention and the cumulative pressures on staff\n- Widespread opposition to the proposal of supervised toothbrushing in schools\n- The importance of early intervention in supporting young people\n- Disparities in funding due to different funding formulas across the country\n- The collaboration between mainstream and SEN schools in Gloucestershire\nI was grateful for the open and honest feedback on these points and many others. As Chair of the Public Accounts Committee, I recently oversaw a report on SEND funding and provision, which I found particularly helpful in this discussion. You can read the report here:",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_school-food-0/content_44.html": "All children should be able to access healthy food at school every day. With the help of good nutrition, pupils will be ready to learn and have the chance to achieve their full potential. It will hopefully encourage healthy and stable eating habits for life.\nThe Requirements for School Food Regulations 2014 set out guidance on how schools should provide children with healthy food and drink options to get the necessary energy and nutrition throughout the school day, including that meat or poultry must be offered on three or more days each week, and that milk must be available for drinking every day. Schools must also do all they can to make free water visible and easily available. The Government continues to promote compliance with the School Food Standards and will keep this under review.\nIn 2022, the Levelling Up White Paper outlined plans to strengthen adherence by: trialling coordination with the Foods Standards Agency; providing funding of up to £200,000 for a pilot Governor Training Scheme; and encouraging schools to set out their whole school approach to food in a statement on their website. The Government is encouraging schools to respond to feedback from parents about their school meals provision and to act reasonably to ensure the needs and beliefs of their school community are being met.\nCalls to Remove Requirements for Meat and Dairy Servings -\nI note your concerns over the existing requirements for meat and dairy servings at schools. Although the School Food Standards regulate the food and drink provided at both lunchtime and at other times of the school day, the Government believes that head teachers, school governors and caterers are best placed to make decisions about their school food policies, taking into account local circumstances and the needs of their pupils.\nSchool Fruit and Vegetable Scheme -\nIn the Department for Environment, Food and Rural Affairs’ food strategy, published in June 2022, the Government set out its commitment to conduct a review of the policy and delivery of the School Fruit and Vegetable Scheme (SFVS). The Department is working together with officials from the Department of Health and Social Care (DHSC) on the review. The scope of the programme and sustainability of produce will be factors for consideration.\nSuppliers of fruit and vegetables to the SFVS are required to adhere to all elements of UK law. They are required to supply produce which meets Government fresh fruit and vegetable marketing standards, and the standards set for the Red Tractor food assurance scheme for UK sourced foods, or Globalgap, the international equivalent for fruit and vegetables sourced from outside the UK.\nAn assessment of relevant accreditation programmes such as Fairtrade is undertaken as part of the procurement process to source the fruit, vegetables and related services for the Scheme. The current supply frameworks will run until the end of July 2024, and the merits of using a range of potential accreditations, including Fairtrade, will be considered as part of the next procurement.\nSugar Tax to Fund School Food Projects -\nI welcome that the funds for the National School Breakfast Programme and other successful programmes have come from the Soft Drinks Industry Levy. This demonstrates how these funds have been used, as was intended, to invest in improving children’s health and providing them with healthy food. The soft drinks industry levy has undoubtedly been a success, with the latest statistics showing sugar content of soft drinks dropping by 44 per cent. The sugar content in breakfast cereals, yoghurt and fromage frais has also dropped.\nHalal -\nSchools are expected to act reasonably in their food provision and take into account the religious, cultural and special dietary requirements of their pupils. Schools should also consult with parents when amending their food provision and they should ensure that parents have access to information on the food that is provided. Schools may consider providing halal and non-halal food each day. They should also ensure that dishes are clearly labelled.\nBreakfast Clubs -\nIt is good to see continuing support for schools and children so that they are able to benefit from the national breakfast club programme, which is creating or improving breakfast clubs in up to 2,450 schools located in the most disadvantaged parts of the country.\nUp to £38 million is being invested into the National School Breakfast Programme, using funds from Soft Drinks Industry Levy revenues. I understand that the Government is supporting approximately 280,000 children in some of the most deprived areas of England.\nFood Labelling (including diabetic pupils) -\nThe School Food Standards say that schools should ask suppliers for nutritional information. Schools can make this information available for pupils and parents, and they should also provide information on the allergy ingredients of the food they serve. The Department provides statutory guidance for schools which makes clear that schools should ensure they are aware of any pupils with allergies and have processes in place to ensure these can be well managed.\nI recognise that food labelling is particularly important for pupils who suffer with conditions such as diabetes. If your school has an external caterer, you may want to consider contacting the caterer for a detailed fact sheet about the ingredients and content of the food.\nYou may find documents such as University College Hospitals’ ‘Carbohydrate Counting in Schools’ factsheet useful, it offers information on carbohydrate counting as accurately as possible at school.\nBudget for Free School Meals -\nI welcome the Government’s recognition of the benefits of providing healthy meals to students and providing free meals to those that need them. As I understand it, local authorities are responsible for providing school meals which are funded centrally, rather than through a specific grant. Therefore, it is up to local authorities to determine the amount allocated for each school meal, based on the circumstances in their area. However, the Government is committed to ensuring that all schools have the necessary funds to provide help for those students that require it. The Government spends over £1 billion each year on free school meals, including through the Holiday Activities and Food programme and school breakfast clubs.\nProvision of Free School Milk -\nI very much welcome the provision of free milk for pupils under five years-old, as part of the School Milk Scheme and the Nursery Milk Scheme. I understand that some older children who attend an Ofsted-registered school are also eligible for subsidised milk and yoghurt in some circumstances, including secondary school students.\nI am aware that although soya and rice milk products are not provided under the scheme, alternative milk options including lactose free, or lactose reduced milk should be available for children who are not able to have cow's milk.\nVegan School Meals -\nI understand that the Department for Education believes that headteachers, governors and their caterers are best placed to make decisions about their school food policies, including the provision of vegan meals. As such, the Department is encouraging schools to speak to parents about their school meals provision and act reasonably to ensure it best meets the needs and beliefs of their school community.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_news_cladding-crisis-report-published/content_15.html": "21 March 2025\nCladding Crisis Report Published\nSir Geoffrey Clifton-Brown chairs the Public Accounts Committee which has published a report today on the remediation of dangerous cladding.\nHs said:\n“Through my role as Chair of the Public Accounts Committee, we've published a report today on the remediation of dangerous cladding. We're appalled at the continuing emotional and financial impact of the cladding crisis. Residents need to be at the heart of remediation efforts.\n“We're asking Government what it can do to lower insurance premiums for residents.”\nThe full report can be found here - The Remediation of Dangerous Cladding",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk/content_1.html": "Last week, Sir Geoffrey Clifton-Brown visited Alderman Knight School in Tewkesbury to meet school leaders from across the county to discuss key issues surrounding SEND (Special Educational Needs and Disabilities) provision.\nSir Geoffrey Clifton-Brown, Chair of the Public Accounts Committee, queries the Government on the £2.5 billion committed to supporting steel and asks for a timeline for publishing the required accounting officer assessment so the Public Accounts Committee can verify compliance with public spending rules.\nDuring a debate on regulations aimed at supporting the transition to zero-emission vehicles, Sir Geoffrey Clifton-Brown highlights vehicle weight as a potential key factor influencing a person's decision to switch from an internal combustion engine to an electric vehicle, particularly for those needing to tow a trailer when their driving licence has a 7 tonnes GVW restriction.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_cookies/content_28.html": "We want to make this website as easy to use and helpful as possible. This sometimes involves placing small amounts of information on your computer. These are called 'cookies'.\nThese cookies cannot be used to identify you personally and are only used to improve the service offered to users of this website.\nYou can manage or disable these small files yourself in your web browser, but some features of the website may not function as a result. To learn more about cookies visit AllAboutCookies.org.\nThe cookies we use\nThe open source platform and content management system on which this website is built uses the following cookies:\n|\nDrupal |\nSESS |\nLogs the current session, Expires 21 days from the session date. |\n|\n|\n|\nhas_js |\nLogs whether or not you have javascript enabled. Expires at end of session. |\n|\n|\n|\nDrupal.tableDrag.showWeight |\nThis cookie determines whether a numeric weight is shown when a table is dragged. Expires 1 year from the session date. |\n|\n|\nGoogle Analytics |\n_gat _ga _gid |\nThese cookies are used to collect information about how visitors use this website. We use the information to compile reports and to help us improve the website. The cookies collect information in an anonymous form, including the number of visitors to the website, where visitors have come to the site from and the pages they visited |\n|\n|\nCookie control |\nCookiecontrol |\nThis cookie is set when you accept cookies from this site. Expires 2 months from the session date. |\nThird Party cookies\nSome third-party services used on this website also use cookies. These are not controlled by us, but are controlled by the service provider:\nGoogleMaps",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_parliament_clifton-brown-calls-more-joined-nhs-and-urgent-reform-adult-social-care/content_27.html": "Chair of the Public Accounts Committee, Sir Geoffrey Clifton-Brown, opens the Estimates Day debate on the Department of Health and Social Care's spending plans. He emphasises the need for better coordination within the NHS, greater focus on preventive care and public health, and an urgent overhaul of the adult social care system.\nSir Geoffrey Clifton-Brown (North Cotswolds) (Con)\nThank you, Madam Deputy Speaker, for granting us the opportunity to debate this supplementary estimate, which provides an opportunity for all Members of this House to look at the Public Accounts Committee’s report on health and discuss how the money might be spent on different priorities.\nAs the Chair of the Public Accounts Committee, I am honoured to introduce the first estimates debate on the supplementary estimate of the Department of Health and Social Care. I made this application jointly with the hon. Member for Oxford West and Abingdon (Layla Moran), the Chair of the Health and Social Care Committee, and my right hon. Friend the Member for Salisbury (John Glen).\nAs Members of this House will know, the Public Accounts Committee is one of the oldest Committees of this House. It exists to protect taxpayers’ money and ensure that their pound is being used effectively. It goes back, I think, to about 1867. Unlike other Committees, we do not take evidence from Ministers; instead, we take evidence directly from permanent secretaries and the most senior civil servants and public sector officials. The National Audit Office provides us with audited accounts and value for money reports, and we produce reports of our own with recommendations to Government to which they must formally respond as part of the Treasury minute.\nAt this point, I pay tribute to Amanda Pritchard, who has recently announced that she will be stepping down as chief executive of NHS England this summer. She oversaw the NHS at a time when it was under so much pressure post pandemic, and I wish her well in her future endeavours. I also congratulate Chris Wormald on his promotion to Cabinet Secretary. These vacancies at the head of NHS England and the Cabinet Office provide an opportunity for completely fresh thinking within the NHS.\nLayla Moran (Oxford West and Abingdon) (LD)\nI echo the hon. Gentleman’s thanks to Amanda Pritchard for her time at the head of NHS England. While I also welcome the appointment of Dr Penny Dash as its new chair, the hon. Gentleman is right to say this is a really important moment in the future of the national health service.\nSir Geoffrey Clifton-Brown\nI thank the Chair of the Health and Social Care Committee for her endorsements of the worthy work that all these individuals have put into the health service.\nThe Department of Health and Social Care is one of the highest spending Departments in the UK, with a total departmental expenditure limit standing at a huge £210.1 billion. I am not sure anybody believes that the NHS is working at optimal productivity. NHS England is the largest quango with the highest budget in Whitehall; however, when allocating funds, it is also one of the few Departments that is making life and death decisions that affect the lives of literally millions of patients and their families. I think it does, therefore, deserve the highest level of scrutiny, which is part of what we are doing today.\nBefore even getting on to the figures, the NAO confirmed that the level of productivity in the NHS has dropped by around 23% since the pandemic. I simply say that unless that is sorted, any reform that the Government announce will be sucked into the black hole of the NHS without commensurate value for money or results.\nLeigh Ingham (Stafford) (Lab)\nrose—\nSir Geoffrey Clifton-Brown\nI do not want to give way to too many people; otherwise, you will reprimand me for taking too long, Madam Deputy Speaker. However, I am, of course, happy to give way to the hon. Lady.\nLeigh Ingham\nOn that point specifically, I was at my local hospital—County hospital, in Stafford—a couple of weeks ago, where I noticed that staff were still using paper to make notes on patients. One of the biggest barriers to the NHS being more efficient is the inability to have effective digital systems. Does the hon. Gentleman agree that the investment that has been announced in the move from analogue to digital in the NHS is long overdue?\nSir Geoffrey Clifton-Brown\nI agree entirely with the hon. Lady. She has obviously been reading my speech— I will cover the announcement later in my speech, at which point she will hear exactly what it says.\nAs I say, the NAO has confirmed that productivity levels have dropped by 23%. I welcome the Government’s commitment to a 10-year plan for the NHS. We have also repeatedly warned that, with an ageing and increasingly sick population, the NHS will struggle to cope with the ever-increasing multiple complex demands of our population.\nI wish to split this speech into three sections: how productivity could be improved in the NHS; funding; and, as the hon. Member for Stafford alluded to, technical advancements and a shift into community care.\nThe Department of Health and Social Care’s day-to-day spending—RDEL—is set to increase by £10.9 billion—from £187.9 billion to the main estimate as produced today of £198.5 billion. The capital spending is, however, set to decrease by around £1 billion, from £12.5 billion to £11.5 billion—a decrease of 8%. That is worrying as it shows that more and more funds are being redirected from long-term investment—for example, in the new hospitals to which the previous Government had committed themselves. I welcome the new Treasury guidelines that have stopped the practice of the past few years of redirecting up to £1 billion from capital spending to day-to-day spending. That should help to make more money available.\nThe NHS estate, as we all know from our constituencies, is in desperate need of investment, and our capital investment programme is running behind schedule. The problems with reinforced autoclaved aerated concrete have only added to the necessity of upgrading our hospitals, and I hope the Minister will listen to this plea.\nThe latest NAO report on the DHSC annual report and accounts shows that local systems, such as integrated care boards and NHS providers, reported a year-end overspend of £1.4 billion. This has nearly doubled from £621 million in 2022-23. This was despite an extra £4.5 billion of additional funding during 2023-24, which was to support pay deals for non-medical staff, mitigate any impacts from industrial action and provide money to address the costs of new pay arrangements for doctors and dentists.\nWhat I do not think is acceptable is the glacial pace of agreeing priorities and approving final budgets for the local systems. In November, our Committee was shocked to hear that, in the past two years, those local systems—ICBs and others—had not had their financial plans approved by the Department until June and May respectively. That is up to three months after the start of the financial year. How can our poor local systems plan efficiently when these final allocations and guidance are so late? If the Department’s own accounts were finalised much sooner, our local systems would be able to have the money allocated in a more timely way, making wastage and inefficient spending less likely.\nI welcome the Secretary of State’s prognosis that the NHS is far too big and complicated. There should be a shift towards allowing NHS trusts more control of their own budgets, as clarified in the 2025-26 priorities and operational planning guidance published in January. Moving more funds directly to NHS trusts, ICBs and local systems will improve accountability and give them a level of flexibility about how their funds should be better spent, rather than just focusing on targets and directives. For example, if they were to run a surplus because they had run their operation so well, they could reinvest the money in desperately needed capital projects rather than returning it to Whitehall. That must also go hand in hand with a need to improve productivity. Between 1996 and 2019, the NHS averaged a measly 0.6% a year increase in productivity.\nSince the pandemic, productivity has now fallen by 23%. In March 2024, the Conservative Government announced that the NHS would receive £3.4 billion of capital investment for digital improvements between 2025-26 and 2027-28, which begins to address the point that the hon. Member for Stafford mentioned. As part of that investment, NHS England committed to achieving ambitious average productivity improvements of 2% per year through to 2029-30. However, those digital improvements, presaged by that additional £3.4 billion, have not yet been fully actioned.\nChris Vince (Harlow) (Lab/Co-op)\nI thank the hon. Gentleman for his speech and, importantly, for his scrutiny of the NHS. He reflected on the fact that productivity has worsened since the pandemic. Does he not think that is to do with the mental health of staff?\nTo support our NHS professionals to be as productive as possible, should we not be considering looking after their health, including their mental health?\nSir Geoffrey Clifton-Brown\nThe hon. Gentleman is exactly right. The NHS employs an enormous number of staff—more than 1 million people, I think—and their conditions of work are really important if we are to retain them. That does mean that their mental health needs close attention, especially when they have problems. If the NHS cannot help with mental health issues, who can? The hon. Gentleman has hit on a really important point.\nOne reason that productivity is not improving more is that there are 19% more staff in the NHS, but they are seeing only 14% more patients. At our hearing, NHS officials stated that this was due to more complex and acute health needs, meaning longer stays in hospital. I also understand that it was due to staff sickness, absences and the then ongoing workforce industrial action that affected most patients last year, making targets more difficult to meet. I do not know about other hon. Members, but I am still getting emails from constituents whose appointments and operations were cancelled at the last minute due to that industrial action and who are still waiting for their procedures to be rearranged.\nAlong with staff, technology plays a big role in improving efficiency and productivity. The 2025-26 priorities and operational planning guidance stated that the NHS organisation\n“will need to reduce their cost base by at least 1% and achieve 4% improvement in productivity.”\nI understand that these figures are hard to pin down due to the NHS still negotiating with bodies such as the ONS on the definition of productivity and how it can be measured. I say to the Minister that, even if the numbers are disputed, we have still not seen a plan for how these productivity gains can be achieved, and the Committee believes that NHS England has produced unrealistic estimates. We need to have a realistic estimate from the Department of what productivity gains can be achieved over the next few years.\nWithout significant productivity gains, the NHS will not substantially reform waiting times and achieve the best value for the large amount of money that we spend on it. On average, there is a 4% real terms increase in our spending each year, when the economy is growing by only 1%, which is unsustainable in the long term. If we go back to 2013, the Health Secretary had set the NHS a challenge of going paperless by 2018. Clearly, as we all know, that has not happened, because the NHS is still using fax machines. In a digital age of AI, that lack of modernisation produces a risk to both patients and employees in the NHS. Investing in better technology would help with the Government’s ambition to shift more care into the community.\nCommunity healthcare can take many forms, from GP surgeries and community hospitals to pharmacies, dentists and social care. I fear that when we talk about the NHS budget, we predominantly focus on hospital care, rather than the care that most of our constituents need every day. Indeed, Lord Darzi’s report, which was commissioned by the Government last year, said that\n“the NHS budget is not being spent where it should be—too great a share is being spent in hospitals, too little in the community, and productivity is too low”\nThis is where I would like to pay tribute to our GPs and all their staff across the country, especially in the North Cotswolds. Our GP surgeries are usually the first point of contact with our NHS, from antenatal services to blood tests and vaccinations. They also offer a number of services that could be termed preventive care.\nAs a Committee, we questioned NHS officials on their prioritisation of preventing ill health rather than treating it, thus avoiding much more expensive hospital interventions in the future and a much better patient experience. Their reply was that they had little additional headroom to grow preventive services, yet the public health grant used by local authorities to commission preventive measures, such as health visitors and drug and alcohol services, is expected to fall in value next year by £193 million, despite the Government’s commitment to maintaining it in real terms. I cannot stress enough how I believe that we should be paying much more attention to prevention rather than cure; it is just so important.\nNHS England said that, rather than moving funds, there should be a focus on the role of GPs and how they can advise their patients. However, according to the Royal College of General Practitioners, although more than 90% of patients’ direct experience of the NHS is through primary care and GP practices, less than 10% of the total budget is currently spent on primary care. I say gently to the Minister that we are getting our priorities wrong there.\nAs a Committee, we have recommended that the Government clearly define what counts as health prevention spending within the next six months and track that spending annually. ICBs should be given more flexibility in how they spend their money, which might include redirecting services to more community settings that are closer to patients. It might also include redirecting funds to help manage discharges from hospital. According to the House of Commons Library, the latest data shows that last year an average of 12,340 patients a day remained in hospital despite being clinically fit to be discharged. Even though there is a slight decrease of 1.2% from last year, more can be done to ensure that patients who are well enough can leave hospital for the community and be closer to their families. That will require better working between social care and hospitals.\nAndrew George (St Ives) (LD)\nThe hon. Member is making a powerful case for reform and review. This morning, the Health and Social Care Committee was looking at the very issue of delayed discharge of medically fit patients. Does he not accept that we need more integration? If only a quarter of those delayed discharges are down to a lack of social care packages, that means many patients cannot be discharged because they have a primary healthcare condition that needs to be taken care of, so we need integration and not just social care reform.\nSir Geoffrey Clifton-Brown\nThe hon. Member makes an extremely powerful point. I am coming to the conclusion of my speech, which is on precisely that point.\nThe social care system is not working in this country. It is a political football that keeps being passed from one Government to another. I understand that the Government have committed to another review of adult social care and that we should not expect results until at least 2028; for many of our elderly patients, that will be too late. The funding of social care is rising exponentially. There needs to be more focused and joined-up thinking from the DHSC, NHS England and local authorities on how they can support those who need help to be discharged from hospital in a timely manner and live in their own homes for a longer period than they might otherwise be able to do. It should not be a postcode lottery, as exists now.\nWith more joined-up thinking between different parts of the NHS, the patient experience could be better. However, without substantial increases in productivity, increased spending on preventive care and public health, and a better functioning social care system, our NHS will never be able to operate at the optimal level with world-leading standards.",
  "https_www_cliftonbrown_co_uk_/https_www_cliftonbrown_co_uk_campaign-response_canals-0/content_22.html": "Canals form an important part of the Government’s work in reintroducing biodiversity in nature. In addition to their history and industrial heritage, they also provide the backdrop to the health and well-being routines of many. I understand that around 800 million visits are made to our canals every year, demonstrating their importance in the UK.\nThe Canal & River Trust is responsible for 2,000 miles of waterways and associated historic industrial infrastructure in England and Wales. It maintains the navigability and safety of its waterways including reservoirs and embankments. The Government recognises that the organisation has an important role to play in contributing to the Environmental Improvement Plan.\nTo date, the Canal & River Trust has received £550 million of Government funding. While there is no obligation to fund it beyond 2027, in July 2023 the Government announced that it would offer a new long-term funding package of over £400 million, subject to certain conditions.\nSince first created in 2012 as a private charity independent of the Government, Ministers have been clear that the Canal & River Trust should become progressively more self-sufficient financially. A Memorandum of Understanding between the Department for Environment, Food and Rural Affairs (Defra) and the Canal & River Trust signed in June 2012 included the objective to “reduce dependence on Government Grant and to foster increasing self-sufficiency, by providing access to new charitable income streams and stimulating new efficiencies.” I am aware that the new funding deal for 2027 to 2037 continues that objective, as Ministers support the trust to achieve greater self-sufficiency.\nFinally, Defra has been supporting the charity for some time on how it can increase income from other sources alongside continued Government funding. My ministerial colleagues and I look forward to continued enjoyment of our local waterways.\nElectric Charging Points -\nThe Government is developing policies to respond to climate change across the country and I am aware that navigation authorities are exploring ways to adapt the network, such as the installation of electric charging points in rivers and canals to encourage boaters to switch to electric vessels.\nIncrease in mooring fees -\nBecause of its creation as a private sector charitable company and responsibility for owning and managing its canal and river network, the Canal & River Trust is free from public sector financial constraints and so is able to set its fees and charges accordingly.\nWhile the Government currently provides the Canal & River Trust with an annual grant to support the maintenance and navigability of its waterway network, it is a private sector organisation Ministers do not have a role in the management of the charity or its operational matters."
}