{
  "https_greens4abbey_net_/https_greens4abbey_net_radar/content_3.html": "29 July 2021\nLocal Community Demand Marshall Move their Massive Radar Further Away from Abbey\nMarshall Proposed Consultation (May 2021) https://cambridgeairport.com/radar-consultation)\nGreen Party Response:\nThere will be an official consultation later through the council as this is now being conducted as a planning application. The consultation above is organised by Marshall only.",
  "https_greens4abbey_net_/https_greens4abbey_net_our-vision/content_5.html": "Our Vision:\nOur Green Manifesto sets out our vision for Cambridge in the 2022 local elections.\nGreen policies are about…\n- Facing up to the Climate Emergency with real action\n- Protecting nature and green spaces for everyone\n- Building for the future\n- Revolutionising transport in Cambridge\n- Focusing on community to reduce inequality\nFacing up to the Climate Emergency with real action\nThe City Council declared climate and ecological emergencies in 2019. This is a good start but needs to be backed up by action that recognises the scale of the threat facing us.\nThe UK is looking set to miss its targets for tackling climate change, and climate emissions in Cambridgeshire are even higher than the national average. Our City and County Councils are recklessly pursuing a model of endless growth. To take just one example of why this cannot continue: our region is running out of water. If the city grows as currently planned we will need major new mechanisms for keeping up with water demand.\nThe Green Party advocates Doughnut Economics – an approach that aims to meet the needs of all people within the means of the living planet.\nThe climate emergency is a thread running through all our policies, and many of the actions listed under the other manifesto headings will help to address it. The following policies are specifically about climate change.\nImage: Abbey Councillors Naomi Bennett and Hannah Charlotte Copley alongside Abbey City Councillor Candidate 2022 Matthew Howard and MP Candidate Jeremy Caddick on Wadloes Road\nGreen Councillors will:\n- Consider the climate and ecological emergencies in every decision they make, applying the Doughnut Economics model.\n- Put pressure on major employers and institutions in Cambridge to adopt strict net-zero commitments by 2030 at the latest, considering indirect as well as direct carbon emissions.\n- Work to make Cambridge a UK leader for reductions in carbon emissions.\n- Make Cambridge more resilient to the effects of climate change by investing in flood defences, increased tree cover and buildings designed to function in extremes of weather.\n- Campaign to ensure the County Council divests the £87 million currently invested in the fossil fuel industry from their pension fund, and invests only in industries which are not destructive or exploitative.\nProtecting nature and green spaces for everyone\nCambridge Green Party is the only party that puts the environment at the heart of all our policies.\nHigh quality green spaces in urban areas are a haven for nature as well as offering huge mental and physical health benefits. Here in Cambridge unsustainable development is driving destruction of our natural habitats within the city and across Green Belt land. As well as destroying nature by paving it over, unsustainable developments increase the burden on our already overstretched water supply. As a result, the rare chalk stream ecology of many of the tributaries of the Cam is threatened, and the health of trees across the area is at risk as the water table falls.\nBuilding a successful economy is impossible without a healthy environment. Right now, we are destroying the natural foundations of our economy faster than they can be regenerated.\nImage: Abbey Cllr Hannah Charlotte Copley at Coldham’s Brook\nGreen Councillors will:\n- Expand and improve the local nature reserve network so that people in all wards of the city have nature on their doorstep. As a priority, we will identify and develop wildlife corridors between the city biodiversity hotspots.\n- Work to ensure green spaces are safe, clean and accessible to all.\n- Oppose building on green spaces within the city and, on areas where development is considered, ensure that rewilded areas and nature reserves comprise a high proportion of the land.\n- Oppose development that will increase the ongoing removal of water from the chalk aquifer.\n- Hold Anglian Water to account for their ongoing discharge of raw sewage into the Cam.\n- Support community groups with officer time to protect and improve local chalk streams, for example Coldham’s Brook.\nBuilding for the future\nThe homes and other buildings we are constructing now will stand for many years. We need to think about the future. This means making sure buildings use energy and water as efficiently as possible, and designing them to be habitable in the face of our increasingly chaotic climate.\nTo achieve this we need to adopt much higher standards for efficiency and insist that new buildings comply with them. Many studies have shown that most buildings – even those claiming ‘green’ credentials – perform less well in comfort and energy efficiency than expected. This is due both to poor design and poor workmanship.\nThe Passivhaus standard defines the building process from design through to inspection. The resulting buildings are comfortable to live and work in and require very little energy for heating or cooling.\nImage: a row of houses in Cambridge\nGreen Councillors will:\n- Lobby for policy to require all new Council-funded buildings, including council housing, to be built to Passivhaus standards.\n- Invest in schemes to retrofit existing council housing to improve efficiency standards.\n- Lobby to make Passivhaus-equivalent performance (especially the requirement that space heating should need no more than 15 kWh/m2 pa) a planning approval condition for all new buildings. Developers who claim to achieve this performance without fully adopting Passivhaus should be required to (1) demonstrate that their plans will achieve this, (2) pay for a post-occupancy energy audit.\n- Lobby for the highest water efficiency credentials, including greywater collection, for all new developments\n- Work with local developers and building professionals to ensure that they understand the new standards and how to achieve them, including subsidising professional training where appropriate.\n- Support residents in retrofitting their homes to conserve energy.\nRevolutionising transport in Cambridge\nTransport in Cambridge is not fit for purpose. We need a rapid shift to greener travel.\nAlthough Cambridge has the highest cycling figures in the UK, we have the potential to do even better. Many cycle paths are mixed use, some are badly maintained. Many roads lack room for bikes between parking and traffic. Big projects like the Chisholm Trail are great, but often late and over budget. Increasing the proportion of journeys made by active transport would benefit everyone, including those less able to cycle or walk, by reducing traffic jams and improving air quality.\nCurrent bus services do not serve Cambridge residents well: there are areas, for example in Abbey, where buses are rare and slow. Ticket prices are too high; it is cheaper to take a family to town by car and pay the high car parking fees than to go on the bus. We need public transport that is easy, cheap and reliable.\nWe also need disincentives for people driving all the way into Cambridge from outside. A blanket congestion charge would not be appropriate for Cambridge since, in the absence of good public transport infrastructure, such a policy would disproportionately affect the less well-off. If the Park and Ride and local buses worked seamlessly on low congestion roads, travel without a car would be much easier. The rapid shift to electric vehicles will also help in creating zero-pollution transport.\nImage: Abbey Cllr Naomi Bennett waits at a bus stop\nGreen Councillors will:\n- Work towards introducing an emissions-free zone in the centre of Cambridge.\n- Campaign for major investment into active transport with the goal of creating a fully interconnected, properly segregated cycle network.\n- Work with residents to create low traffic neighbourhoods.\n- Campaign for improvements to the bus system to make it the cheapest and most enjoyable way to travel around Cambridge.\n- Campaign for strict rules against engine idling as long as diesel and petrol vehicles are still used in the city centre.\n- Accelerate and manage the shift to electric vehicles by installing many more free or low-cost charging points, accessible to existing residents and standard in all new builds, and introducing appropriate safety regulations including clear guidelines on which vehicles can use which routes.\nFacing up to the Climate Emergency with real action\nWe want to tackle inequality in Cambridge, including the most deprived areas of the City in Abbey. The economic growth envisaged by our Councils mainly benefits developers and those with money to invest. To be truly sustainable, new developments should be based around local need for housing, employment and infrastructure, not a top-down growth target. The provision of ‘affordable housing’ is woefully inadequate, both in terms of what proportion of housing is allocated as ‘affordable’ and the size of the discount compared to market rates. We need a large increase in council owned and managed secure rented property backed up by community ownership cooperatives, housing associations and co-housing projects.\nThe Covid-19 pandemic has widened pre-existing gaps in our society, with the worst effects being felt by those who are already the least well off. On the other hand, it has also shone a light on the incredible resilience of local groups and organisations to support people in a time of need.\nImage: Abbey City Councillor candidate Matthew Howard and MP candidate Jeremy Caddick speak to a resident on their doorstep\nGreen Councillors will:\n- Fund and support the community hubs and other organisations that have developed during the coronavirus pandemic. Given the right support, these hubs can become points of connection between residents of all backgrounds, and support those who face all forms of disadvantage.\n- Increase investment in youth groups and centres, and outdoor sports infrastructure.\n- Set up Videoconferencing and IT hubs based in libraries and other local community spaces to enable video conferencing and access to the internet for local residents.\n- Involve future residents in the design of any developments (following the example set by Marmalade Lane).\n- Review the rates for Affordable Housing to ensure they are genuinely affordable for lower income households in Cambridge, based on the best available evidence, while lobbying to increase the requirement for proportion of Affordable Homes to 50% on all new developments.\n- Work to increase the quantity and quality of Council housing stock, and strongly oppose the selling off of council and social housing.",
  "https_greens4abbey_net_/https_greens4abbey_net_true-green-project/content_10.html": "What Would a True Green Project Look Like?\nThere is an absolutely huge amount of building going on right now in Abbey and wider Cambridge – from the Marleigh development north of Marshall’s, to Trumpington, to huge plans for 8,000 homes on the current sewage works in Chesterton – barely 250 acres (=32 households / acre) – putting it at nearly double the most dense London boroughs. Tower Hamlets is, for example, on average 20 households / acre.\nWith the prospect of the Marshall’s airport move now all but confirmed, developers are eagerly waiting to squeeze another 12,000 homes onto this ’newly available’ land over the next decade. As featured in previous green view newsletters all this expansion is and will put even higher strain on the already depleted natural environment. For example, the National Environment Agency data released in September showed that the River Cam has only “poor to moderate” environmental status, a shocking fact for this iconic river.\nAlthough developers sing praises that many of these projects are on ‘pre-used’ land – in the case of e.g. the sewage works, previous users are often just displaced onto Green Belt.\nIn the latest consultation the council claimed “responding to the climate emergency runs through every aspect of our plans” – a blatant attempt to pull the wool over our eyes! Excerpts of my response: “any new plan in Cambridge should increase and not decrease the accessible proportion [of green space] to existing residents in the locality… this must include a plan to re-wild at least as much land as being built on again… to truly improve the green credentials of the local economy, rather than pretending building projects are green on their own”\nFundamentally, responding to the climate and ecological emergency has to include a major shift to a new way of living. Many people have watched the latest Attenborough documentary “Extinction – the facts” (BBC) and it comes highly recommended! I found myself deeply moved by the sense that environmental destruction is ‘no one’s fault in particular’ – but happens of collective blindness. Yet, we can have political will against narrow, developer profit: we can start creating those changes on a local level here and now.\nWhat then, would a “True Green” project look like? Is there such a thing?\nI think so – and it involves – primarily re-wilding large swathes of cleared land (not token areas) with new woodlands to absorb carbon, increase biodiversity, and set up communities to reconnect to that land. It’s easy to lose sight of really how much land we live off in a large City. My imaginations of what Greens would do with all that Marshall’s land, which may soon be repurposed after it stops being an airport, are show in the image below. With a vision like this, I aspire to moderate our current council’s ambition to ‘build build build’!",
  "https_greens4abbey_net_/https_greens4abbey_net_greens4abbey_org_uk_news/content_7.html": "Skip to content\ngreens4abbey\nInstagram\nTwitter\nNewsletter Back Catalogue\nSubscribe\nSubscribed\ngreens4abbey\nSign me up\nAlready have a WordPress.com account?\nLog in now.\nPrivacy\ngreens4abbey\nSubscribe\nSubscribed\nSign up\nLog in\nCopy shortlink\nReport this content\nView post in Reader\nManage subscriptions\nCollapse this bar\nLoading Comments...\nWrite a Comment...\nEmail (Required)\nName (Required)\nWebsite",
  "https_greens4abbey_net_/https_greens4abbey_net_get-in-touch/content_12.html": "Contact Us\nFollow us on Facebook and Twitter\nIf you need any assistance please use this form\nYou can also e-mail or call:\nnaomi.bennett@cambridge.gov.uk\n01223 654123 (Councillor Naomi Bennett)\n07340 072443\nContact Us\nFollow us on Facebook and Twitter\nIf you need any assistance please use this form\nYou can also e-mail or call:\nnaomi.bennett@cambridge.gov.uk\n01223 654123 (Councillor Naomi Bennett)\n07340 072443",
  "https_greens4abbey_net_/https_greens4abbey_net_newsletters/content_11.html": "Skip to content\ngreens4abbey\nInstagram\nTwitter\nNewsletter Back Catalogue\nSubscribe\nSubscribed\ngreens4abbey\nSign me up\nAlready have a WordPress.com account?\nLog in now.\nPrivacy\ngreens4abbey\nSubscribe\nSubscribed\nSign up\nLog in\nCopy shortlink\nReport this content\nView post in Reader\nManage subscriptions\nCollapse this bar\nLoading Comments...\nWrite a Comment...\nEmail (Required)\nName (Required)\nWebsite",
  "https_greens4abbey_net_/https_greens4abbey_net_radar-press/content_8.html": "Radar Press Matt Howard, Green Candidate City Councillor, Abbey, Cambridge Radar – In The Press 12 Nov Cambridge Independent 20 Nov The Sun (National) 27 Nov Cambridge Independent 17 Dec Cambridge Independent 25 Jan Cambridge Independent – SUCCESS! If you are affected by the radar contact Matt on 07903 383081 (calls/text/whatsapp) to be added to the local action group or Get in Touch here RAADAR Campaign",
  "https_greens4abbey_net_/https_greens4abbey_net_radar-2/content_9.html": "15 December 2020\nAirport and Council Disregard Existing Residents’ Wellbeing in Favour of New Developments\nResidents near the Marshall’s Airport site are coming together in solidarity to ensure the relocation of a large and overwhelming new radar tower. It is currently just 40 metres from the nearest resident, and The Green Party says it is unacceptable that residents should be subjected to such an imposing installation. Matt Howard, Green candidate Councillor for Abbey has been helping the leading residents build a case against this uninvited guest in the neighbourhood. It was revealed in a letter only previously seen by the council that the Abbey side of the airport was favoured at least in part “to ensure it does not prejudice the plans for the development of the land north of Cherry Hinton” – disappointing from a company that claims to value its neighbours and until recently maintained a positive relationship with many.\nOn Wednesday 4th November and 18th November, lead residents attended a meeting with a team from Marshall’s, including the Managing Director Richard Howe, as well as current councillors to work together for a better solution for all. It transpired that there were several locations for the radar which Marshall’s privately considered during 2019, in combination with planning applications for their proposed tall development, North of Cherry Hinton. That development was approved to progress by Cambridge Fringes Joint Development Control Committee in May.\nThe radar is a hugely overbearing structure which feels very much on top of surrounding houses. Local resident Felipe Franciosi firmly stated when summarising “the only solution we are prepared to accept is for the radar to be moved…to achieve that goal we want to exhaust every possible option we have”.\nThis is understandably a very emotive topic for all local residents – when many have been restricted to spending more time in houses and gardens throughout the pandemic, working from home, with young families, or in retirement. Several streets are now overshadowed by this 38 m (~12 storey) high structure, making the roads feel more like they’re part of the airport than the peaceful streets of before. Resident Mercedes Steiner added to the exchange “to sit in the garden now, and see the radar, and to go out the front door, and still see the radar.. [the] letter was so misleading, saying it ‘might be seen’… It makes me very upset that you’re making me feel very uncomfortable in my own home. It makes me very angry – and that is affecting my mental health – I have a young son which is why we have the garden, and I feel like that’s been taken away from me”. Sharon McCann of The Westering stated the misleading communications received were written “to lead us to believe that this was really an innocuous structure that would be smaller than the existing chimney. There was no suggestion of the scale of this, or any indication of the actual impact it would have on our street”.\nMany other local residents, one of whom has lived on the adjacent street since 1949 having had until recently a positive relationship with Marshall, have also lodged formal complaints. In the initial meetings, the challenge was put by Matt Howard to the Marshall’s team and Councillors that “if there’s been a decision at some point in this planning structure, that’s driven the airport to decide to put it right next to existing houses, in order to fend against not only new houses, but very high new houses, then I think we’ve got a serious problem on our hands.”\nThe key questions are why did Marshall’s make the economic and political judgement that the ethics of intruding on their neighbours’ wellbeing was not as valuable when counted against the technically feasible, even cost-comparable, alternatives somewhere else on their 400 acre+ site? Maybe more importantly, what investigations did the council conduct before giving Marshall’s verbal confirmation that they had “no comment on the proposals”. Instead, a proper engagement with residents could have been held as has happened in previous airport changes.\nRichard Howe has committed to reconsider the location of the radar and will respond in due course.\nResponding on behalf of Cambridge Green Party, Matt states “We will now await to see the reaction of the Marshall’s business. I sincerely hope we are able to come to an amicable solution which improves the situation for all. Sadly, it’s a poor start as since the initial meetings, the radar has continued to be tested with a noticeable low level hum, alongside a refusal from Marshall to stop the commissioning schedule due to continue until April 2021. In the meantime Matt will continue to assist neighbours with this issue, bringing in wider people affected, and investigate other routes of action in case the company decides not to move the radar”.",
  "https_greens4abbey_net_/https_greens4abbey_net_greens4abbey/content_2.html": "Your Abbey Green Team\nCity Councillors Naomi Bennett, Matthew Howard and Elliot Tong (left to right). Let us know if there is anything we can help with, or anything concerning you in your neighbourhood.\nCllrs Hannah Copley, Matthew Howard, Naomi Bennett\nPlease reach out to us if you have something you’d like to discuss in your street, area, the City or even bigger!\nVisit the Cambridge Green Party home page to see what else is going on in the city.\nCommunity Succeeds in Radar Campaign\n[Matt Howard]\nAfter 4 months of campaigning, residents near the Marshall Airport site are celebrating the decision to move a massive and overbearing radar structure away from their homes.\nOn a zoom call on 25 January with Directors of Marshall, other local residents and councillors, Matt Howard Green Party candidate councillor for Abbey who has been a central member of the campaign team said “I think it’s a very sensible and welcome decision that you’ve come to. I think it’s vast majority testament to the work that the residents in our street have been campaigning for, real congratulations to all the residents who have fought for this”\nIssues We’re Raising\nSt Matthew’s Piece Development\n[Hannah Copley] A massive student flats development is proposed to be built on St Matthew’s Piece. Please support local residents by also submitting an objection. It’s clear that the tall eight storey building would cause immeasurable damage to this beautiful and secluded city park which I have lived next to and watched people of all ages enjoy for the last five years. The area of blue sky behind me would be completely blocked out and the park (including the children’s play area) would be overlooked by eighteen windows from the student accommodation. I recommend following Friends of St Matthew’s Piece (FoSMP) page: (https://www.facebook.com/FriendsofStmatthewspiece/)\nOverdevelopment of Abbey\n[Matt Howard] There is an absolutely huge amount of building going on right now in Abbey and wider Cambridge – from the Marleigh development north of Marshall’s, to Trumpington, with more plans coming at densities higher than London averages. With the Marshall’s Airport site now looking likely to be completely relocated out of the City, developers are plotting 12,000 homes on the possible newly available land.\nGreens say this sort of excessive development MUST STOP! So what would a true Green Project look like?\nWhat Marshall’s could be instead – if only the political will\nBarnwell Underpass Flooding\n[Hannah Copley] Not even two days after being drained, the Barnwell Road underpass had flooded again, exactly as the contractors I spoke to previously predicted would happen. People in Abbey urgently need a proper solution to this problem. I’ve written again to the County Council and am hoping the local papers will further publicise this problem to try and get this fixed before the school term starts again.\nDitton Meadow Paths\n[Matt Howard] Inspecting the state of the paths on Ditton Meadows recently, it’s clear the council has neglected the area while the Chisholm trail bridge is put in place. With the project already late, and open space even more valuable during the Pandemic, I have urged the relevant officers responsible to address this as soon as possible. Path lighting will be provided as part of the Chisholm trail – I have proposed this should cover connecting paths for safety, but must be at low level to minimise wider light pollution, be low energy (LED) and not disturb the natural environment.\nParking in Occupation Road\n[Hannah Copley] Shoppers and commuters regularly park on Occupation Road. This has led to pedestrians being forced to walk into the road, wheelchair users and parents with buggies blocked, and entrances to some homes made inaccessible. I join residents in calling for restriction of parking to one side of the road only – the Council must follow through on its commitment to make roads in the City more cycle and pedestrian friendly.",
  "https_greens4abbey_net_/https_greens4abbey_net_radar-3/content_6.html": "25 January 2021\nLocal Community Succeed in Persuading Marshall to Move their Massive Radar\nAfter 4 months of campaigning, residents near the Marshall Airport site are celebrating the decision to move a massive and overbearing radar structure away from their homes.\nOn a zoom call on 25 January with Directors of Marshall, other local residents and councillors, Matt Howard Green Party candidate councillor for Abbey who has been a central member of the campaign team said “I think it’s a very sensible and welcome decision that you’ve come to. I think it’s in vast majority testament to the work that the residents in our street have been campaigning for, real congratulations to all the residents who have fought for this”\nMatt requested confirmation that the distance between the newly proposed site (in amongst commercial property) and the next nearest residential dwelling would instead be “about 150 metres – to Barnes Close, and that it will be nowhere near as imposing for residents there, so that [the problem] is not just displaced to a different location”. This is in comparison to the current location of less than 40 metres to the nearest house.\nMatt adds after the meeting “This is true people power in action – the community spoke and made our feelings known in as many ways as possible.\nThe sense of solidarity started after a spate of burglaries in 2019 and has been solidified through the pandemic with a vibrant whatsapp group and meet-ups either online or in person as pandemic restrictions have allowed.\nUltimately, we now have a great sense of community spirit and togetherness. It’s really fantastic to live alongside people who stand-up for each other. I’m glad Marshall have started on the course to correct the awful initial decision to site this huge structure so close to residential housing; however, I’m sure the community will continue to hold the company to account especially around other ongoing noise issues.”\nMarshall continued to avoid publicly confirming that the primary reason for moving the radar at all was to avoid prejudicing their proposed developments bordering Cherry Hinton, even though such admittal has been seen in what were previously private letters. Questions also still remain around why councillors did not consult, or at least open a discussion, with residents when the move of the radar in light of these developments north of Cherry Hinton were discussed at planning meetings. However, for now, immediate neighbours of the airport can take solace and great hope in their hugely successful collective action.",
  "https_greens4abbey_net_/https_greens4abbey_net/content_1.html": "Working Hard • Greens Protect • Standing up for Abbey\n43% VOTED GREEN IN ABBEY, 2023\nOur Four Pillars for Abbey\nMore Protected Green Space\nThe pandemic has shown us just how important green space is. Abbey’s Green Spaces must be better protected from proposed nearby developments and its biodiversity encouraged.\nBetter Green Transport\nThe current travel network in Abbey, especially buses, is very poorly connected. Congestion on Newmarket Road, potholes, cycle lanes which end suddenly all makes this worse. Abbey needs better, greener transport now.\nLocal Wellbeing not Developer Profit\nThe level of development in Cambridge is currently unsustainable. Projects always prioritise the profits of developers not residents. We should build only genuinely affordable and sustainable houses which meet the needs of local people.\nBuild Community Reduce Inequality\nAbbey is an often forgotten part of the most unequal city in the UK. Through strengthening community ties and sharing resources more fairly across the city, we can improve the lives of Abbey residents.",
  "https_greens4abbey_net_/https_greens4abbey_net_st-matt/content_4.html": "St Matthew’s Piece Development Hannah Charlotte Copley, Green Candidate City Councillor, Abbey, Cambridge Massive Student Flats Development Proposed Over City Park If you are affected by the development Get in Touch here Hannah Copley in front of proposed site on St Matthew’s Piece -There is a significant lack of open public space in this part of Cambridge. This proposal will detract from the little open space this area has, and affect negatively the trees in this area-"
}