{
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_campaigns_green-belt-development/content_8.html": "Green Belt Planning\nSince my election, many residents have contacted me about the destruction of the countryside and green spaces. Most of these developments are on land that was once Green Belt, but has had this protection removed by the council as part of the local plan process in 2012 and 2018.\nNot only has this land been removed from the Green Belt, destroying the countryside and wildlife, but the Council ignored the serious concerns regarding flooding, traffic, wildlife and loss or recreational space– pushing this decision through.\nThe local Labour party like to blame others for these decisions. They like to take the credit for the affordable homes built and the money from the developers that they funnel into projects. Yet they do not like to own their decision to re-designate Green Belt land for development opportunities.\nIf Labour want to be in power locally, they should be willing to be accountable for their actions rather than continually trying to shift blame to central government. Anything positive they take credit for, while anything controversial they place the blame elsewhere.\nMYTH ONE\nThe Labour Council claim that the Conservative Government is forcing them to build on Green Belt This is simply not true. Taking land out of the Green Belt is a local decision – that can only be done by the local authority when forming their Local Plan. National Planning Policy has strong protections for Green Belt land, and states that a Green Belt boundary may be altered only in exceptional circumstances.\nMYTH TWO\nLabour councillors do not support housing developments on the Green Belt in their wards. Local Labour councillors throughout Rother Valley are seemingly always willing to say that they object to building on the Green Belt when challenged by local residents. We have seen this recently in Throapham, Whiston and Dinnington before the election and more recently in Kiveton Park. They are playing lip-service to local residents, while continuing to support Rotherham Council’s Core Strategy (the local plan) – which was first adopted in 2012 and reviewed in 2018.\nWhat this tells me is that Rotherham has a local plan – yet our local community does not believe in it, our Conservative councillors don’t believe in it and our local Labour councillors don’t believe in it. A new approach is needed.\nMYTH THREE\nLabour say the Government’s planning reforms – Planning for the Future – will mean more Green Belt is built on. The planning reforms are being brought in to make the process of new housing more democratic - not to provide local residents with more input in local decisions.\nWe know that when Labour adopted the Core Strategy (local plan) in 2012 and reviewed it in 2018, the council went through the statutory consultation process. But, time and time again, I hear from residents that they had no idea that the land had been removed from the Green Belt, or that their voices were discounted. No one outside of RMBC believe that the consultation was anything other than a cosmetic exercise.\nThe new reforms which are planned would mean more democratic accountability and more say for residents when the Core Strategy is formed/reviewed. Holding the Labour council to account and not allowing them to hide behind the local plan in future when controversial planning decisions are made.\nWe want more homes to be built – the right kind of homes - affordable homes, more homes suitable for an ageing population – but we also want these to be built in the right places – and we want a planning system that is more transparent and more predictable.\nThe decision on what land to allocate for housing is entirely in the hands of the local council.\nIt is a question of do they prioritise developers building estates on former Green Belt – or do they promote building on brownfield sites. I want to see more of the latter.\nMYTH FOUR\nThere are not even brownfield sites to support house building. I strongly believe that our green spaces need to be protected for future generations, not concreted over. Previously developed land – brownfield sites – should be prioritised for development. But brownfield sites remain undeveloped, while private developers want the more lucrative green spaces. I have spoken with Parish Councils and local residents who can all point to brownfield sites that have been left undeveloped.\nFor example, huge estates are being built around Dinnington and Throapham on former Green Belt land, while large brownfield sites such as the old timber yard have been left. We must build new homes, but this must be balanced. We must protect our Green Belt for future generations and listen to the views of local residents, who are too often dismissed as NIMBYs, while the interests of developers are prioritised.\nI will always stand by residents who fight development of our countryside and any loss of recreational space.",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_news_alexander-demands-national-inquiry-rape-gangs/content_3.html": "Alexander Stafford has launched a petition to demand that there is a national statutory inquiry into historical child sexual exploitation, focused on grooming gangs.\nAlexander has taken this action because he strongly believes that the victims of this awful and national scandal deserve justice and deserve the truth above anything else.\nThere was a local inquiry into the Rotherham scandal, which uncovered the horrifying scale of abuse just within Rotherham with over 1500 survivors. After a decade of police investigations identifying and prosecuting perpetrators, serious questions remain unanswered about how the scandal and still to this day not one person in a position of authority has been held to account for their failures.\nLocal inquires do not have the statutory powers needed to compel witnesses to speak. Only a national inquiry can end the collective silence of those who held positions of authority. The survivors of abuse deserve justice.\nSIGN ALEXANDER’S PETITION BELOW",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_campaigns_whitestone-solar-farm/content_2.html": "Tweet Whitestone Solar Farm consultation Whitestone Solar Farm Current Whitestone Solar Farm Your details Leave this field blank What are your thoughts on the proposed Whitestone Solar Farm? Do you believe that you have received enough information on the proposed solar farm and the impact it will have on residents and our green belt? Yes No Other… Enter other… Do you feel confident that the feedback received during consultation will be given due consideration by the Government when they make their decision? Very confident Confident Neutral Somewhat confident Not confident Other… Enter other… Do you feel that our farmland and green belt should be used to build a solar farm? Do you feel that the Government is right to prioritise solar energy over farmland? Yes No Other… Enter other…",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_accessibility/content_7.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_news_category_Westminster-News/content_9.html": "Alexander Stafford MP welcomes £619,679 funding boost for Rotherham local authority to support domestic abuse victims 23rd February 2022 Alexander Stafford MP has welcomed the Conservative Government’s decision to give councils £125 million to provide vital support services for domestic abuse... Westminster News\nAlexander Stafford MP WELCOMES BOOST TO 6000 WORKERS IN Other Valley FROM TEN YEARS OF AUTOMATIC ENROLMENT 11th February 2022 Alexander Stafford MP has welcomed new figures showing that 6000 employees across Rother Valley have been automatically enrolled into a workplace pension with... Westminster News\nAlexander Stafford MP signs Holocaust Educational Trust Book of Commitment 27th January 2022 This week, Alexander Stafford MP signed the Holocaust Educational Trust’s Book of Commitment, in doing so pledging his commitment to Holocaust Memorial Day and... Westminster News\nALEXANDER STAFFORD MP TALKS GETTING TOUGH ON ILLEGAL MIGRANTS WITH HOME SECRETARY PRITI PATEL 14th July 2021 Recently, I met with Priti Patel, the Home Secretary to discuss the New Plan for Immigration. We’re taking action with tougher sentences on dangerous and... Westminster News\nALEXANDER STAFFORD MP BACKS TURN ON THE SUBTITLES CAMPAIGN TO BOOST LITERACY 22nd April 2021 Alexander Stafford, local Rother Valley MP, joins Sandi Toksvig & Stephen Fry in calling on parents to Turn on the Subtitles to improve literacy. COVID has... Westminster News\nAlexander Stafford MP hails record-breaking package of support for UK arts and culture sector 6th July 2020 Alexander Stafford MP hails record-breaking package of support for UK arts and culture sector · £1.57 billion announced by government to protect Britain’s world... Westminster News\nAlexander Stafford MP seeks to protect manufacturing and kick-start the renewables industry in Rother Valley 8th June 2020 At the recent Business, Energy and Industrial Strategy Select Committee meeting, Alexander Stafford MP sought answers from experts to a multitude of important... Westminster News\nAlexander Stafford MP positions Rother Valley as the capital of the UK’s green economic recovery 21st May 2020 This morning Alexander Stafford MP was one of three experts participating in a panel discussion hosted by the Energy & Climate Intelligence Unit, focusing on a... Westminster News\nAlexander Stafford, MP for Rother Valley, questions Prime Minister on new lockdown rules 12th May 2020 Conservative MP for Rother Valley Alexander Stafford yesterday raised the need to ensure any exit strategy from the Government’s Covid-19 lockdown should... Westminster News",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_contact/content_4.html": "Skip to main content\nAlexander Stafford\nfor Rother Valley\nMain navigation\nAbout Alexander\nNews\nCampaigns\nIn Parliament\nContact\nAlexander Stafford\nfor Rother Valley\nContact\nLeave this field blank\n[email protected]\nFollow me on Facebook\nFollow me on Twitter\nFollow me on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_news_chesterfield-canal-alexander-supports-masterplan-restore-canal-through-rother-valley/content_6.html": "Restoring Chesterfield Canal through the southern parts of Rother Valley would bring huge opportunity for recreation, leisure, tourism and business.\nWhen you look at other canal restorations in the UK, it really has the potential to positively transform places like Kiveton Park and Wales.\nYou can read the Masterplan documents at https://chesterfield-canal-partnership.co.uk/.../masterplan/ and there is an excellent summary of the restoration plans and stages at https://chesterfield-canal-partnership.co.uk/restoration/\nAlexander said: \"It was always a big disappointment that during my time as MP that our council didn’t give this the priority that other neighbouring council’s like NE Derbyshire and Bassetlaw did.\n\"As we know the focus of RMBC remains firmly on Rotherham town centre and getting them to shift regeneration focus and strategy to Rother Valley will always be a challenge under the Labour administration.\n\"That said, I truly hope that RMBC can commit to the Chesterfield Canal Partnership and that their work will help bring the Masterplan to fruition. They certainly will have my support in any endeavours.\"",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_cdn-cgi_l_email-protection/content_10.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk_news/content_5.html": "Alexander demands a national inquiry into rape gangs Sunday, 4 May, 2025 Alexander Stafford has launched a petition to demand that there is a national statutory inquiry into historical child sexual exploitation, focused on grooming gangs. Alexander has taken this action because he strongly believes that the victims of this awful and national scandal deserve justice and deserve the truth above anything else. There was a local inquiry into the Rotherham scandal, which... Local NewsOpinions\nAlexander warns about Hellaby housing estate plans 4th May 2025 Last year, Alexander warned of proposals for a major new housing estate in Hellaby with no adequate plan for roads or services—claims which Labour called false... Local News\nAlexander Leads Fight Against Industrial Solar Expansion in Thurcroft, Morthen And Wickersley 4th May 2025 Thurcroft Interchange Energy Park is the latest in a series of industrial-scale energy projects threatening Rother Valley’s greenbelt. Proposed by renewable... Local News\nUPDATE: Water Bill Rip-Off – Ofwat Shrugs, Labour Silent 2nd May 2025 Last month, Alexander Stafford MP and Rotherham Conservative councillors led the fight against an outrageous £46.65 backcharge dumped on thousands of Rother... ArticlesLocal News\nNew Army Cadet Detachment Opens in Maltby – A Historic Milestone for South Yorkshire 30th April 2025 A new chapter in youth development and community engagement has begun in Maltby with the official opening of a brand-new Army Cadet Detachment – the first of... Local News\nDirect train to London plan derailed by Labour Government 26th April 2025 Another Broken Promise for Rother Valley: Government Objects to Direct Train Link to London Alexander Stafford has launched a campaign demanding the Government... Local News\nAlexander supports Todwick Early Years 24th April 2025 For over 20 years, this small, community-run nursery has provided high-quality childcare from a building next to Todwick Primary School. It’s a much-loved part... Local News\nWhitestone solar project update 29th March 2025 Alexander said: \"Many of us have received through the post today the latest update regarding the ginormous Whitestone solar 'farm' project that is going to... Local News\nWater bill rip off 28th March 2025 Following letters to Yorkshire Water about their mistake on last year’s water bill, that they are demanding we all pay for - Alexander joined forces with the... Local News\nChesterfield Canal - Alexander supports Masterplan to restore the canal through Rother Valley 6th March 2025 Restoring Chesterfield Canal through the southern parts of Rother Valley would bring huge opportunity for recreation, leisure, tourism and business. When you... Local News",
  "https_www_alexanderstafford_org_uk_/https_www_alexanderstafford_org_uk/content_1.html": "Alexander demands a national inquiry into rape gangs 4th May 2025 Read full article Follow me on Facebook Alexander warns about Hellaby housing estate plans 4th May 2025 Read full article My Campaigns Campaign for a direct train to London Another Broken Promise for Rother Valley: Government Objects to Direct Train… Petition to demand a national inquiry into child rape gangs Alexander Stafford has launched a petition to demand that there is a national… Whitestone Solar Farm Whitestone Solar Farm consultation Alexander Leads Fight Against Industrial Solar Expansion in Thurcroft, Morthen And Wickersley 4th May 2025 Read full article Follow me on Twitter\nCampaign for a direct train to London Another Broken Promise for Rother Valley: Government Objects to Direct Train…\nPetition to demand a national inquiry into child rape gangs Alexander Stafford has launched a petition to demand that there is a national…\nAlexander Leads Fight Against Industrial Solar Expansion in Thurcroft, Morthen And Wickersley 4th May 2025 Read full article"
}