{
  "https_www_deirdrecostigan_co_uk_/https_www_deirdrecostigan_co_uk_cracking-down-on-fly-tipping/content_3.html": "I want Ealing Southall to be a place where we can walk through our community and feel proud of our clean streets and our environmentally sustainable practices. But a small minority spoil things for the rest of us and continue to leave litter, waste, and rubbish in our community. That’s why as Deputy Leader at Ealing Council, our Borough has become one of the top in the country for taking stern action against fly-tippers and litterers.\nLast year alone we issued 8,000 fines to fly-tippers and litterers alike and pushed up our success rate for prosecuting people for unpaid fines to a monumental 99% success rate. My work with LAGARCan is also a vital step in educating the younger generation about local environmentalism. But there is still plenty more we need to do to tidy up our community. Together, we can all play a part in keeping our streets clean.",
  "https_www_deirdrecostigan_co_uk_/https_www_deirdrecostigan_co_uk_get-involved/content_5.html": "Together, we can create a region that works for everyone. Get involved, make your voice heard and be part of the change, you want to see.\nAccessibility Tools",
  "https_www_deirdrecostigan_co_uk_/https_www_deirdrecostigan_co_uk_transforming-our-streets/content_6.html": "As cabinet member for climate action, I was committed to making Ealing Southall safer, healthier cleaner and more attractive. Through the Live West Ealing initiative, I was able to hear the concerns of residents and work towards implementing their proposals to transform West Ealing into a healthier and more pleasant place to live, shop and socialise. I have worked to fill the streets with more trees, wild flowers and spaces to stop and chat and I have joined with Greener Ealing and LAGER Can to support the vital work they do in cleaning up our area.\nI was delighted to be a part of Ealing’s Big Spring Clean, an investment plan prioritising areas of the borough that do not normally always receive attention as they are inaccessible though still visible to residents. The plan gave power to residents to identity areas in need of a spring clean and I was proud to join with LAGER Can in West Ealing as they supported the community effort to clean up these areas of concern.",
  "https_www_deirdrecostigan_co_uk_/https_www_deirdrecostigan_co_uk_opening-merrick-road-footbridge/content_2.html": "Specially designed to support cyclists and to promote active travel in the area, I was successful in campaigning for the opening of the Merrick Road Footbridge. Working closely with the local community and the Let’s Go Southall initiative, I was able to deliver a safe and quiet route for pedestrians and cyclists, away from the main road, to travel between the north and south of the area.\nTo build a cleaner, greener and safer London, walking and cycling must be safer and easier. Revitalising this important route across the railway in Southall was crucial in encouraging more people to use more sustainable methods of transport and to be more physically active. Active travel is a vital tool in helping improve air quality, lowering emissions, reducing congestion and improving physical health. Along with my colleagues at Ealing Council, I was proud to prioritise the reopening of Merrick Road Footbridge to aid in bringing these benefits to our area.",
  "https_www_deirdrecostigan_co_uk_/https_www_deirdrecostigan_co_uk_launching-southalls-wellbeing-way/content_7.html": "I spearheaded Southall’s Wellbeing Way, an ambitious £1m project linking green spaces in Southall with the Grand Union Canal. In partnership with Ealing Council and the Canal and River Trust, we transformed local canal towpaths and public route access, empowering people to cycle or walk through our beautiful outdoor spaces. By connecting Spike Bridge, the Glade Lane Canalside Park, and Hanwell Lock Flight, we created easier and quicker routes in our community to get to and through nature.\nCycling and walking are also fantastic ways to improve our health and do our bit to reduce carbon emissions and fight the climate crisis. This project gave Southall the investment and support it deserves, and I will always fight to give residents quick and seamless access to nature so that the great outdoors is truly on our doorsteps. I’m proud of our work on Southall’s Wellbeing Way and our mission to empower local communities, champion businesses, and improve the lives of local residents.",
  "https_www_deirdrecostigan_co_uk_/https_www_deirdrecostigan_co_uk_privacy-policy/content_4.html": "Skip to content\nMy Vision\nAbout\nGet Involved\nContact\nMy Vision\nAbout\nGet Involved\nContact\nJoin Labour\nDonate\nPrivacy Policy\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_deirdrecostigan_co_uk_/https_www_deirdrecostigan_co_uk/content_1.html": "From Southall to Greenford, West Ealing to Hanwell, Northfields to Walpole, together we can secure a brighter future for Ealing Southall.\nI came from Ireland in the early 90s to study, to work, and to build a better life, and like so many people I found a welcoming home.\nEaling Southall has the most amazing history of charity and standing up against injustice. From fighting the far right, to supporting the homeless and hungry through Covid, the community here does it all.\nI am a councillor and a trade unionist, I fight bad bosses, and will always do that as your Member of Parliament. I believe in equality, in fairness and in justice, it is what drives me, and why I got into politics.\nAs your MP I will cherish our history in Ealing Southall, what makes us distinctive, and the unity that we represent.\nOnly Labour’s Deirdre Costigan can beat the Conservatives in Ealing Southall. Every donation to my campaign will help our fight for change here in Ealing Southall.\nPromoted by Gareth Shaw on behalf of Deirdre Costigan, both at Ruskin Hall, 16 Church Rd, W3 8PP."
}