{
  "https_grahameardley_uk_/https_grahameardley_uk_gallery/content_5.html": "Promoted by G. Eardley of 9 Railswood Drive Walsall WS3 4BD\nPowered by\nThis website uses cookies.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_grahameardley_uk_/https_grahameardley_uk_contact/content_4.html": "Promoted by G. Eardley of 9 Railswood Drive Walsall WS3 4BD\nPowered by\nThis website uses cookies.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_grahameardley_uk_/https_grahameardley_uk/content_1.html": "Graham Eardley - Reform UK Branch Chairman For Aldridge - Brownhills\nTory & Labour plans for net zero will force us to change our cars & how we heat homes\nNet Zero is Net Stupid\nTory & Labour plans for net zero will force us to change our cars & how we heat homes\nNet Zero is Net Stupid\nReform UK is on the lookout for 3 Local Government candidates in each of the Council wards above for the 2026 elections\nThis train line is causing massive environmental damage and the cost to the Taxpayers keeps on rising\nStop HS2 before it’s too late!\nReform UK are disgusted at the left wing bias which exists at the BBC. An organisation which stripped the over 75 of their free TV license.\nNo other developed country has a TV license .\nIt’s time to end this outdated funding model",
  "https_grahameardley_uk_/https_grahameardley_uk_news/content_2.html": "Graham has been contacted by a number of residents who call for traffic calming measures to be introduced along Walsall Road, Pelsall.\nGraham says \"if elected I will call for the introduction of speed cameras along this stretch of road”.\nGraham is most concerned about the location of Bus stops along the Lichfield Road in Pelsall such as the one near to the junction with Highcroft where there is limited space to board and get off the bus should Graham be elected he will call for a review of Bus stops along the Lichfield Road and will request that consideration is given to a bus stop serving the Moat Farm Estate.\nBus Stop on Lichfield Road near it’s junction with Highcroft, Pelsall\nThe Conservatives have only just managed to increase police numbers in 2023 to a level that they were at in 2011. But bearing in mind the population has increased on a per capita basis we’re still worse off.\nDuring a previous local Government election Graham called for police to prioritise on crimes against the person and property and not online crime. Due to the Conservative governments cut back on police budgets.\nAs a result, he was castigated by two local Conservative councilors Graham says “I am still and will continue to call for crimes against the person and property to be prioritised until this Conservative government fully funds the police service and replaces all of the 20,000 officers that were cut in 2011 but additional officers and staff to make up the shortfall in officers and staff the police service would have had. If it had been given the resources required in the intervening years.",
  "https_grahameardley_uk_/https_grahameardley_uk_resources/content_3.html": "Promoted by G. Eardley of 9 Railswood Drive Walsall WS3 4BD\nPowered by\nThis website uses cookies.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
}