{
  "https_davidfarbey_co_uk/https_davidfarbey_co_uk_contact/content_2.html": "David Farbey\nPlease use the form below to get in touch with me about anything, or email info@davidfarbey.co.uk\nΔ",
  "https_davidfarbey_co_uk/https_davidfarbey_co_uk/content_1.html": "I’m a semi-retired technical writer, an aspiring photographer, and a Green Party Activist. I’m “incorrigibly woke”. I am also living with metastatic prostate cancer.\nWhen it comes to writing about technical products and services for different audiences there’s very little I haven’t done. I have worked in technical communication (also known as technical writing or technical authoring) for about 30 years, and for 10 years I was involved in teaching technical communication to MA students at Sheffield Hallam University. I have presented at professional conferences in the UK, Europe, and the USA, I organised the TCUK conference for 4 years, and I have served on the governing bodies of professional organisations.\nMy professional goal has always been to help companies and teams create better technical content for their customers and staff. I am semi-retired, and currently working part-time as Knowledge Manager for a leading UK-based Microsoft Cloud Partner to help them with all aspects of their technical documentation.\nFor more information on my professional career see my LinkedIn profile.\nI’m an aspiring amateur photographer, so please visit my online photography portfolio.\nI am living with metastatic prostate cancer which means that although I have had surgery, hormone therapy, and radiotherapy some cancer cells keep popping up elsewhere, where they need to be zapped by more radiotherapy and/or more hormone therapy.\nIf you’d like to find out more, or perhaps would like to support some worthwhile charities which have helped me, please see:\nPelvic Radiation Disease Association\nI have been active in the Green Party (the Green Party of England and Wales, known as GPEW) at the local and regional level for nearly 10 years. I was Barnet Green Party’s Parliamentary Candidate for the Chipping Barnet constituency in north London for the July 2024 General Election. I was Regional Treasurer for London from March 2019 to October 2024.\nFor more information on my political activity please see the websites of Barnet Green Party and London Green Party\nPolitical content published and promoted by Joan Waterson on behalf of David Farbey (Barnet Green Party), both at PO Box 78066, London SE16 9GQ"
}