{
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_ian-baldwin/content_95.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nIan Baldwin\nTweet\nCandidate for Mincinglake ward ECC\nCity Council Candidates\n.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_safe-hands/content_13.html": "The Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_tessa-tucker-selected-parliamentary-candidate-exeter/content_42.html": "Tessa Tucker has been selected as the Conservative Party candidate for Exeter with a promise to support local businesses, tackle transport chaos and campaign for more affordable housing for local people.\nTessa, 40, is married with three children. She is a Communications Consultant in the electric vehicle industry, having previously worked for defence company Babcock. She grew up in Weston-super-Mare and has lived and worked in and around Exeter for nearly 20 years.\nShe is campaigning to ‘Get Exeter Moving’ and end the near gridlock caused by the Labour-run Highways and Traffic Orders Committee (HATOC). Tessa is calling for the removal of all Low Traffic Neighbourhoods (LTNs) until the community can be properly consulted. She has also raised concerns that the introduction of LTNs without proper community consent may be a step toward the imposition of policies like London’s deeply unpopular ULEZ in Exeter.\nFollowing her selection, Tessa said: “I am thrilled and hugely honoured to be selected as the Conservative Parliamentary Candidate for Exeter. I want to represent this great city because I am passionate about Exeter and will be a strong advocate for everyone who lives here.\n“I refuse to stand by, and watch Labour take Exeter for granted any longer. The Labour-run city council is millions in debt, anti-social behaviour is rife, and people can’t move around without getting stuck in a traffic jam.\n“Labour have also shown how little they care about local issues and local people by selecting a Parliamentary Candidate who is a Councillor in Hackney, London. In Hackney, the Labour administration introduced 17 LTNs across the area causing congestion and more pollution.\n“I am worried about what it would mean for Exeter and our local economy if he were to bring Mayor of London Sadiq Khan’s ULEZ to our city, making it more expensive and even harder for people who live and work here to get around. The answer to tackling pollution and congestion in Exeter is better public transport, not further measures that punish residents.\n“A thriving Exeter means a brighter future and more opportunities for everyone. I know what it is like to run a business in this city and am focused on growing our local economy by attracting new businesses, supporting existing enterprises and creating jobs.”",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_recycling-matters-labour-are-failing-exeter/content_72.html": "RECYCLING MATTERS – LABOUR ARE FAILING EXETER\n“It is more than frustration, it is anger that Exeter remains at the bottom of Devon’s recycling league table,” says Cllr Anne Jobson responding to the Editorial in the Express and Echo (29th July 2021), “\n“Whilst other Local Authorities in Devon have increased their recycling rates - Exeter’s have got worse. The blame for this lies squarely with the Labour ruling administration. Labour have done nothing and will do as little as possible until forced to improve recycling as a result of the Conservative Government’s Environment Bill..”\nCONSERVATIVE GROUP Exeter City Council\n“Cllr Bialyk is wrong to blame delays to the Environment Bill for Exeter’s lack of a plan and timetable. Other local Authorities have got on with it – Exeter has not. Put simply - the Labour Ruling Group on Exeter City Council are failing the people of Exeter. Exeter residents have made it clear time and time again that they want to recycle - the Council should be helping them to do so.”\n“Cllr Harvey is already planning his excuses when he is reported as saying that larger authorities will be further up the line when it comes to receiving new refuse collection vehicles.”\n“If Exeter had got on with it when they made their promise in 2019 then those vehicles could be in place and helping Exeter deliver on its recycling.”\n“In 1995 Exeter was the highest performing Devon Authority with 8.2% and achieved its highest collection rate in 2010 with 36.9%. Since then whilst other authorities have introduced food-waste and rolled out new services Exeter has been left lagging behind and getting worse year on year. Between 2015 and 2020 no other Devon Local Authority has fallen below 40% whilst Exeter has fallen below 30%.”\nCllr Anne Jobson OBE\nThe figures\nThese are taken from the annual reports of the Devon Authorities Strategic Waste Committee – generally published in the October of Each Year – Devon County Council.\nIn 2015/16 Devon recycled 55.1% of its waste.\nIn 2016/17 Devon recycled 55.7% of its waste.\nIn 2017/18 that dropped to 54%, rising to 56% in 2018/19\nIn 2019/20 Devon recycled 56.6% of its waste.\nFor the same period\nExeter recycled 33.4% in 2015/16;\nExeter recycled 31.6% in 2016/17\nExeter’s recycling rate had dropped to 30.8 in 2017/18\nExeter recycling rate dropped again to 27.1% in 2018/19\nExeter recycling rate dropped yet again to 26.1% in 2019/20.\nThe highest rated authorities in Devon during this period had recycling rates in excess of 50% with our closest neighbour, East Devon, achieving 60.5% in 2019/20.\nNo other Council in Devon had a rate below 40% during the same period.\nAs far back as 2018/19 a 53% increase was achieved in Devon for kerbside food waste collection and all other Local Authorities in Devon save for Exeter had a food waste collection.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_get-postal-vote/content_18.html": "If you will be away on polling day, at work or on holiday, are physically unable or just don't have the time to get to a polling station to vote in person, you can still exercise your democratic right to vote. You may have moved house since the electoral register was drawn up and have not yet joined the register at your new address.\nYou can choose either to vote by post or to appoint someone else - a proxy - to vote on your behalf.\nYou can register for a Postal Vote here: http://postalvote.conservatives.com/\nFrom this site, you can download an application form to vote by post.\nSimply print the form out, complete the details and send it to the Electoral Registration Officer at Exeter City Council.\nExeter City Council\nCivic Centre, Paris Street, Exeter, EX1 1JN\nTel: 01392 265141\nCouncil website: www.exeter.gov.uk",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_membership/content_16.html": "With a packed events schedule, the Conservative Policy Forum, news from government, the opportunity of becoming a councillor and get involved with your community, and all for just £39 a year, Exeter Conservatives have something to offer everyone.\nJoining us means that you are a member of the most open and democratic political party in Britain. After the first three months of your membership, you will be entitled to a vote in Party ballots. You will also have a chance to influence Party policy by letting us know your views.\nAny person living in the United Kingdom is eligible to join the Conservative Party. Applicants are not required to be registered voters or UK nationals. There is no upper or lower age limit on membership, although those under the age of 15 cannot be enrolled as full voting members.\nUnder 25? You can join at a discount and still have full voting rights so Join Now.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_events_feed/content_88.html": null,
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_conservative-policy-forum/content_61.html": "The Exeter Conservative Policy Forum meets regularly to discuss and debate different policy topics as set out by Conservative Campaign Headquarters (CCHQ). The results of these discussion are then fed back to CCHQ.\nTopics discussed in the past have included:\nForeign Affairs\nHousing & Planning\nPersonal Liberty\nLocal Government\nEmployment\nPolicing\nArts Culture & the Government\nIf you are interested in attending any of these discussions or would be interested in setting up your own local Policy Forum please contact Ruth Smith. Email: [email protected]",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_lucille-baker-0/content_38.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nLucille Baker\nTweet\nCandidate for Alphington & Cowick division DCC\nCounty Council Candidates\n.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_about-rss/content_45.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_boris-johnson-new-leader-conservative-party/content_39.html": "@BorisJohnson is the new leader of the Conservative Party. We will get Brexit done by 31st October. This will mean we can give our schools, hospitals and police the attention they deserve.#BackBoris by joining us today! Conservatives.com/join\n@BorisJohnson is the new leader of the Conservative Party. We will get Brexit done by 31st October. This will mean we can give our schools, hospitals and police the attention they deserve.#BackBoris by joining us today! Conservatives.com/join",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_our-survey/content_62.html": "Got an opinion on how Exeter is being run?\nWhy not let us know your views by filling in our online survey?\nWe are here to serve you, so your views matter.\nGot an opinion on how Exeter is being run?\nWhy not let us know your views by filling in our online survey?\nWe are here to serve you, so your views matter.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_join/content_67.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_alison-hernandez/content_33.html": "Alison Hernandez is the Police and Crime Commissioner for Devon and Cornwall, a role she has held since May 2016.\nTelephone: 01392 225555\nWrite to:\nThe Office of the Police and Crime Commissioner for Devon, Cornwall and the Isles of Scilly\nAlderson Drive\nExeter\nEX2 7RP\nEmail: [email protected]\nTwitter: @AlisonHernandez",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_oscar-brown/content_89.html": "Exeter is a wonderful place to live. I have made this city my home for the last five years. I have noticed, as I am sure you have, that Exeter, is being neglected - dirty and pot-holed streets, a spiraling budget, vanity projects, and a total disregard for local democracy.\nWith your help we will achieve change and turn Exeter around so we can make our city better and step forward into a sustainable future together.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_Join/content_81.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_devon-conservative-group-call-government-properly-fund-devon-schools/content_98.html": "The Devon Conservative Group, worried about the financial situation of the schools in the county, has resolved to send a public petition to the Government, hoping that a generous backing from the people will help the message to get across. Here is the message contained in the petition on the popular social engagement website change.org :\n\"Each pupil in Devon received £290 less than the national average. Conservatives in Devon believe this is not right. The current/recent Government consultation is flawed and does not improve the situation. We therefore call on Government to increase the funding for the young people of Devon. We would ask you to support our petition for increased funding for the young people of Devon.\"\nIf you care about Devon schools as much as we do, please sign now the petition here:\nhttps://www.change.org/p/john-hart-the-devon-conservative-group-call-on…",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_conservative-party-conference-rolling-briefing/content_83.html": "Here's what's happening at the Conference right now.\nHave a look at the attached pdf and don't forget to let us know what you think of any specific subject.\nHere's what's happening at the Conference right now.\nHave a look at the attached pdf and don't forget to let us know what you think of any specific subject.\n| Attachment | Size |\n|---|---|\n| 2016.10.04 Conference 2016 Brief 12.30.pdf (1.7 MB) | 1.7 MB |\n| 2016.10.04 Conference 2016 Brief 17.30.pdf (1.74 MB) | 1.74 MB |",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_kayleigh-luscombe/content_82.html": "County Council Candidate for Exwick and St Thomas\nKayleigh lives and works west of the river, very much a local, your concerns are her concerns.\nShe is a strong local campaigner, in 2019 persuading BT to take down unsightly broadband poles in Exwick.\nKayleigh will fight to ensure you get better public services; toilets re-opened, solutions to dog fouling, parks and playgrounds better maintained. She says: “As an independently minded Conservative, I pledge to listen to residents and get the changes which Exwick needs”.\nShe also wants to see unused council land ‘rewilded’, bus shelters installed to protect public transport users and will push for the introduction of long-promised kerbside glass recycling.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_kemi-launches-our-2025-local-elections-campaign/content_68.html": "Tweet Wednesday, 26 March, 2025 National News At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_accessibility/content_23.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk/content_15.html": "Our Contact Details\nSearch our Site\nNational News\nLocal Conservative News\nExeter\nCampaigns\nJoin us on Facebook\nJoin as a member\nBy joining the Conservative Party, you're doing your bit to help change Britain.\nYour support is vital to our campaign to build a better future.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_heavitree-and-whipton-ltn-survey/content_27.html": "Speech to the Exeter Highways and Traffic Orders Committee\nBy Cllr Anne Jobson OBE on 30th September 2023\nThis is an update on responses to our survey questionnaire delivered to about 6,000 business and households in areas in or bordering the scheme – with an on-line option.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news/content_6.html": "Our candidates for City and County Council elections on 1 May 2025 want to hear your views Sunday, 20 April, 2025 By completing our simple online survey you can let your local candidates know your views about your area. Local News\nConservative Manifesto for Exeter City 2024 14th April 2024 Exeter Conservative's are pleased to share their vision for Exeter ahead of the May 2024 City elections. Local News\nResults of Heavitree traffic survey presented to Exeter Highways Committee 31st October 2023 Speech to the Exeter Highways and Traffic Orders Committee By Cllr Anne Jobson OBE on 30th September 2023 This is an update on responses to our survey... Local News\nTessa Tucker Selected as Parliamentary Candidate for Exeter 17th September 2023 Tessa Tucker has been selected as the Conservative Party candidate for Exeter with a promise to support local businesses, tackle transport chaos and campaign... Local NewsMedia\nTree Planting Ceremony - Lethbridge Almshouses 20th July 2022 Councillor Peter Holland joined the Lord Mayor Yolonda Henson at a tree planting ceremony to celebrate Her Majesty Queen Elizabeth's Platinum Jubilee Year and... ArticlesLocal News\nExeter Conservatives Launch 2022 Local Elections Manifesto 8th April 2022 Exeter Conservatives this week launched their local election manifesto. Launching the manifesto, outside of the Customs House, on the Quay, Group Leader Cllr... Local News\nRecycling Matters - Labour are failing Exeter. 2nd August 2021 RECYCLING MATTERS – LABOUR ARE FAILING EXETER “It is more than frustration, it is anger that Exeter remains at the bottom of Devon’s recycling league table,”... Local News\nOur 6 Point Plan for Exeter City Council 2nd May 2021 We intend to ‘Build Back Better’ and our vision is to create a City that people believe in now and in the future – by offering a vibrant Economy, re-vitalized... ArticlesLocal NewsReports\nThe Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns/content_76.html": "Petition: Common sense immigration rules Our country is not a hotel, it is our home. This is our plan for immigration. We think: Newcomers should wait 10 years, instead of 5, before they can apply to...\nStop Labour's tax on bus travel Stop Labour's 50% bus fare hike. Labour's plans to raise bus fares from £2 to £3 mean hard-working people commuting every day will pay £520 a year more. Sign...\nSave our local pubs Labour's War on Pubs Will Close Your Local Labour's pub tax hike will force landlords to raise prices or shut their doors for good. £1,000s extra in business...\nStop the grooming gangs It's time to get justice for victims. The only way to expose those who turned a blind eye to the grooming gangs is by holding a full inquiry, so sign our...\nStop the Family Farm Tax Labour have broken their promise to British farmers with the Family Farm Tax. Labour's Family Farm Tax will stop farms being passed to the next generation...\nHeavitree and Whipton LTN Survey Please share your views concerning the Heavitree Low Traffic Neighbourhood.\nLeave your mark, become a Councillor! Exeter Conservatives are looking for new people to get involved and become a Councillor for Exeter City Council. Contact the Exeter Conservative Office if you...\nThe Devon Conservative Group call on Government to properly fund Devon schools The Devon Conservative Group, worried about the financial situation of the schools in the county, has resolved to send a public petition to the Government...",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_cpc16-rolling-brief/content_96.html": "Attachments\n| Attachment | Size |\n|---|---|\n| 2016.10.02 Conference 2016 Brief 09.00.pdf (995.51 KB) | 995.51 KB |\n| 2016.10.02 Conference 2016 Brief 17.30.pdf (1.15 MB) | 1.15 MB |\n| Attachment | Size |\n|---|---|\n| 2016.10.02 Conference 2016 Brief 09.00.pdf (995.51 KB) | 995.51 KB |\n| 2016.10.02 Conference 2016 Brief 17.30.pdf (1.15 MB) | 1.15 MB |",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_statement-regarding-traveller-encampment-digby-station-car-park/content_12.html": "We started to receive reports about an illegal encampment being established on part of the Digby Station Car Park. Many residents will remember the problems caused back in 2017 when a similar encampment used the park and ride site.\nThe initial 3 vans were reported to the police; ECC and DCC. More have now joined them and it is not clear as to whether further vehicles will gain access onto the site.\nThe difference this time is that we are in lockdown and there are government guidelines issued in an effort to protect public health. However, it is difficult to see how a site without sanitation, water or waste disposal can be seen as a place where public health can be protected and porta-loos and access to fire-hydrant points is only likely to encourage further people onto the site which will mean no prospect of those encamped from being able to maintain social distancing and put them and all local residents and rail users at greater risk of transmission\nThis is a difficult situation. This illegal encampment should not have moved onto this site during the current lockdown. Travelling is prohibited unless for essential work that cannot be done from home. Should they therefore be escorted safely back to their previous site? That question is being asked.\nIt is believed that the land belongs to DCC. At present illegal encampments on public land cannot be evicted by law as should ordinarily happen.\nAs your local Councillors we are acutely aware that many local residents and users of the station, dog walkers and others are suffering as a result of this intrusion. We have heard reports of problems with station access for those with mobility scooters, people who feel intimidated and noise nuisance after 11pm at night.\nAny intimidation, noise and obstruction should not be tolerated. At the end of this post are numbers and emails for the Police.\nIf DCC are prohibited from evicting those unlawfully occupying this site because of Covid Guidance then we would urge them to adopt the same stringent rules and regulations as Kent Council brought into play in similar circumstances last year. These are:\nNot going to the toilet in the open,\nNot burning rubbish\nNot driving on footpaths.\nProceeding should be brought to remove the travellers from this unsuitable site even though an eviction notice cannot be enforced until restrictions are lifted. If the Courts decline to hear the application until restrictions are lifted then, at least, the paperwork will have been prepared and it should be possible to clear the site quickly.\nIn addition, we are asking the police to take every possible step to stop any vehicles heading in the direction of this site and check that they have a lawful reason to be on the move and to turn them back. There is no difference between this and stopping tourists from visiting Dartmoor – neither should be happening during lockdown.\nWe will continue working with all agencies to do our best to ensure that disruption is kept to a minimum.\nIn the meantime,if you are the victim of a crime these are the steps you can take:\n- If it’s an emergency and the crime is still taking place, call 999 and ask for the police.\n- If it’s not an emergency, do not call 999. ...\n- You can contact Crimestoppers on 0800 555 111 if you want to remain anonymous.\n- By email to [email protected]\nFrom;\nYour Exeter City Council Team\nCllr. Yolonda Henson\nCllr David Henson\nCllr Peter Holland\nAnne Jobson Conservative Candidate for St.Loyes Ward 2021",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_map-locations/content_75.html": "In your area\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_tree-planting-ceremony-lethbridge-almshouses/content_63.html": "Councillor Peter Holland joined the Lord Mayor Yolonda Henson at a tree planting ceremony to celebrate Her Majesty Queen Elizabeth's Platinum Jubilee Year and to commemorate 25+ years' service as a Trustee of Exeter Church Charities by Alderman John Landers-93 years young!\nPicture showing LM Yolonda Henson, Stella & John Landers",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_privacy/content_56.html": "This document outlines how Exeter Conservatives processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Exeter Conservatives\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Exeter Conservatives.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Exeter Conservatives, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Exeter Conservatives via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_type_County-Council-Candidates/content_24.html": "Anne Jobson Exeter City Council - Councillor for St Loyes Ward Exeter City Council - Conservative Group Leader Devon County Council - Candidate County Council CandidatesCity Councillors",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_category_Westminster-News/content_25.html": "Boris Johnson is the new leader of the Conservative Party 24th July 2019 @BorisJohnson is the new leader of the Conservative Party. We will get Brexit done by 31st October. This will mean we can give our schools, hospitals and police... Westminster News",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_our-candidates-city-and-county-council-elections-1-may-2025-want-hear-your-views/content_59.html": "Tweet Sunday, 20 April, 2025 Local News By completing our simple online survey you can let your local candidates know your views about your area. You may also be interested in Exeter Community Survey We would love to hear your views.\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_type_City-Council-Candidates/content_71.html": "Keith Sparkes Exeter City Council - Former Topsham Councillor Candidate for the Topsham Ward, ECC City Council Candidates\nRob Newby Exeter City Council - former Councillor for Topsham County Council Candidate City Council Candidates",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_ruth-smith/content_64.html": "Ruth Smith is a former President of Exeter Conservative Association. With many years of experience in local city council politics as a former city Councillor, she is an expert on issues surrounding Pinhoe and Exeter as a whole.\nRuth Smith is a former President of Exeter Conservative Association. With many years of experience in local city council politics as a former city Councillor, she is an expert on issues surrounding Pinhoe and Exeter as a whole.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_kemi-gives-speech-alliance-responsible-citizenship-conference/content_35.html": "Tweet Tuesday, 18 February, 2025 National News On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_type_Council-candidates/content_50.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nCouncil candidates\nKatherine New\nCouncil candidates\nCynthia Thompson\nFormer Lord Mayor of Exeter\nCouncil candidates",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_leave-your-mark-become-councillor/content_79.html": "Exeter Conservatives are looking for new people to get involved and become a Councillor for Exeter City Council.\nContact the Exeter Conservative Office if you are interested in becoming a Councillor, at [email protected]\nClick here for more information about what's involved.\nDo forward this to friends and colleagues who may also be interested.\nAre you a Conservative who wants to improve your local area?\nAre there things about your community you would like to change? Do you believe local people should decide what is best for them? Would you stand up for your neighbours if they needed your help?\nIf so, you are the ideal person to become a Conservative councillor\nNew councillors are good news. They mean fresh ideas and fresh enthusiasm, and that will be good for your council and your local area. By becoming a councillor, you really can make a difference to your local community. Being a councillor gives you the opportunity to help your local community and be part of a dedicated team providing key services for your area. Serving councillors are a broad mix of people from the local community.\nDo I know enough to stand for election?\nDon’t underestimate your own abilities. Each councillor will have something different to offer the council and you will not be expected to take direct responsibility for running the council on the first day that you are elected! Your main qualifications are a genuine concern for the community and a willingness to learn. Knowledge and experience will soon follow.\nHave I the time to be a councillor?\nYou won’t have to give up your job or surrender your social life, and you will receive all the support you need to be a fantastic local councillor. Many councillors have work and family commitments as well as other interests which they successfully balance with their role as a councillor.\nMake a difference to your local community\nConservative councillors are already working hard across the area, helping their neighbours and improving their communities. We think that’s worth standing for. If you agree, click here to get in touch, we’d like to hear from you.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_feed/content_85.html": null,
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_kemis-speech-foreign-policy/content_49.html": "The Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_our-plan-devon/content_40.html": "The Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_sylvanias-childrens-park-100-hours-hard-work/content_36.html": "Earlier in the summer a working party of 25 volunteers set to work 'uplifting' the Children's Play Area at Sylvania Drive. For four hours the group worked tirelessly to wash equipment, rub down, prepare and paint the railings around the playground. As a result, Sylvania Drive Childrens Park has a new lease of life, and is back to serving the community proudly.\nThe volunteer group was made up of children, parents and community leaders from the Ward. The backbone of the work was done by the Police Cadets who were great ambassadors for the cadet scheme. Nearby residents provided refreshments throughout the day and kept everyone well nourished! Exeter Parks Watch Champion, Sue Lawrence, thanked everyone for their endeavours and we look forward to the Park being used and appreciated by the families in the area.\nPeter Holland , Councillor for Pennsylvania, said; 'I was pleased to have been able to assist the working party both by providing a modest amount of funding for the project and to roll my sleeves up on the day! Our Parks are critical to promoting healthy lifestyles for all of our children and it was great that so many volunteers were able to be part of the refurbishment’.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_category_Reports/content_57.html": "Our 6 Point Plan for Exeter City Council 2nd May 2021 We intend to ‘Build Back Better’ and our vision is to create a City that people believe in now and in the future – by offering a vibrant Economy, re-vitalized... ArticlesLocal NewsReports\nCPC16 - A great finale with PM's speech 5th October 2016 Lots of really great news from last day of the Conservative Party Conference in Birmingham. Here you can find the highlights from the PM's speech: Special Brief... Reports\nConservative Party Conference - Rolling Briefing 4th October 2016 Here's what's happening at the Conference right now. Have a look at the attached pdf and don't forget to let us know what you think of any specific subject. Reports\nCPC16 - Today's Brief 3rd October 2016 Contents Conservative Party Conference Key Messages and Narrative Housing package Brexit – Article Fifty and ECA Repeal More funding to tackle mental health... Reports\nThe Conservative Party Conference 2016 in Birmingham - 1st Rolling Brief 1st October 2016 Contents Conservative Party Conference Key Messages and Narrative Employment practices review Stopping benefit reassessments for those most in need Support to... Reports",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_saveourlocalpubs/content_17.html": "Labour's War on Pubs Will Close Your Local\nLabour's pub tax hike will force landlords to raise prices or shut their doors for good.\n- £1,000s extra in business rates per pub\n- £800 extra per worker in National Insurance\n- Higher pint prices for everyone\n- Landlords forced to police conversations that could offend\n- Making pubs no go zones for smokers",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/http_www_exeterconservatives_co_uk_how-get-involved/content_97.html": "With a packed events schedule, the Conservative Policy Forum, news from government, the opportunity of becoming a councillor and get involved with your community, and all for just £39 a year, Exeter Conservatives have something to offer everyone.\nJoining us means that you are a member of the most open and democratic political party in Britain. After the first three months of your membership, you will be entitled to a vote in Party ballots. You will also have a chance to influence Party policy by letting us know your views.\nAny person living in the United Kingdom is eligible to join the Conservative Party. Applicants are not required to be registered voters or UK nationals. There is no upper or lower age limit on membership, although those under the age of 15 cannot be enrolled as full voting members.\nUnder 25? You can join at a discount and still have full voting rights so Join Now.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_kemis-first-speech-2025-rebuilding-trust/content_65.html": "Tweet Monday, 27 January, 2025 National News Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people/content_2.html": "Anne Jobson Exeter City Council - Councillor for St Loyes Ward Exeter City Council - Conservative Group Leader Devon County Council - Candidate County Council CandidatesCity Councillors\nAndrew Leadbetter Devon County Council - Councillor for Wearside & Topsham Division County Councillors\nKeith Sparkes Exeter City Council - Former Topsham Councillor Candidate for the Topsham Ward, ECC City Council Candidates\nRob Newby Exeter City Council - former Councillor for Topsham County Council Candidate City Council Candidates",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_robert-sheridan/content_84.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nRobert Sheridan\nTweet\nCampaigner\nCampaigner\n.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_cpc16-great-finale-pms-speech/content_87.html": "Lots of really great news from last day of the Conservative Party Conference in Birmingham. Here you can find the highlights from the PM's speech:\nSpecial Brief: Prime Minister’s Speech\nA Country That Works For Everyone – The Good that Government Can Do\n· Today the Prime Minister explained in more detail her vision of a country that works for everyone, not just the privileged few.\n· She set out the clear case for the good that government can do while stating that political visions need to be accompanied by hard work and practical implementation.\n· The referendum was not just a vote to leave the EU, it was something broader.\n· It was about a deep, justified sense for many people that the world works well for a privileged few, but not for them.\n· This is a genuine turning point in Britain’s history and it is for this party to respond in a way that meets the challenge.\n· While being proud of our achievements over the past six years, it is clear that more needs to done to put government at the service of ordinary working class people.\n· A new approach that accepts government does not have all the answers but that it can and should be a force for good, providing what individuals, communities and markets cannot. Where markets are dysfunctional, we should be prepared to intervene.\nIn practice that means things like:\n· Reforming corporate governance – to be announced later in the year – to ensure all businesses are run accountably and with long-term interest clearly in mind. We will publish our plans to have not just consumers represented on company boards, but workers as well.\n· A proper industrial strategy – identifying the industries that are of strategic value to our economy and supporting and promoting them through trade, tax, infrastructure, skills, training, and research and development policies.\n· Building more houses – meaning that more people have the opportunity to buy a home of their own and that less of the monthly family budget is poured into accommodation costs. On Monday we announced a new package of measures to get Britain building which include using more public sector land for housebuilding and further reforming the planning system so more houses can be built, more quickly.\n· Strengthening workers’ rights – as announced on Saturday, we’re going to review our laws to make sure that, in our modern and flexible economy, people are properly protected at work.\n· Bold new education reforms – so that every child has the chance to go to a good, local school and that they are not held back by where they live or how much money their parents have. The Government will end the ban on new grammar schools – as well as a range of other reforms to create more good school places.\n· Getting immigration under control – leaving the EU gives us an opportunity to control the numbers of people coming here from Europe and the Government will be consulting over the next few months on steps to reduce non-EU migration too across work and student visa routes.\n· Continuing to invest in our NHS – £10 billion extra over this Parliament, which is only possible because of the strong economic foundations we have built. We believe in public service. We believe in investing in and supporting the institutions that make our country great.\n· Protecting those who cannot work – we will end the mandatory retesting of work capability for those with chronic health conditions that not only induces stress but does nothing at all to help.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_kemi-launches-policy-renewal-programme/content_74.html": "Tweet Tuesday, 18 March, 2025 National News At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_conservative-councillor-cynthia-thompson-elected-right-worshipful-lord-mayor/content_77.html": "Last night, at Exeter City Council's Annual General Meeting, Councillor Cynthia Thompson was elected The Right Worshipful the Lord Mayor of Exeter for 2016/17.\nCllr Thompson was born and grew up in St. Thomas, and attended local schools. She gained a Licentiateship from Trinity College of Music, London, where she studied piano for three years under the Czechoslovakian concert pianist Madame Eva Bernathova and later gained a diploma in music in the multiple disciplines of music theory, including composition.\nCouncillor Peter Holland was appointed Deputy Lord Mayor of Exeter.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_category_National-News/content_8.html": "The Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News\nKemi gives a speech at the Alliance for Responsible Citizenship Conference 18th February 2025 On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values National News\nRebuilding Trust with our new Immigration Policy 10th February 2025 Kemi’s new plan for immigration shows the Party is back in the service of the British people National News\nKemi’’s First Speech of 2025: Rebuilding Trust 27th January 2025 Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party National News",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_cynthia-thompson/content_34.html": "Former Lord Mayor of Exeter\nCynthia Thompson has formerly served on Exeter City Council as a Conservative City Councillor.\nShe has served as the Right Worshipful Lord Mayor of Exeter.\nCynthia Thompson has formerly served on Exeter City Council as a Conservative City Councillor.\nShe has served as the Right Worshipful Lord Mayor of Exeter.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_conservative-manifesto-exeter-city-2024/content_9.html": "Exeter Conservative's are pleased to share their vision for Exeter ahead of the May 2024 City elections.\nExeter Conservative's are pleased to share their vision for Exeter ahead of the May 2024 City elections.\n| Attachment | Size |\n|---|---|\n| manifesto pdf non editable (3.46 MB) | 3.46 MB |",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_category_Opinions/content_22.html": "Share your views with our next Prime Minister 14th July 2019 In just over a week, the country will have a new Prime Minister. Please share your views with our next leader. The survey can be found here: views.conservatives... Opinions",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_keith-sparkes/content_1.html": "Exeter City Council - Former Topsham Councillor\nCandidate for the Topsham Ward, ECC\nFormer Councillor Keith Sparkes was elected to Exeter City Council in December 2019 as a ward Councillor for the Topsham ward. Born in Exeter he attended Ladysmith First School, Ladysmith Middle School, Vincent Thompson High School, and Exeter College before moving away to University. He returned in 2011.\nFormer Councillor Sparkes, prior to May 2022, served on the following Exeter City Council committees, where he had a high attendance record.\n- Annual Council\n- Council\n- Customer Focus Scrutiny Committee\n- Extraordinary Meeting of the Council\n- Mobile Home Residents Forum\n- Planning Committee\n- Exeter Harbour Board\n- Exeter Strategic Board\nIf elected, Keith is committed to stand up for the residents of Topsham.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_our-6-point-plan-exeter-city-council/content_44.html": "We intend to ‘Build Back Better’ and our vision is to create a City that people believe in now and in the future – by offering a vibrant Economy, re-vitalized City Centre and clean green open spaces…..recognising the City’s unique Heritage, its Cathedral, University, River and stunning strategic location – with easy access to 2 railway lines, the M5 Motorway/A303 trunk road, Airport, 2 National parks and 2 coastlines!\n- Get the Basics right! Empty the litter bins, cut the grass, clean up rubbish and graffiti, deal with anti-social behaviour. Promote a scheme of City Wardens to make residents feel safe and have someone to speak to.\n- Improve Re-cycling. Offer kerb-side recycling of glass and food waste, Offer weekly refuge collections where needed ie in areas of houses in multiple occupation\n- Deliver more affordable housing – both to buy and rent. Work with Housing Associations and Developers to create and widen the range of housing available to deliver housing for local people.\n- Listen to Residents! Consult on projects – hold regular surgeries and consultation events in local neighbourhoods and find out what people want.\n- Revitalise the High Street and City Centre. Find alternative uses for redundant shops. Create living spaces, a ‘Café Culture’ and a ‘Market Square/Entertainment Space’ Prioritise the City’s offering around leisure and promote and work with others to deliver a Music/Entertainment venue in the City Centre. Freeze parking charges.\n- Take a lead on Climate Change to help Exeter meet its Net Zero Carbon City target by 2030. Encourage people to walk and cycle and work with DCC to deliver safer Cycle lanes and footpaths. Reduce air-pollution.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_your-views/content_41.html": "Your local Conservative Councillors are dedicated to ensuring the very best for residents in Exeter; we want to hear from you about your views on local and national issues; from potholes and litter, to investing in the NHS and Education, your opinions matter to us.\nIf you do any have concerns about your local community or want to tell us how we can improve services locally, please let us know in a survey or email us at https://www.exeterconservatives.co.uk/contact.\nCouncillor Peter Holland joined the Lord Mayor Yolonda Henson at a tree planting ceremony to celebrate Her Majesty Queen Elizabeth's Platinum Jubilee Year and to commemorate 25+ years' service as a Trustee of Exeter Church Charities by Alderman John Landers-93 years young!\nPicture showing LM",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_events/content_29.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nFuture Events\nSorry, we haven't got any upcoming events.\nPlease check back soon to see future events.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_conservative-response-labours-emergency-budget/content_58.html": "Tweet Wednesday, 26 March, 2025 National News Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_katherine-new/content_21.html": "Katherine New is a retired NHS Healthcare Scientist, working at the RD&E Hospital for over 20 years. With lifelong experience in community leadership roles, including as a school governor, she is committed to improving the quality of life for people in Exeter. Contact Katherine at [email protected]\nKatherine is Deputy Chair for Membership for the Exeter Conservative Association.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_results-heavitree-traffic-survey-presented-exeter-highways-committee/content_28.html": "Speech to the Exeter Highways and Traffic Orders Committee\nBy Cllr Anne Jobson OBE on 30th September 2023\nThis is an update on responses to our survey questionnaire delivered to about 6,000 business and households in areas in or bordering the scheme – with an on-line option. There was a 22.6% response rate.\n64.8% did not believe there had been consultations in 2020 and 2021.\nWhen asked if the scheme introduced on 3rd August is working – 85.56% said it was not with 10.17% saying it was and a further 4.27% saying they did not yet know.\nWhy were there were no face to face meetings with residents before you made a decision that affects the lives of thousands of Exeter’s residents.\nBy providing white space on our survey many took the opportunity to explain their views. Those responses will form part of our final report.\nAnalysing the responses to the survey further - the rejection of this scheme is not because residents and businesses do not see the need for traffic calming, but because it is damaging people’s well-being; it is worsening emissions and pollution; it is damaging local trades and businesses.\nIf people are to be encouraged to use public transport, then infrastructure needs to be in place. Only 8.9% believe there is sufficient infrastructure whilst 81.38% say there is not. Many point out that Polsloe Bridge Rail station is not available for anyone with mobility issues and that the bus services are unreliable.\nNot everyone is able to walk and cycle, however 40.61% say it has made no difference to pedestrians during the day, but 36% say they feel less safe when walking in the dark. Only 19.36% believe it is now safer for cyclists. 55% and 59% believe that it is less safe for those needing home care or the assistance of the emergency services.\nOne aim was to reduce emissions by reducing car use. The survey shows residents do not believe this is happening - 57.5% saying it is not reducing vehicle use and 82.18% saying it is increasing mileage. A typical response from a resident within the scheme area “my mileage has more than tripled. Journeys to the shops in Whipton and Pinhoe, my vet and chemist in Pinhoe, the recycling centre send me half way round the city.“ And another “We have to go so far round to get to Morrisons and don’t say ride a bike I am not able.” And “yesterday I needed to pick my elderly parents up for an appointment – pre the closures the journey would take me 8 minutes, the new time of 40 minutes wasn’t an option. I rang them and suggested they walk down to the barrier and I would wait for them. It was very sad watching them gingerly walk and struggle down to me.”\nThis scheme is impacting local businesses and trades - 69.07% seeing an adverse effect on local businesses. A carer working for one of the care agencies states she is constantly worried about being late – in some cases that poses the risk of becoming life threatening as medication has to be administered at certain times of the day and traffic and increased mileage mean that is increasingly hard to achieve.\nThe taxi and private hire trade now have a concession, but there are many others who face similar problems who remain disadvantaged.\nThere are some positive comments that the roads within the scheme are quieter. Just 2 roads are in favour - Commins Road 6 responses from 31 households with 5 in favour; Third Avenue - 4 in favour / 2 against and with Hamlin Lane (17 responses from 51 households) polling at 50/50 with 1 don’t know.\nWhy is the detail from the 4,000 responses received not available at today’s meeting? The key concerns as identified are very similar to those expressed in our survey.\nThe social isolation reported in our survey is mirrored in your report, but this should have been picked up had there been a proper consultation at the beginning.\nExeter is not a large City, it does not have a multiplicity of public transport options. It is a City that thrives around its local communities, people living local, shopping local and using local trades. The planning of this scheme split into 2 such a community, if that was an intended consequence of this scheme then shame on those who designed it and those who voted in favour.\nLet us have no more delay. Pause this scheme, remove the planters and the bollards and sit down properly with the local community, trades and businesses to find a practical solution.\nAnne Jobson OBE\nExeter Conservative Group Leader, Exeter City Council",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_david-luscombe/content_86.html": "I live and work locally in Exeter and I'm fed up seeing Labours damaging incompetence nationally and locally make a mess of things. Locally Labour councillors have voted to close public toilets and allow playgrounds to deteriorate, all whilst having one of the worst recycling rates in the South West and also saddling Exeter City residents with over £IOO million of debt. Then, after hiking parking charges, they are closing roads all over the city causing disruption and pollution. Conservative run councils run better services with less cost. Birmingham is a classic an example of how awful Labour run councils\nIf elected I will be campaigning for the basic stuff people want, public toilets to be re-opened; the budget for parks, playgrounds and green spaces to be increased, more bins for dog-poo and litter, to introduce glass recycling. Cycling routes should be increased, but not by closing off roads, Low Traffic Neighbourhoods LTN’s should be only allowed if the MAJORITY of residence want it, and not imposed by councillors that don’t feel the adverse affects.\nLets do what the Exeter and Devon public want, not what the ideological left think they want!",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_type_Campaigner/content_53.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nCampaigner\nAlfie Carlisle\nCampaigner\nRuth Smith\nCampaigner\nJoan Collacott\nCampaigner\nOscar Brown\nCampaigner\nRobert Sheridan\nCampaigner\nCampaigner",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_stopthebustraveltax/content_80.html": "Stop Labour's 50% bus fare hike.\nLabour's plans to raise bus fares from £2 to £3 mean hard-working people commuting every day will pay £520 a year more.\nSign our petition to stop this.\nThis petition will be presented to the Labour Party. We will use your contact details to update you about Labour’s tax rises.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_stopthefarmtax/content_94.html": "Labour have broken their promise to British farmers with the Family Farm Tax.\nLabour's Family Farm Tax will stop farms being passed to the next generation\n- Threatening our food security\n- Risking jobs\n- Leading to food prices rising\nStop this. Sign our petition:-\nThis petition will be presented to the Labour Party by Christmas. We will use your contact details to update you about Labour's tax rises.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_contact/content_30.html": "We are your local Exeter Conservative Association. Do you have a local issue that needs looking into? Or do you want to get involved? Let us know here.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_percy-prowse/content_7.html": "Devon County Council - Councillor for Duryard & Pennsylvania\nCounty Councillor for Pennsylvania, Stoke Hill and Duryard, Percy was a beat police Officer for 32 years. This was spent mostly in the City covering the St James and St David’s wards. Percy was involved in all aspects of Community interest and has now retired. He was formerly a City Councillor for Duryard since 2007. Percy was the infamous Bobby on a bike iconically wearing a cape, becoming a recognizable presence in the community. He is married with 3 children and four grand-children. His wife Elaine works for a High St branch of a kitchen-ware store.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_category_Articles/content_10.html": "Tree Planting Ceremony - Lethbridge Almshouses 20th July 2022 Councillor Peter Holland joined the Lord Mayor Yolonda Henson at a tree planting ceremony to celebrate Her Majesty Queen Elizabeth's Platinum Jubilee Year and... ArticlesLocal News\nOur 6 Point Plan for Exeter City Council 2nd May 2021 We intend to ‘Build Back Better’ and our vision is to create a City that people believe in now and in the future – by offering a vibrant Economy, re-vitalized... ArticlesLocal NewsReports\nStatement regarding traveller encampment at Digby Station Car Park 29th January 2021 We started to receive reports about an illegal encampment being established on part of the Digby Station Car Park. Many residents will remember the problems... ArticlesLocal News",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_cpc16-todays-brief/content_93.html": "Contents\n- Conservative Party Conference Key Messages and Narrative\n- Housing package\n- Brexit – Article Fifty and ECA Repeal\n- More funding to tackle mental health stigma\n- Prison Staffing\n- PREVIOUS ANNOUNCEMENTS\n- Employment practices review\n- Stopping benefit reassessments for those most in need\n- Support to boost new technologies\n- New support for Afghanistan\n- Building our new nuclear submarines\n- Digital skills for everyone\n- OTHER LINES\n- Public finances\n- Aid budget\n- Grammar schools\n- Business rates\n- Help To Buy: Mortgage Guarantee scheme\n- Minimum wage rise\n- APPENDICES\n- Main Hall Agenda",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_rebuilding-trust-our-new-immigration-policy/content_20.html": "Tweet Monday, 10 February, 2025 National News Kemi’s new plan for immigration shows the Party is back in the service of the British people\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_rob-newby/content_5.html": "Rob lives in the Countess Wear part of the City and served as City Councillor for Topsham from 2003-2023. A previous Lord Mayor of Exeter from May 2012 until May 2013, Rob is also a former London Fire Brigade firefighter.\nExeter is a fantastic cathedral city, so it is very important that every resident feels they have a say on how Exeter develops in the future and I am delighted to have been selected for the St David's and Haven Banks division, in the very heart of our City.\nMany people tell me that they feel they have little say in the future of the area. I want to make sure that everyone's voice is heard—whether the issue is the high level of parking charges, the planning approvals for blocks of soulless dormitories or the untidy state of our streets and parks. It is time for a change. Labour and the Greens are ruining Exeter. They either do not listen or they take no notice of what you tell them. I am an experienced campaigning councillor who will work on your behalf.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_cdn-cgi_l_email-protection/content_32.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_exeter-conservatives-launch-2022-local-elections-manifesto/content_11.html": "Exeter Conservatives this week launched their local election manifesto. Launching the manifesto, outside of the Customs House, on the Quay, Group Leader Cllr Andrew Leadbetter said that the manifesto was \"A really different document that could show what a difference Conservatives could make in Exeter.\"\nThe launch was attended by Cllr Keith Sparkes, representing Topsham, and Peter Holland, representing St Loyes. Both are seeking re-election on the 5th May 2022.\nYou can download a copy of the manifesto, from the attachments section, just below.\nThe manifesto has ten themes.\n1. Economic Stability.\n2. Net Carbon Zero 30\n3. Refuse and Recycling\n4. Planning and Housing\n5. The City Centre\n6. Our Green Environment\n7. A Conservative led Council - Our first 100 days.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_category_Media/content_55.html": "Tessa Tucker Selected as Parliamentary Candidate for Exeter 17th September 2023 Tessa Tucker has been selected as the Conservative Party candidate for Exeter with a promise to support local businesses, tackle transport chaos and campaign... Local NewsMedia",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_kemis-statement-ukraine/content_26.html": "Tweet Monday, 3 March, 2025 National News Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_type_City-Councillors/content_3.html": "Anne Jobson Exeter City Council - Councillor for St Loyes Ward Exeter City Council - Conservative Group Leader Devon County Council - Candidate County Council CandidatesCity Councillors",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_type_District-Council-Candidates/content_46.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nDistrict Council Candidates\nDavid Luscombe\nCandidate for the St Sidwells and St James Division.\nDistrict Council Candidates",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_andrew-leadbetter/content_51.html": "Devon County Council - Councillor for Wearside & Topsham Division\nAndrew has been the County Councillor for Topsham since 1997 and is one of the City Councillors for Topsham. He is Deputy Leader of the Conservative Group on Exeter City Council.\nWithin Devon County Council he is Cabinet Member for Economy, Growth & Cabinet Liasion for Exeter.\nNotes: The County Council Division includes the whole of the Topsham Ward, as well as parts of St Davids, Newtown and St Leonards and Priory wards.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_type_Police-and-Crime-Commissioner/content_14.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nPolice and Crime Commissioner\nAlison Hernandez\nPolice and Crime Commissioner",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_about-us/content_66.html": "Exeter Conservative Association covers the parliamentary constituency of Exeter, which is not quite the same area as Exeter City Council. Some parts of Exeter, Topsham, St Loyes and Pinhoe are in the Exmouth and East Exeter Constituency. David Reed is the Conservative MP for these parts of the City. Contact | David Reed\nAcross the City we campaign on local issues and run fundraising events. The Conservatives run Devon County Council and the Exeter Conservatives are an opposition group on Exeter City Council.\nIn addition to contesting elections we hold good social events, an opportunity to mix with like minded people, and the chance to talk to Conservative frontbenchers on a regular basis. There really is something for everyone.\nWhatever your interest in politics, new members are always welcome. To get involved, see the Membership page, or go direct to conservatives.com/join.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_conservative-party-conference-2016-birmingham-1st-rolling-brief/content_90.html": "Contents\n- Conservative Party Conference Key Messages and Narrative\n- Employment practices review\n- Stopping benefit reassessments for those most in need\n- Support to boost new technologies\n- New support for Afghanistan\n- Building our new nuclear submarines\n- Digital skills for everyone\n- Grammar schools\n- Business rates\n- Help To Buy: Mortgage Guarantee scheme\n- Minimum wage rise\n- Main Hall Agenda",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_tell-rishi-your-priorities/content_78.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nTell Rishi Your Priorities\nTweet\nTell Rishi what matters to you | Conservatives",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_type_County-Councillors/content_60.html": "Andrew Leadbetter Devon County Council - Councillor for Wearside & Topsham Division County Councillors",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_conservative-partys-final-party-election-broadcast/content_43.html": "Tweet Tuesday, 29 April, 2025 National News Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are\nOur candidates for City and County Council elections on 1 May 2025 want to hear your views Sunday, 20 April, 2025 By completing our simple online survey you can let your local candidates know your views about your area.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_cookies/content_4.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_rob-hannaford/content_37.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nRob Hannaford\nTweet\nCandidate for Duryard & Pennsylvania DCC\nCounty Council Candidates\n.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_anne-jobson/content_54.html": "Anne Jobson a former elected Association Chairman, and is currently Group Leader of Exeter City Council. She has lived in the area for almost 20 years, first in St Thomas before moving to north Exeter. She is a barrister, specialising in family law, and has spent many years helping clients through some of the hardest days of their lives.\nAnne has been involved in Conservative Party Politics for nearly 40 years now and was an Association and Area Officer in London. She was a Jt Treasurer for the Greater London Area for 3 years and served on the National Union of the Conservative Party. Anne has stood for Parliament 3 times including standing for the Exeter Constituency in 2001. Anne was proud to be awarded the OBE in 1992 for Political and Public Service.\nAnne believes that the voluntary Party Membership is the foundation on which the Conservative Party is based and is keen to hear from anyone who lives or works in Exeter who would like to join the Association. Anne is always out and about delivering leaflets or canvassing and welcomes the opportunity to chat.\nAnne works closely with the hard-working Conservative Councillors who sit on both Exeter City Council and Devon County Council and is always happy to hear from any Exeter residents about local issues of concern. “Our councillors are a hard working group and their work is so often un-noticed. Our Conservative Councillors are dedicated to helping local residents and I hope that in future elections we will increase our numbers until we are able to take control of the Council. Our current Labour Council is increasingly out of touch with the views of local people – whether it is the colossal spend on a swimming pool that they are forcing through, or their failure to listen to local views about the constant increase in purpose-built student housing in the City centre when residents want to see homes for the current and future generations of people who live and work in Exeter.”\nShe also adds: \"Exeter Conservative Association is a campaigning Association. We want to know your views on our national policies as they develop. We want to know what you want to see done locally – however small an issue we will always do our best to help. If you want to get involved please join us and let us know how you can help.\"\nOutside work and politics, Anne has a variety of interests, including falconry, walking her excitable springer spaniel (Disraeli), dance and gardening keep her fit.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_exeter-community-survey/content_47.html": "Tweet We would love to hear your views. Exeter Community Survey Current Local Issues Your Priorities National Issues Get involved Your details Leave this field blank Please let us know how you feel by saying if the issue is very important, slightly important or not very important to you or your family? Questions Very important Slightly important Not very important Ensuring public sector workers have all the support they need Very important Slightly important Not very important Working to support local NHS services Very important Slightly important Not very important Protecting local jobs, small businesses, and their livelihoods Very important Slightly important Not very important Ensuring local children have the best education possible, while stating safe in these difficult times Very important Slightly important Not very important Making sure the elderly and the vulnerable are safe and secure Very important Slightly important Not very important Traffic Part of a County Councillor’s roles is to work closely with Devon Highways to try and raise concerns that residents have. In your local area do you regularly suffer from traffic congestion? Traffic regularly gets backed up which causes problems for me frequently Traffic regularly gets congested, but it doesn’t affect me badly There is occasional congestion No issues with congestion Do you suffer from speeding traffic in your local area? Yes, regularly Yes, but only occasionally No Other Broadband Our local County Councillors are campaigning to deliver better broadband coverage throughout Exeter and across Devon, especially in our rural areas. Thinking about your broadband provision, how you would rate your current service? Very Fast Fast Fast enough for my needs Not good enough Slow I'm not able to get broadband/ rely on a different internet provision (e.g 4G) On a scale of 0- 10 how essential is it to provide full fibre broadband for everyone? 0 1 2 3 4 5 6 7 8 9 10 Not essential Very essential\nOur candidates for City and County Council elections on 1 May 2025 want to hear your views Sunday, 20 April, 2025 By completing our simple online survey you can let your local candidates know your views about your area.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_alfie-carlisle/content_31.html": "Alfie Carlisle is a Trainee Solicitor, having read law at the University of Exeter. Originally from Plymouth, he has lived in Devon all his life and is passionate about issues affecting local people in the constituency.\nWith a keen interest in technology, Alfie provides support to the Association's social media and online presence.\nAlfie believes the Labour-run City Council just isn't getting the basics right and wants to see a Conservative majority elected onto Exeter City Council so we can deliver the high-quality public services that Exeter residents deserve, in a sustainable and cost-effective way that is fair to current and future tax payers.\nExeter Community Survey\nYou may also be interested in",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_category_Local-News/content_69.html": "Our candidates for City and County Council elections on 1 May 2025 want to hear your views 20th April 2025 By completing our simple online survey you can let your local candidates know your views about your area. Local News\nConservative Manifesto for Exeter City 2024 14th April 2024 Exeter Conservative's are pleased to share their vision for Exeter ahead of the May 2024 City elections. Local News\nResults of Heavitree traffic survey presented to Exeter Highways Committee 31st October 2023 Speech to the Exeter Highways and Traffic Orders Committee By Cllr Anne Jobson OBE on 30th September 2023 This is an update on responses to our survey... Local News\nTessa Tucker Selected as Parliamentary Candidate for Exeter 17th September 2023 Tessa Tucker has been selected as the Conservative Party candidate for Exeter with a promise to support local businesses, tackle transport chaos and campaign... Local NewsMedia\nTree Planting Ceremony - Lethbridge Almshouses 20th July 2022 Councillor Peter Holland joined the Lord Mayor Yolonda Henson at a tree planting ceremony to celebrate Her Majesty Queen Elizabeth's Platinum Jubilee Year and... ArticlesLocal News\nExeter Conservatives Launch 2022 Local Elections Manifesto 8th April 2022 Exeter Conservatives this week launched their local election manifesto. Launching the manifesto, outside of the Customs House, on the Quay, Group Leader Cllr... Local News\nRecycling Matters - Labour are failing Exeter. 2nd August 2021 RECYCLING MATTERS – LABOUR ARE FAILING EXETER “It is more than frustration, it is anger that Exeter remains at the bottom of Devon’s recycling league table,”... Local News",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_share-your-views-our-next-prime-minister/content_52.html": "In just over a week, the country will have a new Prime Minister.\nPlease share your views with our next leader.\nThe survey can be found here: views.conservatives.com/leadership.\nIn just over a week, the country will have a new Prime Minister.\nPlease share your views with our next leader.\nThe survey can be found here: views.conservatives.com/leadership.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaign-schedule/content_19.html": "There are around 75000 electors in Exeter, that's a lot of people that have opinions and views. In order to keep up with the thoughts of Exeter, we regularly canvass across the city.\nIf you want to get involved, please complete the form to the right of this message.\nThank you and look forward to seeing you on the campaign trail.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_alison-sheridan/content_48.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nAlison Sheridan\nTweet\nExeter City Councillor for St Loyes\nCity Councillors\n.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_petitioncommonsenseimmigrationrules/content_70.html": "Our country is not a hotel, it is our home. This is our plan for immigration.\nWe think:\n- Newcomers should wait 10 years, instead of 5, before they can apply to stay indefinitely, under the Indefinite Leave to Remain (ILR) scheme.\n- After that, it should take 5 years, not just 12 months, to apply for British Citizenship.\n- Those who have claimed benefits or housing aid while on a work visa should not be allowed to stay indefinitely. We believe that everyone who comes here should contribute more than they take out.\n- Applicants must not have a criminal record.\nWe know:\n- Labour MPs have an opportunity to back our plans. We think they should take it.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_news_more-community-grants-given-out-exeter/content_91.html": "City Councillor for Stoke Hill and Pennsylvania, Peter Holland is pleased to report that he has been able to support the installation of Notice Boards at Prince Charles Road Allotments.\nPeter said: ''Since the local management of allotments began in the Summer of 2014, allotment holders have become more responsible for their sites and I was delighted to be able to use money from the Pennsylvania Ward Grant to support new signage at Prince Charles Road Allotments.\nIt was great that the construction of the boards was completed by a local joiner. The new boards, one at each vehicle entrance to the site, ensure plot holders will now be able to find out what is going on without having to make a specific visit to the trading hut.\nAs we move into a New Year I would like to encourage as many residents to take up gardening--research has found that gardeners and allotment holders had more energy and were less angry and depressed. People who have access to gardens, parks or the countryside are more likely to live longer, have lower levels of asthma and reduce the risk of heart disease!''",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_joan-collacott/content_92.html": "Skip to main content\nExeter\nConservatives\nMain navigation\nAbout Us\nPeople\nYour Views\nNews\nMembership\nEvents\nCampaign Locally\nExeter Community Survey\nHeavitree LTN Survey\nContact\nExeter\nConservatives\nJoan Collacott\nTweet\nCampaigner\n.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_campaigns_stopthegroominggangs/content_99.html": "It's time to get justice for victims.\nThe only way to expose those who turned a blind eye to the grooming gangs is by holding a full inquiry, so sign our petition.\nAdd your name and sign the petition to demand a full inquiry into the grooming gangs and those who turned a blind eye to them. This petition will be presented to the Labour Party by the next summer recess. We will use your contact details to update you about crime-related issues.",
  "https_www_exeterconservatives_co_uk_people_keith-sparkes/https_www_exeterconservatives_co_uk_people_peter-holland/content_73.html": "Exeter City Council - Councillor for St Loyes Ward\nA City Councillor for the St Loyes ward and a former Lord Mayor of Exeter. Cllr. Peter Holland has lived in Exeter for over 40 years. He was formerly Deputy Chairman of the Exeter Conservative Association, Peter is married with two sons. He works closely with families and community groups and aims to facilitate a supportive and inspiring environment for local residents. He will continue to work, first and foremost, to represent residents’ interests and focus on the issues that matter to you. Peter is a Governor of St.John's Hospital Educational Foundation and a life member of the National Association of Head teachers."
}