{
  "https_www_bencoleman_uk/https_www_bencoleman_uk/content_1.html": "I’m honoured to represent Chelsea and Fulham as a Member of Parliament and to stand up for all my constituents.\nYou can use my website to find my latest contributions in Parliament or read my blog to learn more about the issues I am campaigning on.\nI send out a regular newsletter and you can sign up to receive this here.\nYou can also follow me on social media using the buttons at the bottom of this webpage.\nIf you’d like my help or want to raise something with me, please email me at ben.coleman.mp@parliament.uk and I’ll get back to you as soon as I can.",
  "https_www_bencoleman_uk/http_www_bencoleman_uk_blog/content_2.html": "We’ve saved the King’s Road Post Office!\nI’m delighted that services will continue under a new franchise model. My thanks to all those who campaigned with me.\nI’m delighted that services will continue under a new franchise model. My thanks to all those who campaigned with me.\nIn my latest newsletter, I talk about the issues that I’ve been working on locally and nationally in recent weeks – while pushing for change.\nMy February update covers all the local and national issues and campaigns I’ve been working on in the last few months\nThe Tories lied about Charing Cross Hospital. Labour will deliver on the rebuild. And we will be honest with people.\nMy latest update on a packed couple of months working for local residents\nIn this blog, I set out the reasons for my vote on the Terminally Ill Adults (End of Life) Bill\nShare your views in the biggest public conversation about the future of the NHS since its founding in 1948.\nAs the first-ever Labour Member of Parliament for Chelsea and Fulham, I’m honoured and hugely grateful to all those voters who put their trust in me.\nFrom my heart, thank you. Thank you to everyone who voted for me and who has sent me kind words in the three weeks since I was elected as your MP for Chelsea and Fulham.\nPromoted by Nikos Souslous on behalf of Ben Coleman, both at 28 Greyhound Road, London, W6 8NX"
}