{
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_proper-infrastructure-for-new-homes/content_43.html": "top of page\nAlistair Strathern MP opens new Community Centre in Stondon\nPRESS RELEASE FROM ALISTAIR STRATHERN MP MONDAY 28TH APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\n6 days ago\nAlistair Strathern MP calls on Central Beds Council to speed up spending crucial infrastructure funds\nPRESS RELEASE FROM ALISTAIR STRATHERN MP THURSDAY 24th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 24\nLocal MP calls out housing developers over 'fleecehold' scandal\nAlistair Strathern, MP for Hitchin, backed by 36 Labour MPs, has called on major developers to play their part to end exploitative estate...\nApr 10\nAlistair Strathern MP secures Bill to tackle Fleecehold Scandal\nPRESS RELEASE FROM ALISTAIR STRATHERN MP THURSDAY 27th FEBRUARY 2025 FOR IMMEDIATE RELEASE Alistair Strathern secures Bill to tackle...\nFeb 27\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_local-mp-calls-out-housing-developers-over-fleecehold-scandal/content_12.html": "Local MP calls out housing developers over 'fleecehold' scandal\n- Alistair Strathern\n- Apr 10\n- 1 min read\nUpdated: Apr 11\nAlistair Strathern, MP for Hitchin, backed by 36 Labour MPs, has called on major developers to play their part to end exploitative estate charges and tackle the growing crisis of unadopted housing estates.\nIn a letter sent directly to the CEOs of seven of the UK’s largest housing developers, Strathern highlighted the scale of the issue. With around 80% of new housing estates remaining unadopted by local councils, vital infrastructure such as roads, lighting, and green spaces are left in the hands of private management companies, with residents vulnerable to exploitative charges. In 2022 alone, UK households paid a staggering £260 million in estate management charges, with many facing additional inflated and unexpected bills on top of regular fees.\nTo understand the extent of the issue, Strathern has asked for clear data on the proportion of estates adopted in recent years, and what steps developers are taking to work with councils to avoid leaving homeowners vulnerable to these unfair charges.\nThis action follows the introduction of Strathern’s Parliamentary Bill last month – the Housing Estates Bill.\nCommenting, Alistair Strathern MP said:\n“Families across Herts, Beds and beyond are being hit with eye-watering service charges for basic amenities that simply don’t meet acceptable standards.\n“From broken streetlights to crumbling roads, homeowners are left footing the bill because developers haven’t built estates to a standard that councils can adopt.\n“This fleecehold stealth tax has gone on long enough. Labour understands this and we’re determined to do all that we can to bring it to an end.”",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_alistair-strathern-mp-opens-new-community-centre-in-stondon/content_5.html": "Alistair Strathern MP opens new Community Centre in Stondon\n- Alistair Strathern\n- 5 days ago\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nMONDAY 28TH APRIL 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, the MP for the Hitchin constituency, joined residents in Stondon to celebrate the opening of their new Community Centre this morning.\nThe Centre, which is situated at Stondon Recreation Ground, comes following housing expansion in Lower Stondon and has been funded as part of developer contributions for local infrastructure.\nThe new building boasts a 150-capacity main hall, a function room, meeting rooms, Home and Away dressing rooms, a kitchen and a bar. Its car park contains over 50 spaces, with 35 of these equipped with electric charging. It also has solar panels on its roof to minimise energy costs.\nIt will be used by a wide range of groups locally, from dance classes to football clubs, and will be run by a newly formed village hall committee.\nStrathern has been campaigning since before he became an MP for new housing to come with new infrastructure. This work has led him to campaign across our area for GP surgery expansions, smoother and expanded roads and much improved public transport. Alongside the village hall, Strathern is also campaigning for the expansion of Lower Stondon GP surgery following significant growth in the village.\nRecently he spoke in Parliament to call on Central Beds Council to use more of its substantial, unspent infrastructure fund, which could be used to fund more crucial local infrastructure. See here.\nAlistair Strathern MP said:\n“It was great to visit the brand-new Stondon Community Centre this morning and meet all the volunteers and locals whose hard work made it possible.\n“It is an excellent new facility for Stondon, and an example of the kind of infrastructure we should be building with new housing across Bedfordshire and Hertfordshire.\n“It’ll be a fantastic asset for the whole community, and I look forward to seeing it come to life as a host for everything from local football clubs to dance classes.\n“I’m clear more is needed though, including a crucial expansion of the GP surgery here in Stondon.\n“Alongside pushing our councils to invest more in our communities, I will continue my efforts to reduce and remove the obstacles put in front of local authorities to deliver the new infrastructure we need.”\nNotes for Editors\nYou can see a picture of Strathern at the opening, attached.\nYou can find more information about the Community Centre, here.\nYou can see Strathern speaking in Parliament about the need for more local infrastructure, here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_shadow-science-and-technology-secretary-peter-kyle-and-alistar-strathern-visit-cadent-gas-apprentice/content_42.html": "Shadow Science and Technology Secretary Peter Kyle and Alistar Strathern visit Cadent Gas apprentices\n- Alistair Strathern\n- Jun 20, 2024\n- 2 min read\nPeter Kyle, Shadow Secretary of State for Science, Innovation and Technology, visited Hitchin today. The Shadow Minister joined Labour’s Parliamentary Candidate for Hitchin, Alistair Strathern.\nCadent Gas is the UK’s largest gas distribution network, bringing gas to 11 million homes and businesses. They manage a network of more than 82,000 miles of pipes, most of them underground, which transport gas throughout the North West, West Midlands, East Midlands, South Yorkshire, East of England and North London.\nPeter Kyle and Alistair Strathern visited Cadent Gas and met senior leaders from the company and apprentices.\nThese commitments, which are two of Labour’s first steps for change, include creating thousands of new skilled jobs as part of the Green Prosperity Plan and recruiting 6,5000 new teachers in key subjects. The net zero carbon industries have an average annual wage £8,200 higher than this region’s average income.\nPeter Kyle said:\n“The science is clear we need to move fast to clean green tech and this is being pushed by Cadent Gas to explore green hydrogen technologies and its application to our lives today.\n“Through apprenticeships and STEM outreach programmes the engineers of the future are also being trained to build the technology that will keep this country safe and secure.”\nAlistair Strathern, Labour’s Prospective Parliamentary Candidate for Hitchin, said:\n“As the UK transitions to a brighter, greener, future, the jobs in clean technologies will be highly skilled and apprentices in Hitchin are well placed to exploit these opportunities and compete with the best in the world to secure these roles.\n“Labour is promising a Green Prosperity Plan which could see 38,000 new jobs to the East of England. Making sure our young people are ready to take that opportunity head on is vital.”\nNOTES TO EDITORS:\nLabour’s Green Prosperity Plan will unleash the economic benefits of the green transition for communities across Britain.\nLabour will switch on Great British Energy, a new publicly owned energy company to take back control of the energy system on behalf of the British people.\nAlongside this, Labour's National Wealth Fund will help to create up to half a million jobs in Britain's industrial heartlands, giving opportunities to plumbers, electricians, welders, and workers in every single nation and region of the country. This policy will crowd in billions of additional private investment, providing a significant boost to Britain's steel, automotive, energy, and manufacturing industries.\nLabour will set the NWF and GB Energy a key investment principle that its investments should drive regional and local economic growth, particularly including communities with historic and current ties to fossil fuel production and fossil fuel-intensive production.\nAnalysis has found that Labour’s plans could mean, over the next decade, more than 38,000 new jobs each in the East of England. (Jobs estimate applied proportionately by nation and region based on (a) ONS, Low carbon and renewable energy economy estimates, Employment (by country) and (b) LGA, ‘Local green jobs – accelerating a sustainable economic recovery’, % share of low-carbon jobs by region in 2050 (England only)).",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_register-for-a-postal-vote-deadline-5pm-today/content_37.html": "Register for a postal vote deadline: 5pm today!\n- Alistair Strathern\n- Jun 19, 2024\n- 1 min read\nThe deadline to register for a postal vote is at 5pm today, Wednesday 19th June.\nMake sure to register to make your voice heard and have your say in the coming election.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-mp-presses-for-change-in-parliament-after-spate-of-local-fires/content_19.html": "Hitchin MP presses for change in Parliament after spate of local fires\n- Alistair Strathern\n- Jan 22\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nWEDNSDAY 22nd JANUARY 2024\nFOR IMMEDIATE RELEASE\nAlistair Strathern, the MP for the Hitchin constituency, in Parliament this week asked the Government for reforms to reduce the chance and risk of industrial fires.\nIn the last year, Hitchin’s industrial centre has seen five large fires triggered by metal recycling.\nLocally, Strathern has formed a taskforce of local stakeholders, from local councils to the Environment Agency, to work on solutions to prevent more fires in Hitchin,\nIn Parliament, following many private conversations with ministers on this, Strathern pushed Ministers for stronger powers for the Environment Agency and reform of the recycling of lithium-ion batteries.\nDepartment for Environmental, Food and Rural Affairs minister Mary Creagh in response said she would work to tackle the growing issue,\nAlistair Strathern MP said:\n“Five times in the last year, people in Hitchin have woken up to plumes of smoke and possible contamination in the air, as time and again local metal recycling plants have caught fire.\n“By knocking heads together between councils, the Environment Agency and other authorities with a remit, we are looking to make progress, but there is clearly also a case for national action.\n“I will continue to press the minister on this, but I know from my conversations with her that she is alive to the risks in this space. I hope that, over the course of this Parliament, we can deliver real change.\nMary Creagh MP said:\n“I hope that we will not have to wait for a whole Parliament before we make progress on tackling the issues in the metals recycling business.\n“We have also banned single-use vapes to tackle the battery fires they cause.\n“I will work with other Ministers across Government to consider how to tackle the growing problem of lithium battery fires.”\nNotes for Editors\nYou can see a full transcript of the debate, here.\nPlease find a recent picture of Strathern, attached.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_championing-our-environment/content_15.html": "top of page\nHitchin MP celebrates securing bill-saving solar investment for Lister Hospital\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 21st MARCH 2025 FOR IMMEDIATE RELEASE Alistair Strathern MP has celebrated the...\nMar 21\nHitchin MP hails local apprenticeship providers as he calls for expansion of training\nPRESS RELEASE FROM ALISTAIR STRATHERN MP TUESDAY 4th FEBRUARY 2025 FOR IMMEDIATE RELEASE Alistair Strathern, MP for the Hitchin...\nFeb 4\nHitchin MP presses for change in Parliament after spate of local fires\nPRESS RELEASE FROM ALISTAIR STRATHERN MP WEDNSDAY 22nd JANUARY 2024 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nJan 22\nHitchin MP launches campaign to expand solar panels on new homes\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 17th JANUARY 2024 FOR IMMEDIATE RELEASE Alistair Strathern, MP for the Hitchin...\nJan 17\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_alistair-strathern-mp-calls-on-central-beds-council-to-speed-up-spending-crucial-infrastructure-fund/content_6.html": "Alistair Strathern MP calls on Central Beds Council to speed up spending crucial infrastructure funds\n- Alistair Strathern\n- Apr 24\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nTHURSDAY 24th APRIL 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, the MP for the Hitchin constituency, which includes much of Bedfordshire, has called on Central Bedfordshire Council (CBC) to speed up investing available funds in much needed local infrastructure, following revelations CBC has one of the largest unspent funds in the country.\nSpeaking in Parliament, Strathern highlighted the fact that CBC has one of the highest unspent section 106 funds in the country. Section 106 money is to be spent on local infrastructure, given by developers, as housing increases demands on services in an area.\nBedfordshire has seen significant increases in town and village size in recent years, without the kind of GP surgeries, road upgrades, schools and pharmacies needed to keep up with growing demand on public services.\nStrathern was speaking in a Westminster Hall debate on infrastructure and housing in Bedfordshire. You can see the clip here.\nIn regular meetings with CBC leadership and their planning team, speeches in Parliament and engagement with residents, Alistair has been campaigning for more infrastructure.\nHe will continue to push CBC hard to use up their section 106 fund.\nSince he first ran to become an MP in 2023, Strathern has campaigned for new housing to always come with new infrastructure. He made this a key pledge during the general election last year.\nAlistair Strathern MP said:\n“New infrastructure must come with new homes. Both new and old residents in communities do not just deserve this, they are owed it.\n“Local communities will be alarmed that in spite of the pressure on local infrastructure, CBC has one of the highest unspent infrastructure funds in the country.\n“I am calling on CBC to use more of their section 106 fund so residents can see the kind of public service improvements they are crying out for.\n“I will be doing everything I can to support them in using this money as effectively as possible, and in Parliament pushing to reduce the barriers that impair their ability to make best use of this fund.”\nNotes for Editors\nYou can see Strathern’s intervention where he calls for more action from CBC, here\nYou can find out more about unspent section 106 monies, and see the councils alongside CBC with the highest unused funds, here",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_contact/content_3.html": "top of page\nParliamentary Contact Information\nMy office is able to assist all residents of the new constituency of Hitchin.\nPlease contact if you have any issues you wish for help with, or if you have any questions.\nYou can use this link to check whether I am your MP:\nhttps://members.parliament.uk/members/commons\nMy email address is alistair.strathern.mp@parliament.uk\nThank you.\nGet in touch about my Hitchin campaigning\nPlease get in touch with me if you have any questions about my campaign or Labour Party campaigning in Hitchin. Let's chat!\nSocial Media\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_hashtags_CentralBedsNHSAppDay/content_29.html": "top of page\nMy Pledges\nMy Story\nMy Events\nMy Newsletter\nUpdates\nContact\nMore\nUse tab to navigate through the menu items.\nAll Posts\nRepresenting our towns and villages\nCampaigning to represent Hitchin\nPress Releases\nChampioning our Environment\nDoctor and Dentist availability\nImproving local education\nProper infrastructure for new homes\nSafe, successful high streets\nProviding better Transport\nMP celebrates Central Bedfordshire NHS App Day\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 14th FEBRUARY 2025 FOR IMMEDIATE RELEASE Alistair Strathern, MP for the Hitchin...\nFeb 14\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_providing-better-transport/content_20.html": "top of page\nLocal MP backs Langford Parish Council campaign for CBC white line u-turn\nPRESS RELEASE FROM ALISTAIR STRATHERN MP TUESDAY 11th FEBRUARY 2025 FOR IMMEDIATE RELEASE Alistair Strathern, Member of Parliament for...\nFeb 11\nHitchin MP secures tap in and out ticketing for Hitchin train station\nPRESS RELEASE FROM ALISTAIR STRATHERN MP MONDAY 20th JANUARY 2024 FOR IMMEDIATE RELEASE Alistair Strathern, MP for the Hitchin...\nJan 20\nHitchin MP launches local pothole campaign following major funding boost\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 10th JANUARY 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nJan 10\nHitchin MP celebrates securing £11 million extra pothole funding for Hertfordshire and Central Beds\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 20th DECEMBER 2024 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nDec 20, 2024\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_appalled-hitchin-mp-stands-with-residents-unable-to-sell-their-homes/content_46.html": "‘Appalled’ Hitchin MP stands with residents unable to sell their homes\n- Alistair Strathern\n- Jul 25, 2024\n- 2 min read\nUpdated: Oct 23, 2024\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nTHURSDAY 25 JULY 2024\nFOR IMMEDIATE RELEASE\nAlistair Strathern, Labour MP for Hitchin, is today standing with local Hitchin residents who, thanks to extortionate ground rent terms, are unable to sell their flats.\nLeaseholders on Watersmeet estate, off Grove Road, Hitchin, pay a ground rent of £300 per year to the freeholder. A clause in the contract allows the figure to double, with it expected to rise to £600 per year by 2034. With many banks refusing to lend to homeowners subject to such clauses, this has left many of the homeowners on this estate trapped and unable to sell.\nIn one of his first actions as the MP for the new Hitchin constituency, Mr Strathern met with a group of the concerned residents last week at their estate. He has since written to the Freeholder, Tulsesense, urging changes to the contract, and for a meeting to ensure new terms can be established.\nOn top of the ground rent charges, residents have to pay over £2000 a year in management fees that pay for the maintenance of the estate.\nAlistair Strathern has made highlighting the unfairness of leasehold a priority since entering Parliament last year, including meeting and working with leasehold residents across his constituency.\nAlistair Strathern, Labour MP for the Hitchin constituency, said:\n“I was appalled to hear the stories of the residents of Watersmeet, and the impact the current broken leasehold system and unfair ground rent terms is having on local families.\n“It is completely unfair that they cannot sell their flats. Tulsesense must lower and cap their ground rent to ensure homeowners are not trapped.\n“But, the stories of Watersmeet sadly are not isolated. I will be working with the new Labour government to reform leasehold and freehold, and end the broken system we have inherited.”\nEditors' Notes:\nYou can see an image of Mr Strathern with residents attached.\nIn a leasehold system, residents buy the house or flat, but not the land with which the house sits on. In many cases, residents in this system pay peppercorn rent.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-mp-backs-local-residents-campaign-to-reopen-kimpton-pub/content_30.html": "Hitchin MP backs local residents campaign to reopen Kimpton pub\n- Alistair Strathern\n- Feb 24\n- 2 min read\nAlistair Strathern, MP for the Hitchin constituency, has publicly backed the Save our White Horse campaign, in Kimpton.\nThe White Horse is a former pub in Kimpton, that has been left to dilapidate by its owner, while they try to get approval for a housing development over the line. Local residents are campaigning to block this application, and bring the building back its former life as a treasured community pub.\nStrathern met with local residents to discuss how he could support the effort this week. You can see a picture attached.\nAs a keen supporter of the important role local village pubs can play, he has written to North Herts council to voice his objections, and to back calls to rejuvenate the pub.\nThe Save our White Horse campaign has been going on for over 10 years to block repeated attempts at residential development. The ongoing engagement and effort from the local community is a sign of the enthusiasm to save this valued pub.\nAlistair Strathern MP said:\n“I know just how important village pubs are as hubs for their community.\n“It was fantastic to met Ian and Doug from the Save our White Horse, hear more about their fantastic local campaigning and to offer my support.\n“This pub, after such a long time closed and in limbo, deserves to reopen and serve Kimpton’s community once more.\n“I’ll be backing the Save our White Horse campaign all the way, and continuing to campaign nationally for more support and protections for vital community pubs.” Notes to Editors\nYou can see a picture of Strathern with the Save our White Horse campaign attached.\nYou can read about the campaign at their website, here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-mp-launches-campaign-to-expand-solar-panels-on-new-homes/content_17.html": "Hitchin MP launches campaign to expand solar panels on new homes\n- Alistair Strathern\n- Jan 17\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nFRIDAY 17th JANUARY 2024\nFOR IMMEDIATE RELEASE\nAlistair Strathern, MP for the Hitchin constituency, has today launched a campaign to increase the number of new houses that have solar panels installed as standard.\nStrathern has written to Housing Minister Matthew Pennycook to call for tighter regulations on developers to make solar panels on new houses the rule, rather than the exception.\nThe MP is asking for people to add their name to his letter to support his campaign.\nThe Government has committed to tripling solar and quadrupling wind by 2030, as part of their efforts to substantially decarbonise. Strathern wants to go even further.\nOne of Strathern’s priorities and passions as an MP is defending our environment. This work has been national, for example championing efforts to tackle water pollution, and local, for instance spearheading the effort to improve flood mitigation.\nAlistair’s letter can be read and signed via this form.\nAlistair Strathern MP said:\n“We need to make the very most of the energy transition to clean, green renewable power.\n“I have welcomed the Government’s fantastic first steps to do just this, but I want to see us do even more.\n“Many of us have been frustrated to see new homes go up without solar panels as standard, across our area.\n“That’s why I am calling for people to back my campaign to end the days of solar panels being an afterthought when building new homes.”\nNotes to Editors\nYou can see Strathern’s letter to Housing Minister Matthew Pennycook, attached.\nYou can see Strathern’s form for signatures, here.\nYou can see Strathern in Parliament raising this issue, here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_alistair-strathern-mp-welcomes-7-3m-funding-boost-for-beds-police/content_31.html": "Alistair Strathern MP welcomes £7.3m funding boost for Beds Police\n- Alistair Strathern\n- Apr 1\n- 1 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nTUESDAY 1ST APRIL 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, the MP for the Hitchin constituency, whose seat includes eastern Bedfordshire, has welcomed news of a significant £7.3m boost in funding for Beds Police.\nBeds Police will receive the £7.3m in a renewal of special grant funding. Strathern, the other Labour Beds MPs, and Beds Police and Crime Commissioner John Tizard, all supported Beds Police’s application for further funding.\nThe group wrote to, and met with, the Policing Minister to call for the renewal for a force that has been historically under-funded. Despite containing Luton and Bedford, the police force has been classed as ‘rural’ and inappropriately funded as a result.\nThe renewal of the grant comes on top of an increase in Beds Police’s overall budget this year.\nStrathern has been campaigning for better local police funding since he became an MP\nin 2023. This has involved meeting with ministers and speaking in Parliament.\nAlistair Strathern MP said:\n“It’s brilliant news that Beds Police will receive £7.3m in special grant funding, on top if its increased budget.\n“These funds will be key for the police to have the resources they need to keep us all safe.\n“Our police men and women do tough, incredible community work every day, and we owe it to them to give the resources that match their skill and commitment.”",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_privacy-policy/content_25.html": "Privacy Policy\nThis privacy policy sets out how I collect and use any information you may give me when you visit this website, email me, subscribe to my Mailchimp account or otherwise communicate with me.\nWhat information do I collect?\n-\nI may collect, store and use two kinds of data, personal and behavioural.\n-\nPersonal data relates to the information you provide to me and may include your name, address, email address and post code.\n-\nBehavioural data relates to information about your visit to and actions on this website, and includes your IP address, referrer, length of visit and number of page views. This information is essential for the website to work correctly, and allows me to improve the performance and functionality of the site.\nHow will I use your data?\n-\nThe information you provide will be used to enable me to respond to your enquiry, keep you up to date with my work relevant to your enquiry and suggest activities you may want to be involved in. You may opt out from receiving such information at any time.\n-\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do where it is necessary and reasonable to do so and you have explicitly consented for me to do so. I will share only the minimum amount of personal information necessary in order to advocate on your behalf.\n-\nYour personal details will never be published on this site.\n-\nI will only disclose personal information to third parties if required by law to do so.\nControlling your data\n-\nIf the information I hold about you needs to be corrected or updated, you would like to be unsubscribed from our emails, or have any other questions or concerns about my use of your personal data, please contact me at ali@alistairstrathern.com.\n-\nTo request a copy of any information I hold about you, please contact me at ali@alistairstrathern.com. I may require proof of identity to process your request. I will reply within one month.\n-\nI will only retain your personal information so long as I am the MP for Hitchin, or you ask not to be contacted further.\n-\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nMy Details\nYou can contact me via email at ali@alistairstrathern.com\nThis privacy policy is effective from March 2025.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog/content_11.html": "top of page\nAlistair Strathern MP opens new Community Centre in Stondon\nPRESS RELEASE FROM ALISTAIR STRATHERN MP MONDAY 28TH APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\n6 days ago\nAlistair Strathern MP visits new Shefford Lower School Breakfast Club\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 25th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 25\nAlistair Strathern MP calls on Central Beds Council to speed up spending crucial infrastructure funds\nPRESS RELEASE FROM ALISTAIR STRATHERN MP THURSDAY 24th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 24\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-mp-launches-local-pothole-campaign-following-major-funding-boost/content_23.html": "Hitchin MP launches local pothole campaign following major funding boost\n- Alistair Strathern\n- Jan 10\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nFRIDAY 10th JANUARY 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, the MP for the Hitchin constituency, has called for residents to share views on the worst potholes and poorly maintained roads across the constituency as part of his campaign to improve local road conditions.\nFollowing campaigning in Parliament from Mr Strathern and fellow MPs on the state of roads across the country, in October’s Budget the Government announced an extra £500m for pothole works, to bring the fund for 2025/26 to £1.6bn.\nLocally, this includes an extra £11m for Central Bedfordshire and Hertfordshire.\nStrathern is seeking residents feedback on which roads and potholes they would like to be prioritised. Since becoming an MP he has been pushing councils to fix the worst roads, and will be feeding back the results of his survey to the leadership of CBC and Hertfordshire county councils. Constituents can fill in Strathern’s survey, here.\nThe funding increase is expected to facilitate the fixing of seven million potholes across the country, saving families hundreds, if not thousands in avoided repair costs.\nStrathern has long been campaigning on potholes locally, with nearly 500 residents signing his recent letter to Central Bedfordshire Council calling on them to patch Old Bridge Way, Shefford.\nAlistair Strathern MP said:\n“The poor state of many local roads isn’t just an embarrassment, it’s a real danger for those who use them.\n“Having been regularly raising this issue in Parliament, I was delighted to see the Government deliver an extra £500m for road repairs, £11m of which I’ve secured for our local councils.\n\"I need your help to ensure we make the most of it though. Share your views on the worst potholes and roads locally with my team, so we can push CBC and Herts County Council to act.\n\"Together, lets call time on the dire state of local roads and get them back to a condition we can all be proud of”\nNotes for Editors\nYou can find Strathern’s survey here\nYou can find more information about the major pothole funding increase here\nYou can see a tweet from Strathern about his campaign to fix Old Bridge Way, Shefford here",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_representingourtownsandvillages/content_9.html": "top of page\nAlistair Strathern MP opens new Community Centre in Stondon\nPRESS RELEASE FROM ALISTAIR STRATHERN MP MONDAY 28TH APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\n6 days ago\nAlistair Strathern MP visits new Shefford Lower School Breakfast Club\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 25th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 25\nAlistair Strathern MP calls on Central Beds Council to speed up spending crucial infrastructure funds\nPRESS RELEASE FROM ALISTAIR STRATHERN MP THURSDAY 24th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 24\nLocal MP calls out housing developers over 'fleecehold' scandal\nAlistair Strathern, MP for Hitchin, backed by 36 Labour MPs, has called on major developers to play their part to end exploitative estate...\nApr 10\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_hitchin/content_27.html": "top of page\nThank you.\nIt is an incredible privilege to have been entrusted to represent our towns and villages in Parliament. Hitchin voted for change, and the...\nJul 8, 2024\nNew: Ask Ali Anything Q&A Events\nI am holding a weekend of Q&A events across our new constituency. This is your opportunity to ask me questions about how we can improve...\nJun 24, 2024\nShadow Science and Technology Secretary Peter Kyle and Alistar Strathern visit Cadent Gas apprentices\nPeter Kyle, Shadow Secretary of State for Science, Innovation and Technology, visited Hitchin today. The Shadow Minister joined Labour’s...\nJun 20, 2024\nRegister for a postal vote deadline: 5pm today!\nThe deadline to register for a postal vote is at 5pm today, Wednesday 19th June. Make sure to register to make your voice heard and have...\nJun 19, 2024\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_local-mp-calls-for-urgent-action-at-larksfield-surgery-after-cqc-report/content_33.html": "Local MP calls for urgent action at Larksfield surgery after CQC report\n- Alistair Strathern\n- Sep 9, 2024\n- 2 min read\nUpdated: Oct 23, 2024\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nMONDAY 9th SEPTEMBER 2024\nFOR IMMEDIATE RELEASE\nLocal MP Alistair Strathern, representing the new constituency of Hitchin, has said a recent concerning CQC report into Larksfield GP surgery underlines need for local stakeholders to continue to work together to push for improvements from the medical group.\nLarksfield Surgery Medical Group, who run the GP practices in Stotfold and Arlesey, was recently graded as ‘requires improvement’ by the Care Quality Commission (CQC), following an inspection.\nThis comes as no surprise to local residents, who had regularly been in contact with Mr Strathern even before the election to highlight challenges with the surgery. Between the inspection and report release, Mr Strathern worked with the surgery, councillors and local stakeholders to hold the surgery to account for the issues patients were reporting. Together, they secured commitments to improve the triage system for appointments and to create a commitment to hire more GPs.\nFollowing the report though, Mr Strathern is calling for further action to ensure patients are able to access a GP when they need one.\nAlistair Strathern said:\n“Even before being elected, the performance of the surgery has been on my radar, with far too many patients struggling to access a GP.\n“I am glad that, working with local councillors and partners, we have been able to secure action, from improving the triage system to a commitment to hire more GPs.\n“Whilst the inspection was carried out before these actions took place, its clear further improvements will be needed.\n“I’ll be meeting with the CQC to hear first hand the evidence they uncovered in their inspection, which reinforces the clear calls from local patients for urgent improvements.\n“I’m committed to continuing to work on a cross party basis with local partners to hold Larksfield to account for the delivering the improvements local patients are crying out for.”\nNotes for Editors\nYou can see more about the CQC report here",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_mp-celebrates-central-bedfordshire-nhs-app-day/content_8.html": "MP celebrates Central Bedfordshire NHS App Day\n- Alistair Strathern\n- Feb 14\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nFRIDAY 14th FEBRUARY 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, MP for the Hitchin constituency, visited Shefford Medical Centre on Friday to mark and celebrate #CentralBedsNHSAppDay\nThe aim of the day is to spread awareness of the apps’ new tools and encourage local patients to make use of its new functionalities. After gaining increased prominence during the Covid outbreak, the NHS app has grown to become a health hub for its 33 million users.\nAs part of the Government’s drive to reform the NHS and improve the experience of patients using it, improving and expanding the range of services available to patients through the app is a priority.\nPatients can now order repeat prescriptions, arrange GP and vaccination appointments, see their medical and appointment history, arrange to donate organs, take part in health research, and access a catalogue of health advice.\nThe app is being continually developed as part of efforts to fully digitalise the NHS to bring it into the 21st century and increase efficiency and capacity.\nStrathern has made improving local GP services one of his top priorities since being elected. Part of this work has involved working with individual practices and their stakeholders on their issues. For example, he has been supporting Shefford Medical Centre to secure funding to kit out the entirety of the building it occupies.\nAlistair Strathern MP said:\n“It was wonderful to meet with some of our fantastic local healthcare staff at Shefford Medical Centre, and to celebrate the success so far of the NHS app.\n“If we are going to ensure the NHS is a fully functioning health service fit for the 21st century, improving tools like the NHS app is an important step.\n“As an increasingly one-stop-shop for healthcare, I encourage everyone to download it if possible. It’s a great way to book appointments, prescriptions and check records, all while reducing pressures on NHS staff.\n“Very understandably though, many in our community might struggle to use the app, so I’m thankful to see while we ramp up the digitalisation of the NHS, we will continue to offer all important traditional forms of interaction too.”\nNotes for Editors\nYou can see a picture of Strathern with NHS workers to mark Central Beds NHS App Day attached.\nYou can see more information about the NHS app here.\nYou can find more information about Strathern’s work locally on healthcare here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-mp-celebrates-securing-bill-saving-solar-investment-for-lister-hospital/content_38.html": "Hitchin MP celebrates securing bill-saving solar investment for Lister Hospital\n- Alistair Strathern\n- Mar 21\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nFRIDAY 21st MARCH 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern MP has celebrated the Government securing significant investment in solar energy for Lister Hospital to help cut bills and free up funding for treating patients.\nThe Lister is to benefit from over £2.1m of additional funding from Great British Energy, for East and North Herts NHS to invest in Hospital solar projects, saving millions off energy bills for Herts NHS over the coming years.\nThe programme – which marks the first major project for the Labour Government’s publicly-owned energy company - will mean 10 schools across the East of England will receive funding for solar panels alongside 14 NHS sites.\nEstimates suggest that the average school could save up to £25,000 on their bills thanks to the scheme.\nSchools and hospitals have been hit with sky-high energy bills for years due to the UK’s dependency on fossil fuel markets, creating a significant drain on their budgets. The NHS’ annual energy bill has doubled to an eye-watering £1.4bn a year since 2019.\nIn addition to this new project, the Government has announced that £12m will be put aside for local authorities and community energy groups to build local clean energy projects – including onshore wind turbines, rooftop solar panels and hydropower.\nThe first panels are expected to be delivered by the end of summer 2025.\nCommenting, Alistair Strathern MP said:\n“This is a fantastic investment for Lister Hospital to embrace clean, renewable energy produced here at home.\n“I am thrilled to see the Lister secured as one of 24 sites schools and hospitals regionally, and 400 across England, chosen for solar upgrades.\n“This scheme shows the power of green investment to boost energy security and reduce NHS and school energy bills, freeing up crucial funding for treating patients and supporting pupils.”\nNotes for Editors\nYou can see attached a picture of Strathern visiting the Lister Hospital in 2024.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_alistair-strathern-mp-holds-public-meeting-on-recent-industrial-fires-in-hitchin/content_36.html": "Alistair Strathern MP holds public meeting on recent industrial fires in Hitchin\n- Alistair Strathern\n- Mar 31\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nMONDAY 31st MARCH 2025\nFOR IMMEDIATE RELEASE\nLast week, Alistair Strathern, MP for Hitchin, hosted a well-attended public meeting to address the recent spate of industrial fires in the town.\nThe event, held at Holy Saviour Church on Friday 28th March, brought together around 50 residents to discuss their experiences and hear about the progress being made to tackle the issue.\nDuring the meeting, Strathern outlined the steps he has taken alongside key local stakeholders to address the problem, while also listening to the concerns of those affected. He was joined by Councillor Ian Albert, who represents the impacted area and has been working closely with him for several months to push for stronger action.\nAlbert has been instrumental in helping Strathern to unite local stakeholders—including local councils, councillors, the fire service, and the Environment Agency—to find a long-term solution.\nIn the past year, Hitchin’s industrial centre has been the site of 5 major fires, primarily caused by the disposal of lithium-ion batteries and small appliances. Beyond the fires, residents have also raised concerns about persistent noise and air pollution from the waste sites, with the exact health risks still unclear.\nAt the meeting Mr Strathern urged all those impacted by the issues with the sites to email his office to keep in touch about how they can support driving forward the changes needed.\nAlistair Strathern MP said:\n“A huge thank you to everyone who came along to this important fire meeting, and for contributing to a really helpful discussion.\n“I have been heartened by the progress we have made so far, including the safety guarantees we have received for the site, but lots more needs to be done.\n“I will be continuing to work with all local stakeholders on this issue, and, as always, continue to welcome and be supported by constituent’s suggestions and feedback.”\nNotes for Editors\nYou can see an image from the event, attached.\nYou can see a post put out by Strathern following the event, here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_new-ask-ali-anything-q-a-events/content_34.html": "New: Ask Ali Anything Q&A Events\n- Alistair Strathern\n- Jun 24, 2024\n- 1 min read\nI am holding a weekend of Q&A events across our new constituency.\nThis is your opportunity to ask me questions about how we can improve our local area and how we can get our country back on track.\nIt is also a chance to hear about the work I have been doing for our communities and my priorities going forward for our new constituency.\nDATES:\nPirton Village Hall 6 30pm Friday 28th June\nArlesey Village Hall 1pm Saturday 29th June\nHitchin Walsworth Road Baptist Church 2pm 30th June",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_my-story/content_13.html": "My Story\nGetting a good start in life\nI was also fortunate to get a good education here, from Pinchmill Lower to Lincroft Middle and Sharnbrook Upper. Class sizes were reasonable and the teaching staff were brilliant. I want all children to have the same opportunities as I had.\nBanking on a better future\nI went to work at the Bank of England because I believe that a strong and growing economy is the cornerstone of every family’s financial security. The cavalier approach of the government in recent years has impacted every household budget. I know how important economic security is and I understand the price we have all paid. That’s why I will stand up for you and your family to ensure sound economic management always comes first.\nRe-elected in the new constituency of Hitchin\nFollowing national boundary changes, I stood in the new constituency of Hitchin, to continue representing my home. It is an honour to be elected for a full term by the people of Bedfordshire and Hertfordshire, and to be given the responsibility of standing up for towns and villages. I will give it my all.\nGrowing Up\nI was lucky enough to spend my childhood growing up in a village near Sharnbrook. From playing football on the village green to mucking about on tractors on my friend’s farm, it was a brilliant place to grow up.\nThose who can, teach\nI really do believe in children getting the best start in\nlife.That’s why I was proud to start out after universtiy\nas a teacher, helping kids learn maths. If I’m given the\nhonour of becoming your MP, I’ll work hard to ensure\nthat children across Hitchin and the villages have the\nsame start in life that I had.\nA history making by-election\nIn October last year, I overturned a Conservative majority of over 24,000 to become Mid Bedfordshire’s first ever Labour MP. It was the privilege of my life to become the MP for where I live. I didn't waste a minute in standing up for our communities in Parliament. I worked day and night, to be the full time, hard-working MP our area deserved.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_safe-successful-high-streets/content_14.html": "top of page\nAlistair Strathern celebrates confirmation of Universal Studios Theme Park in Bedford\nPRESS RELEASE FROM ALISTAIR STRATHERN MP WEDNESDAY 9th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, MP for Hitchin and the...\nApr 9\nAlistair Strathern MP welcomes £7.3m funding boost for Beds Police\nPRESS RELEASE FROM ALISTAIR STRATHERN MP TUESDAY 1ST APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 1\nAlistair Strathern MP holds public meeting on recent industrial fires in Hitchin\nPRESS RELEASE FROM ALISTAIR STRATHERN MP MONDAY 31st MARCH 2025 FOR IMMEDIATE RELEASE Last week, Alistair Strathern, MP for Hitchin,...\nMar 31\nHitchin MP backs local residents campaign to reopen Kimpton pub\nAlistair Strathern, MP for the Hitchin constituency, has publicly backed the Save our White Horse campaign, in Kimpton. The White Horse...\nFeb 24\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_alistair-strathern-celebrates-confirmation-of-universal-studios-theme-park-in-bedford/content_22.html": "Alistair Strathern celebrates confirmation of Universal Studios Theme Park in Bedford\n- Alistair Strathern\n- Apr 9\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nWEDNESDAY 9th APRIL 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, MP for Hitchin and the surrounding villages in Beds and Herts, has welcomed the fantastic news that a world-leading Universal Studios Theme Park will go ahead in Bedfordshire.\nSince his very first day as a Bedfordshire MP back in 2023, Strathern has been in contact with Universal to support their work. Alongside promoting their vision, he has shared local constituent concerns to ensure the approved plans work for our local towns and villages.\nThe project is expected to create a huge 28,000 local jobs and bring in a massive £50 billion for our economy.\nIt constitutes one of the biggest investments in our region in history, and will be transformational for local business including hospitality, travel and accommodation. Too rarely a go-to for holidaymakers, this offers an exciting opportunity to put Bedfordshire on the map.\nThe Universal site is planned to be at Kempston beside the A421, just south of Bedford.\nIt will join Universal sites in Hollywood, Orlando, Singapore, and Beijing.\nAlistair Strathern MP said:\n“This news is game-changing for all aspects of our local economy.\n“From young people seeking work to local businesses, this news offers exciting opportunities for everyone in Bedfordshire and beyond.\n“It has been a pleasure to support this project from the very first day I became an MP and to help however I could.\n“There is plenty of work ahead, and I will be working with Universal to make sure the project works for all in our communities.”\nNotes for Editors\nYou can see more information about the project here.\nYou can see a January 2024 BBC News story about Strathern supporting the project, here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-receives-funding-to-expand-top-quality-childcare-at-school-based-nursery/content_35.html": "Hitchin receives funding to expand top-quality childcare at school-based nursery\n- Alistair Strathern\n- Apr 2\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nWEDNESDAY 2ND APRIL 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, MP for Hitchin, has celebrated Hitchin’s Strathmore and Infant Nursery School being part of a new government scheme to expand school-based nurseries.\nAlready a school-based nursery, this funding will allow Strathmore to increase its numbers.\nThe Government roll out will fund 300 new or expanded school-based nurseries by converting classrooms into top quality early years spaces.\nFrom September, across the country, working parents will get 30 government-funded hours of childcare a week, from 9 months of age right up to starting school - saving parents up to £7,500 a year.\nThe first 300 schools will see an average of 20 childcare places per site, with up to 4,000 of these available by September and a further 2,000 later this autumn. Places will be focused in childcare ‘deserts’, where up until now families have been missing out due to a shortage of places.\nThis announcement comes alongside the rollout of breakfast clubs in primary schools, with the first 750 schools set to launch later this month – saving families up to £450 a year.\nAlistair Strathern MP said:\n“I am thrilled that Strathmore Infant and Nursery School has been given funding as part of Labour’s plan to roll out and expand school-based nurseries.\n“I know from speaking to families across my constituency the need for high-quality early-years support that is available nearby and doesn’t break the bank.\n“On top of our universal free breakfast clubs, I am glad to see this Government making a big difference for families on childcare.”\nBridget Phillipson, Secretary of State for Education, said:\n“School-based nurseries are an essential plank of Labour’s Plan for Change, giving every child the best start in life.\n“While the Tories made a childcare pledge without a plan, Labour is delivering on its promises.\n“Alongside our plans to roll out free breakfast clubs, these high-quality childcare places will get thousands more children school ready, breaking the link between background and success for families across the country.”",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_improving-local-education/content_10.html": "top of page\nAlistair Strathern MP visits new Shefford Lower School Breakfast Club\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 25th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 25\nHitchin receives funding to expand top-quality childcare at school-based nursery\nPRESS RELEASE FROM ALISTAIR STRATHERN MP WEDNESDAY 2ND APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, MP for Hitchin, has...\nApr 2\nMP invites local dads to the pub to chat paternity leave\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 14th MARCH 2025 FOR IMMEDIATE RELEASE Alistair Strathern, MP for the Hitchin...\nMar 14\nSeveral Bedfordshire schools to be first to receive landmark free breakfast clubs\nPRESS RELEASE FROM ALISTAIR STRATHERN MP MONDAY 21st FEBRUARY 2025 FOR IMMEDIATE RELEASE Alistair Strathern MP has celebrated the news...\nFeb 24\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com/content_1.html": "It was the honour of my life to be elected to serve the new constituency of Hitchin.\nI want to thank everyone who voted for me, supported me and trusted me. I especially want to thank the hundreds of people across our towns and villages who came together to make this result possible.\nWhether you voted for me or not, I will work day in, day out to serve you and to stand up for all our towns and villages.\nThe real work starts now. From struggles to see a doctor to the pressures of the cost of living, there are big challenges to be tackled. My work begins without delay.\nI want to be as accessible and hard-working an MP as possible, so please contact me if you have any issues or questions.\nI look forward to working with you all. Thank you.\nJuly 2024, Alistair Strathern",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_press-releases/content_24.html": "top of page\nAlistair Strathern MP opens new Community Centre in Stondon\nPRESS RELEASE FROM ALISTAIR STRATHERN MP MONDAY 28TH APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\n6 days ago\nAlistair Strathern MP visits new Shefford Lower School Breakfast Club\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 25th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 25\nAlistair Strathern MP calls on Central Beds Council to speed up spending crucial infrastructure funds\nPRESS RELEASE FROM ALISTAIR STRATHERN MP THURSDAY 24th APRIL 2025 FOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin...\nApr 24\nLocal MP calls out housing developers over 'fleecehold' scandal\nAlistair Strathern, MP for Hitchin, backed by 36 Labour MPs, has called on major developers to play their part to end exploitative estate...\nApr 10\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_blog_categories_doctor-and-dentist-availability/content_7.html": "top of page\nHitchin MP celebrates securing bill-saving solar investment for Lister Hospital\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 21st MARCH 2025 FOR IMMEDIATE RELEASE Alistair Strathern MP has celebrated the...\nMar 21\nExtra urgent dental appointments for Hitchin warmly welcomed by local MP\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 21st FEBRUARY 2025 FOR IMMEDIATE RELEASE Alistair Strathern, MP for the Hitchin...\nFeb 21\nMP celebrates Central Bedfordshire NHS App Day\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 14th FEBRUARY 2025 FOR IMMEDIATE RELEASE Alistair Strathern, MP for the Hitchin...\nFeb 14\nLocal MP calls for urgent action at Larksfield surgery after CQC report\nPRESS RELEASE FROM ALISTAIR STRATHERN MP MONDAY 9th SEPTEMBER 2024 FOR IMMEDIATE RELEASE Local MP Alistair Strathern, representing the...\nSep 9, 2024\nbottom of page",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_extra-urgent-dental-appointments-for-hitchin-warmly-welcomed-by-local-mp/content_16.html": "Extra urgent dental appointments for Hitchin warmly welcomed by local MP\n- Alistair Strathern\n- Feb 21\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP FRIDAY 21st FEBRUARY 2025 FOR IMMEDIATE RELEASE\nAlistair Strathern, MP for the Hitchin constituency, has celebrated securing thousands of extra dental appointments for the local area as part of the Government’s new plans to deliver 700,000 extra urgent appointments across the country.\nAcross the local region, 20% of patients who tried to see an NHS dentist in the last two years were unable to do so, with access to NHS dentistry increasingly a lottery across the country.\nAs part of plans to change this, the Government has announced over 11,000 extra urgent care appointments for the Integrated Care Boards (ICBs) covering the Hitchin constituency.\nMr Strathern has regularly met with the local ICBs since being elected to push for greater investment in NHS dentistry, and the announcement of thousands of extra emergency appointments locally will ensure many more people can now be seen by NHS dentists in an emergency.\nThe extra appointments will be available from April, and each ICB across the country has been set a target of urgent appointments to roll out, based on estimated local levels of unmet need for urgent NHS care. These extra appointments will be for patients who are likely to be in pain – including those suffering from infections or needing urgent repairs to a bridge – and require urgent treatment.\nAlistair Strathern MP said: “Everyone in our constituency knows the scale of the challenge facing NHS dentistry after years of failure.\n“In recent years it has become near impossible to get an NHS dental appointment and it is scandalous that the number one reason that five to nine year olds are admitted to hospital is because of tooth decay.\n“Since being elected I have been pushing our local ICB’s to do more, and campaigning for national action in Parliament.\n“I’m delighted that the Government has listened, delivering 11,000 extra emergency appointments for our area.\nStephen Kinnock, Minister of State for Care said:\n“We promised we would end the misery faced by hundreds of thousands of people unable to get urgent dental care. Today we’re starting to deliver on that commitment.\n“NHS dentistry has been left broken after years of neglect with patients left in pain without appointments or queueing around the block just to be seen.\n“Through our Plan for Change, this government will rebuild dentistry – focusing on prevention, retention of NHS dentists and reforming the NHS contract to make NHS work more appealing to dentists and increase capacity for more patients. This will take time but today marks an important step towards getting NHS dentistry back on its feet.”",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_local-mp-backs-langford-parish-council-campaign-for-cbc-white-line-u-turn/content_40.html": "Local MP backs Langford Parish Council campaign for CBC white line u-turn\n- Alistair Strathern\n- Feb 11\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nTUESDAY 11th FEBRUARY 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, Member of Parliament for the Hitchin constituency has backed Langford Parish Council’s campaign for CBC to ensure Edworth Road to have white lines throughout its entirety.\nCurrently, Edworth Road in Langford only has white lines for some of its length. The fast 60mph road connects Langford to the A1. CBC have previously refused to fully line the road, leading to local concerns about its impact on unsafe driving.\nStrathern has written to Central Bedfordshire Council (CBC) to call for the road to be fully lined and has recorded a video at the site to announce his support and urge local residents to back the parish council’s petition. This can be seen here.\nConstituents can sign a petition on CBC’s website to add their name to the campaign.\nAlistair Strathern MP said:\n“As a connecting road to a dual carriage way I share the concerns of many Langford residents about the safety of Edworth Road without white lines.\n“I will be pressing the council to review their initial refusal to act on residents calls. “In the meantime, I encourage all local residents to sign the petition to add your voice to Langford Parish Council’s campaign.”\nJulian Vaughan, local campaigner and parish councillor, said:\n“It’s extremely disappointing that Central Bedfordshire Council sees road markings as an optional extra, rather than a vital aspect of safer roads.\n“Their decision not to white line the entire length of Edworth Road not only completely disregards Department for Transport guidance for unlit rural roads, but puts road users at risk on what has become as busy link road from the A1 to Langford and the surrounding villages.\n“I urge them to rethink their ongoing refusal to white line Edworth Road and their broader approach to road safety measures.”\nNotes for Editors\nYou can see Strathern’s video at the site, here.\nYou can find the petition on CBC’s website, here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_thank-you/content_44.html": "Thank you.\n- Alistair Strathern\n- Jul 8, 2024\n- 1 min read\nIt is an incredible privilege to have been entrusted to represent our towns and villages in Parliament. Hitchin voted for change, and the hard work to deliver it begins now.\nWhether you voted for me or not this time, I’ll be working day in day out to deliver for all of us.\nI could not be prouder of the positive campaign we ran, together. Hundreds of people from across our towns and villages came together to make this result possible. They leafleted, canvassed, raised a garden stake and volunteered in the office. I cannot thank everyone enough.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_my-pledges/content_4.html": "My 5 Pledges\nfor our new Hitchin constituency\nA doctor and dentist when you need it\nFar too many people are struggling to see a doctor or dentist when they need one.\nLocally, I will:\n• Continue to bring together local stake holders to invest in new GP surgeries.\n• Push the local NHS and councils to maximise funding for healthcare infrastructure from developers.\n• Ensure local practices are held to account for delivering a good service to patients.\nNationally, Labour will:\n• Create 40,000 NHS appointments a week.\n• Incentivise dentists to take on NHS patients in areas of under provision like ours.\n• Train the doctors, dentists and nurses we need.\nMaking our area the best place to grow up\nOur area should be a fantastic place to grow up, but things simply aren’t always working for young people and families in our towns and villages right now.\nLocally, I will:\n• Push Central Bedfordshire to commit to a three to two tier school transition they can finally deliver.\n• Help support and expand local youth groups and provision.\n• Hold Central Bedfordshire Council and Herts councils accountable for improving SEND provision locally.\nNationally, Labour will:\n• Expand childcare provision with 100,000 extra nursery places.\n• Recruit 6,500 more specialist teachers.\n• Introduce new youth hubs, and completely reform SEND provision.\nProper Infrastructure for new homes\nThe current planning system is failing our towns and villages. New developments are being built, but without the infrastructure to match. Residents on new estates are paying hundreds for management companies that don’t maintain roads.\nLocally, I will:\n• Push councils to makes sure new planning decisions are matched with the doctors, dentists, roads, public transport and schools we need.\n• Bring together stakeholders to break down silos stalling investment.\n• Continue my bold action on estate road adoption and rogue management companies, to fix our potholed roads.\nNationally, Labour will:\n• Reform planning to deliver the affordable homes we need, with a focus on beautiful new towns rather than poorly managed village sprawl.\n• Ensure all new developments have proper infrastructure at their heart.\n• End the leasehold and fleecehold scandals.\nDefending our natural environment\nFor too long we haven’t stuck up for our climate and the fantastic nature and countryside that makes our country so special. To do that, we need to take bold action to fight the climate crisis.\nLocally, I will:\n• Continue to support and champion local conservation efforts.\n• Campaign to expand the Chilterns Area of Natural Beauty.\n• Support local farmers to ensure they can access the support they need.\nNationally, Labour will:\n• Take bold action on our climate commitments, setting up GB Energy and delivering clean power by 2030.\n• Ban bonuses for water company bosses and introduce criminal sanctions for water companies who continue to pollute our rivers.\n• Improve access to nature and protect our fantastic countryside.\nSafe, successful small businesses and high streets\nI want to breathe new life into our high streets. With new powers for local communities, we can revamp empty shops, pubs and community spaces.\nLocally, I will:\n• Champion our fantastic local businesses.\n• Work cross-party with local councils to turn vacant units on our high streets into community assets.\n• Hold workshops with local police, bringing them together with communities to take action on local issues.\nNationally, Labour will:\n• Cut business rates to support our high streets and local businesses.\n• Create 13,000 additional Neighbourhood police officers to make sure everyone feels safe in our own community.\n• Invigorate our high streets with Banking Hubs and give local people powers to take over vacant units.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-mp-celebrates-securing-11-million-extra-pothole-funding-for-hertfordshire-and-central-beds/content_41.html": "Hitchin MP celebrates securing £11 million extra pothole funding for Hertfordshire and Central Beds\n- Alistair Strathern\n- Dec 20, 2024\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nFRIDAY 20th DECEMBER 2024\nFOR IMMEDIATE RELEASE Alistair Strathern, the MP for the Hitchin constituency, has today welcomed news that Hertfordshire and Central Bedfordshire will receive an extra £11.8m to tackle potholes.\nThe Government announced today £1.6bn extra funding would go to local authorities next year, including £9.3m for Hertfordshire County Council and £2.5m for Central Bedfordshire Council. This funding is on top of £33.8m in regular funding for road repairs locally, bringing total funding to £45.3m in Central Beds and Herts.\nThe extra funding will amount to as many 7 million potholes being fixed next year across the country, keeping motorists safe and saving families potentially thousands of pounds in repairs.\nSince becoming an MP, Strathern has campaigned to better maintain and fix roads across Beds and Herts, including unadopted privately-owned roads, and particularly-glaring examples like Old Bridge Way in Shefford and the High Street and Shefford road in Meppershall.\nIn the general election campaign, Labour promised to fix one million potholes a year. This announcement blows that previous commitment out of the water.\nAlistair Strathern MP:\n“This extra £11m for local potholes is fantastic news for motorists and families across our area.\n“We deserve roads that are safe to prevent injury and high costs from punctures and car damage.\n“I am pleased that local campaigning by myself and other Labour MPs has highlighted the gravity of this situation and led to this funding commitment.\n“I will continue to fight for safer and smoother roads for our area in 2025 and beyond.”\nNotes for Editors\nYou can see the Government’s funding announcement here.\nYou can see a clip of Strathern raising the pothole-ridden state of Old Bridge Way in Parliament, here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_newsletter/content_18.html": "My Pledges\nMy Story\nMy Events\nMy Newsletter\nUpdates\nContact\nMore\nStay up to date with all my work across our towns and villages and in Westminster by signing up to my newsletter!",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_alistair-strathern-mp-secures-bill-to-tackle-fleecehold-scandal/content_45.html": "Alistair Strathern MP secures Bill to tackle Fleecehold Scandal\n- Alistair Strathern\n- Feb 27\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nTHURSDAY 27th FEBRUARY 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern secures Bill to tackle Fleecehold Scandal\nAlistair Strathern, Labour MP for Hitchin, is continuing his fight against the ‘fleecehold’ scandal by introducing a Bill to Parliament next week.\nMore and more new homeowners have found themselves in estate adoption limbo. With as many as 80% of new housing estates going unadopted, leaving households on the hook for private charges for services others receive through council tax.\nThe Bill will highlight the growing plight of these homeowners who, despite owning the freehold to their homes, are forced to pay extortionate fees for the upkeep of communal spaces on their estates. These charges are levied by private management companies, who often provide woeful services, leaving homeowners with little control and no real means to recourse.\nStrathern’s Bill will call for:\nA right for freeholders on unadopted private or mixed-use estates to manage their own communal spaces.\nMinimum standards for public amenities on new housing estates.\nClear timelines for local authorities to adopt and maintain communal spaces where appropriate.\nSpeaking ahead of the Bill’s introduction, Alistair Strathern MP said:\n“Too many homeowners across the country are being left in estate adoption limbo, with some estates now unadopted over a decade after completion.\n“In the meantime, households are forced to pay eye watering fees for services that all too often fall short, with little power to hold developers to account.\n“We need to call time on the exploitative fleecehold scandal and rip off management companies.\n“The Government is rightly committed to ensuring thousands more families across the country can finally have the security owning their own home. Delivering on the spirit of this promise means delivering on our commitment to end fleecehold once and for all.”\n<ENDS>\nNotes to Editors\nIn a leasehold system, residents buy the house or flat, but not the land with which the house sits on. In many cases, residents in this system pay peppercorn rent.\nThe Bill will be introduced on 4th March 2025, the draft text of the Bill can be see here, and pasted below:\nTen Minute Rule Motion: Housing estates\nThat leave be given to bring in a Bill to make provision for a right to manage for freeholders on unadopted private or mixed-use housing estates; to set minimum standards for public amenities on new housing estates; to make provision about the enforcement of those standards; to make provision about the adoption by local authorities of public amenities on new housing estates; and for connected purposes.\nStrathern previously wrote about the issue here and brought the Housing Secretary, Angela Rayner, to Stondon to discuss the issue of leasehold, see here.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-mp-hails-local-apprenticeship-providers-as-he-calls-for-expansion-of-training/content_28.html": "Hitchin MP hails local apprenticeship providers as he calls for expansion of training\n- Alistair Strathern\n- Feb 4\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nTUESDAY 4th FEBRUARY 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, MP for the Hitchin constituency, spoke in Westminster today to pay tribute to fantastic apprenticeship providers locally, and to call for action to expand apprenticeships including action on functional skills and foundation apprenticeship schemes.\nStrathern celebrated the work of Cadent, who train and upskill Hertfordshire young people to become gas engineers, and the Hitchin charity Amazing Apprenticeships.\nLed by CEO and campaigner Anna Morrison CBE, Strathern hailed Amazing Apprenticeships work to help countless young people across the country into paid training and advocate for more ambitious action on inclusive apprenticeships nationally.\nHaving brought two now secretaries of state to Hitchin to see first-hand their respective work, Strathern was speaking in a Westminster Hall debate on the future of apprenticeships to continue his campaign for action.\nHe said that learning from these fantastic local examples, more action on apprenticeships was needed to ensure more young people could access apprenticeships. He highlighted the need to ensure action on functional skills and foundation apprenticeships to ensure some of the most vulnerable young people are able to access apprenticeships as a route into secure, well-paid work.\nAlistair Strathern MP said:\n“We're not going to have the construction skills needed to get Britain growing again from key infrastructure to affordable housing, without action on apprenticeships.\n“I'm lucky to have some fantastic businesses and training providers across my constituency.\n“It's clear speaking to them the true pride they take in the work they do, and the huge pride young people take in the opportunities available to them, but also the greater optimism that they now have for their own futures as a result of these apprenticeships.\n“And that's an optimism I want more people in my constituency to be able to access.”\nEditors Notes\nNow Science and Technology Secretary, Peter Kyle, visited Cadent with Alistair last year. See here.\nNow Education Secretary, Bridget Phillipson, visited Amazing Apprenticeships with Strathern last year. See here.\nYou can see pictures of these visits attached.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_several-bedfordshire-schools-to-be-first-to-receive-landmark-free-breakfast-clubs/content_21.html": "Several Bedfordshire schools to be first to receive landmark free breakfast clubs\n- Alistair Strathern\n- Feb 24\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nMONDAY 21st FEBRUARY 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern MP has celebrated the news that three schools in the Hitchin constituency have been included in the first 750 schools to benefit from the Government’s universal roll out of free breakfast clubs.\nShefford Lower School, Etonbury Academy and Meppershall Church of England Academy will all soon have free breakfast clubs funded as part of the governments new pilot.\nStudies suggest breakfast clubs can put up to £450 a year back in local parents’ pockets, and they significantly boost children’s long-term behaviour, attendance and attainment.\nHaving seen first-hand the benefit of breakfast clubs as a teacher, and then delivered them in schools as a council lead, Mr Strathern has long been a supporter of expanded breakfast club provision.\nFrom as soon as April, these schools will kick-off the historic programme, as part of an early adopter phase set to inform a later national roll out.\nThe scheme also has an important role to play in the Government’s commitment remove the stain of child poverty. Out of the 180,000 children who will benefit from the early adopter schools nationwide, around 67,000 attend schools in deprived areas.\nThe clubs are part of a raft of measures designed to cut the cost of living for families, including the commitment to significantly cut uniform costs through a cap on branded items.\nAlistair Strathern MP said:\n“I am absolutely delighted that Shefford Lower, Etonbury and Meppershall CoE have been selected as one of the first schools to benefit from Labour’s free breakfast clubs.\n“I’ve seen first-hand as a teacher and schools lead the impact these clubs can have on students’ attendance, attainment and wellbeing, all while saving families hundreds every year.\n“I pushed ministers to make sure local schools were part of the early adopter pilot, and I am delighted they’ve listened.\n“Through breakfast clubs, a cap on school uniform, thousands of more teachers, increased SEND provision and billions for school maintenance, we are getting our schools back on track.”\nBridget Phillipson, Secretary of State for Education, said:\n\"Free breakfast clubs sit right at the heart of Labour’s Plan for Change, breaking the link between background and success for families all over the country.\n\"Breakfast clubs can have a transformative impact on the lives of millions of children, feeding hungry tummies and fuelling hungry minds, so every child begins the day ready to learn.\n“Alongside our plans to roll out school-based nurseries and get thousands more children school-ready, this government is delivering the reforms needed to give every child, wherever they grow up, the best start in life.”",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_hitchin-mp-secures-tap-in-and-out-ticketing-for-hitchin-train-station/content_32.html": "Hitchin MP secures tap in and out ticketing for Hitchin train station\n- Alistair Strathern\n- Jan 20\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nMONDAY 20th JANUARY 2024\nFOR IMMEDIATE RELEASE\nAlistair Strathern, MP for the Hitchin constituency, has today welcomed the news that the Labour Government is acting on his call to introduce contactless ticketing at Hitchin station, simplifying train travel for passengers.\nBy the end of 2025, passengers at Hitchin will be able to tap-in using their card at the start of their journey, and tap out at the end, and be guaranteed the best value ticket available on the day.\nThis change was made possible by £20m of government funding put towards modernising the rail network. It will provide tap in, tap out services for 96 stations in 2025, with Hitchin station making the cut following representations from Strathern in Westminster.\nThis key campaign win comes as part of Strathern’s work to improve our local public transport. He has met with the Rail Minister, Thameslink’s CEO and Network Rail in recent months to share and push for key local rail priorities, including action on service reliability and better value fares.\nTap-in, tap-out ticketing is the latest step of the Government’s significant plans to reform the railways, with public ownership of all lines to come in the next few years, alongside automatic delay repay and work to reduce fares.\nAlistair Strathern MP said:\n“It is fantastic news that traveling from Hitchin will be made easier. I’m thrilled to see the Government already making major upgrades to our rail network.\n“As a rural, commuter town, with rail links so vital for countless families and our local economy, this change should reduce delays and save passengers money.\n“I will be continuing to push Thameslink, alongside the Government, to make more progress on acting on Hitchin commuters priorities before our line goes into much-needed public ownership. “\nLord Peter Hendy, Labour’s Rail Minister, said:\n“The ticketing system is far too complicated, so we’re taking the stress out of navigating the labyrinth of fares and replacing it with new technology so passengers can simply tap-in tap-out, while being guaranteed the best fare available at the time on the day.\n“This hassle-free technology will simplify thousands of journeys every day for passengers across the South East, and it’s something we will roll out to other cities as soon as we can.\n“We are delivering the biggest overhaul of our rail network in a generation, putting passengers at the heart of every journey and encouraging more people to choose rail.”",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_mp-invites-local-dads-to-the-pub-to-chat-paternity-leave/content_39.html": "MP invites local dads to the pub to chat paternity leave\n- Alistair Strathern\n- Mar 14\n- 2 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nFRIDAY 14th MARCH 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, MP for the Hitchin constituency, is holding an event at the Vic pub in Hitchin for Dads and expectant-Dads all about paternity leave and fatherhood.\nStrathern’s ‘Paternity and Pints’ event will be on March 27th at the Vic pub on Ickleford Road in Hitchin town centre. Doors will open at 6 30pm, with the event getting under way at 7pm for an 8pm finish.\nDads and expectant Dads can sign up to come along, here.\nThe event marks the anniversary of the introduction of paternity leave, which allows fathers to be around for the crucial first moments of their child’s life.\nHowever, the UK has one of the worst paternity leave offerings in Europe. Strathern’s office has heard stories of constituents burning through savings, being forced to take extended unpaid leave to be around for the key first few months, to relieve some of the burden placed on new mothers.\nStrathern wants to hear Dad’s stories and ideas for how we can make paternity leave finally work for families across the country.\nThe Government is currently reviewing parental leave and is expected to introduce new proposals by the end of the year.\nAlistair Strathern MP said:\n“I am really looking forward to meeting many local Dads in an open space to discuss raising kids, fatherhood and paternity leave.\n“Our paternity offer is not fit for purpose and presents families with a dilemma between what is right for their child, and their finances. We’ve got to do better than that.\n“I want to hear local Dads’ stories and experiences, and what changes they would like to see to paternity leave.\n“I hope Dads across Hitchin and our area can join me for a pint to discuss this really important issue.”\nNotes for Editors\nDads and expectant-Dads can sign up to attend, here.\nStrathern has been campaigning to expand paternity leave since he became an MP. You can see clips of him speaking in Parliament about it, here and here.\nThis event in Hitchin is in partnership with The Dad Shift, an organisation campaigning for better paternity leave.\nYou can see attached a picture of Strathern in a pub.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_post_alistair-strathern-mp-visits-new-shefford-lower-school-breakfast-club/content_2.html": "Alistair Strathern MP visits new Shefford Lower School Breakfast Club\n- Alistair Strathern\n- Apr 25\n- 1 min read\nPRESS RELEASE FROM ALISTAIR STRATHERN MP\nFRIDAY 25th APRIL 2025\nFOR IMMEDIATE RELEASE\nAlistair Strathern, the MP for the Hitchin constituency, visited Shefford Lower School’s new breakfast club to mark the pilot launch of universal breakfast clubs in primary schools.\nThe school is one three local pilots secured for Strathern’s constituency, out of 750 chosen across the country ahead of a universal rollout of breakfast clubs in all primary schools\nShefford Lower School joins Meppershall Church of England Academy and Etonbury Academy in hosting the pilots.\nResearch suggests breakfast clubs boost children’s attainment in school, health and amount of socialising. The clubs are estimated to save parents on average £450 a year.\nThe experience of pilot schools including Shefford Lower will go on to inform the Government’s national roll out for all primary schools.\nAlistair Strathern MP said:\n“It was great to see so many students at Shefford Lower School’s new breakfast club, enjoying healthy food and the company of friends.\n“As a teacher and then children’s services council lead I saw first-hand the impact breakfast clubs could have, so I’m delighted Labour has committed to rolling them out nationally.\n“These breakfast clubs are a fantastic boost for children’s wellbeing, social confidence and academic ability.\n“I was glad to secure three pilots for our constituency, and I look forward to helping to expand this pilot rollout to all primary schools in our area, and across the country at large.”\nNotes for Editors\nYou can see a post from Strathern about his visit here\nYou can see pictures from the visit below.",
  "https_www_alistairstrathern_com/https_www_alistairstrathern_com_my-q-a-events/content_26.html": "top of page\nMy Events: Surgeries and Town Halls\nMeppershall Village Hall\n28th March 2025\n4pm to 5pm\nCrime Surgery, with Beds Police and Crime Commissioner John Tizard\nShefford\nApril 25th 2025\n4 30pm to 6pm\nHitchin Surgery\nMay 2nd 2025\n4pm to 5 30pm\nHitchin Surgery\nMay 9th 2025\n4 30pm to 6pm\nHitchin Surgery\nFriday May 16th\n4 30pm to 6pm\nHenlow Surgery\nFriday 23rd May\nHenlow Pavilion Upstairs\n4pm to 5 30pm\nHitchin Surgery\nFriday 20th June\n4pm to 5 30pm\nHitchin Surgery\nFriday 4th July\nHitchin 5pm to 6 30pm\nMore dates to be announced soon.\nPast Events\nShefford Community Hall\n28th November 2024\n4 30pm - 6pm\nHitchin, 34 Bancroft\n7th December 2024\n9 30am - 10 30am\n(Please email to book an appointment)\nMeppershall Village Hall\n14th December 2024\n9 30am - 10 30am\nHitchin Surgery\n10th January 2025\n4pm - 5 30pm\n(Please email to book an appointment)\nShefford Library Surgery\n16th January 2025\n4 30pm to 6pm\nArlesey Village Hall Surgery\n23rd January 2025\n4 30pm to 6pm\nHitchin Surgery\n31st January 2025\n4 30pm to 6pm\nLangford St Andrews Church Hall Surgery\n6th February 2025\n4pm to 5 30pm\nHitchin Surgery\n17th February 2025\n11am to 12pm\nPreston Village Hall Surgery\n28th February 2025\n4 30pm to 5 30pm\nHitchin Surgery\n6th March 2025\n4pm to 5 30pm\nBreachwood Green Village Hall\n14th March 2025\n4 30pm to 6pm\nHitchin Surgery\n21st March 2025\n5pm to 6 30pm\nShefford Methodist Church\nMy Past Campaign Events\nAs I did when I ran in the by-election last year, and as I have done since becoming an MP, I am holding public Q&A events to hear your concerns and questions.\nThese are fantastic opportunities for me to hear directly from you and to feed back your thoughts into my work for our towns and villages.\nCome along to hear my plans and priorities for our area and to ask me anything!\nDates\nPirton Village Hall\nFriday 28th June 6 30pm\nArlesey Village Hall\nSaturday\n29th June 1pm\nHitchin Walsoworth Road Baptist Church - Upper Hall\nSunday 30th June 2pm\nShefford\nArlesey\nStondon\nMeppershall\nHitchin\nbottom of page"
}