{
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk_news_michelle-meets-canal-and-river-trust/content_7.html": "Recently, I organised and held a productive meeting with Cllr Tamara Reay for Devizes Rural West, Councillor Iain Wallis, Devizes North, Seend Parish Council and the Canal & River Trust to discuss a wide range of issues raised by local residents .\nThank you to Caroline, from the CRT, for giving up your time and for meeting with us.\nWe discussed issues with parking for residents , concerns around continuous cruisers , projects to improve the access from Mayenne Place and the removal of dog waste bins on the Kennet & Avon Canal.",
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk_contact/content_4.html": "Skip to main content\nMain navigation\nHome\nAbout Michelle\nNews\nMy Plan\nLocal Campaigns\nContact\nGet Involved!\nMichelle's Survey\nResidents' Views\nContact\nLeave this field blank\nPO Box 5414, Bradford on Avon, Wiltshire BA15 5DF.\n[email protected]\nMichelle on Facebook\nMichelle on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk_parliament/content_6.html": "Tweet Here, you can find Michelle Donelan's latest speeches and appearances in Parliament (provided by theyworkforyou):\nAI: Regulation | Science, Innovation and Technology | Commons debates In our White Paper on AI regulation we set out our ambitious pro-regulation, pro-innovation framework, outlining five cross-sectoral princip\nTopical Questions | Science, Innovation and Technology | Commons debates I have answered that multiple times. An official alerted me to those concerns.\nTopical Questions | Science, Innovation and Technology | Commons debates We are pro-innovation, but also pro-privacy.\nTopical Questions | Science, Innovation and Technology | Commons debates As the Minister responsible for UK Research and Innovation, I was alerted to a tweet by officials in my Department, which stated, “This is d\nTopical Questions | Science, Innovation and Technology | Commons debates I want the British people to be able to seize the extraordinary opportunities that AI offers, but that can happen only if we address the ri\nOnline Safety Act: Implementation | Science, Innovation and Technology | Commons debates I share the hon. Member’s passion in this area, which is why we put it in the Online Safety Act with regard to the sharing of that content.\nOnline Safety Act: Implementation | Science, Innovation and Technology | Commons debates The Government produced world-leading legislation on online safety, which puts the onus on social media companies, not parents.\nOnline Safety Act: Implementation | Science, Innovation and Technology | Commons debates Ofcom is the independent regulator of the Online Safety Act.\nAI: Regulation | Science, Innovation and Technology | Commons debates Mr Speaker, this is absolute tosh. We have led the world when it comes to AI safety.\nAI: Regulation | Science, Innovation and Technology | Commons debates We want to garnish the opportunities of AI for the British public, which include the comple- mentary aspect that it can pose for jobs, espec",
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk_about-rss/content_5.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk_accessibility/content_9.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk/content_1.html": "I am the Rt Hon Michelle Donelan, former Member of Parliament for over nine years and former Secretary of State for Science, Technology and Innovation, former Secretary of State for the Department of Culture, Media and Sport and an Education Minister for almost three years.\nThroughout my career, I always strived to be a different kind of politician - my priority was being accessible and approachable to help solve local issues.\nOver the past nine years, I held hundreds of surgeries, held stands at all of the village, town and school fetes that I possibly could, plus held stands in supermarkets, so I could help those who would never normally contact their MP.",
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk_map-locations/content_2.html": "My map\nThe Melksham and Devizes Constituency was created in 2024 and includes Bradford on Avon, Melksham, Devizes, Calne South, and the villages in between.\nOur pocket of Wiltshire is a wonderful place to live filled with market towns and pretty villages.\nWe are lucky to have rising employment, falling unemployment, reducing crime and new businesses starting up.\nHowever there is so much more that could be achieved and so much that I want to help improve.",
  "http_michelledonelan_co_uk_/http_michelledonelan_co_uk_residents-views/content_3.html": "What residents think about Michelle:\n“Meeting Michelle gives me confidence that she has local interests at heart when it comes to SME businesses.”\nDan Barfoot, local Devizes business owner\n“Michelle is extremely supportive of our community work here in Bradford on Avon and strives to help us in any way she can.”\nBecky, local resident of Bradford on Avon\n“I’ve never voted Tory before but will always vote for Michelle because of her clear commitment, work ethic and dedication to our community. Michelle has shown time and time again that she can make a difference locally.”\nSteve Plummer, local resident of Melksham\n“Thanks to Michelle's career fair, I discovered my passion for marketing and secured an internship. Her support has been pivotal in shaping my career.”\nEmily, local student\n“Michelle is without a doubt one of the most hard-working and dedicated MPs. She has proved time and time again that she really cares and works tirelessly for all of us. Her true value is in making things happen. Her constant fundraising for local charities is phenomenal and she was instrumental in putting Melksham Free Dining on the map. This changed the lives of many vulnerable residents. She continues to improve the lives for the better and concentrates not only on organisations but individuals- she is there for the person that isn't seen and the person that doesn't have a voice.”\nDeedee, Melksham free Dining and local resident of Bowerhill\n“Michelle stands up for the villages she represents. She has been an active supporter of the Stop Whitley Battery Site campaign. In my personal experience when Michelle says she will do something she follows through.”\nPeter Richardson, local resident of Whitley\n“When she became our MP and I was Chairman of the local Parish Council we had various issues and every time she was always ready to help in anyway possible.\"\nChris Doel, local farmer\n“When life took an unexpected change, Michelle was there for me. She didn't hesitate to lend a helping hand, offering advice and connecting me with the right resources. Thanks to her, I now have a home and better health. I can't thank her enough for her kindness and support.\"\nLinda, local resident from Melksham\n“Michelle has helped with the challenges we have faced over the years and is a strong voice for Melksham. Melksham Town Football Club would like to thank Michelle for her support and advice, wishing her all the best for the future.\"\nDarren Perrin, Director and Chair of Melksham Football Club\n“During a personal situation. I turned to Michelle for help and assistance without hesitation, she generously gave up her time, expertise, and invaluable advice. My wife and I are profoundly grateful for her unwavering support.\"\nLinda, local resident from Melksham\n“Michelle is like a Rotwiler, once she has her teeth into a bit of casework, she does not stop until she gets a result. 10/10 Thoroughly agree that Michelle is excellent.\"\nTerry, from Chippenham\n“Thanks to Michelle Donelan for assisting with solving various problems with my housing association. I wouldn't have received a resolution without her help and I'm very grateful.\"\nBarbara, from Corsham\n“Thanks to Michelle, I secured an internship. Her support has been pivotal in my career.\"\nEmily, local student"
}