{
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_news_lost-boys-call-evidence/content_5.html": "CSJ launches inquiry on the challenges facing young men and boys in the UK\nFollowing my parliamentary defenestration in July 2024, I was absolutely delighted to be appointed to the CSJ as Senior Fellow and excited to be working on the ‘Lost Boys’ project. As a mum and as a former teacher and MP, I am acutely aware of the challenges faces by boys growing up today, particularly those in low-income and fatherless homes. I hope our work can offer some new ideas about how to restore hope and purpose to Britain’s lost boys.\nPlease do take a moment to read a bit about the project, and if you have something to contribute please spare a moment to respond to our call for evidence.\n'Lost Boys'\nEvery day we hear of a new inequality that must be ‘tackled’, another glass ceiling that must be ‘smashed’. Our national preoccupation with fashionable identity politics has had many consequences; crucially, it has hidden from view one large group of people that are genuinely and increasingly disadvantaged. I’m referring, of course, to boys and young men, especially those who are poor.\nThe statistics are stark.\nBoys are falling behind girls in every stage of education, from nursery to university. Boys are twice as likely to be expelled from school. 96% of prisoners are men. Suicide is now the biggest killer of men under 50. Young men earn less than their female peers, and – for the first time since records began – are more likely to be unemployed or economically inactive. Fatherlessness in childhood seems to have a particularly stark impact on the mental health of young men, yet boys are more likely now to own a smartphone than to live with their dad.\nA lot of the concern regarding the impact of technology and social media on the young has focussed on girls, who certainly are suffering with increased rates of anxiety and self-harm. But there has been much less attention paid to the experiences of boys online, which include debilitating gaming addiction and an exposure to violent and extreme pornography from a young age. In schools and in the media there is a tendency to condemn maleness as ‘toxic masculinity’ with boys left wondering if it is even possible to be a ‘good’ man.\nWe have been so focussed on the relative performance of different minority groups – and so careless in our downgrading of the traditional masculine virtues – that we are in danger of leaving a whole generation of boys without hope. Large numbers of disenfranchised young men are always a destructive force in society; the riots over the summer were in large part a reaction to the sharp decline in value and status felt by working class British males.\nWe can fill more column inches about equal opportunities and the gender pay gap. We can scratch our heads about why more girls don’t study physics at A Level and opine about the moral failings of Andrew Tate. But as we do so we are in danger of losing a generation of boys, forgetting that strong and stable societies need strong and confident men. Boys are not born knowing how to harness their natural masculine tendencies for good; they must be taught, trained, encouraged and inspired. When the cultural narrative turns traditional male attributes such as strength and risk-taking from virtue into vice, we should not be surprised when young men struggle to find their place in education, employment and wider society.\nThis crisis in masculinity is already taking its toll. Almost all of the post-pandemic increase in young people who are not in education, employment in training is driven by men – a 40% rise amongst males compared to just 7% for females. Our prisons are bursting, sexual violence exploding. Sectors that are crying out for men – construction, trades, the armed forces – are struggling to recruit. We must step in to rescue a generation of boys and men who are at risk of falling out of society at great cost to themselves and us all.\nThat is why the Centre for Social Justice is launching ‘Lost Boys’, a major new research project that seeks to understand what is going wrong for boys and men.\nToday we have published our call for evidence, giving young men – and those who live and work with them – the chance to express what it’s like growing up male in Britain today. With high profile supporters such as Lawrence Dallaglio and Courtney Laws we will be investigating how boys are impacted by our education system, parental separation, gangs and pornography and what we can do to turn things around.\nAs the mother of two boys I want nothing more than for them to feel hopeful about their lives and to embrace their future role in society as responsible and dependable young men. The mission of The Lost Boys project is to restore the hope that has been lost among boys and young men in Britain today.\nPlease complete and submit the Call for Evidence form on the CSJ website.\n- In education, boy’s outcomes are worse than girls, all the way from nursery to university, and more boys are excluded from school.\n- In criminal justice, men make up 96% of the prison population.\n- In healthcare, men are three-and-a-half times more likely to take their own lives.\n- In employment, men under thirty earn less than their female peers and are more likely to be unemployed.\n- In the family, just over one in ten single parent families is headed by a father, resulting in particularly difficult challenges for boys and their mental health.\nThis article first appeared on the CSJ website | 7 December 2024",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_news_don-valley-line-update/content_9.html": "Prime Minister commits to reopening the Don Valley Line\nI’m delighted that the Prime Minister has today backed my plan to reopen the Don Valley Line between Stocksbridge and Sheffield, and committed to funding it as part of the new “Network North” project to improve transport connectivity. I started campaigning on this subject before I became an MP and have never stopped.\nPrime Minister Rishi Sunak today announced plans to bring back passenger services on the Don Valley Line\nRestoring passenger services on the existing passenger line will be transformative for communities along the route, significantly cutting journey times and reducing congestion.\nImportantly, Network North will also see full electrification and more capacity on the line connecting Sheffield and Manchester, reducing travel time to just 42 minutes between the two cities.\nLocal residents will also welcome the Prime Minister’s announcement of extra money for our bus service and an extension of the Government’s funding for the £2 bus fare cap, which had been due to cease from the end of October.\nPost pandemic, what people want from our transport network has changed dramatically, and so I welcome the decision to redirect money from HS2 to local transport improvements that will make a real difference to people and businesses across the North.\nFar more people will benefit from this plan, and will do so sooner, through earlier investment in upgrades and transport services like local bus and rail services.\nThis is the right decision for people across my constituency and South Yorkshire as a whole.\nTransport investment announced for Yorkshire and the Humber today\nCommunities in towns, cities and rural areas will see improved transport infrastructure far sooner through £19.8 billion reinvested in the North, amongst other things, including:\n- Reopening of the Don Valley Line\n- £3 billion for upgraded and electrified lines between Manchester and Sheffield, Sheffield and Leeds, Sheffield and Hull, and Hull-Leeds.\n- £2 billion for a new station at Bradford and a new connection to Manchester;\n- £2.5 billion to deliver a new mass transit system in West Yorkshire;\n- Nearly £4 billion more funding for local transport in the North’s six city regions.\n- A new £2.5 billion fund for local transport across all areas in the North outside the six city regions – smaller cities, counties, towns and countryside.\n- A new £3.3 billion fund for road resurfacing.\n- Landmark investments in roads, reopened train lines and new stations;\nWe will also invest a further £12 billion to better connect Manchester to Liverpool. This would allow the delivery of Northern Powerhouse Rail as previously planned, including high-speed lines. But we will work with local leaders to agree whether they wish to suggest other ways to achieve the objectives within that cost envelope.",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_miriam-cates/content_7.html": "About Miriam\nMiriam was born and brought up in Sheffield, and for over a decade lived with her husband and three children in Oughtibridge.\nMiriam loves being an active member of her community, previously chairing the school PTA, helping to set up and lead a youth group, and in her role as a Parish Councillor for Oughtibridge campaigned on a number of local issues including; better local transport, more police, better skills and education.\nAs Co-chair of the Stocksbridge Town Deal Board, Miriam worked to secure £24.1 million in funding for Stocksbridge through the Towns Fund.\nThis funding prioritises investments that will attract new businesses and job opportunities which will create a lasting legacy, by re-focussing our economy, upgrading the physical fabric of our town, raising the aspirations of adults and young people and improving the health and wellbeing of our residents.\nMiriam went to King Edward VII School, Sheffield, and then went on to study Natural Sciences at Christ's College, Cambridge, where she earned a degree in genetics. returning to Sheffield to take her Postgraduate Certificate in Education at Sheffield Hallam University, Miriam went on to teach Chemistry and Biology at Tapton School in Sheffield.3\nMore recently Miriam works as a presenter for GBNews and has continued to write on themes of politics and culture, contributing to UnHerd, The Critic and The Telegraph amongst other publications.\nElection History\nGeneral Election\nElected as the Member of Parliament for Penistone and Stocksbridge, December 2019\nNot returned as the Member of Parliament for Penistone and Stocksbridge, July 2024\nLocal | Parish Election\nElected to represent the Oughtibridge Ward on Bradfield Parish Council. May 2015, re-elected May 2019, resigned 2021\nLocal | City Election\nStood for Stannington Ward in the Sheffield City Council election. May 2018 (not elected)\nParliamentary Committees\nEducation Committee 19 October 2021 - 22 January 2024\nEcclesiastical Committee (Joint Committee) 4 March 2020 - 30 May 2024\nWorkers Predictable Terms and Conditions (Bill) 1 March 2024 - 8th March 2024\nBallot Secrecy Bill (HL) - March 2023 - 7 March 2023\nParliamentary Interest Groups - APPGs\nAll-Party Parliamentary Groups (APPGs) are informal cross-party groups that have no official status within Parliament. They are run by and for Members of the Commons and Lords, though many choose to involve individuals and organisations from outside Parliament in their administration and activities.\nSteel and metal related industries - Vice Chair\nTo ensure a fair deal for the UK steel and metal related industries by liaising with and lobbying the government, to raise the profile of cultural, environmental and social issues in the industry and its communities, and to research and develop policies which will promote thriving steel and cast metal industries in the UK\nConception to Age Two - First 1001 Days\nTo promote a holistic approach to the antenatal and post-natal period, specifically with regards to the early years and infant mental health; to hold evidence-based enquiries into best practice for the 1001 critical days to help policymakers make informed decisions on provision in this period; and to uphold cross-party consensus for this age group.\nKinship Care\nTo raise awareness of, and support for, kinship care and kinship carers by amplifying the voices and experiences of children in kinship care and their families. To inform parliamentarians and to promote policy and practice which supports more children to live safely within their family and friends network, when they cannot live with their parents.\nSchool Exclusions and Alternative Provision\nTo improve outcomes for vulnerable children by facilitating upstream working to reduce preventable exclusions and improve the quality of education for children excluded from school.\nMotherhood\nTo discuss issues related to motherhood, including but not limited to pregnancy, parenting, wellbeing, finance, employment, childcare, support services, and childhood; to be a voice for mothers in politics and those who wish to be more involved; and to raise the profile of issues related to motherhood in Parliament.\nParliamentary Internet, Communications and Technology Forum - Vice Chair\nTo further understanding of policy issues affecting the internet, communications and technology sectors between parliamentarians, the industry, consumer groups, academia and other relevant and diverse stakeholders.\nChristians in Parliament\nTo support Christians of all denominations and parties in their work in the Houses of Parliament.\nDigital Skills\nTo provide a forum for parliamentarians, educators and employers to promote the importance of digital skills and to encourage a greater understanding of digital skills for personal, educational and career development.\nPandemic Response and Recovery\nTo provide a forum for politicians, scientists, health professionals, economists, business leaders and other experts; to facilitate broad, balanced and open discussion; to inform a more focussed and flexible approach to government policy; to reach for new solutions in pandemic management which prevent avoidable suffering and loss in the future.\nSmall and Micro Business - Vice Chair\nTo raise awareness of small and micro business issues in Parliament.\nTransport Across the North\nTo promote discussion and investment in all modes of transport across the North of England and to provide better opportunities for MPs representing Northern constituencies to meet with senior officials and receive briefings from Transport for the North.\nYorkshire & Northern Lincolnshire\nTo bring MPs of all parties together with key leaders - those in local government, the private sector and social enterprise - to help maximise future investment in the region for the benefit of all local communities and economies.",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_news_teachers-or-parents/content_10.html": "Teachers or Parents: Who is responsible for raising the next generation?\nI was recently delighted to write the foreword to this important report by Joanna Williams for Civitas, in which Joanna charts the 'mission creep' in UK schools, and if you're interested in what's going on in our schools, I'd encourage you to read it.\nForeword to Teachers or Parents: Who is responsible for raising the next generation?\nThis excellent and timely report articulates why the raising of children has become so highly contested in the United Kingdom.\nIt used to be widely accepted that parents had authority over their children.\nMothers and fathers were responsible for their children’s physical safety, for feeding, clothing, and sheltering their offspring, and raising them with a moral and spiritual foundation according to their own beliefs and traditions. Schools existed to teach children to read, write, and add up, and to impart the skills and knowledge that they would require for adult life.\nAnyone who has set foot in a British secondary school recently will have observed that the remit of our education system has expanded far beyond teaching the ‘three Rs’. From ‘diversity week’, assemblies encouraging climate action, or adverts for the lunchtime LGBTQ+ club, British schools have become increasingly concerned with promoting social action to children.\nAs the report attests, in addition to their academic responsibilities, schools have always played an important role in ‘socialising’ children to prepare them for adult life. We take for granted that through their school experience, children will learn important virtues and ‘soft skills’ such as patience, tolerance, hard work, self-control, and how to work collaboratively with others.\nBut as this report so clearly sets out, over the last decade or two there has been a concerning ‘mission creep’ in many schools: responsibility for socialising children has morphed into a determination to drive social, moral, and even sexual change, often against the wishes and values of parents and the wider public.\nMany parents are concerned that teachers are undermining their right to raise their children as they wish, and teachers feel unsupported in their role by parents.\nThese tensions will be familiar to anyone who has recent experience of education, and this report brilliantly articulates the cause of mutual distrust; namely that the boundaries between parents’ rights and teachers’ responsibility have become blurred. On the one hand, many parents are failing in their responsibilities, with alarming numbers of children starting school without being potty trained, and many are failing to instil in their children the standards of behaviour and respect for others that are necessary for school – and adult – life. On the other hand, many schools are encroaching on the authority of parents, from issuing patronising instructions about what to feed children or when to allow them to walk home from school alone, to serious and shocking instances of schools keeping secrets from parents about what children are being taught, or about their son’s or daughter’s decision to ‘change gender’.\nThis blurring of boundaries between parents and schools is not a minor problem that can be muddled through; it is fundamentally undermining the collective authority of adults in Britain. When teachers tell children that parents who hold traditional views are bigoted, the authority of the parent is weakened.\nWhen parents criticise a child’s teacher in their hearing, the authority of that teacher is weakened. Yet many parents now feel they have no choice but to warn their children that what they are told by their teachers about certain topics may in fact not be true. A whole generation of children is being deprived of the security of being able to trust those who care for them and of the certainty of knowing what is expected of them in adult life.\nIn addition to providing much-needed clarity about what has gone wrong and how, the report offers inspiration for where to go from here. Joanna Williams suggests we must be far clearer about the demarcation of responsibilities between school and home. We need a collective acknowledgement that ‘the primary role of the school is the transmission of knowledge and the primary role of the family is nurturing children, including their moral and spiritual development’.\nThe challenge is going to be to persuade schools – and the government – to let go. To let go of the insistence that children need to be taught about contentious ideas in which schools are not expert and for which there is little evidence of benefit. And, apart from in extreme cases, schools will have to let go of taking responsibility for children whose parents are not fulfilling their duties. If schools continue to allow children to turn up in nappies, parents will continue to send them to school that way. We must understand that when responsibility is taken away from people, people become irresponsible.\nThere will be a period of pain as both parents and schools readjust. But readjust they must, because without the protective shield of collective adult authority, our children are far more vulnerable to both people and ideas that mean them harm.\nAs Joanna Williams writes so compellingly, we don’t want schools and families to be ‘competitors’ or even ‘partners’; rather, parents and teachers should be firm ‘allies’ in the vital task of raising and socialising the next generation.\nFind Joanna on Twitter @jowilliams293",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_news_commercial-surrogacy-why-we-should-care/content_6.html": "The Left should applaud Italy’s surrogacy ban – so why are they so outraged?\nVulnerable women are exploited in commercial surrogacy. Progressives don’t seem to care\nSurrogacy is the practice of asking or paying a woman to carry and give birth to a baby for someone else. It is illegal in almost all European countries. Last week, Giorgia Meloni’s government tightened the rules even further, criminalising Italian citizens who travel abroad to procure babies through surrogacy. Anyone caught breaking the new law may face jail or a fine of up to one million Euros.\nIn countries such as Ukraine, Mexico and Georgia, surrogacy tourism is rife, with rich Western “commissioning parents” paying local women to carry their babies.\nThese surrogate mothers often have few legal protections, and there have been cases of intended parents rejecting infants who are born with disabilities. The physical and psychological dangers to surrogate mothers are significant yet the sums involved make exploitation inevitable.\nSurrogacy carries risks for babies too; few can forget the heart-rending images of rows of abandoned infants in Ukrainian hospitals when international borders were closed during the pandemic.\nThe Italian clampdown is an important step in preventing the exploitation of vulnerable women and children.\nBritish campaigners such as Surrogacy Concern and Stop Surrogacy Now UK have strongly welcomed the move.\nIn Britain, famously a nation of animal lovers, it is illegal to sell a puppy before it is weaned from its mother. It goes without saying that the law should afford human mothers and babies at least the same protection as dogs.\nSo why are many on the political Left – who traditionally are vocal in their opposition to female exploitation – up in arms about Meloni’s surrogacy ban?\nActivists claim that the new Italian law is “inhumane and wicked” because it discriminates against single people and gay and infertile couples for whom surrogacy may be the only route to parenthood. One can only feel the deepest sympathy for those unable to conceive, but the Left’s focus on the “rights” of different adult identity groups is blinding them to grave ethical concerns.\nSome surrogate mothers use their own eggs, so the babies given away are their own flesh and blood. But even women who use donor eggs and are “merely” gestational surrogates are still mothers as far as the baby is concerned.\nInfants are born recognising the sound of their mother’s voice and research suggests that separation can cause lifelong psychological wounds. The cells of a baby can be found in a mother’s brain decades after giving birth. Despite what the pro-surrogacy lobby would have us believe, a surrogate is not just a womb for rent; mothers are not a fungible commodity.\nOf course there are tragic situations where a mother cannot safely care for her own baby and it is therefore better for the child to be looked after by others.\nBut there is no moral equivalence with surrogacy, where a baby is conceived for the express purpose of being removed from his or her mother at birth.\nSurrogacy is often assumed to be the process by which infertile couples in committed relationships can become parents, but there are increasing instances that do not fit that pattern. Once the sacred nature of the mother-infant bond has been devalued, ethical erosion is inevitable.\nThis week it was reported that an American couple who suspected their surrogate mother of drinking alcohol forced her to abort the baby at 20 weeks gestation.\nThose on the Left who support surrogacy need to think carefully about who it is that most deserves their advocacy. Will they continue to defend the “rights” of wealthy adults – be they straight, gay, or single – or will they return to their roots and take a stand against the exploitation of vulnerable women and helpless babies.\nThis article was first published in The Telegraph | 25 October 2024",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_news_category_Local-News/content_8.html": "D-Day 6th June 2024 Miriam Cates - Parliamentary candidate for Penistone and Stocksbridge honours all those who took part in D-Day 80 years ago Local News\nHopper bus service agreed 30th May 2024 Miriam Cates - Parliamentary Candidate for Penistone and Stocksbridge welcomes announcement of a new hopper bus service for Stocksbridge, Deepcar and... Local News\nBroadband for Bolsterstone 21st May 2024 Miriam Cates MP for Penistone and Stocksbridge announces new broadband scheme for Bolsterstone and More Hall Local News\nSilkstone Common boundary review 8th May 2024 Miriam Cates MP writes to Local Government Boundary Commission about Silkstone Common Boundary review expressing concerns about lack of consultation Local News\n£48 million Penistone Line Upgrade 20th November 2023 Miriam Cates MP discusses the £48 million of government funding approved for upgrades to the Penistone Line Local News\nDon Valley Line update 4th October 2023 Miriam Cates MP talks about Prime Minister's decision to bring back passenger services on the Don Valley Line. Local News\nSheffield's unfair tax - CAZ 20th June 2023 Miriam Cates MP talks about why Sheffield's CAZ tax is so unhelpful to local businesses and residents of the Penistone and Stocksbridge constituency Local News\nSouth Yorkshire gets 500 extra police 28th April 2023 Miriam Cates MP welcomes over 500 additional police in South Yorkshire and is keen to support the new South Yorkshire hotspot policing initiative Local News\nWindmill Hill gets rebuild funding 16th December 2022 Miriam Cates MP expresses her delight that Windmill Hill Primary School is set to benefit from the Government's school rebuilding programme. Local News",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_how-i-can-help/content_2.html": "Following dissolution, I am no longer the Member of Parliament for Penistone and Stocksbridge I am the Parliamentary Candidate. I am therefore unable to undertake casework, unless it is of an urgent nature.\nLearn more about the work of MPs here.\nShould you wish to contact me in my capacity as a Parliamentary Candidate you can do so via [email protected]\nTypes of issues that I have helped with\nDuring my tenure as the Member of Parliament for Penistone and Stocksbridge, I, and my team have dealt with tens of thousands of emails covering a very wide range of issues.\nWhere there have been matters which potentially affect national legislation, I have raised these with colleagues, ministers and in debates in the House of Commons and through writing articles in the national press.\nAs an MP I have had no jurisdiction over local council decisions. Issues, such as housing and roads, are primarily the responsibility of local councils for example, but I have been able to raise concerns of residents and highlight particular concerns.",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk/content_1.html": "Lost Boys - a call for evidence 7th December 2024 Read full article Follow me on Twitter Commercial surrogacy - why we should care 23rd October 2024 Read full article Follow me on Instagram Teachers or Parents? 29th September 2024 Read full article Search Search your keywords: Filter by type - Any -CampaignEventNewsPagePerson",
  "https_www_miriamcates_org_uk_/https_www_miriamcates_org_uk_cookies/content_4.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S"
}