{
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_my-work/content_19.html": "My Work Keep up to date withmy latest work here Kate Osborne MP hosts local grassroots club Hebburn Town FC in Parliament to meet with Ministers and Secretary of State.Jarrow and Gateshead East MP Kate Osborne welcomed Hebburn FC’s Stephen Rutherford, Terry Smith and Colin Smith in Parliament to…Read More BBC Politics Northhttps://youtu.be/__VXE6N3IBI In case you missed Sunday’s politics show we discussed Cash, Transport and of course Brexit… The right to use…Read More Kate Osborne MP celebrates Toner Avenue Primary School in Parliament.Kate Osborne MP said: “It was lovely to welcome Headteacher Nichola Fullard and Year 6 teacher Sarah Jones to Parliament…Read More My Statement on WASPI CompensationFor many years, I’ve backed the ‘Waspi women’ and their calls for pension justice. I regularly meet with my local…Read More KATE OSBORNE MP: Together we will eradicate child poverty in the North EastNext week, kids across the country will be heading back to school as the new academic year begins. Whilst they…Read More KATE OSBORNE MP: Pride in the communities showing racists and fascists they are not welcomeOur North East communities have sent a message to the racists and fascists that they are not welcome in the…Read More KATE OSBORNE MP: The extent of disaster created by the Tories is worse than we thoughtIt’s only been three weeks since a new Labour Government was elected and what is overwhelmingly clear is the extent…Read More KATE OSBORNE MP: In the first two weeks Labour has already made a huge differencePeople have been absolutely desperate to get rid of the Tories, desperate for a better society and desperate for change.…Read More KATE OSBORNE: This Government expects us to literally swallow its crapOn Wednesday I asked the Prime Minister a question on the latest scandal from this rotten Government – that of…Read More Full statement on Local Elections 2024Nationally the Conservatives suffered their worst losses in 40 years. Congratulations to Chris Webb the new Labour MP for Blackpool…Read More Monthly Newsletter and Updates ➝ Click here Voting Record ➝ Click here Early Day Motions ➝ Click here",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2025_03/content_3.html": "Jarrow and Gateshead East MP Kate Osborne welcomed Hebburn FC’s Stephen Rutherford, Terry Smith and Colin Smith in Parliament to champion the club and discuss potential Government investment.\n“I’ve done a lot of work with Hebburn Town FC over the years, they have been growing from strength to strength and it was a brilliant day, possibly one of my best in Parliament.\n“I invited Hebburn FC to address the North East All Parliamentary Party Group and whilst they were in Parliament we met with the Secretary of State for Culture Media and Sport Lisa Nandy as well as the Minister for Sport Stephanie Peacock, Minister for Housing and Local Government Alex Norris and the Minister for Small Businesses Gareth Thomas.\n“With such high level meetings we are excited about the opportunities for growth, and investment into Hebburn that our Labour Government brings for the north east, we had a wide ranging discussion from child poverty, to football, to investment in local communities, to small businesses and VAT rates, to public health and the best regional food (Lisa Nandy maintains its pea water from Wigan!)\n“This shows the opportunities a Labour Government brings for the North East. I will continue to champion brilliant local clubs and businesses like Hebburn FC and I can’t wait to work with them even more in the future.\n“Thanks to Stephen, Terry and Colin for all you do within the community and for your ongoing support.\nChief Executive of Hebburn Town FC Stephen Rutherford said: “On behalf of myself, Terry and Colin and the football club I’d like to thank Kate and her staff for being the perfect host at Parliament.\n“We were blown away by the sincerity from all the officials we met and it was heartwarming to gain their support for the work the club contributes to the local town and Borough.\n“Working with our local MP Kate has been an amazing experience to date, to have like minded individuals striving for the best for the local area is wonderful and hopefully together the projects we are driving will create a transformational legacy”",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_12/content_20.html": "For many years, I’ve backed the ‘Waspi women’ and their calls for pension justice. I regularly meet with my local WASPI campaigners both in Jarrow and Gateshead East and in Parliament.\nI have been clear in my position that the ruling of the Ombudsman should be honoured – ignoring the Ombudsman recommendations sets a dangerous precedent and will lead to others arguing they should be able to ignore judgements.\nI am not U-turning on my support for WASPI women.\nI will continue to support the call for compensation for the thousands of women in my constituency and those impacted across the UK.\nEveryone agrees that the DWP handling of these changes left many unprepared and this injustice needs to be put right.\nWhilst I understand the mess the Conservatives have left this country in and the dire financial constraints we are now dealing with because of decades of Tory mismanagement – I do not agree that women should once again be left to bear the brunt of Tory Failures.\nWomen are too often left to pay the price, we are the shock absorbers of poverty.\nOlder women are already more likely to be in poverty in later life – this decision will not help that, it should not have been made.\nI will continue to campaign for justice and for fair compensation.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2025_02/content_25.html": "In case you missed Sunday’s politics show we discussed Cash, Transport and of course Brexit…\nThe right to use cash is a huge issue in my constituency where people rely on cash to budget especially for low income families and where we also have a huge number of people who are digitally excluded.\nAlmost 90% of adults continue to use cash and many of those find it bewildering when finding out that in the UK there is no legal right to ensure their cash is accepted.\nIn my opinion cash is a legal tender and people should have to accept it.\nJust yesterday I received emails about bus services and discussed the impact poor transport connections has on business.\nThe North East has had little to no investment in our transport for decades – as Chair of the NE APPG, transport is the top issue raised.\nWe need investment in our region to start to repair the damage and neglect of the Tory Government and we need to reopen the Leamside Line.\nOn Brexit of course we must be clear, it isn’t working for businesses large and small and it isn’t working for people – what we need is a reset with the relationship to make brexit work.\nI’m pleased the prime minister is looking at ways to remove regulatory barriers to ensure our businesses can grow.\nWe need to remove the technical barriers to boost growth in the North East.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_history-of-the-jarrow-and-gateshead-east-constituency/content_22.html": "History of the Jarrow & Gateshead East constituency\nCreated as a result of the 2023 Periodic Review of Westminster constituencies, Jarrow and Gateshead East was first contested at the 2024 general election and is currently held by Kate Osborne of the Labour Party, who previously held the abolished constituency of Jarrow from 2019 to 2024.\nThe abolished constituency of Jarrow only had five people to serve as MP – ‘Red’ Ellen Wilkinson (1935-1947), Ernest Fernyhough (1947-1979), Don Dixon (1979-1997), Stephen Hepburn (1997-2019), and Kate Osborne, who was elected in December 2019.\nJarrow and Gateshead East constituency consists of part of the metropolitan district of South Tyneside, with wards in Bede, Boldon Colliery, Fellgate and Hedworth, Hebburn North, Hebburn South, Monkton, Primrose, as well as four wards from the adjacent Metropolitan Borough of Gateshead, covering Pelaw and Heworth, Wardley and Leam Lane, Felling and Windy Nook & Whitehills.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2025_01/content_16.html": "Kate Osborne MP said:\n“It was lovely to welcome Headteacher Nichola Fullard and Year 6 teacher Sarah Jones to Parliament from Toner Avenue Primary School which has achieved accreditation with the British Council International School Award.\n“We have so many brilliant schools in the Jarrow and Gateshead East constituency and I am so pleased that they are being recognised for the outstanding work they do. I’ve visited Toner Avenue Primary school on multiple occasions and have consistently been impressed by their excellent facilities and initiatives including Star Of The Week, fully equipped sensory rooms and library, as well as their play provision.\n“This award is a credit to all of the staff and students at Toner Avenue and the hard work they do. I’m glad to have joined Nichola and Sarah today to celebrate this brilliant achievement. Well done to everyone involved!”\nENDS\nNotes:\nThe British Council’s International School Award is a framework for schools to incorporate international elements to their curriculum teaching, preparing young people for work in a global economy by increasing their understanding of other cultures.\nhttps://www.britishcouncil.org/school-resources/accreditation/international-school-award",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_05/content_13.html": "On Wednesday I asked the Prime Minister a question on the latest scandal from this rotten Government – that of s**t coming through our taps.\nThis Government expects us to literally swallow their crap – 14 long years of consecutive Conservative governments have destroyed so much to the extent that in 21st century Britain, our water is no longer safe to drink.\nI asked constituents what they thought I should ask the Prime Minister and the response was overwhelming – from protecting our greenbelt to the crisis in Housing, the NHS, Waspi women, the Post Office Scandal, the Infected Blood Scandal to inflation – the one thing they all have in common – they were crisis caused by the Tories, crisis then ignored by the Tories, crisis made worse by cover-ups and gaslighting from this Government.\nJust hours before he finally called an election he was still attempting to gaslight the country into pretending nothing is wrong.\nAs this paper went to print, Sunak called a General Election for July 4 – and it’s about time too. We need a Labour Government that will fix the mess the Tories have made.\nAs with all the crisis – the water crisis is Tory made, it is the Tories that weakened regulation letting companies stop investing in infrastructure – it was the Tories that let water companies illegally pump raw sewage into our rivers lakes and seas and it is the Tories letting companies raise our bills by up to 91%.\nOf course whatever I asked would have got a response full of bluster and that’s exactly what happened – my question highlighted the problems with dumping untreated sewage in our rivers but also that disgustingly even treated sewage which is continuously discharged into rivers and seas contains faecal matter.\nSo I asked why the Prime Minister is allowing these companies to destroy our waterways and make obscene levels of profit whilst making people ill?”\nThe Prime Minister’s response shows how little he cares about people’s lives – attempting to gaslight people into believing this Government is taking action!\nIt is a disgrace that the Tories allow this environmentally criminal behaviour to continue. Allowing private water bosses to take home 78 billion in dividends – polluting for a profit.\nA Labour Government will bring in automatic fines for sewage dumping and mandatory monitoring of sewage outlets, stopping water bosses’ bonuses until they stop dumping sewage into our waterways.\nIt’s hard to list out who is suffering most from this callous Government – the visuals of pensioners dying in cold homes and children being hungry in school – from cradle to grave our communities are being failed.\nAge UK has reported that there were 2.1 million pensioners living in relative poverty in 2022 – 18% of all pensioners. Your elderly neighbours will be living in poverty.\nAnd, for pensioners living in the private rented sector, it’s even higher with one in three living in poverty.\nOf course for women pensioners the situation is even worse, the WASPI women’s campaign for women born in the 1950s have been campaigning tirelessly for the justice they so rightly deserve.\nYet they are met with empty promises from Ministers in Parliament, as of March 2024, an estimated 270,000 WASPI women have died without getting justice – in fact a WASPI women dies without justice every 13 minutes – this needs to end.\nYet Rishi Sunak still claims to be delivering for pensioners… whilst the Prime Minister, along with his wife, has an estimated net worth of £529million, more than one million pensioners are reported to have no savings at all.\nThe North East, once again, is being hit harder than most with nearly a thousand individuals dying before receiving their state pension in 2022 across Gateshead and South Tyneside local authorities.\nComparatively, there were just five in the City of London.\nThis is a disgusting injustice.\nAnd it isn’t a coincidence, this is the result of the Government’s deliberate negligence and managed decline of the country and particularly the North East.\nA staggering 28.5% of my Jarrow constituents are living in fuel poverty, with many more struggling to meet day-to-day costs.\n6,000 kids in Jarrow were living in food poverty last year – enough kids to fill 200 classrooms.\n7.5 Million people on NHS Waiting lists.\nWe now have some hope with a General Election – a hope for a Labour Government\nA Labour Government that will fix the inequalities that 14 years of Tory Governments have created not just for Jarrow but for the North East and the entire country.\nA Labour Government that will be for working people, for families, for pensioners and for women and equalities.\nA Labour Government that will protect the Pension Triple Lock.\nA Labour Government is what my constituents, and the entire country, need and deserve.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2025_01_20_kate-osborne-mp-celebrates-toner-avenue-primary-school-in-parliament/content_11.html": "Kate Osborne MP said:\n“It was lovely to welcome Headteacher Nichola Fullard and Year 6 teacher Sarah Jones to Parliament from Toner Avenue Primary School which has achieved accreditation with the British Council International School Award.\n“We have so many brilliant schools in the Jarrow and Gateshead East constituency and I am so pleased that they are being recognised for the outstanding work they do. I’ve visited Toner Avenue Primary school on multiple occasions and have consistently been impressed by their excellent facilities and initiatives including Star Of The Week, fully equipped sensory rooms and library, as well as their play provision.\n“This award is a credit to all of the staff and students at Toner Avenue and the hard work they do. I’m glad to have joined Nichola and Sarah today to celebrate this brilliant achievement. Well done to everyone involved!”\nENDS\nNotes:\nThe British Council’s International School Award is a framework for schools to incorporate international elements to their curriculum teaching, preparing young people for work in a global economy by increasing their understanding of other cultures.\nhttps://www.britishcouncil.org/school-resources/accreditation/international-school-award",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_donate/content_21.html": "Donations during a General Election.\nAny donation over £50 must be recorded with either:\n- the donor’s name and address.\nOr\n- if the donor is a company, their registered company number.\nWho can Donate?\nI must only accept donations from a permissible source.\nA permissible source is:\n- an individual registered on a UK electoral register, including overseas electors\n- a Great Britain registered political party\n- a Northern Ireland registered political party (only if you are standing for election in Northern Ireland)\n- most UK registered companies\n- a UK-registered trade union\n- a UK-registered building society\n- a UK-registered limited liability partnership (LLP) that carries on business in the UK\n- a UK-registered friendly society\n- a UK-based unincorporated association that is based in and carries on business or other activities in the UK\nThe rules on these donations are complicated,\nso please get in touch with us for more information if you are unclear.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_contact-me/content_2.html": "Contact Me\nIf you have a general enquiry or one that is relating to casework, parliamentary activity, or an event invite, please use the below contact form. You will receive a response to your enquiry as soon as possible.\nIf your emails are abusive towards me, my staff, or other politicians, you will not receive a reply.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_advice-surgeries/content_15.html": "Advice surgeries\nAdvice surgeries are held regularly across the constituency, but due to security concerns and advice, dates and locations of these sessions are not being advertised publicly.\nTo request an appointment, please email [email protected] or call 0191 4661509 and briefly outline the issue it is you want to discuss.\nAppointments will last no longer than 15 minutes, are only open to residents of the Jarrow constituency and may be with a caseworker.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_help-advice/content_9.html": "How I can help\nYou can email me on [email protected] or call my constituency office on 0191 466 1509 if you are in need of support.\nAs your MP, I can help residents with a range of issues or problems that they may be facing. Alongside my brilliant team, we can help in a range of areas including but not limited to:\n- Welfare benefits\n- Housing\n- Immigration\n- NHS complaints\n- DVLA\n- HMRC complaints\n- Education\n- Employment\n- Support for businesses\nI also may be able to help you if you:\n- Are having problems with a government body\n- Have made a complaint or filed a complaint and want to know how it’s progressing\n- Have been told you aren’t entitled to something, and you disagree\n- Want to make a complaint about a government body to the Parliamentary Ombudsman\n- Need help escalating a local authority issue\nUseful contact information\nSouth Tyneside residents\nSouth Tyneside Council – 0191 427 7000 / [email protected]\nSouth Tyneside Council emergency out of hours number – 0191 455 6111\nSouth Tyneside Homes – 0300 123 6633 / [email protected]\nSouth Tyneside Homes homelessness service – 0300 123 6633 (freephone) or email [email protected]\nCitizens Advice South Tyneside – 0808 2787824 (Adviceline open Mon-Fri from 1.30pm-4.30pm)\nCitizens Advice South Tyneside Debt Hotline number – 07947899163\nSouth Tyneside District Hospital – 0191 404 1000\nBede’s Helping Hands Foodbank – 0191 816 3021\nHebburn Helps – 0191 489 9707\nBoldon Village Hall Community Food Store – 0191 500 1766\nGateshead residents\nGateshead Council – 0191 433 3000 / https://www.gateshead.gov.uk/article/8201/Contact-Gateshead-Council\nGateshead Council Housing – 0191 433 5353 / Contact housing services – Gateshead Council\nGateshead Council homelessness service – 0191 433 3174 / [email protected] / 0191 477 0844 (out of hours support)\nCitizens Advice Gateshead – 0808 278 7902 / Contact Us – Citizens Advice Gateshead\nThe Felling Food Network – The Felling Food Network – Supporting People in Food Poverty\nHousehold emergencies\nElectricity – Northern Powergrid – 105\nGas – Northern Gas Networks – 0800 111 999\nNorthumbrian Water emergency contact number – 0345 717 1100\nOther services\nMIND – 0300 123 3393 (open 9am to 6pm Mon to Fri except bank holidays)\nCALM (Campaign Against Living Miserably) – 0800 58 58 58 (open 5pm until midnight, 365 days a year)\nSamaritans – 116 123 (freephone, open 24/7)\nNational Domestic Abuse Helpline – 0808 2000 247 (free 24 hour helpline for women who have experienced domestic abuse, ran by Refuge)\nMen’s Advice Line – 0808 801 0327 (provides confidential advice and support for men experiencing domestic violence and abuse, open 9am to 8pm except bank holidays)",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2025_02_19_bbc-politics-north/content_5.html": "In case you missed Sunday’s politics show we discussed Cash, Transport and of course Brexit…\nThe right to use cash is a huge issue in my constituency where people rely on cash to budget especially for low income families and where we also have a huge number of people who are digitally excluded.\nAlmost 90% of adults continue to use cash and many of those find it bewildering when finding out that in the UK there is no legal right to ensure their cash is accepted.\nIn my opinion cash is a legal tender and people should have to accept it.\nJust yesterday I received emails about bus services and discussed the impact poor transport connections has on business.\nThe North East has had little to no investment in our transport for decades – as Chair of the NE APPG, transport is the top issue raised.\nWe need investment in our region to start to repair the damage and neglect of the Tory Government and we need to reopen the Leamside Line.\nOn Brexit of course we must be clear, it isn’t working for businesses large and small and it isn’t working for people – what we need is a reset with the relationship to make brexit work.\nI’m pleased the prime minister is looking at ways to remove regulatory barriers to ensure our businesses can grow.\nWe need to remove the technical barriers to boost growth in the North East.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_07_18_kate-osborne-mp-in-the-first-two-weeks-labour-has-already-made-a-huge-difference/content_27.html": "People have been absolutely desperate to get rid of the Tories, desperate for a better society and desperate for change.\nOur new Labour Government has given us all back some hope – yesterday’s King’s Speech with 40 Legislative Bills sets out how we will deliver the change our communities need.\nWe are just two weeks into a Labour Government and the hope for a better future for people in the North East is palpable – from those braving the rain at the Durham Gala, to people at the wonderful Pride Pooches event last Sunday – to the hundreds of people who have already emailed into my office – all eager to see improvements.\nFrom getting a GP or dentist appointment, to housing, to the NHS, to social care, to paying your bills – everyone of us needs to see improvement in our day to day lives.\nThe Durham Miners’ Gala brought us all together to remember the struggles of the past and renew our collective strength to fight for more for the North and it was inspiring to hear speaker after speaker talk about the difference a new deal for workers will bring, to hear the impact Labour’s promise on the Mineworkers’ Pension Scheme will have and the much needed inquiry into Orgreave.\nIn the first two weeks Labour has already made a huge difference, from scrapping the vile Rwanda Scheme to launching our border policy, to meeting with NHS leaders and workers to announcements on schools, and house building – we have really hit the ground running.\nYesterday, we saw the first King’s Speech under a Labour Government since 1950 and it included 40 legislative Bills ranging from housebuilding to green energy to constitutional reform to increasing workers’ rights, better transport and nationalisation of rail, a full ban on so called conversion therapy, plans for renters to abolish no fault evictions, saving the NHS and reforming the Mental Health Act, powers to tackle the water companies, the English Devolution Bill, which will help unlock the power of the North and setting out the plans for the national wealth fund that will transform communities like Jarrow & Gateshead East.\nI am particularly excited about the New Deal for workers – this will make a huge impact to the North East.\nAverage wages are only £16 a week higher in real terms than when the Conservatives came to power in 2010, when you combine that with the cost-of-living crisis, high food bills and energy bills – it is no wonder so many are really struggling.\nLabour’s New Deal for Working people will help rebalance the workplace, it will ban exploitative zero-hours contracts; end fire and rehire; and introduce basic rights from day one to parental leave, sick pay, and protection from unfair dismissal.\nEnergy bills were an issue that kept coming up on the doorsteps, people are struggling and the level of pensioner poverty with our older people living in cold homes is obscene – Labour will now make an immediate impact and a real difference with our Warm Homes Plan to insulate households in fuel poverty, cutting bills and making homes warmer and healthier, with longer term lower energy bills from the cheaper renewable energy and energy independence that GB Energy will bring.\nIn Jarrow and Gateshead East, 7,000 children are growing up in poverty – one of my main priorities of this parliamentary term is to ensure child poverty is eradicated and I am supporting campaigns to scrap the two-child benefit cap.\nThis Labour government will not promise the world with empty rhetoric as the Tories did – we are clearly saying there is so much that needs fixing it will take us time. But we are offering hope, honesty and a plan to deliver the change our country needs.\nWe will grow the economy, we will cut NHS waiting times, we will launch a new Border Security Command, we will deliver better transport, more jobs, we will set up GB Energy to slash your bills and we will also help to create wealth in every community and hand the power back to local leaders.\nThere is so much to be hopeful about and so much that we can change – I want to also take this opportunity to thank everyone in Jarrow and Gateshead East that voted for me two weeks ago today.\nI understand people’s anger at the last government translating into protest votes – but as I said on the BBC last week we need to resist attempts by politicians to turn our anger into hate for others – bigotry and hatred is not the way forward.\nI hope that our Labour Government will transform people’s lives and if you did not vote for me this time, I promise to serve you during our project of national renewal all the same.\nAs your MP, I will always be accessible and present in the communities I serve – you can email me on [email protected]",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_05_03_full-statement-on-local-elections-2024/content_18.html": "Nationally the Conservatives suffered their worst losses in 40 years. Congratulations to Chris Webb the new Labour MP for Blackpool South who won with a huge swing to Labour – as Keir Starmer said this win is a message directly to Rishi Sunak to call a General Election.\nLocally though we must be concerned at the size and scale of the losses we had at South Tyneside Council.\nLosing ten seats when nationally Labour is winning the fight to change our country for the better is very worrying.\nAny good that South Tyneside Council is doing is overshadowed by their failure to resolve the dispute with the bin workers and despite my successful intervention to broker a last minute deal to suspend the action, the damage was done over the last few months. This dispute should have been resolved much sooner and I hope that the talks now progress and there’s no need for the workers to resume their action.\nThe local factors around the greenbelt and previous administration came up on the doorstep and frequently at my regular campaigning sessions and in my constituency casework.\nI hope the Labour Councillors in South Tyneside Labour Group take last night’s results very seriously and take action to change what is needed.\nTogether South Tyneside Labour Group and our constituency Labour Party’s must work jointly to ensure we regain people’s trust and deliver for residents.\nCommiserations to those that lost and congratulations to all those that won locally and nationally.\nParticularly pleased to see Labour returned in the ward where I live.\nAs always I will not shy away from representing my constituents and demanding better from the Tories nationally and from Council’s locally.\nI look forward to continuing to deliver for my constituents and to kicking the Conservatives out at the General Election and I hope that Election comes very very soon.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_07/content_26.html": "People have been absolutely desperate to get rid of the Tories, desperate for a better society and desperate for change.\nOur new Labour Government has given us all back some hope – yesterday’s King’s Speech with 40 Legislative Bills sets out how we will deliver the change our communities need.\nWe are just two weeks into a Labour Government and the hope for a better future for people in the North East is palpable – from those braving the rain at the Durham Gala, to people at the wonderful Pride Pooches event last Sunday – to the hundreds of people who have already emailed into my office – all eager to see improvements.\nFrom getting a GP or dentist appointment, to housing, to the NHS, to social care, to paying your bills – everyone of us needs to see improvement in our day to day lives.\nThe Durham Miners’ Gala brought us all together to remember the struggles of the past and renew our collective strength to fight for more for the North and it was inspiring to hear speaker after speaker talk about the difference a new deal for workers will bring, to hear the impact Labour’s promise on the Mineworkers’ Pension Scheme will have and the much needed inquiry into Orgreave.\nIn the first two weeks Labour has already made a huge difference, from scrapping the vile Rwanda Scheme to launching our border policy, to meeting with NHS leaders and workers to announcements on schools, and house building – we have really hit the ground running.\nYesterday, we saw the first King’s Speech under a Labour Government since 1950 and it included 40 legislative Bills ranging from housebuilding to green energy to constitutional reform to increasing workers’ rights, better transport and nationalisation of rail, a full ban on so called conversion therapy, plans for renters to abolish no fault evictions, saving the NHS and reforming the Mental Health Act, powers to tackle the water companies, the English Devolution Bill, which will help unlock the power of the North and setting out the plans for the national wealth fund that will transform communities like Jarrow & Gateshead East.\nI am particularly excited about the New Deal for workers – this will make a huge impact to the North East.\nAverage wages are only £16 a week higher in real terms than when the Conservatives came to power in 2010, when you combine that with the cost-of-living crisis, high food bills and energy bills – it is no wonder so many are really struggling.\nLabour’s New Deal for Working people will help rebalance the workplace, it will ban exploitative zero-hours contracts; end fire and rehire; and introduce basic rights from day one to parental leave, sick pay, and protection from unfair dismissal.\nEnergy bills were an issue that kept coming up on the doorsteps, people are struggling and the level of pensioner poverty with our older people living in cold homes is obscene – Labour will now make an immediate impact and a real difference with our Warm Homes Plan to insulate households in fuel poverty, cutting bills and making homes warmer and healthier, with longer term lower energy bills from the cheaper renewable energy and energy independence that GB Energy will bring.\nIn Jarrow and Gateshead East, 7,000 children are growing up in poverty – one of my main priorities of this parliamentary term is to ensure child poverty is eradicated and I am supporting campaigns to scrap the two-child benefit cap.\nThis Labour government will not promise the world with empty rhetoric as the Tories did – we are clearly saying there is so much that needs fixing it will take us time. But we are offering hope, honesty and a plan to deliver the change our country needs.\nWe will grow the economy, we will cut NHS waiting times, we will launch a new Border Security Command, we will deliver better transport, more jobs, we will set up GB Energy to slash your bills and we will also help to create wealth in every community and hand the power back to local leaders.\nThere is so much to be hopeful about and so much that we can change – I want to also take this opportunity to thank everyone in Jarrow and Gateshead East that voted for me two weeks ago today.\nI understand people’s anger at the last government translating into protest votes – but as I said on the BBC last week we need to resist attempts by politicians to turn our anger into hate for others – bigotry and hatred is not the way forward.\nI hope that our Labour Government will transform people’s lives and if you did not vote for me this time, I promise to serve you during our project of national renewal all the same.\nAs your MP, I will always be accessible and present in the communities I serve – you can email me on [email protected]",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_05_23_kate-osborne-mp-this-government-expects-us-to-literally-swallow-its-crap/content_4.html": "On Wednesday I asked the Prime Minister a question on the latest scandal from this rotten Government – that of s**t coming through our taps.\nThis Government expects us to literally swallow their crap – 14 long years of consecutive Conservative governments have destroyed so much to the extent that in 21st century Britain, our water is no longer safe to drink.\nI asked constituents what they thought I should ask the Prime Minister and the response was overwhelming – from protecting our greenbelt to the crisis in Housing, the NHS, Waspi women, the Post Office Scandal, the Infected Blood Scandal to inflation – the one thing they all have in common – they were crisis caused by the Tories, crisis then ignored by the Tories, crisis made worse by cover-ups and gaslighting from this Government.\nJust hours before he finally called an election he was still attempting to gaslight the country into pretending nothing is wrong.\nAs this paper went to print, Sunak called a General Election for July 4 – and it’s about time too. We need a Labour Government that will fix the mess the Tories have made.\nAs with all the crisis – the water crisis is Tory made, it is the Tories that weakened regulation letting companies stop investing in infrastructure – it was the Tories that let water companies illegally pump raw sewage into our rivers lakes and seas and it is the Tories letting companies raise our bills by up to 91%.\nOf course whatever I asked would have got a response full of bluster and that’s exactly what happened – my question highlighted the problems with dumping untreated sewage in our rivers but also that disgustingly even treated sewage which is continuously discharged into rivers and seas contains faecal matter.\nSo I asked why the Prime Minister is allowing these companies to destroy our waterways and make obscene levels of profit whilst making people ill?”\nThe Prime Minister’s response shows how little he cares about people’s lives – attempting to gaslight people into believing this Government is taking action!\nIt is a disgrace that the Tories allow this environmentally criminal behaviour to continue. Allowing private water bosses to take home 78 billion in dividends – polluting for a profit.\nA Labour Government will bring in automatic fines for sewage dumping and mandatory monitoring of sewage outlets, stopping water bosses’ bonuses until they stop dumping sewage into our waterways.\nIt’s hard to list out who is suffering most from this callous Government – the visuals of pensioners dying in cold homes and children being hungry in school – from cradle to grave our communities are being failed.\nAge UK has reported that there were 2.1 million pensioners living in relative poverty in 2022 – 18% of all pensioners. Your elderly neighbours will be living in poverty.\nAnd, for pensioners living in the private rented sector, it’s even higher with one in three living in poverty.\nOf course for women pensioners the situation is even worse, the WASPI women’s campaign for women born in the 1950s have been campaigning tirelessly for the justice they so rightly deserve.\nYet they are met with empty promises from Ministers in Parliament, as of March 2024, an estimated 270,000 WASPI women have died without getting justice – in fact a WASPI women dies without justice every 13 minutes – this needs to end.\nYet Rishi Sunak still claims to be delivering for pensioners… whilst the Prime Minister, along with his wife, has an estimated net worth of £529million, more than one million pensioners are reported to have no savings at all.\nThe North East, once again, is being hit harder than most with nearly a thousand individuals dying before receiving their state pension in 2022 across Gateshead and South Tyneside local authorities.\nComparatively, there were just five in the City of London.\nThis is a disgusting injustice.\nAnd it isn’t a coincidence, this is the result of the Government’s deliberate negligence and managed decline of the country and particularly the North East.\nA staggering 28.5% of my Jarrow constituents are living in fuel poverty, with many more struggling to meet day-to-day costs.\n6,000 kids in Jarrow were living in food poverty last year – enough kids to fill 200 classrooms.\n7.5 Million people on NHS Waiting lists.\nWe now have some hope with a General Election – a hope for a Labour Government\nA Labour Government that will fix the inequalities that 14 years of Tory Governments have created not just for Jarrow but for the North East and the entire country.\nA Labour Government that will be for working people, for families, for pensioners and for women and equalities.\nA Labour Government that will protect the Pension Triple Lock.\nA Labour Government is what my constituents, and the entire country, need and deserve.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_about-me/content_10.html": "About me:\nI’ve lived in the North East for 35 years and before first entering Parliament in 2019. I worked for Royal Mail for 25 years and in this time I was also a trade union rep.\nWorkers rights remain hugely important to me and I am proud to be in a position now, as MP, that allows me to hold the Government to account – demanding Ministers provide more support to workers.\nI have been an active Member of the Labour Party for many years, before my election as MP I was elected to represent Preston Ward at the 2010 local elections, gaining the seat from the Conservative incumbent. I was then re-elected in 2014 and 2018.\nI have also served on the Labour Party National Constitutional committee and was also Chair of Unite’s Regional Labour Party Liaison Committee and on the Northern TUC Executive Committee.\nI have always, and will always be, a strong trade unionist – I firmly believe in trade union and socialist values. I am also an active member of the Socialist Campaign Group of MPs in Parliament.\nSince my election to Parliament, I have worked hard on behalf of Jarrow and Gateshead East constituents and held several positions. I have served consistently on the Women and Equalities Select Committee (WEC) and in my first term was an active member of the Backbench Business Committee.\nIn my position on the Women and Equalities Select Committee I have contributed to enquiries on a vast range of important topics such as: Reform of the Gender Recognition Act, Menopause and the workplace, Sexism and Inequality in Football and Equality and the UK asylum process. You can find out more about the work the WEC does here.\nI keep constituents updated about my work regularly via my social media channels and through monthly newsletters. If you would like to subscribe to my mailing list to receive regular updates about my work and campaigns – you can register here!",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_12_18_my-statement-on-waspi-compensation/content_12.html": "For many years, I’ve backed the ‘Waspi women’ and their calls for pension justice. I regularly meet with my local WASPI campaigners both in Jarrow and Gateshead East and in Parliament.\nI have been clear in my position that the ruling of the Ombudsman should be honoured – ignoring the Ombudsman recommendations sets a dangerous precedent and will lead to others arguing they should be able to ignore judgements.\nI am not U-turning on my support for WASPI women.\nI will continue to support the call for compensation for the thousands of women in my constituency and those impacted across the UK.\nEveryone agrees that the DWP handling of these changes left many unprepared and this injustice needs to be put right.\nWhilst I understand the mess the Conservatives have left this country in and the dire financial constraints we are now dealing with because of decades of Tory mismanagement – I do not agree that women should once again be left to bear the brunt of Tory Failures.\nWomen are too often left to pay the price, we are the shock absorbers of poverty.\nOlder women are already more likely to be in poverty in later life – this decision will not help that, it should not have been made.\nI will continue to campaign for justice and for fair compensation.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk/content_1.html": "Kate Osborne MP hosts local grassroots club Hebburn Town FC in Parliament to meet with Ministers and Secretary of State.\nJarrow and Gateshead East MP Kate Osborne welcomed Hebburn FC’s Stephen Rutherford, Terry Smith and Colin Smith in Parliament to champion the club and discuss potential Government investment. “I’ve done",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_08_29_kate-osborne-mp-together-we-will-eradicate-child-poverty-in-the-north-east/content_23.html": "Next week, kids across the country will be heading back to school as the new academic year begins.\nWhilst they are excited to see their friends in the school playground, parents and carers are faced with the rising cost of school uniforms and other necessities.\nAlmost a third of children in the North East region live in poverty, with around 118,000 in the North East Combined Authority area alone, the cost of school uniform and supplies stretch family budgets even further, and threaten the education of children living in the North East.\nSchools have a duty to provide a level playing ground for all students, from all backgrounds, and it is distressing to be receiving messages from concerned parents in the constituency who are finding it increasingly hard to meet the rising costs of school uniforms.\nThe stricter uniform policies I have been contacted about recently enforce ‘essential’ branding, inevitably raising the costs and limiting the number, and availability, of stores that uniforms can be bought from. This is outrageous and I have contacted schools about this every year since becoming an MP and will continue to do so.\nUniforms are supposed to act as a social leveller – an equaliser – and should be affordable and accessible for all of their students. Instead, excessive cost and tightening rules around what is required are holding families back and pushing some even deeper into poverty.\nNamed brands with school logos and preferred providers of clothing are unnecessary and strict rules around this just punish the poorest of pupils, who already face greater financial barriers and add to back-to-school anxiety.\nOne parent who got in touch recently told me that unless their child is wearing a shirt with the school’s branding on, they are unable to take their jumper off – completely harsh and unacceptable\nThis poses an obvious concern to the safety and wellbeing of children unable to afford the branded shirts, if they become too warm and are unable to take a layer off.\nIt is disgusting that it has gotten to this point.\nSchools must ensure that they are spaces where children can go to learn without paying extortionate costs to simply attend their lessons.\nMany of our local food banks already offer so much support to the most vulnerable across our community – and in recent years they have stepped up to try to bridge the gap in rising uniform costs, with many now offering uniform swaps to help families prepare for new school years without breaking the bank unnecessarily.\nThis is brilliant of them – but they should not have to do it.\nNo student, no child, and no family should be left behind when it comes to education, particularly those in the North East.\nThis summer, over 31% of pupils in London and the South East achieved an A or A* in their subjects compared to just 24.6% in the North.\nIn the North East, the result of A and A* grades were even lower, at 23.9%.\nThe North/South divide now lies at 6.5%, a considerable increase from pre-pandemic levels and yet more evidence of the North being starved of investment and our communities being left behind.\nOur region suffered fourteen years of neglect, and our children faced the brunt of it. But our new Labour Government will deliver the change the North East deserves to see, and our Mayor of the North East is already demonstrating this.\nKim Mcguinness, our North East Mayor, announced this week that she will establish a Child Poverty Reduction Unit, which will develop and drive a region-wide strategy.\nThe first priority of the unit will be to develop the Childcare Grant, which would help parents find or return to work and keep more of their earnings and work with the wider childcare system to develop the most effective way of tackling child poverty.\nEvery child deserves access to every opportunity and together we will eradicate child poverty in the North East.\nOur Labour Government has a mountain to climb, but will work harder than ever to ensure that our children’s education is protected and accessible for all students.\nI will continue to work hard with our new Government to deliver for the children of this region, the children who were cheated out of months of education during the Covid-19 pandemic, and tossed aside by previous Tory Governments.\nIf anyone is having issues with the costs of uniforms or anything else please do get in contact with my office to see what I can do to help [email protected]",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2025_03_26_kate-osborne-mp-hosts-local-grassroots-club-hebburn-town-fc-in-parliament-to-meet-with-ministers-and-secretary-of-state/content_7.html": "Jarrow and Gateshead East MP Kate Osborne welcomed Hebburn FC’s Stephen Rutherford, Terry Smith and Colin Smith in Parliament to champion the club and discuss potential Government investment.\n“I’ve done a lot of work with Hebburn Town FC over the years, they have been growing from strength to strength and it was a brilliant day, possibly one of my best in Parliament.\n“I invited Hebburn FC to address the North East All Parliamentary Party Group and whilst they were in Parliament we met with the Secretary of State for Culture Media and Sport Lisa Nandy as well as the Minister for Sport Stephanie Peacock, Minister for Housing and Local Government Alex Norris and the Minister for Small Businesses Gareth Thomas.\n“With such high level meetings we are excited about the opportunities for growth, and investment into Hebburn that our Labour Government brings for the north east, we had a wide ranging discussion from child poverty, to football, to investment in local communities, to small businesses and VAT rates, to public health and the best regional food (Lisa Nandy maintains its pea water from Wigan!)\n“This shows the opportunities a Labour Government brings for the North East. I will continue to champion brilliant local clubs and businesses like Hebburn FC and I can’t wait to work with them even more in the future.\n“Thanks to Stephen, Terry and Colin for all you do within the community and for your ongoing support.\nChief Executive of Hebburn Town FC Stephen Rutherford said: “On behalf of myself, Terry and Colin and the football club I’d like to thank Kate and her staff for being the perfect host at Parliament.\n“We were blown away by the sincerity from all the officials we met and it was heartwarming to gain their support for the work the club contributes to the local town and Borough.\n“Working with our local MP Kate has been an amazing experience to date, to have like minded individuals striving for the best for the local area is wonderful and hopefully together the projects we are driving will create a transformational legacy”",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_mailing-list/content_28.html": "Subscribe to Kate's mailing list to receive regular updates of her work in Parliament and around the Jarrow and Gateshead East constituency. First Name Surname Address Line 1 Your postcode Ward BedeBoldon Colliery Cleadon and East Boldon Fellgate and HedworthHebburn North Hebburn SouthMonktonPrimrosePelaw and Heworth Wardley and Leam Lane Email Address I am happy for my data to be processed in line with current data protection legislation. Subscribe Privacy Notice Keep up to date with Kate’s work by reading her monthly newsletters:2023 Newsletter PDFs:January 2023 Monthly NewsletterKate Osborne MP February 2023 NewsletterKate Osborne MP March 2023 Monthly NewsletterKate Osborne MP April 2023 NewsletterKate Osborne MP May 2023 NewsletterKate Osborne MP June 2023 NewsletterKate Osborne MP July 2023 Monthly Newsletter2022 Newsletter PDFs:January Newsletter 2022 – Kate Osborne MPKate Osborne February 2022 NewsletterKate Osborne MP March 2022 NewsletterKate Osborne MP April 2022 NewsletterKate Osborne MP May 2022 NewsletterKate Osborne MP June 2022 NewsletterKate Osborne MP July 2022 Monthly NewsletterKate Osborne MP August 2022 NewsletterKate Osborne MP September 2022 NewsletterKate Osborne MP October 2022 NewsletterKate Osborne MP November 2022 NewsletterKate Osborne MP December 2022 Newsletter2021 Newsletter PDFs: Kate-Osborne-MP-March-April-2021-NewsletterKate-Osborne-MP-April-May-2021-NewsletterKate-Osborne-MP-May-June-2021-NewsletterKate Osborne MP June July 2021 NewsletterKate Osborne MP July – August Newsletter Kate Osborne MP August-September 2021 NewsletterKate Osborne MP Newsletter September-October 2021Kate Osborne MP October-November Newsletter 2021Kate Osborne MP November-December 2021 Newsletter",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_08/content_14.html": "Next week, kids across the country will be heading back to school as the new academic year begins.\nWhilst they are excited to see their friends in the school playground, parents and carers are faced with the rising cost of school uniforms and other necessities.\nAlmost a third of children in the North East region live in poverty, with around 118,000 in the North East Combined Authority area alone, the cost of school uniform and supplies stretch family budgets even further, and threaten the education of children living in the North East.\nSchools have a duty to provide a level playing ground for all students, from all backgrounds, and it is distressing to be receiving messages from concerned parents in the constituency who are finding it increasingly hard to meet the rising costs of school uniforms.\nThe stricter uniform policies I have been contacted about recently enforce ‘essential’ branding, inevitably raising the costs and limiting the number, and availability, of stores that uniforms can be bought from. This is outrageous and I have contacted schools about this every year since becoming an MP and will continue to do so.\nUniforms are supposed to act as a social leveller – an equaliser – and should be affordable and accessible for all of their students. Instead, excessive cost and tightening rules around what is required are holding families back and pushing some even deeper into poverty.\nNamed brands with school logos and preferred providers of clothing are unnecessary and strict rules around this just punish the poorest of pupils, who already face greater financial barriers and add to back-to-school anxiety.\nOne parent who got in touch recently told me that unless their child is wearing a shirt with the school’s branding on, they are unable to take their jumper off – completely harsh and unacceptable\nThis poses an obvious concern to the safety and wellbeing of children unable to afford the branded shirts, if they become too warm and are unable to take a layer off.\nIt is disgusting that it has gotten to this point.\nSchools must ensure that they are spaces where children can go to learn without paying extortionate costs to simply attend their lessons.\nMany of our local food banks already offer so much support to the most vulnerable across our community – and in recent years they have stepped up to try to bridge the gap in rising uniform costs, with many now offering uniform swaps to help families prepare for new school years without breaking the bank unnecessarily.\nThis is brilliant of them – but they should not have to do it.\nNo student, no child, and no family should be left behind when it comes to education, particularly those in the North East.\nThis summer, over 31% of pupils in London and the South East achieved an A or A* in their subjects compared to just 24.6% in the North.\nIn the North East, the result of A and A* grades were even lower, at 23.9%.\nThe North/South divide now lies at 6.5%, a considerable increase from pre-pandemic levels and yet more evidence of the North being starved of investment and our communities being left behind.\nOur region suffered fourteen years of neglect, and our children faced the brunt of it. But our new Labour Government will deliver the change the North East deserves to see, and our Mayor of the North East is already demonstrating this.\nKim Mcguinness, our North East Mayor, announced this week that she will establish a Child Poverty Reduction Unit, which will develop and drive a region-wide strategy.\nThe first priority of the unit will be to develop the Childcare Grant, which would help parents find or return to work and keep more of their earnings and work with the wider childcare system to develop the most effective way of tackling child poverty.\nEvery child deserves access to every opportunity and together we will eradicate child poverty in the North East.\nOur Labour Government has a mountain to climb, but will work harder than ever to ensure that our children’s education is protected and accessible for all students.\nI will continue to work hard with our new Government to deliver for the children of this region, the children who were cheated out of months of education during the Covid-19 pandemic, and tossed aside by previous Tory Governments.\nIf anyone is having issues with the costs of uniforms or anything else please do get in contact with my office to see what I can do to help [email protected]",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_donation-policy/content_24.html": "Donation Policy\nDonation policy\nDonations given through this website are regulated by the Political Parties, Elections and Referendum Act 2000 and taken in compliance with the Code of Conduct and the Guide to the Rules relating to the conduct of Members (as approved by the United Kingdom House of Commons).\nDonations made using this website are only for individuals. If you wish to donate on behalf of an organisation, please email us at [email protected]\nTo donate to us, we require certain information from you so that we can perform checks where we are legally required. If you donate to us, you acknowledge and agree that (i) the donation is from your own funds, (ii) any donation over the value of £500 must be checked by us to make sure that your name is registered on a UK electoral register (including overseas electors) and you consent to us conducting those checks; and (iii) any donation over the value of £1,500 will result in your name and the amount of your donation being made public on the website of the UK Parliament’s Register of Members’ Financial Interests.\nDonations should be from an individual’s own funds and may not be passed on from a third party. It is an offence not to reveal the true source of a donation. Please note that donations are not tax-deductible.\nWe may need to contact you to verify your information as a donor and we will keep records of all donations.\nUpdated 18/10/2022",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_08_15_kate-osborne-mp-pride-in-the-communities-showing-racists-and-fascists-they-are-not-welcome/content_8.html": "Our North East communities have sent a message to the racists and fascists that they are not welcome in the UK.\nThere is no excuse for the violence and hatred we saw in Sunderland and elsewhere over the last few weeks, those purporting to riot in the name of Bede, Alice and Elsie should be ashamed of themselves.\nOf course for some, it was just an excuse for violence and looting, I’m pleased to see Northumbria Police take a clear lead with prosecutions already taking place and increased numbers of uniformed officers out and about in our communities.\nIt is disturbing to see young kids on the streets chanting racist slogans, calling people names, and worrying that some parents think it’s OK to indoctrinate their kids this way. We have seen reports of a 13-year-old girl being charged this week for threatening unlawful violence.\nThese are not legitimate protests, it’s far right thuggery, with people making Nazi salutes and attacking the police. Children should be protected from this, not exposed to it, taken to riot, to commit violence and neglected by exposing them to the risk of being injured and harmed themselves by other rioters.\nWe must be clear that when some politicians have used hateful language against migrants, Muslims and LGBTQ+ communities, it has a huge impact in othering people and dividing communities – this has been happening for decades now and too many people are taken in by this hatred and fall for the divide and rule tactics.\nDecades of cuts to services, falling living standards and a cost of living crisis has left people desperate and angry – and the far right and some mainstream politicians exploit that anger driving people to hate.\nWe see a rise in far-right populism across Europe using this playbook.\nYet what is inspiring is the fight back against this hope and despair – it has been heartening to see so many come together in unity against this far right aggression, with thousands gathering peacefully in Newcastle, with chants and signs all showing the real communities across the North East.\nWorkers of all races, religions and sexual orientation have more in common than those who seek to exploit us.\nI’m proud of our North East communities and of everyone across the country who has stood up to racism, islamophobia and division – as one of the signs in Newcastle said Divvent be racist, fascists gan hyem.",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_privacy-notice/content_6.html": "Privacy Policy\nAs the MP for the Jarrow constituency, my staff and I keep in touch with constituents about my work, take up casework on their behalf and ask for views on issues.\nThis policy explains how I collect and use personal data, and the legal basis for doing so. As the holder of that data, I am called the Data Controller. You can also find here an explanation of your rights in relation to that data. My responsible staff member for data protection can be contacted at [email protected] or by writing to Kate Osborne MP, The Clervaux Exchange, Clervaux Terrace, Jarrow, NE32 5UP.\nAs a Labour MP, I also have access to other information which I or my office, or volunteers working with me, may use for campaigning purposes or for communicating with Labour Party members. The Data Controller for that information is the Labour Party whose privacy policy can be located here: (https://labour.org.uk/privacy-policy/)\nData collection and use\nThe office of Kate Osborne MP will only collect and use personal information for the specific purpose for which it has been obtained.\nPolicy inquiries and casework (personal problems) enquiries bring with them information provided by the constituent and/or on behalf of the constituent. I will only share such information with a third party organisation where this is necessary and reasonable to do so, and therein, that would be only the amount of information deemed necessary to ensure the query is handled efficiently. The data processing is for performing tasks in the public interest or in the exercise of official authority.\nPlease see the “who I share your information with” section for further details.\nIf you register with my website, complete a form on my website or complete a form or survey sent to you by my office, you may be asked for personal information. In each case, I will seek your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, or phone about my work and give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting the responsible officer for data protection.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with:\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my office for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the Jarrow MP, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will be retained for a maximum of two years unless the casework matter is still ongoing. In such circumstances, personal data shall only be retained for as long as is necessary to resolve the request. I may delete information that I consider repetitive in order to hold minimal personal data.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Jarrow, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nMy website does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites:\nThis website may contain links to other websites, or embedded content from other websites. I am not responsible for the content or privacy practices of these websites.\nThis website may include links to third party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\nYour rights:\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n- Obtain copies of the personal information I hold about you (known as a “subject access request”)\n- Request that personal information you have given your consent for me to use, and that I still hold, is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\n- Request that I correct or update any personal information held about you\n- Ask that we erase or restrict the way in which I use your information\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact the responsible officer for data protection:\nAddress: Kate Osborne MP, The Clervaux Exchange, Clervaux Terrace, Jarrow, NE32 5UP.\nEmail: [email protected]\nTelephone: 0191 466 1509\nAlternatively you have the right to raise any issues or concerns directly with the Information Commissioner’s Office, at Wycliffe House, Water Lane, Wilmslow, Cheshire, SK9 5AF or www.ico.org.uk\nChanges to Privacy Policy:\nWe keep our privacy policy under regular review (at least on an annual basis) and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website and we encourage you to regularly check back for any updates about how your data is used.\nUPDATED 6th January 2022",
  "https_kate-osborne_co_uk_/https_kate-osborne_co_uk_2024_08_01_kate-osborne-mp-the-extent-of-disaster-created-by-the-tories-is-worse-than-we-thought/content_17.html": "It’s only been three weeks since a new Labour Government was elected and what is overwhelmingly clear is the extent of disaster created by the Tories is worse than we thought.\nOur new Government has inherited a £20 billion black hole in its accounts created by the Tories’ fiscal mismanagement. We will not be able to fix everything overnight but we have made a start and there has already been many positive changes to deliver the change that the people of this country have been crying out for.\nThis week I voted for our first piece of legislation, The Passenger Railway Service (Public Ownership) Bill, our first step towards nationalisation.\nAfter decades of failures from privatisation and incompetence our railways are broken, the reform of our railways is an issue that I am extremely passionate about, transport in the North is regularly raised by businesses and constituents from bus networks to rail. It is a priority for me and our region.\nAs co-chair of the All Party Parliamentary Group for the North East, we heard transport is the number one priority for the North East, our next meeting as soon as recess is over in September will continue to speak up for our region’s economy and the challenges our constituents face on a daily basis such as transport.\nThis week I also voted for the King’s Speech. This will be our pathway to fix the country, as well as this we have already announced a breakthrough in negotiations with Junior Doctors, offered teachers a well-deserved pay award, stopped non-essential spending on external consultants and the closure of tax loopholes and clamp down on tax avoidance.\nAdditionally, Labour has already begun the search for a Covid corruption Commissioner to recover the money owed to the British public, lost through fraud, we want the money the Tories gave away back and we won’t leave any stone unturned to trace it.\nWhilst the new government will work tirelessly to ensure they can deliver from day one, it is important that we also understand the scale of the challenge and allow us the opportunity to put things in place.Locally I am carrying on with our surgeries over summer and street surgeries from September, bringing me and my office to your doorstep – and look out for my leaflet coming through your door this summer.\nYou can always email me at [email protected]"
}