{
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_update-on-post-office-campaign/content_6.html": "Update on Post Office Campaign\nGreat News – Post Offices in Our Community Will Stay Open\nI am excited to share that our campaign to save local post offices has been successful! Thanks to the overwhelming support from over 1,800 of you who signed my petition, the Post Office has announced that rather than closing, the Directly Managed Branches (DMBs) across the Cities of London and Westminster will be franchised. This means these vital services will continue to operate, either in the same location or nearby, ensuring that residents will still have access to essential services like banking, cash, and government transactions.\nThis victory comes after months of hard work and collaboration with community members, and concerned residents. Post offices are crucial for so many, especially for those who do not rely on online banking, the elderly, and those with disabilities. They are a vital part of our community, and I am pleased to see the Post Office take steps to secure their future.\nWhile this is welcomed news, the work is far from over. We still need to ensure that the new franchised branches provide the same high standards of service, are accessible and remain a vital part of our community. I will continue to work closely with the Post Office to ensure these branches are franchised in a way that benefits all of us. While there is still more work to do, this is a big win for our community!\nThank you once again for your support.",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_tackling-unsafe-cladding/content_11.html": "Taking Action on Unsafe Cladding\nThis week marks an important step in the urgent work needed to end the cladding scandal. Seven years on from the Grenfell Tower fire, too many people across the country and in the Cities of London and Westminster are trapped in unsafe buildings, forced to hold waking watches and at risk of untold costs to remove cladding on their own homes.\nThis situation has been made worse by a glacial pace of action by successive governments. It took three years to open the Building Safety Fund, and five years to pass a Building Safety Act, which is still being implemented. Issues remain with the set-up and operations of the Building Safety Regulator, which are not only slowing down the pace of delivery of new buildings, but the remediation of existing stock.\nThis is a complex problem, but underneath it lie a few simple truths. Everyone deserves to feel safe in their own home. Nobody should be liable to pay from their own pocket for the failures of developers. And we can never let a tragedy of the nature and scale of Grenfell happen again – particularly when we know the risk which unsafe cladding poses.\nSince the election, the Government has acted with the speed and decisiveness which this situation requires, allocating funding in the Autumn Budget for cladding remediation, pushing developers to act faster, and this week publishing a Remediation Action Plan which sets in stone a deadline to complete works on all high rise buildings with unsafe cladding by 2029.\nInvestment in enforcement is particularly key, and it is encouraging to see this reserved for local authorities, fire and rescue authorities, and the Building Safety Regulator to ensure that the framework surrounding these important operations can act with the necessary speed.\nIt is shameful that the last Government failed to properly identify the full scale of the issue, and so I was also pleased to see a commitment to identify all unsafe buildings in the Action Plan. Residents have frequently been in touch detailing the safety issues in their own buildings which have failed to be recognised. I would encourage Government as they go to identify further unsafe buildings to work with local authorities and residents, who often have detailed knowledge of the situation on the ground.\nMore needs to be done, particularly to ensure that buildings between 11 and 18 metres in height are also included in plans. While I recognise the reasons for which the Government has prioritised remediating high-rise buildings, only setting the requirement for 11 to 18 metre buildings to have a date for completion by 2029 will leave many residents in the same anxieties which they have had for the past seven years.\nI encourage the Government build on the Remediation Action Plan in this area to ensure that residents in these buildings have the security which they have long been calling for.\nWe must never forget that the residents of Grenfell Tower had been asking questions about the safety of their homes before the tragedy. They have been badly let down before, during and after the tragedy.\nGoing forward, I will continue to speak with constituents, councillors, and the Government to make sure that all residents in the Cities of London and Westminster have the action they deserve. We must act to make sure that the tragedy at Grenfell Tower is never repeated, and it is my sincerest responsibility as your Member of Parliament to do all I can to ensure that this action is taken.",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_privacy/content_13.html": "We respect your privacy and are committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.\n1. WHO WE ARE AND HOW TO CONTACT US\nLucy Atkinson is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy).\nIf you have any questions about this privacy policy or any concerns or complaints about how your data has been processed, please contact us at agent@rachelblake.org.uk\n2. PURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\n-\nyour use of this website (including, but not limited to, any data you may provide through this website by, for example, signing up as a supporter of Rachel Blake (the Campaign)).\nBy collecting such data, we will be able to inform you about relevant developments that relate to the Campaign and what you can do to help the Campaign as it progresses.\nIn order to advance the Campaign, we may share your data with other campaigns and movements that share the values, principles and aims of Rachel Blake (including, but not limited, to other Labour Party elections) and which are supportive of our objectives. This will only be done in limited circumstances where we are satisfied that there is a lawful basis to permit such a transfer to take place.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n3. THE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\n-\nidentity data, including first name, maiden name, last name, username or similar identifier, marital status, title, date of birth and/or gender;\n-\ncontact data, including address, email address and/or telephone number(s);\n-\nfinancial data, including bank account and payment card details;\n-\ntransaction data, including details about payments to and from you and other details of products and services you have purchased from us;\n-\ntechnical data, including internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website and platforms hosting our content;\n-\nprofile data, including your username, your interests, preferences, feedback and/or survey responses;\n-\nusage data, including information about how you use our website; and/or\n-\nmarketing and communications data, including your preferences in receiving content and/or marketing from us and your communication preferences.\nWe also collect, use and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\n4. HOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you.\nProvided by you – directly\nYou may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise.\nThis also includes personal data you provide when you register as a supporter of the Campaign, subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\n5. HOW WE USE YOUR PERSONAL DATA\nThe uses\nWe will only use your personal data when the law allows us to. We will use your personal data in the following circumstances:\n-\nRegister you as a supporter of Rachel Blake Campaign;\n-\nInform and engage you about the Campaign;\n-\nInform and engage you with any other campaigns and movements that share the values, principles and aims of Rachel Blake (including, but not limited, to other Labour Party elections);\n-\nManage donations, payments, fees and/or charges;\n-\nComply with our legal obligations; and/or\n-\nAnswer your queries and respond to your questions and/or complaints.\nThe legal bases\n-\nWhere you have specifically consented to a particular use of your data (such as where you have subscribed to receive information about Rachel Blake campaign);\n-\nWhere you have entered into a legal agreement with us that necessitates that particular use of your data (such as where you make a payment or donation to us);\n-\nWhere it is a necessary lawful basis for our legitimate interests and your interests and fundamental rights do not override those interests; or\n-\nWhere we are obliged to process your data in a particular way by law (for example, if we are required to notify any authority or regulator of the nature or value of your donations).\n-\n6. WHEN WE WILL SHARE YOUR DATA\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition). We may share your data:\n-\nTo enable transfers to take place (where appropriate);\n-\nWhere we need to comply with a legal obligation; and/or\n-\nWith suppliers who act as our ‘data processors’ and who provide the means of processing financial transactions including, but not limited to, The Labour Party, Stripe, PayPal and others.\n-\n7. WHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing\nYou will receive marketing communications (i.e. communications promoting the Campaign and/or individuals related to it) from us if you have requested information from us and/or you have subscribed to receiving that marketing.\nRight to object/Opting-out\nYou can ask us to stop sending you marketing messages at any time by contacting us at agent@rachelblake.org.uk\nYou have a right to opt-out of your data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\nWhere you opt-out of receiving these marketing messages, this will not apply to personal data provided to us as a result of other engagement or transactions with us (so, for example, if you opt-out of receiving messages from us – this will not cause us to change the way we use data you have provided for processing donation payments).\n8. COOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\n9. CHANGE OF PURPOSE\nWe will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purposes (as set out in this privacy policy). If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us. If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\n10. CHANGES TO THE PRIVACY POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\n11. THIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n12. INTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\n13. DATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\n14. HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\n15. YOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. Below, we have described the various rights that you have, as well as how you can exercise them.\nRight of access\nYou may, at any time, request access to the personal data that we hold which relates to you (you may have heard of this right being described as a “subject access request“).\nWe follow the ICO’s “Subject Access Code of Practice” when dealing with requests for access to personal data. You can read this code by visiting https://ico.org.uk/media/for-organisations/documents/2014223/subject-access-code-of-practice.pdf.\nPlease note that this right entitles you to receive a copy of the personal data that we hold about you in order to enable you to check that it is correct and to ensure that we are processing that personal data lawfully. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to or contain your personal data.\nYou can exercise this right at any time by contacting us at agent@rachelblake.org.uk and telling us that you are making a subject access request. You do not have to fill in a specific form to make this kind of request.\nYour right to rectification and erasure\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (you may have heard of this right described as the “right to be forgotten“).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is right. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase, we will tell you what that reason is at the time we respond to your request.\nYou can exercise this right at any time by contacting us at agent@rachelblake.org.uk and telling us that you are making a request to have your personal data rectified or erased and on what basis you are making that request. If you want us to replace inaccurate data with new data, you should tell us what that new data is. You do not have to fill in a specific form to make this kind of request.\nYour right to restrict processing\nWhere we process your personal data on the basis of a legitimate interest (see the sections of this privacy policy which explain how and why we use your information), you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data: (a) if you dispute the accuracy of that personal data and want us to verify that data’s accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; or (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nPlease note that if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it. You can exercise this right at any time by contacting us at agent@rachelblake.org.uk and telling us that you are making a request to have us stop processing the relevant aspect of your personal data and describing which of the above conditions you believe is relevant to that request. You do not have to fill in a specific form to make this kind of request.\nYour right to portability\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nBecause of the kind of the nature of our work do and the systems that we use, we do not envisage this right being particularly relevant to the majority of individuals with whom we interact. However, if you wish to transfer your data from us to a third party, we are happy to consider such requests in good faith.\nYour right to stop receiving communications\nAs noted above, where we send you email marketing communications (or other regulated electronic messages) you have the right to opt-out at any time. You can do this by using the ‘unsubscribe’ link that appears in the footer of each communication (or the equivalent mechanism in those communications).\nAlternatively, if for any reason you cannot use those links, or if you would prefer to contact us directly – you can unsubscribe by contacting us at agent@rachelblake.org.uk and telling us which communications you would like us to stop sending you.\nYour right to object to automated decision making and profiling\nYou have the right to be informed about the existence of any automated decision making and profiling of your personal data, and where appropriate, be provided with meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing that affects you.\nExercising your rights\nWhen you write to us making a request to exercise your rights, we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help us to verify your identity. This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be, the faster and more efficiently we can deal with your request. If you do not provide us with sufficient information, then we may delay actioning your request until you have provided us with additional information (and where this is the case, we will tell you).\nYou will not usually have to pay a fee to access your personal data (or to exercise any of the other rights). However, in exceptional circumstances, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we could refuse to comply with your request in these circumstances.\nWe try to respond to all legitimate requests within one (1) month. However, it could take us longer than a month if your request is particularly complex or if you have made a number of requests. In this case, we will notify you of this and keep you updated.\n16. RIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.\nThe contact details for the ICO are:\n-\nInformation Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n-\nTelephone: 0303 123 1113\n-\nWebsite: https://ico.org.uk/concerns/",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_evidence/content_3.html": "top of page\nCall for Evidence: Short-term Lets\nMany constituents have been in touch with me about problems caused by properties being let out on a short-term basis in their community.\nMaking sure that these are properly regulated is one of my main priorities as your Member of Parliament. I have already called for a national register of short-term letting properties and for the implementation of professional accountability standards on hosts.\nTo inform my work, I want to hear from your experiences of short-term lets in our constituency. This will help me get an idea of any potential hotspots for this and any egregious examples of poor behaviour.\nbottom of page",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_copy-of-my-decision/content_12.html": "Supporting the Government to protect vulnerable children from abuse\nThis is a sensitive and important issue, and one which must be dealt with utmost seriousness, bearing in mind the trauma and injustice suffered by victims and survivors.\nThe crimes committed by grooming gangs are horrific. Young girls were abused in the most cruel and sadistic way. Victims and the community need to know that all steps are taken to deliver justice and protect children properly in the future.\nThe Government has supported and continues to support independent inquiries held at a local level into these events, including the one commissioned by Andy Burnham into child sexual abuse in Oldham.\nIn 2022, Professor Alexis Jay’s independent report into child sexual abuse made a number of recommendations, having been set up on a statutory basis after the mishandling of allegations of child sexual abuse in Rotherham.\nThese recommendations included mandatory reporting of claims of child sexual abuse, a single set of core data relating to child sexual abuse, and a ban on the use of pain compliance techniques on children in custodial institutions.\nThe Government is focusing on implementing these recommendations, and Professor Jay has recently said that holding a fresh inquiry would get in the way of implementing these recommendations.\nI believe that Professor Jay’s inquiry provided robust recommendations which best serve the needs of victims. I do not believe that the amendment to the Children’s Wellbeing and Schools Bill proposed by the Opposition does this.\nGiven the importance of this issue, I made sure to attend the recent statement by the Home Secretary on child sexual exploitation and abuse. I was struck by the outcomes reported in this statement of the inquiry which took place in Telford which put victims and survivors at the centre of their recommendations, and fully support these recommendations going forward.\nI believe certain actors have chosen to politicise these events without consideration for the victims and survivors of this abuse. I condemn these actions in the strongest terms possible, and fully support the letter from the victims of gender-based violence, including the victims of the Telford grooming gangs, which expressed their support for Safeguarding Minister Jess Phillips, saying “no one in public life who has done more to support victims and survivors and to advocate for their interests”, and condemning those who “weaponise our pain for their own ends or political gain”.\nLooking forward, I will continue to support the safeguarding of children against sexual abuse, and will look with interest to the Government’s implementation of Professor Jay’s report.",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_stopthenoise/content_4.html": "Pedicabs - Stop the Noise\nFor too long, residents in the Cities of London and Westminster have had to deal with the nuisance of noisy, disruptive, and unsafe pedicabs.\nTransport for London is currently carrying out a statutory consultation on cracking down on this menace, in line with their obligations under the Pedicabs (London) Act 2024.\nI have heard from residents time and again that a priority for them is to completely eliminate amplified noise from these vehicles. It is completely unnecessary for them to have, and is a key driver of the disruption which they inflict on communities.\nWhile the consultation is open, I will be writing to Transport for London to demand that the new regulations include a complete ban on noise. It will be crucial to show that this has the support of the community, so please join me today in calling for TfL to Stop the Noise.",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_speech-on/content_2.html": "Debate on European Union (Withdrawal Arrangements) Bill 2024-25\nSpeech below:\nIt is an honour to represent the Cities of London and Westminster, a constituency with such historic ties to the European Union. Our city was founded by Europeans, more precisely the Romans, in the first century, with ancient Roman walls extending from Ludgate in the West to Newgate in the East, locations still familiar to my constituents today. Visitors to London are still able to see the remains of these early civilisations at the London Mithraeum, the Barbican Amphitheatre, and remnants of the ancient Roman wall are still visible in places, which I would heartily recommend to all across the House.\nI would like to take a moment to celebrate the work of the Museum of London in documenting this ancient history. Situated in the heart of the historic City of London, the museum has been in operation since 1965, and has one of the finest collections of archaeological finds from across London’s long history. While many of us across the constituency, myself included, are sad to see the museum leaving its current site and its historic building set for demolition, I wish it the best for its reopening in 2026 as the London Museum.\nMy constituency has long been a site of settlement and migration in the centuries since the Romans left Britain.\nIn the 16th century, Dutch and Flemish artisans fled religious persecution to the City of London, bringing with them a passion for trade and commerce which continues in the city today. The Royal Exchange, key to the City of London’s architecture today, was in fact build by a Flemish architect, Hans Hendrick van Paesschen, and Dutch eels were a staple of Billingsgate fish market for centuries.\nIn the 17th century, French Huguenots also moved to London in the face of religious persecution at home, and became a key staple of London’s legendary silversmithing and silk weaving trades, settling across the City, Soho, and Spitalfields. One descendent of these Huguenot refugees, Samuel Courtauld, would go on to found the Courtauld Institute of Art, home to one of the finest collections in my constituency.\nThe 18th and 19th centuries would see Italian, Greek, German, and Jewish communities settling across Soho in particular, contributing to the modern day melting pot which it continues to be today. London’s oldest delhi, Bar Italia, was founded in 1949 to cater for the Italian community in the area, and family institutions such as Pasta Brown continue to recognise this rich heritage.\nMany of the children of these families were taught at Soho Parish Primary, which has been on its site on Great Windmill Street continuously since 1872, but whose existence goes back to St Anne’s school, founded in 1699. In the 19th century, the school provided regular medical and dental checks, an essential and rare service for many of the poorer families in the area. The school continues to this day and is supported by an active and passionate community of parents, who fundraise for the school’s continued existence. I pay tribute to the work of these parents, in particular David Barrett and Lucy Head, in continuing to be so involved in the school’s future and the broader Soho community.\nThe Greek community’s contribution to Soho has been long-recognised, with a Greek chapel built in Soho in 1677, leading to the street it stood on being renamed to Greek Street, a name which survives to this day. Britain’s long-standing ties with the Greek community were part of the reason that the country was one of the principle backers of the Greek War of Independence, with volunteers funding and fighting in the movement, including most notably Lord Byron.\nAt this time, Fitzrovia was also home to a burgeoning community of German intellectuals and artisans, particularly along Charlotte Street, a street my constituency shares with that of the Right Honourable Member for Holborn and St Pancras. Charlotte Street was also home in the 19th century to Christina Rossetti, who composed ‘in the bleak midwinter’ in 1872.\nMoving into the 20th and centuries, and these same communities became the basis of the UK’s fight against fascism. In 1924, the same year that openly fascists were elected to local government, the People’s Defence Force was launched in Soho, supported by the rich communities there I have already mentioned. After the Second World War, and a social housing revolution took place with the construction of Churchill Gardens and Lillington and Longmore Gardens in Pimlico, the area became home to a wide variety of communities, including Irish and Italian families who moved into the area.\nThe rich faith landscape across my constituency is testament to the historic ties with various European communities of faith which have settled there. Bevis Marks synagogue, the oldest synagogue in Britain and the oldest synagogue in continuous use in Europe, was founded by Jewish migrants from Spain, Portugal, and Amsterdam, and remains to this day a pillar of the worship of the Sephardi community. I pay tribute to the work of Rabbi Shalom Morris in championing the work of Bevis Marks and wholeheartedly support the community’s continued worship at the site, which has recently come under threat due to potential obstruction by a 43-floor tower which would overshadow the building.\nThis landscape of faith is reflected in a number of historic churches in my constituency, including St Patrick’s catholic church, the French Protestant church in Soho, Our Lady of the Assumption and St Gregory, which was originally built as a chapel for the local Bavarian Catholic community. I pay tribute to their work and contribution to the local communities.\nI am also proud to have a number of embassies of EU countries in my constituency, including those of Austria, Belgium, Croatia, Cyprus, Finland, France, Germany, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Poland, Slovenia, Spain, and Sweden.\nWith this context in mind, I believe that it is crucial that we maintain a close relationship with Europe. Many have noted today that Europe is our closest trading partner, but families across the country have such close ties to the continent. While we may be outside of the EU, we are still proudly European.\nI believe that we can, and should take lessons from the continent as we tackle the big issues facing us today. One of the biggest issues facing my constituents is the proliferation of and disruption caused by pedicabs. The previous government let this problem continue unabated, and residents have had to endure loud, garish vehicles blaring noise into the middle of the night, getting into dangerous accidents, and ripping off tourists and locals alike. It was left to my predecessor, Nickie Aiken, to pass a Pedicabs Act to crack down on this menace, and since the election I have been working with Transport for London to implement it. In this process I have been looking at other cities which regulate pedicabs, and have been impressed by a number of European examples including Berlin and Barcelona, who have cracked down on rogue operators and promoted a culture of more reasonable pedicab usage.\nSimilarly, many of my constituents are fed up of the disruption caused by dockless e-bikes, with reckless behaviour by riders and frequent blocking of streets, pavements, and access points. In this area too, I believe that we have much to learn from our European countries, with cities like Dublin and Prague introducing strict regulation for companies like Lime and Voi. This stricter regulation on E-bike parking, for example, has seen an increase in instances of correct parking – for example with 80% of Lime Bikes in Lisbon now parked correctly, reducing hazards for locals and tourists alike, due to a rise in regulated parking bays.\nFinally, I am proud to support the Government’s efforts to reform the feudal leasehold system, after previous government watered down proposed changes. As the Government looks to establish Commonhold as a default tenure for new homes, it is vital that we look to international examples for how we can deliver more sustainable existence for leaseholders, in my constituency and across the country.\nOur relationship with Europe is important not only because of our cultural and historic ties to the continent but also because of our economic relationship.\nMany of my constituents have found trade to the European Union disrupted. Businesses like Panzer’s Delicatessen in St John’s Wood, clothing distributor Rivet & Hide in Fitzrovia, and Broadwick Silks in Soho, have all spoken up about the impact of Brexit for them to export to Europe.\nI am also proud to represent a number of key UK musical institutions, including the Royal Opera House, the Barbican Centre, Abbey Road Studios, St Martin in the Fields and the Royal Albert Hall, home to world-leading performers like the London Symphony Orchestra and Royal Philharmonic Orchestra.\nThe music industry has been vocal on the impact of Brexit upon their ability to tour in Europe, and to recruit European artists. Research by the Independent Society of Musicians has shown that nearly of musicians have had less work in Europe since January 2021, and that 39 percent have had to turn down work in Europe, in large number due to the costs of acquiring visas.\nThe UK’s music industry is a vital cornerstone of our creative services industry, which contribute £124 billion to the British economy. It is essential that we champion their work and work to lower their barriers to travelling in Europe, including striking a cultural touring agreement with our European counterparts.\nI am unashamed to admit that I campaigned for the United Kingdom to remain in the European Union in 2016. I believed then, as I believe now, that our membership of the EU had considerable economic and cultural benefits, benefits which resonated in the lives of everyday Britons. It meant reduced barriers to trading which kept food prices low, it meant the ability to start a small business and sell to the continent without fear of needless red tape, and it meant doctors and nurses who travelled to the UK to work in our NHS.\nHowever, I do not believe in revisiting the wounds of the past. I know that our best days are ahead of us, and that the most important thing to do is to turn the page on the decades of division which previous Governments inflicted with their constant wrangling over the European question.\nI do not need to remind anyone in this place of those times. Of the brinksmanship by prime ministers past, the divisive language of us versus them, and, most shamefully of all, the complete abandonment of the United Kingdom’s obligations to our partners abroad, turning our back on the international order which we helped to set up.\nAnd speaking of division, let me turn to the members opposite. I congratulate the Member for North Antrim on his success in the ballot for a Private Members Bill, but I have to ask him – is this really what he wants to be remembered for? He could have opened a debate on a major social issue, as the Member for Spen Valley did last week with her legislation on Assisted Dying. He could have put forward legislation protecting his constituents, as the Member for Luton North has done with her Fireworks Bill, which I am proud to support. But instead he has sought to reopen the divisions of the past, and to demand that the United Kingdom once again renege on its international obligations, putting us back to square one in our relationship with Europe, that supposedly ‘oven ready’ deal from from three prime ministers past.\nWhile it is relatively unlikely of me to praise the previous government, I think that the Right Honourable Member for Richmond and Northallerton deserves a great deal of credit for his work putting together the Windsor Framework. After years of seeing politicians at their worst, it represented a moment where our leaders were across the detail, and reached across the aisle to those with whom they might have otherwise disagreed to come together with a reasonable solution. It set aside a uniquely privileged position for Northern Ireland, and would eventually go on to facilitate the return of Government to Stormont. I sincerely hope that the Right Honourable Member considers it a key part of his legacy, and he deserves our thanks for his work on it.\nUndermining this unilaterally would not just have huge consequences for the people of Northern Ireland, but it would commit the UK Government and the EU to an arrangement which neither party has asked for, and which neither party is prepared to implement.\nOn this basis alone I think that it should have no place in this house, and I am happy to oppose it today.\nInstead, we should work with Europe to forge a common future together. I am supportive of the work of the Government in resetting our relations with Europe, and am hopeful that this will be followed with meaningful actions which will deliver for my constituents. A number of options remain on the table, including a youth mobility scheme, veterinary agreements, and a mutual recognition for professional qualifications. I wholeheartedly support all of these, and look forward to what the coming years of our relationship with the European Union will bring.\nWhilst many across this place may find it hard to fathom, given that for so many Cities of London and Westminster is a place to visit or their place of work, amid the tourist hotspots, vibrant shopping districts, and financial centres that I’m so proud to represent, we have vibrant communities at our core.\nTo reflect on the points I made at the start of my speech, I am honoured by the fact that thousands of people from across Europe have, for centuries, made their home in the Cities of London and Westminster, and the vital role they all play in bolstering the communities across our capital.\nHowever, Brexit has threatened this.",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_stmaryshospital/content_10.html": "top of page\nFunding announcement for St Mary’s Hospital\nThe announcement today that the design and planning of the St Mary’s Hospital redevelopment in Paddington will be able to continue is excellent news for my constituents and across London. Thanks to a new tranche of funding from the New Hospital Programme, this is a vote of confidence in this scheme which will transform the hospital. It is a significant step forward after years of uncertainty for St Mary’s. This funding will see £19.4m released, which will enable progress to be made towards receiving planning consent for a new hospital, within a redeveloped life sciences campus in Paddington. This funding is anticipated to be part of a total of around £50 million, in order to complete this phase\nSince my election, and more recently since the New Hospitals Programme funding, I have worked hard to secure the future of the new hospital and am now working hard alongside my neighbouring MP, Joe Powell, to bring us together with Westminster City Council and Imperial College Healthcare in a funding taskforce with a view to confirm construction dates and bring forward a timeline that delivers certainty for residents of my constituency, and all Londoners who utilise St Mary’s services. I look forward to joining this taskforce to deliver change for my residents.\nI will continue to deliver on this issue, not only for my constituents, but for all those across London who were disappointed to see the initial funding delayed. This newly released funding marks a substantial step towards receiving the certainty our community needs for the future.\nbottom of page",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_newsletter/content_9.html": "top of page\nKeep up to date\nJoin my newsletter for up to date news\nPromoted by Lucy Atkinson for Rachel Blake, both at 4G Shirland Mews, London W9 3DY\nbottom of page\nPromoted by Lucy Atkinson for Rachel Blake, both at 4G Shirland Mews, London W9 3DY",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk/content_1.html": "I want to thank everyone across the Cities of London and Westminster who have put their trust in me.\nI am honoured to represent the heart of my home city and to represent Londoners. I am excited to continue work with local residents for a brighter future.\nWhether you voted for me or not, I will work to serve you and to stand up for everyone across our two cities.\nMEET RACHEL\nI’m standing to represent you because I am a proud Londoner.\nI believe that we need a change in Government and that Labour has a plan to get Britain’s future back.\nI see what’s happened to our NHS, our Housing, our Economy and that the opportunities that have been available to me and family might not be possible for my children.\nI’ve focused my entire working life on the issues that matter here:\n- London’s economic prosperity\n- Supporting vulnerable families\n- Stronger relationships with European Leaders\n-Tackling Climate Change\n-Delivering affordable homes\nMy first job was in the NHS. From there, I moved to the Corporation of London – helping unemployed Londoners into work.\nI then got a job at the Treasury working under Gordon Brown, advising on planning policy and economic development.\nAfter that, I went on to work with local authorities including the City of London and Westminster City Council, delivering affordable homes, supporting vulnerable homeless people into safe accommodation, supporting survivors of domestic abuse, insulating damp and leaky properties, and holding housing associations to account.\nFor the last 10 years, I have been a local Councillor Tower Hamlets, representing Londoners. And I have secured: Action against unaccountable housing associations; Action on fire safety; Action for leaseholders; Cleaner air; New council homes.\nThis is my passion: to represent people, to push for what needs to be done and to stand up for Londoners.\nI was selected as Labour's candidate here in July 2022 by local Labour Party members. Since then, I have been campaigning on the important issues locally.\nCampaigning for investment at St Mary's Hospital - in June 2024, Wes Streeting MP, Shadow Secretary of State for Health and Social Care confirmed Labour’s commitment to long term funding for redevelopment of the hospital.\nEnding the scourge of Dirty Money - which harms our high streets and communities - in May 2024, David Lammy MP, Shadow Foreign Secretary set out Labour’s plans to make London the Anti-Corruption capital of the world.\nMore neighbourhood police on the streets - in June 2024, Yvette Cooper MP, Shadow Home Secretary joined me in Soho to discuss Labour’s plans for neighbourhood policing and tackling violence against Women and Girls.\nRegulation of short term lets - we must get a grip on the loss of homes to short term lets. The Conservative Government has failed to address this issue and I will campaign for local communities to be able to save homes from becoming hotels.\nStopping E-bikes - I am calling on the Government to pass a new law that will allow the Council to fine e-bike riders and the e-bike operating companies when e-bikes are parked outside designated e-bike parking bays. I am also working with residents and community groups to improve their neighbourhoods.\nAs your MP, I would be standing up for you, for your neighbours and for your families.\n-\nSecuring investment at St Mary’s hospital\n-\nGetting short term lets regulated\n-\nGetting new legislation to stop e-bikes littering our pavements\n-\nRe-establishing community policing across London\n-\nGetting community energy schemes off the ground\n-\nStronger relationships with European Leaders\nThese are just some of the ways in which I can represent you. I’m looking forward to hearing from you about the issues that matter to you and how I can effectively represent you.\nI believe that together we can win a Labour MP in Cities of London and Westminster for the first time ever. As your MP, I would be a local, experienced champion and a determined and tireless voice for change in Parliament.\nMy maiden speech in Parliament\nPromoted by Lucy Atkinson on behalf of Rachel Blake for the Labour Party, both at 4G Shirland Mews, London W9 3DY",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_my-decision/content_14.html": "My Decision on the Assisted Dying Bill, Second Reading\nTomorrow, Members of Parliament will vote on the Terminally Ill Adults (End of Life) Bill in a free vote.\nThis is a serious issue, one which goes to the heart of our beliefs about the purpose with which we enter and live in the world, and the ways in which we leave it.\nIn the lead-up to this vote, hundreds of constituents have been in touch with me to share their views on the Bill, their experiences, and the experiences of their loved ones which inform those views. I am grateful to every single one of them.\nI have also organised roundtable discussions with constituents both for and against the legislation, which have served as kind and respectful forums to discuss the content of and rationale behind the Bill. Thank you to everyone who attended these.\nI would also like to thank Kim Leadbeater for carrying the responsibility of this issue on her shoulders, and for listening to me and so many colleagues as we weighed up our decisions around the Bill.\nI have been genuinely undecided on this legislation for some time and have spent considerable time reflecting on both the principle and the practice of assisted dying. In principle I do not have an objection to assisted dying: I believe that, with the options available from modern medicine for living longer, it should be up to us when we exit this world, and that those who endure painful terminal illnesses should have the right to choose a painless and dignified death.\nI also bear in mind that methods of assisted dying are available to those with physical ability and financial means to travel to undergo the procedure. This raises with me strong concern about the fairness of the current UK position. This legislation does not exist isolated from the international picture.\nHowever, I do have concerns about what this legislation will mean in practice. I am deeply concerned about the impact of assisted dying on the relationship between doctor and patient, the risks of coercion in patient decision making and the role of the proxy. I recognise that there are many reasons that somebody could be coerced into ending their life before they were ready or even feel that it was the ‘right thing to do’ to avoid ‘being a burden’. I acknowledge that there are strong safeguards in this legislation, which I believe have recognised some concerns about the power of a single doctor or a mistaken diagnosis.\nI do think that the knowledge and availability of physician-assisted suicide will forever change the relationship between doctor and patient. Whether this is a good thing or not, it is a serious change which needs to be considered thoroughly.\nUltimately, I have decided to vote for this legislation at Second Reading for three core reasons. First, I believe that the current framework does not reflect the changes to life and death brought about through modern medicine and that is the responsibility of Parliament to consider the effects of this. Second, but linked to this, I believe that there can and should be a choice for individuals at the end of life. Third, I have concluded that the case for changing the current legislative framework is strong enough to consider further debate.\nBut this is not unconditional support. If the Bill continues to further stages, it will be important to consider what further measures to safeguard against coercion are available. Further iterations of the Bill should bring complete reassurance that doctors can opt-out of all parts of the assisted dying process and tighter requirements for regularly reviewing the practice of assisted dying. If this is not done, I may have to vote against it in future.\nIf this Bill is to become law, we need to all work together to build a society where it is easier to have this conversation.\nWe need to build an NHS fit for the future where the quality of palliative care cannot be a reason to oppose this change.\nWe need to empower and bring together those with terminal illnesses so that they can never believe that they are a burden on their loved ones or on our public services.\nWe need to learn from how this discussion has so far been conducted and look at how we can bring about a greater compassion in politics and respect between both sides of this debate and other similarly emotive topics.\nI hope that everybody reading this can understand the reasons for which I will vote in favour of this legislation. No matter whether you support or oppose it, please know that I have listened to your voice and will carry it with me as your Member of Parliament as I go into the chamber tomorrow.",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_how-do-you-like-to-hear-from-me/content_5.html": "top of page\nHow do you like to hear from me?\nAs many of you know, I send out a weekly newsletter and post across my social media channels to keep residents up to date on what I’ve been working on and the progress being made on different issues in our community.\nBut I want to know how else you'd like to hear from me?\nI’d love to hear your thoughts on the best way for you to stay updated.\nHow do you usually hear from me—through social media, my newsletter, your local residents’ association, or maybe even word of mouth from neighbours?\nLet me know by filling out my survey.\nbottom of page",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_deliveringchangeinuncertaintimes/content_7.html": "Delivering Change in Uncertain Times\nIt is a rare privilege to be a Member of Parliament, but a unique one to represent such a singular constituency as the Cities of London and Westminster. My constituency finds itself at the engine room of the UK’s economy, with over a million people employed in its boundaries. It is also at the centre of a number of its most substantial crises. In 2007, the financial crisis started in the City of London, leading to a spike in unemployment, a crash in the housing market, and triggering fifteen years of austerity which we are only now reversing. The impacts of this are felt in another crisis which we face every day in rough sleeping and homelessness. Westminster alone has over 2,000 people sleeping rough and spends 65 million pounds a year on temporary accommodation, with similar rates in the City of London.\nAnd it is the heart of its politics. I am often described as the Member of Parliament for Parliament, but I am also in many ways the MP for political protest and demonstrations, whether those be the marches around the conflict in Gaza, strikes by prominent trade unions, or, as we saw over the summer, the devasting riots which rocked communities across the country.\nResponding to these riots was one of the first things which I had to do as a Member of Parliament. Having spent over two years knocking on doors, speaking with constituents and holding meetings around the actions which I could do to unite people across my constituency, suddenly we saw the flip side of that, as a few violent individuals sought to sew hatred and division while capitalising on a horrific attack.\nAfter the excitement and optimism of winning the election just days before, these riots could not have been more of a sign of the instability in which we find ourselves. We are now in a world where disinformation can spread like wildfire, and the pace and nimbleness of violence can far exceed the capacity of our public services to respond. In contrast, previous Governments have been slow to pass even the most common sense reforms of our public services, with many of the services which people rely on barely fit for the 20th century, let alone the 21st.\nThis evening I will make the case that this Government delivering change in uncertain times by placing renewal of the social contract at the very heart of our programme not only because this is crucial for restoring confidence in public services but also as a vital objective in its own right. And I will argue that alongside the Government's programme, there is a central role for individual politicians, local and national, in restoring faith in democratic processes.\nSOCIAL CONTRACT\nOur social contract is in severe need of repair, alongside investment in the confidence in the rule of law, and the power of relationships with our neighbours and our communities.\nBut what do we mean when we speak about a social contract? What was originally described as a tacit contract between the rulers and the ruled has to be updated for the 21st century, where consumers and workers have more mobility, more rights and more of a voice.\nThe breakdown of this social contract can be shown most clearly in three ways.\nWORK\nFirst, our economic social contract is broken when work does not pay. In my parents’ generation, most people left school, potentially spent a few years in an apprenticeship, and then stayed in the same industry for their whole life. The work was stable, their employer was known, and their pay packet generous enough to buy a house, start a family, and even to afford little luxuries like the occasional holiday.\nNow this is clearly not the case, even in households with two working parents. Employment is more precarious, people are expected to change professions multiple times through their working life, and often their boss is a remote entity with little accountability. And this work simply does not pay. A million working households and two million children with working parents experience poverty, and even those who are above average incomes are struggling with basic costs. Many young people are barely able to keep their head above water, let alone to think about saving up to have children or for retirement.\nSTATE\nSecond, our state social contract is broken when taxpayers fail to receive value for money from the state. Even ten or fifteen years ago, it would be imaginable that you could get a GP appointment with relative ease, that you could catch the train relatively affordably on a service that ran on time, and that, if you were the victim or witness of a crime, the police would have the capacity to deal with it.\nBut we are far from this world in 2025, with waiting lists for elective surgery through the roof, policing services struggling to be visible and respond to even the most recordable crimes, and our infrastructure, from our trains to our energy and even our water, in drastic disrepair. More and more people are turning to private healthcare and businesses are forced to hire in private security because the state is simply unable to meet their needs as they might expect it to.\nDEMOCRACY\nAnd third, our democratic social contract is broken when people feel that their voice does not count. Now, of course there was no era in which Parliament was free of sleaze, or where our electoral system was devoid of interference or manipulation. But we also cannot deny that trust in our politics is at an all time low, and that our political processes have failed to catch up with the needs of the 21st century.\nIn an era in which people can receive instant communication, our institutions are clunky and unresponsive. In an age where authenticity is key, politicians must be effective natural communicators as well as thoughtful legislators in the face of the paradoxical contrast of declining trust in politicians and increasing demand their services. And at a time when seemingly infinite choice is available to consumers, sometimes even the most basic public services options remain unavailable to citizens.\nHOUSING\nNowhere is this broken social contract clearer than in housing. This is an issue close to my heart, having worked in housing all my life at a local, subregional, and national level. There are many crises running through our political and economic system, but the shortage of a decent home in location close to jobs and services and at affordable price has to be chief off all.\nWork does not pay, when rents, mortgages, and service charges are increasingly unaffordable, and when homeownership is a dream for most.\nTaxpayers fail to see any value for money when our social housing is decimated, and when government has sat by and let 150,000 children suffer in temporary accommodation.\nAnd our voices go unheard, when the people who provide our housing, our landlords, our freeholders, and our developers are unresponsive and unaccountable to the people that live in it.\nREFERENDUM\nIn 2016, a critical mass lost our faith in the institutions which govern us, and we as a country voted to take the greatest political and economic risk of my lifetime in leaving the European Union. It was then that I decided to run to be a Member of Parliament to work to restore confidence in democratic processes.\nFive years on after Brexit those who voted for it are not seeing it deliver on what they hoped for. They do not feel free from red tape or regulation, nor that they have the power to effect change in their local area. And those who voted to Remain in the European Union feel unserved by a hard Brexit which failed to respect the close result of this referendum, with their freedom of movement curtailed, new barriers to business, migration criticised rather than recognised as a force that has enriched and strengthened our nation.\nEven as instability across the world rocks our shores, when our economy looks shaky and a climate emergency continues to loom, repairing this social contract must be our ambition. Because with confidence in the strength of social contract comes a belief in the power of political change to deliver brighter futures.\nEasy, right?\nSOLUTIONS\nAlong with 400 colleagues, I was elected on a manifesto which went some ways to repairing this contract. While I understand that there are many in this room tonight who may want the Government to be going further and faster, and those who worry that it is moving too quickly, I am confident that the foundations which we are laying have the potential to restore this faith in our economic model, our public services, and with politicians.\nFirstly, we are making work pay. There are 5,000 hospitality businesses in my constituency, and as soon as the Employment Rights Bill comes into law every barista, every waiter, every kitchen porter in those businesses will have the right to fixed hours if they want them. One in every fifty-two British workers is employed in the City of London, and every one of them will have additional protections against unfair dismissal from day one in their job, even in the City’s most powerful institutions. And the retail workers in my constituency, working on the nation’s high street on Oxford Street will be protected from exploitative fire and rehire practices, and will be able to stay in these communities for longer.\nAll of these workers will benefit from an increased minimum wage, and from a living wage which for the first time ever will actually reflect the cost of living.\nAnd we are helping these people directly with the cost of living, having put an extra 1.8 billion pounds into childcare provision, not to mention rolling out free breakfast clubs, so that working families’ pay checks are not swallowed up with the basic costs of just getting by. And we have put an extra billion pounds into the Household Support Fund, in recognition that times are tough, and those who are in the most need have more demands on their resources than ever.\nAnd yes, we have raised taxes to fund some of this. But we have done so in ways which recognises just how high the tax burden already is on working people, focusing these increases on those with the broadest shoulders – employers and those with assets, rather than simply going for the same old levers of income tax, employee national insurance, or VAT.\nWe are fixing the public services, so that taxpayers feel that they are receiving value for money when they contribute into the system. Alongside more funding for our hospitals, our police, and our schools, the Government is also committed to fundamental reforms in key areas of public service. Step changes are being delivered in the NHS with shifts from hospital to community, treatment to prevention, and analogue to digital. And this week we have seen the impact of that with NHS waiting list beginning to turn a corner.\nPolicing is being fully established in communities with our new Neighbourhood Policing Guarantee. Last week I was at a meeting with residents where they were complaining about the efforts they had had to go to to ensure that they had a neighbourhood policing officer assigned to their area. Under the Government’s plans, this will be guaranteed for every neighbourhood, ensuring that residents have a named individual they can turn to when they are the victim or witness of crime.\nAnd the Government is reforming the democratic social contract, so that citizens’ voices truly matter. We are passing legislation which will set an automatic presumption in favour of devolution, and giving the ability of mayors to formally request powers for the first time, and for it to be up to Whitehall to justify why these cannot be handed down.\nWe are committed to lowering the voting age to 16, to usher in a new era of democratic participation where our children are raised as citizens. And we are simplifying our local government structures, so that people clearly understand who to go to with each issue, while at the same time filling in the map of devolution that every place has a metro mayor like Sir Sadiq Khan and Tracy Brabin to stand up for them, and to attract investment into their place.\nAs I mentioned previously, housing is by far the greatest of the emergencies which we face, and it is also the area in which the Government is acting with true ambition.\nReal work is being done to address the 4.3 million missing homes, with the boldest reforms to the planning system in my lifetime. And these are not just any homes, the Government also has a clear focus on reversing the decades of decline in our social housing stock, severely limiting the Right to Buy, investing in new social homes, and ensuring that any development on ‘grey belt’ land prioritises affordable housing.\nThe Government is also getting a handle on the rough sleeping emergency, after previous administrations allowed the numbers of people experiencing rough sleeping to increase more than fourfold. Over a billion pounds of new funding has been put into the system with a new focus on prevention, and the Deputy Prime Minister is chairing a cross-departmental workforce to end rough sleeping for good.\nAnd legislation is in the works to ensure that people’s voices matter in their relations with those who provide their housing. There are 27,000 private renters in my constituency. When the Renters’ Rights Bill receives royal assent, they will overnight be protected from arbitrary eviction, they will be able to challenge unfair rent increases, and have new accountability for how quickly their landlord responds to complaints. My constituency also has among the highest numbers of leaseholders in the country, who the Government is also empowering through their programme of reform. In less than two weeks, reforms will come into place which will make it easier for leaseholders to take over management of their buildings, to provide accountability bad managing agents overcharging them for services and failing to deliver essential repairs.\nThe Government is working at pace to repair the social contract in these key areas, and what is the role of individual politicians? Why should we care who legislators are and what they are doing? Because day to day representation matters. There are hundreds of MPs in the Commons who are engaged in work unconnected with that of the Government, but which is still vital to the lives of their constituents and the country at large.\nJust as repairing the social contract is important to the Government, so it is reflected in my work too and that of representatives across the country.\nThis work to repair our social contract is focused in my efforts to fix our economic model, by fighting against the dirty money which proliferates my constituency in particular. It may be unsurprising to hear that my constituency has far and away the most dirty money laundered through both the City of London and the Westminster property market. Indeed, over half of property bought by shell companies registered in Overseas Territories can be found in my constituency, owned indirectly by individuals who have frequently made their wealth from corruption and the abuse of power, skimming money from state procurement contracts or directly acquiring assets, and funnelling the proceeds of this ill-gotten wealth into our property market.\nMany of my constituents feel powerless when the communities which they have lived in with for years slowly erode as their building becomes a vehicle for laundered wealth.\nIn central London we are seeing this, with community institutions like the Central YMCA closing its doors, and more pillars of the community like the Prince Charles Cinema under threat from elusive and unaccountable organisations. These institutions have always had to compete against London’s residential and business community, but increasingly they are being crowded out, bidding in a rental market against shadowy owners with nigh unlimited funds.\nLevels of money laundering in London corrode our communities, damage democracy around the world, and block the growth prospects of our capital’s economy. And this is something which I have the opportunity to fight against on the All Party Parliamentary Group for Anti-Corruption, pushing the government to simplify its enforcement measures against kleptocrats, calling out the opaque practices of Overseas Territories, and working directly with agencies to boost their enforcement efforts.\nAnd finally, this work to repair our social contract is focused in my efforts that my constituents have a voice when they feel ignored. Some of you here may have suffered at the hands of a poor managing agent, particularly if you are a leaseholder. You may have seen your service charge increase well beyond reasonable proportions, you may have had to wait for months on end for essential repairs to take place, and throughout this you may have had nearly no communication with the agent whose responsibility it was to look after your building. This is a story which I had heard far too many times, particularly about FirstPort, the largest managing agent in the country.\nSo I did something about it, gathering a group of Labour MPs together to summon managing agents like FirstPort to Parliament to take account of their actions. We secured an agreement on how they were going to improve their service, including a promise to meet individual MPs with residents in blocks which they manage. Since then, I have been doing just this, setting up surgeries with FirstPort and residents so that they can answer for their poor service and make actual improvements. Residents who had not heard from their managing agent for months are writing to me saying that they now have daily communication, and that issues which have been unresolved for years are finally being actioned.\nAnd this group is having real impact, with 119 MPs involved in it, we’re just two shy of the entire Conservative party.\nI came into politics to deliver change in uncertain times, and I truly believe that every Member of Parliament has the ability to do things in their area to restore faith in politics, to connect citizens with the state, and to ensure that people feel that their voice is heard when they were previously powerless. In fact, it is essential. Increasingly the United Kingdom feels like an island in a sea of populism, and we must continue to make the case that democracy can deliver for people in a way which they will actually feel.\nI started this evening speaking about the riots which rocked our communities in the summer. They showed the worst of what humanity can do to each other, but the response to them showed potential of what strong communities can do for each other. We saw bricklayers in Southport repairing the walls of a mosque which had been torn down by rioters, residents who donated funds and books to restock the Spellow library after it was torched, and volunteers in Sunderland who found a new site to offer community advice after their citizens advice centre was torn down. It is by fostering these strong communities that we can reverse the damage of recent decades, by allowing us to be connected by what we have in common, rather than torn apart by our differences.\nDelivering change in uncertain times is more difficult than ever, but it is more vital than ever as well. And it is a mission in which we all have a part, particularly the people in this room. We cannot take our democracy, our rights, or our social contract for granted. But, if we genuinely work together, from the Government to business, civil society and academia, even MPs I believe that we can reforge it stronger than ever.",
  "https_www_rachelblake_org_uk_/https_www_rachelblake_org_uk_your-thoughts-on-managing-agents/content_8.html": "top of page\nShare your thoughts on Managing Agents\nEach week, I receive emails from residents of both leasehold and freehold properties in our community, expressing dissatisfaction with the service they are getting from managing agents.\nI understand this may only be the tip of the iceberg, and I want to hear from you.\nPlease take a moment to complete my brief survey and share your experiences. This will help me continue raising the issue in Parliament and work towards ending poor services and excessive charges once and for all.\nNote: All testimonials and experiences if shared will be kept anonymous.\nbottom of page"
}