{
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_accessibility/content_35.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_chris-november-newsletter-autumn-statement-diwali-and-bolton-parish-church/content_17.html": "The big political event of the last month was the Chancellor of the Exchequer delivering his Autumn Statement. It was more positive than I expected with tax cuts for business and individuals as well the commitment to delivering the full triple lock for pensioners.\nEconomic turmoil is toughest on those with fixed and low incomes so the triple lock was the single most important announcement especially for those who attended my popular ‘older persons fair’ who told me how important this decision would be.\nTemples come in many forms and it was a delight to join so many from Bolton’s friendly Hindu community at the Shree Swaminarayan Mandir temple to celebrate Diwali. The building has a remarkable façade and a wonderful interior. The whole space was filled with light which showed off the spectacular painting and murals, many of which were made by experts coming all the way from India.\nDiamond Buses have chosen a Grade II listed building in the heart of Bolton for their new headquarters and I was privileged to cut the ribbon to open it. Their commitment to providing the best service is second to none as is the boost they’ve given our town by restoring an architectural gem and creating great local jobs.\nIt’s not often I get to open a new building but it was a delight to cut a second ribbon this time to reopen the Victoria pub on Market Street in Westhoughton. A fortune has been spent on it and the regulars are delighted to have it back.\nLive music always gives me a boost so the Wingates Brass Band’s 150th anniversary performance in Bolton Parish Church was a special occasion and it is clear why they are known as being world class. The Bolton Hoover Band were superb in the Bridge Church at an event organised by the fabulous Christine Ogden who has raised a fortune for research into muscular dystrophy. Back at Bolton Parish Church, it was a delight to see the bell ringers perform and hear the technical aspects of how they organise the rounds.\nIn amongst everything, I still find time for paperwork and Parliament.\n-\nYou can subscribe to my monthly e-newsletter through the following link: http://eepurl.com/bRi69P",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_progress-horwich-health-centre/content_23.html": "When I was first elected back in 2015, funding was secured for a new health centre in Horwich.\nAfter some delay, our new health centre is very close to being completed. I visited the site this week to have a look at this modern facility, which will replace two existing GP practices in Horwich.\nResidents are keen to see the new health centre open and I understand that it should begin seeing patients by the summer.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_chris-visits-horwich-banking-hub/content_29.html": "Banking Hubs are a new alternative to the traditional bank. The hubs host many of the main banks in one site and serve many who would otherwise find online banking or travelling a long distance impossible.\nOnly 36 are up and running and one of those is in Horwich so I popped in to hear how well it is doing and popular it has been.\nI’m looking forward to them revealing their permanent Horwich site and the new site in Westhoughton. James Grundy MP and I are working to get one in Atherton too.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_eu-referendum-decision-not-respected-opposition/content_30.html": "The Labour Party continue to show a lack of respect for your referendum decision and an indifference to the disruption to businesses by unnecessarily drawing out our negotiations with the EU.\nhttps://en-gb.facebook.com/ChrisGreen4BoltonWest/videos/312091951462278…",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_category_Newsletters/content_7.html": "Chris' May 2024 newsletter: Football Governance, Transport and a General Election 27th May 2024 Football has been a dominant feature of political and cultural life recently. I have been on the Football Governance Bill committee and, during an evidence... Newsletters\nChris' April 2024 newsletter: Hiking the Pike, Elizabeth Park and Transport 17th April 2024 As always, the last month has been rather enjoyable and shows the breadth of activities that are going on locally and also those that MPs get invited to attend... Newsletters\nChris' March 2024 newsletter: Older Persons' Fair, IX Wireless and flood prevention 18th March 2024 The Older Persons Fair I held at Brookfield Hall in Westhoughton was an amazing success though it is always rather difficult for me to judge. The stall holders... Newsletters\nChris' February 2024 newsletter: Banking, Budget and Batteries 15th February 2024 You can subscribe to my monthly e-newsletter here. Alternatively, email me at [email protected] to be added to my mailing list. This week has been recess... Newsletters\nChris' January 2024 newsletter: Daisy Hill Railway Station, Bin Collection Chaos and gritting 22nd January 2024 Politics often has its competitive elements. Usually, this can be quite positive because it can drive improvements in service and outcomes but, all too often... Newsletters\nChris' December newsletter: Loco Works Spine Road, Banking Hubs and Christmas Card Competition 22nd December 2023 Christmas is often a time for looking back on the year that’s been but there is so much that is going on in British politics that my eyes will be focussed on... Newsletters\nChris' November newsletter: the Autumn Statement, Diwali and Bolton Parish Church 24th November 2023 The big political event of the last month was the Chancellor of the Exchequer delivering his Autumn Statement. It was more positive than I expected with tax... Newsletters\nChris' October newsletter: Bolton College, The Snug and the Festival of Horwich 16th October 2023 Contrast and, to some degree, extremes add a huge element of flavour to business around the Bolton West constituency. A good example recently is when I listen... Newsletters\nChris' September newsletter: PMQs, best shop competition, law and order 20th September 2023 As I pointed out at the start of my last article, variety is the spice of life and that there was a little Green Party protest outside my office. Unfortunately... Newsletters",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_best-shop-competition/content_27.html": "I am delighted to announce that Belle Moi in Westhoughton have won this year’s best shop competition!\nI received many wonderful comments about their customer service and professionalism and they are a great example of how a business can make such a positive difference to our high street.\nThank you to all of the independent retailers that entered and for everyone that voted.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_chris-may-2024-newsletter-football-governance-transport-and-general-election/content_31.html": "Football has been a dominant feature of political and cultural life recently. I have been on the Football Governance Bill committee and, during an evidence gathering session, we took evidence from Sharon Brittan, the Chairman of Bolton Wanderers Football Club. She didn’t hold back in committee and made it clear just how important the new rules would be for BWFC as well as the whole of the football pyramid.\nI was delighted that the Secretary of State for Culture, Media and Sport visited me and the club to hear our concerns about the future of football and to take questions from an audience about the proposed legislation.\nThe play-off final in Wembley against Oxford United was a little more forgettable and perhaps best forgotten.\nTaking up issues as diverse as the Northern Forest, funding for J7 on the M61 and the future of the hospice movement occupied much of my time but the Prime Minister provided a bit of a distraction.\nHe called the much anticipated General Election for the 4th July. I have long thought that the mood across the constituency would be for an earlier rather than later election though I know that there is no unity on this.\nMy judgement is that the PM thought that, despite abundant commentary in the media, we are now in a politically stable position and that he had also moved the country into an economically stable position with us being on the verge of having interests rates cut, inflation returning to normal and the economy returning for growth.\nIt is always a nerve wracking time for a politician running into an election and the final day of this Parliament is Thursday 30th May.\nDuring the election period, I can still act on behalf of constituents but in a much reduced way to normal.\nI am now hoping for good weather till 10pm on polling day.\nYou can subscribe to my monthly e-newsletter here.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_category_Westminster-News/content_14.html": "Challenging the Health Secretary on local NHS performance 15th December 2023 Leadership in healthcare has been devolved to the Greater Manchester administrative level through the creation of NHS Greater Manchester. I took the opportunity... Westminster News\nRMT votes to end train strikes 30th November 2023 It is good to see that the railway workers in the RMT Union have overwhelmingly accepted a pay offer, following negotiations between rail companies, Ministers... Westminster News\nUpdate on the Rwanda policy 28th November 2023 I was frustrated by the decision of the Supreme Court to rule against the Rwanda policy but the Government will return with further legislation to tighten up... Westminster News\nParliamentary event on clinical trials and access to innovative medicines 17th October 2023 One of the areas of interest I have in Parliament is around medical research and access to innovative medicines. It is particularly interesting to get an update... Westminster News\nBolton West MP supports cost of living support payment 27th September 2023 The Government recognises that many people are finding it difficult with the cost of living, so today they are giving many of the most in need the first of... Westminster News\nBan on laughing gas 15th September 2023 Nitrous oxide has been banned with it now being categorised as a class C drug. This means that possessing laughing gas is now illegal and could result in 2... Westminster News\nEU Referendum Decision Not Respected by the Opposition 16th July 2020 The Labour Party continue to show a lack of respect for your referendum decision and an indifference to the disruption to businesses by unnecessarily drawing... Westminster News\nDomestic Abuse Bill Passed 10th July 2020 It has been an important and busy week in Parliament, but I was most proud to join MPs in passing the Domestic Abuse Bill. This important bill will protect the... Westminster News\nLockdown Update 9th July 2020 Beauty salons, gyms and tattoo parlours will be able to open Westminster News",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_campaigns_more-officers-beat-cut-crime/content_28.html": "The greatest concern my constituents have raised with me over the last nine years has been over law and order. We know the impact this on peoples lives whether the most serious crime or that persistent nuisance that is not being dealt with.\nThis is why I have held public meetings with the police, carried out extensive crime surveys and have regularly met the local policing leadership to share your concerns.\nWhen an off-duty police officer approached me to explain how disastrous the police iOps computer system was, I took action on this because it was putting the lives of police officers at risk and undermined their ability to protect people and enforce the law. I wasn’t surprised when GMP was plunged into ‘special measures’.\nCombined with other concerns over policing such as the closure of Bolton’s custody suite and all it symbolised, I took up your concerns about local policing with the Home Secretary. This led to a change of leadership and a transformation in local policing.\nWith a change of leadership, we have seen the number of arrests double, a 32.2% reduction in burglaries and a 28.5% reduction in vehicle theft. The cultural shift can also be seen in 999 response times with GMP now ranked with the quickest response times in the country.\nWe are also seeing a welcome return to community policing, with dedicated teams of police officers patrolling neighbourhoods across Bolton, Westhoughton, Horwich and Blackrod. I am delighted that as part of our national police recruitment campaign GMP has now received 1,280 new police officers. now recruited 1,280 new police officers. GMP now has 8,200 officers, the most it has had in its history.\nI will continue to listen to your concerns on crime locally and fight for more policing resources across Bolton West.\nFor more information about what I have been doing to combat crime and anti-social behaviour, see some of the news articles below.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_parliament/content_32.html": "Clause 1 - Livestock worrying: scope and consequences of offence | Dogs (Protection of Livestock) (Amendment) Bill | Commons debates A few years ago, I was delighted to welcome my right hon.\nLicensing Hours Extensions Bill | Commons debates Under that definition —international, national and local significance—tomorrow is the play-off final at Wembley between Oxford United and Bo\nExamination of Witnesses | Football Governance Bill | Public Bill Committees Q This point will be brought to a head this coming Saturday.\nExamination of Witnesses | Football Governance Bill | Public Bill Committees Sharon, as the local Member of Parliament representing Bolton Wanderers, I just want to say that the transformation for local communities ha\nExamination of Witnesses | Football Governance Bill | Public Bill Committees I have some sense of this already, but does the Bill go far enough to empower the regulator in the distribution of funds?\nExamination of Witnesses | Football Governance Bill | Public Bill Committees Q When we think about good business, with you coming in with those cultures and values from a healthy business environment, and that cultur\nFootball Governance Bill | Commons debates It is a pleasure to follow the hon. Member for Weaver Vale (Mike Amesbury), who touched on the important issues in this debate.\nHospice Funding | Commons debates It is a pleasure to follow the hon. Member for Strangford (Jim Shannon). I congratulate my hon.\nHospice Funding | Commons debates It is a pleasure to follow the hon. Member for Strangford (Jim Shannon). I congratulate my hon.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_campaigns_investing-local-health-services/content_12.html": "We need good quality health care. That’s why I have been campaigning for better access to GP’s and pushing for progress on the Horwich Health Hub to get facilities built. So we have more appointments at convenient times, giving you and your family the opportunity to see a professional when you need it most.\nI have raised your concerns about GP access with the Minister in the House of Commons as wll as the Secretary of State as a member of the Health and Social Care Select Committee, particularly access in Westhoughton and Blackrod:\nhttps://www.facebook.com/watch/?v=725149935864097\nThe training and recruitment of more healthcare professionals is also hugely important, which is why I worked to secure funding for a new £40m medical college at the Royal Bolton Hospital. The Bolton Institute of Medical Science is opening later this year and will train the next generation of health professionals, benefitting residents across the area.\nI was delighted that a new £18.3m, state of the art operating theatre complex opened earlier this year at the Royal Bolton Hospital, which will enable an additional 5,000 patients to receive the treatment they need each year.\nHousebuilding and population growth is placing huge demands on local health services and I’m delighted that Horwich Health Hub will be opening later this year. I am now campaigning for the construction of a Health Hub in Westhoughton.\nFor more information about what I have been doing to campaign for improved health services, see some of the news articles below.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_horwich-health-centre-progress/content_18.html": "It is great to see more progress being made with Horwich Health Centre with the windows now being installed, along with internal fittings.\nWhen completed, it will improve our local healthcare provision, which I know is so important to residents of Horwich.\nWhat other services would you like to see at the Health Centre? Please do let me know and I will get in touch with the Integrated Care Board.\nSee more on my Facebook: https://www.facebook.com/ChrisGreen4BoltonWest/videos/2079435365768518/…",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_campaigns_better-local-transport-links/content_10.html": "Having good transport links is essential whether commuting into work, taking the children to school or getting away for a break and this is why I have helped deliver rail electrification between Bolton, Manchester, Wigan and Preston. With electrification and extended platforms we have access to newer and bigger trains with more carriages.\nI have also championed access to stations in Parliament and secured funding for a new lift at Daisy Hill Station which is being installed and will be completed this year. I have taken up your concerns over the unreliable lifts at Bolton Railway Station and am pleased to see that they will be replaced this year. You need to have confidence that when you get on the train, you can get off at the station.\nAffordable public transport is especially important as we recover from the cost-of-living crisis. This is why the Government has provided funding to the Mayor of Greater Manchester to ensure that there is a £2 fare cap on busses across the region.\nLocal businesses were threatened with extra costs due to the proposed Greater Manchester charging zone. Working with the Road Haulage Association and Federation of Small Business, we successfully defeated this scheme that would have threatened jobs and added costs to your weekly shop.\nIn Horwich, I secured £12m to build a link road for the new Rivington Chase development which will take traffic off Chorley New Road and away from the Beehive roundabout. My next project is to deliver junction 7 on the M61.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_ps8-billion-boost-repair-roads/content_16.html": "The Government has announced £8 billion in funding to repair roads across the country.\nThis huge investment is part of the funding that has been redirected from HS2.\nIn Bolton and Atherton, the Council will be deciding which roads are in need of repair so I would be grateful for your thoughts on which roads need resurfacing the most.\nhttps://www.gov.uk/government/news/8-billion-boost-to-repair-roads-and-…",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_bluebell-walk-development-update/content_6.html": "When constituents raised concerns that the developers were not delivering their side of the bargain on the through road to the Bluebell Walk development, I took it up with Bolton Council.\nUnfortunately, the response showed that the current leadership are on the side of the developers, not on your side, who have to live with severe congestion on the roads every day.\nI’m going to keep championing this important issue with Bolton Council.\nSee more on my Facebook: https://www.facebook.com/ChrisGreen4BoltonWest/videos/1132666681271893/…",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_lockdown-update-1/content_15.html": "People’s views have always mattered to me and there is almost no bigger issue for residents across Hulton and Westhoughton than more house building and the pressure it puts on local roads, GP services and schools.\nThere is a huge development proposed for Hulton Park, which will have a huge impact o",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_update-rwanda-policy/content_25.html": "I was frustrated by the decision of the Supreme Court to rule against the Rwanda policy but the Government will return with further legislation to tighten up measures and to allow the Rwanda plan to start operation.\nIn the meantime many will be surprised to know that even without the Rwanda plan in operation, the U.K. is making substantial progress on illegal immigration compared to our European neighbours – do watch the clip and let me know your thoughts.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news/content_37.html": "Hulton Park Survey\nPeople’s views have always mattered to me and there is almost no bigger issue for residents across Hulton and Westhoughton than more house building and the pressure it puts on local roads, GP services and schools. There is a huge development proposed for Hulton Park, which will have a huge impact on local residents, so please take the time to fill in the survey below. https://www...",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_chris-september-newsletter-pmqs-best-shop-competition-law-and-order/content_41.html": "As I pointed out at the start of my last article, variety is the spice of life and that there was a little Green Party protest outside my office. Unfortunately, this time, there has been a little politically targeted vandalism.\nA vandal spray painted his cleverest thought “IDEAS ARE BULLET POOF” along with an anarchist symbol on my office shutters. As his carefully thought out script started drying, he noticed that he was on CCTV and only then sprayed over the camera lens. He then realised that he had not meant to say “POOF” but “PROOF” so he inserted an “R”. I don’t know if he is a little dim or that, being an ‘anarchist’ means that he doesn’t have to follow the conventions of spelling.\nWell, he did try and correct it so the silly boy is learning to comply…\nThe fabulous Belle Moi, against stiff competition, won the best shop competition and it was a delight to read through so many wonderful comments about them and so many of our local shops and salons right across the constituency.\nBeing drawn to ask a question at PMQs is always an interesting time. There are so many issues that I can raise – many are niche in terms of interest or perhaps only relate to a part of my constituency. I often try to deal with issues that are either of national significance or which most of my constituents would appreciate.\nI went with law and order which, leaving aside blips with the EU and Covid, is consistently the most important matter of concern.\nEssentially, the new leadership in Greater Manchester Police has transformed its performance with more arrests and lower crime right across Bolton West and Atherton. There is so much more to do but, whilst GMP has recruited many more police officers, much of the improvement has been due to leadership and getting the best from all parts of the force.\nAs always, if you have any concerns about anything in this newsletter, or anything else, please do not hesitate to get in touch.\n-\nYou can subscribe to my monthly e-newsletter through the following link: http://eepurl.com/bRi69P",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_privacy/content_8.html": "This document outlines how Chris Green processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Chris Green\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Chris Green.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Chris Green, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Chris Green via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_category_Media/content_39.html": "National Older Workers Week 21st November 2023 People of all ages do amazing work right across the economy. Each group faces different challenges, from someone taking their first job to someone approaching... Media\nChris goes on BBC Politics North West 8th October 2023 It was great to be on Politics North West on Sunday where we discussed HS2, Net Zero and political conferences. Labour seem to think that whilst in opposition... Media\nPlan B, ID Cards and Plan C in the New Year 13th December 2021 From the Deputy Prime Minister’s BBC Today programme interview, there was no expectation that the transmission, hospitalisation, or death from Covid-19 in... Media",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_cdn-cgi_l_email-protection/content_43.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_wigan-observer-30th-july-2019/content_36.html": "In recent years, the River Mersey has seen a significant improvement in the quality of its water and the return of sea trout, eels and lamprey. The Mersey estuary is also an incredibly important wetland and host a wide variety of birds from grey plover to lapwing, ruff and curlew. Corbyn’s folly now puts this at risk by changing the water flow and reducing the accessibility birds have to the food in the mud flats.\nLabour seem to think that their leader can pop up from London, endorse a hugely expensive and environmentally damaging project and then clear off thinking ‘job’s done’. I am not sure that the modern Labour Party really understands what protecting the environment is really about. Fundamentally, they believe that if they export manufacturing jobs overseas along with the factories and carbon emissions then they will save the planet.\nLabour have so shifted from their traditional values where they would have championed traditional manufacturing jobs into a pseudo-pressure group of virtue signallers who only care about the gesture that they are making.\nBy contrast, the Prime Minister visited the Museum of Science and Industry in Manchester to announce his vision for re-invigorating the economy, improving education and delivering on law & order.\nBoris Johnson has only been the Prime Minister for a week and already Britain’s political landscape has been transformed. He has dispelled the doom and gloom around the democratic decision to leave the European Union. A decision that was made by the people of Wigan, Leigh and Bolton and now rejected by the Labour Party who is following the Liberal Democrats into endorsing a policy of remaining in the EU.\nWe are now going to see a government and a leader who will not only champion democracy and our decision to leave the EU but also deliver on all our other priorities.\nI have been telling ministers that we need to support our police with more money and greater numbers, Boris Johnson has listened and has reaffirmed his commitment to doing just that by recruiting another 20,000 police officers. He is not waiting around to get started either as this recruitment drive is going to start in the coming weeks.\nHe is also going to toughen up the sentences that convicted criminals actually serve so serious offenders serve their sentence rather than being let out early. Unlike Labour who think that criminals are the real victims, we need a system that deters criminal behaviour in the first place.\nI was shocked when Boris Johnson said that in 2007, 1,299 offenders across the UK, with 50 previous convictions, were again convicted but were spared jail. I was not surprised to hear that the figure had risen to 3,196 by 2018. Boris Johnson, as the mayor of London, substantially cut crime especially the most serious offenses and this is what he intends to do for the country.\nWe want better standards of education in our schools and we need to fund these improvements, so I was delighted to hear that this is a key focus that the new Prime Minister will have. He is going to level up school funding so that schools and teachers have the funding that they need.\nBoris Johnson knows that some of the things that work so well in London will also work well across the rest of England. This is why he is determined to invest more money in rail infrastructure and also ensure that we are going to have full fibre internet access rolled out across the country.\nWith better transport, communications, education and jobs Boris Johnson has set out a powerful vision for the country that, as Prime Minister, he can and will deliver. The Contrast with Labour’s chosen leader who wants to block up the Mersey couldn’t be more stark.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_contact-chris/content_33.html": "Skip to main content\nChris Green\nPutting Bolton West First\nMain navigation\nHome\nAbout Chris Green\nMy Plan\nNews\nIn Parliament\nNewsletters\nContact Chris\nChris Green\nPutting Bolton West First\nContact Chris\nTweet\n.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk/content_1.html": "Protect our green spaces from over-development Repairing roads to keep us safe Latest News Hulton Park Survey People’s views have always mattered to me and there is almost no bigger issue… Bluebell Walk development update When constituents raised concerns that the developers were not delivering their… Horwich Health Hub Car Park Ever since the old leisure centre and car park were knocked down, there have… More officers on the beat to cut crime Better Local Transport Links Backing our Local Highstreets Investing in Local Health Services Bolton West\nBluebell Walk development update When constituents raised concerns that the developers were not delivering their…\nHorwich Health Hub Car Park Ever since the old leisure centre and car park were knocked down, there have…",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_campaigns_backing-our-local-highstreets/content_19.html": "Backing our Local Highstreets:\nOne of the greatest concerns constituents raise with me is the disappearance of our high street banks. Just as much of our shopping has gone online, so has our banking. Many are on the wrong side of the ‘digital divide’ but this has been a significant loss to all of us.\nI have taken this issue up with Ministers, on behalf of constituents and they, working with the banking sector have come up with the innovative idea of Banking Hubs. This idea is still very new but working with the local community, Bolton West has two of the earliest Banking Hubs to be delivered anywhere in the country.\nI am so pleased to see our high streets going from strength to strength and that’s why I always shop local.\nFor more information about what I have been doing to support local businesses, including our local town centres, see some of the news articles below.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_pothole-patrol-survey/content_9.html": "Many local residents get in touch with me from across the constituency to say that the condition of local roads is not good enough.\nBetween 2019 – 2023, Bolton Conservatives prioritised repairing roads across the whole Borough with 400 additional roads resurfaced – which equated to 9.4 miles of new road surface. Prior to this, under the previous Labour administration, the Council only resurfaced 880 yards of road in one year.\nToday, I am launching my Pothole Patrol, calling for more action to be taken to fix our local roads. Please do take a couple of minutes to let me know your views by filling in the survey below.\nhttps://www.boltonconservatives.org.uk/chris-greens-pothole-patrol",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_chris-march-2024-newsletter-older-persons-fair-ix-wireless-and-flood-prevention/content_13.html": "The Older Persons Fair I held at Brookfield Hall in Westhoughton was an amazing success though it is always rather difficult for me to judge.\nThe stall holders arrived early and set themselves up so I took the opportunity to chat about everything from local business, the work of the Bolton Job Centre and Age UK. When the doors opened to the public, I had a great many constituents forming a queue to chat about everything going on locally and nationally.\nTime flew and before I knew it, and after nearly four hundred residents from right across the constituency had turned up, the event was over. I had much food for thought and great feedback from all who attended.\nIX Wireless is never far from the thoughts of at least some constituents at any given time. I held a meeting at the proposed site of one of the monopoles, in Westhoughton to hear the concerns of local residents. I was left in no doubt of the universal opposition to the proposals especially with regard to ‘permitted development’.\nI took it up with the leader of Bolton Council, who was able to update me on the progress he was making on challenging their approach to ‘permitted development’. He has been able to use his powers to make them think again and withdraw their existing proposal for unsightly infrastructure which has now created a more positive working relationship between the Council and the business.\nIt's a great example where the local councillors, council leader and MP of all three main political parties can make a difference by working together.\nHaving had so much rain recently, I’m looking forward to the new flood prevention scheme that the Government has awarded £25m to have built on the Smithills Estate. The proposed “leaky dam” is a new approach which seems to be inspired by beavers.\nI’ll update you when I have more details of the work and I just hope that the dam isn’t too leaky.\nThe Budget was the big political event in Westminster and it built upon the Autumn Statement’s announcement that the triple lock had been retained for pensioners with another National Insurance cut for workers.\nYou can subscribe to my monthly e-newsletter here.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_campaigns_protect-our-green-spaces-over-development/content_34.html": "Housing and planning is always one of the most contentious topics across Bolton West, from Hulton to Horwich and from Blackrod to Smithills. There is demand for affordable houses, a desire to protect our local greenspaces and the need to deliver the school places and GP services that new housing needs.\nToo often, Bolton Council have not got the balance right and I have worked with residents to oppose inappropriate right across the constituency. I can’t always stop the Council from doing what it wants but I was delighted and relieved to have been able to protect Captains Clough playing fields in Smithills. There is a need for new housing but not at the expense of our green spaces and this is why I have always championed a brown field first approach which is why I am pleased that the Government has supported Bolton Council to deliver.\nI know that house building creates strain on local roads and will continue to campaign for more investment across the constituency. I secured £12m to build a link road for the Horwich Loco Works development and have been battling with Bolton Council for the new road at Chequerbent roundabout from the Bluebell Walk development to be opened and a Westhoughton by-pass to be built.\nI will continue to work with local residents to deliver more investment in local services to deliver the school places and GP appointments that these new houses bring.\nFor more information about what I have been doing to campaign for more to protect our greenspaces, see some of the news articles below.\nhttps://www.facebook.com/ChrisGreen4BoltonWest/videos/771317738514812/?locale=en_GB",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_we-need-fair-share-rail-and-bus-upgrades/content_24.html": "Welcoming a Minister to Bolton is always a great opportunity for me to promote our local interests, get our fair share of funding and show off the best we have locally.\nIt was particularly useful to have the Rail Minister, Huw Merriman, visit to not only press for rail upgrades, thank him for what he is already delivering but to also make a pitch for funding to construct Jct7 on the M61 as part of his wider responsibility for regional investment.\nThe electrification of the railway tracks through Bolton between Manchester and Preston has already been delivered and the route from Bolton to Wigan is making good progress. This, in turn, leads to upgrading the rolling stock.\nHuw’s predecessor as rail minister committed to delivering a new lift for easier accessibility for Daisy Hill railway station and the work has begun. Having a direct rail route from London to Bolton is the next project and I will keep working with him and his team to get it delivered.\nAs good things come in pairs, I was just as happy that the mayor of the GM administrative area, Andy Burnham, took a little time to visit my constituency to hear local concerns.\nThe Conservative government gave him responsibility for buses, he has made a reasonable start and that is not just limited to the new yellow paint work.\nHis ambition is for more people to make more journeys by bus which means that he has to ensure that buses run when and where you need them, are reliable and are maintained to the highest of standards.\nThe mayor has not yet said how and when he will deliver on his promises but I am here to help him.\nI am launching a campaign for my constituents for them to tell me what they want the bus timetable in the \"Bee Network\" to look like.\nMr Burnham rightfully complains about the reduction in services so I want to hear from my constituents what routes should be restored and what timetable upgrades should be made to help you get around Bolton and beyond.\nThis article was originally published in the Bolton News on 20th April 2024: https://www.theboltonnews.co.uk/news/24260504.chris-green-need-fair-sha…",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_about-chris/content_3.html": "I was first elected at the 2015 General Election, re-elected in 2017 and re-elected again in 2019 with a significantly increased majority. The constituency includes Atherton, Westhoughton, Blackrod, Horwich, Heaton, Lostock and Smithills.\nPrior to entering Parliament, I worked as an engineer in the Mass Spectrometry industry for nearly twenty years, so I feel that I bring a wealth of real world experience to the House of Commons Chamber.\nWith the Northern Powerhouse and Devolution to Greater Manchester, I want to ensure that Bolton West receives a fair share of investment, prosperity and jobs growth. We need to ensure that our economy is rebalanced between the North and South and between industry and services.\nI have previously been elected on to the Science and Technology Select Committee, Work and Pensions Select Committee and the Home Affairs Select Committee. I currently sit on the Health and Social Care Select Committee and the Backbench Business Select Committee. I have also served as a Parliamentary Private Secretary in the Department for Transport, the Department for Education and to the Leader of the House of Lords. I am currently Chairman of the All-Party Parliamentary Groups on Medical Research, Healthcare Infrastructure and Digital Skills. In addition to my role on the executive committee of the Northern Research Group, in July 2022 I was elected to the ruling executive of the 1922 Committee.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_campaigns_repairing-roads-keep-us-safe/content_5.html": "We need roads that are safe for everyone which is why I worked with the Conservative leadership at Bolton Council between 2019 and 2022 to deliver over £12m in extra funding for roads. This funding ensured that over 420 roads were resurfaced.\nI also helped deliver ‘fair funding’ which saw highways cash distributed equally across the Bolton borough. This resulted in spending increases in Horwich, Blackrod, Smithills, Heaton and Lostock.\nMore recently the Government has provided an additional £4.4m of highways funding each year for our area with a detailed breakdown to come.\nAt the Bolton Council budget meeting in March this year, Labour rejected a Conservative proposal to increase highways funding this year by £1m.\nFor more information about what I have been doing to secure more funding and to get our roads repaired, see some of my news articles below.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_myplan/content_11.html": "Before I was first elected, I was pushing for a brownfield first policy in Bolton to protect our green spaces and reduce congestion. I said that Bolton town centre had to be redeveloped with new houses and flats because that guarantees that we can protect our green spaces where we can spend time with the family and walk our dogs.\nBolton Council has the responsibility to maintain our local roads. We expect our local roads to be free of potholes because they shouldn't be a hazard to cyclists or be the cause of so much damage to cars. We deserve better roads that are safe for everyone. When the Conservatives ran Bolton Council, we could see the difference in funding not only to repair potholes but also to fully resurface many of our roads.\nHaving good transport links is essential whether commuting into work, taking the children to school or getting away for a break. This is why I have been working to secure funding for transport upgrades from rail electrification to new road infrastructure to reduce congestion. Building a bypass for Westhoughton, a new junction 7 on the M61 are key to delivering on our local needs.\nWe need good quality health care. That’s why I have been campaigning for better access to GP’s and working to secure investment in better local health facilities. So we have more appointments at convenient times, giving you and your family the opportunity to see a professional when you need it most.\nThe Government is responsible for creating a strong economy and providing stability within which small business owners, entrepreneurs and shop keepers can prosper. It has been tough in recent times but from Heaton to Horwich and on to Westhoughton, where I have my office, we can see how much our local communities value our local shops.\nThe failure of local policing was symbolised by the decision of the Chief Constable to shut down Bolton’s custody suite. He did this because the police had almost stopped making arrests and they therefore didn’t need it. The new Chief has transformed morale and reopened the custody suite because he believes that the police should be arresting criminals.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_chris-opens-new-headquarters-diamond-buses/content_21.html": "It was great to open the new headquarters of Diamond Buses last week.\nIt’s fantastic having more people work in the town centre and having our old historic and listed buildings brought back to life.\nThe staff are excited to move into their new offices and I wish them the best of luck in the future.\nhttps://www.theboltonnews.co.uk/news/23899929.bolton-diamond-buses-offi…",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_category_Opinions/content_20.html": "Remembering the sacrifice of so many 11th November 2023 Armistice Day and Remembrance Sunday, on the 11th and 12th November this year, are a time to remember the sacrifice of so many through conflict. The trauma of... Opinions\nOur PM is challenging the agenda 30th September 2023 Going Dutch means that each person has to pay their own expenses. In a restaurant, if one person chooses the expensive lobster and the other three have a pizza... Opinions\nCovid-19 and my view 19th November 2020 Many of you have asked me for my view on the government’s approach to Covid-19 and what approach I would like to see taken. I have set out my views in detail... Opinions\nWigan Observer - Tuesday 22nd October 22nd October 2019 The Prime Minister was told that no one would be able re-open the Brexit negotiations with the European Union to get a better deal for the United Kingdom but... Opinions\nWigan Observer - Tuesday 8th October 8th October 2019 On the Prime Minister’s recent visit to Manchester, Boris Johnson compared the performance and ability of mayors around the country, saying that “some are... Opinions\nWigan Observer - Tuesday 27th August 27th August 2019 How do you judge a politician? Is it what they say or how they say it; is it their style or the humour they bring with it; is it their earnestness and virtue... Opinions\nWigan Observer - 30th July 2019 30th July 2019 Jeremy Corbyn visited Liverpool to endorse the building of the Mersey Barrage to be used as an incredibly expensive way to generate electricity and, at the same... Opinions\nWigan Observer - 16th July 2019 16th July 2019 “There we have it folks, proof if any was needed that the Labour Party IS institutionally racist and will be until Corbyn and his cronies go #EnoughIsEnough... Opinions\nWigan Observer - 2nd July 2019 2nd July 2019 Parliament is plumbing the depths yet again and this political era is so different to any I have seen before. There were challenging times when Labour took the... Opinions",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_cookies/content_4.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_wigan-observer-tuesday-27th-august/content_26.html": "How do you judge a politician? Is it what they say or how they say it; is it their style or the humour they bring with it; is it their earnestness and virtue signalling? Obviously, a politician needs to be a good performer and it helps the listener if there is a little humour or passionate oratory to liven up a speech.\nUltimately, a politician must deliver and be held to account for their success or failure. Boris Johnson is widely considered to have been a successful mayor of London and delivered on law and order and on transport. He has only been Prime Minister for a few weeks but he has already set out a clear and strong agenda on a range of issues from law and order to health. He has certainly hit the ground running and we will get to judge his achievements in the coming years.\nFollowing Labour’s idea of having a powerful mayor of London, George Osborne, as Chancellor of the Exchequer, decided to roll out the idea around the country. Manchester and Bury had already rejected the idea for locally elected mayors but Salford accepted the idea by a tiny margin on a woefully small turnout.\nIf there had been an election across the whole of Greater Manchester as to whether or not we have a GM mayor I believe that it would have been overwhelmingly rejected. In fact, most local political leadership across the political divide were united in their desire for devolution but without the additional political position of mayor with all the costs and bureaucracy that go with it.\nThe theory behind having a mayor is to champion the people that they are elected to represent just as Boris Johnson did. He would never talk London down when he was mayor and he is now speaking in such a positive way for Britain as Prime Minister. This is how London was able to attract more investment and better jobs and how we, as a country, will prosper in the future.\nWhen was the last time you heard Andy Burnham speak positively about Greater Manchester?\nHis job as mayor is to be our champion and do the best for us rather than being fixated on political point scoring. I have yet to hear him say anything that would encourage a business owner to switch from investing in London or Liverpool to invest in Wigan, Leigh or Bolton.\nThe mayor of GM is also the Police and Crime Commissioner, so carries the responsibility for keeping us safe on the streets and in our homes.\nMy constituents tell me that their concerns over law and order are a top priority but why is it that we never hear from our PCC about how he is dealing with it? We are seeing reports of the police computer system failing to give front-line police the information they need when doing a home visit to a potentially dangerous person.\nThe Greater Manchester Police crime clear-up rate is far below the national average which means that criminals are not brought to justice. This damages police morale and allows the criminals to stalk the streets with impunity.\nInstead of being accountable to the voters, the mayor of Greater Manchester gets his unelected deputy to avoid answering the difficult questions on his behalf.\nI believe that the majority of Londoners would want to keep their mayor but locally, if asked, we would reject having one for Greater Manchester. We have seen Andy Burnham fail to deliver on the GMSF plan for house building, fail on improving transport and fail on law and order.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_map-locations/content_2.html": "My map\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_about-rss/content_38.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_banking-hubs-across-bolton-west-and-atherton/content_22.html": "With the closure of bank branches, I know that residents are concerned about access to banking services across the Bolton West and Atherton constituency.\nIn Horwich, a temporary banking hub has been up and running for the last three weeks and I am working with James Grundy, the MP for Leigh, to get one for Atherton too.\nIn Westhoughton, a banking hub has been selected and Cash Access UK have now found a location and are just waiting on the final confirmation. I am pleased that progress is being made and a great deal of work is being done to ensure that the Hub is opened by August at the latest.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_chris-february-2024-newsletter-banking-budget-and-batteries/content_40.html": "You can subscribe to my monthly e-newsletter here. Alternatively, email me at [email protected] to be added to my mailing list.\nThis week has been recess which is a time that I take to get around the constituency and catch up with local events and activities as well as all the paperwork that mounts up.\nIt was rather nice to visit the much anticipated Horwich Banking Hub which has now been up and running for a few weeks. The current site is only temporary but they do have another one in mind which is just going through the normal paperchase.\nThe banking hub in Westhoughton has been confirmed but has not yet been publicly announced, so I’m looking forward to that so local residents can access services they’ve missed out on for too long. I’m working with James Grundy MP to get a hub delivered for Atherton so that is a work in progress.\nAs we approach the Budget, I have been working with colleagues in Parliament to put in a range of family friendly policies with the Chancellor. Lobbying Ministers occupies much of the time of MPs in Westminster and the lion’s share of our work is around rather than in the Chamber of the House of Commons.\nThe third ‘cost of living’ payment of £299 has been sent out which makes a huge difference to those most in need.\nI objected to a new battery power storage site in Westhoughton because of the potential of a chemical fire and it has now been rejected by the planning process which is a huge relief to local residents.\nI quite enjoyed the work experience day with Ladybridge Primary School. The school invited a group of local employers to set up stalls and chat about the world of work with the children as they wandered around as though they were in a mini jobs fair.\nBy the end of recess I will have held four public meetings in Atherton, Smithills, Westhoughton and Horwich to listen to and answer any questions. Each has a different vibe and some turn into a really positive conversation amongst attendees rather than just remain a more formal Q&A with me.\nI’m holding my next Older Persons' Fair on Friday 8th March at 10am till 11:30am in Brookfield Hall, Westhoughton so do please come along.\nYou can subscribe to my monthly e-newsletter here. Alternatively, email me at [email protected] to be added to my mailing list.",
  "https_www_chris-green_org_uk_/https_www_chris-green_org_uk_news_elizabeth-park-opening/content_42.html": "It was good to be at the opening of the new Elizabeth Park in Bolton town centre last week.\nThe thing I particularly appreciated was the number of new flats and houses being built in the town centre, which is a key part of its regeneration and also an indication of all the houses that would’ve been built on our greenspaces if the Conservatives on Bolton Council hadn’t delivered.\nThe redevelopment of Bolton town centre is being part funded by the Government’s Towns Fund, that I helped to secure."
}