{
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog_tags_iranian-regime/content_21.html": "top of page\nMattie Heaven\nCONTACT\nHome\nAbout\nMissions\nNews\nContact\nMore\nUse tab to navigate through the menu items.\nNEWS & Articles\nAll Posts\nSearch\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 2023\n14 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog_tags_human-rights-iran/content_22.html": "top of page\nMattie Heaven\nCONTACT\nHome\nAbout\nMissions\nNews\nContact\nMore\nUse tab to navigate through the menu items.\nNEWS & Articles\nAll Posts\nSearch\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 2023\n14 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_why-the-uk-must-act-fast-to-expel-iranian-diplomats/content_2.html": "Why the UK must act fast to expel Iranian Diplomats\n- Mattie Heaven\n- Nov 26, 2022\n- 3 min read\nUnfortunately, we have seen that for a long time, the oldest democracy in the world, the United Kingdom, has been subjected to dangerous threats by the sworn enemies of democracy.\nAccording to published reports, a number of journalists of the Iran International Persian news television channel, headquartered in London, have received direct terrorist threats from those who are no doubt in contact with the Iranian Embassy in London. The seriousness of these threats was such that the reporters of Iran international were officially notified by the Metropolitan Police, who stated that “these threats represent an imminent, credible and significant risk to their lives and those of their families.”\nAccordingly, London’s Metropolitan Police secured a large sum of funds, which will no doubt place a burden on the taxpayers of our nation, in order to place 24-hour armed police forces outside of Iran International’s headquarters, to protect its reporters.\nI would like to point out that such threats and attacks are not new. On the 19th of August 1986, agents of the Islamic Republic of Iran assassinated Bijan Fazeli, the son of Reza Fazeli who was a critic of the Islamic Republic of Iran, in London by placing a bomb in his store.\nNot long ago, through the public release of numerous audio files, agents affiliated with Iran’s intelligence agencies sent death threats to a number of human rights activists of the International Organisation to Preserve Human Rights, an organisation registered in the United Kingdom.\nThe question that arises for British taxpayers is, what is, in principle, the benefit of maintaining diplomatic relations with a system that does not value human rights, international treaties and even bilateral relations with the United Kingdom?\nHas the attack on the diplomats of the British Embassy in Tehran, which took place on 29th November 2011, been forgotten? On that day, plainclothes security forces entered the buildings that belong to the British Embassy in Tehran and the Gholhak Gardens, a British diplomatic compound in north Tehran. While looting the classified documents and the property of the embassy, they burned the British flag like wild tribes and even disrespected photographs of Her Majesty the late Queen.\nUnfortunately, these lawbreakers were not only not tried, they were instead encouraged and praised by the leaders of the Tehran regime, who had previously occupied the embassies of the United States and Saudi Arabia.\nThe stances of Iran’s ruling regime towards the government and people of the United Kingdom have always been hostile and hypocritical. Recently, at a meeting of the United Nations High Council for Human Rights, one of the officials of the Iranian regime accused the UK’s government of being responsible for the protests that are in support of the rights of the Iranian people.\nGiven these disturbing facts, why should we risk waiting for a terrorist diplomat from the embassy of the Islamic Republic of Iran, to use their diplomatic immunity in order to give rise to a disaster within the United Kingdom? Should we not take lessons from the case of Assadollah Assadi, the terrorist diplomat of the Islamic Republic of Iran who was convicted and sentenced to life by the Belgian judicial system?\nIn light of the Islamic Republic of Iran losing all credibility internationally, with its lack of legitimacy among its own people, the obvious question that arises is, how can maintaining political relations with a terrorist regime benefit the people of the United Kingdom? The Islamic Republic of Iran has completely destabilised the Middle East through funding of terrorist groups such as Hamas and Hezbullah and continues to use diplomats as terrorists, of which at least two have been tried and convicted in formal judicial proceedings in Belgium and Sweden.\nTo conclude, I would like to suggest that supporting the people of Iran in their fight for democracy and freedom, not only aligns us with the fundamental principles of human rights but will in turn improve the security of the citizens of the United Kingdom. The most practical support that the United Kingdom can provide is to reduce political relations with Iran’s ruling regime and expel Iranian diplomats, which can pave the way to isolate this anti-human rights system in the world.\nCllr Mattie Heaven stood as the Conservative Parliamentary Candidate for Coventry South GE2019. She is the Conservative Deputy Chairman for the West Midlands Region and the Director of the International Organisation to Preserve Human Rights (IOPHR), where her work focuses on women’s rights, freedom of religion & belief and countering extremism & radicalisation.",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_why-a-free-democratic-iran-will-tackle-illegal-immigration-crisis-in-the-west/content_3.html": "Why A Free Democratic Iran will Tackle Illegal Immigration Crisis in The West\n- info958672\n- Oct 30, 2022\n- 9 min read\nUpdated: Jan 4, 2023\nAuthor: Mattie Heaven\nI feel it is necessary to inform you about one of the biggest and most dangerous challenges facing the world and human civilisation today, namely the dangers posed by the fundamentalist regime of the Islamic Republic of Iran, and its terror-related and inhuman activities, which both have international and domestic consequences for those living outside and inside of Iran. This is evidenced by the sheer number of people who have risked their lives and taken to the streets to protest against the systematic violation of human rights by Iran’s ruling regime.\nAs you no doubt are aware, today's international relations between countries are based on the system that emerged from the Westphalian peace treaty, in which the nation-state plays the main and central role, and other players such as international organisations, or other groups are subordinate to the nation or the government.\nThe national system of the country or the government have duties and responsibilities towards their nation and other governments in relation to the powers assigned to them. Undoubtedly, what determines the international legitimacy of a political administration such as a nation-state is the level of responsibility of that political administration towards its international duties and obligations, which is the basis for interaction between nation-states. As it is from this constructive interaction, that healthy international relations are established between nations. Therefore, the ‘accountability’ of a political administration is an unavoidable prerequisite for interaction with that political unit.\n‘Accountability’ is thus directly comparable to international legitimacy, and if a political administration refuses to fulfil its obligations to the international community, or worse, deliberately challenges the safety of the of the international community, then that administration can no longer be considered a legitimate entity in regards to any type of international peaceful interaction.\nAccording to these definitions, the system that governs Iran, both in terms of structure and in terms of function, is more comparable to a law-breaking criminal ring than to a government or a nation-state with recognised internal and international duties.\nIt should also be obvious that any form of negotiation and dialogue with a criminal group is equivalent to giving legitimacy and opportunity to that criminal group to continue its criminal activities.\nAlmost twenty-one years ago, in August 2002, it was revealed that Iran's ruling regime had for many years been engaged in nuclear military activities. Now, if someone casts doubts in regard to the military nuclear undertakings of the Iranian regime by stating that we cannot be one hundred percent certain about these activities, one should answer them by asking: “If these activities were not for military purposes, why did the Iranian regime decide to hide these undertakings? Isn't the reason for hiding these activities enough for us to be concerned, and suspect that they were in fact military-related undertakings?”\nFrom that time until the signing of the JCPOA agreement in 2015, (i.e. during thirteen years) four international agreements were signed by Iran, namely: Saadabad, Brussels, Paris and Lausanne, all of which were signed between Iran and the Western countries. In fact, the signing of each agreement was followed by negotiations that took place after the Iranian regime had already violated the previous agreements.\nMoreover, the negotiations in New York, Geneva 2, Geneva 5, and Geneva 6, which finally led to the signing of the JCPOA, after the final deadline was set by the western governments, all show the non-compliance of the Iranian ruling regime to the previous treaties!\nCurrently, the ruling regime in Iran is buying ‘legitimacy’ and ‘time’ from Western countries by making excuses and creating obstacles on the way to the conclusion of the current nuclear negotiations with Europe and United States, with the aim of avoiding to fulfil its obligations to the international community.\nBy now it should be clear to everyone that the goal of the regime ruling Iran is to make pretexts and create new obstacles on the way to an agreement, in order to buy time for bringing its military nuclear program to pass the ‘point of no return’ - which according to recent reports, Iran is close to reaching. However, what many do not know is that the inhuman criminal ring ruling Tehran, along with ‘buying time in negotiations’, has for years been waging an undeclared war of attrition against Western civilisation and its values! With the aim of destroying Western civilisation, through promotion of fundamentalism, terrorism, drug trafficking, human trafficking, money laundering, the development of a missile program, along with the completion of nuclear military programs, just to name a few of the Iranian regime’s arsenal in this war of attrition.\nIn implementing this strategy, the ruling system of Tehran has focused their efforts on completely illegal and criminal activities, some of which are mentioned below:\nOrganised drug trafficking:\nAccording to numerous reliable reports, the Islamic Revolutionary Guard Corps (IRGC) is organising transcontinental drug trafficking networks both in Iran and in many parts of the world, especially in Europe, in order to undermine the foundations of modern civilisation. According to the published statements of some former officials of the IRGC, the motivation of this terrorist militia is to organise large drug trafficking rings in order to generate hundreds of billions in income, as well as to attack the foundations of civilisation in Western countries.\nAs an example of this strategy, we can point to the collusion and close cooperation of the IRGC with the largest drug cartel in Mexico. According to credible reports, one of the officers of the IRGC has previously been involved in organising the largest drug trafficking network in Eastern Europe. These rings have also taken over drug groups in Mexico and North America! According to American sources, the goal of the IRGC is to inflict damage on the very fabric of Western societies.\nReports also show that the Islamic Republic organises activities related to smuggling from the regional to global level. As an example, one can point to the discovery of the largest drug shipment in the history in Italy, which according to Italian police reports, the shipment belonged to Lebanon's Hezbollah, which is one of the terrorist groups affiliated with the IRGC.\nAnother recent case is the discovery of seven hundred kilograms of heroin in the city of Hamburg from an Iranian drug trafficking ring. According to the announcement by the German police, this shipment, which is considered the largest shipment of drugs discovered in Germany history, was sent to Germany from Iran. It must also be noted that it is impossible to send this amount of drugs from Iran to Europe without governmental assistance in Iran.\nEuropean governments should note that fighting the consequences of this vast amount of drugs entering their countries is much more expensive than the little benefit they can get from continuing their diplomatic relations with the ruling regime in Iran. This is particularly crucial as the current regime ruling Iran seems to have weakened so much that many predict its collapse to be imminent.\nIn addition to obtaining large incomes, and inflicting blows to Western societies, utilisation of the capacities of these criminal networks around the world to service the terrorist aims of the Iranian regime is yet another important motivation for IRGC in organising drug trafficking activities around the world. To prove this claim, we can refer to the report of American sources, according to which the liaison between the IRGC and drug cartels in Mexico were behind the planned attempt to assassinate the Saudi ambassador in Washington! American officials even believe that the main motivation of the IRGC in organising drug trafficking networks in Mexico and North America is to establish and finance terrorist activities and proxy wars, with one of its sole purposes, as openly stated by Iran’s ruling regime, being to wipe Israel off the map.\nThe policy of encirclement of cities by sending waves of hungry migrants:\nOf course, the ruling regime of Iran has adopted a different strategy compared to Mexico and North America in relation to Europe - due to its geographic proximity as well as the passivity and inaction of European governments in relation to the destructive policies of the Islamic Republic.\nFrom this strategy, one can conclude that the undeniable long-term strategy of the Islamic Republic of Iran towards Europe is the implementation of Mao Zedong's ‘city siege’ policy. As you may know, Mao Zedong believed that in order to establish a revolution, the hungry rural people should besiege the rich cities and finally capture them. Based on this policy, the rulers of Tehran intend to push their economy towards exhaustion, weakness and finally bankruptcy in order to send waves of hungry refugees to European countries after promoting addiction and drugs in European societies. In the first stage of this plan, the rulers of the Iranian regime are trying to promptly increase the country's population by imposing penalties on population reduction strategies, and during the next stage through deliberate social, economic and even environmental crises, force Iranian citizens to emigrate! However, this is not at all limited to Iran alone, as Iran’s destructive policies through funding of terrorist organisations and proxy wars have destabilised the entire region of the Middle East, causing mass emigration from Iran’s neighbouring countries too.\nIn this next stage, the institutions related to human trafficking activities affiliated with the IRGC will mobilise mass migration, by giving each migrant small amounts of money, and then sending them to Turkey and finally to Greece and sometimes even to Great Britain! Thereby, depleting the economic power of European societies, all of which is only a small part of the short-term goal of the ruling regime in Iran in sending waves of refugees. The next phase of their program is to disturb the demographic fabric of European countries through the benefit that immigrants gain once they are settled in Europe: namely through their voting rights, by increasing cultural gaps within the fabric of European culture, and ultimately promoting fundamentalism - all of which are part of the long-term goals of the Islamic Republic of Iran!\nThe tragic aspect of this issue is that within European societies, their population are decreasing and are aging, and in the near future, there will be an urgent need for a young mobile labour force. By calculating these parameters, Iran’s occupying regime is covertly, and actively affecting the demographic structure, and ultimately the future of European societies.\nWhat is also clear is that according to the 20th report of the US Department of State, Iran is not a member of the UN TIP 2000 protocol. Also, the government of the Islamic Republic of Iran does not have an international coordinating body to fight human trafficking. Moreover, the Iranian government does not allocate the necessary resources to address human trafficking, and does not even provide training to its diplomatic staff on anti-trafficking activities. The Iranian regime does not clarify its undertakings and policies to fight human trafficking, and it does not take any measures to raise awareness or prevent against human trafficking!\nMoney laundering:\nThe Iranian regime possesses a widespread and highly suspicious web dedicated to money laundering. As you no doubt know, the name Iran has been included in FATF's blacklist since March 2nd, 2018. According to the official request of this organisation, all countries that have some kind of connection with Iran should take countermeasures in financial exchanges with the Iranian regime, and make sure that the risk of money laundering and terrorist financing from within Iran's banking system does not spread to other countries.\nBased on the solid and inviolable evidence the Iranian regime’s money laundering policies, and actions are in complete agreement with the grand strategy of Russia's globalism. In fact, just as the ruling regime of Iran has organised militia proxy groups all over the world, especially in the Middle East and North Africa, one of Russia's proxy groups is also operating in the Middle East region. All of which shows the closes ties between Russia and Iran in their joint anti-western strategies!\nIn this way, the ruling regime in Iran does not serve as the protector of the interests of the Iranian people - it is the protector of the long-term interests of Russia, and from this point of view, the behaviour of the Islamic Republic’s regime towards Iranian citizens is just like the behaviour of Russia towards the citizens of Ukraine. Therefore, Iran’s ruling regime does not fulfil its obligations and responsibilities towards its citizens as it is customary in other countries.\nAs stated at the beginning of this letter, the ‘legitimacy’ and ‘time’ given to the Iranian regime by Western countries’ continual attempts to negotiate with Iran, are costs that clearly benefit the Iranian regime, as the Iranian regime is depended on such lifelines that such negotiations with the West provide it.\nIn fact in the case of Iran, negotiating with a group of criminals and hostage takers is equivalent to giving them these two precious elements, which they happen to need very much, namely ‘time’ and ‘legitimacy’.\nUndoubtedly, the criminal group ruling Iran lacks any legitimacy, and the negotiation of Western governments with them, especially the British government, which is known as the cradle of democracy in the world, will give legitimacy, albeit limited, to a system that is currently facing and struggling with a severe crisis of legitimacy.\nAs the world is currently witnessing the nationwide public demonstrations that are currently taking place in Iran in response to the government’s murder of an innocent young girl who was brutally killed by the security forces due to a blow to the head and a fractured skull within a few hours. This nationwide demonstration and the spontaneous slogans chanted by the people, clearly shows the undeniable fact that the ruling regime in Iran lacks any popular base. Therefore, negotiations with such a group, even if it leads to an agreement, regardless of its harmful political consequences and the damage it can inflict upon the international image and prestige of the United Kingdom, it is legally invalid. In addition, such negotiations can cause irreparable damage to the interests of the United Kingdom in the event of the inevitable fall of the current anti-democratic occupying regime of Iran.\nGiven all the above facts, I ask that the government of the United Kingdom should seriously reconsider any negotiations or any types of interactions with the Iranian regime. As by doing so, they will only empower this corrupt regime to continue its inhuman, criminal, and subversive actions, all of which endanger, and undermine Western social values on continual bases!\nAbout the author :\nMattie Heaven is a policy and advocacy advisor to the International Organisation to Preserve Human Rights. Conservative Deputy Chairman for West Midlands Region.\nShe was the Parliamentary Candidate for Coventry South in the 2019 general election.",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog_tags_iran/content_18.html": "top of page\nMattie Heaven\nCONTACT\nHome\nAbout\nMissions\nNews\nContact\nMore\nUse tab to navigate through the menu items.\nNEWS & Articles\nAll Posts\nSearch\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 2023\n14 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_from-conflict-to-unity-international-human-rights-day/content_23.html": "From Conflict to Unity -International Human Rights Day\n- Mattie Heaven\n- Sep 14, 2022\n- 1 min read\nUpdated: Nov 10, 2022\nOn 10th December IOPHR held a webinar titled “From Conflict to Unity - Learning from Beacons of the Past”, with the aim to commemorate the International Human Rights Day, as well as to celebrate the lives of four renowned human rights advocates in history namely: Mahatma Gandhi, Dr Martin Luther King Jr, Mother Teresa and Dr Noor Ali Tabandeh, and their contributions to the global human rights movement.\nMattie Heaven, the chair of the event, began the webinar with her opening remarks on the importance of International Human Rights Day, and celebrating the day that the United Nations declaration of human rights was signed by different countries as well as the importance of the achievements of the life of four personalities for discussion at this occasion. Ms Heaven also stated that these four individuals should be considered as role models for humanity, and their efforts should not be forgotten.\nThe webinar was then opened officially by the Lord Mayor of Coventry, Ann Lucas, who stressed on the important principle of the City of Coventry, as a City of Peace and Reconciliation, especially in the context of being bombed heavily during World War II. She explained it is a city that cherishes the history of peace, and reconciliation with other cities and countries, who have suffered in a similar way. As Coventry has a history of welcoming people from other cultures, who are trying to rebuild their lives. This is why Coventry is the first city to twin with other cities, in order to increase unity between different cultures....",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog_tags_israel/content_19.html": "top of page\nMattie Heaven\nCONTACT\nHome\nAbout\nMissions\nNews\nContact\nMore\nUse tab to navigate through the menu items.\nNEWS & Articles\nAll Posts\nSearch\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 2023\n14 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog_tags_palestine-conflict/content_24.html": "top of page\nMattie Heaven\nCONTACT\nHome\nAbout\nMissions\nNews\nContact\nMore\nUse tab to navigate through the menu items.\nNEWS & Articles\nAll Posts\nSearch\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 2023\n14 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com/content_1.html": "Mattie Heaven\nQuick Brief\nWHY A FREE DEMOCRATIC IRAN WILL TACKLE ILLEGAL IMMIGRATION CRISIS IN THE WEST\nOne of the biggest and most dangerous challenges facing the world and human civilization today is namely the dangers posed by the fundamentalist regime of the Islamic Republic of Iran, and its terror-related and inhuman activities, which both have international and domestic consequences for those living outside and inside of Iran.\nThe system that governs Iran, both in terms of structure and in terms of function, is more comparable to a law-breaking criminal ring than to a government or a nation-state.\nby Mattie Heaven\nAbout\nI am a proud member of the conservative party.\nMy passion for being conservative has led me to be very active locally, nationally, and internationally in areas of human rights, mental health, entrepreneurship, and business. I have always demonstrated resilience, drive, and conviction, which are evident from my ongoing campaigning and the results I have produced.\nAs a businesswoman and entrepreneur, I am passionate about promoting and encouraging businesses and young entrepreneurs to start up their own businesses to create more growth and opportunity. In addition, due to my educational background (BA Hon in Crime, Deviance, and Society), I am motivated in focusing on the issue of policing and crime prevention, as well as raising awareness and further promoting well-being and mental health in professional practices.\nMission\nWe must build a sustainable society that guarantees our long-term future. We can only do this by changing policies, lifting small businesses, promoting innovation, and defending our values. We must guarantee a sustainable policy that considers all aspects of society and future generations.\nIt is estimated the health effects from air pollution exposure cost the NHS and social care services more than £40 million each year. Even the smallest improvement in exposure could reap rewards for children and the UK taxpayer - UNICEF\nLATEST NEWS\nFollow up on the latest news and articles by Mattie Heaven regarding local, domestic and international issues. Mattie Heaven is a frequent speaker on human rights, women's rights, freedom of religion and belief, sustainability, and mental health and wellbeing. Since the nationwide uprising in Iran started due to the killing of Mahsa Amini in September of 2022, Mattie Heaven has been placing a particular attention on the issues around human rights violations in Iran, Iranian policies and international relations, and the direct impact that Iran's ruling regime has on our safety and security here in the UK due to Iran's terror activities and radicalisation.\nSUBSCRIBE\nThe Conservative party\nRead more",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_contact/content_13.html": "Home\nAbout\nMissions\nNews\nContact\nMore\n.\ninfo@mattieheaven.com\nFacebook\nInstagram\nTwitter\nThanks for submitting!",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_palestinian-issue-a-divert-for-iran-leader-s-shortcomings/content_9.html": "Palestinian Issue, a Divert for Iran leader’s shortcomings\n- Mattie Heaven\n- Sep 6, 2023\n- 14 min read\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE, Bahrain and recently Saudi Arabia peace agreement, or the Abraham Accord, will certainly unite multiple nations and groups, and ultimately isolate those who thrive from the existence of conflict and war!\nThe vast majority of people in Arab countries are seekers of peace in the region and encourage the development of healthy civil and political relations with Israel and the Jewish people. There are however, a number of extremist groups within these countries who use extreme rhetoric and anti-Semitic propaganda to disrupt the peaceful will of the people in Arab nations. Similarly, the vast majority of Iranians want peace in the region, whilst the ruling regime in Iran has been advocating for the total elimination of Jews for the last 44 years, using the Palestinian conflict as a pretext for their political gains. Whereby the Supreme Leader of Iran, Khamenei, called for the eradication of the Jews by referring to the “final solution”, in which he is asking all the Muslims around the world to roll up their sleeves, and to take action in fighting the Jews in Israel in order to protect Palestinians.\nMore than twenty years after the end of the Cold War and the change in the nature of the international system from a ‘Hard Bipolar’ to a ‘Soft Multi-polar’, the Palestinian conflict is still one of the unresolved problems left over from the post-World War II era. Despite the recent developments, these efforts have not yet given the outcome many would have hoped for.\nOn the surface, it seems that the Palestinian conflict itself should not have been such a complex and insurmountable issue to become one of the world’s longest running controversial conflicts. As in other parts of the world similar problems, through similar solutions and projects have been successfully resolved. Resulting in people with different religions or races coexisting peacefully. Examples include the successful coexistence of the Walloon and Flanders groups in Belgium especially in Brussels.\nThe Palestinian conflict remains unresolved, whilst the interference of the ruling regime in Iran and its systemic abuse of this conflict for political leverage has been the source of many other problems in the international arena like the 2 propagation of fundamentalism, and the emergence of terrorist groups such as al-Qaeda. Which had led to the emergence of many anti-humanitarian tragedies like 9/11 and other terrorist incidents, further leading to a series of unavoidable chain reactions, with dramatic and irreversible effects on human life.\nTo understand the complexity of the Palestinian question, one must realise that in history, there has never been an independent state named \"Palestine\". Palestinians have always been a part of another empire or state.\nIn 1921, a new state called \"Trans-Jordan\" was formed under the rule of the Hashemi Dynasty, which included modern-day Iraq and Jordan, and the Palestinians lived in the westernmost province of the newly established country, the West Bank.\nThere are many documents showing that during the nineteenth century, the number of Arabs living in the region of Israel was less than the number of Jews. In fact, the migration of non-native Arabs to Palestine intensified when Jewish settlers in the late 19th century made great efforts to dry up swamps to eradicate malaria, creating the conditions for intensive migration. Non-indigenous Arabs from other parts of the Ottoman Empire came to the region of Palestine and Israel in the early years of the twentieth century.\nLater, on May 15, 1948, a day after the declaration of Israel's existence under UN Resolution 181 of November 29, 1947, UN General Assembly, some military units from Lebanon, Syria, Jordan, Saudi Arabia, Iraq, Yemen, Egypt, as well as volunteer battalions from other Islamic countries, who rejected the UN resolution, attacked Israel.\nThis attacking force was repelled by the Israeli army, and as a result suffered heavy defeat and was forced to retreat. Following this declaration, many Palestinians started to leave Israel voluntarily. However, those who remained were welcomed as citizens of the state of Israel.\nIn the following years, the Arab states did not give up and tried to recuperate their losses. Perhaps, the establishment of an organization called the ‘Palestine Liberation Organization’ in 1964, could be seen as a prelude to the 1967 conflict. The PLO was an organization composed of various groups, mainly left-wing Palestinians, formed in 1964 with the approval of the then pro-soviet government of Syria and the government of Jordan, as residence country of Palestinians, in order to mobilize and implement all their capacities and possibilities in the coming war against Israel.\nIn its first statement, regardless of its historical background, and geopolitical realities and facts, the PLO called, for the first time, for the establishment of an independent ‘Palestinian State’ and the annexation of Israel in favour of Palestine. Since then, the PLO has been used by the Syrian and Jordanian governments, and to some extent by Egypt, as a tool to contain, and direct the Palestinians. For example, during the first months of 1967, Syria, Egypt, and Jordan called on Israeli Arab residents to leave the country, as soon as possible to protect themselves. But after the Six-Day War between the Arab states and Israel, and the complete defeat of the Arab states in this war, millions of Palestinians who left Israel voluntarily, and entered the neighbouring Arab countries, were no longer allowed to return to Israel.\nIn this way, a wave of Palestinian immigrants emerged in Egypt, Syria, Jordan and Lebanon. But, since none of the host countries had ever been interested in entertaining uninvited guests, they set up refugee camps in the deserts away from all the basic facilities, which made life harder for these immigrants than the life they had in Israel. The inhumane and deplorable conditions in the Palestinian camps, especially in Jordan and Lebanon, attracted the attention of the world's public opinion, and for the first time a problem called the ‘Palestinian Conflict’ troubled the international community.\nIt is important to emphasize that the Palestinians were never forcibly expelled from Israel, but voluntarily left their homes, and went to neighbouring countries to cooperate with the project of extermination of the Jews, which was designed, and implemented by the Arab governments.\nThus, it becomes clear that the Palestinians unknowingly became the agents of the aspirations of a number of Arab statesmen.\nNow, one may ask, how and when did Iran enter the Palestinian conflict? In this context, it is important to note that a series of events that led to the fall of the Shah and the change of regime in Iran in February 1979, were planned and carried out by various Iranian opposition groups, who had received training in numerous Palestinian and Lebanese camps. The Palestinian groups such as Al-Fatah, the People's Front for the Liberation of Palestine and the Democratic Front for the Liberation of Palestine, as well as the Amal Movement in southern Lebanon, had a stake in the future of the Iranian government. As a result of the Islamic Revolution in Iran, a wealth of oil and gas resources worth hundreds of billions of dollars, in a land with large human resources, had been seized by a group that was trained by Palestinian groups.\nAfter the Islamic Revolution, it became clear that Iranian leaders intended to use the conflict of Palestinians as a pressure tool; however not in the same way that the leaders of the Arab states had used. The Islamic Republic of Iran’s ultimate goal was to establish a single world ‘Islamic government’ in Tehran. To do so, they needed to impose their leadership on the Islamic world, in order to create an \"Islamic superpower\" or, as they call it, an Islamic ‘Umm al-Qura’ in Tehran. This gave the newly formed Islamic regime a legitimacy that they needed.\nUmm al-Qura is a theory that explainsthe Islamic Republic of Iran’s foreign policy in regards to the expansion of its boundaries of power and position in the Islamic world. This theory was proposed by Mohammad Javad Larijani, the Iranian deputy Foreign Minister in 1981. According to this theory, the Islamic world is a single nation, and the criterion for the unity of the nation is in its leadership. If a country can raise its level of leadership beyond its territorial boundaries by forming an Islamic government, it will be in the position of being the leader of the Islamic world.\nIn order to establish such leadership, the Iranian leaders used the case of Palestine as a ‘pressure tool’ to weaken and destroy Arab governments. Almost from the very beginning of the establishment of the Islamic State in Tehran, the leaders of Iran, especially Khomeini himself, blamed the failure of the Palestinian conflict, on the spoiled and corrupt structure of ruling governments in Islamic countries, especially the Arab states who were friendly towards the United States. Therefore, the Iranian regime consistently invited the all Arab and Muslim nations to rise up against their governments and overthrow them. For example, when Khomeini called on the Egyptian people to rise up against then-Egyptian President Hosni Mubarak.\nIran's leaders cited and used the Camp David Peace Agreement as an example, in order to identify what they deemed as traitorous leaders in the Islamic world. This was an attempt to ignite Arabs to rise up against their governments and to overthrow their leaders.\nThe Camp David Accords was signed on September 17, 1978 by then-Egyptian President Anwar Sadat and First Deputy Prime Minister of Israel Menachem Begin. Although this was not directly related to the Palestinian conflict, it was the first lasting peace treaty between the two sides in the Middle East, after thirty years of conflict, and at least five periods of bloody strife. It provided a clear vision for the final settlement of the Palestinian conflict as well as possible 5 future steps. The outlook at that time was so bright and promising that it led to the awarding of the Nobel Peace Prize to Anwar Sadat and Menachem Begin.\nIt was clear that with the establishment of peace in the Middle East and the peaceful resolution of the Palestinian conflict, the very valuable tool being used by the Iranian leaders, would lose its power. Therefore, it was in the Iranian regime’s best interest to set out a strategic plan to stop the peace process in the Middle East at all costs.\nIn order to counter the establishment of a lasting peace in the Middle East, Iran's leaders put the project of promoting and strengthening fundamentalism on their agenda. As a result, two years later, the clear vision of a lasting peace in the Middle East was destroyed by the unexpected assassination of Mohammad Anwar Sadat, the Egyptian President by several Egyptian army officers who were members of the Islamic Jihad terrorist group. Khalid bin Ahmad Shawqi Islambouli (January 15, 1955 in Mania, Egypt - April 15, 1982) along with several of his associates, were responsible for this assassination on October 6, 1981.\nDespite diplomatic traditions, the Iranian government supported the assassination of Mohammad Anwar Sadat and even named a street in Tehran in the memory of his assassin, Captain Khalid Islamabouli. It is worth mentioning that one of Captain Khalid Islambouli's companions during the assassination of the Egyptian leader, was Egyptian doctor Ayman Zawahiri, who later created the al-Qaeda terrorist organization with Osama bin Laden. He was tried at the time along with Khalid Islambouli, but was sentenced to prison and later, after his release from prison, along with bin Laden, organized terrorist attacks against Western interests.\nAlthough Khaled Islambouli is known around the world as a ‘terrorist’, the Islamic Republic of Iran has called him a \"martyr\" which garnered support among large number of Arab citizens, who were outraged and felt humiliated by the inaction of their governments against Israel.\nIn fact, Iran's leaders have used a ‘pressure tool’ called ‘Palestine’ to vent the rage of a few generations of Arabs, and used it as a powerful instrument towards achieving their ambitious goal of becoming a super power.\nIn the following years, Iran was able to frustrate Arab citizens, with what they called the failure of Arab governments, through the use of propaganda, as well as engineering the hatred of humiliated Muslims, by convincing them that the 6 only possible solution to the Palestinian issue is the one designed by the Islamic Republic of Iran.\nAt the same time, we can understand the importance of the Palestinian case for Iran's leaders when we become more familiar with the challenges that Iran faces in establishing its leadership role in the Islamic world.\nIt should be noted that Iran was not alone in claiming to be the leader of the Islamic world, as countries such as Egypt, Saudi Arabia and Turkey have similar claims. Meanwhile, Egypt on the one hand was less an issue for Iran, due to the ten-year isolation caused by the signing of a direct peace treaty with Israel, and on the other hand the fact that Egyptian leaders were more willing to play a leading role in the Arab world rather than the Islamic world.\nHowever, Saudi Arabia and Turkey each have their own reasons for claiming leadership in the Islamic world: Saudi Arabia has traditionally been a centre for Islam and the Qur'an, as well as holding the two holiest Islamic sites in the world, Mecca and Medina. Moreover, it welcomes more than two million Muslim pilgrims each year to perform the annual Hajj. Also, Arabic is the mother tongue of all Arabic-speaking countries, and because Arabic is the language of the Qur'an, it is respected by many Muslims. Furthermore, in recent decades, the high oil revenue has made it possible for Saudi Arabia to play a greater role in the Islamic world, by providing generous aid to the Islamic world, especially to various Palestinian organizations and groups.\nTurkey, on the other hand, also has many reasons to play a leading role in the Islamic world, as it sees itself as the successor to the Ottoman Caliphate, which encompasses all the lands of the Western Caliphate and Arab countries, including Syria, Iraq, Saudi Arabia and North Africa, and parts of the Balkans in Southeast Europe. All of which were under the control of the Ottoman emperors for around five hundred years, and thus called themselves the caliphs of the Muslims. At the height of their power, the Ottoman Caliphate advanced to the heart of Europe and even laid siege to Vienna.\nTurkey is considered by many to be one of the most modern Islamic countries, and possesses one of the most powerful military forces among Islamic countries. Moreover, Saudi Arabia and Turkey are predominantly Sunni. The Saudi government is officially a Sunni Wahhabi, and although the Saudi government has greatly reduced its influence in recent years, Saudi Arabia is considered by many Muslims to be an example of an Islamic state.\nThe Turkish state is officially non-religious, but the presence of an Islamic party that has apparently come to power through democratic channels has effectively made the country an ideal example for some Muslims in other countries.\nIran, however, lacks all these advantages. Under Iran's constitution, the government has officially chosen the Shiite religion, which means that Iran can at best claim control of only ten percent of the Muslim population. It should be noted that the Sunni religion includes four groups that have a tacit agreement with each other, and large part of the Muslim population around the world consider the Shiites infidels and atheists. Now, if we know that 90% of the world's Muslim population is Sunni and only 10% of them are Shiites, then we can understand how difficult it is for Iranian leaders to impose their leadership on the Islamic world.\nIran does not have the necessary historical background to play a leading role in the Islamic world either. Given the wars that took place between Iran and the Ottoman Empire during the seventeenth and eighteenth centuries, many religious leaders in the Islamic world blamed Safavid Iran for the failure of the Ottoman Caliphs to expand Islam throughout Europe. However, despite all these facts, the Iranian authorities consider Iran to be the Umm al-Qura of the Islamic world.\nIran uses domestic and foreign media as propaganda tools, all of which are financed by Iranian money, such as \"Press TV\" and \"Al-Alam\" where the leader of Iran is referred to as the ‘leader of the Muslims of the world’. However, Iran was at war with its Muslim neighbour, Iraq, for eight years, and is considered by many Muslims to be an enemy.\nSo, how can the Iranian government officials impose the claim of leadership and guardianship over other Muslims? The answer to this question can be summed up in two words: ‘Palestinian conflict’. The Iranian rulers by raising the Palestinian issue, as the first priority for all Muslims around the world, are able to divert the Muslim world’s attention from Iran’s shortcomings. This point is not only relevant in terms of international dimension, but also internally.\nThe Palestinian case is also tied to the ‘crisis of the legitimacy’ of the ruling regime in Iran, and provides one of the main reasons for Iran's leaders to survive for one more day. For more than forty years, Iran's leaders, by raising and fuelling the Palestinian conflict, have been able to control and maintain a ‘revolutionary war’ condition inside of Iran. By this manner, Iran has managed to control their 8 own citizens whilst being able to avoid fulfilling the minimum obligations to provide a sustainable and a flourishing society, and at the same time, to legitimise the formation of an Islamic superpower.\nStatistics show that the establishment of an Islamic regime in Iran since the revolution has not only failed to benefit Iranians, but has cost Iran more than hundreds of billions of dollars in foreign exchange resources. All of which has completely destroyed the country's domestic infrastructure, causing millions of Iranians to live below the poverty line, not to mention the dire human rights conditions.\nTherefore, any progress towards the establishment of peace in the Middle East means the destruction of the Islamic State in Iran that always tried to garner its legitimacy from the ‘permanent battle’ with the hypothetical enemy. In this regard, the two theories of ‘Permanent Revolution’ and ‘A World in Revolution’ are considered the two main pillars of legitimacy for the system, which mainly define the goals of the Iranian Foreign Policy, and inevitably lead to the theory of issuing a revolution, the translation of which outside Iran is synonymous with organising disorder and instability all over the world. These include proxy wars within the region, propaganda through media channels, cyber wars and promoting fundamentalism and radicalisation.\nDisagreements between Palestinian organizations and Iranian leaders from the very first days after the establishment of an Islamic regime in Iran showed that the fate of the Palestinian people had no place in Iran's macro-policies, and that Iranian leaders viewed the case of Palestine only as a tool. These differences have led Iranian leaders to distrust existing Palestinian movements and to pursue \"loyal and obedient\" organisations. As a result, Hezbollah was born from the Amal movement in southern Lebanon, and then created terrorist organizations such as the Palestinian Islamic Jihad Movement or the Islamic Resistance Movement. Although Hezbollah was a Shiite organization, the other two were Sunni, and Iran created them as a model for Sunni organisations that could, and should follow the Shiite State of Iran.\nIt should be noted that although Iran is recognised as a country with a Shiite majority, the government has never published reliable statistics. Iran has a truly diverse population based on many different religions and cultures, where almost all province borders are inhabited by Sunnis. Even within the Shiite population, most people oppose government policies, such as the largest Sufi order of 9 Gonabadi dervishes, which accounts for around eight million of the national population.\nSince the Islamic Revolution in 1979, Iran has never taken the Palestinian issue genuinely and always tried to use it as a tool for their own advantage, in order to reach their ambitious goals at the cost of the suffering of the Palestinian people.\nIranian leaders also, dreaming about the destruction of Western civilization, have repeatedly described Israel as a ‘cancer node’ that needs to be removed and have envisioned Palestine as the decisive battle in their war with the Western world. They also look at the Palestinian conflict as a useful tool for their dangerous adventures and have never given the Palestinians the right to decide. Their goal is to strike a blow at Israel and the West through Palestine so that they are able to impose their leadership on the entire Arab and Islamic world and fulfil the dream of an Islamic superpower under the rule of Iranian leaders as described. Iran's undeniable military cooperation with terrorist organizations such as al-Qaeda and the Taliban can be explained in this context.\nFor Iranian leaders, the establishment of an everlasting peace between Israel and its neighbours is the worst-case scenario. In this frame, Iran’s unconditional support of regime of Assad in Syria can be better understood. They have created their own reliable organizations for Palestinians such as ‘Hamas’ and the ‘Islamic Jihad Organization’, to block any peace between Israel and the Palestinians. Terrorist operations are manually being carried out, creating an inflamed situation on the necessary occasions.\nThis article has by no means attempted to provide a solution, as we have only scratched the surface on this complex issue, and the influence of the Iranian Regime. However, it is clear thus far, that so long as the Islamic Republic of Iran persists, so will the biggest opposition to the establishment of peace between Palestine and Israel and the entire middle East.\nBy Cllr Mattie Heaven",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog_tags_palestine/content_12.html": "top of page\nMattie Heaven\nCONTACT\nHome\nAbout\nMissions\nNews\nContact\nMore\nUse tab to navigate through the menu items.\nNEWS & Articles\nAll Posts\nSearch\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 2023\n14 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog_tags_irgc-terrorist-organisation/content_20.html": "top of page\nMattie Heaven\nCONTACT\nHome\nAbout\nMissions\nNews\nContact\nMore\nUse tab to navigate through the menu items.\nNEWS & Articles\nAll Posts\nSearch\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 2023\n14 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_who-we-are/content_15.html": "about\nI am a proud member of the conservative party.\nMy passion for being conservative has led me to be very active locally, nationally, and internationally in areas of human rights, mental health, entrepreneurship, and business. I have always demonstrated resilience, drive, and conviction, which are evident from my ongoing campaigning and the results I have produced.\nAs a businesswoman and entrepreneur, I am passionate about promoting and encouraging businesses and young entrepreneurs to start up their own businesses to create more growth and opportunity. In addition, due to my educational background (BA Hon in Crime, Deviance, and Society), I am motivated in focusing on the issue of policing and crime prevention, as well as raising awareness and further promoting well-being and mental health in professional practices.\nMattie Heaven",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_iran-a-free-democratic-country-or-a-dictatorship-without-borders/content_7.html": "Iran: A Free Democratic Country or a Dictatorship Without Borders?\n- info958672\n- Nov 1, 2022\n- 3 min read\n02 July 2019\nUK Parliament LONDON\nOn the 2nd of July 2019, the International Organisation to Preserve Human Rights with the sponsorship of Bob Blackman, MP, held an important event on human rights violations of the Iranian regime within the UK Parliament, under the title of: “Iran: A Free Democratic Country or a Dictatorship Without Borders?”.\nThe panel of speakers at this event included: Mr. Bob Blackman MP, Professor Javaid Rehman, UN Special Rapporteur on Human Rights in Iran, Mr. Richard Ratcliffe, husband of Mrs. Nazanin Zaghari-Ratcliffe, British-Iranian dual national who was arrested and has been held in Evin Prison of Iran for the past three years, Ms. Mattie Heaven, Policy and Advocacy Adviser for IOPHR on Counter Radicalisation and Extremism, women’s rights and human rights activist, Dr. Hamid Gharagozoloo, US representative of IOPHR and human rights activist, and Ms. Simin Fahandej, representative of the Baha’i international community’s office in Geneva to the UN.\nThe event began with Bob Blackman, the chairman of the event, speaking about the pain and suffering that the Iranian regime has inflicted on its citizens and its neighbouring countries over its 40 years rule.\nThe second speaker, Richard Ratcliffe spoke about the unjust imprisonment of his wife in Iran on baseless trumped up charges, and the support he has received from all Iranians both in Iran and outside in his efforts to free his wife. He also talked about the plights of other political prisoners who share the same unjust fate of his wife in Iranian prisons.\nThe next speaker at the event was Professor Javaid Rehman, who spoke about the unjust constitution of Iran that openly discriminates against, and oppresses non-Muslims, in particular Baha’is and Christian converts. He also discussed the biased ways by which Iran’s Judicial System implements the Iranian Penal Code, and that many executions are carried out on the basis of minor crimes and also the numerous child executions which occur in Iran, even though Iran is signatory to UN Human Rights Conventions prohibiting the executions of minors.\nFollowing Dr. Rehman, Ms. Mattie Heaven discussed how in reality every Iranian citizen who disagrees with the extremist ideology of the Iranian government, is a persecuted minority as the regime readily discriminates, and oppresses anyone who it deems as a threat to its survival. This includes women who stand up to the regime’s misogynistic policies and also, even Muslims like Sunnis and Sufis who do not follow the regime’s extremist interpretation of Islam. She also highlighted the case of Mr. Salas, a Sufi who was executed on false accusations and charges in June 2018, after a speedy trial without due process. She ended her speech by stressing that “Extremism should not be tolerated in any form, and the Iranian regime is the very definition of extremism and its policies must be countered at every turn. As its policy is one of spreading falsehoods, in particular when Gholamhossein Esmaili who is the Director General of Tehran Province Justice Department, openly stated recently, that there are no political prisoners in Iran, when clearly there are thousands who are imprisoned simply because of their views and ideas.\nThe next speaker was Dr. Gharagozloo who spoke about the Iranian regime’s 40 years of suppression of its citizens and undermining its neighbouring countries’ governments, and being behind many terrorist activities within Middle East and the rest of the world. He stressed that the only thing the regime responds to is financial pressure and that US sanctions are working as they are cutting the vital lifeline to the regime, and European countries should also resume their sanctions as the regime cannot be trusted. Thus, the Europeans by trading with Iran are allowing a regime that openly oppresses its citizens and supports global terrorism, to survive; and the Iranian regime will do anything to survive and that includes building nuclear weapons. He also stated that 40 years of tyrannical and devious policies of the Iranian regime should teach the world that the Iranian regime will not reform, as reform of any kind is an existential threat to its very being.\nThe final speaker was Ms. Simin Fahandej, who spoke about how the rights of Baha’is are constantly violated in Iran. As they have no standings within Iranian constitution and they are constantly being oppressed and discriminated, both in higher education institutions and in employment spheres. Moreover, their houses and workplaces are constantly raided, and their leaders are imprisoned, and this suppression is simply there, in order to force them to convert from Baha’ism to the extremist ideology of the regime. This policy of oppression, which has lasted for 40 years, had taken immense toll on the Baha’i community.",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog/content_8.html": "top of page\nNEWS & Articles\nSearch\nWhy A Free Democratic Iran will Tackle Illegal Immigration Crisis in The West\nAuthor: Mattie Heaven I feel it is necessary to inform you about one of the biggest and most dangerous challenges facing the world and...\nOct 30, 20229 min read\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 202314 min read\nThe world and iran - what can the world do?\nThe world and iran - What can the world do?\nMar 8, 20231 min read\nWhy the UK must act fast to expel Iranian Diplomats\nUnfortunately, we have seen that for a long time, the oldest democracy in the world, the United Kingdom, has been subjected to dangerous...\nNov 26, 20223 min read\nIran: A Free Democratic Country or a Dictatorship Without Borders?\n02 July 2019 UK Parliament LONDON On the 2nd of July 2019, the International Organisation to Preserve Human Rights with the sponsorship...\nNov 1, 20223 min read\nAntidotes to Islamist Extremism. European Parliament -Highlights\n02 May 2017 Antidotes to Islamist Extremism - European Parliament - Highlights On the 2nd May 2017, the cross-party full day event...\nNov 1, 20221 min read\nIran’s government is a terrorist regime. British Ministers must face this truth – and act on it.\n15 February 2021 Having lived in the UK most of my life, I’ve been faced with the challenge of explaining why human rights violations in...\nOct 31, 20224 min read\nfreedom of religion and belief- taking back islam from radicalism\nfreedom of religion an belief - antisemitism - REAL islamic values - taking back islam from radicalism\nOct 31, 20221 min read\nAre Women's Rights in Islam Compatible with Modern Society?\nPart 1 Part 2 Are Women's Rights in Islam Compatible with Modern Society? - 3rd May 2017 at the European Parliament - Highlights of...\nOct 30, 20221 min read\nFrom Conflict to Unity -International Human Rights Day\nOn 10th December IOPHR held a webinar titled “From Conflict to Unity - Learning from Beacons of the Past”, with the aim to commemorate...\nSep 14, 20221 min read\nA new chapter in our fight against Islamist radicalisation and terrorism\nThe brutal stabbing of Sir David Amess which resulted in his death has left many with broken hearts. Sir Amess was a kind and gentle...\nApr 23, 20223 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_freedom-of-religion-an-belief-taking-back-islam-from-radicalims/content_6.html": "freedom of religion and belief- taking back islam from radicalisminfo958672Oct 31, 20221 min readfreedom of religion an belief -antisemitism -REAL islamic values - taking back islam from radicalism",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_a-new-chapter-in-our-fight-against-islamist-radicalisation-and-terrorism/content_17.html": "A new chapter in our fight against Islamist radicalisation and terrorism\n- Mattie Heaven\n- Apr 23, 2022\n- 3 min read\nUpdated: Nov 10, 2022\nThe brutal stabbing of Sir David Amess which resulted in his death has left many with broken hearts. Sir Amess was a kind and gentle person, who fought for humanity, freedom and democracy for over four decades inside and outside of the UK. He devoted his life to the betterment of his community, supporting his constituents with all their concerns, and amongst many of his efforts, he led a powerful fight against Iran’s occupying regime as the chairman of the all-party British Parliamentary Committee for Iran Freedom.\nI cannot begin to express how the loss of such an individual has affected the lives of many, and I am sure that Sir David Amess' legacy will remain with us for generations to come.\nGiven the nature of this brutal attack, I feel obligated to make a number of remarks, partly as a colleague to Sir David Amess within the Conservative Party, partly as a human rights defender, and partly as a Muslim. This was a suspected act of Islamist terrorism, where the perpetrator hijacked and used the name of Islam to justify his atrocity.\nThis kind of extreme ideology is more prevalent in other countries, but we are not safe from its threats here in the UK. Systematic brainwashing of such individuals take place on a regular basis, using a narrow-minded ideology rooted in superstition, hate, bigotry and violence, all under the pretext of Islam, to spread division and to place terror within the hearts of the communities.\nSir David Amess was well aware of the dangers posed by such ideologies and its root causes, fighting for democratic reform and human rights in the so-called ‘Islamic’ Republic of Iran, who have violated the rights of Iranian people over the last 40 years, and completely destabilised the entire Middle East, as the world’s largest state sponsor of terrorism and anti-Semitism.\nWhat makes this attack by an individual, who claims to be a Muslim particularly shocking, is the fact that Sir David Amess spent a considerable amount of his time and resources helping Muslim refugees. Sir David Amess was an icon who truly became a beacon of hope for many and the nature of this attack not only leaves thousands of aching hearts across the world, but no doubt worsens the already existing issue of Islamophobia within our society.\nWith that in mind, I am a true believer that we, as a society have now entered a new chapter in our fight against Islamist radicalisation and terrorism, and it is first incumbent on all Muslims to be at the forefront of this fight. Radical ideologies which lead to acts of terrorism are acts of pure terrorism, regardless of what religion they happen to use to justify their actions. The perpetrators follow a line of ideology, which has been strategically exported into the West. Which is why it is so important for us to find the root causes of such brutal acts, and to not treat them as individual cases.\nAs someone who has spoken numerously across Europe on the serious threats of Islamist radicalisation and terrorism, I believe that here in the UK, there is an urgent need for a very open and honest dialogue, to see whether enough is being done to counteract these threats. The safety and security of the British public is now a top priority, and we should all do our part to continue in the footsteps of Sir David Amess in preserving our freedom and democracy.",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_the-world-and-iran-what-can-the-world-do/content_14.html": "The world and iran - what can the world do?\n- Mattie Heaven\n- Mar 8, 2023\n- 1 min read\nRelations between Iran and the west are dire as Iranians keep up anti-government protests, while Tehran blames the west for fomenting the unrest. The regime is drawing ever closer to Russia, sending drones to Moscow to use against Ukraine. The US, the EU and the UK have all imposed sanctions on Iran in recent months – Britain has announced 50 new sanctions since Mahsa Amini’s death last September – and Europe and the UK are considering labelling Iran’s Revolutionary Guards a terrorist organisation. Meanwhile, an Iranian TV news service recently suspended operations in London after staff were targeted by Tehran-backed operatives. What role can the international community play in supporting the push for change?\nhttps://www.tortoisemedia.com/thinkin/iran-a-new-revolution/",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_support-us/content_10.html": "Missions\nWe must build a sustainable society that guarantees our long-term future. We can only do this by changing policies, lifting small businesses, promoting innovation, and defending our values. We must guarantee a sustainable policy that considers all aspects of society and future generations.\n\"We want to address the health effects of poor air quality on people whose health is most impacted by air pollution: children, older people and people with heart and lung conditions.\"\nHealth effects of air pollution during school drop-off\nUK estimates that one in three children in the UK are growing up in areas with unsafe levels of particulate pollution. In our towns and cities, the majority of this harmful pollution comes from vehicle emissions.\nEvery day, millions of children in our towns and cities are exposed to dangerous levels of pollution in the areas where they live, learn and play.This invisible danger could be stunting their lung growth, increasing their risk of asthma and potentially damaging their brain growth.\nResearch finds children are disproportionately exposed to higher doses of pollution during the school run and while they are at school – particularly at break time when they’re in the school playground.\nThe Source of the problem\nChildren are exposed to black carbon, which is a constituent of particulate matter pollution. Particulate matter refers to tiny bits of solids or liquid suspended in the air. They are measured by their size – they range from bigger particles such as soot or dust to particles which are smaller than the width of a human hair. These tiny particles are the most dangerous for our health as they’re able to penetrate deep into our lungs, and potentially even into our bloodstream and our brains.\nFor babies and young children, these health effects are even more acute. Exposure to toxic particulates during these critical early stages of development can leave a child with stunted lungs, with respiratory conditions like asthma and potentially even reduced brain development. This is a threat to every child’s right to health and to grow up in a clean and safe environment.\nIt is estimated the health effects from air pollution exposure cost the NHS and social care services more than £40 million each year. Even the smallest improvement in exposure could reap rewards for children and the UK taxpayer\nWhy focus on health effects of air pollution?\nAir pollution has a disproportionate effect on the health and wellbeing of those most susceptible to it. This includes children under 15 (including during pregnancy), older people and people with heart and lung conditions.\nAir pollution is more prevalent in urban areas. And poor air quality doesn’t impact people in these areas equally; some people are more susceptible to its harmful effects than others. And we know that it intersects with other systemic causes of ill health.\nAir pollution is an invisible but dangerous threat to children’s health. Toxic emissions can damage children’s growth and leave them with lasting health problems. In 71% of UK towns and cities, children are breathing unsafe levels of air pollution. Around 1 in 3 babies are growing up in areas of the UK with unsafe levels of particulate matter – that’s nearly 270,000 babies under the age of 1 in the UK.\nThis not only violates a child’s right to health, but also their future. It could impact their right to education, their right to play and ultimately, their right to life.\nMajor gains for children’s health could be made if funding, interventions and policies were targeted to pollution reduction around schools and nurseries and on the school run itself. Unicef UK is calling on the government to urgently fund and prioritise policies and health interventions that protect children from toxic air before irreversible damage is done to their health and their futures.\nResearch and sources\nUniversity of Surrey’s Global Centre for Clean Air Research\nhttps://www.unicef.org.uk/publications/the-toxic-school-run/\nhttps://www.unicef.org.uk/clean-air-child-health-air-pollution/\nhttps://www.surrey.ac.uk/global-centre-clean-air-research\nhttps://www.sciencedirect.com/science/article/pii/S0048969720318738?via%3Dihub",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_blog_tags_human-rights-palestine/content_16.html": "top of page\nMattie Heaven\nCONTACT\nHome\nAbout\nMissions\nNews\nContact\nMore\nUse tab to navigate through the menu items.\nNEWS & Articles\nAll Posts\nSearch\nPalestinian Issue, a Divert for Iran leader’s shortcomings\nThe recent major development in stepping towards the establishment of peace within the region of Middle East, namely the Israel, UAE,...\nSep 6, 2023\n14 min read\nbottom of page",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_womens-rights-in-islam/content_11.html": "Are Women's Rights in Islam Compatible with Modern Society?\n- info958672\n- Oct 30, 2022\n- 1 min read\nUpdated: Nov 9, 2022\nPart 1\nPart 2\nAre Women's Rights in Islam Compatible with Modern Society? - 3rd May 2017 at the European Parliament - Highlights of Speech by Mattie Heaven",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_antidotes-to-islamist-extremism-european-parliament-highlights/content_4.html": "Antidotes to Islamist Extremism. European Parliament -Highlights\n- Mattie Heaven\n- Nov 1, 2022\n- 1 min read\n02 May 2017\nAntidotes to Islamist Extremism - European Parliament - Highlights\nOn the 2nd May 2017, the cross-party full day event titled: \"Antidotes to Islamist Extremism\" was organised by the International Organisation to Preserve Human Rights, in collaboration with the European Conservatives and Reformists Group at the European Parliament. The event was sponsored by the ECR Group and hosted by British MEP Geoffrey Van Orden alongside Mattie Heaven, Policy and Advocacy Advisor at the International Organisation to Preserve Human Rights. It was also supported by MEPs from the EPP, S&D and ALDE groups.",
  "https_www_mattieheaven_com_/https_www_mattieheaven_com_post_iran-s-government-is-a-terrorist-regime-british-ministers-must-face-this-truth-and-act-on-it/content_5.html": "Iran’s government is a terrorist regime. British Ministers must face this truth – and act on it.\n- info958672\n- Oct 31, 2022\n- 4 min read\n15 February 2021\nHaving lived in the UK most of my life, I’ve been faced with the challenge of explaining why human rights violations in Iran should greatly concern our government and my fellow citizens. The short answer is that the extremism of the Iranian regime is not limited to Iran itself – but is exported across the globe.\nAside from the brutal violation of human rights inside of the country, the Islamic Republic of Iran has openly funded terrorist organisations across the Middle East, using proxy wars to gain further control of the region, and uses diplomatic channels to carry out terrorist operations against both Iranians living abroad and the international community, as a means of eliminating any opposing viewpoint that they may consider a threat.\nFor example, consider the recent case of the senior Iranian diplomat, Assadollah Assadi. According to reports released by German police and an indictment in a Belgian court, Assadi, the third secretary of the Iranian Embassy in Austria, attempted to organise an atrocity on European soil.\nHe smuggled half-a-kilo of explosives onto the continent, with the intention of bombing a rally in France organised by the exiled National Council of Resistance of Iran. Had it gone off, the victims could have included four Conservative MPs – David Amess, Bob Blackman, Matthew Offord and Theresa Villiers, plus a Labour one, Roger Godsiff.\nClearly, the plan was not that of an individual carrying out an unauthorised act of terror, but a plot approved by the heads of the Iranian regime and organised through diplomatic channels.\nf you want another recent example, mull the example of Mohammad Naserzadeh, a staff member of the Iranian Consulate in Istanbul, who was recently arrested by the Turkish authorities for his alleged involvement in the murder of Masoud Molavi Vardanjani, a vocal critic of the Iranian regime.\nThe extremist actions of the Iranian diplomats can be understood better when we ponder the ideology of the Supreme Leader of Iran, Ali Khamenei, the most powerful official in the Islamic Republic, who has compared Israel to a “cancerous tumour, that must be wiped off the map”.\nThis is the state-sponsored radical and extremist ideology which led to the Buenos Aires bombing in July 1994 in Argentina. This terrorist attack orchestrated by the Islamic Republic of Iran resulted in the death of 85 innocent people, and injured hundreds.\nIt is clear that the Iranian regime, over the last 40 years, has consistently shown an unwillingness to reform, or even attempt to improve the quality of life of its citizens, its troubling human rights record and its relationship with the western world. So maintaining the current diplomatic relations with the Islamic Republic of Iran would be a devastating mistake – potentially with fatal consequences.\nThe regime has resisted reform, since it is fundamentally an undemocratic, and has frequently persecuted and arrested not only its critics, but also those such as the diverse religious and ethnic groups throughout Iran who choose to live a life other than the one officially prescribed its fundamentalist ideology,\nMoreover, the issue of women and children’s rights in the country are of serious concern. Women, half of Iran’s population, are under consistent oppression, with the underage marriage of girls being encouraged by the Mullahs. Not to mention the sobering fact that more child offenders are executed in Iran than in any other country in the world.\nUnfortunately, during recent decades, the EU has mostly ignored the suffering of the Iranian people in the interest of economic gain, and has thus largely turned a blind eye to the inhumane actions of the Iranian authorities. This short-sighted view has not only led to the abandonment of human rights principles that the EU is based on, but also has worked against Europe’s own longer-term potential gains, by fuelling and empowering Iran’s ruling regime, and the global threat that it poses.\nA Global Britain, as outlined by Dominic Raab, must means establishing our own standards here in the UK, and reinforcing sanctions to hold those who commit serious abuses of human rights to account, as part of UK’s commitment to democracy, freedom, and the rules-based international system.\nSystems based on dictatorship will not last forever, and the people of those countries will always remember governments that stood by their side. A free Iran with a truly democratic system will no doubt provide the UK with much more profitable and long-term investment opportunities than the current regime can offer – unleashing the true potential of its citizens, and becoming a productive member of the international community.\nFurthermore, since Iran is among the world’s largest sponsors of terrorism, its resources – some 84 million people, with vast resources of gold, oil and gas – are currently being employed in order to facilitate the regime’s terrorist ideology. Which in turn can lead to the mobilisation of hundreds of millions of potentially dangerous people around the world, with an extremist agenda to destroy western civilisation, or take it hostage.\nFinally, a note on the freedom of press – following Iran’s recent execution of the prominent journalist, Rouhollah Zam, during December last year, and the ongoing threats against Iranian journalists outside of Iran. A free press in a democratic system is considered the ‘fourth pillar’ that can prevent collusion amongst the other pillars of State.\nSo if the regime in Iran is pressured to enforce human rights standards, we can be sure that any dangerous action in Iran that could jeopardize world peace and security would then be thwarted by the free flow of information within Iran itself. There then would be reasonable hope for meaningful dialogue towards stable economic and diplomatic relations.\nWere Iran’s human rights to be put at the forefront of the Government’s foreign policy, those who control the Iranian regime would soon come to realise that its inhumane actions and spread of terror across the world has severe consequences for it – thus providing the only incentive that can bring about legitimate change within the country.\nMattie Heaven is a policy and advocacy advisor to the International Organisation to Preserve Human Rights. She was Parliamentary Candidate for Coventry South in the 2019 general election."
}