{
  "https_www_timleaver_com_/https_www_timleaver_com_terms-conditions/content_8.html": "Terms & Conditions\nDonations to a political party are regulated by the Political Parties Elections and Referendums Act 2000. By making a donation to this campaign, you are accepting the following terms and conditions:\nI am donating to the North West Norfolk Constituency Labour Party.\nIf I donate more than £500, checks will be made to ensure my name is listed on the UK electoral register (excluding the Channel Islands and Isle of Man).\nIf I donate more than £1,500 to a Constituency Labour Party or more than £7,500 to the national Labour Party in a calendar year, my name and the amount of the donation will be published on the Electoral Commission's website, although my home address will not be made public.\nI must use my own funds to make a donation to the Labour Party.\nDonations are not tax-deductible.\nIf I am making a donation of more than £500, North West Norfolk Constituency Labour Party will use the personal information I supply in order to discharge its legal responsibilities under the Political Parties, Elections and Referendums Act 2000. If I donate more than £1,500 (including multiple donations of more than £500 that add up to more than £1,500 in the same calendar year), my name and the amount I have donated will be published on the Electoral Commission’s register of donations, although my home address will not be made public. The money you use to make a donation must be from your own funds. This donation facility is provided for individuals to make donations to the North West Norfolk Constituency Labour Party. UK companies, limited liabilitypartnerships, trade unions and unincorporated associations may also make donations.\nPromoted by Deborah Heneghan on behalf of Tim Leaver both c/o North West Norfolk Constituency Labour Party Office, 26 St James Street, King's Lynn, Norfolk, PE30 5DA.",
  "https_www_timleaver_com_/https_www_timleaver_com_my-labour-values/content_6.html": "My Values\nGROWING UP\nGrowing up in Thatcher’s Britain was a struggle. Tory choices caused an economy of despair - recession and high unemployment, inflation and interest rates. And I’m seeing it happen all over again. My values were shaped by that experience and by my parents. Dad was an electrician and then a trade union official. Mum was a seamstress, doing skilled manual labour that was low paid and undervalued, because it was seen as women’s work. They worked hard to give me and my brother a better life.\nMY STORY\nI was lucky enough to be the first in my family to go to university. I then qualified as a Chartered Accountant. Pursuing a career in finance and management in healthcare and technology. I now run a clinical trials company. I’m father to a son and two daughters. Throughout the last 30 years of building my career and raising a family, I’ve campaigned for Labour.\nAlthough much of my life has been spent in Enfield, for the last 10 years I’ve come to know and love North West Norfolk, spending time here with my partner who grew up in Hunstanton and now lives just outside King’s Lynn.\nYou don't need me to tell you that residents deserve much better representation than the current Tory MP. I know that much just from talking with our friends and family locally. But I can see it too for myself, whether I’m in King’s Lynn or Hunstanton, Castle Acre or Brancaster, it’s clear that North West Norfolk needs an effective voice to speak out for change.\nTHE PORTILLO MOMENT\nI’ve helped deliver two shock wins that changed the political landscape. Unseating Michael Portillo in 1997 in Enfield Southgate – maybe you were still up for it – and 20 years later, kicking another Tory out of the same seat, helping to deny Theresa May a parliamentary majority. A shock win for Labour in North West Norfolk could give a Labour government an overwhelming majority and a strong base to deliver the change that our country needs.\nEXPERIENCED POLITICIAN\nI’ve supported and campaigned for the Labour party in every election since I was a teenager. From door-knocking to campaign planning and promoting successful local and parliamentary candidates as their election agent. I’ve been a Councillor since 2018 and served as Cabinet Member for Finance in the Labour-controlled Borough of Enfield.",
  "https_www_timleaver_com_/https_www_timleaver_com_my-priorities/content_2.html": "MY Priorities for north west norfolk\nAlthough much of my life has been spent in Enfield, for the last 9 years, I’ve come to know and love North West Norfolk, spending time with my partner here – she’s from Hunstanton and now lives just outside King’s Lynn.\nYou don't need me to tell you that residents deserve much better representation than the current Tory MP. I know that much just from talking with our friends and family locally. But I can see it too for myself, whether I’m in King’s Lynn or Hunstanton, Castle Acre or Brancaster, it’s clear that North West Norfolk needs an effective voice to speak out for change. I’m determined to gain your support so that together we can:\nSupport families struggling with rising costs, get energy bills down and make work pay with Labour’s New Deal for Working People\nMake it easier to book a GP appointment, increase the provision of dental care and ensure the Queen Elizabeth Hospital is rebuilt by 2030\nTake a tough stance on holding polluters to account and take action to improve\nthe environment\nGive the people of North West Norfolk the safety and security they deserve\nDecent homes for local people to rent and buy",
  "https_www_timleaver_com_/https_www_timleaver_com_privacy-policy/content_3.html": "**Privacy Policy**\nThis Privacy Policy outlines the practices and procedures implemented by www.timleaver.com (\"we\", \"us\", or \"our\") regarding the collection, use, and disclosure of personal information when you visit our website [www.timleaver.com] (the \"Site\").\nBy using the Site, you agree to the collection and use of information in accordance with this Privacy Policy. If you do not agree with the terms of this Privacy Policy, please do not access or use the Site.\n**Information Collection and Use**\nWe may collect personal information that you voluntarily provide to us when you interact with the Site. This information may include, but is not limited to:\n- Your name\n- Email address\n- Mailing address\n- Phone number\n- Other information you choose to provide, such as in inquiries or feedback forms\nWe may also collect non-personal information automatically as you navigate through the Site. This information may include your IP address, browser type, operating system, and other technical details.\n**Use of Information**\nWe may use the information we collect for various purposes, including but not limited to:\n- Providing and maintaining the Site\n- Responding to your inquiries or requests\n- Communicating with you about updates, news, or promotions related to our products or services\n- Analyzing trends, administering the Site, and improving our services\n- Detecting, preventing, and addressing technical issues or fraudulent activities\n**Disclosure of Information**\nWe may disclose your personal information in the following circumstances:\n- To comply with applicable laws, regulations, or legal processes\n- To protect and defend our rights or property\n- To prevent or investigate possible wrongdoing in connection with the Site\n- With your consent or at your direction\nWe may also share non-personal information with third-party service providers to assist us in operating the Site or conducting our business. These third parties are contractually obligated to use the information only for the purposes for which it is provided and in accordance with this Privacy Policy.\n**Security**\nWe implement reasonable security measures to protect the confidentiality and integrity of the information we collect. However, please be aware that no method of transmission over the internet or electronic storage is completely secure, and we cannot guarantee absolute security.\n**Links to Third-Party Websites**\nThe Site may contain links to third-party websites or services that are not owned or controlled by us. This Privacy Policy applies solely to information collected by our Site. We have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party websites or services.\n**Children's Privacy**\nThe Site is not intended for individuals under the age of 13. We do not knowingly collect personal information from children under 13. If you are a parent or guardian and believe that your child has provided us with personal information, please contact us so that we can take appropriate action.\n**Changes to this Privacy Policy**\nWe reserve the right to update or modify this Privacy Policy at any time. Any changes will be effective immediately upon posting the revised Privacy Policy on the Site. We encourage you to review this Privacy Policy periodically for any changes.\n**Contact Us**\nIf you have any questions or concerns about this Privacy Policy, please contact us at tim4NWN@timleaver.com\nLast updated: 28th March 2024",
  "https_www_timleaver_com_/https_www_timleaver_com_survey/content_5.html": "top of page\nLABOUR PARLIAMENTARY CANDIDATE FOR\nNORTH WEST NORFOLK\nMy Values\nMy Priorities\nQEH Survey\nDonations\nMore\nUse tab to navigate through the menu items.\nHave your say...\nDo you think the Queen Elizabeth Hospital in King's Lynn rebuild programme should :\n*\nRequired\nContinue on the existing site, where 42m must be spent first on building a car park and helipad\nBe on a new site and ensuring less disruption to patient care, improved access for more residents and better value for money\nMore about you\nWhich party did you vote for in the 2019 general election?\n*\nRequired\nLabour\nConservative\nLiberal Democrat\nGreen Party\nWhich party will you vote for in the next general election?\nName\nEmail\nStreet Address\nStreet Address Line 2\nCity\nPostal / Zip code\nSubmit\nThank you for completing!\nbottom of page",
  "https_www_timleaver_com_/https_www_timleaver_com/content_1.html": "top of page\nLABOUR PARLIAMENTARY CANDIDATE FOR\nNORTH WEST NORFOLK\nMy Values\nMy Priorities\nQEH Survey\nDonations\nMore\nUse tab to navigate through the menu items.\nHave your say on the Queen Elizabeth Hospital\nin King's Lynn\nSurvey\nSign up to support my campaign\nFirst name\nLast name\nEmail\nPhone\nPostcode\nHow can you help?\nCanvass with me\nDeliver my leaflet with me\nI am happy to be contacted by Tim Leaver using the data I provide. Opt out anytime\nApply\nThank you! We'll be in touch.\nbottom of page",
  "https_www_timleaver_com_/http_www_timleaver_com/content_4.html": "top of page\nLABOUR PARLIAMENTARY CANDIDATE FOR\nNORTH WEST NORFOLK\nMy Values\nMy Priorities\nQEH Survey\nDonations\nMore\nUse tab to navigate through the menu items.\nHave your say on the Queen Elizabeth Hospital\nin King's Lynn\nSurvey\nSign up to support my campaign\nFirst name\nLast name\nEmail\nPhone\nPostcode\nHow can you help?\nCanvass with me\nDeliver my leaflet with me\nI am happy to be contacted by Tim Leaver using the data I provide. Opt out anytime\nApply\nThank you! We'll be in touch.\nbottom of page",
  "https_www_timleaver_com_/https_www_timleaver_com_donations/content_7.html": "top of page\nDonations\nPlease give what you can to help Tim win in North West Norfolk - and to help Labour build a better North West Norfolk and Britain.\nYou can easily donate the specified amounts here, as long as you have an internet banking app (this keeps you credit card details safe, is a shortcut version of a BACS payment, very small fee to you, and no fee to us):\nIf you would like to donate more, or do not have an internet banking app, please let us know on tim4nwn@timleaver.com\nThe campaign can also accept cheques. Please make payable to 'NORTH WEST NORFOLK CLP GENERAL'. They can be posted to the North West Norfolk CLP Office, 26 St James Street, King's Lynn, Norfolk PE30 5DA\nbottom of page"
}