{
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_save-mix96-as-our-local-radio-station-petition-passes-1000-in-just-a-few-days/content_23.html": "Save Mix96 as our local radio station – petition passes 1000 in just a few days\nMore than 1000 people from across Aylesbury have signed a petition to save local Radio station Mix96 following the announcement by its owner Bauer Group to downgrade the local station to a national station.\nA petition has been set up and has drawn wide-ranging support calling for Bauer Media to reverse its decision to replace Mix96 FM with a national radio station.\nThe Petition launched by the Liberal Democrats in Aylesbury says the loss of the service will be \"a huge blow to our local communities\" said Lib Dem spokesperson Steven Lambert.\nBauer Media announced this week, the Aylesbury radio station is set to be replaced by Greatest Hits Radio, with just a few hours a day of regional presenting from its Aylesbury base.\nSteven Lambert, who is the leader of the Lib Dems at Buckinghamshire Council said: \"Mix96 is at the heart of our community. The town that has a strong local music culture needs its local radio station to be part of its beating heart.\nParklife - Aylesbury 2019\nSo many of us just have it on in the background at the office and listen out for what's going on in our community - local traffic news, snow days, school closures, broadcasts from community events like the Town's signature August Bank Holiday event ' Park Life' run by the Town Council and the annual Mix96 Christmas present and Easter Egg appeals. People recognise and trust Mix96, its staff team and it's a brand that everyone knows and trusts.\"\nSteven said: \"I am really concerned about the impact on community groups and events which are supported by Mix96. The proposals will be a hammer blow to our community.\nAylesbury is trapped between two TV broadcast areas and the big beast radio stations, Mix96 plays a vital role in our community bringing our town and the surrounding villages to life with music, news, and supporting events. With the new station offering mostly national content and a small amount of regional programming, I fear its reflection of us as a town and our community will be lost.\"\nSteven is also concerned about the Mix 96 staff team; whose roles are currently under consultation for redundancy.\nSteven continued: \"over the years I have got to know the Mix96 team really well. You see them in the coffee shop, the supermarket and many of them live in the heart of our community.\n\"They are passionate about the station and our town and with so much national uncertainty at the moment the community needs a really strong local radio station. To lose such an important bit of that community is awful.\"\nThe petition has already attracted more than 1000 signatures in just a few days. Add your name here!",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_broken-promises-broken-roads/content_40.html": "Broken Promises & Broken Roads\nLocal residents are voicing strong concerns over the deteriorating condition of roads and paths, highlighting safety risks posed by large potholes and broken surfaces for motorists, cyclists, elderly and disabled people.\nBucks Council are using one of the most expensive contractors in the Country while the cost to to bring the roads up to standard is nearing £500 million. This is not value for money, and the LibDems believe the council should prioritise more cost effective road maintenance, using innovative technologies already tried and tested in other council areas.\nCllr Peter Cooper, Deputy Leader of the Lib Dems at Bucks Council says:\n“Having been a Councillor since 1999, the Conservatives in Bucks have not invested historically in highways maintenance, gulley cleaning, road sweeping, drain clearance and keeping our streams cleared of litter. This has led to severe flooding in Aylesbury which deteriorates our roads further.”\nThe Liberal Democrats manifesto promises progress on road maintenance and public transport solutions, particularly in the rural areas.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_16-of-families-in-aylesbury-face-heartless-government-universal-credit-cut/content_44.html": "16% of families in Aylesbury face \"heartless\" government Universal Credit cut\nNearly 8000 hard-pressed families across Aylesbury face being left worse off when the government end the uplift to Universal Credit next month.\nNew data from the Joseph Rowntree Foundation exposes the true nature of how badly some areas will be hit by the £20 Universal Credit cut, which is opposed by Aylesbury Liberal Democrats.\nIn the report, the Joseph Rowntree Foundation estimate that the Universal Credit cut alone could force 500,000 people, almost half of them children, into poverty. Their breakdown shows that 7950 families in Aylesbury will be harmed by the governments uplift cut, with 31% of families with children in Aylesbury being affected adversely.\nResponding to the data, Steven Lambert, Liberal Democrat Leader at Buckinghamshire Council said:\n\"Aylesbury has had to pull itself through this pandemic, while dealing with this incompetent heartless Conservative government, coming together to support our key workers and most vulnerable families. This cut will do untold damage to so many of our local families.\"\n\"There is no question that Government has to reverse this needless cut and support normal working people here. Instead of removing support from our most vulnerable families, the government must do more to tackle our ongoing child poverty pandemic.\"\n\"Aylesbury Liberal Democrats are calling for the Universal Credit uplift to be made permanent.\"\nLiberal Democrat Work and Pensions Spokesperson Wendy Chamberlain MP added:\n\"Just as we begin to hope that Covid is being tamed in the UK, the Government is ripping support from millions of families across the country. We cannot have a full recovery if families are struggling to make ends meet.\n\"The Prime Minister's claim that he wants people to live by their own 'efforts' rather than 'welfare' shows how out of touch he really is. With almost half of those receiving Universal Credit already in work and with many having young families, this cut will leave parents and their children behind despite their efforts.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_government-must-reinstate-virtual-meetings-and-remote-decision-making-for-local-councils/content_22.html": "Government must reinstate virtual meetings and remote decision making for local councils\nWith continuing cases of Covid across Buckinghamshire and the Government encouraging people to work from home wherever possible, Aylesbury Liberal Democrats are calling on the Government to reinstate council's abilities to hold virtual meetings for all purposes including decision making.\nEarlier in the pandemic emergency legislation was put in place to allow councils to meet and vote virtually however the Government refused to extend the legislation after 7th May. Since then, only advisory meetings can take place remotely.\nWhile the situation has improved, the R rate for Covid-19 remains high. Multiple NHS trusts have declared critical incidents and just last week Buckinghamshire Council cancelled some Bin Collections due to staff shortages.\nDue to concerns about public safety, lawyers in local government and the Association of Democracy Services Officers have launched a petition for councils to have the choice to meet remotely.\nCllr Steven Lambert, Liberal Democrat Group Leader at Buckinghamshire Council, said:\n\"As councillors, we are elected by local residents to work to improve our communities - part of that requires us to be able to meet and make decisions. As a result of the Government's refusal to allow virtual meetings and remote decision making, we find ourselves in the unacceptable situation where councillors are having to choose between ensuring democracy happens and keeping ourselves and others safe.\n\"We know that virtual meetings work - we had them throughout 2020 - and we should be allowed to return to them given that Government guidance is to work from home wherever possible.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-lib-dems-call-on-rob-butler-to-condemn-the-pm-and-apologise-to-the-people-of-aylesbury/content_32.html": "Aylesbury Lib Dems call on Rob Butler to Condemn the PM and apologise to the People of Aylesbury\nLiberal Democrat Parliamentary Spokesperson for Aylesbury Steven Lambert has called on Rob Butler to condemn Boris Johnson after the revelations of the past few days.\nSteven said, \"After seeing the ITV video which shows Downing Street staff laughing last year about a Christmas party, I call on Aylesbury's MP asking him to condemn Boris Johnson's behaviour and apologise on behalf of their party to the people of this town.\nBoris Johnson's Conservative party is taking this country for fools. People in this area will see right through his poor excuses and evasive answers. Rob Butler cannot continue to remain silent and ignore media scrutiny as he has done so far. He needs to take accountability for his Government's actions.\nPeople in Aylesbury spent their Christmas away from loved ones and many lost friends and family to this disease. At a time of great sacrifice when the pandemic was at its worst, it is disgraceful to think that people in Downing Street were laughing about holding a Christmas party.\nEnough is enough. This Government must be held accountable to an inquiry into all their rule breaking; from Barnard Castle to the Refurbishment of the Number 10 flat to this latest rule breaking. It cannot be one rule for them and another for the rest of us.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_in-memoriam-sir-david-amess-mp/content_69.html": "In Memoriam: Sir David Amess MP\nWe are saddened to learn of the death of Sir David Amess, MP for Southend West, this afternoon.\nAs public servants we work in the heart of our communities all year round.\nThat this should happen makes it harder to bear for his family and for all of us in public office.\nOur thoughts and condolences are with Sir David's family at this sad time.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_in-memoriam-freda-roberts-mbe/content_68.html": "In Memoriam: Freda Roberts MBE\nFREDA ROBERTS MBE\nHonorary Freewoman of the Parish of Aylesbury, Former Town Mayor, Alderman of Buckinghamshire and Former Chair of Aylesbury Vale District Council\nToday is a sad day for Aylesbury and Buckinghamshire as we learned of the passing of Former Aylesbury Mayor, Alderman of Buckinghamshire, and Aylesbury, Former Chairman of Aylesbury Vale District Council and Freeman of Aylesbury Town, Freda Roberts MBE.\nFull of political oomph and verve Freda was a constant for 52 years in Aylesbury and Buckinghamshire's political and social life. A councillor for 52 years Freda was the Aylesbury Town Mayor three times and campaigned tirelessly and successfully for the re-establishment of Aylesbury Town Council and the Town Twinning Society.\nHer involvement with Stoke Mandeville Radio, lunch clubs, the scouts, the Southcourt Walton Court Community Project and so many many organsiations was truly a masterpiece in civic duty.\nFreda was also Bucks County Councillor until 2017 and was a Magistrate, been a school governor, Alderman, and Freeman of Aylesbury. Freda never sat on the sidelines, she got involved with various charities and organisations.\nFreda a former nurse, was born in Yorkshire and moved to Aylesbury after she met her late husband Rupert while he was stationed in the county during the Second World War and visiting one of his comrades in hospital.Rupert and Freda married and settled first in Aylesbury High Street before moving later on to Southcourt, where they brought up their two children.\nShe finished her life in Wellington, Somerset wanting to move closer to her daughter.\nShe will be greatly missed by Tim and Sally and all the family and she was a much loved mum, mum-in-law, nan and great nanny.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_search/content_10.html": "Conservative Failures continue to pile up\nThe Conservative run administration are selling off all of our assets to balance books! Where is the long term ambition and drive to improve Aylesbury?\nThe Conservative run administration are selling off all of our assets to balance books! Where is the long term ambition and drive to improve Aylesbury?\nBuckinghamshire deserves better. After decades of Tory neglect, the Liberal Democrats wants a new vision for Bucks. Sign up to receive our manifesto.\nThe Aylesbury Liberal Democrats are thrilled to unveil their manifesto for the upcoming Town Council elections, presenting an exciting vision for the future of our town.\nThe Bucks Council SEND department is in crisis, not supporting vulnerable children, with the processing times for Educational and Health Care Plans (EHCPs) drastically exceeding targets leading to…\nToday marks the start of 9 days of Hindu festivals. The Liberal Democrats embrace every community and wish you all a wonderful Chaitra Navratri, Ugadi, Gudi Padwa, and Ram Navmi!\nToday, Friday 28th March, Aylesbury Liberal Democrats handed in nomination papers for a full slate of candidates to contest all the wards in Aylesbury up for election on Buckinghamshire Council…\nLib Dems Promise to Deliver a “Fair Deal” for Buckinghamshire ahead of local elections\nShow your support at home Each election, our team puts hundreds of posters around Aylesbury to show residents in our town and villages that the Lib Dems are winning here. Will you display a paper…",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_we-need-more-gps/content_60.html": "Oops, an error occurred! Code: 20250503203429d1f19275\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_agm-pack_officer-responsibilities/content_56.html": "i. The role of the Chair is to:\na. Chair Local Party, general and executive meetings\nb. Act as the point of communication with HQ and the region\nc. Ensure compliance (along with the Treasurer) with PPERA\nd. If another member is not so appointed, ensure compliance with data protection law\ne. Ensure compliance to party constitution\nf. Manage the local development plan and ensure it is fulfilled\ng. Oversee Parliamentary candidate selection with the support of the Elections Officer\nh. Ensure that the Local Party maintains the standards and practice expected\nii. The role of the Vice-Chair is to:\na. Deputise for the Chair if they are ever unavailable or at the request of the Chair,\nb. Chair Local Party, general and Executive Committee meetings if and when the Chair is absent or otherwise unable to chair such meetings, or at the request of the Chair\nc. Proactively assist the Chair in the fulfilment of their responsibilities to and on behalf of the Local Party,\nd. Proactively work with the other officers to assist them in their duties as necessary,\ne. Be responsible for the fulfilment of responsibilities associated with any vacant officer position until it is filled, reporting to the Executive Committee on such responsibilities whilst it remains vacant.\niii. The role of the Secretary is to:\na. Produce agendas and minutes for meetings\nb. Manage the diary of events to avoid clashes\nc. Inform the Chief Executive of the Federal Party and the secretary of the Regional Party of executive officer appointments and other matters required by this constitution apart from finance\nd. Consult the Local Party constitution\ne. Other administrative tasks\niv. The role of the Treasurer is to:\na. Prepare and monitor the yearly budget\nb. Submit PPERA reports\nc. Oversee fundraising targets\nd. Liaise with election agents\ne. Keep accounts ready for audit\nv. The role of the Membership Development Officer is to:\na. Organise and run recruitment campaigns\nb. Follow up ‘At Risk’ members\nc. Ensure there is a range of events, social and political (in co-operation with the Secretary)\nd. Encourage members to move on to Direct Debit payments\ne. Secure accurate records of local party membership in the Federal Party’s central membership system\nf. Check regularly for new members, welcome them and organize new member interviews\ng. Inform the Executive Committee of new members, in accordance with Section 4.4 of this Constitution\nh. Produce a regular members’ newsletter (work with others)\nvi. The role of the Elections Officer (Campaign Officer) is to:\na. Ensure the Local Party has top-line electoral objectives agreed for at least five years ahead to guide campaigning activity\nb. Ensure the Local Party has an agreed annual campaign plan, and supporting budget in consultation with the Treasurer\nc. Form and oversee the smooth running of a constituency campaign team charged with delivering the agreed campaign plan within the agreed budget\nd. Ensure the Local Party obtains the marked registers after every election and that the data is entered into the party’s system for recording electoral data\ne. Provide support to the Chair in the selection of Parliamentary candidates\nvii. The role of the Diversity Officer is to:\na. Develop an understanding of the diverse communities in the area of the Local Party\nb. Identify under-representation of those communities within the Local Party and the executive/officer roles\nc. Work with the Local Party executive to devise and promote a strategy to engage members of under-represented groups, to encourage them to join the party and to support them to become active in the management and decision-making processes of the Local and wider Party\nd. Develop links with community group",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_page-6/content_48.html": "Local Engagement and Information Evening\nA big thank you to everyone who came to our Local Engagement and Information Evening yesterday evening. Aylesbury Town Council Leader Richard Lloyd and Aylesbury Mayor Anders Christensen hosted the event and shared plans for Aylesbury Garden Town, the refurbishment of the Town Centre, Gardenway and the plans for a sports stadium for Aylesbury. This was followed by a Q&A session. Based on the success of the event we will be planning on hosting a similar session in the future. We will keep you posted!",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_page-5/content_26.html": "Aylesbury Lib Dems back “Robin Hood tax” on energy giants to support families with heating bills\nAylesbury Liberal Democrats have today written to the Secretary of State for Energy Kwasi Kwarteng demanding that he backs the party's call for a \"Robin Hood\" tax on the super-profits of oil and gas firms, to raise money to support local families facing soaring energy costs.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_get-involved_executive-officers/content_12.html": "Your 2025 Executive Committee\nFor the year 2025, the following members make up the Executive Committee\n- Chair: Niknam Hussain\n- Vice Chair: Andrew Cole\n- Secretary: Jon Andersen\n- Treasurer: Jeremy Hodge\n- Elections Officer: Waheed Raja\n- Membership Development Officer: Carmel Traynor\n- Diversity Officer: Marius Faladi\n- Data Officer Gurinder Wadhwa\nOrdinary members: - Nidhi Mehta\n- Shannon Morgan\n- Tuffail Hussain\n- VACANCY\n- VACANCY\n- VACANCY\nLiberal Democrat Council Group Representatives:\n- Susan Morgan, Buckinghamshire Liberal Democrat Unitary Group\n- Richard Lloyd, Aylesbury Town Council Liberal Democrats Group\n-\nOfficer responsibilities",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_conservatives-breaking-police-officer-promise-for-aylesbury/content_17.html": "Conservatives breaking police officer promise for Aylesbury\nThe Conservative Government is failing to deliver the promised 609 more police officers for Thames Valley Police.\nAnalysis of Home Office statistics by the Liberal Democrats has shown that Thames Valley's total officer numbers instead fell by 29 in the last year.\nWith just 229 extra officers having been recruited by Thames Valley Police under the Government's campaign which started in September 2019, Thames Valley Police needs to increase recruitment to 25 per month over the next 15 month to get to the 609 officers we are forecast to need.\nAylesbury Liberal Democrats are calling out the government for failing to keep their promise to communities, adding that there needs to be a return to full and proper community policing.\nResponding to the figures, Steven Lambert, Liberal Democrat parliamentary spokesperson for Aylesbury, said:\n\"People in Aylesbury are being let down and taken for granted by this Conservative Government. With so many local crimes going unsolved, we desperately need more police on our streets and in our communities.\n\"Liberal Democrats are calling for a return to proper community policing, where officers are visible, trusted and known personally to local people.\"\n\"The Conservatives' pledge to boost police officer numbers looks set to become yet another of their broken promises. They are letting down victims of crime and our communities right across our area.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_bucks-conservatives-budget-flaky-and-undemocratic-say-buckinghamshire-liberal-democrats/content_16.html": "Bucks Conservatives’ Budget “Flaky” and “Undemocratic” say Buckinghamshire Liberal Democrats\nLast Night, Buckinghamshire Liberal Democrats voted against Buckinghamshire Conservatives proposed budget for the Council after it was labelled as 'flaky', 'undemocratic' and 'ignoring local residents and communities.'\nAt last night's Budget Meeting at Buckinghamshire Council, Liberal Democrat Group Leader Steven Lambert accused the Conservative Council of failing to deliver on the promised cost savings of moving to a Unitary Authority while also failing to deliver their flagship policy\nThe proposed budget, despite increases in Council Tax and cuts to services, is balanced for the next 3 years by taking money out of the Council's reserves. This is despite the promise of savings from the change to a Unitary Authority.\nSome of the biggest savings to come from the move to Unitary will instead come thanks to the Liberal Democrats, after the Boundary Commission backed the Lib Dem proposal to reduce the number of councillors to 98. This was despite objections from the ruling Conservative Administration who wanted 120.\nSteven reiterated that case at the meeting stating that reducing the number of councillors to 98, like the Liberal Democrats proposed, will deliver 'half a million pounds of savings.'\nThe Council's decision to axe funds to local Community Boards was also criticised. The Boards were a flagship proposal of the new Council.\nHowever, according to Steven 'The budget proposals do not demonstrate any significant level of future support for Community Boards and its clear this budget gives them low overall priority.'\nThe budget has also been criticised for the way it has been drafted, with even some Conservative members in Committee sessions accusing the Council Leadership of acting like a 'dictatorship.'\nSumming up Steven said that the Liberal Democrat Group would not be supporting the budget as it was 'so flaky that it needs reserves to go forward, that has its priorities shifted and policy see-sawed on the whim of a cabal.'\nIf you would like to read the entirety of Steven's speech click here.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-lib-dems-elect-new-executive/content_74.html": "Aylesbury Lib Dems Elect New Executive\nThe following members will make up the leadership of the Aylesbury Liberal Democrats for the year 2024:\nChair - Niknam Hussain\nVice-Chair - Andrew Cole\nTreasurer - Mike Smith\nSecretary - Jon Andersen\nElections Officer - Tim Dixon\nMembership Development Officer - Carmel Traynor\nData Officer - Jeremy Hodge\nDiversity Officer - Nidhi Mehta\nOrdinary members:\nMary Baldwin\nAnders Christensen\nSarah Walland\nSarah James\nAdam Poland-Goodyer\nSteven Lambert\nGroup Leader - Aylesbury Town Council:\nRichard Lloyd\nGroup Leader - Buckinghamshire Council\nSusan Morgan\nDeputy Group Leader - Buckinghamshire Council\nPeter Cooper",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_20mph-is-the-new-30mph-bucks-lib-dems-delivering-on-campaign-promises/content_59.html": "20mph is the new 30mph: Bucks Lib Dems delivering on campaign promises\nAfter months of campaigning by Buckinghamshire Liberal Democrats, Buckinghamshire Council is set to allow communities across the County to reduce speed limits in their area to 20mph.\nLiberal Democrat run Aylesbury Town Council has already voted to support the campaign, as have parish councils across the county.\nThis was a key manifesto commitment for the Liberal Democrats in May's local elections.\nNearby Oxfordshire County Council has already made 20mph the default speed limit across the Oxfordshire after the Liberal Democrats took control of the council earlier this year.\nBuckinghamshire Conservatives have been forced to u-turn on their opposition to 20mph speed limits after pressure from campaigners, councillors, and residents across Buckinghamshire.\nThe council will debate and vote on a motion this Wednesday that will allow parishes to implement 20mph speed limits in their localities. After the u-turn from the Conservatives, it is very likely for the motion to be carried.\nHowever, the motion has been drafted by the Conservatives and has been written in such a way as to undermine the proposal before it can even get started.\nLiberal Democrat Councillor for Wing, Peter Cooper, will therefore be proposing an amendment to strengthen the motion and ensure that the 'Twenty is Plenty' campaign in Buckinghamshire can hit the ground running. The amendment can be found on the Buckinghamshire Council Website.\nCllr Peter Cooper said, \"After months of campaigning and consultation with parishes and residents across our county, it is great to see our hard work begin to pay off. A 20 mph speed limit would make a world of difference to the quality of life of communities across Buckinghamshire.\nDuring this year's local elections, voters raised speeding and air quality time and time again on the doorstep when speaking to Buckinghamshire Liberal Democrats candidates. Being able to deliver on a key campaign promise to voters this early into a council term, while in opposition, is what makes being an elected councillor worthwhile.\nWe do however need to make sure the 20mph speed limit is implemented properly and with the full endorsement of Buckinghamshire Council. This is why I am proposing my amendment to the original motion. I would urge councillors of all parties to back my amendment so residents' views and intentions are properly represented in this motion.\"\nCllr Adam Poland-Goodyer, Shadow Cabinet Member for Transport, added, \"Allowing parishes to implement 20mph speed limits would be a victory for local democracy and residents from Buckingham to Burnham.\nStreets with a 20mph speed limit have less traffic noise, lower emissions and 40% fewer road causalities, improving road safety especially for young children.\nThe fact that this motion is even being voted on shows the impact electing Liberal Democrat Councillors can make in our area, even in opposition, and we hope to continue delivering for Buckinghamshire residents in the future.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_18-875-children-in-aylesbury-would-benefit-under-lib-dem-catch-up-voucher-plan/content_49.html": "18,875 children in Aylesbury would benefit under Lib Dem Catch-Up Voucher plan\nParents of 18,875 children in Aylesbury would receive vouchers worth £200 a year to spend on catch-up classes and educational activities, under plans announced by the Liberal Democrats.\nThe policy would empower parents to help their children catch up after months of school closures and disruption during the pandemic. The vouchers could be spent on a range of activities including tutoring in reading, writing and maths, music lessons, swimming classes or other physical education.\nThe programme would last three years, with one £200 Catch-Up Voucher provided annually for every school child in the country, in what the Liberal Democrats said programme would become \"the world's biggest ever parent-listening exercise.\"\n3,344 children on free school meals in Aylesbury would be eligible for Catch-Up vouchers worth £400 a year under the proposals. This would help close the learning gap for disadvantaged children who were less likely to have the resources they needed to learn at home during the pandemic. Pupils with special educational needs who are also eligible for Free School Meals would be provided with triple vouchers worth £600 a year.\nThe ambitious plans were featured this week on BBC One and ITV as part of the Liberal Democrats' Party Political Broadcast. They would form part of a £15 billion package of education catch-up funding, or £500 per child, as recommended by the Government's former Education Recovery Commissioner Sir Kevan Collins. This is ten times more than £50 per child being provided under the government's current plans.\nCommenting on the new scheme, Liberal Democrat Councillor Sarah James, the Lib Dem Spokesperson for Education and Young People said:\n\"Children have already suffered too much during this pandemic, from not seeing their friends to missing out on school. We need to see a massive investment in helping kids catch up on this lost learning, instead of the pitiful £50 per child the government is currently offering.\n\"The Liberal Democrats' Catch-up Voucher scheme would put money directly into the hands of parents in Aylesbury to spend on whatever their children need most. It would also provide extra cash for the families of disadvantaged children and those with special needs, to help them close the learning gap.\"\nLiberal Democrat Parliamentary Spokesperson for Aylesbury, Steven Lambert added:\n\"The Liberal Democrats are the party of empowering people, and supporting parents and children is our top priority in the new fair deal we are offering.\"\n\"Parents and families in Aylesbury are going through a tough time with foodbank use at record levels. They need more support as we come out of the pandemic.\"\n\"Covid should mark a watershed in how we educate our children and young people. It is clearer than ever that we need a massive education catch-up fund. And this catch-up fund - which schools in Aylesbury desperately need - should also give parents a radical new role in their children's education.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_conservative-bucks-council-failing-our-vulnerable-children/content_7.html": "Conservative Bucks Council failing our vulnerable children\nFollowing recent court cases against the council, urgent action is needed to address these failures and ensure that children with special educational needs and disabilities receive the timely assistance and resources they deserve. Families in Bucks are rightfully calling for improved services to guarantee better outcomes for vulnerable children. We deserve better than Conservative finger pointing, blaming the Government, instead of being proactive in dealing with the issues and being supportive of parents trying to navigate this nightmare.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_page-7/content_36.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_lib-dems-celebrate-with-our-hindu-communities/content_13.html": "On behalf of Liberal Democrats Aylesbury, we send our heartfelt wishes to everyone celebrating Navratri, Ugadi, Gudi Padwa, and Ram Navmi.\nThese festivals mark a time of renewal, devotion, and the triumph of good over evil. May they bring you happiness, strength, and prosperity.\nAs you celebrate with your loved ones, may your homes be filled with joy and your hearts with faith and positivity.\nWishing you all a wonderful Chaitra Navratri, Ugadi, Gudi Padwa, and Ram Navmi!",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_working-for-you/content_3.html": "Bucks Deserves Better\nFor a Fair Deal in Buckinghamshire.\nBuckinghamshire Liberal Democrats are committed to delivering value for money for council taxpayers while prioritising local communities and residents in everything we do. This manifesto outlines our commitment to a fairer, greener, and more prosperous Buckinghamshire, where residents receive the services, they need and deserve. The Liberal Democrats will continue to champion local communities, protect the environment, and ensure the council delivers value for money.\nOur Positive Plan\n-\nConservative-run Buckinghamshire Council keeps raising your council tax while slashing services and letting roads crumble. They now want to shut down Adult Day Centres across the county, leaving vulnerable residents without support. Lib Dem councillors are fighting to stop these closures and protect the services our community relies on. We would cut waste, prioritise frontline services, and deliver real value for your money. Meanwhile, Labour is squeezing from the other side—cutting benefits and punishing small businesses with tax hikes. Both parties are failing us.\nResidents deserve a council that ensures your tax is spent wisely and meets statutory obligations.\nWe will:\n- Identify genuine savings in delivering council services without compromising the quality of those services for local residents.\n- Make full use of available funding streams while keeping council tax rises and service charges fair and under control.\n- Invest wisely in projects that improve services for residents and generate medium to long-term savings for the council.\n- Make better use of technology to create a more open, efficient and people focused local council while making sure no one is left behind - whether due to age, disability or lack of access.\n-\nThe Conservatives have had years to sort out our crumbling roads and pavements but they just keep kicking the can down the pothole-ridden road. They rejected Lib Dem proposals to fund long-overdue pavement repairs, leaving residents to deal with dangerous footpaths. They have also failed to deliver key infrastructure, including the promised Eastern Link Road to ease congestion across Aylesbury. Their neglect has left our town without the vital Aylesbury Link of East West Rail, stifling local businesses and cutting off residents from better transport links. It is time for a council that actually delivers.\nBuckinghamshire’s roads and footpaths are a concern for residents. Although severe weather conditions contribute to damage, a significant cause of the current issues is underinvestment in road maintenance over several years. It is now estimated that £500 million is needed to bring the roads up to standard.Public transport across the county is highly inconsistent. Rural areas often lack reliable bus and train services, and even essential routes—such as those connecting Aylesbury, Buckingham, and Milton Keynes—suffer from limited services, especially in the early mornings and evenings.\nOur fair deal for Buckinghamshire:\nWe will:\n- Prioritise better road maintenance using innovative technologies (already used in other countries) to reduce costs and speed up repairs.\n- Explore ways to increase the frequency of road sweeping and better coordinate it with gully clearance to reduce flood risk and help maintain road surfaces.\n- Set up a task force to ensure value for money from our highway maintenance contractors.\n- Reduce delays in investigating and repairing collapsed drains to improve road conditions and prevent flooding.\n- Increased investment in pavements to create safer environments, particularly for our elderly and disabled residents.\n- Although the Bus Services are not a responsibility of Bucks Council, we can set up a task force to collaborate with them, making sure that they are providing the best possible service.\n- Expand the use of the Village Connect Buses who currently only run in a few of the villages in Bucks. There is a huge demand for this type of service.\n-\nFor several years, grassroots sports teams have faced neglect from the Conservative administration at Bucks Council. The facilities provided across Buckinghamshire are in poor condition, despite being among the most expensive in the country to rent. Some facilities have been deemed unsafe, while others lack essential amenities such as changing rooms or hot water, yet they continue to be rented at full price. Aylesbury United Football Club currently does not have a dedicated home ground and shares a pitch with Chesham United.\nOur fair deal for Buckinghamshire:\nWe will:\n- Transfer parks, community centres, and green spaces to Town and Parish Councils as promised by the Conservatives during the 2020 roadshow. This will save taxpayer money that can be re-invested in healthcare, education, and public safety, and reduce costs for local clubs and teams while providing high-quality facilities.\n- Establish a binding agreement with Town and Parish Councils for the management of these areas. For smaller parishes lacking the capacity to manage these assets independently, provide necessary support structures and frameworks to ensure seamless and efficient administration. Make it clear that any delay or failure to execute this transfer is unacceptable and detrimental to the community's interests.\n- Update the Town and Parish Council charter to be more robust and inclusive, meeting community needs. It should establish stricter accountability and enforcement to ensure responsible and transparent management of green spaces, upholding public trust and fulfilling promises made by officials.\n- Collaborate with Town and Parish Councils to address community needs through sports teams that encourage good mental and physical health practices, potentially reducing demand on NHS services.\n-\nA Town Full of Life and Culture\nWe will continue to provide a full year-round programme of free and fully accessible events for residents, including Parklife Weekend with Proms, Pride in the Park, Aylesbury on Sea, and the St George’s Day Parade, fostering a vibrant town and boosting visitor numbers.Backing Local Businesses\nOur management of the Christmas Lights display and switch-on event has been a great success. We will continue hosting business roundtables and employ a Town Centre Manager to promote economic growth and footfall.Investing in Our Youth\nWe are committed to providing safe spaces, activities, support, and both volunteering and paid employment opportunities for young people to help them develop essential skills and experiences.A Greener Aylesbury\nWe will maintain our dedication to environmental projects, including litter picking, tree planting, bug hotels, wildlife-friendly areas, cabinet box painting, and the much-loved Aylesbury in Bloom initiative.Protecting and Enhancing Community Assets\nWe will continue investing in the three community centres we rescued from Buckinghamshire Council, as well as the Railway Club, which now serves local groups and organisations. We will also work to take over and improve neglected town assets, particularly recreation grounds that have suffered from years of Tory mismanagement.Holding Buckinghamshire Council to Account\nWe will keep the pressure on Buckinghamshire Council to deliver long-promised infrastructure, including link roads, additional doctors, school places, a new cemetery, and more allotments.Boosting Grassroots Sport\nWe have already refurbished facilities at Bowler’s Field and improved drainage on pitches. We will continue working with Aylesbury United and Aylesbury Vale Dynamos to create a new Community Sports Hub.Supporting Community Groups\nOur grants programme will continue to provide essential funding to local community groups and charities, ensuring they can keep serving Aylesbury’s residents during difficult times.Preserving Aylesbury’s Heritage\nWe remain committed to saving the Old Court Buildings and repurposing them for greater community use, helping to revitalise the town centre.Delivering Value for Money\nWe are dedicated to improving the quality of life for residents while ensuring financial responsibility. We make every penny of the £2.57 per week (Band D) council tax contribution count, ensuring efficient and effective services for the community. -\nOur children are our future, and the Liberal Democrats believe every child deserves access to the education that best meets their needs, regardless of their dependent's financial situation. We recognise the urgent need to improve Special Educational Needs and Disability (SEND) provision in Buckinghamshire, as too many children face unacceptably long waits for assessments and the support they need.\nOur fair deal for Buckinghamshire:\nWe will:\n- Maintain a diverse system of schools that appropriately caters to all children in Buckinghamshire and consider expansions in line with need such as ARP’s.\n- Investing in early education from birth can provide children with a solid foundation, reducing the need for costly special educational support later.\n- Advocate for a fairer system of SEND provision by lobbying the central government.\n- Increase the number of specialist SEND school places in Buckinghamshire to minimize the necessity for distant placements.\n- Conduct an urgent review of the school transport system to enhance its efficiency and safety.\n- Establish mental health hubs to address the growing crisis in young people’s mental health.\n- We will work towards enhancing the quality of all schools and addressing the demand for educational services. It is unacceptable that many secondary schools in Buckinghamshire are currently under Special Measures by Ofsted.\n- We will close the educational gap between diverse types of schools and are committed to expanding free tuition schemes provided by Fairhive Housing Association across Buckinghamshire to ensure equal educational opportunities for every child.\n-\nThe Liberal Democrats will seek a fair deal for planning and housing that meets the needs of all residents and fulfils their aspirations for well-designed, sustainable homes that they need and can genuinely afford.\nThe Labour government’s changes to planning regulations, particularly weakening protections for the green belt, threaten irreversible damage to our countryside and limit opportunities for local people to have their say. These changes now leave Buckinghamshire more vulnerable than ever, as the Conservative-led council has failed to deliver an up-to-date Local Housing and Development Plan with sufficient identified housing sites, putting developers in the driving seat. This is not acceptable.\nAcross the country, there are examples of Liberal Democrat councils that have successfully delivered on housing:\n- York City Council, when under Liberal Democrat leadership, set in place a programme to deliver hundreds of new zero carbon Council houses.\n- Portsmouth Council is providing over 1,330 new Council properties – either built, bought from the private sector, or in the pipeline.\n- South Lakeland funded the building of over 1,000 housing association homes.\n- Kingston Council is building hundreds of new Council houses.\n- Eastleigh Borough Council, run by us since 1995, has delivered thousands of new homes.\n- Oadby & Wigston Borough Council, run by us since 1991, has delivered both homes and protected green spaces, with housing forming a major part of their successful 2023 re-election campaign.\n- Between 2012-2021, the Vale of White Horse was third highest put of 270 Local Authorities for net increase in dwellings as a proportion of their starting stock.\nThese projects generate income to be reinvested in council services.\nOur fair deal for Buckinghamshire:\nWe will:\n- Work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\n- Ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\n- Push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment.\n- Continue investing in the Council’s own temporary housing provision to reduce the costly need for placing vulnerable people in unsuitable accommodation, such as bed and breakfasts.\n- Create a robust Local Plan for housing and development that directs growth to locations where it is most beneficial, curbs unchecked development in unsuitable areas, and protects our greenbelt and natural spaces.\n- Consider developing our own social/affordable/shared ownership properties.\n-\nBuckinghamshire residents care deeply about health and social care, particularly the challenges of accessing GP appointments and NHS dental services. While these services are the responsibility of the NHS rather than Buckinghamshire Council, the Liberal Democrats recognise the vital role that the Council and individual councillors play in consulting with healthcare providers and the NHS Integrated Care Board for Buckinghamshire, Oxfordshire, and West Berkshire. We are committed to advocating for the needs of our residents. We can scrutinise these services through the Health & Adult Social Care Committee and JHOSC Partnership Committee at Buckinghamshire Council.\nCurrently, adult social care accounts for 73% of residents' Council Tax, with a 500% increase in cases since 2021. This trend raises serious concerns about the Council’s long-term financial sustainability and its ability to support individuals in maintaining their independence at home.\nUnpaid carers play a crucial role in delivering care, but their well-being is often at risk. Many face physical and mental health challenges due to the stress of caregiving. The Council’s ability to provide respite care is essential in ensuring unpaid carers can continue supporting their loved ones.\nCharities also play a significant role in supplementing care services. However, many are struggling with funding challenges, and reductions in Council grant funding are putting the sustainability of these organisations—and the services they provide—at risk.\nBuckinghamshire's Children’s Services have consistently let down vulnerable children, as highlighted in numerous OFSTED inspections. The impending report will be released after May’s elections. The council is finally reinvesting in local children's homes to ensure safe accommodation and reduce dependency on overpriced private providers outside the county. This belated move is inadequate given the urgent and complex needs of the service.More needs to be done to make children’s services effective and sustainable. Foster families are essential for children who cannot stay with their own families. The council's recent efforts to recruit more foster families and invest in local children’s homes are positive but overdue steps.\nOur fair deal for Buckinghamshire:We will:\n- Create a scrutiny committee for children's services to ensure vulnerable children receive the necessary support while monitoring financial sustainability. Education will have its own separate scrutiny committee.\n- Residents' perceptions of Bucks Council need drastic improvement, as it is often viewed negatively. Parents must seek legal counsel immediately or brace for a gruelling and unpredictable battle to secure an EHCP (Educational Health and Care Plan). We need to provide guidance and support to parents.\n- Form a task force to evaluate the needs of unpaid carers in Buckinghamshire and improve council support. The Conservative Carer's strategy lacks tangible action for these community heroes.\n- Work with health and care organisations to access additional grant funding.\n- Develop an urgent plan to ensure ongoing day and respite care for vulnerable adults in Buckinghamshire. Evaluate long-term needs before deciding on the closure of care centres. Focus should be on both financial and residents' needs, not just monetary aspects.\n-\nWe live in a beautiful county with valuable green spaces and a strong agricultural base. We believe access to nature offers enormous physical and mental health benefits, and everyone has the right to enjoy green spaces near their home.\nOur farmers play a vital role in ensuring food security and maintaining a healthy rural landscape and economy. They need more support, not the neglect we have seen from the current Labour government.\nAs the effects of climate change and the global loss of nature threaten human well-being both now and, in the future, we in Buckinghamshire must take action to combat climate change and protect a healthy natural environment.\nOur fair deal for Buckinghamshire:\nWe will\n- Provide stronger green space protections by speeding up the delivery of the Buckinghamshire Local Plan for housing and development.\n- Measure and double tree canopy cover across the county by 2050.\n- Establish an effective flood mitigation response team to coordinate with stakeholders, such as the Environment Agency, local landowners, town and parish councils and voluntary organisations, including resident groups, to improve flood prevention.\n- Work to access and secure all available funding for improved flood prevention measures.\n- Collaborate with private providers to improve the availability of electric vehicle charging points, including curb-side charging.\n- Support farmers and landowners in nature conservation efforts.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_letter-to-rob-butler-mp-on-dominic-cummings/content_33.html": "Letter to Rob Butler MP on Dominic Cummings\nPeople across Aylesbury have been following Government Guidance by staying at home and protecting the NHS. Councillor Steven Lambert, the Lib Dem Parliamentary Spokesman for Aylesbury, has written to Rob Butler MP for Aylesbury to ask where he stands on Dominic Cummings travelling 260 miles after getting Covid 19?\nOn the 23rd of May news broke that the Prime Minsters closest advisor, Dominic Cummings, had gone against advice issued to the public to stay at home for at least 7 days if infected by Covid 19.\nThe resulting scandal has seen a public outcry against one rule for close friends of the Prime Minister and one for everybody else. Many Aylesbury Vale residents such as John Wilson from Whitchurch have written to their MP wanting to know where they stand on the issue.\nDoes Mr Butler MP, as many MP's across the political spectrum have already made clear, condemn the actions of Boris Johnson's advisor or do they think his actions were justified?\nRecently, Rob Butler reminded residents of the importance of following the Government's rules when he retweeted the Prime Minister's message \"everybody has a role to play by helping to control the virus by staying alert and following the rules\" on the 10th of May. Since the news broke that Dominic Cummings had gone again this advice but Rob Butler appears to be silent on the issue and on social media.\nLiberal Democrat Parliamentary Spokesman for Aylesbury, Steven Lambert, said \"The good people of Aylesbury and the country have made huge personal sacrifices in order to comply with the regulations put forward by the Government to contain the Virus. Avoiding travelling to loved ones in severe medical distress and resisting the most human of instincts.\nI have written to Rob Butler to ask whether he supports the actions of Mr Cummings, the Prime Minister, and cabinet colleagues - if not will he join me and many of his constituents in condemning the unbridled support of the Prime Minister and Cabinet gave Mr Cummings. Given the urgency of this matter, and the public concerns I call on our MP to urgently clarify his position.\"\nThe people of Aylesbury deserve to know where their elected representatives stand on breaking Government Guidance.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-town-council-save-community-hubs/content_70.html": "Aylesbury Town Council Save Community Hubs\nLiberal Democrat run Aylesbury Town Council has today announced that it has saved the Railway Club and secured the future of three other Community Centres in Aylesbury. At the last election as part of it's 10 point plan for Aylesbury the Aylesbury Liberal Democrats pledged to not only save vital services but also to take on and improve Buckinghamshire Council assets and services, many of which have been run down over many years of mismanagement and lack of investment.\nWith the purchase of the Railway Club, the Town will now be able to benefit from a new space for community events and a wide range of services. The centre of Aylesbury has never had a formal dedicated community space and it's anticipated to be a popular location for not only vital services but cultural and other events.\nThe three community centres, Haydon Hill, Quarrendon & Meadowcroft (including Bowlers Field) and the Aylesbury Vale Multicultural Centre were under threat of their funding being withdrawn which Aylesbury Town Council has now safeguarded. The existing management committees will stay in place and will be supported by Town Council staff to allow them to thrive in their communities.\nImportantly this transfer to the Town Council will be cost neutral as residents will see a reduction in the \"Aylesbury Special Expenses\" as that funding is now supported by Aylesbury Town Council. Aylesbury Liberal Democrats have long campaigned against the inequitable \"Aylesbury Special Expenses\" and we hope that this is the first of many such transfers as previously promised but not yet delivered on by Tory run Buckinghamshire Council.\nThe Aylesbury Liberal Democrats will keep looking out for and after community assets especially at a time when Conservative run Buckinghamshire Council is threatening to cut services and sell assets to the highest bidder.\nThe Aylesbury Town Council press statement can be viewed in full here: https://www.aylesburytowncouncil.gov.uk/news/town-council-announces-plans-to-save-community-hubs/",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_liberal-democrats-launch-buckinghamshire-council-election-manifesto/content_25.html": "Liberal Democrats Launch Buckinghamshire Council Election Manifesto\nOver forty of the Liberal Democrats’ candidates for May’s local elections gathered in Great Missenden recently to launch their election campaign and their positive plan for Buckinghamshire Council.\nAmong the attendees were Susan Morgan, the Liberal Democrats’ leader on Buckinghamshire Council, Sarah Green, the Liberal Democrat MP for the Chesham & Amersham constituency, and councillors and candidates who have recently joined the Party from elsewhere - including Jonathan Waters, former Conservative councillor, and Justine Fulford, former Green Party Parliamentary candidate.\nAt the event, the Lib Dems pledged to focus their campaign on improving access to local healthcare, delivering better value for money for residents’ council tax, and protecting our green spaces from overdevelopment - accusing the Conservative-run Council of having failed to deliver a Local Plan that would ensure housebuilding in our area meets local needs.\nSpecific polices announced include:\n● Ensuring new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\n● Setting up mental health hubs across the county to provide early support and improve the lives of residents.\n● Prioritising better road maintenance using innovative technologies (that are already used in other countries) to reduce costs and speed up repairs.\n● Creating a robust Local Plan for housing and development that directs growth to locations where it is most beneficial, curbs unchecked development in unsuitable areas, and protects our greenbelt and natural spaces.\nSusan Morgan, Lib Dem Group Leader on Buckinghamshire Council, said:\n“Across Buckinghamshire, support is growing for the Liberal Democrats. I’m delighted that previous supporters of all parties are rallying behind us as the best placed alternative to the decades of neglect we’ve seen from the Conservatives.\n“As we go out each week and listen to residents, we hear the same thing over and over again: the Conservatives are taking Buckinghamshire for granted. Our health service is in crisis, our roads\nare full of potholes, and our green spaces are under threat from developers that the Conservatives have let have their way for too long.\n“Buckinghamshire needs a fair deal. I’m proud to be putting forward the Liberal Democrats’ positive plan for change, including better access to health services, more value for money from your council tax, and a housing plan that will deliver the houses that we need, where we need them.\n“This May, local residents who want change should back the Liberal Democrats as the Party who can deliver it.”",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_default-da8ddbf4be521bea1e8501cb169cf4d0/content_57.html": "Anger and disappointment at the lack of ambition for Aylesbury Town Centre\nLib Dem run Aylesbury Town Council have slammed Bucks Council for their lack of ambition and action for the regeneration of of the Town Centre after Bucks Council watered down, again, plans for the County Town.\nCllr Tim Dixon who is one of the two Lib Councillors representing Central Ward, which the town centre is based around, put a motion to the Town Council on 13th June which said:\nThis Town Council does not recognise the planned improvements to Market Square, Kingsbury, and Cambridge Street as anything more than maintenance of the areas and a change in status from a temporary traffic order to a permanent traffic order.\n• This Town Council is disappointed at the lack of long-term positive changes to Kingsbury, and Market Square.\n• This Town Council requests the evidence used in the decision to demolish the Gala Bingo Hall be supplied to the Town Council. This is so that a fully informed decision can be made on the level of support for the new plans by members of Aylesbury Town Council.\nCllr Dixon said “Aylesbury's assets have been neglected by the Conservative run Buckinghamshire Council, and regeneration money has been reallocated to the Exchange area before consultation with residents. The result of which has left Kingsbury and Market Square without the regeneration outlined to residents, businesses, and the Town Council over many years.”\nAfter a passionate and healthy debate, the resolution was passed without amendment and unsurprisingly the Conservative Councillors present voted against the motion. Cllr Sherrilyn Bateman who also represents Central Ward at the Town Co\nuncil said “It makes me so sad that time and again we have tried to engage with Bucks Council and our residents and small businesses get ignored. It’s shameful.”\nLast month officers from Bucks Council attended the full council meeting to present the plans. However, the plans they presented had factual errors which had been pointed out to them before. Cllr Bateman added “I had seen the presentation given a few weeks before and commented then that the plans were inaccurate and had also spelling mistakes. They paid no attention to my suggestions and that of local residents who were present and gave the same unchanged presentation to the town council! It was shocking and disrespectful.”\nCllr Dixon added “This is an abject failure of Bucks Council’s own pledge in its Parish Charter setting out how it would positively work with Parish and Town Councils. The Charter has become a waste of the paper it is written on. All Bucks Council are doing is waving a shroud in the hope that someone will thing there is a plan and action for our county town, when that just isn’t the case. They Conservatives are failing our town yet again.”",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_page-4/content_8.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_rise-of-44-in-four-week-waits-for-gp-appointments-last-year-when-compared-to-2022/content_24.html": "Rise of 44% in four-week waits for GP appointments last year when compared to 2022.\nAylesbury Liberal Democrats have criticised the Conservative Government for letting the community down with their neglect of local health services.\nLib Dem Parliamentary Candidate for Aylesbury, Steve Lambert, is calling for urgent action to reduce GP appointment times, so that patients can see a GP within seven days, or 24 hours if in urgent need. It would be achieved by increasing the number of GPs and increasing the number of nurses and pharmacists fully qualified to prescribe day to day medicines.\nOne case reported to us is Barbara of Bierton who tried to get an urgent GP appointment for 3 weeks before receiving the appointment she needed. She is now receiving the priority treatment she needs from our wonderful hospitals who themselves are being stretched to provide the services to all. The NHS have been let down by the Conservative Government.\nSteve said \"There are major issues facing the NHS today, which we must tackle head on. The Liberal Democrats are committed to ensuring everyone gets the care and treatment they need. It's not acceptable that you can't get an appointment with your GP. That's why the Lib Dems are calling for a fair deal for our Health as the corner stone of our General Election campaign\".\nThe Liberal Democrat Fair Deal for Health includes: Accessible GP Service. Ensuring everyone can see their GP within seven days, investing in the training, recruitment and retention of GPs. Overhauling the NHS Dentistry. Boosting Cancer Survival Rate. Healthcare Workforce Strengthening .Tackling the Ambulance Crisis, Fixing the Social Care Crisis.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_add-news-here-and-not-in-the-archive/content_73.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_residents-in-buckinghamshire-face-a-595-rise-to-energy-bills-in-april-new-figures-reveal-1/content_46.html": "Residents in Buckinghamshire face a £595 rise to energy bills in April, new figures reveal\nBuckinghamshire is set to be hit hard by the expected rise in energy bills in April, new figures have revealed.\nAnalysis by the Liberal Democrats shows that the average yearly bill for homeowners in Buckinghamshire is set to skyrocket by £595 - the equivalent of £49.58 a month - once the new energy price cap comes into effect.\nLast year the average homeowner in Buckinghamshire paid out £753 for their annual energy bill. Under the new price cap coming into force in April, that figure is set to rise to £1348, a 79% increase.\nThe energy price cap is expected to be around £1,865, according to energy experts. More misery looms on the horizon for residents in Buckinghamshire unless action is taken to help them with the cost of bills, with the price cap expected to increase to over £2,000 when it is revised again in the Autumn.\nBuckinghamshire Liberal Democrats are calling for a one-off 'Robin Hood' tax on the super-profits of oil and gas giants, to fund an emergency package of support for local residents facing eye-watering increases to their heating bills.\nThis would include the doubling and expansion of the Warm Home Discount to those in receipt of Universal Credit or Pension Credit, giving 37893 households in Buckinghamshire £300 each off their heating bills this year.\nThe Liberal Democrats are also calling for the doubling of the Winter Fuel Allowance to be doubled, helping 15,030 pensioners in the area keep their homes warm.\nCllr Tim Dixon, Liberal Democrat Shadow Cabinet Member for Finance and Resources said:\n\"These figures reveal that people in Buckinghamshire are facing eye-watering increases to their energy bills in April, while the Government is just sitting on its hands.\n\"Many pensioners and other local residents are already deeply worried about their next heating bill landing on their doormats.\n\"The Liberal Democrats have set out a clear plan to give thousands of people in our area £300 each off their heating bills this year. It's time Boris Johnson stopped taking our local communities for granted and offered families the support they need to cope with energy price hikes.\"\nLiberal Democrat Leader and former Energy and Climate Change Secretary Ed Davey said:\n\"Families are facing an energy bill nightmare, while the Government is asleep at the wheel. They've failed to do anything to protect vulnerable people from this cost of living crisis.\n\"Liberal Democrats are calling for the doubling and expansion of the Warm Home Discount Scheme and the doubling of the Winter Fuel Payments to protect vulnerable people this winter. This would be funded by a one-off 'Robin Hood Tax' on the super-profits of gas and oil companies and traders who are raking it in hand over fist.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_page-8/content_50.html": "The Lib Dems are Winning Across Buckinghamshire\nLIB DEMS MAKING GAINS IN BUCKINGHAMSHIRE\nLIB DEMS MAKING GAINS IN BUCKINGHAMSHIRE\nPeople across Aylesbury have been following Government Guidance by staying at home and protecting the NHS. Councillor Steven Lambert, the Lib Dem Parliamentary Spokesman for Aylesbury, has written to Rob Butler MP for Aylesbury to ask where he stands on Dominic Cummings travelling 260 miles after getting Covid 19?",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news/content_20.html": "Aylesbury Liberal Democrats Unveil Ambitious Town Council Manifesto\nThe Aylesbury Liberal Democrats are thrilled to unveil their manifesto for the upcoming Town Council elections, presenting an exciting vision for the future of our town.\nThe Aylesbury Liberal Democrats are thrilled to unveil their manifesto for the upcoming Town Council elections, presenting an exciting vision for the future of our town.\nToday, Friday 28th March, Aylesbury Liberal Democrats handed in nomination papers for a full slate of candidates to contest all the wards in Aylesbury up for election on Buckinghamshire Council elections on Thursday 1st May.\nToday marks the start of 9 days of Hindu festivals. The Liberal Democrats embrace every community and wish you all a wonderful Chaitra Navratri, Ugadi, Gudi Padwa, and Ram Navmi!\nThe Conservative run administration are selling off all of our assets to balance books! Where is the long term ambition and drive to improve Aylesbury?\nThe Bucks Council SEND department is in crisis, not supporting vulnerable children, with the processing times for Educational and Health Care Plans (EHCPs) drastically exceeding targets leading to detrimental impacts on families.\nConservative-run Council leaves our roads & paths in ruin",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_steve-lambert-and-aylesbury-liberal-democrats-back-new-manifesto-with-nhs-at-the-heart/content_47.html": "Steve Lambert and Aylesbury Liberal Democrats back new manifesto with NHS at the heart\nThe Liberal Democrats have launched their General Election manifesto and outlined a plan to save health and care services. The manifesto offers a bold and fully costed £9bn plan to tackle the health and care crisis.\nThe bold plan to save the country’s health services includes:\n- Giving everyone the right to see a GP within seven days, or within 24 hours if they urgently need to, with 8,000 more GPs to deliver on it.\n- Guarantee access to an NHS dentist for everyone needing urgent and emergency care, ending DIY dentistry and ‘dental deserts’.\n- Boost cancer survival rates and introduce a guarantee for 100% of patients to start treatment for cancer within 62 days from urgent referral.\nThe Liberal Democrat manifesto also includes a plan to overhaul the water industry and tackle sewage pollution, a dedicated mental health professional in every primary and secondary school and a return to community policing including a new burglary response guaranteed to tackle unsolved crimes.\nSteve Lambert the Liberal Democrat Parliamentary Candidate for the Aylesbury Constituency, which has new boundaries, has been speaking to residents about the plans, he said: “Families and pensioners are telling me on the doorstep the problems they have had getting GP and Dentist appointments.\nSome have been heartbreaking. People are fed up with being taken for granted by the Conservative Party.With a strong local councillor base across the new constituency where there are no labour councillors, the traditional conservative voting residents are saying that they have had enough and that they are voting Lib Dem this time.”\nSteve said, “this fully costed manifesto covers both national international policies including an immediate bilateral ceasefire in the Israel-Gaza conflict and strengthening our relationship with the EU and locally, a new country park in the Chilterns.”\nSteve added “Every vote for the Liberal Democrats at this election is a vote to elect a strong local champion who will fight every day for our NHS and care and the issues that really matter to our community.\nPeople desperately want change, from fixing our health and care services to returning to proper community policing the Liberal Democrats have a plan to make our community a better place. The Liberal Democrats are fighting for local people and giving communities the change they want.”\nThe fully costed Manifesto can be found here: https://www.libdems.org.uk/manifesto\nThere are alternative formats available here:\nEasy read version: For_a_Fair_Deal_-_Liberal_Democrat_Manifesto_2024_-_Easy_Read.pdf\nPlain Text version: https://www.libdems.org.uk/fileadmin/groups/2_Federal_Party/Documents/PolicyPapers/Man[…]air_Deal_-_Liberal_Democrat_Manifesto_2024_-_Plain_Text.txt\nClear Print version: https://www.libdems.org.uk/fileadmin/groups/2_Federal_Party/Documents/PolicyPapers/Man[…]ir_Deal_-_Liberal_Democrat_Manifesto_2024_-_Clear_Print.pdf\nAudio and Braille and BSL versions will be published shortly.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_local-election-2023/content_18.html": "Local Election 2023\nAfter local elections in May, local data shows massive gains in nearby councils.\nThis reflects, that the national mood has changed!\nPeople are fed up with the chaos created by both the Conservatives and Labour!\nPeople are looking for a fairer politics - with councillors who understand the needs of their residents.\nA party that fights tooth and nail for the environment! Who understand that this cost of living crisis has gone on for far too long!\nWho recognize, that the strength of our country, comes when we work together and celebrate our multi-cultural communities.\nA vote for the liberal democrats - is a vote against our failed system and towards the solution!\nThe people of our local area realize this - as do the people of Buckinghamshire!",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_tory-planning-reform-pause-must-be-used-to-tackle-the-housing-crisis-in-bucks/content_63.html": "Tory Planning Reform 'pause' must be used to Tackle the Housing Crisis in Bucks\nResponding to news that the Government has paused its planning reforms, Cllr Gurinder Wadhwa, the Lib Dem spokesperson on Planning at Buckinghamshire Council said:\n\"This pause announced by the Government has to be an opportunity to deliver lasting and engaging planning policy to tackle the housing supply crisis and deliver affordable green homes in Buckinghamshire. The Government is on the ropes when it comes to planning. The constant tinkering with planning rules and ending local people's say over development in their area was the last straw for many. The Liberal Democrats want to see development that puts local community first, not profit and will deliver more carbon zero, high-quality, affordable homes.\"\nThe controversial reforms pushed by the Conservatives was the number one issue in Buckinghamshire during the Chesham and Amersham by-election, decisively won by the Liberal Democrats. Last week at Buckinghamshire Full Council, the Lib Dems backed the implementation of the Vale of Aylesbury Local Plan (VALP) to safeguard our green spaces and stop a developers bounty hunt by putting in place a wide range of planning policies. But, still, in Bucks, there are no safeguards in the Chilterns or South Bucks, including around Chesham and Amersham, as the Tories withdrew the local plans last year. In the same meeting, it was revealed that there are thousands of people on the 'council housing waiting list'.\nCllr Gurinder Wadhwa said: \"At our conference this weekend the Lib Dems debated and voted on a policy paper 'Building Communities' which sets out that the most effective way to achieve house building is with the consent and active involvement of our local communities. I am looking forward to what Michael Gove is going to do with this 'pause'. There needs to be a wholesale rethink to these proposals, not simply pause and start again with the same reforms. The Liberal Democrats won't stop campaigning to put community above profit when building the homes that are needed.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-libdems-stands-full-slate-of-candidates-for-2025-local-elections/content_5.html": "Aylesbury LibDems stands full slate of candidates for 2025 local elections\nToday, Friday 28th March, Aylesbury Liberal Democrats handed in nomination papers for a full slate of candidates to contest all the wards in Aylesbury up for election on Buckinghamshire Council elections on Thursday 1st May.\nCouncillor Susan Morgan, Leader of the Liberal Democrat Group on Buckinghamshire Council, says;\n\"The May 1st elections are a chance for change after years of Conservative rule that often ignored community needs. The Labour Party's policies have also raised concerns about their impact on vulnerable groups. The Liberal Democrats offer a better approach focused on the community.\n\"I am excited to introduce our team of candidates who are dedicated to serving as Community Champions. They will listen to residents and prioritise Aylesbury's best interests.\"\nCllr Richard Lloyd, Liberal Democrat Leader on Aylesbury Town Council added: “At the last elections for Buckingshamshire and Town Councils in 2021, 33 Liberal Democrat councillors were elected to 19 Conservatives. With Labour and the Greens having no unitary or town council wins in Aylesbury. The Liberal Democrat run town council has gone on to save three community centres, the Railway Club and brought football back to Bowler’s Field alongside the free events we’re already well known for.\n“This May across Aylesbury it’s a clear choice between the Conservatives or positive change with the Liberal Democrats.”\nThe last time Buckinghamshire Unitary and Aylesbury Town Council elections took place in 2021 33 Liberal Democrats were elected at either Town or Unitary Council Level in the wards and divisions within the Aylesbury Constituency. The same year (2021) only 19 Conservatives were elected at either unitary or Town level. There are no Labour or Green Councillors in Aylesbury.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_values/content_37.html": "What we stand for\nThe Liberal Democrats exist to build and safeguard a fair, free and open society, in which we seek to balance the fundamental values of liberty, equality and community, and in which no-one shall be enslaved by poverty, ignorance or conformity.\nPreamble to the Liberal Democrat Constitution\nThe Liberal Democrats stand firm on seven core values: liberty, equality, democracy, community, human rights, internationalism, and environmentalism. Each of these underpin the party's specific policy proposals.\nLiberty\nWe believe in the right of individuals to make their own decisions about how they live their lives, as long as they do not cause harm to others.\nOur aim is to empower and support individuals to pursue their dreams, to make the most of their talents and to live their lives as they wish.\nEquality\nWe stand by the idea that without equality, true liberty cannot be realised.\nThis requires an active state to: ensure that no one is held back by poverty, poor health, or discrimination, including on the basis of personal characteristics or beliefs; provide access to education or training, and other public services, including a welfare safety net; and guarantee that everyone enjoys equality before the law.\nDemocracy\nWe understand that through democracy, every citizen is empowered to make their voice heard, without being dominated by entrenched interests or the power of money; checks and balances, so that those in power cannot abuse their positions for personal gain or political advantage; and a plurality of views, where no individual or organisation is deterred from speaking truth to power.\nCommunity\nWe believe it is important to provide support for a diverse range of organisations that enable individuals to join together in the pursuit of common goals or activities; and the decentralisation of political and economic power to local government and the nations and regions of the UK.\nHuman Rights\nProviding, defending and promoting equal legal rights for everyone to pursue their lives according to their abilities, wishes and means, with no discrimination on the basis of religion or belief, gender, sexuality, age, ethnicity, disability, or minority status in their country of birth or permanent residency is highly important to us.\nInternationalism\nWe support a fairer and more equal, tolerant and connected world and collaboration with the UK's neighbours - including, ultimately, rejoining the EU - in guaranteeing peace and security, tackling the climate and nature emergencies, standing up to corporate power and spreading prosperity around the world.\nEnvironmentalism\nWe value the importance of acting at home and internationally to promote environmentally sustainable means of production and consumption and living in harmony with nature.\nOur policies\nLearn more about the influence these values have on Liberal Democrat policy",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_donate/content_27.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_the-lib-dems-are-winning-across-buckinghamshire/content_34.html": "The Lib Dems are Winning Across Buckinghamshire\nLIB DEMS MAKING GAINS IN BUCKINGHAMSHIRE\nThe Liberal Democrats are winning against the Conservatives in Buckinghamshire. At the May 2021 local elections, the party gained Town and Buckinghamshire Councillors cementing ourselves as the clear alternative to the Conservatives in Aylesbury and Buckinghamshire. In the Chesham and Amersham by-election, the Liberal Democrats elected their first ever Buckinghamshire Member of Parliament.\nAylesbury Town Council is now made up of 20 Liberal Democrats & 5 Conservatives, and 14 Buckinghamshire Councillors were elected as Liberal Democrats in Aylesbury Constituency.\nAcross the South of England, the Liberal Democrats made stunning gains - from gaining control of Cambridgeshire and Oxfordshire Council for the first time ever, to gaining seats in Wiltshire, Woking, Surrey, Tunbridge Wells at many more.\nThe Liberal Democrats shock triumph in the neighbouring Chesham and Amersham by-election would see some 154 seats across the country flip to the party after they sent shockwaves through the Tory blue wall.\nThe Liberal Democrats gained a 25% swing in Chesham and Amersham electing their 12th MP Sarah Green.\nAylesbury would be one of 154 constituencies that would turn Liberal Democrat at an election.\nThe 25% swing to the Lib Dems in Chesham and Amersham has put blue wall seats like Aylesbury \"on notice\" with Aylesbury Liberal Democrat being the leading opposition to the Conservatives here, especially after the local gains made by Aylesbury Liberal Democrats in May.\nThe Lib Dems have said many Conservative MPs such as Rob Butler are looking over their shoulders and feeling worried about the party making gains in their area.\nSteven Lambert, Leader of the Opposition on Buckinghamshire Council, said:\n\"Our huge triumph in Chesham and Amersham and our gains in the local elections have shown that the Liberal Democrats are the serious and credible opposition to the Convervative party in Buckinghamshire.\n\"Their blue wall isn't just on notice; it has been shaken at its foundations by the Liberal Democrats in both the Chesham and Amersham by-election and the last set of local elections.\n\"Residents do not like being taken for granted and that's exactly what this Conservative party is doing time and time again by centralising more powers away from town and parish councils, ignoring residents on planning & HS2 and wasting taxpayers money on the largest council in the country.\"\nCommenting on the Chesham and Amersham by-election success, Liberal Democrat Leader Ed Davey said:\n\"This is a huge victory for the Liberal Democrats. The people of Chesham and Amersham have sent a shockwave through British politics.\n\"We were told it was impossible for any party to beat the Tories here in Buckinghamshire. We were told this seat was too safe and the Tories too strong. This Liberal Democrat win has proved them utterly wrong.\n\"Across the south, the Tory Blue Wall is beginning to crumble. Here and in great swathes of the country, only the Liberal Democrats can beat the Conservatives and breach their Blue Wall.\n\"This amazing win will strengthen our fight to safeguard our precious natural environment and build a fairer, greener, more caring country.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-lib-dems-accuse-rob-butler-of-breaking-promises-and-betraying-world-s-poorest/content_64.html": "Aylesbury Lib Dems accuse Rob Butler of breaking promises and betraying world's poorest\nCllr Steven Lambert, Liberal Democrat Leader on Buckinghamshire Council, has accused Rob Butler, Aylesbury's Conservative MP, for abandoning their election commitment on international development spending by voting to maintain the UK's cut on foreign aid spending, which will endanger the lives of people around the globe.\nIn the 2019 General Election, Conservative MPs including Rob Butler stood on a manifesto promise to \"proudly maintain our commitment to spend 0.7 per cent of GNI on development\".\nThis week, the Government won a vote in Parliament to continue their recently announced annual £4bn cut of Britain's international development spending from 0.7% to 0.5% GNI for at least 5 years.\nLiberal Democrat spokesperson for Aylesbury, Steven Lambert, has written to Rob Butler saying that he \"has broken a promise to your constituents and to the world's poorest.\"\nAylesbury Cllr Steven Lambert said:\n\"Aylesbury needs an MP who will keep their word. When Rob Butler stood for Parliament in 2019, he pledged to support the 0.7% target on aid spending. He has callously broken his promise and abandoned millions of the most vulnerable and disadvantaged people in our world.\n\"Rob Butler's vote will have an enormous impact on the most vulnerable, costing lives, stopping girls from going to school and putting a wrecking ball through vital projects like tackling the climate crisis.\n\"The Liberal Democrats have supported international development spending for over sixty years and put the 0.7% target into law in 2015. It is the right thing to do, both for the UK, and those who need our help. Rob Butler has voted to end that commitment. It is wrong.\"\nLiberal Democrat Foreign Affairs and International Development Spokesperson Layla Moran MP said:\n\"Every Conservative MP stood on a manifesto commitment to the 0.7% target. They have now voted to cut the development budget for at least the next five years, if not more. It will do irreparable damage to Britain's reputation across the globe. Now is the time for leadership - but instead, the Conservatives want Britain to hide from its responsibilities during a global pandemic.\n\"Conservative MPs have broken their promise to the world's poorest and to the British people and, as we saw in the Chesham and Amersham by-election, voters in the blue wall won't forget that. These events make a mockery of Global Britain.\n\"Liberal Democrats will continue to campaign to reinstate the 0.7% target, which we enshrined in law. Foreign aid spending protects the most vulnerable people around the world and gives them a better chance at life. This is not over.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-town-council-election-results/content_75.html": "Aylesbury Town Council Election Results\nAYLESBURY TOWN COUNCIL ELECTION RESULTS\nLib Dems Make Stunning Gains\nBEDGROVE WARD (3 Councillors)\nElected: 2 Conservatives (Hold), 1 Liberal Democrat (Gain).\nEDMONDS, Stephen Mark Liberal Democrat Focus Team 736\nHOBBS, Paul Alan Bucks Residents Association 655\nHODGE, Jeremy Liberal Democrat Focus Team 581\nKHAN, Khalid Conservative Party Candidate 493\nKHAN, Raj Wali Liberal Democrat Focus Team 749 E\nTHOMPSON, David Beresford Conservative Party Candidate 945 E\nWINN, Mark Edward Conservative Party Candidate 1177 E\nCENTRAL WARD (2 COuncillors)\nElected: 2 Liberal Democrats (Gainx2)\nBATEMAN, Sherrilyn Anne Liberal Democrat Focus Team 673 E\nDIXON, Timothy John Liberal Democrat Focus Team 710 E\nNEWCOMBE, Richard Allan Conservative Party Candidate 386\nWAITE, Ashley Conservative Party Candidate 340\nCOPPICE WAY WARD (1 COUNCILLOR)\nElected: 1 Liberal Democrat (Hold)\nCOLLINS, Michael Henry Conservative Party Candidate 112\nHENDREN, Christopher Charles Liberal Democrat Focus Team 164 E\nELMHURST WARD (2 COUNCILLORS)\nElected: 2 Liberal Democrats (Hold)\nMORGAN, Ashley Richard Liberal Democrat Focus Team 971 ELECTED\nMORGAN, Susan Ann Liberal Democrat Focus Team 1013 ELECTED\nNEALE-SHEPPARD, Gillian Ann Conservative Party Candidate 534\nRAHEEL, Ammer Conservative Party Candidate 484\nGATEHOUSE WARD (3 COUNCILLORS)\nElected: 3 Liberal Democrats (Holdx2, Gainx1)\nCHRISTENSEN, Anders Carl Liberal Democrat Focus Team 1123 E\nDEY, Prakash Kumar Conservative Party Candidate 505\nHUSSAIN, Tuffail Liberal Democrat Focus Team 1097 E\nKOYA, Phanindar Liberal Democrat Focus Team 894 E\nYANDRAPATI, John Kiran Kumar Conservative Party Candidate 441\nHAWKSLADE WARD (1 COUNCILLOR)\nElected: 1 Liberal Democrat (Gain)\nBALDWIN, Mary Agnes Liberal Democrat Focus Team 340 E\nCOLE, Andrew John Conservative Party Candidate 210\nMandeville and elm farm (3 councillors)\nElected: 3 Conservatives (Holdx2, Gainx1)\nCHAPPLE, Susanne Conservative Party Candidate 971 ELECTED\nCRANE, Jake Richard Liberal Democrat Focus Team 601\nKING, Roger John Conservative Party Candidate 873 ELECTED\nSHAH, Muzammil Liberal Democrat Focus Team 549\nSUMMERS, Denise Andree Conservative Party Candidate 888 ELECTED\nWILLIS, Kathleen Frances Liberal Democrat Focus Team 651\nOAKFIELD WARD (2 COUNCILLORS)\nElected: 2 Liberal Democrats (Holdx2)\nGASTER, Richard Peter John Conservative Party Candidate 374\nHUNTER-WATTS, Tom Liberal Democrat Focus Team 595 ELECTED\nTORPEY, Richard William Green Party Candidate 279\nWARD, Julie Elizabeth Conservative Party Candidate 395\nWILLIS, Mark Frederick Liberal Democrat Focus Team 616 ELECTED\nOXFORD ROAD WARD (2 COUNCILLORS)\nAZAM, Mohammed Liberal Democrat Focus Team 686 E\nLAMBERT, Steven Michael Liberal Democrat Focus Team 760 E\nNORTH, Samantha Jane Conservative Party Candidate 283\nREDDING, Louis Edward Conservative Party Candidate 227\nQUARRENDON WARD (2 COUNCILLORS)\nElected: 2 Liberal Democrats (Gainx2)\nAWOSIKA, Folajimi Raymond Conservative Party Candidate 286\nBRIGHT, Gerald Robert Martin Bucks Residents Association 220\nHUXLEY, Andrew Bucks Residents Association 269\nSHERWELL, Alan Neale Liberal Democrat Focus Team 447 Elected\nWADHWA, Gurinder Liberal Democrat Focus Team 401 Elected\nWATSON, John Martin Conservative Party Candidate 297\nSOUTHCOURT WARD (2 COUNCILLORS)\nElected: 2 Liberal Democrats (Holdx1, Gainx1)\nADOMAH-BOADI, Charles Anthony Conservative Party Candidate 330\nHUSSAIN, Niknam Liberal Democrat Focus Team 980 E\nKHAN, Asalat Conservative Party Candidate 296\nRAJA, Waheed Khan Liberal Democrat Focus Team 1045\nWRIGHT, Brian Philip 152\nWALTON COURT WARD (1 COUNCILLOR)\nElected: 1 Liberal Democrat (Holdx1)\nMEHTA, Nidhi Liberal Democrat Focus Team 242 E\nSPROAT, Sarah Conservative Party Candidate 116\nWalton ward (1 councillor)\nElected: 1 Liberal Democrat (Gainx1)\nCHAPPLE, William John Yendell Conservative Party Candidate 324\nLLOYD, Richard Gordon Liberal Democrat Focus Team 435 E",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_get-involved/content_43.html": "Be one of our proof readers\nA proof reader checks all materials to be printed or published online by our campaign teams\nWe are looking for enthusiastic and motivated supporters that can help deliver our message to residents across the Aylesbury Constituency.\nOur volunteers do all kinds of activities for us, ranging from walking the streets delivering leaflets, talking to residents on the doorstep, to doing admin work like stuffing envelopes, running our print office or managing our email, website or social media.\nIf you have experience or interest in any of the roles below, please complete the volunteer form and we'll get in touch to help you get involved.\nThe following are just SOME of the roles that our volunteers can help with\nA proof reader checks all materials to be printed or published online by our campaign teams\nA leaflet deliverer is normally designated a specific area or street - usually around 60 doors or about half an hours work. Some choose to do more.\nAs a content administrator you would receive stories and photos from councillors or campaign teams to upload on this website for the web manager to approve and publish.\nThe wholesalers help bundle up the leaflets so they can be distributed to our volunteer deliverers. This is an easy role to do at home. Distribution can be done by someone else if you only have time to bundle.\nOur coordinator will need to focus on setting up our new small scale fundraising club as well as coordinating fundraising efforts at our social events.\nA Leaflet Delivery Volunteer Manager is responsible for growing and maintaining our network of deliverers and wholesellers and will mostly work with the membership development officer and the ward teams.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_only-01-of-police-dedicated-to-rural-crime-teams/content_21.html": "Only 0.1% of police dedicated to rural crime teams\nThe Conservative government have “neglected” rural communities, according to Steve Lambert the Parliamentary Candidate for Aylesbury Constituency, which has several rural villages and hamlets, as figures reveal that Thames Valley police cut numbers of staff and officers dedicated to rural crime last year to just 14 for the whole of the Thames Valley.\nWith fewer than one in 1,000 police officers around the country dedicated to rural crime teams Steve Lambert said “we need to scrap the Police and Crime Commissioner role and end the neglect of our rural communities. I am shocked that in our area it has gone down in the last year to just 14 officers”\nIn April, Liberal Democrat leader Ed Davey called for Police and Crime Commissioners to be scrapped so the savings can be invested in frontline policing, including ensuring that every police force has a properly resourced rural crime team. It is estimated the move would save £150 million every four years.\nThrough a series of Freedom of Information requests, the Liberal Democrats discovered how many officers and staff are assigned to rural crime teams in each police force. 37 forces provided responses.\nSteve said crime and anti-social behaviour in rural areas includes many specific types of crimes that are unique to the countryside like livestock theft.\nRural crime teams are focused on preventing and solving rural crime, with specialist knowledge, equipment and skills.\nNot a single police force, including Thames Valley had more than 1% of its officers and staff deployed to rural crime teams.\nThese disturbing revelations come as rural crime remains on the rise. NFU Mutual’s 2023 Rural Crime Report revealed that in 2022, the cost of rural crime across the UK rose by 22%, to an estimated total of £49.5 million.\nThe Liberal Democrat believe that every force should have a specialist coordinator in their rural crime team, in line with recommendations from The National Rural Crime Network.\nThe party’s proposal to invest savings from scrapping PCCs into resourcing rural crime teams is the latest in a string of Liberal Democrat calls for the Conservative Government to take rural crime seriously. Last year, Liberal Democrat MP Richard Foord tabled a Bill that would require the Home Secretary to bring forward a strategy for tackling rural crime.\nThe Liberal Democrat manifesto sets out plans for a Fair Deal for Policing and do what actually works to stop and solve crime, including:\n- Restore proper community policing, where officers are visible, trusted and focused on preventing and solving crimes – especially rape and other violent crime;\n- Implement our Burglary Response Guarantee, under which all domestic burglaries will be attended by the police and properly investigated;\n- Create a new, national Online Crime Agency that would take over things like online fraud and abuse, leaving more time for local forces to tackle burglaries and other neighbourhood crimes;\n- Scrap Police and Crime Commissioners and invest the savings in frontline policing instead;\n- Tackle the court backlogs, ensure swift justice for victims, and reduce the number of people in prison on remand.\nMore detail can be found here: Police workforce, England and Wales: 30 September 2023.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-liberal-democrats-recognise-misogyny-as-a-hate-crime/content_65.html": "Aylesbury Liberal Democrats: Recognise misogyny as a hate crime\nAfter Prime Minister Boris Johnson said he didn't want to make misogyny a hate crime, Aylesbury Liberal Democrats have called on the Conservative government to show they are taking violence against women and girls seriously\nWhen it is estimated that 66% of young women and girls have been harassed in public, and with reports of rape, gendered and sexual violence continuing to rise, it is simply unacceptable that convictions for sexual violence are at a record low.\nOnly 2.4% of rape cases end in conviction and out of 139,000 rapes estimated by the ONS, only 58,848 were reported to the police in 2019/20.\nTens of thousands of women report crimes to the police each year which are motivated by misogyny, but they are not recorded as such. As the law stands, women are unprotected by the failure to classify misogyny.\nUnlike the Conservatives, the Liberal Democrats have a clear plan to tackle violence against women and girls. At the recent Liberal Democrat Conference, the party passed a motion which called on the Government to -\n- Take immediate action on sexual harassment in school by consulting with education leaders and putting sexual harassment guidance onto the national curriculum.\n- Bring justice to victims of sexual assault by urgently increasing funding to reduce criminal and family backlogs.\n- Put legislation in place which makes public sexual harassment a criminal offence and makes Female Genital Mutilation a hate crime.\nYou can read the full detailed breakdown of the party's plans at libdems.org.uk/f46-ending-violence-against-women-and-girls.\nCommenting on the Liberal Democrat Proposals, Aylesbury Town Councillor Sherrilyn Bateman said :\n\"As the recent high profile cases of Sarah Everard and Sabina Nessa show us, misogyny and violence against women and girls is an epidemic in this Country.\"\n\"Not even our school children are safe from this crisis, with a third of 16-18 year old girls reporting unwanted sexual touching at school.\"\n\"These crimes cannot be allowed to continue. We have a duty to women and girls and we must all be able to live in a free and safe society without fear of attack.\"\n\"The Conservatives have shown an absolutely shocking lack of responsibility in allowing this level of violence against women and girls in our society. The Government must recognise misogyny as the hate crime it is and take the necessary actions to tackle it head on.\"\n\"In 2021, misogyny cannot be tolerated anymore. It is time for a culture change.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_boundary-commission-reject-conservative-proposals-for-buckinghamshire-backing-lib-dem-plans-instead/content_52.html": "Boundary Commission Reject Conservative Proposals for Buckinghamshire – Backing Lib Dem Plans Instead.\nThe Local Government Boundary Commission has confirmed that at the next Buckinghamshire Council elections, the council will be reduced in size to 98 councillors.\nDuring the Local Elections, Aylesbury Liberal Democrats called for the council to be reduced to under 100 members to save taxpayers at least £600,000 a year.\nBuckinghamshire Conservatives instead argued that the Council should have 120 members at the next election, and formally submitted this proposal to the Boundary Commission on behalf of Buckinghamshire Council.\nAylesbury Liberal Democrats argued that 120 councillors would be completely unnecessary and would only slow down decision making without increasing representation for local residents.\nCurrently, Buckinghamshire Council is the largest council in the country with over 20 Councillors more than the next largest.\nIt is also considerably bigger than the Scottish Parliament, with each councillor costing residents at least £13,000 a year.\nCommenting, Steven Lambert, Liberal Democrat Leader at Buckinghamshire Council said:\n'We are delighted that the Boundary Commission has agreed with us, and the Conservatives wasteful proposals have been ignored.'\n'Aylesbury Liberal Democrats have consistently called for the number of councillors in Buckinghamshire to be reduced to under 100.\"\n'During this year's local election, it was one of our key campaign messages as Aylesbury Liberal Democrats enjoyed stunning success, winning 20 out of 25 Town Council seats and 13 out of 18 Buckinghamshire Council seats in Aylesbury.'\n'I'd like to thank everyone who participated in the first stage of consultation and shared their views with the commission.'\n'We will now campaign during the next stage of the review to ensure that all wards drawn up by the commission represent real, local communities so that all residents can have the best representation possible.'",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_new-analysis-aylesbury-is-one-of-the-conservatives-most-vulnerable-seats/content_51.html": "New Analysis : Aylesbury is one of the Conservatives 'Most Vulnerable' seats\nAccording to analysis by the New Statesman, Aylesbury is one of the Conservatives 'Most Vulnerable' seats to the Liberal Democrats at the Next General Election based on the results of the 2021 Local Elections.\nAt May's Local Elections, the Liberal Democrats made significant gains from the Conservatives in Aylesbury, winning 20/25 seats on the Town Council and 14/18 seats on Buckinghamshire Council in Aylesbury Town.\nThe Liberal Democrats have established themselves as the clear opposition to the Conservatives in Aylesbury, and after the success of the Liberal Democrats in the neighbouring parliamentary by-election in Chesham and Amersham, Aylesbury could become the next brick in the blue wall to fall.\nIf you would like to help us turn Aylesbury golden at the next general election, please sign up here.\nOriginal Article : https://www.newstatesman.com/politics/elections/2021/06/which-conservatives-blue-wall-seats-are-most-vulnerable",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_we-must-do-more-on-afghanistan/content_53.html": "We must do more on Afghanistan\nAylesbury Liberal Democrats have called on Buckinghamshire Council and the Government to do more to support refugees in response to the situation in Afghanistan.\nSince 2014, Buckinghamshire has resettled only 9 Syrian refugees as part of the Vulnerable Persons Resettlement Scheme. They must do better.\nCllr Peter Cooper, Buckinghamshire Council Shadow Cabinet Member for Communities and Housing said:\n\"The chaotic withdrawal of coalition troops from Afghanistan has put its local population in immediate danger.\nBuckinghamshire must join all UK local authorities in playing its part in welcoming and housing as many Afghan refugees as possible. The plans and decisions required need more than just \"consideration\".\nThe council must take immediate positive action and I call on the council's leadership to coordinate cross party action aimed at housing incoming refugees starting today.\nWaiting for allocations to be imposed by government at some time in the next weeks is simply not good enough.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_eid-mubarak-1-2/content_54.html": "Eid Mubarak!\nA\nby Admin1\n21 Apr 2023\nAylesbury Liberal Democrats wish all our friends, family, and community who are celebrating today, a very Happy Eid!\nEid Mubarak!\nAylesbury Liberal Democrats wish all our friends, family, and community who are celebrating today, a very Happy Eid!\nEid Mubarak!",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_new-figures-reveal-sharp-fall-in-gps-per-person-in-aylesbury/content_58.html": "New figures reveal sharp fall in GPs per person in Aylesbury\nBuckinghamshire is one of the worst hit areas in the country by the growing shortage of GPs, new analysis by the Liberal Democrats has revealed.\nIt comes as many people are struggling to book an appointment with their GP, with services increasingly under pressure from rising demand.\nThe figures show there is now just one GP per 2,256 people in June 2021, compared to the national average of one GP per 2,038 people.\nThis is up 4% from the one GP per 2,171 people in Buckinghamshire five years ago.\nThe number of GPs employed in the area has stayed at the exact same level over the past 5 years despite the rising population and new housing developments we see across our area.\nAylesbury Liberal Democrats said the alarming figures, based on analysis by the House of Commons Library, revealed the stark \"postcode lottery\" facing GP patients. The party is calling on the government to invest in GP services to ensure people can get a doctors' appointment when they need one.\nFurther analysis by the British Medical Association (BMA) shows a dismal picture overall for GPs, with there being the equivalent of over 1,900 fewer fully qualified, full-time GPs now than there were in 2015.\nThe picture is similarly bleak when compared to the UK's international neighbours. OECD stats from 2019 show that the UK's average of three doctors per 1,000 people ranks below the likes of Hungary and Czech Republic, and only just ahead of Brazil and Mexico.\nSteven Lambert, Liberal Democrat Parliamentary Spokesperson for Aylesbury said:\n\"The Conservative government are badly letting down both GPs and patients. Aylesbury residents deserve a fair deal. Instead of fixing the GP shortage crisis, the Conservatives are making it worse by failing to train the new doctors we desperately need.\"\n\"The worsening GP shortage has given rise to a postcode lottery, with our hard-working GPs overstretched and people left waiting too long for treatment or even an appointment.\n\"I have seen these issues first hand, finding it virtually impossible to get an appointment at my local GP's surgery.\"\nSusan Morgan, Liberal Democrat Spokesperson for Health and Adult Social Care at Buckinghamshire Council, added:\n\"Families rely on being able to see a GP when they or their children fall sick to get advice, access treatment and get well again.\n\"This lack of investment will hit the most vulnerable families in Aylesbury the hardest, with lower income households and those with long term medical conditions stuck in endless waits to get treatment\"\n\"The government must invest more in our GP practices and train up more doctors, to ensure patients get the fair deal they deserve and Buckinghamshire Council must do everything in their power to encourage more new doctors to practice in our county.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_page-8/content_9.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_page-3/content_42.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_tim-bearder-new-direction-for-thames-valley-police/content_66.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_volunteer/content_31.html": "Join our team of activists\nHelp us make a difference where you live\nThe volunteer activists that make up the local Aylesbury party play a critical role helping us deliver on our ambitions for the Aylesbury constituency. We have a number of vacancies for helpers - sign up to help us below, and we'll get in touch. Alternatively contact one of our executive officers to get started straight away.\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_e-focus/content_14.html": "News Local to you.\nIn addition to our local leaflets, we offer occasional electronic versions of our \"Focus\", an e-focus delivered straight to your inbox. We will also use your email to alert you to any urgent issues or matters that we think would be of interest to you and residents in your street. You can opt out at any time. Expect to read the same sort of thing you get from us in the leaflets and street letters we deliver through your letterbox.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-lib-dems-call-for-emergency-five-point-plan-as-deadly-ambulance-delays-grip-local-health-services/content_38.html": "Aylesbury Lib Dems call for emergency five point plan as deadly ambulance delays grip local health services\nAylesbury Liberal Democrats have today called on the Government to bring in the army to help drive ambulances in the area, as the latest figures reveal 57 patients were stuck for more than an hour in ambulances outside the local hospitals in the last week alone.\nNew official figures published today reveal that ambulance response times to emergency 999 calls are exceeding government pledges in South Central Ambulance Region. In November, the average response time for Category 2 calls (emergency calls involving a serious condition that may require rapid assessment and/or urgent transport, such as a stroke or chest pain) was 53:49 - nearly treble the 18-minute target.\nMeanwhile, 122 patients in Buckinghamshire Healthcare NHS Trust spent more than 30 minutes waiting to be handed over from an ambulance to A&E last week - 57 of them were waiting for more than an hour.\nThe findings come a month after the Liberal Democrats secured confirmation from the Government that South Central Ambulance Trust is now at REAP Level 4 - the highest alert level, indicating \"extreme pressure\" - along with all other ambulance trusts in England. Both the Association of Ambulance Chief Executives and the College of Paramedics have warned that delays are causing patients harm and putting them at risk.\nIn response to today's alarming figures, the Liberal Democrats have set out an emergency five point plan to tackle the growing crisis of ambulance delays that is leaving seriously ill patients in Aylesbury waiting hours to be treated. In addition to calling in support from the armed forces, the plan includes reversing ambulance station closures, launching an official inquiry, passing a new law to increase transparency over waiting times, and launching a new campaign to recruit more paramedics and other ambulance staff in Aylesbury.\nCllr Susan Morgan, Liberal Democrat Shadow Cabinet Member for Health and Adult Social Care at Buckinghamshire, said:\n\"People in Aylesbury are watching loved ones in agony and distress, waiting hours for an ambulance or stuck in the back of one outside our local hospital. Some have even watched them die. This is heartbreaking and it can not go on.\n\"The Conservatives have run our NHS services in Aylesbury into the ground, breaking waiting time promises for years and years.\n\"Our plan would relieve some of the immediate pressure and help fix the ambulance crisis for good, so that the people of Aylesbury know that they can get to hospital in an ambulance and receive the care they deserve when they need to.\"\nI have also called for a review at Buckinghamshire Council into our GP practices. The shortage of GP appointments is adding further pressure onto our ambulance service as people have no other choice but to use them.\"\nDaisy Cooper MP, Liberal Democrat Spokesperson for Health and Social Care, said:\n\"Boris Johnson's Conservatives have neglected health services for years, and patients in Aylesbury are now suffering as a result.\n\"The Prime Minister must stop sticking his head in the sand, get a grip of this crisis, and do whatever it takes to stop communities facing record waiting times.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_stakeboard/content_4.html": "Show your support at home\nEach election, our team puts hundreds of posters around Aylesbury to show residents in our town and villages that the Lib Dems are winning here. Will you display a paper window poster, or let us put a garden poster up at your home?\nGet your poster\nPutting a poster in your garden or window is a great way to support the Lib Dems at election time. Sign up here to get your poster from the local Lib Dems at the next election.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_town-pledges/content_15.html": "Aylesbury Liberal Democrats Unveil Ambitious Town Council Manifesto\nAylesbury Liberal Democrats Unveil Ambitious Town Council Manifesto\nThe Aylesbury Liberal Democrats are proud to present our manifesto for the upcoming Town Council elections, setting out a bold vision to improve our town, support local businesses, and invest in our community.\nA Town Full of Life and Culture\nWe will continue to provide a full year-round programme of free and fully accessible events for residents, including Parklife Weekend with Proms, Pride in the Park, Aylesbury on Sea, and the St George’s Day Parade, fostering a vibrant town and boosting visitor numbers.\nBacking Local Businesses\nOur management of the Christmas Lights display and switch-on event has been a great success. We will continue hosting business roundtables and employ a Town Centre Manager to promote economic growth and footfall.\nInvesting in Our Youth\nWe are committed to providing safe spaces, activities, support, and both volunteering and paid employment opportunities for young people to help them develop essential skills and experiences.\nA Greener Aylesbury\nWe will maintain our dedication to environmental projects, including litter picking, tree planting, bug hotels, wildlife-friendly areas, cabinet box painting, and the much-loved Aylesbury in Bloom initiative.\nProtecting and Enhancing Community Assets\nWe will continue investing in the three community centres we rescued from Buckinghamshire Council, as well as the Railway Club, which now serves local groups and organisations. We will also work to take over and improve neglected town assets, particularly recreation grounds that have suffered from years of Tory mismanagement.\nHolding Buckinghamshire Council to Account\nWe will keep the pressure on Buckinghamshire Council to deliver long-promised infrastructure, including link roads, additional doctors, school places, a new cemetery, and more allotments.\nBoosting Grassroots Sport\nWe have already refurbished facilities at Bowler’s Field and improved drainage on pitches. We will continue working with Aylesbury United and Aylesbury Vale Dynamos to create a new Community Sports Hub.\nSupporting Community Groups\nOur grants programme will continue to provide essential funding to local community groups and charities, ensuring they can keep serving Aylesbury’s residents during difficult times.\nPreserving Aylesbury’s Heritage\nWe remain committed to saving the Old Court Buildings and repurposing them for greater community use, helping to revitalise the town centre.\nDelivering Value for Money\nWe are dedicated to improving the quality of life for residents while ensuring financial responsibility. We make every penny of the £2.57 per week (Band D) council tax contribution count, ensuring efficient and effective services for the community.\nThe Aylesbury Liberal Democrats are ready to build a better future for our town. Vote for a council that puts the community first.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_page-3/content_39.html": "Tim Bearder: New Direction for Thames Valley Police\nOn May 2nd, Aylesbury goes to the polls to elect a new Police and Crime Commissioner. Across the Thames Valley only the Lib Dems can beat the Tories in their Blue Wall heartland. Find out more about our candidate Tim Bearder, here",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_page-4/content_45.html": "Local Election 2023\nAfter local elections in May, local data shows massive gains in nearby councils.\nAfter local elections in May, local data shows massive gains in nearby councils.\nAylesbury Liberal Democrats wish all our friends, family, and community who are celebrating today, a very Happy Eid!\nLast Night, Buckinghamshire Liberal Democrats voted against Buckinghamshire Conservatives proposed budget for the Council after it was labelled as 'flaky', 'undemocratic' and 'ignoring local residents and communities.'\nThe Conservative Government is failing to deliver the promised 609 more police officers for Thames Valley Police.\nLiberal Democrat Parliamentary Spokesperson for Aylesbury Steven Lambert has called on Rob Butler to condemn Boris Johnson after the revelations of the past few days.\nBuckinghamshire is set to be hit hard by the expected rise in energy bills in April, new figures have revealed.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_page-7/content_41.html": "16% of families in Aylesbury face \"heartless\" government Universal Credit cut\nNearly 8000 hard-pressed families across Aylesbury face being left worse off when the government end the uplift to Universal Credit next month.\nNearly 8000 hard-pressed families across Aylesbury face being left worse off when the government end the uplift to Universal Credit next month.\nFREDA ROBERTS MBE\nAylesbury Liberal Democrats have called on Buckinghamshire Council and the Government to do more to support refugees in response to the situation in Afghanistan.\nCllr Steven Lambert, Liberal Democrat Leader on Buckinghamshire Council, has accused Rob Butler, Aylesbury's Conservative MP, for abandoning their election commitment on international development spending by voting to maintain the UK's cut on foreign aid spending, which will endanger the lives of people around the globe.\nAccording to analysis by the New Statesman, Aylesbury is one of the Conservatives 'Most Vulnerable' seats to the Liberal Democrats at the Next General Election based on the results of the 2021 Local Elections.\nAYLESBURY TOWN COUNCIL ELECTION RESULTS Lib Dems Make Stunning Gains BEDGROVE WARD (3 Councillors) Elected: 2 Conservatives (Hold), 1 Liberal Democrat (Gain).",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-lib-dems-back-robin-hood-tax-on-energy-giants-to-support-families-with-heating-bills/content_55.html": "Aylesbury Lib Dems back “Robin Hood tax” on energy giants to support families with heating bills\nAylesbury Liberal Democrats have today written to the Secretary of State for Energy Kwasi Kwarteng demanding that he backs the party's call for a \"Robin Hood\" tax on the super-profits of oil and gas firms, to raise money to support local families facing soaring energy costs.\nThe proposed one-off levy could raise over £5 billion to help support families in Aylesbury as their energy bills sky-rocket.\nIt recently emerged that Russian energy giant Gazprom's trading arm, based in London, has cashed in a £179 million dividend. Meanwhile, the boss of BP has described his company as a 'cash machine' after soaring oil and gas prices boosted its profits to £2.4 billion in the third quarter of 2021 alone.\nThe Liberal Democrats say the money raised through this \"one-off\" tax could fund a substantial package of emergency support to help thousands of people facing higher bills.\nThis would include doubling the Warm Homes Discount and extending it to all those receiving Universal Credit or Pension Credit, giving 16995 households in Aylesbury £300 each off their heating bills this year.\nThe party is also calling for winter fuel allowance to be doubled, benefitting 18,310 pensioners in the area and helping them keep their homes warm. On top of this, funding would be spent on helping people insulate their homes to slash heating bills in the long term.\nSteven Lambert, Liberal Democrat Parliamentary Spokesperson for Aylesbury, said:\n\"It can't be right that a few energy firms are making millions from record gas prices while millions of people can't even afford to heat their homes as the cost of living crisis hits Aylesbury hard.\n\"A one-off Robin Hood tax on gas and oil bosses would provide vital funding to support families in our area who are facing crippling energy price hikes.\n\"For years the Conservatives have ignored this problem and failed to take the bold action we need to reduce fuel poverty. The Government cannot look the other way any longer while families struggle to get by.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_get-involved_constitution/content_35.html": "The Aylesbury Liberal Democrats are governed in everything we do by the content of our constitution.\nIt defines our objectives, who can become members, and who can sit as officers and executive committee members.\nIt sets out the general and financial business controls that govern us and what the responsibilities are of the officers.\nThe election processes for executive members, officers and parliamentary candidates is set out in the constitution too.\nYou can read the full constitution below. (Ratified, Nov 16th, 2024.)\n2024 CONSTITUTION OF THE AYLESBURY LIBERAL DEMOCRATS\n-\n1.1. The name of the body governed by this Constitution shall be the Aylesbury Liberal Democrats”.\n1.2. The area of the Local Party shall be Aylesbury Liberal Democrats.\n-\nIn this Constitution:\n“the Local Party” means the Aylesbury Liberal Democrats;\n“the Party Constitution” means the Constitutions of the Federal Party, the Liberal Democrats in England and the South Central Regional Party;\n“the Party” means the Liberal Democrats;\n“the Regional Party” means the South Central Region Liberal Democrats;\n“the Constituency/(ies)” means the Parliamentary Constituency of Aylesbury;\n“Party’s Youth and Student Organisation” means the Affiliated Organisation representing youth and students;\n“Majority” at any meeting means majority of those present and voting;\n“Executive Committee” means the Executive Committee of the Local Party;\n“In writing” includes communication by email;\n“Signed” includes communication by email from an email address registered with the Party to that member and stating that it was sent by that member;\n“Large Single Seat” means that of a Police and Crime Commissioner or Combined Authority/Metropolitan Mayor\n“ALDC” means The Association of Liberal Democrat Councillors. -\n3.1. The objects of the Local Party shall be:\n(a) To be the successor within its area to the SDP Area Party\n(b) To promote and support the values and objects of the Party in its area and in particular through its members and registered supporters.\ni. to secure the election of Liberal Democrats as Members of Parliament, members of regional, local and other elected public authorities and appointments to other public or community offices;\nii. to admit and actively recruit new members and registered supporters to the party, encourage existing members to renew their membership and registered supporters to join the party or renew their registration;iii. to participate in the formulation of the policy of the Party;\niv. to be recognised and approved by the Regional Party as a Local Party; to play a full role in the democratic processes of the Party; and to send representatives, in accordance with the constitutions of the bodies concerned, to Party bodies\nv. to play a full part in the campaigning activities of the party at all levels;\nvi. to campaign and work with local people to achieve the objectives set out in the Preamble to the Party Constitution; and\nvii. to promote diversity within the party and to represent the interests of under-represented groups in the locality.\n-\n4.1. The Local Party shall administer membership and registered support in accordance with the membership rules of the Liberal Democrats in England.\n4.2. All persons shall be eligible to join the Local Party if they agree with the fundamental values and objectives of the party; and\n(a) They live, work or study within the area of the Local Party; or\n(b) If not eligible under Section 4.2 (a) they acquire membership with the consent of the Regional and Local Party Executive Committees; or\n(c) They are an MP or prospective candidate for a parliamentary, regional, subregional or local election; or a member of a local authority for a seat wholly or partly within the area of the Local Party.\n4.3. Eligible persons shall, subject to clauses 4.4 and 4.5 of this constitution, become members of the Local Party:\n(a) on enrolment through the Local Party; or\n(b) on enrolment through the party’s online enrolment system; or\n(c) on enrolment through the party’s Youth and Student Organisation or any other enrolling AO, giving an address within the Local Party area; or\n(d) if already a member of the party, on re-registration as a member of the Local Party.\nAn applicant shall become a member on acceptance by the enrolling body, payment of the requisite subscription and registration on the register kept by the Party in England.\nAn application shall be deemed accepted if not refused in accordance with the membership rules.\n4.4. The Executive Committee may refuse membership to any person, on the grounds provided by the Party Constitution, using the procedure defined in the membership rules of the Party in England.\n4.5. A membership application from a former member, previously expelled by the Party, must be approved by the Regional Party and the Party in England in addition to the Local Party.\n4.6. Membership of the local party shall be interpreted according to the provisions of the Constitution of the Liberal Democrats in England and its Membership Rules, as recorded in the register kept by the Party in England. Membership will automatically lapse when the renewal subscription is three months in arrears.\nA member whose subscription is in arrears shall receive notices of meetings and elections for three months from the date at which their subscription became due.\nA member who does not renew their subscription before the end of the three-month period must reapply for membership.\n4.7. A member of the Local Party who ceases to be eligible under Section 4.2 (a) may retain membership of the Local Party with the consent of the Executive Committee. -\nThe Secretary shall within seven days notify any change of Officers to the Regional Party and to the Chief Executive of the Federal Party.\n5.1. The Officers of the Local Party shall be the\n(a) Chair;\n(b) Vice-Chair – smaller parties may designate another elected Officer to substitute for the Chair when necessary, rather than elect a separate Vice-Chair;\n(c) Treasurer;\n(d) Secretary;\n(e) Elections Officer;\n(f) Membership Development Officer;\n(g) Diversity Officer\n(h) Data Officer\nThe Executive should appoint members to ensure compliance of the Local Party with data protection law, and such other responsibilities as the Party may require from time to time.\nAdditional Single Responsibilities (ASR) roles may be assigned to people recruited from, or co-opted to, the Executive to perform the following one-off roles (some roles may be officer roles which would be delegated to the ASR):\n(a) Connect Co-ordinator;\n(b) Youth and Student Co-ordinator;\n(c) Press officer(s);\n(d) Campaign Organiser(s)/Agent(s);\n(e) Fundraising Co-ordinator(s);\n(f) Chair(s) of sub-committees where appropriate;\n(g) Representatives to joint committees with other Local Parties\n5.2. There may be an Honorary President if duly nominated and elected in accordance with the rules for nomination and election of officers laid out in Section 6 of this constitution. The term of office for any such Honorary President shall be as laid out for officers in Section 6.1.\n5.3. The general and financial business of the Local Party shall be controlled and carried on by the Executive Committee, subject to the decisions of general meetings and in compliance with the Political Parties, Elections and Referendums Act 2000 and the Data Protection Act 2018. The Executive Committee shall consist of:\n(a) The Officers;\n(b) Six ordinary members to be elected annually in the same manner as the Officers;\n(c) The Party’s Members of Parliament for constituencies covered by the Local Party, and Prospective Parliamentary Candidates, when in post;\n(d) The Local Party’s approved parliamentary/Large Single Seat Agent or Organiser.\n(e) A representative of the PCC/PFPC candidate’s campaign team;\n(f) One representative of the party’s members from Buckinghamshire Unitary Council representing electoral divisions within the constituency, elected by and from such members, and one representative of the party’s members from the Parish Councils representing wards within the constituency, elected by and from such members;\nThe number of representatives from (e) to (f) should not exceed the combined number of officers and ordinary members as at (a) and (b).\n5.4 The Executive Committee may co-opt up to 4 additional members, for a term expiring not later than December 31st of the year in which they are co-opted. The power of co-option shall be used, inter alia, to ensure if possible that no more than two-thirds of the Executive Committee (other than under Sections 5.3 (d) - (i)), identify as the same gender, and that there is fair representation of under-represented groups in the locality, with the intention of creating an executive that reflects the community the Local Party serves.\n5.5 The Honorary President is entitled to attend all meetings of the Executive Committee. Meetings of the Executive Committee shall be open to members of the Local Party as space permits.\n5.6 The Executive Committee may fill any vacancy occurring among the officers or the ordinary members. Any vacancy in the Chair shall be filled from amongst the existing Executive Committee members.\n5.7 The Executive Committee may assign special responsibilities to any of its members, including duties which would otherwise pertain to one of the officers. The executive shall designate an officer to deputise for the Chair if the Chair is and Vice Chair are both unavailable.\n5.8 The Officers shall convene a meeting of the Executive Committee within one month after taking office. The Executive Committee shall meet at least quarterly.\nThe Secretary shall give at least 7 days’ notice of meetings to all members of the Executive Committee. One-third of its members shall form a quorum. A meeting may continue without a quorum if no member present objects. Any decisions taken at such a meeting or by email between meetings must be ratified at the next quorate meeting of the executive.5.9 The Executive Committee may appoint sub-committees for any specified purpose. No subcommittee or Executive Committee member may take action on behalf of the Executive Committee beyond their terms of appointment. All sub-committees shall report on their activities to the Executive Committee and may include persons who are not members of the Executive Committee and may delegate authority to take actions on their behalf. The Executive Committee may also delegate authority to committees jointly constituted with other Local Parties for particular purposes.\n5.10 In urgent circumstances the Chair or, if unavailable, the Vice-Chair), in conjunction with a minimum of two other officers, may act on behalf of the Executive Committee. The Chair (or Vice Chair) shall report such actions to the next meeting of the Executive Committee.\n5.11 The Executive Committee will set out a long-term development plan as to how it will achieve its objectives as set out in clause 3.1 (b) and in the following areas:\ni. increasing its membership and the diversity of that membership\nii. a training plan to improve the skills and activity levels of those members\niii. improving its fundraising\niv. objectives for each set of local elections or shared local elections with neighbouring Local Parties that cover its area for Counties, Mayoral, Regional Assemblies and Police (Fire) and Crime Commissioners, with the intention of standing a candidate in every available seat\nv. using local by-elections to train local activists and develop campaigning skills\nvi. improving its performance at each Parliamentary election\nThat plan should as a minimum be reviewed and updated in conjunction with the Regional Party after each full cycle of local elections and each Parliamentary election. The Executive should report on the progress of the plan at each AGM.\n-\n6.1 The officers and ordinary members shall be elected by and from members of the Local Party at the time of the Annual General Meeting (AGM), provided that, with the prior agreement of the Regional Party, a member of the party who is not a member of the Local Party may be elected to the office of Treasurer. If an election is contested, there shall be a full electronic ballot following the meeting, in which all Local Party members are sent a ballot within 7 days after the AGM and which must be returned to the Returning Officer within 21 days after the AGM. The RO may issue postal ballots to those members that prefer it as per the membership database.\nThe term of office of officers and ordinary members shall be from the 1st January following their election until the following 31st December. They shall be eligible for re-election, save that the Chair shall not serve for more than three consecutive one-year terms and shall not be eligible for re-election as Chair for two terms after leaving office.\n6.2 Nominations for election shall be invited in the notice summoning the AGM, and shall close at the AGM, but not before the reception of the Chair’s and Treasurer’s reports. They must be proposed and seconded, and except in the case of nominations made at the AGM, shall be in writing signed by the proposer, seconder and candidate.\n6.3 No person may be elected to hold more than one office or may be elected to be both an officer and an ordinary member. Elections for officers shall be counted in the order listed in Section 5.1 and for ordinary members after officers. Any votes cast for candidates already elected to office shall be transferred according to the voters’ subsequent preferences.\n6.4 All contested elections under this constitution shall be by secret ballot by the Single Transferable Vote method in accordance with election rules made under the party constitutions.\n6.5 The Executive Committee shall appoint some disinterested person to act as Returning Officer. The Returning Officer shall be entirely responsible for running the elections, including the receipt of nominations and for the preparation and distribution of ballots, their receipt and counting on return, and the declaration of the results.\nAccidental failure to dispatch notice of the AGM or a ballot in due time or at all to a person entitled to vote shall not invalidate an election or be treated as an irregularity, unless a substantial number of persons entitled to vote have not received notices or ballots at all or have received them too late to make it practicable to attend the meeting or return the ballot in due time.\n6.6 An unsuccessful candidate who alleges that there has been or may have been an irregularity in the election may within one calendar month after the declaration of the result ask for an investigation by the Regional Party in accordance with the party constitutions. Subject to any order made after such an investigation, no irregularity shall invalidate an election.\n6.7 The Returning Officer may extend the time for distribution and return of ballots where there are special circumstances making it necessary to do so. -\n7.1 The AGM shall be on a day appointed by the Executive Committee, between 1st October and 30th November. The Executive Committee may postpone the AGM if it would conflict with a Parliamentary election in the constituency/local authority area, or for other urgent reason.\n7.2 The business of the AGM shall include:\n(a) to receive a report from the Chair on the activities of the Local Party and the Executive Committee since the previous AGM, including progress with the development plan;\n(b) to note the accounts of the Local Party for the previous financial year together with an independent report on those accounts, and to receive a report from the Treasurer including a statement of the current financial position and an outline budget for the following year;\n(c) to appoint for the current financial year (i) auditors if required by the Political Parties, Elections and Referendums Act 2000 or (ii) a person(s) to produce an independent report on the accounts for a General Meeting;\n(d) to receive reports from each Liberal Democrat council group on which Local Party members serve;\n(e) to transact any other business specified by the constitutions or directed by the Executive Committee;\n(f) to consider any motion which has been submitted by any member of the Local Party to the Secretary, in time for circulation with the notice of the AGM;\n(g) to receive nominations for the election of officers, ordinary members of the Executive Committee and any elected sub-committees or joint committees;\n7.3. The Secretary shall give all members at least 21 days written notice of the time and place of the AGM (or access links and codes for an online AGM or online access to an AGM). Such notice shall specify all business to be conducted at the meeting.\n7.4. The AGM may (on notification to the Secretary prior to the start of the meeting) by a two-thirds majority agree to consider urgent or important business which has arisen since notice of the AGM was given.\n7.5. An Extraordinary General Meeting may be convened by the officers, or by the Executive Committee; and shall, on receipt of a requisition signed by at least twenty members of the Local Party (or one-fifth of the membership if less), be convened by the Secretary so as to be held within 28 days from the receipt of such requisition. At least 14 days written notice shall be given to all members. The meeting shall only consider business stated in the notice convening it. Failure to convene a validly requisitioned meeting within 14 days shall permit the meeting to be convened on behalf of (and at the expense of) the Local Party by any of the original requisitioners. In an emergency, the officers may convene a meeting giving such notice as they consider sufficient in the circumstances.\n7.6. Twenty members (or one-fifth of the membership if fewer), shall form a quorum at any general meeting. A quorum is not required to receive reports and accounts. A meeting may continue without a quorum if no member present objects except as provided for in Sections 5.8 and 11.1\n7.7. Notice and minutes of all Annual and Special General Meetings shall be sent to the Secretary of the Regional Party.\n7.8. Minutes shall be maintained of all proceedings of all general meetings. A hard copy must be made of any electronic Minutes files and retained in a Minutes book/file. The Minutes book must be retained and handed on to successor Officers by the start of each term of office. Minutes shall also be kept of any meetings of the Executive Committee. In the absence of an Executive Committee member charged with the duty, the Meeting shall appoint a member to take minutes. Hard copies shall be made and retained as for general meetings.\n7.9. Details of any proposed amendment to this constitution shall be sent to all members with the notice of the General Meeting. -\n8.1 The Executive Committee may authorise the setting up of branches except that no branch shall be formed with fewer than 10 members. The objects of a branch shall be to further the objects of the Local Party in the area covered by the branch. The branch shall be subject to the ultimate authority of the Local Party.\n8.2 The membership of the Branch and the rules for operation of the Branch shall be as detailed in Appendix LP2 of this constitution.\n8.3 The Executive Committee may authorise the dissolution of branches, subject to the provisions of 8.4 of this constitution.\n8.4 A Branch may be dissolved or suspended by the Executive Committee on the grounds that:\n(a) it is no longer functioning or able to hold such a meeting;\n(b) there have been serious irregularities in the conduct of the affairs of the Branch;\n(c) the affairs of the Branch have not been conducted in compliance with the Political Parties, Elections and Referendums Act 2000, the Data Protection Act 2018, its Constitution, this Constitution or the Party Constitution;\n(d) the membership of the Branch has fallen below 10; or\n(e) The affairs of the Branch are being conducted in a manner contrary to the interests of the Local Party as a whole.\n8.5 If a Branch is dissolved or suspended, any member of the branch may request that the Regional Party conduct an investigation if they believe that the process has not been conducted in accordance with the correct constitutional process or without valid evidence. The Local Party shall not dissolve a branch until the branch has been given an opportunity to hold its own general meeting.\n8.6 The funds of a Branch shall, upon dissolution, be applied in paying its debts, and any surplus shall be added to the funds of the Local Party. -\n9.1 When it is necessary to select a Prospective Parliamentary or Large Single Seat candidate, the procedure shall be as provided by the Party constitutions. The Executive Committee may appoint a subcommittee to carry out its duties under this procedure.\nFor each Parliamentary constituency which has at least 30 members the vote on selection for a Prospective Parliamentary Candidate for that constituency shall be by the members registered in that constituency.\nFor any Parliamentary constituency which has fewer than 30 members,\n(a) Either: the constituency lies in more than one local party, in which case the vote on selection for a Prospective Parliamentary Candidate for that constituency shall be by all the members of each Local Party which covers part of the constituency.\n(b) Or: the local party/parties is/are a branch of the Region or qualify to be so because of an overall Local Party membership of fewer than 30 people, in which case the vote on selection for a Prospective Parliamentary Candidate shall be by all the members living in that constituency and all members of the executive committee of the Regional Party.\n9.2. The Local Party Executive Committee shall seek to ensure that, so far as practicable, all seats within the constituencies and seats in local authority wards and divisions wholly or partly within the local party area are contested by Liberal Democrat candidates, unless the Executive Committee, Regional Party and, in the case of Large Single Seats or Westminster elections, the Liberal Democrats in England, are satisfied that it is in the best interests of the party in any specific case not to do so. If the Local Party wishes not to stand a candidate, the Executive must have the agreement of the Regional and English Parties in the case of Westminster and Large Single Seat elections or the Regional Party in the case of local authority elections.\n9.3. When it is necessary to select one or more local government candidates for an electoral area, the branch or if there is no branch, the Local Party shall hold an online ballot in which all members who are resident in the electoral area concerned may vote. The timetable shall be agreed by the branch committee and the Executive Committee, or where there is no branch by the Executive Committee.\n9.4. The Elections Officer will maintain a list of members approved to stand as candidates in local elections, according to the rules of the Party in England and guidance provided on the Federal Party web site, and following the procedures approved by ALDC. The executive may select any other member, conditional upon subsequent approval by the executive or delegated approvals panel.\n9.5. As a condition of approval, prospective candidates shall be required to agree to make a financial contribution towards Liberal Democrat Party activities in the event of their election to the relevant authority. The level of contribution shall be set at a minimum of 10% of the individual's gross allowances from the relevant local authority. There shall be a mechanism by which cases of hardship/financial distress are identified, and only through this mechanism may a contribution be lowered or exempted. Town and parish council candidates are exempt from this condition.\n9.6. In any local electoral area, in which the eligible electorate for voting in the selection does not exceed 10, the electorate shall be expanded to constitute the members living in the electoral area plus the members of the Executive Committee\n9.7. In any case in which time does not permit the holding of an online ballot the branch committee, or if there is no branch the Executive Committee may appoint the candidate.\n9.8. Where an elected authority covers more than one Local Party area or crosses Local Party boundaries, the Executive Committees of the Local Parties concerned must agree to form appropriate joint arrangements to coordinate candidate approval and selection, campaigning, fund-raising and publicity and be responsible for the formulation of policy on that authority. Such arrangements must be minuted by each of the Local Parties involved and shall remain in force, notwithstanding any subsequent change of officers or Executive Committee.\n9.9. The Local Party will submit to the Federal Party’s Nominating Officer the name of a suitable person to act as the Delegated Nominating Officer (DNO). The DNO shall act in accordance with the Rules made by the Party for DNOs.\n9.10. If a member of the Local Party stands at any public election as a candidate or agent, in opposition to a properly nominated candidate of the party, an officer of the Local Party shall immediately inform the Standards Officer at Liberal Democrat HQ as their membership may be revoked under the English and Federal Constitutions.\n9.11. Any candidate for election to public office standing as a representative of the party must be a current member of the party from the point of nomination throughout the campaign.\n9.12. If at any time the Local Party considers entering into an electoral pact, the Executive Committee must obtain the prior agreement of the Regional Party before any negotiations take place; the final outcome must meet objectives agreed under protocols established by the Party in England and be approved by the Regional Party.\n9.13. A Local Party wishing to de-select a candidate for a Westminster or Large Single Seat must contact the Chair of the regional candidates committee and proceed according to their protocols.\n9.14. A Local Party wishing to de-select a candidate for a local election must contact ALDC and follow their advice.\n-\n10.1 The Local Party’s accounting period shall be annual, starting on 1st January and ending on 31st December each year.\n10.2 The Treasurer shall keep, maintain for six years and pass to their successor accounting records which shall be available for inspection in accordance with the Political Parties, Elections and Referendums Act 2000 (PPERA).\n10.3 The Treasurer shall ensure that no donation greater than that permitted by PPERA is accepted except from a permissible donor and shall keep records and submit donations reports to the Executive Committee and to the Chief Executive of the Federal Party.\n10.4 The Treasurer shall annually produce accounts for Local Party finances which shall be approved by the Executive Committee and if required by the Political Parties, Elections & Referendums Act 2000 shall be audited.\n10.5 The Treasurer shall submit the accounts of the Local Party together with an independent report to a meeting of the Local Party executive for approval. When signed, the Treasurer and the Local Party Chair shall submit them to the Federal Party for reporting under PPERA rules in the manner designated by the Federal Party no later than 31st March following the end of the financial year. A copy of the accounts shall also be sent to the Regional Party.\n10.6 (a) The Local Party shall maintain one or more bank or other appropriate\naccounts in the name of the Local Party for which the mandate for withdrawal shall require the signature of at least two officers who shall not come solely from members of any one family. The Local Party may maintain further accounts for the deposit of money not required for the time being, requiring the same signatures\n(b) The Local Party may take advantage of electronic banking facilities if they are provided by its bankers as long as appropriate safeguards are put in place by the Executive Committee to agree expenditure and cash movements both at Executive meetings and by a minimum of two officers in between meetings in advance of such expenditure or movements taking place. Where such action is taken between meetings it will be reported back to the next Executive meeting.\n10.7 If the Local Party fails by 15th January to notify the Chief Executive of the Federal Party of the appointment of a Chair and a Treasurer, the Local Party shall automatically be suspended.\n10.8 Such property as the Local Party may own or lease (whether physical or held in long-term investments) shall be acquired, held and disposed of through a Trust.\nFor a new trust, the Local Party Executive Committee shall appoint no less than three and no more than five Trustees to manage the asset on behalf of the Local Party who shall hold office for a period of five years but be eligible for re-appointment by the Executive and if at any time the number of trustees shall fall below three, immediate steps shall be taken by the Executive to appoint a new trustee. A document (which may be the trust deed) shall be drawn up setting out the responsibilities and indemnification of the Trustees in carrying out their duties on behalf of the Local Party. This document should be signed by the Chair and Treasurer of the Local Party and the appointed trustees.\nFor an existing trust, the Executive Committee shall follow the above procedure as closely as possible, consistent with the trust deeds.\n-\n11.1 Amendments may only be made by a two-thirds majority at a quorate general meeting. No amendment shall be made which conflicts with the constitutions of the Party or of the Regional Party. Any amendment to this constitution shall not come into force until approved by the Regional Party.\n11.2 Details of any proposed amendment to this constitution shall be sent to all members with the notice of the general meeting.\n11.3 If the Model Constitution for Local Parties (England) is amended, any provision of this constitution shall be deemed to be correspondingly amended, unless the Local Party resolves in accordance with 11.1 above at a quorate general meeting held within 6 months of receiving notice of the amendment not to accept it.\n11.4 One copy of the constitution shall be deposited with the Secretary / Administrator of the Regional Party; and one shall be kept with the minute book of the Local Party. Any member shall be provided with a copy of the constitution on request.\n11.5 In the event of any question of interpretation arising, or any question on which this constitution is silent, the Executive Committee shall have power to act according to its interpretation of the constitution, subject to decisions of the English Council, Articles 3 and 9 of the constitution of the Liberal Democrats in England and Article 4 of the Constitution of the Federal Party.\n11.6 No word or construction in this constitution shall be taken to imply any discrimination whatsoever with regard to any ground other than political belief or practice.\n11.7 In the event of the dissolution or suspension of the Local Party, the assets of the Local Party shall vest in the Regional Party on trust for the future reconstitution of the Local Party, unless explicitly provided otherwise by a general meeting in the event of dissolution pursuant upon boundary changes and subject to the agreement of the Regional Party.\n11.8 A Local Party, by agreement at a general meeting, may dissolve itself in order to facilitate the creation of one or more new Local Parties, subject to the approval of its Regional Party and prior notification to the Compliance function at party headquarters; HQ must be notified no later than 30th November in the year preceding the proposed change, in order that appropriate adjustments made be made to data and other systems held by the party.\nROLES OF LOCAL PARTY OFFICERS\ni. The role of the Chair is to:\na. Chair Local Party, general and executive meetings\nb. Act as the point of communication with HQ and the region\nc. Ensure compliance (along with the Treasurer) with PPERA\nd. If another member is not so appointed, ensure compliance with data protection law\ne. Ensure compliance to party constitution\nf. Manage the local development plan and ensure it is fulfilled\ng. Oversee Parliamentary candidate selection with the support of the Elections Officer\nh. Ensure that the Local Party maintains the standards and practice expected\nii. The role of the Vice-Chair is to:\na. Deputise for the Chair if they are ever unavailable or at the request of the Chair,\nb. Chair Local Party, general and Executive Committee meetings if and when the Chair is absent or otherwise unable to chair such meetings, or at the request of the Chair\nc. Proactively assist the Chair in the fulfilment of their responsibilities to and on behalf of the Local Party,\nd. Proactively work with the other officers to assist them in their duties as necessary,\ne. Be responsible for the fulfilment of responsibilities associated with any vacant officer position until it is filled, reporting to the Executive Committee on such responsibilities whilst it remains vacant.\niii. The role of the Secretary is to:\na. Produce agendas and minutes for meetings\nb. Manage the diary of events to avoid clashes\nc. Inform the Chief Executive of the Federal Party and the secretary of the Regional Party of executive officer appointments and other matters required by this constitution apart from finance\nd. Consult the Local Party constitution\ne. Other administrative tasks\niv. The role of the Treasurer is to:\na. Prepare and monitor the yearly budget\nb. Submit PPERA reports\nc. Oversee fundraising targets\nd. Liaise with election agents\ne. Keep accounts ready for audit\nv. The role of the Membership Development Officer is to:\na. Organise and run recruitment campaigns\nb. Follow up ‘At Risk’ members\nc. Ensure there is a range of events, social and political (in co-operation with the Secretary)\nd. Encourage members to move on to Direct Debit payments\ne. Secure accurate records of local party membership in the Federal Party’s central membership system\nf. Check regularly for new members, welcome them and organize new member interviews\ng. Inform the Executive Committee of new members, in accordance with Section 4.4 of this Constitution\nh. Produce a regular members’ newsletter (work with others)\nvi. The role of the Elections Officer is to:\na. Ensure the Local Party has top-line electoral objectives agreed for at least five years ahead to guide campaigning activity\nb. Ensure the Local Party has an agreed annual campaign plan, and supporting budget in consultation with the Treasurer\nc. Form and oversee the smooth running of a constituency campaign team charged with delivering the agreed campaign plan within the agreed budget\nd. Ensure the Local Party obtains the marked registers after every election and that the data is entered into the party’s system for recording electoral data\ne. Provide support to the Chair in the selection of Parliamentary candidates\nvii. The role of the Diversity Champion is to:\na. Develop an understanding of the diverse communities in the area of the Local Party\nb. Identify under-representation of those communities within the Local Party and the executive/officer roles\nc. Work with the Local Party executive to devise and promote a strategy to engage members of under-represented groups, to encourage them to join the party and to support them to become active in the management and decision-making processes of the Local and wider Party\nd. Develop links with community group",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_conservative-failures-continue-to-pile-up/content_2.html": "Conservative Failures continue to pile up\nMartin Tett and his cabinet are selling public assets to balance the budget. They are selling off Council owned buildings to make quick money, with no long term investment strategy or insight into the future needs of the Council.\nBucks Sports and Social Club was closed to the public who used this space daily for recreational exercise, sports and general use. The council years later then fenced it off at a considerable cost to the public, submitted a planning application on the land which they approved and have now sold the land to developers to cash in despite opposition from the Lib Dems, local residents and the Parish Councils. It even conflicted with the Stoke Mandeville Local Plan!\nGala Bingo Hall is being demolished for a walkway between the High Street and The Exchange. Residents were told that the use of this land was for a Music Space with mini popup retail units but now they have choose to approve a 10 year plan for a path and a few extra car parking spaces using YOUR money, and not asking YOUR opinion. There was no costing done to revitalise the building - we say it would have made a great music venue, bringing residents and communities back together.\nThe County Hall Building has already been sold to Developers. This building has now been converted to flats and not a single social/affordable home is allocated, because the Council claim there is not enough profit to be made!\nThe Walton Street Tower is also a target to be sold off to make way for more flats",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_page-1/content_61.html": "Aylesbury Liberal Democrats Unveil Ambitious Town Council Manifesto\nThe Aylesbury Liberal Democrats are thrilled to unveil their manifesto for the upcoming Town Council elections, presenting an exciting vision for the future of our town.\nThe Aylesbury Liberal Democrats are thrilled to unveil their manifesto for the upcoming Town Council elections, presenting an exciting vision for the future of our town.\nToday, Friday 28th March, Aylesbury Liberal Democrats handed in nomination papers for a full slate of candidates to contest all the wards in Aylesbury up for election on Buckinghamshire Council elections on Thursday 1st May.\nToday marks the start of 9 days of Hindu festivals. The Liberal Democrats embrace every community and wish you all a wonderful Chaitra Navratri, Ugadi, Gudi Padwa, and Ram Navmi!\nThe Conservative run administration are selling off all of our assets to balance books! Where is the long term ambition and drive to improve Aylesbury?\nThe Bucks Council SEND department is in crisis, not supporting vulnerable children, with the processing times for Educational and Health Care Plans (EHCPs) drastically exceeding targets leading to detrimental impacts on families.\nConservative-run Council leaves our roads & paths in ruin",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_aylesbury-lib-dems-call-on-rob-butler-to-condemn-the-pm-and-apologise-to-the-people-of-aylesbury-1/content_29.html": "Aylesbury Lib Dems call on Rob Butler to Condemn the PM and apologise to the People of Aylesbury\nLiberal Democrat Parliamentary Spokesperson for Aylesbury Steven Lambert has called on Rob Butler to condemn Boris Johnson after the revelations of the past few days.\nSteven said, \"After seeing the email which shows 100 people being invited to a party at Downing Street during lockdown, I call on Aylesbury's MP asking him to condemn Boris Johnson's behaviour and apologise on behalf of their party to the people of this town.\nI wrote to Mr Butler last year after Dominic Cummings 'trip' to Durham expressing my and that of our resident's anger and frustration at what appears to be 'one rule for them and one rule for us'. Now it is clear that it wasn't just Cummings breaking the spirit of the law but also the PM and staff\nBoris Johnson's Conservative party is taking this country for fools. People in this area will see right through his poor excuses and evasive answers. Rob Butler cannot continue to remain silent and ignore media scrutiny as he has done so far. He needs to take accountability for this Government's actions.\nPeople in Aylesbury spent their Christmas away from loved ones and many lost friends and family to this disease. At a time of great sacrifice when the pandemic was at its worst, it is disgraceful to think that people in Downing Street were laughing about holding a Christmas party.\nEnough is enough. This Government must be held accountable to an inquiry into all their rule breaking; from Barnard Castle to the Refurbishment of the Number 10 flat to this latest rule breaking. It cannot be one rule for them and another for the rest of us.\"",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_page-2/content_19.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_ramadan-mubarak-4/content_72.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_page-5/content_11.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_local-engagement-and-information-evening/content_67.html": "Local Engagement and Information Evening\nA big thank you to everyone who came to our Local Engagement and Information Evening yesterday evening.\nAylesbury Town Council Leader Richard Lloyd and Aylesbury Mayor Anders Christensen hosted the event and shared plans for Aylesbury Garden Town, the refurbishment of the Town Centre, Gardenway and the plans for a sports stadium for Aylesbury. This was followed by a Q&A session.\nBased on the success of the event we will be planning on hosting a similar session in the future. We will keep you posted!",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_article_steve-for-aylesbury/content_71.html": "The Liberal Democrats select Town Mayor, Steve Lambert for the General Election\nThe Liberal Democrats select Town Mayor, Steve Lambert for the General Election\nAylesbury Liberal Democrats are delighted to announce the current Aylesbury Town Mayor, Steve Lambert as their candidate for the upcoming General Election.\nHaving lived in Aylesbury for over 23 years, Steve has 20 years of experience as a local councillor and is the current Mayor of Aylesbury. As a result, Steve has first-hand experience of why Aylesbury needs investment, change, and an MP who truly represents our area.\nA passionate advocate for our community, Steve has served as a Trustee of Youth Concern and a board member of Fairfax Housing Trust, as well as a lead member of Buckinghamshire Fire and Rescue.\nSpeaking after his selection Steve said, “For too many years Aylesbury and our surrounding villages have been poorly served by Tory MPs.\nYou only have to look at the current Tory MP voting record and the unwavering support of Boris Johnson until seconds before Boris resigned. He then backed Liz Truss – gaining a gong as a result. None of which has served our residents at all well.\nIt is time for a change and with new boundaries and Lib Dem councillors at every level, we are truly working hard on behalf of all our residents. With Labour declaring themselves out of the race, a Lib Dem MP for our area is in our grasp - just like in neighbouring Chesham and Amersham.\nAs our MP I will strive hard to make sure no one is left without a voice, support or help to be authentically themselves and to thrive.”\nThe Lib Dem success in the Parliamentary By-Election in Chesham & Amersham in 2021 shows that the Liberal Democrats are the clear challengers to the Tory status quo.\nSteve added “I am honoured to have the opportunity to represent the Liberal Democrats in the upcoming General Election for the new Aylesbury constituency.\nResidents are tired of Conservative MPs and Tory Councillors taking them for granted for too long. Instead of standing up for their residents, the Tories have prioritised their party above the town.\nI have always been passionate about Aylesbury as my many years of community work, be it working with local charities or residents’ groups demonstrates”.\nWith Labour declaring Aylesbury as a Non-Battleground seat for them, Steve Lambert will be the candidate to support to beat Conservatives and help end this appalling Conservative Government.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_campaigns/content_28.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_page-1/content_6.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_news_page-2/content_62.html": "Liberal Democrats Launch Buckinghamshire Council Election Manifesto\nLib Dems Promise to Deliver a “Fair Deal” for Buckinghamshire ahead of local elections\nLib Dems Promise to Deliver a “Fair Deal” for Buckinghamshire ahead of local elections\nAnger and disappointment at the lack of ambition and action by Bucks Council on regeneration of Aylesbury Town Centre. At a meeting of Aylesbury Town Council, councillors slammed the plans as 'lacking ambition 'and 'shameful'.\nWe are hearing the same issue raised on the doorsteps. Patients from Whitehill and Popular Grove and Walton Court surgeries are all saying the same thing; “I can’t get an appointment with my GP”. The Liberal Democrats have a plan for 8000 more GPs!\nThe Conservative government have “neglected” rural communities as figures reveal a reduction in staff over the last year to just 14 for the whole of the 3 counties in the Thames Valley police area are dedicated to rural crime.\nThe Liberal Democrats have launched their General Election manifesto and outlined a plan to save health and care services. The manifesto offers a bold and fully costed £9bn plan to tackle the health and care crisis.\nSteve calls for a Fair Deal for Health in Aylesbury",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk_page-6/content_30.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView",
  "https_www_aylesburylibdems_org_uk_/https_www_aylesburylibdems_org_uk/content_1.html": "Housing & Infrastructure\nWe will work with town and parish councils to develop a community-led approach to building the homes we need, while protecting the environment from inappropriate and unchecked developer-led schemes.\nA Lib Dem Council will work to ensure new developments are well-planned, connected, and integrated with essential infrastructure, including health and social care, education, roads, transport, water, sewage, and energy.\nWe will push for more environmentally sustainable construction and ensure developments integrate with and protect the natural environment\nView"
}