{
  "http_www_helenwhately_co_uk_/http_www_helenwhately_co_uk/content_1.html": "I'm Helen Whately, Member of Parliament for Faversham and Mid Kent. Here you’ll find more information about my work and campaigns, how you can get involved, and what I can do to help you.\nMy 5 local priorities for Faversham and Mid Kent\nMore GP and dentist appointments\nSeeing a GP should be easy, but for lots of people locally it hasn’t felt that way since the pandemic.\nIt’s also tough to see an NHS dentist at the moment, with very few practices accepting new patients in the area.\nThat’s why I’m teaming up with our local GPs, dentists and pharmacies to help increase the number of appointments locally, backed up by exciting government reforms.\nA huge part of feeling safe is about help being there when you need it.\nBut in recent years many of our rural communities have felt let down by police response times. With 20,000 more officers on our streets since 2019, it’s time to put that right.\nI’m working with local councillors, police, and our Police and Crime Commissioner Matthew Scott to bring these response times down across the constituency.\nWe've got record investment going into schools nationally, and I want to make sure there's never been a better time to be a student locally.\nWhether that’s helping local schools win funding, standing up for better standards, or opening up opportunities to local students like my Maidstone Apprenticeship Fair.\nWith the help of our brilliant local schools and employers, I’m going to make sure students get more from their education.\nHere in the Garden of England we’re blessed with some of the most beautiful countryside in the world.\nBut like the rest of the UK, we’ve seen a worrying decline in biodiversity and nature in recent years. Reversing it, and creating a greener, cleaner place to live is one of the most important things we’ll ever do.\nTeaming up with our local councils, community groups and charities, I want to kickstart projects across the constituency – and find ways for anyone who wants to get involved.\nAlmost everywhere you look, Faversham and Mid Kent is teeming with brilliant businesses who keep our local economy moving.\nBut taking the next step can often be a challenge. Whether it’s barriers to trade, changes to local and national policy, or finding the right skills - getting these businesses growing will mean more local jobs and a stronger economy.\nI’m going to work with local businesses to help bridge these gaps, with support from our local councils and government ministers."
}