{
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_january-2025-newsletter/content_9.html": "January 2025 Newsletter\n- henrytufnell1\n- Jan 31\n- 4 min read\nUpdated: Feb 3\nAs we welcome the new year, I hope everyone in Mid and South Pembrokeshire has had a joyful and prosperous start to 2025. The break over Christmas and New Year provided me with the time and space to reflect and renew my focus on delivering well-paid jobs in our community, boosting local economic growth and drastically improving our public services.\nFailing Healthboard\nI have been engaging extensively with local GP practices, local dentists, social care providers as well as constituents who have been sharing their experiences of healthcare in Pembrokeshire. I have provided all this data to Hywel Dda, including a comprehensive survey, which revealed that 62% of respondents wait more than a week to secure a GP appointment, and 87% believe that healthcare services have worsened in recent years. However, the shocking reality is that management team at Hywel Dda do not recognise the extent of the problem and the level of dissatisfaction in our community - they remain in denial.\nI will continue to call out the failures of the Hywel Dda management team and I have submitted a Freedom of Information request to them, seeking clarity on current waiting times, service availability, and planned measures to address these failings. I will also be meeting with their Chief Executive, Phil Kloer, in early February. We desperately need to see improvements in our healthcare access and delivery.\nWell-paid Jobs\nProviding opportunities and good well-paid jobs for our young people in Pembrokeshire is one of my top priorities. It was therefore fantastic to see Pembrokeshire identified by the UK Government as a Key Growth Region for clean energy, providing investment for local people into industries such as welding, electrical engineering, and construction. It was therefore a pleasure to meet Eugene Grice, a local apprentice from Neyland, as part of UK Nuclear Week to discuss his experiences and the importance of apprenticeships in providing valuable skills and opportunities for our youth.\nECO4 & Insulation Schemes\nSince being elected in July I have been hearing from many constituents who have been affected by the Energy Company Obligation 4 and Great British Insulation Schemes. I have received reports of incorrect installations, faulty and shoddy building work, lack of valid warranties, grant misuse and regulators simply siding with contractors. It was therefore incredible positive to see the Government tackle this issue head on, stating that the schemes need urgent reform and cannot command confidence. I will continue to work with the Government as they look at the entire landscape and overhaul this system to ensure stricter enforcement against non-compliant installers and enhanced support for homeowners.\nCommunity Engagements\nIt was a pleasure to visit the team at Paul Satori to hear about the truly exceptional work that they do in our community in providing end-of-life care and to meet with the team at Pembroke Pharmacy to discuss their challenges in delivering healthcare in the community. I was also thrilled to attend another visit at Pembrokeshire College, to talk with the students and hear their perspectives on vocational training and education as well as future opportunities within the energy sector. I ended this month by meeting with our local farmers at the National Farmers' Union (NFU) to work with them to address the challenges they face as an industry and the support they require.\nSt David's Peninsula\nI attended the St David’s Peninsula Tourism & Trade Association to discuss the challenges and opportunities within the Tourism sector. Tourism is a critical part of the economy in St David’s and across the county and I will continue to work with the sector provide the support it needs. I also met with residents in St David's to discuss the opportunities at Oriel Y Parc. The discussions were insightful, and I am committed to ensuring that any developments align with the community's interests and preserve the cultural heritage of the area.\nIn Parliament\nI continue to represent our county on a national level on both the Environmental, Food and Rural Affairs and the Welsh Affairs Select Committee. On both committees I am working on issues that matter to us in Pembrokeshire, whether that is cross-border healthcare, reforming the water sector or the future of farming.\nEnvironment, Food and Rural Affairs Select Committee\nThe committee has launched an inquiry into the The Future of Farming and took evidence from the Department for Environment, Food and Rural Affairs' (Defra) Farming following the National Audit Office’s report on the Farming and Countryside Programme. The change in the subsidy payment following Brexit is the one of the biggest changes to agricultural policy in half a century. The committee is concerned about DEFRA’s iterative approach to the program which makes it difficult for farmers to plan their business to remain viable and to continue to produce the food we need and to achieve the programme’s environmental objectives.\nWe have also launched an inquiry into Reforming the Water Sector and have commenced a series of evidence sessions from water bosses across the country. We began the sessions with Southern Water, but Welsh Water will give evidence to the committee in February. Given the levels of pollution in the Cleddau river, it is so important that we hold Welsh Water to account and work with them to ensure that we upgrade our ageing infrastructure and stop these sewage spills that are degrading our natural environment.\nWelsh Affairs Committee Sessions\nOn the Welsh Affairs Committee, we heard from the Secretary of State for Wales, discussing various issues pertaining to our region and her plans to increase investment into Wales. It was heartening to hear her acceptance that Wales has not been in receipt of its fair share of funding for rail. We also held a one-day evidence session on cross-border healthcare in both England and Wales. The evidence provided was quite startingly particular in respect of the discrepancies in IT technology and the difficulties in accessing specialist medical treatment on the other side of the border.\nCommission for Carbon Competitiveness\nI am continuing my work as Chair of the Commission, making sure that there is a level playing field for British Industry and Manufacturing in respect of carbon pricing and trade. If UK manufacturers are forced to bear high carbon costs that international competitors are not, then we risk seeing economic activity moving overseas. The Commission has been in contact with Treasury on the issue of the Carbon Border Adjustment mechanism as we try to balance economic growth with our commitments to reducing carbon emissions.\nAs we move forward into 2025, I remain dedicated to representing and advocating for the interests of Mid and South Pembrokeshire, both in Parliament and within our community. Please do not hesitate to reach out to my office if you have any concerns or require assistance.\nBest wishes,\nHenry",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_november-2024-newsletter/content_13.html": "November 2024 Newsletter\n- henrytufnell1\n- Dec 4, 2024\n- 3 min read\nAs November comes to a close, I want to share updates on what has been another busy and fulfilling month. From discussions in Westminster to community events across Pembrokeshire, I’ve been working hard to represent our constituency and address key local and national issues.\nIn Parliament\nChairing the Celtic Sea APPG\nThis month, I had the privilege of chairing a meeting of the All-Party Parliamentary Group on the Celtic Sea. The APPG plays a vital role in promoting collaboration across the Celtic Sea region, particularly in areas like renewable energy, fisheries, and coastal development. We discussed strategies for harnessing the region’s immense potential in floating offshore wind energy while ensuring benefits for local communities.\nPort of Milford Haven Dinner\nI was delighted to host a dinner in Parliament with representatives from the Port of Milford Haven. The Port is a cornerstone of Pembrokeshire’s economy, supporting energy infrastructure, fishing, and trade. Our discussions focused on how the UK Government can further support the Port’s ambitions, particularly with the energy transition and maintaining its competitive edge – regionally, nationally and internationally.\nMeeting with RNIB\nI met with the Royal National Institute of Blind People (RNIB) to discuss their priorities for improving accessibility, tackling discrimination, and ensuring equitable access to services for people living with sight loss. I’m committed to advocating for policies that create a more inclusive society for all.\nWork with EFRA and Welsh Affairs Select Committees\nAs a member of both the Environment, Food and Rural Affairs (EFRA) and Welsh Affairs Select Committees, I’ve been actively contributing to inquiries this month. Through EFRA, I’ve been scrutinising issues such as food security, agricultural sustainability, and water quality. With the Welsh Affairs Committee, we’ve been examining the impact of national policies on Welsh communities. I remain committed to ensuring that the voices of Pembrokeshire residents are heard at the highest level.\nVoting on the Assisted Dying Bill\nThis month, Parliament debated and voted on the Assisted Dying Bill. After much consideration and listening to constituents, I voted in favour of the Bill, which I believe strikes a compassionate balance while maintaining robust safeguards. It was a powerful day and showcased the very best of our Parliamentary system – a respectful debate and a vote that was done with great humility from all sides of the House.\nIn the Constituency\nCleddau River Group Roundtable\nProtecting our natural environment is a top priority, and I was proud to host a roundtable with the Cleddau River Group. We discussed the ongoing challenges facing the Cleddau River, including pollution and habitat conservation. I will keep pushing to ensure that these vital waterways are protected for generations to come.\nMeeting with Sandy Bears Children’s Charity\nI was deeply moved by my visit to Sandy Bears Children’s Charity, which provides invaluable support to children and families coping with bereavement and trauma. The dedication shown by the staff to help young people through difficult times is inspirational, and I will continue advocating for the resources they need to sustain their vital work.\nMeeting with FUW and NFU\nI met with the Farmers' Union of Wales (FUW) and the National Farmers’ Union (NFU) to discuss key issues affecting our agricultural sector. The challenges to the industry are numerous – compliance with new regulations, bTB, changes to Agricultural Property Relief and Business Property Relief and the transition to the Sustainable Farming Scheme. However, I am committed to supporting farmers through this difficult period and will be advocating for policies that sustain and strengthen the agricultural sector in Pembrokeshire and beyond.\nFinancial Support Event\nWith the cost of living remaining the top concern for many people across Pembrokeshire, particularly as the winter months set it, I hosted a Financial Support Event to connect residents with practical advice and resources. It was fantastic to see so many people accessing the help they need, from budgeting tips to information on grants and benefits. I was grateful to both the Citizens Advice Bureau and Age Cymru for their attendance and for making the event a success.\nParliament Week at St Teilo’s and Saundersfoot CP Schools\nI had the pleasure of visiting St Teilo’s School and Saundersfoot CP School during Parliament Week, talking to students about how democracy works and what it means to represent their community. Their curiosity and thoughtful questions were inspiring, and I hope I encouraged some future parliamentarians!\nRemembrance Sunday\nNovember is a time for reflection, and it was a privilege to take part in Remembrance Sunday services across Pembrokeshire. It was deeply moving to join with the community to honour those who gave their lives for our freedom.\nAs always, I’m here to listen and to act on your behalf. If there’s an issue you’d like to raise, please don’t hesitate to get in touch.\nWarm regards,\nHenry",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_january-newsletter/content_19.html": "January 2024 Newsletter\n- henrytufnell1\n- Feb 8, 2024\n- 4 min read\nUpdated: Mar 7, 2024\nBring on Election Year!\nWin 24\nThe General Election is getting ever closer. A 2nd May election date means we have around 6 weeks until the election is called and around 85 days until polling day! Our message to voters is simple, we will give Pembrokeshire the fresh start it deserves. The county is desperately in need of change – the cost-of-living crisis is biting hard, and our public services are in dire need of proper funding after years of Tory austerity in Westminster. Labour is ready to provide that change with a long-term plan that will bring good jobs and economic prosperity to Pembrokeshire.\nWe are continuing to campaign hard across Pembrokeshire and thank you to all of you that have been out leafletting, canvassing, and helped with leaflet bundling in the office! Our strength is in our collective movement – by the strength of our common endeavour we achieve more than we achieve alone. In mounting a people powered grass roots campaign right across the county, we can bring the change that Pembrokeshire so desperately needs.\nWelsh Leadership Race\nThe race to be the next leader of our Welsh Labour Party is firmly up and running. I am backing Vaughan Gething as I believe that he has the ability and experience to be an exceptional First Minister of Wales. Furthermore, he understands the level of economic regeneration needed in Pembrokeshire and is committed to fight for a new hospital while maintaining services at Withybush. A strong Welsh Labour Government led by Vaughan and a UK Labour Government in Westminster will bring great benefits to Pembrokeshire and I was extremely pleased that he received the endorsement of our CLP in January. Voting will begin on 16 February and close on 14 March, with the winner announced on 16 March.\nGreen New Deal\nI continue to advocate within the Party for Pembrokeshire to be front and centre of Labour’s Green Prosperity Plan. I have spoken with stakeholders right across the energy sector in Pembrokeshire and continued with this process in Pembroke Dock by visiting Svitzer and Mainstay Marine Solutions this month. I managed to get out in the Waterway on a line boat with the Svitzer team and a representative from the UK Chamber of Shipping to see their work first hand, which includes supporting the energy industry and wider port operations. At Mainstay Marine Solutions I got the full tour and saw the wide range of work they do from new boat build to marine energy device fabrication. Both these businesses provide high quality jobs for local people and will play a crucial role as we look to seize the opportunities from renewable energy and in particular Floating Offshore Wind. I also managed to catch up with the Floventis Energy team as part of their Llŷr 1 public consultation at Hundleton Sports Pavilion.\nSkills\nTo achieve the economic regeneration and high-quality public services that we so desperately need in Pembrokeshire, we must invest to provide local people with the skills they need to seize the opportunities of the future. I was therefore pleased to kick off the New Year with a visit to Pembrokeshire College with Vaughan Gething, Joyce Watson and Eluned Morgan to speak with their work-based learning Health and Social care apprentices. It was great to meet with learners and staff, and to hear not just about the excellent work being done, but also about the challenges facing apprenticeships, particularly around the curriculum and pay. I also visited the team at Providence Training, to hear about the work they are doing in delivering a wide range of training courses to organisations and individuals right across Pembrokeshire and South Wales.\nCommunity Action\nI met with the Stop the Stink campaign who are calling for accountability, transparency and a sustainable solution to the odour and environmental concerns emanating from the Withyhedge Landfill site near Haverfordwest. I will be attending the public meeting at Crundale Hall on 26th February at 7pm and I encourage anyone affected by the issue to attend as well. I share the concerns of the campaigners, particularly around the adverse effects on the community’s health and well-being, and I will be doing what I can to find a resolution to the issue.\nI really enjoyed meeting the residents and staff at the Pembroke Haven Residential Home and we discussed a wide range of political issues. The message was loud and clear that we need a change in Westminster and while some residents normally vote Conservative, they are now looking to Labour to provide that change.\nI had a great time visiting Ysgol Gynradd Waldo Williams Primary school and took questions from a year 6 class as part of their “inspire” topic on what careers they are interested in pursuing after they leave school. I was incredibly impressed by the level of questions that were put to me and once they were done grilling me, I deafened everyone in the class by playing a couple of tunes on my bagpipes! I also managed to make it down to the Pembroke Dock learning centre and play my bagpipes to the Scouts, Beavers and Cubs as well as give them a brief tutorial on the history of the bagpipes and how it works as an instrument.\nYou can keep up to date and help share what I am up to throughout the month by following me on Facebook, Twitter and Instagram.\nAs always, thank you for your support!\nVery best wishes,\nHenry Tufnell\nParliamentary Candidate for Mid & South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_letter-to-kemi-badenoch-mp-uk-japan-trade-deal/content_31.html": "Letter to Kemi Badenoch MP - UK-Japan Trade Deal\n- henrytufnell1\n- Dec 1, 2023\n- 2 min read\nDear Secretary of State,\nRE: UK-Japan Trade Deal – Japan protection update for local specialties\nI am writing to remind you of the promises that were made to Pembrokeshire and to Wales over three years ago as part of the October 2020 UK-Japan trade deal, and to demand that you take action to secure the long-overdue protections that our specialty exporters need and deserve.\nWhen the post-Brexit agreement was announced, the government promised that 77 new UK food and drink products would be guaranteed protected geographical indication (GI) status in Japan, alongside seven existing protections carried over from the previous EU-Japan trade deal, covering the likes of Scotch Whisky, Scottish Salmon and Stilton Cheese.\nGI status is vital for producers to protect them against competition in foreign markets from falsely-branded imitators. Securing those protections has become an important objective of modern trade deals to support the export potential of specialty food and drink products.\nOf the 77 new protections that were promised by the Westminster government in October 2020, fifteen were for Welsh specialties, including Pembrokeshire Earlies, Carmarthen Ham, Caerphilly Cheese, West Wales Coracle Caught Salmon and Sewin, Welsh Laverbread, Welsh Lamb, Welsh Beef, Welsh Wine, Welsh Cider, Conwy Mussels, Anglesey Sea Salt and Vale of Clwyd Denbigh Plum.\nAt the time, then Trade Secretary Liz Truss said: \"This is a historic moment for the UK and Japan. From our Welsh lamb and Pembrokeshire early potato farmers to our Traditional Welsh cider breweries, this deal will create new opportunities for people throughout Wales and help level up the whole of the UK.\"\nHer department originally said that all 77 new protections would be in place by May 2021, and boasted that – thanks to the agreement – the UK would benefit from a fast-track process for securing brand protection that \"would not have been possible\" under the EU-Japan deal, under which it said \"the EU must negotiate each new GI individually on a case-by-case basis.\"\nBut while the EU has added 84 extra products to its protected list since October 2020, including 28 more just a few weeks ago, the government has yet to secure brand protection for a single one of the 77 products it originally promised. The EU's number of GIs in Japan now stands at 291, while the UK is still stuck with only the seven protected products it inherited from the EU-Japan deal.\nPembrokeshire and Welsh producers are entitled to ask why your government’s promises have not been kept, and why you have been seemingly completely inactive on such an important issue, especially since we've already had to watch 84 additional EU products receive protected status in Japan in the same time that we've been waiting for ours.\nI look forward to receiving your response.\nYours sincerely,\nHenry Tufnell\nLabour Candidate for Mid & South Pembrokeshire\nFor further information see the links below:",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_october-newsletter/content_35.html": "October 2023 Newsletter\n- henrytufnell1\n- Nov 7, 2023\n- 3 min read\nUpdated: Jan 15, 2024\nOctober has been a rollercoaster of a month!\nHS2 Fiasco\nWe started off with the fiasco of the Tory Party conference and the decision by Rishi Sunak to kill off the HS2 project. Any claim that this was an England and Wales project is now well and truly over and I echoed the comments of Mark Drakeford, in calling for Wales to be given its fair share from this failed England-only scheme. The huge wastage of public money and the attempt to repackage it as the ‘Network North’ when 85% of the projects are re-announcements shows that this really is a dying Government bereft of ideas. If that was not enough, Stephen Crabb took great delight in announcing the electrification of the North Wales Main Line but made no mention about West Wales, which as we all know desperately needs improved railway links and infrastructure.\nLabour Conference\nIt was fantastic to attend Labour Party conference this year with our two delegates: Cllr Tom Tudor and Vice-Chair campaigns Joanna Ambrose. The speeches by Mark Drakeford, Keir Starmer and Rachel Reeves were inspirational in showing what a UK Labour Govt will do for Wales and the UK – driving for growth, green investment and skilled jobs is exactly what we need in Pembrokeshire. I was pleased to speak at a fringe event on Carbon Capture Utilisation and Storage and am firmly committed to making sure that our industries on the Milford Haven Waterway are front and centre of this exciting transition to deliver net zero. It was a whirlwind of a Conference!\nIn the Community\nI was lucky to be hosted by a variety of organisations this month right across the county. At Pembroke Dock Community School I was shown round by headteacher Michele Thomas who has created a progressive and dynamic environment that encourages pupils to fulfil their potential.\nI had a wide-ranging discussion with members of the local NFU and I am excited to build a solid working relationship with the agricultural community in Pembrokeshire. I met the team at Câr y Môr and learned more about Wales’ first regenerative seaweed and shellfish farm as well as their positive impact on the coastal environment and benefit to the local community.\nI also visited PATH – Pembrokeshire Action for the Homeless with Eluned Morgan and Cllr Marc Tierney to see the vital work they do in helping those who are homeless find safe, secure, and affordable accommodation. I even made my first appearance on the Radio with Pure West Radio only to get covered in shaving foam! You can find a more substantive discussion on this page and scrolling down for Pure Politics.\nOn the Doorstep\nWe continued in earnest with our canvassing right across the constituency. Thank you so much to all those who joined out on the doorstep. The shows of solidarity from members as the nights draw in gives us all a big lift! We are fighting for every vote, and we need your help – please join John Bramley on the phones, Joanna Ambrose on the digital airwaves and/or Ben Levy on the streets. Any time you can spare in whatever capacity is welcomed. We have a huge opportunity to get rid of the Tories in Westminster and the path to victory goes right through Mid & South Pembrokeshire.\nWe are supplementing the canvassing sessions with community roundtables and meet the candidate events. Julian Rutter and Amanda Goodall were instrumental in successfully putting together a faith leaders roundtable in Neyland and a Q&A session in St David’s City Hall. We are looking to hold our next Q&A session in Pembroke Dock and the next community roundtable will be focused on the environment. If you are interested in getting involved in this style of event, then please get in touch.\nFinally, we had a truly memorable evening with Emily Thornberry, Mark Drakeford, Eluned Morgan, Jackie Lawrence and Nick Ainger! Thank you to Pratibha Kanse, Alex Warlow and Ben Levy for all their hard work in making it happen. We are also grateful to Matthew Evans at The Cottage Inn in Llangwm and Jackie Palitt for hosting us and providing such delicious food. Please keep an eye out for future fundraising events.\nYou can keep up to date and help share what I’m up to throughout the month by following me on Facebook, Twitter and Instagram.\nAs always, thank you for your support!\nBest wishes,\nHenry Tufnell\nParliamentary Candidate for Mid & South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_news-article-3/content_7.html": "July 2023 Newsletter\n- Fergus Franks\n- Jul 13, 2023\n- 3 min read\nUpdated: Jan 15, 2024\nWelcome back to my monthly newsletter!\nThe rain may be coming down, but our support is only going up…\nThis month, I’ve been knocking on doors all over Pembrokeshire, from Milford Haven, to Neyland, to Haverfordwest, to Cleddau, voters all over our soon-to-be constituency are telling me that it’s time for change, that we cannot go on as we are, and that it’s time for a Labour government.\nWith every month that passes, our campaign team continues to grow. Thanks to our dedicated and hard-working volunteers, we are able to speak to more and more voters every week. These conversations are building the foundation of our general election campaign, giving us the strong head start we need to defeat the Tories in Mid & South Pembrokeshire.\nIf you want to get involved, there will be a role for you! We welcome anyone willing to support our campaign however they can, so please do get in touch.\nAt the Royal Welsh...\nJust this week I had the privilege of attending the Royal Welsh, one of the most exciting agricultural events and, of course, one of the biggest events in the Welsh calendar! The Royal Welsh is a shining example of our agricultural industries in Wales, and I was delighted to speak to so many from our rural communities and businesses.\nA huge thanks to Food Sense Wales/ Synnwyr Bwyd Cymru for inviting me to join their panel to discuss how we can confront the challenges we face across our food system, and work with public bodies, communities, food producers and other businesses to achieve necessary change. It was an interesting and lively discussion, with very insightful questions from the audience, too!\nReflecting on the by-elections...\nWith 3 important by-elections last week, and different results in each one, I’ve been reflecting on how far our campaign has come over the last few months. The result in Selby and Ainsty was fantastic – one of our best by-election results for over 25 years. Thanks to the dedication and hard work of countless volunteers, we were able to overturn a 20,000 strong Tory majority. Alongside this result, though, was a loss we hadn’t quite expected in Uxbridge. Although we're ahead in polls, we can’t take a Labour victory for granted, and I will continue to work hard for every Labour vote. Our campaign has been, and continues to grow every week. However, with the summer holidays in swing, and dark nights around the corner, we’re going to need your help even more as the months go by. If you can volunteer to help us win Mid & South Pembrokeshire, please do.\nIn a rather intense round of 'Where's Henry?'... Can you spot me in this photo?\nOnto August...\nAugust is already shaping up to be a great month. We’re going to make the most out of the long, (hopefully!) sunny days and canvass as much as we can. For those taking some time away with friends and family, I hope you get some rest and relaxation and hope to see you soon, fresh and ready to win a Labour victory. We’ve also got some great social events in the diary. So, one way or another, I’m hoping I’ll see you soon!\nYou can keep up to date and help share what I’m up to throughout the month by following me on Facebook, Twitter and Instagram.\nKind regards,\nHenry Tufnell\nParliamentary Candidate for Mid & South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com/content_1.html": "Member of Parliament for Mid and South Pembrokeshire.\nCheck the map below to see if you are a constituent.\nMY STORY\nABOUT ME\nI practised as a barrister before leaving to work as an organiser at a grassroots trade union. My values are hard work, community and caring for others. My work in the law and now the labour movement demonstrates my commitment to those values – fighting for workers’ rights and organising workers to campaign for better pay and working conditions.\nMy wife, Poppy, grew up in Essex and my mother-in law now lives on Mersea Island. We are connected to Colchester and feel part of the local community.\nABOUT ME\nI live just outside St Davids, but I grew up in a farming family and have spent many Easters lambing and many summers doing the harvest. Professionally, I trained and practised as a barrister, specialising in healthcare, public and employment law, before leaving to work as an organiser for a grassroots trade union that helps cleaners campaign for better pay and working conditions. My values are hard work, community and caring for others. I am committed to Pembrokeshire, embedded within the local community, using my skills to fight for a kind, caring and compassionate society where everyone is valued.\nWORKING FOR PEMBROKESHIRE\nAs your Labour MP, I am committed to standing up for Pembrokeshire and working alongside our Labour Senedd members and local Labour councillors to address the problems we face – both as a local community and as a wider society. Labour’s agenda is bold: economic competency, a new deal for working people, climate leadership, a commitment to locally sourced and sustainable food, a removal of export barriers, and trade standards which we can be proud of.\n“I am determined to fight for a fairer and more equal society where everyone is valued”\nEXPERIENCE\nADVOCATE FOR WORKERS' RIGHTS\nPrior to working as an MP and trade union organiser, I practised as a barrister, specialising in Employment, Healthcare and Public Law. I was committed to promoting access to justice at the Bar, regularly accepting cases on a voluntary basis. I assisted trade unions voluntarily, supporting my branch of the GMB union as well as other grass roots trade unions. I was also part of Labour’s Campaign for Human Rights and co-authored a paper on behalf of the organisation about the Independent Human Rights Act Review.\nCAMPAIGNER & TRADE UNION ACTIVIST\nI worked as a trade union campaigner and organiser at the Cleaners and Allied Independent Workers Union (“CAIWU”), which is a member-led and grass roots trade union specialising in representing cleaners across the UK. CAIWU members are some of the most marginalised in society, who have often emigrated from foreign countries and exist on insecure, low paid jobs and are at risk of exploitation. I campaigned for improved pay and working conditions in the workplace by organising collective action, and fought for justice in the courts in order to hold employers to account.\nLATEST NEWS\nPolicy Updates\nEach week, I receive a large number of policy queries from constituents regarding a wide range of issues. If you have a policy query, please check the posts below or email my office if you have specific policy questions that I have not answered. I update this page every week.\nAssisted dying\nI've written my thoughts on the Assisted dying bill.\nGET INVOLVED\nJustin Maynard Jones\nFellow Council Candidate\n\"Henry is a breath of fresh air and would be the embodiment of a modern, forward-thinking MP. On the doorstep and at the despatch box, he would be a superb champion and campaigner for Mid & South Pembrokeshire.\"\nAlberto Durango\nGeneral Secretary of CAIWU\n\"The great qualities I see in Henry, is that he is a person with a great feeling of human value, a sense for justice, an ethical person, and a person who would be a great representative for the people of Mid & South Pembrokeshire.\"\nRichard Booth KC\nHead of 1 Crown Office Row Chambers\n\"Henry is caring, conscientious and intelligent. He would make an excellent Member of Parliament for Mid & South Pembrokeshire.\"\nFor all enquiries please email: henry.tufnell.mp@parliament.uk",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_pembrokeshire-herald-column-7th-september-2023/content_37.html": "Pembrokeshire Herald Column - 7th September 2023\n- Fergus Franks\n- Oct 3, 2023\n- 3 min read\nUpdated: Oct 5, 2023\nIt has been a difficult year for farmers. Harvesting corn in such wet conditions is challenging, with farmers having to weigh the risk of letting the crop sprout in the field against spending vast amounts of money on fuel to dry it in the barn. Meanwhile the volatility of the commodity market means that the wholesale price of milk is now just over 35p per litre, having dropped from previous highs of over 50p towards the end of 2022, and the price of wheat is now below £200 per ton, having been a little over £380 in 2022. I come from a farming background myself, and I can see all too well the challenges that the farming industry currently faces.\nThe Labour Party has always been perceived to have a difficult relationship with rural communities, in part perhaps due to our traditional urban voter base. Yet, at the Royal Welsh Show and at the Pembrokeshire County Show I spoke with many farmers, as well as the Farmers’ Union of Wales and the National Farmers’ Union. Yes, the talks were robust – particularly on the issue of the new 10% tree cover requirements – but there was an acceptance that the Sustainable Farming Scheme had been arrived at following a positive and collaborative journey between the Welsh Government and farmers. The Welsh Government are serious about tackling the issues the farming industry faces – last month for example it awarded a contract to explore new measures to tackle the spread of bovine tuberculosis across Pembrokeshire. It is an exciting time to see that partnership between the Welsh Government and the farming community in action, working to achieve sustainable food production while protecting our natural environment.\nThe collaborative approach taken by the Welsh Labour Government sits in stark contrast to the approach taken by the Tory Government in Westminster. Their reckless approach to the farming industry is staggering. They have concluded a trade deal with Australia that has been predicted to cost the farming and food industry around £300 million, they have made Welsh lamb uncompetitive, they have bartered away our high food standards, and they have facilitated a tight labour market that is crippling the economy. Their approach to Europe also seems to be driven by pure ideology rather than any pragmatism, with no understanding that distance does matter when it comes to trading in an increasingly uncertain world.\nA UK Labour Government will change this and will be on the side of farmers. We want to remove export barriers, have food standards that we can be proud of, encourage people to buy more British food, and move to a labour model with improved pay and conditions that does not leave food rotting in our fields. We will rebuild the UK’s relationship with Europe with the needs of our farming community at its heart, including a new veterinary agreement for agri-products. Finally, as Keir Starmer said in his speech to the NFU, the commitment to food production and the farming industry will be backed by £1.2 billion of public money to be spent on food that is locally produced and sustainable.\nThere is no doubt these are challenging times, but Labour is here to listen and to work with the farming community to achieve a fairer, greener, and more dynamic future.\nYou can read the full article in the Pembrokeshire Herald on page here",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_news_page_2/content_15.html": "top of page\nNEWS\nAugust 2024 Newsletter\nWelcome back to my newsletter since being elected as your member of parliament! Firstly, can I say a big thank you to everyone who has...\nPembrokeshire Herald Column - 9th May 2024\nThere are over 1,500 individual landfill sites recorded in Wales classed as operational, closed, or historic. A recent reportby Natural...\nApril 2024 Newsletter\nWelcome back to my monthly newsletter! Police and Crime Commissioner Elections Thank you to everyone who helped in the Police and Crime...\nMarch 2024 Newsletter\nIt was wonderful to see so many of you at the campaign launch earlier this month – thank you all for coming and being part of our...\nPembrokeshire Herald Column - 8th March 2024\nEarlier this week the Tory Government in Westminster suffered a series of defeats in the House of Lords over the bill to revive the...\nFebruary 2024 Newsletter\nThe calm before the storm… General Election If the Prime Minister surprises the commentariat of Westminster by calling a 2 May election,...\nJanuary 2024 Newsletter\nBring on Election Year! Win 24 The General Election is getting ever closer. A 2nd May election date means we have around 6 weeks until...\nPembrokeshire Herald Column - 18th January 2024\nOne of the greatest achievements of the Labour Government was the founding of the NHS on the principle that healthcare would be free at...\nDecember 2023 Newsletter\nWelcome back to my monthly newsletter! Mark Drakeford stands down I want to begin by paying tribute to our First Minister, Mark...\nbottom of page",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_september-newsletter/content_33.html": "September 2023 Newsletter\n- Fergus Franks\n- Oct 20, 2023\n- 3 min read\nUpdated: Jan 15, 2024\nSeptember has been an exciting month, kicking off with a sprint triathlon in Saundersfoot alongside my election agent Josh Beynon. The atmosphere was fantastic, with a real buzz around the town and lots of people on the course shouting words of encouragement. Our sprint start hopefully did a good job in warming everyone up for the Ironman Wales later that weekend.\nOn the Doorstep and on the Wards\nWhen not sprinting across Saundersfoot in lycra, we have been busy this month knocking on doors across the county. There have been engaging conversations with voters – such as on the new 20mph measures which the Conservatives have been trying to make much political capital out of with the supposed “war on motorists”. Our reception has been very positive though, as people are looking to Labour to provide that fresh start for Pembrokeshire.\nAnother concern that we frequently talk about on the doorstep is local healthcare. I was pleased to attend South Pembrokeshire Hospital with Eluned Morgan MS last week, where I saw the excellent work being done by staff at the hospital. I will continue to support all that our Welsh Health minister is doing, and will be making the case for both the building of the new hospital and the maintenance of patient care at Withybush.\nIn the Community\nI have also met with some inspiring organisations and heard more about their initiatives in Pembrokeshire. At PLANED I learnt about the fantastic work being done to empower communities across Pembrokeshire; community land trusts, community share offers, micro enterprises and community vending machines all play a massive role in beginning the change we want to see. At Greenacres Animal Rescue, I made some new furry friends, while also talking XL bullies, responsible pet ownership, the impact of COVID, microchipping and greyhound racing. At Pembrokeshire Citizens Advice, I met caseworkers who are on the front-line in helping people through the cost-of-living crisis. And finally, I even managed to make it out on a morning litter pick with the team at McDonalds, Cllr Beynon and the PCSO patrol.\nHello, Goodbye\nAt the end of the month I was pleased to attended the farewell meetings of both Carmarthen West and South Pembrokeshire, and Preseli Pembrokeshire. It was a wonderful opportunity to reflect on the political journeys of both CLPs from their formation back in 1997. I hope that with your help we can usher in the new era of Mid & South Pembrokeshire with a Labour gain next year.\nWhy I'm Standing\nThe one question that I have been asked by both party members and voters is – why are you standing?\nTurning 18 in June 2010, as the Conservative and Liberal Democrat coalition ushered in the age of austerity, meant that my adult life has been punctuated by deliberate Tory economic policy which has decimated our public services and hollowed out our communities.\nAs a barrister practising in healthcare law, I saw the pressure facing healthcare professionals from an underfunded and poorly run NHS. As a trade union organiser, I saw exploitative working practices from companies that too often refused to pay their cleaners properly. And as a member of the public, I have seen that those in power, whether politicians or heads of multinational corporations, are simply not listening to ordinary people – and particularly those people in rural and coastal communities such as Pembrokeshire.\nIt is these injustices that have motivated me to stand, because I believe that a Labour government will help improve people’s lives for the better and that’s why now more than ever we need to come together and mobilise, if we want to win this seat back from the Tories. I would love to see you at...\nThe inaugural Annual General Meeting of Mid & South Pembrokeshire on 21st of October at 10:30am in the Neyland Community Hub\nThe Indian feast with Emily Thornberry, Nick Ainger and Jackie Lawrence, on the 28th of October at the Cottage Inn in Llangwm. RSVP to noridol@btinternet.com.\nYou can keep up to date and help share what I’m up to throughout the month by following me on Facebook, Twitter and Instagram.\nAs always, thank you for your support!\nBest wishes,\nHenry Tufnell Parliamentary Candidate for Mid & South Pembrokeshire",
  "https_www_henrytufnell_com/http_www_henrytufnell_com/content_14.html": "Member of Parliament for Mid and South Pembrokeshire.\nCheck the map below to see if you are a constituent.\nMY STORY\nABOUT ME\nI practised as a barrister before leaving to work as an organiser at a grassroots trade union. My values are hard work, community and caring for others. My work in the law and now the labour movement demonstrates my commitment to those values – fighting for workers’ rights and organising workers to campaign for better pay and working conditions.\nMy wife, Poppy, grew up in Essex and my mother-in law now lives on Mersea Island. We are connected to Colchester and feel part of the local community.\nABOUT ME\nI live just outside St Davids, but I grew up in a farming family and have spent many Easters lambing and many summers doing the harvest. Professionally, I trained and practised as a barrister, specialising in healthcare, public and employment law, before leaving to work as an organiser for a grassroots trade union that helps cleaners campaign for better pay and working conditions. My values are hard work, community and caring for others. I am committed to Pembrokeshire, embedded within the local community, using my skills to fight for a kind, caring and compassionate society where everyone is valued.\nWORKING FOR PEMBROKESHIRE\nAs your Labour MP, I am committed to standing up for Pembrokeshire and working alongside our Labour Senedd members and local Labour councillors to address the problems we face – both as a local community and as a wider society. Labour’s agenda is bold: economic competency, a new deal for working people, climate leadership, a commitment to locally sourced and sustainable food, a removal of export barriers, and trade standards which we can be proud of.\n“I am determined to fight for a fairer and more equal society where everyone is valued”\nEXPERIENCE\nADVOCATE FOR WORKERS' RIGHTS\nPrior to working as an MP and trade union organiser, I practised as a barrister, specialising in Employment, Healthcare and Public Law. I was committed to promoting access to justice at the Bar, regularly accepting cases on a voluntary basis. I assisted trade unions voluntarily, supporting my branch of the GMB union as well as other grass roots trade unions. I was also part of Labour’s Campaign for Human Rights and co-authored a paper on behalf of the organisation about the Independent Human Rights Act Review.\nCAMPAIGNER & TRADE UNION ACTIVIST\nI worked as a trade union campaigner and organiser at the Cleaners and Allied Independent Workers Union (“CAIWU”), which is a member-led and grass roots trade union specialising in representing cleaners across the UK. CAIWU members are some of the most marginalised in society, who have often emigrated from foreign countries and exist on insecure, low paid jobs and are at risk of exploitation. I campaigned for improved pay and working conditions in the workplace by organising collective action, and fought for justice in the courts in order to hold employers to account.\nLATEST NEWS\nPolicy Updates\nEach week, I receive a large number of policy queries from constituents regarding a wide range of issues. If you have a policy query, please check the posts below or email my office if you have specific policy questions that I have not answered. I update this page every week.\nAssisted dying\nI've written my thoughts on the Assisted dying bill.\nGET INVOLVED\nJustin Maynard Jones\nFellow Council Candidate\n\"Henry is a breath of fresh air and would be the embodiment of a modern, forward-thinking MP. On the doorstep and at the despatch box, he would be a superb champion and campaigner for Mid & South Pembrokeshire.\"\nAlberto Durango\nGeneral Secretary of CAIWU\n\"The great qualities I see in Henry, is that he is a person with a great feeling of human value, a sense for justice, an ethical person, and a person who would be a great representative for the people of Mid & South Pembrokeshire.\"\nRichard Booth KC\nHead of 1 Crown Office Row Chambers\n\"Henry is caring, conscientious and intelligent. He would make an excellent Member of Parliament for Mid & South Pembrokeshire.\"\nFor all enquiries please email: henry.tufnell.mp@parliament.uk",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_pembrokeshire-herald-column-8-march-2024/content_28.html": "Pembrokeshire Herald Column - 8th March 2024\n- henrytufnell1\n- Apr 4, 2024\n- 3 min read\nEarlier this week the Tory Government in Westminster suffered a series of defeats in the House of Lords over the bill to revive the Rwanda deportation scheme. The proposed legislation seeks to designate Rwanda a safe country to where it can send asylum seekers, thereby preventing subsequent challenges in the courts on this issue. Peers supported changes to make it easier for judges to challenge the scheme, and to require the treaty between Rwanda and the UK to be fully implemented before any flight takes off. While these changes will likely be voted down when the bill returns to the House of Commons, it puts this whole sorry saga into sharp relief as we approach the General Election.\nTo date the cost of the scheme is around £240 million – and yet not a single person has been sent to Rwanda so far. The National Audit Office recently published a report showing that to send less than one per cent of UK asylum seekers to Rwanda, the taxpayer will be forced to pay over half a billion over the course of the five-year agreement with Rwanda – nearly £2 million per person sent. If this wasn’t enough, the Government right now is paying around £8 million per day on housing migrants in hotels, allowing inadequate security checks at the border, and unlawfully housing child refugees in inappropriate accommodation. Put simply, the Tories have lost control of our borders, and the immigration system is broken.\nImmigration is high on the agenda for many people in Pembrokeshire, and an examination of the migration figures shows why that is the case. In 2022, net migration into the UK (the difference between the number of people coming to live in the UK and those leaving) was a record 745,000. For context, in 2010 when David Cameron took over from Gordon Brown, that figure was just 256,000. Combine that with the pressures on public services, stagnant wages, and a race to the bottom on working conditions, people are entitled to want the UK Government to get a grip on migration.\nThe Labour Party recognises these concerns and is committed to restoring order at our borders. We will redirect public money from the failed Rwanda scheme to fund a proper border security plan that will reform the asylum system:\nCrack down on criminal smuggler gangs with more cross-border police, counter-terror style tactics, and deeper security cooperation with Europe.\nEnd hotel use for asylum seekers, clear the Tory asylum backlog by recruiting 1,000 Home Office caseworkers and a new returns unit backed by 1,000 staff to fast-track removals of those with no right to stay, as well as speeding up returns to safe countries.\nReform resettlement routes to include a clearer process for refugees with family connections in the UK, preventing them from being exploited by criminal gangs.\nNegotiate a new agreement with France and other countries on returns and safe family reunions for child refugees.\nTackle humanitarian crises at source to help refugees in their region including restoring the 0.7% aid commitment when the fiscal situation allows.\nRight now we are looking at £150,000 per person to be sent to Rwanda, £120 million to help the Rwandan economy if 300 people are sent, and £20,00 per individual relocated; it is farcical to suggest that those payments constitute good use of taxpayers’ money. It is time that we ended this sorry episode and started to chart a clear course on migration, which takes control of our borders and gives people confidence that the Government is acting in their best interests.\nYou can read the column in the Pembrokeshire Herald on page 66 here",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_october-2024-newsletter/content_11.html": "October 2024 Newsletter\n- henrytufnell1\n- Nov 1, 2024\n- 2 min read\nHello everyone,\nOctober has been another packed month with visits, meetings, and meaningful conversations across the constituency, and a busy agenda in parliament too!\nIn Mid and South Pembrokeshire\nI started the month with a visit to Lower Treginnis, hosted by Farms for City Children. The farm offers city-based children a unique chance to immerse themselves in rural life, learning about sustainable farming, teamwork, and the importance of protecting our natural environment.\nSpending time with the brilliant team, and the enthusiastic children, reminded me how important it is that young people are given the opportunity to build a connection with nature.\nI was thrilled to host a roundtable with energy industry experts at RWE’s Net Zero Centre, where we discussed some of the pressing challenges facing the renewable energy sector. Our focus was centred on how we can explore all the technologies, and practical solutions, that can make net-zero targets achievable. We discussed everything from offshore wind power, to emerging hydrogen technologies and, crucially, how these can benefit Pembrokeshire’s communities by creating jobs and supporting our local economy.\nIn Haverfordwest, I held an advice surgery, meeting with residents to hear their concerns firsthand. It is one of the most rewarding parts of my job, getting to offer support and guidance to help constituents facing a wide range of issues.\nLater in the month, I had the pleasure of visiting Pembrokeshire College’s new Energy Skills Hub. This forward-looking initiative is dedicated to equipping students with practical skills needed for careers in renewable energy and green technologies. The Energy Skills Hub is an impressive resource for our area and will play a critical role in preparing our young workforce to be leaders in the green economy—a key part of Pembrokeshire’s commitment to a sustainable future. The Labour Party is committed to investing in industries of the future and I am pleased to see young people being offered opportunities that have not been available in Pembrokeshire in the past.\nAlongside these initiatives, I also hosted a Support Surgery in Pembroke Dock with Citizens Advice, and met with the local health board to discuss ways to improve access to primary care in our communities. With demand on healthcare services so high, I emphasised to the health board how important it is that better pathways are created for rural residents, who face additional barriers to accessing services.\nImproving access to healthcare remains a top priority, and I am committed to address these challenges proactively to ensure services can be improved.\nIn Parliament\nI was also proud to support the Employment Rights Bill this month. Ensuring fair treatment and job security is essential to our community’s well-being, and this bill strengthens workers’ rights, paving the way for a more equitable workplace culture across Pembrokeshire and beyond.\nFinally, this month I was also able to deliver my maiden speech in parliament which you can watch below. It is a huge honour to represent this fantastic county in Westminster and I am also pleased to be able to continue flying the Pembrokeshire flag on both the Environment, Food and Rural Affairs and Welsh Affairs Select Committee.\nThank you to everyone who contributed to these events and discussions.\nWarm regards,\nHenry Tufnell MP",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_september-2024-newsletter/content_25.html": "September 2024 Newsletter\n- henrytufnell1\n- Oct 1, 2024\n- 3 min read\nDear all,\nAs we transition into autumn, September has been a busy and exciting month. I have been tackling critical local issues and putting Pembrokeshire at the forefront of the policy agenda in Parliament. Here is a brief update on what I have been working on:\nRaising Concerns About Legal Deserts in Pembrokeshire\nThis month, I had the opportunity to ask the Justice Minister about “legal deserts” in Justice Questions.\nThe lack of access to legal aid services in rural communities like ours continues to be a pressing concern, leaving many residents without vital legal support. I made the case for the urgent need to address these gaps, ensuring everyone, regardless of location, has access to justice. I will keep pushing for solutions to make legal representation available to all. I was pleased that the Minister agreed to a private meeting next month to look at the issue in greater detail.\nAttending the Labour Party Conference\nThe Labour Party’s annual conference returned to Liverpool this month, and it was great to attend my first conference as your Labour MP. It was an excellent opportunity to engage with a range of different stakeholders, including from charities, trade unions, businesses and policy makers.\nThis conference was a great platform for sharing ideas on how we can address the challenges facing Wales and the wider UK, from improving public services to tackling the climate crisis.\nThe theme of the conference was “Change Begins”, and I look forward to continuing my work in ensuring that positive change is delivered for communities across Mid and South Pembrokeshire.\nThe next big announcement from the Government will be the Budget coming at the end of October. I will be following the Chancellor’s announcements closely and will communicate how it will affect Pembrokeshire.\nMeeting with Câr-Y-Môr in St David’s\nI was pleased to meet with the team at Câr-Y-Môr in St David’s, a fantastic community-based seaweed farming initiative. Câr-Y-Môr is leading the way in sustainable aquaculture, producing seaweed and shellfish while also contributing to local environmental protection efforts. It’s initiatives like these that highlight the importance of supporting local, sustainable industries that not only benefit the environment but also create jobs for our community.\nSupporting Haverfordwest County AFC\nI also had the pleasure of meeting with Haverfordwest County AFC. Our local football club is at the heart of the community, providing not just a platform for sporting excellence but also a hub for community engagement. It was great to hear about their ongoing projects, including the construction of a new 3G pitch, as well as their plans for the future. I look forward to supporting their endeavours and seeing the club grow even stronger.\nVisiting the Greenlink Interconnector Site\nI had the opportunity to visit the Greenlink Interconnector Site this month, a crucial infrastructure project connecting the electricity grids of Ireland and Wales. Once completed, Greenlink will contribute significantly to our renewable energy goals by allowing the transfer of green energy between the two countries. This project is not only important for our energy security but also for our fight against climate change. I will continue to advocate for projects that place sustainability at the heart of our economy.\nWorking with the Citizens Advice Bureau\nFinally, I’ve been working closely with partners like the Citizens Advice Bureau, ensuring that people in our community have access to vital services and support. The cost-of-living crisis is hitting many families hard, and the Citizens Advice Bureau provides essential assistance on a range of issues, from debt advice to housing support. I am committed to working with organisations like this to ensure that everyone has access to the help they need during these challenging times.\nAs always, I am here to listen to your concerns and work together to make Pembrokeshire an even better place to live. If there are any issues you feel I should be addressing, please don’t hesitate to get in touch.\nThank you for your taking the time to read this.\nBest wishes,\nHenry Tufnell MP",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_news_page_3/content_29.html": "top of page\nNEWS\nPembrokeshire Herald Column - 15th December 2023\nIt was a pleasure last week to attend the Port of Milford Haven’s 65th Anniversary dinner. There were some excellent speeches that...\nNovember 2023 Newsletter\nWelcome back to my monthly newsletter! Remembrance Sunday It was a real honour to lay the wreath on behalf of the Labour Party at the...\nLetter to Kemi Badenoch MP - UK-Japan Trade Deal\nDear Secretary of State, RE: UK-Japan Trade Deal – Japan protection update for local specialties I am writing to remind you of the...\nPembrokeshire Herald Column - 3rd November 2023\nHousing is a hot issue for many people in Pembrokeshire. Not only is it becoming more and more difficult for first-time buyers to get on...\nOctober 2023 Newsletter\nOctober has been a rollercoaster of a month! HS2 Fiasco We started off with the fiasco of the Tory Party conference and the decision by...\nSeptember 2023 Newsletter\nSeptember has been an exciting month, kicking off with a sprint triathlon in Saundersfoot alongside my election agent Josh Beynon. The...\nPembrokeshire Herald Column - 7th September 2023\nIt has been a difficult year for farmers. Harvesting corn in such wet conditions is challenging, with farmers having to weigh the risk of...\nPembrokeshire Herald Column - 4th August 2023\nIt is an enormous honour and privilege to have been selected by local Labour Party members to be Welsh Labour’s Parliamentary Candidate...\nAugust 2023 Newsletter\nWelcome back to my monthly newsletter. Here’s what the campaign team and I have been up to! Pembrokeshire County Show First of all I’d...\nbottom of page",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_december-2024-newsletter/content_2.html": "December 2024 Newsletter\n- henrytufnell1\n- Dec 23, 2024\n- 4 min read\nAs 2024 draws to a close, I want to take a moment to wish everyone in Pembrokeshire a very Merry Christmas and a Happy New Year. December has been a particularly busy month, filled with festive events, community meetings, and important work across the constituency.\nMeeting with Local Healthcare Providers\nBack in the constituency, I met with GPs from South Pembrokeshire at Narberth Surgery to hear directly about the pressures they are facing. From staffing shortages to increasing patient demand, it’s clear that our healthcare system is under strain, and I am committed to pressing for support from the health board so that our GPs have what they need to deliver excellent care. I also met with local dentists to understand the ongoing difficulties in accessing NHS dental care. I know from so many constituents how hard it can be to register for an NHS dentist and book GP appointments, which has inspired my New Year’s Resolution: In 2025 I am going to ramp up my campaign to highlight the managerial incompetence of the Hywel Dda health board. Every day I receive harrowing examples of the bungling deficiencies in healthcare provision, from procurement to healthcare access. It’s time for change – the people of Pembrokeshire deserve more.\nTenby’s Santa Run\nI had the pleasure of kicking off the festive season by taking part in Tenby’s Santa Run – a fantastic event full of Christmas cheer and community spirit. It was wonderful to see so many local families, schools, and groups turning out in Santa hats and festive costumes to raise money for local charities. The energy was infectious, and events like this remind us of the strong community spirit that makes Pembrokeshire such a special place.\nBell Ringing at St David’s Cathedral\nI also had the unique experience of bell ringing at St David’s Cathedral. I was welcomed warmly by the dedicated and skillful bell ringers, who shared their knowledge of the history and art of bell ringing. The sound of the bells echoing through the city was a poignant reminder of the traditions that tie us together, especially at this time of year. It was humbling to take part in something that has been a fixture in our communities for centuries, and I am looking forward to working with the Pembroke Bell Restoration group in Pembroke so the bells can ring across our county in 2025.\nWork in Parliament and the EFRA Committee\nWork in Parliament continued at pace this month. I joined the Environment, Food and Rural Affairs (EFRA) Select Committee for an away day to Animal and Plant Health Agency HQw here we discussed some of the key challenges and opportunities facing rural areas, including agricultural funding post-Brexit, the sustainability of farming practices, and the need for long-term environmental protections. The discussions were detailed and productive, and I will continue to ensure that Pembrokeshire’s agricultural voice is heard loud and clear on these vital issues.\nSupporting Constituents\nThis month, I have been proud to help constituents with a wide range of important issues. Whether it was assisting with social care applications, resolving housing disputes, or tackling delays in benefits payments, my team and I have worked tirelessly to ensure that residents across Mid and South Pembrokeshire get the support they deserve. A number of constituents have also been in touch about rising energy bills as the winter months set in. I have provided advice on accessing grants and support schemes and will keep advocating for measures to ease the burden of living costs.\nSince the beginning of December, I have received over 550 pieces of casework, covering a wide range of topics, from housing and healthcare to education and energy support. I want to thank everyone who has reached out – helping resolve your concerns remains my top priority.\nFloating Offshore Wind and Environmental Discussions\nI was pleased to attend a debate on the opportunities presented by floating offshore wind technology this month. Pembrokeshire is at the forefront of renewable energy innovation, and this sector has the potential to create jobs, attract investment, and reduce our carbon emissions.\nFriends of the Earth Pembrokeshire\nI also met with Friends of the Earth Pembrokeshire to discuss how we can safeguard our natural environment while supporting clean energy projects. Protecting our coastline and countryside is a priority for me, and I will continue to support initiatives that balance economic growth with environmental stewardship.\nCarol Service and Christmas Celebrations\nOne of the highlights of the month was attending a beautiful carol service in Milford Haven. The voices of the choir, combined with the warmth of the community gathering, made it a truly special occasion and a reminder of the joy of the season.\nTeam Christmas party\nTo round off the month, I hosted my team’s Christmas party to thank them for their hard work throughout the year. It’s been a demanding but rewarding year, and I am grateful to have such a dedicated team working alongside me to support Pembrokeshire.\nLooking Ahead\nIt has been a privilege to serve the people of Mid and South Pembrokeshire since July 2024, and I am looking forward to continuing to work hard for you in the year ahead. As we move into 2025, I will remain focused on the issues that matter most to our community, from improving healthcare access to supporting our rural economy and protecting our environment.\nWishing you and your loved ones a joyful Christmas and a peaceful New Year.\nBest wishes,\nHenry",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_why-i-m-standing-for-the-environment-food-and-rural-affairs-select-committee/content_24.html": "Why I'm standing for the Environment, Food and Rural Affairs Select Committeehenrytufnell1Oct 14, 20240 min read",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_news_page_4/content_18.html": "top of page\nNEWS\nJuly 2023 Newsletter\nWelcome back to my monthly newsletter! The rain may be coming down, but our support is only going up… This month, I’ve been knocking on...\nJune 2023 Newsletter\nWelcome back to my monthly newsletter here’s what the campaign team and I have been up to… On the Doorstep We have campaigned all over...\nMay 2023 Newsletter\nIt's been just over a month since I was selected as your Parliamentary candidate for Mid and South Pembrokeshire. First of all, I want to...\nbottom of page",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_pembrokeshire-herald-column-9-may-2024/content_20.html": "Pembrokeshire Herald Column - 9th May 2024\n- henrytufnell1\n- May 14, 2024\n- 3 min read\nThere are over 1,500 individual landfill sites recorded in Wales classed as operational, closed, or historic. A recent reportby Natural Resources Wales (“NRW”) found that there were more than 260 coastal landfill sites currently at risk of leaking into the marine environment as a result of coastal erosion, flooding and climate change. One of the main issues is the large number of unknowns and what the issues and impacts will be from the sites. NRW are already working to identify which sites pose a risk to the environment, and last year found that 89% of Welsh landfill sites had the potential to release chemical waste. The other large problem is that prior to the 1970s there was no requirement to keep records, no records in fact kept, and there was no permitting on landfill sites.\nOn the issue of waste and landfill, Pembrokeshire sits as an outlier in Wales and has been the top recycling county for three years in a row now – achieving a recycling rate of over 70%. Back in April 2019 it appeared that Pembrokeshire County Council would no longer need a landfill at Withyhedge due to their recycling rate effectively eliminating landfill waste. However, rather than this achievement resulting in any closure, the landfill site has instead become a dumping ground for waste from Cardiff and England. In 2022, the site was purchased by Dauson Environmental Group, with an operating company called Resources Management UK Ltd (RML) actively running the site. Following their purchase of the site there was an increase in the amount of volume of waste being deposited, albeit still in line with their permit granted by NRW. On a recent visit to the site, I was struck by the fact that no recycling activity takes place on the landfill – instead trucks unload waste which is simply deposited in the landfill.\nThe problem that landfills pose to the local communities that surround them has been put into sharp relief by the ongoing situation at the Withyhedge site. Since September 2023 the local population has had to put up with a foul odour emanating from the site, and a resolution has yet to be achieved. The odour is hydrogen sulphide and is being emitted in large quantities from the site due to a mixing of biodegradable waste and calcium sulphide (plasterboard). While it is unclear how this mixing has been allowed to happen (perhaps the wayward use of a skip on a building site), the situation demonstrates the level of complexity and unknowns surrounding landfill sites and their operation.\nTough regulation is crucial. While NRW have been slow to act on Withyhedge and poor in their communication with the public, they are now taking firmer action. They issued an enforcement notice in February in respect of one part of the site for compliance by 5 April, but while there was compliance it ultimately failed to stop the stink. An additional enforcement notice was then issued in respect of a separate section of the site with actions relating to gas management, further capping and improving interim cover arrangements, which requires compliance by 14 May (some actions in the notice have earlier compliance dates). It appears that the overfilling of an adjacent area meant odorous waste was simply transferred from one part of the site to another. I have been very clear with NRW that if the most recent enforcement notice is not effective in resolving the situation, then they must suspend new waste from coming on site. Furthermore, Pembrokeshire County Council are in the process of seeking a legal injunction to apply further pressure on the operating company, RML.\nAmid the enforcement notices and legal action, the local community are still suffering from the odour, with fears about the implications for public health. While the immediate action must be to Stop the Stink, in the longer term there has to be coordinated action taken by Government across Wales and the UK to address the environmental and public health risks posed by landfill sites.\nYou can read the column in the Pembrokeshire Herald on page 57 here",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_february-newsletter/content_22.html": "February 2024 Newsletter\n- henrytufnell1\n- Mar 7, 2024\n- 3 min read\nThe calm before the storm…\nGeneral Election\nIf the Prime Minister surprises the commentariat of Westminster by calling a 2 May election, then this will be my last newsletter before the election is called.\nNo matter what Rishi Sunak has said otherwise, the Tories have been preparing for May: changing the election finance limits, bringing forward the Spring budget to 6 March, speeding up their candidate selections, and increasing their direct mails and digital output. Rishi Sunak knows that he is running out of road. He has been losing by-election after by-election, and the right of his party is increasingly out of control, perhaps best encapsulated by the birth of PopCon or “Popular Conservatism”. A big loss in the local and mayoral elections in England on 2 May, followed by another defeat in Blackpool South, and then an increase in small boat crossings over the summer – this could all spell electoral wipe-out for the Tories in the autumn. Even an economic up-turn in the autumn would not stave off the narrative of an un-elected Prime Minister that bottled the opportunity to call a May election, just to cling onto power that bit longer, while our country remains without direction.\nSo hold onto your hats and get ready for a six-week whirlwind!\nCampaigning\nWe have been out knocking doors right across the county and thank you so much to all of you who have joined us – especially those that have come out for the first time. In addition to our in-person canvassing sessions, John Bramley has got the phone banking team running at full tilt on Saturday mornings. If you can join us out on the doorstep or on the phones, we would so be grateful for any help. We also need assistance with leaflet delivery, and there is a new batch of leaflets about to drop. Please contact Ben Levy on 07596 596351 to get involved.\nThe campaign is building, and it is very motivating to see everyone chipping in where they can – bring on the General Election!\nCommunity Action\nI was pleased to chair the public meeting at Crundale Hall to address the odour, environmental and public health concerns coming from the Withyhedge Landfill site. I was joined by representatives from Natural Resources Wales, Public Health Wales, Pembrokeshire County Council and the owner of the site, David Neal. Too often government agencies and public bodies fail to recognise who they are ultimately responsible to, and so it was incredibly important to allow the voice of the community to be heard.\nI spent a wonderful afternoon with the teams from Haverfordwest Community Garden and Tir Coed at the Havergardd Open Day. There was a full array of garden activities that included willow weaving, bird feeders and seed sowing – all with the sun shining and a delicious lunch! It was a great way to speak with members of the community that are not politically engaged and had given up all hope in the political process. I also visited Pembrokeshire People First with Jo Ambrose and met with their Citizen Champions. It was very inspiring to see all the work they do around the Learning Disability Charter and to hear about what they really need from their local MP. Finally, I took part in the opening of the brand-new McDonalds in Milford Haven – I am excited for my chicken selects dinner after our next canvassing session in Milford!\nPolicy\nLots of people have lost faith in this dying Tory Government in Westminster and are looking to Labour to provide that long term plan to get Britain’s future back. Ahead of the election our focus has turned to providing that long term vision for Pembrokeshire. As you may have seen from the fantastic boards that have gone up at the new campaign centre, the focus of our campaign will be to:\nDeliver growth in our local economy\nFix our broken immigration system\nBuild a modern local NHS\nSecure investment for green jobs in our county\nProvide opportunities for our young people\nWe are in the process of developing these pledges. Please get in touch if you would like to contribute.\nYou can keep up to date and help share what I am up to throughout the month by following me on Facebook, Twitter and Instagram.\nAs always, thank you for your support!\nVery best wishes,\nHenry Tufnell\nParliamentary Candidate for Mid & South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_march-newsletter/content_26.html": "March 2024 Newsletter\n- henrytufnell1\n- Apr 22, 2024\n- 4 min read\nIt was wonderful to see so many of you at the campaign launch earlier this month – thank you all for coming and being part of our movement to bring the change we need in Pembrokeshire.\nGeneral Election\nSo we won’t be having a 2 May Election… but this means Rishi Sunak is now in a desperate situation. A wipeout in the local, mayoral and police and crime commissioner elections on 2 May could leave him exposed to a leadership challenge, or potentially a summer election to fend off his own party; or, he could limp on to the Autumn in the hope that something shows up to give the Tories a boost; or, if they are still 20 points behind in the polls, he could wait right up to January 2025. The cost of all this prevarication, uncertainty and a seeming addiction to leadership elections has cost the taxpayer £8.2bn. It’s no wonder that people desperately want that general election and the opportunity for their voice to be heard. After nearly 20 years of a Tory MP in Pembrokeshire and 14 years of a failed Tory Government, it is time for change and a fresh start for Pembrokeshire.\nFirst Minister\nOn the topic of change, this month we saw Mark Drakeford formally stand down as First Minister of Wales. As I am learning fast, political life can be bruising and popularity fickle, so having examples of individuals who hold onto their principles and integrity even in the face of strong headwinds is inspiring. Mark navigated us through the pandemic while steering Wales to a stronger, fairer and greener future. He did this with real integrity and latterly during a period of deep personal anguish. I admire him hugely and hope that he will remain a standard-bearer for progressive values in our movement.\nI was delighted to congratulate Mark’s successor, Vaughan Gething, as the new leader of Welsh Labour. I look forward to campaigning with him to secure a UK Labour Government and have been in direct contact about the challenges facing residents here in Pembrokeshire.\nPort Funding\nIt was a pleasure to welcome Jo Stevens, our Shadow Secretary of State for Wales to Pembrokeshire this month. We visited the Milord Haven Port Authority (“the Port”) and discussed their plans to support the production of renewable energy. The Port plays a vital role in our energy production, with 20% of the UK’s energy currently coming through it. It was therefore deeply disappointing that earlier in the week the Tory Government had refused the Port’s application for a new green energy terminal in Pembroke Dock. The Port was overlooked even though it is the closest port to the Celtic Sea development, offers a heavy engineering skills base, and has strong support from Floating Offshore Wind developers. We are in danger of lagging behind international competition due to budget restrictions and thereby squandering a golden opportunity to regenerate our local economy. Labour’s plan to invest in clean home-grown power via our new publicly owned company – Great British Energy – can’t come soon enough.\nCommunity Action\nI continue to be dialogue with the local campaign group STOP the STINK over the ongoing situation at the Withyhedge Hedge Landfill site. I attended the County Council’s services overview and scrutiny committee on the issue, and remain hopeful that the 5 April deadline set by both the operator and Natural Resources Wales can be met. I was also out litter picking in Milford Haven with Milford Youth Matters and the team at McDonalds – it was good to see communities, businesses and organisations coming together for the benefit of the local community. I had an entertaining evening at Pembrokeshire College which was organised by their Learner Executive and CWBR Youth to explore how we unlock the potential of our community youth voice. It is critical that to provide opportunities to young people and to reduce the flow of outward migration, we have a strategy that is led by young people. Finally, it was good to meet up with the team at Redford Caravan Park, to hear about their exciting new developments, and to discuss the various challenges facing the tourism sector.\nCampaigning\nWe had a great talk from our Police and Crime Commissioner candidate, Philippa Thompson, at the AMM in Pembroke Dock. Philippa spoke about the importance of the Human Rights Act, and the protections and rights it affords us. She also set out the importance of having a Labour Police and Crime Commissioner supporting our party values and holding the Chief Constable to account. We are doing what we can to help the campaign and for those who want to get involved please contact Ben Levy on 07596 596351.\nThank you to those who helped with the development of the five pledges. All responses have been reviewed and we are in the process of distilling it down into a workable format to then be shared more widely. And finally, thank you to all those who have volunteered their time in other ways over the past month. Remember there is always a role for everyone whether leafleting, office administration, door-knocking, phone canvassing and digital campaigning.\nYou can keep up to date and help share what I’m up to throughout the month by following me on Facebook, Twitter and Instagram.\nIf you have any questions you’d like to ask me, please just reply to this email.\nTill next time\nHenry Tufnell\nParliamentary Candidate for Mid and South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_march-2025-newsletter/content_3.html": "March 2025 Newsletter\n- henrytufnell1\n- Mar 31\n- 6 min read\nAs March draws to a close and daylight saving begins, I am sure you will join me in looking forward to the lighter summer evenings! It has certainly been a busy month in Pembrokeshire and Westminster, and here’s a look at what I have been working on over the past few weeks.\nHolding Welsh Water to Account\nThe rising cost of water bills and the poor state of water infrastructure are serious issues facing households across Pembrokeshire. Since being elected, I have worked tirelessly to engage with Welsh Water and hold them accountable on concerns regarding sewage discharge, water quality, and rising bills. This month, I directly questioned their Chief Executive during a Select Committee evidence session in Parliament. I challenged the excessive bonus system in place, which is on top of the £892,000 pay package awarded to the CEO.\nI demanded that Welsh Water acknowledge its past failures and commit to immediate action to address issues with sewage discharge and service delivery. Vague promises are simply not enough when Welsh Water continues to fail the people of Wales.\nI have also been working closely with our brilliant local campaign group, the Cleddau Project, which has been tirelessly raising these concerns with Welsh Water. I urged the Chief Executive to recognise the hard work and dedication of local campaigners who are fighting to protect our rivers.\nOur community deserves clean, reliable water, and I will continue to hold Welsh Water accountable.\nImproving Health Care in Pembrokeshire\nEnsuring our healthcare system works for local people remains a top priority. I have been holding the local health board to account, pushing for better access to both general healthcare and NHS dentistry.\nFollowing my recent video highlighting concerns about the booking system at St Thomas’s Surgery, I’m pleased to share that changes have now been made. After meeting with the practice team, I have been assured that telephone lines will now open from 8 AM for appointment bookings, making the system more accessible for patients.\nA huge thank you to everyone who reached out to share their experiences—your feedback has been invaluable. Please let me know if you’ve noticed an improvement or if there are still issues that need addressing.\nThere’s still more to do, particularly in tackling gaps in NHS dental provision, and I will keep working with the health board to push for real improvements across Pembrokeshire. More updates to come on this.\nFighting for the Future of the Cleddau River\nThis month, I chaired a crucial Cleddau Project panel event to discuss the worsening state of the Cleddau River. The event brought together key stakeholders, environmental experts, and community voices to address the urgent challenges facing our river - particularly in light of recent reports declaring it the worst-performing protected river in Wales.\nThe discussion, hosted at Haverfordwest Rugby Club, attracted over 150 concerned residents who heard directly from an expert panel, including representatives from Afonydd Cymru, Welsh Water, NRW, Cardiff University, and First Milk. The conversation covered pollution sources, enforcement failures, and potential solutions to improve the river’s health.\nSpeaking after the event, I made it clear that this is not just a talking exercise—we need real action. The Cleddau is a vital natural resource, and the insight shared by our expert panel and the local community reinforced the importance of tackling pollution at its source. I will be raising this issue in Parliament and pushing for stronger regulations, better enforcement, and greater accountability from those responsible.\nThe open-floor Q&A session highlighted public frustration with the lack of enforcement against illegal discharges, the impact of agriculture and industry on pollution, and the failure of regulatory bodies to act decisively.\nThis event was an important step, but it must be followed by action. The Cleddau deserves better, and I will continue to work with all stakeholders to ensure its restoration.\nCelebrating St David’s Day\nThe month began with a fantastic St David’s Day celebration, and I had the honour of attending the St David’s Day parade. This was part of a whole weekend of celebrations across St David’s, organised brilliantly by our local community.\nLater in the month, I was invited to a special St David’s Day reception at Downing Street, and I was pleased to bring along Dawn from Sandy Bear charity as my guest of honour to recognise the incredible work they do in our community. Sandy Bear provides essential bereavement support for children and families, offering guidance, counselling, and a compassionate space for those navigating loss. Their work is invaluable, and I was proud to highlight their contributions at such a significant event.\nSchool and Business Visits\nI was truly delighted to visit Ysgol Penrhyn Dewi and spend time with the exceptional staff and students there. I had the opportunity to chat with the pupils about their views on the local environment and their aspirations for the future. It’s always a privilege to hear firsthand from the next generation about their hopes and dreams for what lies ahead.\nSeparately, I visited the Princes Gate bottling facility, now owned by Nestlé, where I learned about their operations and discussed their environmental impact, sustainability initiatives, and commitments to local employment. Businesses like this play a crucial role in our economy, and I will continue to ensure that they operate responsibly and contribute positively to our community.\nThis month, I also had the privilege of visiting Providence Training in Neyland to see firsthand how they’re helping ex-steelworkers from Port Talbot retrain and build new careers. From accredited Health and Safety courses to interview support and skills development, their work is making a real difference. Speaking to those currently training, it’s clear how much they value the opportunities provided. It’s fantastic to see local training providers thriving and equipping people with the skills they need for the future.\nCommunity Sport\nI am so passionate about access to sport and the positive impact that physical activity has not just on our physical health, but our mental health too.\nI was thrilled to take part in the local park run at Haverfordwest this month (although the competitor in me was disappointed to get 2nd place!) It’s a fantastic weekly event, organised by brilliant volunteers. Whether you walk, jog or run, I would really recommend giving it a go – it's a wonderful community event. (https://www.parkrun.org.uk/haverfordwest/)\nIt’s fantastic to see the work being done at Pembroke & Pembroke Dock Amateur Boxing Club, where they’re leading the way in inclusive coaching. Club chair/coach Chris McEwen has made it his mission to shift societal attitudes towards disability, ensuring everyone has access to high-quality opportunities to get active. His efforts are playing a key role in fostering healthier, more active communities across Pembrokeshire, and it’s inspiring to see how the club is making a positive impact on both participants and the local community. They have been recognised by UK Coaching which is a fantastic development!\nThere are so many incredible organisations across Pembrokeshire providing accessible sports and fitness activities. I’ve pulled together a few highlights from across the county that are well worth checking out:\nStreet Surgeries\nGetting out and speaking to residents is a key part of my role. This month, I knocked on doors in Haverfordwest, gathering casework and hearing directly from people about the issues that matter most to them. If I missed you this time, don’t worry—I’ll be out and about again soon.\nCrown Estate\nI know many residents and local businesses are deeply concerned about the ongoing situation with the RNLI lifeboat station at St Justinian's.\nEnsuring that our coastal safety services are well-supported is essential for our local environment, and for our local economy. The Crown Estate leases this site to the RNLI, and so I have met with the Crown Estate and will continue to work with all impacted parties to find the best solution.\nWestminster and Beyond\nEmployment Rights Bill\nI continue to support efforts to strengthen workers’ rights, ensuring fair conditions and protections for employees across the UK. The Employment Rights Bill is a key piece of legislation aimed at improving job security, tackling unfair employment practices, and enhancing workplace protections. I will be following its progress closely and working to ensure that it delivers real benefits for workers here in Pembrokeshire. What will this mean for you?\nFairer Pay - Strengthening sick pay, ensuring fair wages, and protecting your tips.\nSupport for Families - New paid leave for miscarriage and stronger protections for parents.\nEnding exploitation – Cracking down on unfair contracts and ‘fire and rehire’ tactics.\nWelsh Affairs Committee – The Future of Farming\nAs a member of the Welsh Affairs Committee, I have been engaging with farmers and industry experts to discuss the challenges facing Welsh agriculture. It is vital that the voices of farmers are heard in Westminster. I remain committed to pushing for policies that support our rural economy, safeguard food security, and ensure a sustainable future for Welsh farming.\nFarming in Wales in 2025: Challenges and Opportunities – Have Your Say!\nOur call for evidence on the future of farming in Wales is closing soon, and this is a crucial chance for local farmers to share their views. If you’re a farmer, landowner, or involved in the agricultural sector, please share your contribution before Monday 14 April 2025: https://committees.parliament.uk/work/8990/farming-in-wales-in-2025-challenges-and-opportunities/\nThe outcome of this inquiry will help shape policies that impact Welsh farming, so it’s important that voices from Pembrokeshire are heard loud and clear. I will continue to stand up for our local farming community and ensure that their concerns are taken seriously in Westminster. If you have thoughts on any of these issues, please do get in touch.\nThat’s a wrap for March! As always, if you have any issues you’d like to raise, please don’t hesitate to get in touch. Whether it’s healthcare, local services, or community concerns, I’m here to help.\nBest wishes,\nHenry",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_december-newsletter/content_16.html": "December 2023 Newsletter\n- henrytufnell1\n- Jan 11, 2024\n- 3 min read\nUpdated: Jan 15, 2024\nWelcome back to my monthly newsletter!\nMark Drakeford stands down\nI want to begin by paying tribute to our First Minister, Mark Drakeford, who announced that he will be standing down in March. Mark has been a tireless public servant, who has served with great distinction as First Minister for the past 5 years. The Welsh Government led by Mark has delivered relentlessly to improve the lives of the most vulnerable in Wales, and for that he has my utmost respect and admiration. I can safely say that his speech to the Welsh Labour conference earlier last year was one for the ages and a real inspiration.\nCovid Corruption\nAn estimated £7.2bn was lost in fraud from Covid support schemes from business loans and grants, furlough and ‘eat out to help out’, yet again showing the cost to the taxpayer of this incompetent Tory Government. If that was not enough, the Government suspended its usual procurement processes and introduced a highly secretive VIP “fast lane” for procurement of goods including protective equipment. The result was that it then had to write off £8.7bn that it had spent on defective and overpriced PPE. The extent to which cronyism had infiltrated the core administration of Government was truly shocking. I was therefore heartened to see Rachel Reeves reaffirm her commitment to appointing a Covid corruption commissioner and giving a mandate to do what it takes to chase down those who have ripped off the taxpayer and claw back every penny that we can.\nCommunity Action\nIt was a great pleasure to meet with Barry John and get a tour of the VC Gallery in Pembroke Dock. Barry and his team do such important work in tackling social isolation, building community cohesion, and encouraging self-expression for veterans and those in the community. There was plenty of excitement over the festive season – attending the Milford Haven lantern parade, the Pembroke Christmas fayre, buying a Christmas tree from Pembrokeshire Christmas Trees and subbing in for Jo as quiz master at the Neyland branch monthly quiz! As always, the Neyland branch was raising money for a local charity at its quiz, and it was very powerful to hear from Forget Me Knot Pembrokeshire about all the work they do supporting those living with dementia in Pembrokeshire.\nCampaign trail\nAs ever, we have been out across Pembrokeshire knocking on doors. People are crying out for change, and we must do everything we can between now and polling day to convince them that Labour can deliver that change. A big thank you to all those who joined us out on the doorstep – with the winter solstice behind us we can look forward to some longer days!\nOur campaign office is now ready to go, so please drop by and visit us for a cup of tea at Bridge House, Swansquare, Haverfordwest, SA61 2AN. It is looking a bit austere, so any help with interior decorations would be greatly appreciated.\nThe phone banking team is back up and running and our team leader, John Bramley, is keen for volunteers so please let him know if you have an hour or so spare to make some phone calls. Our digital team is also operational, so please contact Jo Ambrose to get involved with the campaign online. Ben Levy will pass you on if you contact him on 07596 596351 or email ben_levy@labour.org.uk.\nFinally, I would like to say a big thank you to Dan Warder and the team at Top Joes pizza for hosting a brilliant evening at the beginning of December. We were very lucky to be joined by Jo Stevens, MP for Cardiff Central and Shadow Secretary of State for Wales, who was out with us on the doorstep in Narberth that afternoon and then delivered a rousing speech. Thank you also to both Pratibha Kanse and Kirsty Jones who have both become incredibly effective organisers of these fundraising events. Please keep an eye out for future dates.\nYou can keep up to date and help share what I am up to throughout the month by following me on Facebook, Twitter and Instagram.\nAs always, thank you for your support!\nVery best wishes,\nHenry Tufnell\nParliamentary Candidate for Mid & South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_news_categories_news/content_6.html": "top of page\nNEWS\nJuly 2023 Newsletter\nWelcome back to my monthly newsletter! The rain may be coming down, but our support is only going up… This month, I’ve been knocking on...\nJune 2023 Newsletter\nWelcome back to my monthly newsletter here’s what the campaign team and I have been up to… On the Doorstep We have campaigned all over...\nMay 2023 Newsletter\nIt's been just over a month since I was selected as your Parliamentary candidate for Mid and South Pembrokeshire. First of all, I want to...\nbottom of page",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_february-2025-newsletter/content_4.html": "February 2025 Newsletter\n- henrytufnell1\n- Feb 28\n- 7 min read\nAs February comes to a close, I want to update you on the work I’ve been doing in across Pembrokeshire and in Westminster this month.\nThe Health Board\nI met with both the Chair and the CEO of the Hywel Dda healthboard to address ongoing healthcare access issues and to explore improvements in local health services. I am raised concerns about the failings in primary care and the need for a focus on best practice across GP surgeries in Pembrokeshire as well the need for adequate funding. The healthboard controls the funding of primary care and many practices such as Argyle Medical Group in Pembroke Dock and St Thomas’s surgery in Haverfordwest are in dire need of improvement.\nEarlier this month I saw the vast difference between two GP surgeries located within 100 meters of each other. On two consecutive mornings I attended both St Thomas’s surgery and Winch Lane in Haverfordwest. At St Thomas’s I saw a chaotic outdoor queuing system with elderly and vulnerable people waiting outside in the cold with no guarantee of an appointment, while over the road at Winch Lane surgery the system appeared to be working well. It is an absurd situation and the healthboard need to empower local GP leaders to ensure that there is cross working and collaboration to improve access for patients.\nBoth the Chief Executive and Chairman have admitted the need for a cultural shift in management to respond to the scale of the crisis in Pembrokeshire; and they assured me that a plan would be implemented to tackle this. I will keep up the pressure and will be meeting with the Chief Executive again in the coming weeks.\nSocial Care\nIt is impossible to talk about healthcare in Pembrokeshire without talking about social care and it was therefore really positive to meet formally with the Paul Sartori Foundation. I learned about their exceptional work in providing palliative care services as well as the challenges they face particularly with the level of demand for their services across the county. Their dedication to supporting individuals and families during challenging times is truly remarkable.\nPembrokeshire Economy\nBoosting local job creation and bringing economic growth to Pembrokeshire are critical to tackling social deprivation and child poverty. It was therefore a privilege to see first-hand the fantastic work being done locally by both businesses and educational institutions.\nAs always at Pembrokeshire College, I had insightful discussions with students about their aspirations, the challenges they face, and how we can create more opportunities for them within our community. The college is equipping Pembrokeshire’s talented young people with skills for the future, in things like renewable energy engineering and electric vehicle technology. I also visited Haverfordwest High VC and spoke with a group of 6th form students about their career ambitions, politics and of course - Pembrokeshire. I want to make sure that they can look forward to bright futures and good jobs in their home county.\nI had my first meeting with W B Griffiths & Son, a family-run construction company, and learnt about their brilliant range of apprenticeship programmes. We discussed ways to support and expand opportunities for our young workforce. It is so important that there are good, well-paying job opportunities for them in the county and prioritising local, green job-creation is key to achieving local economic growth.\nI visited GD Harries – a construction material supplies and civil engineering company. We discussed their operations, and how they can contribute to Floating Offshore Wind developments, potentially bringing more of the jobs and investment we need to Pembrokeshire.\nWe all know how important connectivity is for businesses, and for residents, in today’s digital age. That is why I met with the Openreach Director for Wales. We had a productive discussion about improving fibre broadband infrastructure in Pembrokeshire. If you are having any specific issues with access to broadband, please contact me directly and I’ll do all that I can to help.\nSupporting constituents\nMy team and I have been diligently assisting constituents with a range of issues, from healthcare access to housing concerns. I held surgeries in Milford Haven and Pembroke Dock providing constituents with the opportunity to discuss their concerns. These sessions are invaluable and ensuring constituents receive the support they need is our top priority. If there is anything you need help with, please do not hesitate to contact my office. Please make sure to include your full name, address, and contact details as well as any relevant reference numbers to your case. Since the General Election in July 2024, we have closed 3204 pieces of casework.\nAcross Pembrokeshire there are so many incredible organisations working hard to improve the lives of others. This month I hosted the first of my quarterly Poverty Action Roundtable’s - because tackling the issues around poverty requires collective effort. Our group included stakeholders from the third and public sector, as we committed to working together to do everything that we can to share our strategies and initiatives to support the most vulnerable in our community.\nTown and Community Councils\nTown and Community councils play a vital role in our community, and I am committed to working with them in a “Team Pembrokeshire” approach. I was therefore pleased to meet with the Angle Community Council to discuss their concerns around connectivity and flooding. They also held a Q&A event with the local community, which was well attended and facilitated a good and frank discussion about the many challenges facing our county. I also attended the ‘Feed the Community’ event in Haverfordwest organised by Haverfordwest Town Council. The event provided help to those in need within our community and a platform for many organisations to showcase their vital work. It was heartening to see the local community come together in solidarity. Over the coming weeks and months, I will be meeting with more of the the brilliant Town and Community councils that are working hard across Pembrokeshire.\nArts, Culture, and Sport\nEnsuring everyone can access and enjoy the arts, culture and sport in Pembrokeshire is something I am passionate about.\nI was thrilled to be invited to the Torch Theatre’s annual Schools Shakespeare Festival. A huge well-done to all the local schools who participated – it was a fantastic night of entertainment. Access to the arts is essential for children to develop in confidence, tackling issues of anxiety and mental health, and equipping them with skills for life. So, I was delighted to see the Welsh Labour Government announce an extra £4.4m of funding for the arts and cultural sector. This crucial support will help to protect our theatres, cultural spaces, and museums, so they can continue to play a central role in our education, community engagement, and tourism.\nThis funding announcement included additional support for grassroots sports Local sports clubs are at the heart of our communities, bringing people together and promoting active, healthier lifestyles. In Parliament this week, I highlighted the fantastic work of Haverfordwest County AFC does in its community. It facilitates football sessions for local schools, providing healthy breakfasts and lunches for all participants, and runs walking football groups for all ages. I asked Sports Minister Stephanie Peacock what this Labour government is doing to support the work of brilliant local clubs like Haverfordwest County AFC in making sport more accessible, and I was delighted that she joined me in wishing the team there the best for the rest of the season!\nI’d like to encourage you all to head down to Bridge Meadow Stadium in Haverfordwest to support Haverfordwest County at their next match at home on Friday 21st March.\nWestminster & Beyond\nIn Parliament, I’ve been actively working to represent Pembrokeshire:\nAttending EFRA and Welsh Affairs Committee meetings\nEnsuring that rural and Welsh issues are prominently addressed, I contributed to discussions on agriculture, environmental policies, and the unique challenges faced by our communities.\nAs we look ahead to next month, I will have the opportunity to cross-examine Dwr Cymru as they will appear before the EFRA Select Committee on March 11th. I know it is of great concern to all of us in Pembrokeshire the alarming amount of sewage dumped in our beautiful waters. I’ve been engaging with the Cleddau Project on this over the last year, and I will be putting forward serious questions to Dwr Cymru regarding sewage dumping. I know many constituents will also be concerned about their water bills and I plan to address this issue in the evidence session too.\nJoining the Project and Infrastructure APPG launch:\nThis month I also launched a new All-Party Parliamentary Group in Parliament focused on project delivery for infrastructure. The aim of this APPG is to promote best practice for our national infrastructure projects; the building of new schools, hospitals, roads etc...\nWe will be working with experts from across the world to embrace best practice. I want to make sure that our national infrastructure projects are delivered in the best, most efficient way, and most cost-effective way – which will create good skilled jobs and boost economic growth and development in Pembrokeshire.\nContinuing to work on the Crown Estate Bill:\nThe Crown Estate plays a crucial role in managing the UK’s land and sea assets, and it’s vital that it works in the best interests of communities like ours in Pembrokeshire. That’s why I voted YES on the Crown Estate Bill—because we need to ensure its decisions help tackle climate change, boost regional economies, and support businesses with the skills they need to thrive.\nFloating Offshore Wind presents an incredible opportunity for Pembrokeshire, but we must make sure the Crown Estate actively supports this potential. That’s why I put forward an amendment to ensure that in every decision it makes, the Crown Estate considers:\nNet zero targets – ensuring we make real progress towards tackling climate change.\nRegional economic growth – making sure investment benefits local communities, not just big corporations.\nResilience against risks & security threats – safeguarding our future energy security and economic stability.\nThis is about sustainable growth and a stronger future for the UK. We need this to happen as soon as possible. I’ve been assured that the spirit of my amendment is included in the bill.\nYou can watch my video to find out more. ⬇️\nLooking Ahead\nAs we move into March, I want to wish everyone in Pembrokeshire a Happy St David’s Day!\nThis is a fantastic time to celebrate Welsh culture, our heritage, and the incredible community we are all part of. I look forward to continuing my work and seeing many of you at local events in the coming weeks.\nIf you need support or want to raise any concerns, please don’t hesitate to get in touch.\nBest wishes,\nHenry Tufnell MP",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_august-newsletter/content_32.html": "August 2023 Newsletter\n- Fergus Franks\n- Sep 4, 2023\n- 2 min read\nUpdated: Jan 15, 2024\nWelcome back to my monthly newsletter. Here’s what the campaign team and I have been up to!\nPembrokeshire County Show\nFirst of all I’d like to thank everyone who worked on making our stand at the Pembrokeshire County Show a huge success and thank you to all our Councillors and Senedd Members who came to show their support. We made a great showing for Labour and it was a great pleasure to talk to members and voters who visited the tent. I was very proud to see us showcase the very best Labour values and working together to save the day when strong winds threatened to launch the marquee into the sky!\nI had very productive talks with lots of great organisations. I listened to their perspective on Pembrokeshire and shared the Labour plan. Notably discussions with the NFU were robust but positive. It was also a pleasure to talk to the First Minister about our plans to win in Pembrokeshire. Checkout Cllr Josh Beynon and myself racing on the rowing machines!\nOn the Doorstep\nAs always, our work talking to voters to find out their priorities continued in August. A big thank you to all those who came out in a very busy month when we had lots of organising for the County show as well. We were all over the county from St Davids to Kilgetty enjoying the sometimes erratic August weather. People we spoke to were rightfully concerned about the continued rise in the cost of living, and after 13 years of Tory failure cynicism is widespread. That’s why its so important we go out, have face to face conversations and show that we – ordinary Pembrokeshire residents - believe change is possible and believe Labour can deliver it.\nPort End of the Stick\nThis month I met the team at Dragon LNG to understand the import terminal and hear about their work towards net zero. I also had discussions with the Port Authority and their plans for regeneration and what more can be done to transform the Pembrokeshire economy. Political leadership will be key in delivering a just transition and to maximise the benefits for people living in Pembrokeshire.\nTill next time...",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_news-article/content_27.html": "May 2023 Newsletter\n- Fergus Franks\n- Jul 13, 2023\n- 3 min read\nUpdated: Jan 15, 2024\nIt's been just over a month since I was selected as your Parliamentary candidate for Mid and South Pembrokeshire. First of all, I want to thank all of the members who participated in the Parliamentary selections, and to pay credit to the other candidates who were all such strong contenders.\nIt's truly an honour to be selected as your candidate for the next General Election, and I promise to do everything I can to win this seat back and return a Labour government in Westminster.\nAs your Parliamentary candidate, I want to keep you up to date with my campaigning on the doorstep and in the community. I'll be sending out a monthly newsletter so you can know what the campaign team in Mid and South Pembrokeshire and I are doing.\nOn the Labour Doorstep\nSince being selected, I've been out campaigning regularly on the doorstep with a fantastic team of volunteers. Time and time again I hear the same messsage: residents are really feeling the pressure of the cost of living crisis, and after 13 years of the Tories they don't think that anything is going to change. Only a Labour government in Westminster can tackle the country's long-term problems for the better, and if elected as your MP, I'll put Pembrokeshire at the forefront of Britain's future.\nGreen Jobs and the Green Economy\nIt was a pleasure to speak to Julie James and Lee Waters MS, Minister and Deputy Minister for Climate Change in the Welsh Government. It was also great to meet Ed Miliband, Shadow Secretary of State for Climate Change, on the doorstep, and to make the positive case for Pembrokeshire at the centre of Britain's climate strategy.\nA net zero carbon strategy is not just about protecting Pembrokeshire - one of the most beautiful places in the world - from climate change. It's also about bringing well paid green jobs back to Pembrokeshire in renewable energy and conservation. For too long, Pembrokeshire has been held back by Tory MPs refusing to work with a Welsh Labour government in order to score short term political victories. If elected as your MP, I'll work with your Welsh Labour government and together we'll unlock the full potential of Pembrokeshire.\nYou can read more about Labour's green and digital future here.\nOut in the community\nOver the past few weeks I've joined Joyce Watson MS at the Haverfoodfest, sampling food and speaking to local businesses. I was also at the Pilgrims Fayre St Davids with Eluned Morgan, celebrating the relationship between saints and the communities of St Davids and Wexford.\nCommunity events like these are the lifeblood of Pembrokeshire. If there are events in your area, do let me know as I would like to come along and meet as many people as possible and listen to how we can help our community thrive.\nThat's all for now...\nTo keep regularly up to date with what I'm doing you can follow me on Twitter, Instagram, or on Facebook.\nIf you have any questions you'd like to ask me, do get in touch by replying to this email. Lastly, my thanks to all those who have volunteered their time to campaign. It's only through your support that we can win Pembrokeshire back from the Tories. If you're interested in helping out but not sure how, drop me an email and a member of the campaign team will be in touch.\nYours,\nHenry Tufnell\nParliamentary Candidate for Mid and South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_summer-newsletter/content_21.html": "August 2024 Newsletter\n- henrytufnell1\n- Aug 26, 2024\n- 3 min read\nWelcome back to my newsletter since being elected as your member of parliament!\nFirstly, can I say a big thank you to everyone who has supported me and wished me well since my election as your member of parliament. I am excited to continue working with communities across Mid and South Pembrokeshire and having the privilege of being your voice in parliament. I will do everything I can to bring about lasting positive change to our area.\nSince I was elected, it’s been a complete whirlwind in setting up my constituency office and employing staff. I apologise if it has taken me a little longer than usual to get back to you, I would like to thank you all for your patience whilst I bring together the remainder of my new team. I have two posts left to fill in my constituency office, and if you or someone you know may be interested please do have a look at the following job adverts: Constituency Assistant https://www.w4mpjobs.org/JobDetails.aspx?jobid=94053 and Constituency Support Manager: https://www.w4mpjobs.org/JobDetails.aspx?jobid=94008\nIn parliament\nIn parliament, it’s been a busy time with the new Labour government hitting the ground running straight away with a packed parliamentary agenda. I have been working hard to put Pembrokeshire back on the map and at the heart of government policy.\nFor communities across the county, Floating Off-Shore Wind (FLOW) remains a huge economic opportunity for our county. To do this, we have to have a fair and just transition to renewables that also supports the local supply chain through investment, skills and infrastructure. I have been working with stakeholders such as Pembrokeshire Coastal Forum, the Port of Milford Haven and the Crown Estate to name a few. I have raised the issue twice in the House of Commons and the Minister Michael Shanks MP referenced how I kept collaring him in the library!\nIn the constituency\nBy far the best part of the job is getting out and about and meeting with local people working hard for our community. Since the election, I’ve met with the National Farmers Union, Pembroke Dock Boxing Club, PLANED, Pembrokeshire County Council, Great Western Rail and Pembroke Dock Town Council, to name just a few. Pembrokeshire has a lot to offer whether that’s in terms of our fantastic businesses or the people that make our county great. I have been campaigning to ensure that our county is better connected and I have been pleased to see some progress with GWR around getting a direct train from Pembrokeshire to London Paddington from next year. There is a lot of work to do in our county and I’m pleased to be working with communities to make it happen.\nNext month\nSeptember is set to be a busy month, as parliament returns from the summer recess on September 5th. When I return to Westminster, I plan on raising with ministers the need for more investment in Pembrokeshire and the untapped potential we have when it comes to our skills, economic fortunes, and prosperity. This month will also see MPs placed on select committees and All-Party Parliamentary Groups (APPG’s) which enable MP’s to scrutinise and raise important issues. I will keep constituents abreast with all my parliamentary activity across my social media channels.\nLastly, if you are a constituent, please do contact me on henry.tufnell.mp@parliament.uk and my team and I would be delighted to help.\nYours,\nHenry Tufnell MP\nMember of Parliament for Mid and South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_privacypolicy/content_5.html": "Privacy Policy\nLast updated: February 28, 2023\nThis Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.\nWe use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.\nInterpretation and Definitions\nInterpretation\nThe words of which the initial letter is capitalised have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.\nDefinitions\nFor the purposes of this Privacy Policy:\n-\nAccount means a unique account created for You to access our Service or parts of our Service.\n-\nAffiliate means an entity that controls, is controlled by or is under common control with a party, where \"control\" means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority.\n-\nCompany (referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to Henry Tufnell.\n-\nCookies are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses.\n-\nCountry refers to: United Kingdom\n-\nDevice means any device that can access the Service such as a computer, a cellphone or a digital tablet.\n-\nPersonal Data is any information that relates to an identified or identifiable individual.\n-\nService refers to the Website.\n-\nService Provider means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used.\n-\nUsage Data refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).\n-\nWebsite refers to Henry Tufnell, accessible from http://www.henrytufnell.com\n-\nYou means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.\nCollecting and Using Your Personal Data\nTypes of Data Collected\nPersonal Data\nWhile using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:\n-\nEmail address\n-\nFirst name and last name\n-\nPhone number\n-\nAddress, State, Province, ZIP/Postal code, City\n-\nUsage Data\nUsage Data\nUsage Data is collected automatically when using the Service.\nUsage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.\nWhen You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.\nWe may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.\nTracking Technologies and Cookies\nWe use Cookies and similar tracking technologies to track the activity on Our Service and store certain information. Tracking technologies used are beacons, tags, and scripts to collect and track information and to improve and analyze Our Service. The technologies We use may include:\n-\nCookies or Browser Cookies. A cookie is a small file placed on Your Device. You can instruct Your browser to refuse all Cookies or to indicate when a Cookie is being sent. However, if You do not accept Cookies, You may not be able to use some parts of our Service. Unless you have adjusted Your browser setting so that it will refuse Cookies, our Service may use Cookies.\n-\nWeb Beacons. Certain sections of our Service and our emails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an email and for other related website statistics (for example, recording the popularity of a certain section and verifying system and server integrity).\nCookies can be \"Persistent\" or \"Session\" Cookies. Persistent Cookies remain on Your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your web browser. Learn more about cookies on the Free Privacy Policy website article.\nWe use both Session and Persistent Cookies for the purposes set out below:\n-\nNecessary / Essential Cookies\nType: Session Cookies\nAdministered by: Us\nPurpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.\n-\nCookies Policy / Notice Acceptance Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies identify if users have accepted the use of cookies on the Website.\n-\nFunctionality Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website.\nFor more information about the cookies we use and your choices regarding cookies, please visit our Cookies Policy or the Cookies section of our Privacy Policy.\nUse of Your Personal Data\nThe Company may use Personal Data for the following purposes:\n-\nTo provide and maintain our Service, including to monitor the usage of our Service.\n-\nTo manage Your Account: to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user.\n-\nFor the performance of a contract: the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.\n-\nTo contact You: To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.\n-\nTo provide You with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.\n-\nTo manage Your requests: To attend and manage Your requests to Us.\n-\nFor business transfers: We may use Your information to evaluate or conduct a merger, divestiture, restructuring, reorganization, dissolution, or other sale or transfer of some or all of Our assets, whether as a going concern or as part of bankruptcy, liquidation, or similar proceeding, in which Personal Data held by Us about our Service users is among the assets transferred.\n-\nFor other purposes: We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.\nWe may share Your personal information in the following situations:\n-\nWith Service Providers: We may share Your personal information with Service Providers to monitor and analyze the use of our Service, to contact You.\n-\nFor business transfers: We may share or transfer Your personal information in connection with, or during negotiations of, any merger, sale of Company assets, financing, or acquisition of all or a portion of Our business to another company.\n-\nWith Affiliates: We may share Your information with Our affiliates, in which case we will require those affiliates to honor this Privacy Policy. Affiliates include Our parent company and any other subsidiaries, joint venture partners or other companies that We control or that are under common control with Us.\n-\nWith business partners: We may share Your information with Our business partners to offer You certain products, services or promotions.\n-\nWith other users: when You share personal information or otherwise interact in the public areas with other users, such information may be viewed by all users and may be publicly distributed outside.\n-\nWith Your consent: We may disclose Your personal information for any other purpose with Your consent.\nRetention of Your Personal Data\nThe Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.\nThe Company will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.\nTransfer of Your Personal Data\nYour information, including Personal Data, is processed at the Company's operating offices and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.\nYour consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.\nThe Company will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.\nDelete Your Personal Data\nYou have the right to delete or request that We assist in deleting the Personal Data that We have collected about You.\nOur Service may give You the ability to delete certain information about You from within the Service.\nYou may update, amend, or delete Your information at any time by signing in to Your Account, if you have one, and visiting the account settings section that allows you to manage Your personal information. You may also contact Us to request access to, correct, or delete any personal information that You have provided to Us.\nPlease note, however, that We may need to retain certain information when we have a legal obligation or lawful basis to do so.\nDisclosure of Your Personal Data\nBusiness Transactions\nIf the Company is involved in a merger, acquisition or asset sale, Your Personal Data may be transferred. We will provide notice before Your Personal Data is transferred and becomes subject to a different Privacy Policy.\nLaw enforcement\nUnder certain circumstances, the Company may be required to disclose Your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).\nOther legal requirements\nThe Company may disclose Your Personal Data in the good faith belief that such action is necessary to:\n-\nComply with a legal obligation\n-\nProtect and defend the rights or property of the Company\n-\nPrevent or investigate possible wrongdoing in connection with the Service\n-\nProtect the personal safety of Users of the Service or the public\n-\nProtect against legal liability\nSecurity of Your Personal Data\nThe security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.\nChildren's Privacy\nOur Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under the age of 13. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 13 without verification of parental consent, We take steps to remove that information from Our servers.\nIf We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.\nLinks to Other Websites\nOur Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.\nWe have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.\nChanges to this Privacy Policy\nWe may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.\nWe will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.\nYou are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.\nContact Us\nIf you have any questions about this Privacy Policy, You can contact us via our form.",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_pembrokeshire-herald-column-august-2023/content_36.html": "Pembrokeshire Herald Column - 4th August 2023\n- Fergus Franks\n- Oct 3, 2023\n- 2 min read\nUpdated: Oct 5, 2023\nIt is an enormous honour and privilege to have been selected by local Labour Party members to be Welsh Labour’s Parliamentary Candidate for Mid & South Pembrokeshire at the next general election.\nI live just outside St Davids, but I grew up in a farming family and have spent many Easters lambing and many summers doing the harvest. Professionally, I trained and practised as a barrister, specialising in healthcare, public and employment law, before leaving to work as an organiser for a grassroots trade union that helps cleaners campaign for better pay and working conditions. My values are hard work, community and caring for others. I am committed to Pembrokeshire and want to be an MP that is embedded within our local community, using my skills to fight for a kind, caring and compassionate society where everyone is valued.\nI've been out campaigning regularly on the doorstep with a fantastic team of volunteers, and we have been hearing the same message: people in Pembrokeshire are really feeling the pressure of the cost-of-living crisis. After 13 years of Tory government and nearly 20 years of a Pembrokeshire Tory MP, there is a clear sense of anger and frustration. And they have every right to be angry when the economic record of this Tory Government is so dire: real average weekly earnings are stuck where they were in 2005, while mortgage rates are going up and working people are saddled with the highest tax burden for a generation.\nWe must reverse this cycle of economic decline. Our heavy industry, once dominated by the oil industry, is lacking the leadership that we need from the UK Government as we transition to renewable energy. Our young talent is too often forced to leave the county in search of other career opportunities, and priced out by an inflated housing market. On tourism, we have a world leading coastline with an abundance of natural beauty, but that sector should be offering people long and rewarding careers, rather than seasonal, low-paid and insecure work. Finally, our agricultural sector is being forced to grapple with botched Tory trade deals that seek to make Welsh farmers uncompetitive.\nAs your Labour MP, I would stand up for Pembrokeshire and work alongside our Labour Senedd members and local Labour councillors to address the problems we face – both as a local community and as a wider society. Labour’s agenda is bold: economic competency, a new deal for working people, climate leadership, a commitment to locally sourced and sustainable food, a removal of export barriers, and trade standards which we can be proud of. A Labour Government in Westminster can and will make a difference. Above all, however, we recognise the importance of cooperation and we are prepared to reach out across traditional party lines. I am ambitious for Pembrokeshire and believe that together we can achieve great things.\nIt is time for change – both in Westminster, and in Pembrokeshire.\nYou can read the article in the Pembrokeshire Herald on page 66 here",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_pembrokeshire-herald-column-3rd-november-2023/content_30.html": "Pembrokeshire Herald Column - 3rd November 2023\n- henrytufnell1\n- Nov 7, 2023\n- 3 min read\nHousing is a hot issue for many people in Pembrokeshire. Not only is it becoming more and more difficult for first-time buyers to get on the housing ladder, but there are also challenges in social housing.\nWe have a social housing waiting list of around 5,000 households, which has seen an increase of more than 50% since 2018. In Wales, since March 2020 the Labour government has continued to take a ‘no-one left out’ approach, which has seen far greater numbers of people supported with temporary accommodation than before the pandemic – but we do still face huge challenges. We know that more than 200,000 households in Wales are struggling to meet mortgage and rental costs. The cost of living continues to bite, and people are struggling to make ends meet.. As for first-time buyers, average house prices were around £255,000 last year, while median pay was stuck at £31,694. The situation has only been worsened by the Tories’ mismanagement of the economy, with 9,523 families in Pembrokeshire facing an annual mortgage payment increase of £2,100.\nThe last 13 years of the Tories has left us with low growth, the highest tax burden in 70 years, and inflation still running at just under 7%. The outlook right now is bleak, with little hope that the current UK Government has any solution to this growing problem.\nTory chaos in Westminster has a direct impact in Pembrokeshire, having shrunk the budgets that matter most to people’s lives. PCC recognise that we need more housing and despite this tough landscape they are looking to develop 350 new build housing units by 2027 and their business plan has identified 400 affordable housing units with sites in Johnston, Tiers Cross, Milford Haven, Haverfordwest, Tenby, Newport and Neyland in the active work programme, with support from the Welsh Labour government. Furthermore, they are looking to increase the range of housing projects, to include the development of Community Land Trusts and making small plots of council land available for those seeking self-build opportunities.\nThe Welsh Labour Government have similarly been active in tackling the issue of second homes and holiday lets. The tourism industry plays an important role in Pembrokeshire but there must be more recognition of the impact it has on local communities. The council tax premium on second homes and the increase in the number of days for holiday lets to qualify for business rates is welcomed. Furthermore, the scale of the problem means that we must always be thinking of new solutions, and I am encouraged by the steps being taken in Gwynedd to examine the impact of Local Planning Authorities requiring property owners to obtain planning permission before changing the use of their properties into second homes or short-term holiday lets.\nPCC and our Welsh Labour Government cannot tackle this problem alone though. What we desperately need is a UK Labour Government in Westminster that is committed to building homes again, and which will work in tandem with the Welsh Labour Government in Cardiff and with PCC to tackle this housing crisis. UK Labour’s plan on housing is bold – a housing recovery plan, the next generation of “new towns”, stronger powers and controls for Mayors over planning and housing investment, fast-track approval for brownfield development sites and supporting young people with a government backed mortgage guarantee scheme. We cannot allow the Tories to fan the flames of this housing crisis, by refusing to engage constructively with the Welsh Labour Government and starving it of vital funds. It’s time for change and a bold vision for housing in Pembrokeshire.\nYou can read the article in the Pembrokeshire Herald on page 66 here",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_april-2024-newsletter/content_17.html": "April 2024 Newsletter\n- henrytufnell1\n- May 10, 2024\n- 4 min read\nWelcome back to my monthly newsletter!\nPolice and Crime Commissioner Elections\nThank you to everyone who helped in the Police and Crime Commissioner elections last week. Although it was a disappointing result across Dyfed-Powys, Philippa ran a strong campaign and was rewarded by winning the Pembrokeshire region. The turnout in Pembrokeshire was 17.2% meaning that any wider extrapolation from the result is problematic, but when compared with other battleground seats in Wales such as Monmouthshire and the Vale of Glamorgan, we are holding our own against the Tories. And combined with the wider results in England the picture is positive – change is coming!\nGeneral Election Date\nA summer election has been ruled out and so it is looking increasingly certain that a General Election will be held in the Autumn. Factoring in the Presidential election in the USA, the half-term school holidays, and the clocks going back, I’m now expecting an October election. The additional advantage this date gives the Tories is it would allow them an exceptionally long campaign, from the beginning of Parliamentary recess in late July right the way through until October with the official election being called at the beginning of September. We have done excellent work thus far in the campaign and come a long way in building the necessary infrastructure ahead of the official campaign, but there is still work to do so please get in touch if you can spare some time to help.\nPort Investment\nI was delighted to see us renew our commitment to port investment with a detailed plan to spend £1.8 billion over five years on upgrading the UK’s port infrastructure. Labour’s Green Prosperity Plan is critical for coastal communities such as Pembrokeshire and this opportunity could bring a seismic shift in our economic fortunes. Pembrokeshire’s first ever Labour MP, Desmond Donnelly, was instrumental in the creation of the Port of Milford Haven in the 1950s, and I am convinced that the huge prosperity brought to the county then in the form of good jobs and economic opportunity can happen again. The Tories have neglected our industrial base allowing good jobs to go overseas, leaving coastal communities like ours paying the price. It is time to put Pembrokeshire at the forefront of a new Labour Government’s industrial strategy.\nWithyhedge Landfill site\nI continue to work hard to find a resolution to the ongoing situation at the Withyhedge Landfill site. The actions relating to the enforcement notice issued by Natural Resources Wales (“NRW”) back in February have not resolved the situation and a new notice has been issued in relation to a separate part of the site with a deadline for compliance of 14 May. I met again with NRW and visited the site with Eluned Morgan, where we raised the concerns of residents and were forthright that every effort must be made to contain the odour emanating from the Landfill site. To this end, I am pleased that Pembrokeshire County Council are now separately seeking a legal injunction against the operating company, Resources Management UK Ltd (RML). If the situation persists after 14 May, then I will continue to campaign for a suspension of new waste entering the site so that we can finally Stop the Stink that has blighted the local community since September last year.\nCommunity Action\nEarlier this month, I attended a coffee morning at the St David’s Scout Hut in Ffynnon Wen to support and raise money for the continued use of the Hut for the local community. In an area like St David’s where tourism can often crowd out the local community in the high season, spaces like this are so important.\nI was also delighted to attend the CWBR youth project event, led by Tom Moses at PLANED. Tom powerfully showed the impact the project has had in working with and listening to our young people in Pembrokeshire. Providing opportunities to our young people is one of my core pledges and I will continue to look at ways that we can empower young people across the county.\nCampaigning\nIt was fantastic to be joined by Stephen Kinnock, who brought a team of Aberavon members and campaigned with us out on the doorstep in Saundersfoot. If you can make it on 18 May, then they will be back out with us again in Milford Haven.\nThank you to all those who have been out on the doorstep, on the phones, and volunteering their time in other ways. There is a role for everyone, and as the General Election gets closer we will need all your support – whether that be leafleting, office administration, door-knocking, phone canvassing, or digital campaigning. For those who want to get involved please contact Ben Levy on 07596 596351.\nYou can keep up to date and help share what I’m up to throughout the month by following me on Facebook, Twitter and Instagram.\nIf you have any questions you’d like to ask me, please just reply to this email.\nTill next time\nHenry Tufnell\nParliamentary Candidate for Mid and South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_pembrokeshire-herald-column-18th-january-2024/content_23.html": "Pembrokeshire Herald Column - 18th January 2024\n- henrytufnell1\n- Feb 1, 2024\n- 2 min read\nOne of the greatest achievements of the Labour Government was the founding of the NHS on the principle that healthcare would be free at the point of need. The commitment to this maxim remains undimmed – both Vaughan Gething and Jeremy Miles, the two candidates to succeed Mark Drakeford as First Minister, are unwavering in their commitment to the principle. For Vaughan the NHS quite literally saved his life when he was battling a kidney disease in the year after his A-levels. We all rely on the NHS, and it is utterly critical for the health and well-being of our great nation.\nThere is no doubt though that the pressures on the NHS are greater than they ever have been: the COVID pandemic, the rising of chronic diseases and an ageing society have all created a perfect storm. The political choices made by the Tories in Westminster since 2010 have made matters worse – health spending has risen by only 15% while Germany have increased theirs by 39%. The NHS is also not immune to the wider economic picture of austerity and record levels of inflation.\nIn this context we must be decisive when looking to future to ensure that the NHS can modernise and provide the high-quality care that the people of Pembrokeshire and Wales deserve. We cannot continue along the path where Hywel Dda rely on agency workers that on average cost 20% more than internal staff and where the lack of state-of-the-art facilities mean emergency operations disrupt planned procedures causing further rises in waiting lists. We must bring healthcare home and prevent Pembrokeshire residents having to travel to Cardiff or Swansea for complicated medical procedures.\nThe strategy of the Welsh Government has centred on supporting and treating people close to their home and in their local community with a focus on prevention and early intervention. Over 50% of their budget is spent on health – 9% more than in England and 43% more on social care. Furthermore, there has been a concerted effort to tackle the problem of 8am bottleneck of GP appointments by providing more ways to access appointments and advice and an increase in the number of GPs working in Wales. Mental health funding is ring-fenced, and a nationwide 111 press 2 service has been rolled out as mental health is given parity with physical health. There is also no penalty for getting ill in Wales as prescriptions are free as is parking in NHS hospitals.\nTo ensure that the NHS remains free at the point of use for the next 75 years we have to be brave. We want our children and grandchildren to grow old in a society where its most fundamental aim is to provide a life free of untreated illness and unmet care needs. Labour can be trusted with the NHS and a Labour Government in Westminster working with a Welsh Labour Government in Cardiff will be relentless in delivering a reformed and sustainable service with the funding it needs to thrive.\nYou can read the article in the Pembrokeshire Herald on page 66 here.",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_news/content_12.html": "top of page\nNEWS\nMarch 2025 Newsletter\nAs March draws to a close and daylight saving begins, I am sure you will join me in looking forward to the lighter summer evenings! It...\nFebruary 2025 Newsletter\nAs February comes to a close, I want to update you on the work I’ve been doing in across Pembrokeshire and in Westminster this month. ...\nJanuary 2025 Newsletter\nAs we welcome the new year, I hope everyone in Mid and South Pembrokeshire has had a joyful and prosperous start to 2025. The break over...\nDecember 2024 Newsletter\nAs 2024 draws to a close, I want to take a moment to wish everyone in Pembrokeshire a very Merry Christmas and a Happy New Year. December...\nNovember 2024 Newsletter\nAs November comes to a close, I want to share updates on what has been another busy and fulfilling month. From discussions in Westminster...\nOctober 2024 Newsletter\nHello everyone, October has been another packed month with visits, meetings, and meaningful conversations across the constituency, and...\nAssisted Dying: Moving Toward Debate and Reform\nAssisted dying remains a profoundly complex and personal issue, and I’m grateful for the thoughtful input I receive from so many of you....\nSeptember 2024 Newsletter\nDear all, As we transition into autumn, September has been a busy and exciting month. I have been tackling critical local issues and...\nbottom of page",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_pembrokeshire-herald-column-13th-december/content_38.html": "Pembrokeshire Herald Column - 15th December 2023\n- henrytufnell1\n- Jan 7, 2024\n- 3 min read\nUpdated: Feb 1, 2024\nIt was a pleasure last week to attend the Port of Milford Haven’s 65th Anniversary dinner. There were some excellent speeches that rightly centred the Port as the “beating heart” of Pembrokeshire, and one of the key sources for jobs and economic prosperity for the county.\nIt was Pembrokeshire’s first ever Labour MP, Desmond Donnelly, who grasped the importance of the Milford Haven Waterway, and how as one of the deepest natural ports in the world it was a route to economic prosperity for the county. In Parliament, Donnelly described himself as “an Englishman with an Irish name sitting for a Welsh seat”. While I have no Irish heritage and my mum would be deeply upset if I described myself as English, I am convinced that in looking to the future of Pembrokeshire we need to take lessons from the legacy of Desmond Louis Donnelly and the transformational impact that he had on this county.\nDonnelly was first elected to Parliament in 1950, and by 1958 the Milford Haven Conservancy Board (later in 1987 becoming the Milford Haven Port Authority) was created by an Act of Parliament. What followed was a burst of activity: in 1960 the Esso Refinery was opened, followed in 1964 by the Texaco (Pembroke) Refinery, then in 1968 by the Gulf Refinery, in 1973 the Amoco Refinery had come on-stream, and by 1974 59 million tonnes of cargo passed through the Port, making it Britain’s largest port in terms of tonnage. By the time Donnelly lost his seat to Nicholas Edwards in 1970, he had clearly had a long-lasting and remarkable impact on Pembrokeshire, one that brought in good well-paid jobs and transformed the economic fortunes of people across the county.\nToday we face new challenges – what with a cost-of-living crisis and the threat of climate change. The landscape has changed from Donnelly’s day, and the Milford Haven Energy Cluster now represents a wide range of interests including the RWE Power Station, Dragon and South Hook LNG plants, and only one oil refinery remains in Valero. But just as Donnelly faced a juncture in the 1950s, so we face a similar one now. Pembrokeshire cannot afford an MP that simply waves through deregulation with no thought for its future industrial strategy. It cannot afford an MP that allows vital infrastructure to be built in China and assembled in Pembroke Dock, rather than investing in our own domestic supply chain. It cannot afford an MP that lets workers be brought in from elsewhere without investing in labour skills at home. And it cannot afford an MP that lets the profits from leases for floating offshore wind simply disappear to the crown estate, leaving nothing for our own communities.\nI have a vision of Pembrokeshire as a world leader in renewable energy, putting our county at the forefront of the next generation of our industrial strategy for energy and tackling climate change head-on in the Milford Haven Waterway. I am determined to secure our energy supply, develop industry in the county, and create good well-paid jobs. We cannot allow our young people to feel that they must leave this beautiful county to get on in life, when their skills and ambition are needed here to face the challenges of today. It is time for a fresh start in Pembrokeshire, and it is one that only Labour can deliver.\nYou can read the article in the Pembrokeshire Herald on page 29 here.",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_assisted-dying-moving-toward-debate-and-reform/content_10.html": "Assisted Dying: Moving Toward Debate and Reform\n- henrytufnell1\n- Oct 31, 2024\n- 1 min read\nAssisted dying remains a profoundly complex and personal issue, and I’m grateful for the thoughtful input I receive from so many of you. Recently, Kim Leadbeater MP introduced a Private Members’ Bill on this topic, meaning a meaningful debate and potential reform could soon be on the horizon.\nI support the idea of legalising assisted dying for mentally competent, terminally ill adults, provided strong safeguards are in place. This bill, like all Private Members’ Bills, allows MPs to vote according to their conscience, ensuring a cross-party discussion that respects diverse views. For me, any change in law must prioritise protecting vulnerable individuals while addressing the autonomy of those facing terminal illness.\nWhatever happens, it’s vital to continue prioritising access to high-quality palliative and end-of-life care. In Wales, we’re fortunate to have a devolved approach to end-of-life care, with the Welsh Government allocating over £10.5 million annually. Quality care should always remain a priority, supporting dignity and choice at the end of life.\nThank you again to everyone who has shared their views on assisted dying with me. This issue is both sensitive and significant, and I look forward to ensuring our community’s voice is heard in this conversation.",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_news-article-2/content_8.html": "June 2023 Newsletter\n- Fergus Franks\n- Jul 13, 2023\n- 3 min read\nUpdated: Jan 15, 2024\nWelcome back to my monthly newsletter here’s what the campaign team and I have been up to…\nOn the Doorstep\nWe have campaigned all over the County in what will be the future constituency of Mid and South Pembrokeshire. From St David’s to Pembroke and from Narbeth to Neyland, I have been out with party members to find out about voters most important issues. I’d like to thank each and everyone of you who has spared your precious time to help bring change to Pembrokeshire. Every conversation we have from now until the next General Election counts. If you want to help but you’re not sure how, then reply to this email and a member of the campaign team will be in touch.\nYoung Labour Pembrokeshire\nI was thrilled to join our Young Labour members at their first meeting in Haverfordwest this week. We talked about issues that concerned them, opportunities to help the General Election campaign and how we bring the Labour message to young people in Pembrokeshire.\nMortgage Misery\nThe average household in Pembrokshire is set to be put under more pressure than ever by Tory economic policy. By my calculation 9,523 families in Pembrokeshire are set to be hit by an average annual mortgage payment increase of £2,100! So many people are doing the right thing, they go out to work every day to pay for their home and their reward is to now live on a knife's edge while the Tories squabble about peerages and parties. Labour's five-point plan to ease the Tory mortgage penalty offers practical help now, while our commitment to fiscal responsibility and growth will secure our economy for the future.\nShocking Stats\nThe Office for National Statistics stats on real average weekly earnings also caught my eye this month. Shockingly, earnings are stuck where they were in 2005. That’s two decades of lost progress for wage earners. On top of the Tory Mortgage penalty and the highest tax burden on working people for a generation, the catastrophe unleashed by successive Tory governments seems to know no bounds.\nMy central mission is to counter this economic decline and this month I visited Metal Seagulls , Ledwood Mechanical Engineering, St David’s Assemblies and United Aerospace, sophisticated manufacturing firms, to learn how we can create a secure local economy with good prospects, pay and conditions.\nClean Energy Superpower\nThis month saw Keir Starmer launch our mission to make the United Kingdom a clean energy super power. Through the Green Prosperity Plan, a Labour Government will cut energy bills, create good jobs, deliver security, and provide climate leadership. I am determined that Pembrokeshire will be at the forefront of this transformation. The transition to clean power provides Pembrokeshire with the opportunity to revitalise its industrial strength and thereby deliver economic prosperity. I have been meeting with a wide range of stakeholders in the industry: Celtic Sea Power , Blue Gem Wind, Floventis Energy , DP Energy, ORE Catapult , Marine Energy Wales, RWE and representatives from the MHPA to understand how we can maximise the benefits of renewable energy for the communities of Pembrokeshire.\nYou can keep up to date and help share what I’m up to throughout the month by following me on Facebook, Twitter and Instagram.\nIf you have any questions you’d like to ask me, please just reply to this email.\nTill next time,\nHenry Tufnell\nParliamentary Candidate for Mid and South Pembrokeshire",
  "https_www_henrytufnell_com/https_www_henrytufnell_com_post_november-newsletter/content_34.html": "November 2023 Newsletter\n- henrytufnell1\n- Dec 11, 2023\n- 4 min read\nUpdated: Jan 15, 2024\nWelcome back to my monthly newsletter!\nRemembrance Sunday\nIt was a real honour to lay the wreath on behalf of the Labour Party at the Haverfordwest Remembrance Sunday Service and then to join our Labour team parading through the streets of Neyland. It was powerful to be a part of both communities coming together to commemorate the lives of those who defended our country to preserve the freedom we have today.\nAutumn Statement\n“It’s the economy, stupid,” a phrase coined during Bill Clinton’s successful 1992 Presidential election, is making a comeback in the face of the Tories truly dire economic record over the past 13 years. The two headlines from Jeremy Hunt’s Autumn statement were a cut in National Insurance paid by employees from 12% to 10% and a tax break for businesses that allows them to save on corporation tax by investing. However, even with these cuts the tax burden is at a 70-year high, growth has been downgraded in each of the next three years, and national debt as a proportion of GDP will be 28% higher next year than when the Tories took power. The combined effect of this Tory economic record is that we are witnessing the biggest hit to living standards on record. A Labour Government that is fiscally responsible, partnering with business, and with a plan to make working people better off cannot come soon enough.\nTrade\nThe approach to post Brexit trade deals has been yet another example of Tory failure. In October 2020 the UK-Japan trade deal saw the announcement that the government would deliver geographical protections for Welsh specialties which included Pembrokeshire earlies. It was boasted that these new protections would be in place by May 2021 and yet over three years later the government has failed to secure any. Added to the shameful betrayal of the Australian and New Zealand trade deals that sold out Welsh farmers, and we can see a complete disregard for rural communities such as Pembrokeshire. I have written directly to the Business Secretary, Kemi Badenoch, to remind her of the promises that were made to Pembrokeshire and Wales and demand that she takes action to secure the long-overdue protections that our specialty exporters need and deserve.\nCommunity Action\nI was delighted to join a number of scout groups from across Pembrokeshire at County Hall as part of UK Parliament week. We were joined by Mark Drakeford, who took questions from the scouts which ranged from his day-to-day routine as First Minister to energy policy for the Milford Haven Waterway. Next up, in my bid to become Pembrokeshire’s slimiest politician I took part in a gunge-fest raising money for BBC Children in Need at the Ogi Bridge Meadow Stadium. We raised just over £1,000 and were featured on the front page of the Western Telegraph. I was also pleased to get back out litter picking in Pembroke Dock with the local McDonalds team, PCSO Patrol our very own Cllr Josh Beynon. Working with local businesses and Dyfed-Powys Police is a vital part in creating safe, clean, and vibrant communities in Pembrokeshire. On the topic of policing, it was encouraging to see the work being done by Dyfed-Powys at their Open Doors event, fostering transparency and trust between the police and local communities is critical to ensuring communities in Pembrokeshire feel safe and secure. I look forward to working closely with Philippa Thompson, our new candidate for Police and Crime Commissioner.\nCampaign Trail\nAs ever we have been out right across the county knocking on doors. A big thank you to all those that have joined. It is very important for us to keep the momentum going as with a general election on 2nd May the beginning of the short campaign will be at the end of March, meaning we have 15 weeks or around 100 days until it all kicks off.\nWe have been making good progress but still have work to do, particularly in areas like Milford. In terms of the more rural parts of the constituency we need a considerable push from the phone banking team to reach out to those communities. Our phone banking team leader, John Bramley, is keen for volunteers so please let him know if you have an hour or so spare to make some phone calls. Our digital team is also up and running, please contact Jo Ambrose to get involved with the campaign online. Ben Levy will pass you on if you contact him on 07596596351 or email ben_levy@labour.org.uk.\nIt is important to remember that as the Tories have yet to select their candidate, we have a head start and we must make the most of it. Finally, I am excited to announce that we have a new campaign centre opposite the Welsh Bakery in Haverfordwest. Once up and running we will be operating an open-door policy so please drop by and get in touch with Ben Levy if you have some Labour memorabilia for decoration!\nYou can keep up to date and help share what I’m up to throughout the month by following me on Facebook, Twitter and Instagram.\nAs always, thank you for your support!\nVery best wishes,\nHenry Tufnell\nParliamentary Candidate for Mid & South Pembrokeshire"
}