{
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_body-image-campaign-update/content_25.html": "Time really does fly! A year ago, the then-Prime Minister stood at the dispatch box in the House of Commons in support of my Body Image Campaign and pledged that it would be incorporated in the Women’s Health Strategy.\nIf you didn’t already know, I’ve been calling for companies and influencers to voluntarily commit to not digitally alter a person’s body proportions in any of their imagery. For those who don’t sign up to my Body Image Pledge and still choose to distort body shapes, I believe a label – much like the product placement ‘P’ or #ad – should be included on images when a person’s waist has been edited to look slimmer, biceps enlarged or thighs trimmed down.\nAs a GP, before becoming your MP, I saw first-hand the effects that social media and digitally altered images can have on a person’s relationship with their body image and mental well-being. With an estimated 1.25 million people in the United Kingdom suffering from anorexia or bulimia, over 1 million people with Body Dysmorphic Disorder and anywhere between 500,000 to 1 million people using anabolic steroids, it’s a growing problem that needs our attention.\nLast year 86 MPs from across seven different parties in Parliament signed my open letter to companies, brands and organisations which called for industry action against the digital manipulation of body proportions. Since then, the campaign has gone from strength to strength as companies such as Boohoo, Boots, Dove, Pretty Little Thing, Marks and Spencer, John Lewis, PureGym, Barry M Cosmetics, Aldi, Oasis, Karen Millen, Warehouse, Nasty Gal and Coast have signed up to the Pledge… with more to be announced over the summer!\nI’m amazed when I’m out and about in our area just how strong the community feels about this. People of all ages and political persuasions, whether they’re just entering their teenage years or are grandparents concerned about the impact of platforms such as Instagram and TikTok, recognise the need for change.\nResearch on the impact of social media distorted images is substantial, and alarming. Recent figures from Girlguiding show that 51% of 7-10 year old girls feel ‘very happy’ with how they look. But by age 11-16, when most girls start to use social media, this drops significantly to just 16%.\nTo tackle this, I believe change needs to be made from the top down. Fashion and beauty brands, celebrities and influencers hold great influence online and by making this small change they have the opportunity to realign the societal expectations that put immense pressure on us to look a certain way.\nUltimately, I hope never to see a label. But if companies don’t act soon, I believe Government must step in. Norway already has legislation in place and France recently announced plans to do the same.\nI’m encouraged to see this recognised in the Women’s Health Strategy and as recommendations from the Health Select Committee and Women and Equalities Committee. Progress is slow and difficult to track, but the important thing is that whichever side of the Parliamentary divide you fall on people are united in making a difference.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_errors-and-delays-nhs-pension/content_7.html": "Today I was granted an Urgent Question on the Government's failure to meet multiple statutory deadlines for issuing NHS pension statements.\nThese delays, and the resulting confusion, mean that some doctors are actively choosing not to carry out further vital work in the NHS for fear of being caught up with huge tax liabilities.\nI and the British Medical Association have been raising these concerns for months, today I asked why has it taken the Government so long to act?",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_campaigns_flooding-updates/content_6.html": "UPDATE: 13th February 2025\nHeavy rainfall and flooding at the start of the year caused chaos in some of our villages. One problem has been the dip in the road at Fenn Lanes by the Dadlington Crossroads which has been flooded for quite some time.\nAfter the water cleared, the road remained closed - causing significant disruption to local people.\nI have raised this with LCC, which is responsible for highways and flood prevention and drain maintenance in our area.\nYou can see the response from LCC here: https://www.drlukeevans.org.uk/news/flooding-update-fenn-lanes-closure\nUPDATE: 30th January 2025\nOnce again, heavy rainfall, storms and blocked drains has resulted in flooding in across our community, causing havoc to local people, their homes and businesses.\nTowards the end of last year I convened a meeting of representatives from Leicestershire County Council, Hinckley and Bosworth Borough Council, the Environment Agency, Witherley Parish Council, Leicestershire Police, Leicestershire Fire and Rescue, Severn Trent Water and a local residents group to discuss the short- and long-term impacts of flooding in our area, and will continue to work with everyone involved.\nI’m pleased the Government has agreed to look into this, and I will be looking at these necessary improvements to the flooding formula and Flood Resilience Task Force closely.\nYou can read my question to the Leader of the House and her response here: https://www.drlukeevans.org.uk/news/raises-concerns-around-flooding-formula\nUPDATE: 8th January 2025\nWe've experienced heavier than expected rainfall over the past few days in the East Midlands and sadly many areas in our community have flooded once again, causing havoc to local people, their homes and businesses.\nSince heavy rainfall started on Sunday there has been over 60 flood alerts and warnings across Leicestershire, and it's welcome news that the weather is improving and 27 of these alerts have now been removed, although the effect of these floods will still be felt by many people across our community.\nFind more information here: https://www.drlukeevans.org.uk/news/update-january-2025-flooding\nUPDATE: 13th December 2024\nAfter repeated flooding in the area, I was pleased to be able to pull together all the agencies and those involved in flooding across our area for a private meeting in Witherley on how to tackle flooding in both the short- and long-term.\nFind out more about the meeting here: https://www.drlukeevans.org.uk/news/convenes-flooding-meeting\nUPDATE: 26th November 2024\nYesterday I was able to raise an issue facing areas such as Witherley, Appleby Magna and Shenton, which are often significantly hit by flooding but struggle to receive support from the relevant agencies.\nYou can see my question here: https://www.drlukeevans.org.uk/news/flooding-support-smaller-villages\nUPDATE: 26 September 2024\nPlease be aware of bad flooding by the M69 Junction 1 roundabout.\nLeicestershire County Council is the Lead Local Flood authority responsible for surface water flooding. If you’ve been impacted by recent heavy rainfall you can report it to LCC here: https://www.leicestershire.gov.uk/environment-and-planning/flooding-and-drainage/report-a-flood\nFind more information on this update here: https://www.facebook.com/drlukeevansmp/posts/909443044334917\nUPDATE: 18th January 2024\nI asked the Deputy Prime Minister whether the Government could use the national alert system, trialled last year, to help safeguard homes and businesses against future flooding instances.\nYou can see the response here: https://www.drlukeevans.org.uk/news/national-alert-system-flooding\nUPDATE: 4th January 2024\nOver the past two days my office and I have been in contact with people across our area who have suffered from flooding.\nBy way of an update for you all, I have raised the incidents with:\n- Leicestershire County Council - the local authority responsible for flood management in our area\n- Severn Trent\n- The Environment Agency - to ensure that support is provided to people across our community who need it\nPlease see the rest of my update here: https://www.facebook.com/drlukeevansmp/posts/757746802837876\nUPDATE: 19th January 2021\nWith forecasts of heavy rain over the next few days the Environment Agency are warning communities that already saturated ground is likely to see surface water causing flooding, with the potential of flooding from rivers and watercourses too.\nFind out more, and see the flood warning system, here: https://www.facebook.com/drlukeevansmp/posts/with-forecasts-of-heavy-rain-over-the-next-few-days-the-environment-agency-are-w/481192589942531/\nUPDATE: 17th February 2020\nThe Environment Agency have provided the following advice for local residents impacted by flooding.\nYou can see this here: https://www.drlukeevans.org.uk/news/flooding-advice-environment-agency\n---\nOn this page you can find details of Dr Luke Evans MP’s work to secure protections against and improved funding for villages, homes and businesses across Hinckley and Bosworth which are impacted by flooding.\nA reminder of who to contact in the event of a flood in your area:\nYou can report a flood to LCC by completing this online form (scroll to find link to form at the bottom of this page): https://www.leicestershire.gov.uk/environment-and-planning/flooding-and-drainage/who-to-contact-for-flooding or emailing: [email protected]\nIf your area has been affected by river flooding you can contact the Environment Agency via the free Floodline service: 0345 988 1188\nAs always, you can contact my team and I via email: [email protected]\nWhat to do after a flood: https://www.gov.uk/after-flood\nYou can sign up for flood warnings here: https://www.fws.environment-agency.gov.uk/app/olr/address",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_contact/content_5.html": "Skip to main content\nMain navigation\nHome\nAbout Dr Luke\nBody Image Campaign\nNews\nResponses\nIn Parliament\nContact\nContact\nLeave this field blank\nDr Luke Evans MP\n10 Priory Walk, Hinckley, LE10 1HU\n07920 619812\n[email protected]\nOn Facebook\nOn Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_bosworths-mp-welcomes-removal-onerous-housing-overspill-requirement/content_37.html": "Dr Luke Evans, Member of Parliament for Bosworth, welcomes assurances from the Government that the duty to co-operate and accommodate housing overspill – which would have forced thousands of additional homes onto Bosworth – will be abolished in upcoming legislation.\nThe overspill requirement meant neighbouring districts would be required to accommodate additional housebuilding when a city is unable to meet targets.\nThis was due to be the case for Hinckley and Bosworth as Leicester previously announced they were unable to accommodate 18,700 homes of their target to build nearly 39,400 between 2020 and 2036.\nIn their 2019 General Election manifestos both the Conservatives and Liberal Democrat parties pledged to build 300,00 new homes per year across the nation, with Labour not setting a target. In 2021 the Leader of the Lib Dems, Sir Ed Davey, said “our local authorities do want more houses” as they increased the target to 380,000 homes per year.\nThe local MP welcomes the Levelling Up and Regeneration Bill being brought forward which in simple terms, means that Hinckley and Bosworth will not be under the same pressure to accommodate thousands of homes which should have been built in Leicester. The area is already left vulnerable due to the fact that Hinckley and Bosworth Borough Council have not produced an up-to-date Local Plan, which leaves the community open to houses being built in places where the community don’t want them.\nA Local Plan decides the most suitable sites for housing in a district and allows residents to have their say on housing and infrastructure in their area. The Plan is being worked on by the Lib Dem-run Hinckley and Bosworth Borough Council.\nDr Luke Evans, Member of Parliament for Bosworth, said “I welcome the Government’s commitment to change the onerous duty to co-operate. Our area is already under pressure, due to not having an up-to-date Local Plan, from unwanted developments in parts of Bosworth where infrastructure is already strained. This is a welcome step in the right direction.\n“However, an updated Local Plan has been delayed time and time again. It was originally due 2020/21, we were then advised 2023 and now told it’s likely to be August 2025. This is simply not good enough.\n“What I believe is simple: we need the right homes in the right places, with the right infrastructure and protections for our heritage and environment. There is undoubtedly a need for more housing in the UK, but it’s got to be done in the right way. We all want to see our sons and daughters own their own home and grandma and grandpa to have the right kind of house to downsize to.\n“Many areas in our community, like Market Bosworth, Markfield, Stoke Golding and Burbage, are all working tirelessly to put in place Neighbourhood plans, which go some way to providing additional protections while delivering housing where local people want it. This is something I have led a debate on in Parliament, and will continue to work with the Government for stronger protections for our community.”\nLucy Frazer MP, Planning Minister, said: “The Levelling Up and Regeneration Bill recognises that the duty to co-operate is too stringent a test.\n“The duty will be abolished and replaced by more flexible policy requirements.”",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_campaign-study-anabolic-steroid-use/content_27.html": "Studies show that there are anywhere between 500,000 and 1,000,000 people, predominantly young men, using anabolic steroids and Image and Performance Enhancing Drugs (IPEDs) in the UK.\nTo know the full scale of the issue facing the nation, as steroids can have a detrimental impact on your health and mental wellbeing, I'm calling for the Department for Culture , Media and Sport, Department for Health and the Home Office to work together and commission a study.\nFor more on my work on this issue, watch my Westminster Hall debate from earlier this year: Do more to tackle steroid use, says Dr Luke Evans MP | Dr Luke Evans MP",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_guide-getting-touch/content_19.html": "Who is responsible for what?\nIf you have a complaint or concern, it can be difficult to know who to contact. If you are struggling or have made a complaint and aren’t happy with the outcome, please do let me know and I will look into your concerns.\nHowever, in the first instance I would always advise you to contact the organisation or individual directly as this is usually the quickest and simplest way to resolve any difficulties. Most have a recognised complaints procedure.\nIf you have done this and remain dissatisfied, please get in touch. However, I can only work on your behalf if you live in the Bosworth constituency, so please do include your address. You can find out if I am your MP here: https://members.parliament.uk/FindYourMP\nPlease be aware that, while I am happy to make enquiries on behalf of constituents, my role as Bosworth’s Member of Parliament does not give me authority over the County or Borough Councillors. Your elected County and Borough Councillors will have more influence over their decision making than I do as the MP.\nPlease find my rough guide to who is responsible for what and how to contact them below:\nMembers of Parliament:\n- National Policy Issues\n- Raising policy issues with Government and/or in Parliament\n- Feeding into the work of Select Committees and All Party Parliamentary Groups\n- Following up on complaints where a constituent is unhappy with the organisation’s response\n- Making enquiries about cases with Government agencies such as DVLA, DWP, UKVI etc.\n- Forwarding complaints to the Parliamentary and health Service Ombudsman\nLeicestershire County Council:\n- Highways\n- Education and School Admissions (including Special Educational Needs Support)\n- Adult and Child Social Care\n- Household Recycling Centres (Tips)\n- Planning (Mineral Extraction, Schools)\n- Assistance with bus services\nFind out who your County Councillor is here: https://www.leicestershire.gov.uk/councillors-0\nLeicestershire County Council Complaints Policy: https://www.leicestershire.gov.uk/about-the-council/contact-us/complaints-and-comments\nHinckley and Bosworth Borough Council:\n- Rubbish Collection\n- Council Housing and the Housing Register\n- Local Parks within Hinckley Town\n- Cemeteries in Hinckley\n- Planning Applications & Decisions – including Building Control Enforcement\nFind out who your Borough Councillor is here: https://www.hinckley-bosworth.gov.uk/info/200038/councillors\nHinckley and Bosworth Borough Council Complaints Policy: https://www.hinckley-bosworth.gov.uk/info/200025/compliments_and_complaints/268/how_to_make_a_complaint_or_compliment\nParish/Town Councils\nPlease check on your local Parish Council website as each works in a slightly different way. Generally, Parish and Town Councils cover:\n- Local Parks\n- Local Cemeteries\nHealth Issues\n- GPs, in the first instance please use your GP’s complaints policy which will be available on their website.\n- George Eliot Hospital: http://www.geh.nhs.uk/patients/feedback-and-complaints/\n- University Hospitals Leicester (including Hinckley Hospital) Patient Information and Liaison Service: https://www.leicestershospitals.nhs.uk/contact/\n- Leicestershire Partnership Trust (Mental health): https://www.leicspart.nhs.uk/contact/\nLegal Issues:\nMembers of Parliament are not allowed to give legal advice or influence the outcome of legal actions. Please find advice on how to find legal support here: https://commonslibrary.parliament.uk/research-briefings/sn03207/\nThe Law Society’s Find A Solicitor Website may be of interest: https://solicitors.lawsociety.org.uk/\nPolice:\n- Leicestershire Police Professional Standards: https://www.leics.police.uk/fo/feedback/tc/thanks-and-complaints/\n- The Office of the Police and Crime Commissioner for Leicestershire: https://www.leics.pcc.police.uk/Contact/Contact-Us.aspx\n- The Independent Office for Police Conduct: https://policeconduct.gov.uk/\nParking Tickets:\nI do not have authority to overturn parking tickets or influence appeal decisions, this is a legal process:\n- In the first instance contact the parking company who issued the ticket.\n- If you wish to appeal the parking company’s decision, contact POPLA: https://www.popla.co.uk/\nImmigration Advice\n- Find an immigration advisor: https://www.gov.uk/find-an-immigration-adviser\nSchools:\n- Please follow the School’s complaints process which should be available on their website.\nPHSO:\nThe Parliamentary and health Service Ombudsman make final decisions on complaints that have not been resolved by the NHS in England and UK government departments and other public organisations. You must complete the complaints process of the organisation or department you wish to complain about before I can submit you PHSO application: https://www.ombudsman.org.uk/\nLGO:\nThe Local government Ombudsman look at individual complaints about councils, all adult social care providers (including care homes and home care agencies) and some other organisations providing local public services. You must complete the complaints process of the organisation or department you wish to complain about before you can submit your LGO complaint: https://www.lgo.org.uk/\nOther Organisations:\nThis is a snapshot of some of the main organisations I get asked about as your MP. There are, of course, many others. If you would like advice about how to take a concern forward with an organisation which is not listed here, please do get in touch and I can assist you.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_speech-eating-disorder-awareness/content_12.html": "Earlier this week, in my role as Shadow Health Minister, I responded to a Westminster Hall debate on Eating Disorder Awareness.\nMany of you will know that this is an issue I saw in my work as a GP before entering Parliament and one which I have been working on as part of my campaign on how to improve a person’s poor relationship with their body image.\nThe Covid-19 pandemic, and lockdown specifically, contributed to a surge in demand for children and young people’s eating disorder treatment, so I welcomed the opportunity for cross-Party MPs to come together and discuss what more can be done to support people. It was also an opportunity to discuss the expansion of mental health support hubs and community eating disorder teams across the country, and hear from the new Government on their plans.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_body-image/content_10.html": "In my role as a GP before becoming an MP, I saw first-hand the negative effects that social media platforms and false advertising can have on a person’s relationship with their body. Which is why I started the #RecogniseBodyImage campaign.\nIn the UK there are an estimated 1.25 million people suffering with anorexia or bulimia, and over 1 million people using steroids or image enhancing drugs. It is no secret that social media puts pressure on people to have a certain - often unachievable - body shape and size.\nViewing digitally altered bodies can have harmful effects on a person’s – particularly a child’s – self-esteem and body image. As many as 1 in 3 teenagers feel shame about their body, with 94% of girls aged 11-21 believing more needs to be done to protect young people from body image pressures online.\nAccording to recent research carried out by Dove:\n- 80% of girls said they had already applied a filter or used a retouching app to change the way they look in their photos by age 13\n- 80% said they compared the way they looked with others on social media\n- 77% tried to change or hide at least one body part/feature before posting a photo of themselves\n- Girls who distort their photos are more likely to have low body-esteem (48%) compared to those that don’t distort their photos at all (28%)\nThe Body Dysmorphic Disorder Foundation, a signatory of my Body Image Pledge (see below), and the British Medical Journal state that BDD is a mental illness characterised by a preoccupation with perceived 'defects' or 'flaws'. It is estimated that over 1 million adults in the UK have BDD.\nFor too long advertising and promotional images have contained digitally manipulated body proportions, falsely presenting them as an honest representation of that person. Not only does this harm people who see these images online, in stores or on the pages of magazines, but it causes distress to the person who has had their body digitally ‘fixed’.\nMy work on this important issue is threefold...\nBody Image Pledge\nThe Pledge is a voluntary commitment which brands, charities and organisations can sign to show they will not digitally manipulate a person’s body proportions in any of their direct images.\nNational organisations such as Dove, Boots, Marks and Spencer and Boohoo Group have signed the Pledge, committing to stop digitally 'fixing' another person's body shape and size.\nBody Image Bill\nThe Body Image Bill, introduced in Parliament on January 12th, would require advertisers and influencers to place a label on images where body proportions have been digitally manipulated. For example, where a person's waist has been made thinner, legs longer or slimmer, biceps enlarged etc.\nUnfortunately, both times I have brought the Bill forward it has run out of Parliamentary time. However, I have been pleased to see recognition of the need for a label in the Women's Health Strategy and the Health Select Committee report following an inquiry into Body Image.\nAsking the Government to #RecogniseBodyImage as a priority harm\nIn 2021 I created a petition (closed April 29th 2022) which urged the Government to #RecogniseBodyImage as a priority in the Online Harms Legislation, requiring social media companies to recognise body image in their community standards and for this content to be regulated.\nThank you to everyone who took the time to sign and support this.\nFor updates on my #RecogniseBodyImage campaign please see the links below",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_government-minded-refuse-rail-hub/content_16.html": "I cautiously welcome the new Transport Secretary’s decision to give greater consideration to the proposed Hinckley National Rail Freight Interchange, but I’m pleased to see that she is ‘minded to refuse consent’.\nBoth myself and Alberto Costa (as MPs for the area), local councils, statutory bodies, environmental groups and residents have raised serious concerns about the lasting and material impact of the proposal and the information given by the developer during the Planning Inspectorate’s examination.\nIt’s as clear to me as it is to the public that the consequences locally far outweigh any proposed national benefits, especially when considering the concerns around the information and the basis being used to justify the proposal.\nI am pleased to see that the Secretary of State is inclined to agree.\nAlberto Costa and I will be working to find out what further information the Transport Secretary is seeking.\nAs ever, I will keep our community updated when I hear more. You can keep up to date on my work on the proposed Hinckley NRFI here: Updates on the Hinckley National Rail Freight Interchange proposals | Dr Luke Evans MP\nYou can read more here: Hinckley National Freight Interchange: development consent decision extension - GOV.UK (www.gov.uk)",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_about-dr-luke/content_36.html": "Before becoming your Member of Parliament in 2019, I was a GP across the Midlands. I believe there are a lot of similarities between a good local MP and a good GP – you have to communicate clearly and effectively, you have to be able to deal with complex information and make decisions, and you have to problem solve. Above all, however, you have to care about the people you look after, and work hard to earn their respect.\nMy father was a GP and my mother a nurse, so discussions around medicine were a common theme in our house from an early age! Through their work, both of my parents were dedicated to wanting to help people. Given that my two brothers and I have all gone into medicine, it's safe to say their commitment to the community had an impression on us!\nTraining as a junior doctor truly tests both your perseverance, and your commitment to the job. It was without doubt one of the most difficult, but proudest, periods of my career. Despite the difficulties (and, at times, sheer terror!), the profound difference you can make to a patient’s life is a real privilege.\nMy wife Charlie and I met while studying medicine in Birmingham, and in May 2019 we got married at a beautiful spot near Kidderminster. Charlie grew up in the Midlands and is also a GP herself.\nSince we moved to Newbold Verdon our family has doubled with the addition of our two mischievous whippets, Ada and Roux.\nSince becoming an MP I’ve developed a number of policy interests, and have been campaigning on body image and growing anabolic steroid use, support for our farmers, protections for local planning and infrastructure, and ways to improve the NHS for patients and staff.\nTraining and working in the NHS has shown me not only the very best of our health system, but also ways we can improve and innovate for the future. Being elected onto the Health and Social Care Committee at the start of 2020 was a real privilege, especially given its prominence during the pandemic.\nIn November 2024 I was honoured to be made Shadow Minister for Health, using my experience in the NHS, as a GP and from being on the Health Select Committee to make frequent representations to the Government so that we can improve healthcare both locally and nationally.\nIt's been really humbling to have been awarded Newcomer MP of the Year in 2020, named Conservative MP of the Year in 2023 and nominated for Parliamentary Campaigner of the Year 2024 for my 'Buy British' button campaign.\nLocally some of my proudest achievements to date have been securing £24 million for the Community Diagnostic Centre and £10m for a Day Case Unit at Hinckley Hospital, £19.9m for a National Science and Conservation Centre at Twycross Zoo, campaigning for the new Labour Government to re-commit to funding for two new hospitals in Leicester, and securing funding and Government support for Hinckley School which was recently rated 'Good' by Ofsted.\nServing the people of Hinckley and Bosworth is undoubtedly the privilege of a lifetime.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_campaigns_animal-welfare/content_15.html": "UPDATE: 27th August\nSince becoming your MP I've campaigned for stronger protections for our pets and harsher punishments for those who seek to do them harm, so I was delighted to see that the Pet Abduction Act became law on Saturday.\nI know people across our community want to see stronger legislation against animal cruelty and I've been pleased to support Anna Firth with her Private Members Bill which now means that anyone found guilty of stealing a dog or a cat will face up to 5 years in prison, a fine, or both.\nUPDATE: 2nd May\nI know Hinckley and Bosworth – in particular – has a passion for pets! I‘ve lived around animals my whole life and I’m now the proud owner of two mischievous whippets, Ada and Roux.\nWhile I was disappointed to see whippets didn’t win… I can understand why Labradors won. After all, they have a great temperament, are friendly, welcoming and greet everyone with a smile… just like our community!\nFind out which other breeds were nominated here: Labradors voted Hinckley and Bosworth’s favourite dog breed | Dr Luke Evans MP\nUPDATE: 10th April\nSince becoming your MP in 2019 I have campaigned for stronger protections for our beloved pets and harsher punishments for those who seek to do them harm, so it’s great to see two pieces of legislation coming forward which will target puppy smuggling and make it a criminal offence to steal pets.\nThe first private members bill I spoke on was to increase the sentencing for animal cruelty, and these Bills are the next step in improving welfare.\nYou can find out more here: Dr Luke welcomes tough action on puppy smuggling | Dr Luke Evans MP\nUPDATE: 8th November\nPlease be aware that the consultation below, on veterinary services, has now closed.\nUPDATE: 11 September 2023\nMany constituents have contacted me to raise concerns regarding the cost of vet services in our area.\nAfter raising their thoughts with the Competition and Markets Authority (CMA) I am pleased to see a review has been launched which will look at consumer experiences and business practices in the provision of veterinary services for household pets in the UK.\nThe CMA wants to hear from pet owners and people who work in the industry. You can take part via this link (open for up to 6 weeks): How to respond to the veterinary services market for pets review - GOV.UK (www.gov.uk)\nUPDATE: 12 July 2023\nPlease see below a Written Parliamentary Question I have recently submitted:\n\"To ask the Secretary of State for Environment, Food and Rural Affairs, what discussions officials in her Department has had with (a) other Government Departments and (b) third-party stakeholders on policy formation on tackling (i) puppy smuggling and (ii) pet theft.\"\nAnd here, for the response from Trudy Harrison MP:\n\"Defra officials have regular discussions with other Government Departments, including Border Force, and third-party stakeholders such as the RSPCA, Dogs Trust, Cats Protection and Battersea Dogs and Cats Home, on policy formation on tackling puppy smuggling.\n\"In response to concerns about the apparent increase in pet theft since the start of the pandemic the Government set up the Pet Theft Taskforce in May 2021. The Taskforce was a cross-government initiative including Defra, the Ministry of Justice and the Home Office. The Taskforce published their findings in September 2021 with input from animal welfare groups and experts in relevant fields. We are in the process of taking forward the Task Force’s recommendations together with relevant Departments.\"\nUPDATE: 22 June 2023\nLast week I, along with other MPs, met with Lord Benyon to continue our call for the introduction of tougher pet theft measures, to put an end to this and the abhorrent crime of puppy smuggling.\nI've been pleased to see:\n- Increased maximum animal cruelty sentences\n- Recognised animal sentience in law\n- Improving farming standards through the animal Health and Welfare Pathway\n- Made microchipping for cats compulsory\n- New fines for offences against animals\n- Ivory Act came into force in 2022, banning certain ivory sales\n- Banning glue traps\n- Give police additional powers to tackle hare coursing\n- Supporting a ban on advertising low welfare animal activities abroad\n- Supporting a ban for the import and export of detached shark fins\nAs you can see the Government has been making good progress on animal welfare, but there is always more to do.\nThere is no doubt that we are a nation of animal lovers. I personally have lived around animals my whole life and I am now the proud owner of two mischievous and adorable whippets.\nIt therefore may come as no surprise that since becoming the MP for Bosworth in 2019, I have campaigned relentlessly for stronger protections for our beloved pets and harsher punishments for those who seek to do harm. I have continually promoted animal welfare, whether within our fields or our homes, and lobbied the Government to strengthen animal rights.\nHere you can find an overview of some of the work I have been doing on this issue and the Government’s subsequent response:\n- Through written questions, speeches and interventions in Parliament, and meeting with campaigners and local police, I have raised the issue of puppy profiteering – breeders who place potential profits ahead of welfare to sell puppies whilst demand is high. You can watch a Ministerial question I raised here: https://bit.ly/336Al3n\nI became aware of the spike in demand, price of puppies and thus pet theft during the pandemic when I sought to acquire my two Whippets, only 6 months apart the prices had risen nearly 200%.\nAfter joining forces with Dogs Trust, the UK’s largest dog welfare charity, and specifically asking the Government to consider the merits of establishing a national task force to tackle pet theft, I greatly welcomed the announcement of a Pet Theft Taskforce.\nYou can find out more here: https://bit.ly/3rylTdF\n- After the Taskforce reported its findings and my office met with Battersea Dogs and Cats Charity, I am pleased a new offence of pet abduction will be introduced - Legislating to recognise this specific crime reflects the sentimental value our pets hold as beloved family members, and takes into account the emotional distress caused to both the owner and pet. In turn, with the increased sentencing, I am pleased more appropriate and consistent penalties will be handed out to pet thieves and police recorded offences will be significantly improved to understand the extent of the problem.\nYou can find out more here: https://bit.ly/3ry3FsR\nYou can read the full report here: https://bit.ly/3GD2ywf\n- Building on this important campaign, I welcome the new proposals, considered within a public consultation, to restrict commercially imported dogs with specific characteristics. The plans would ban the import of dogs with cropped ears or docked tails, raising the minimum age for importing a puppy from 15 weeks to 6 months, and banning the import of heavily pregnant dogs.\nYou can find out more here: https://bit.ly/3sqwqXG\nRaising the minimum age would allow more thorough and accurate checks of the age of the puppy to ensure they are not removed from their mother prematurely. I understand this was a specific ask from the Dogs Trust when I campaigned as part of their Parliamentary Puppy Smuggling Taskforce. You can find out more here: https://bit.ly/3oABCHp\n- To ensure constituents do not fall victim to puppy profiteering, I spoke about puppy smuggling and Government plans to help tackle it on BBC Radio Leicester: https://bit.ly/3HFMHP0\nIf you are considering buying a puppy, you can find useful advice on buying responsibly on the Dogs Trust website: www.dogstrust.org.uk\nAnd the Government’s Petfished tool: https://getyourpetsafely.campaign.gov.uk/\n- Losing a pet can be devastating and I understand this is of significant concern to my constituents, being within the top 10 of 650 constituencies to sign the petition on micro-chipping pets. I was therefore pleased to have the opportunity to speak on behalf of constituents in the Westminster Hall debate about the value of protecting our beloved pets: https://bit.ly/3Gz7qCB\n- After meeting Finn, a former police dog who was horrifically injured in an attack whilst chasing an armed subject, and supporting the introduction of Finn’s Law within the Animal Welfare (Service Animals) Act, I was also pleased to actively support another Bill introduced by my colleague to increase sentencing for animal cruelty. The Animal Sentencing Act increased the punishment for animal cruelty from the previous of 6 months imprisonment to some of the toughest in Europe, sending a clear message that animal cruelty will not be tolerated. Find out more here: https://bit.ly/3GCoFmw\nThis is part of wider Government work on animal welfare which I will continue to support:\n- Animal Welfare Action Plan – providing an overview of over 40 policy reforms the Government intends to tackle around five key themes: sentience and enforcement, international advocacy and trade, farm animals, pets and sporting animals, and wild animals: https://www.gov.uk/government/publications/action-plan-for-animal-welfare\nMany constituents have also contacted me about including cats within the Kept Animals Bill to include restrictions on commercial and non-commercial movement, similar to that of puppy's as mentioned above.\nI am aware that the Government's eight-week consultation on the movement of pets into Great Britain did not include proposals to include as thankfully there is limited evidence of a significant illegal trade in cats or significant numbers of low welfare movements.\nI understand that the estimate of 70,000 cats detailed in the Cats Protection’s ‘Cats and Their Stats’ report appears to be based on an estimate of the number of cats obtained between March 2020 and March 2021 and the proportion of individuals that reported in a survey that they had sourced a pet from abroad during the same period. I am aware that official Government statistics show that between March 2020 and March 2021, 27,601 cats entered the UK under the non-commercial rules and 8,511 cats entered under commercial rules.\nOverall, it would appear that the number of movements of cats into Great Britain is much lower than for dogs and fortunately, there is not significant evidence to suggest there are the same issues with young kittens and pregnant cats being imported. In 2020, for example, no pregnant cats and only 17 kittens (under the age of 15 weeks) were seized and detained.\nNonetheless, I understand constituent concern and I am pleased the Government have introduced compulsory cat microchipping by 20 weeks of age, helping to reunite lost or stolen pets with their owners. While 74 per cent of cats are already microchipped, it is estimated 2.8 million are unchipped. It is hugely important that cats are microchipped as this is often the only hope owners have of seeing a lost cat returned safely to their home. In addition, Ministers will review the operation of the current microchip database systems with a view to introducing improvements.\nYou can find out more here: Cat microchipping to be made mandatory - GOV.UK (www.gov.uk)\nI have been continually raising these key topics in Parliament and I am pleased Government is taking strong action.\n- Animal Welfare (Kept Animals) Bill - after contributing as a member of the Kept Animals Bill Committee, I was pleased to raise constituent concerns regarding the provisions of the Bill, including protection for farm animals in the field, live animal exports and zoos: https://bit.ly/337vE9m\n- During the pandemic, myself and colleagues wrote urgently to the Prime Minister to expand the restrictive eligibility criteria to allow Zoos to access the £100 million Zoo Animals Fund, including our own Twycross Zoo: https://bit.ly/3srJqMT\n- After meeting with and receiving correspondence from constituents on Breed Specific Legislation, I raised concerns regarding enforcement with the Policing Minister, the Department for Environment, Food and Rural Affairs, and with Leicestershire Police. After meeting with a canine specialist who is working with the police on the enforcement of the legislation to prevent assessment delays, I was pleased to hear that Leicestershire police have been identified as excellent upholders of animal welfare when assessing if a dog is of “type” and I am looking at how to follow this up locally.\n- After speaking with local farmers and the local NFU, I understand the barbaric practice of hare coursing has been a serious problem in our local community. I therefore publicly backed plans to strengthen the powers and penalties available in the upcoming Police, Crime, Sentencing and Courts Bill: https://bit.ly/3uzzbsv\n- In the spirit of animal welfare, I believe it is important to highlight the significant investment of £19.9 million into our local treasure Twycross Zoo. After formally recommending the project for the Levelling Up Fund and continually raising the zoo within Parliament, I am excited for work to start for a new National Science and Conservation Centre: https://bit.ly/3oBjTj8\n- Trophy Hunting - The 25 Year Environment Plan, the Government has a strong commitment to ensuring that the UK’s domestic policy does not threaten the conservation of species abroad. The proposed ban on imports of hunting trophies goes beyond the manifesto commitment and, with no exemptions, means that the UK will be leading the way in protecting endangered animals and helping to strengthen and support long-term conservation. While I recognise that some conservationists believe trophy hunting can be an effective conservation tool, it is also important to acknowledge concerns around the practice of trophy hunting. I am glad that the Government has proposed a new Animals Abroad Bill to tackle animal cruelty and include bans on the trade of hunting trophies.\n- Fur - I welcome that fur farming has been banned in England and Wales since 2000 and since 2002 in Scotland and Northern Ireland. I am pleased there are restrictions on some skin and fur products which may never be legally imported into the UK, including products from cats and dogs, seal skins and from commercial hunts. The UK has established controls on fur from endangered species protected by the Convention on International Trade in Endangered Species (CITES) and this country does not allow imports of fur from wild animals caught using methods which are non-compliant with international humane trapping standards.\nWhile there are the existing import restrictions listed above, it is still possible to import other fur from abroad. I therefore hope you were able to have your say in the call for evidence on animal welfare as well as the social and economic impacts associated with the fur trade, both at home and abroad. I was pleased that there were nearly 30,000 responses and I understand that the views, data and case studies received will be vital to helping to inform future government policy in this area. I look forward to reading the results in due course, so with the Government considering the consultation responses at this time, there are limitations about what I can do to explore this matter further at this time. - Foie Gras - I am clear that the production of foie gras from ducks or geese using force feeding raises serious welfare concerns. I am glad that this method of production has been banned in the UK for over 15 years following the introduction of the Animal Welfare Act 2006 which brought forward a legal requirement to provide for an animal’s welfare needs, such as supplying a suitable diet and protecting the animal from injury and disease. Under this legislation, it is a criminal offence to cause any unnecessary suffering to an animal. In regard to the sale and import of foie gras, I welcome that the Government’s Action Plan for Animal Welfare sets out the Government’s vision to introduce a range of world-leading reforms to improve the welfare and conservation of animals at home and abroad. Through this Action Plan, my ministerial colleagues have committed to building a clear evidence base to inform decisions on the import or sale of foie gras.\nI understand there is still work to do to make the process of buying a pet safer, to stop criminals exploiting market demand and to improve and maintain animal welfare, from farm and field and within the home.\nI will continue to provide a voice for our adored pets, treasured zoo’s and valued farms.\nAs a final note, I would like to reassure constituents that there has been no change in legislation and that the ban on using animals for the testing of finished cosmetic products remains in force.\nHowever, I am advised that animal research still plays a role in providing vital safety information for potential new medicines and improving our understanding of how biological systems work in health and disease. Further, I am assured that animals, including dogs, are only used in research when there are no suitable alternatives, and any tests are carried out under controls that keep suffering to a minimum. This is known as the last-resort principle, which has been retained and strengthened in the new Environment Act.\nI am opposed to animal tests where alternative approaches could be used.\nI am pleased the Government is actively supporting and funding the development of alternatives to animals in science through the National Centre for the Replacement, Refinement and Reduction of Animals in Research—NC3Rs—which works nationally and internationally to drive the uptake of technologies and to ensure that advances are reflected in policy, practice and regulations on animal research.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_do-more-tackle-steroid-use-says-dr-luke-evans-mp/content_30.html": "Dr Luke Evans, Member of Parliament for Bosworth, called for a conversation on the “growing epidemic” of steroid use in the United Kingdom.\nOn Tuesday 21st February the GP-turned-MP led a Westminster Hall debate in Parliament on the use of anabolic steroids and Image and Performance Enhancing Drugs (IPEDs) in the UK, saying “there are an estimated 500,000 to 1,000,000 users in the UK, but no one is talking about it.”\nMembers from across the House joined Bosworth’s MP on Tuesday, echoing the cross-party union on the need to address this issue that Dr Evans received last year when he called on companies to improve body image and stop digitally manipulating body proportions.\nThe local MP touched on his experience as a doctor and GP, briefly recalling conversations he had with men in his clinics who would ask ‘How do I bulk up?’ and request prescriptions for protein powders and creatine.\nUnder the Misuse of Drugs Act 1971 anabolic steroids are Class C substances, meaning they can be lawfully sold and supplied with a prescription from appropriate practitioners and possession is lawful when they are intended for personal use and in the form of a medicinal product. However, supply, possession with intent to supply and the manufacture of anabolic steroids is illegal when done without licence.\nDr Luke Evans, Member of Parliament for Bosworth, said during the debate “The problem with steroids is that they work, so people use them and see a drastic improvement. They say, ‘Oh, I’ll only use it once’, but once becomes twice, twice becomes thrice, and so on.\n“These are dangerous prescription drugs if they are not used properly. There is a plethora of side effects that are not talked about from the short-term acute stuff that could mean someone has swelling of the brain, a clot or a heart attack, or the long-term effects, such as depression, scarring acne or erectile dysfunction.”\nDr Evans raised several points with Health Minister Neil O’Brien, neighbouring MP for Harborough, but asked the Government for three things: research into the use of steroids and IPEDs, a cross-Departmental taskforce to address the growing issue as well as education and awareness similar to the Government’s work on eating disorders.\n“The whole point of this discussion is that no stone should be left unturned,” continued Bosworth’s MP. “The bold ideas might not be right, but they need to be explored, because that is the key thing to do when trying to deal with this issue.”\nMembers of other parties also contributed to the debate ahead of the Health Minister’s response. Stuart McDonald, a Scottish National Party (SNP) MP, said “The question rightly posed to us today is: what more can we do? I speak from a position of weakness, but I agree that first and foremost, we all need to improve our knowledge of the issue.”\nLabour MP and shadow Health Minister, Sarah Jones, added “Help is out there for everyone… there is no shame in seeking help for performance-enhancing drug use and body image issues. It is a sign of bravery and strength, not weakness.\n“The reasons that people use steroids and other image and performance-enhancing drugs are complex, but the drugs are illegal and cause serious harm to physical and mental health. This is an issue of public health as much as one of crime.”\nHealth Minister, Neil O’Brien, responded on behalf of the Government “We should see this as the start of a conversation that I am keen to pursue with [Dr Evans].\n“Of course, we know that preventing the trade in steroids is not enough to tackle the problem. As [Dr Evans] rightly said, the wider issue lies with the increased prevalence of body dysmorphia and the societal preference for young men to look a particular way. The rise of social media has undoubtedly increased this pressure in recent years, as young people have greater access to platforms promoting often unrealistic and digitally altered body images.”",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_campaigns_NRFI-proposals/content_14.html": "UPDATE: 11th March 2025\nFurther to yesterday’s news that the application for the Hinckley NRFI has been rejected, I wanted to share with you the Secretary of State’s statement of reasons. You can read this here: TR050007-002725-Refusal Letter - Hinckley NRFI.pdf\nParagraph 103, titled ‘The Secretary of State’s conclusion’, confirms what our community has been saying all along; “the potential negative impacts outweigh the need for the Proposed Development and the expected benefits.”\nAs we expected, the developer of the proposed Hinckley NRFI, Tritax Symmetry, has said they are seeking legal advice on next steps and will review their position. Some people have asked what this means for us, I explain the process (including for a Judicial Review) here: The Hinckley Rail Hub has been rejected, but what happens next? | Dr Luke Evans MP\nUPDATE: 10th March 2025\nWhat a huge success for our community!! The Government has turned down the application for the Hinckley National Rail Freight Interchange (NRFI).\nAfter years of this hanging over us, and all the hard work from everyone in our area, we’ve finally had confirmed what we knew all along; this project is inappropriate.\nThis will be a huge relief for many people across our area.\nYou can read my further thoughts on this here: Our concerns heard as Hinckley rail hub rejected! | Dr Luke Evans MP\nUPDATE: 19th February 2025\nEarlier this month Alberto Costa, MP for South Leicestershire where the Hinckley NRFI risks being built, and I wrote to the new Secretary of State for Transport to urge her to follow the Planning Inspectorate's recommendation and turn down the proposed rail hub.\nYou can read our letter here: Local MPs urge Transport Secretary to turn down proposed Hinckley NRFI for good | Dr Luke Evans MP\nUPDATE: 3rd February 2025\nAfter the Chancellor’s comments about ‘prioritising’ infrastructure applications such as this, I am concerned that the Transport Secretary’s decision on the proposed Hinckley NRFI will overlook the many deficiencies with this application and not give due weight to the considerable concerns of people across our area.\nThe Labour Government must not overlook a clearly flawed freight terminal that the independent Planning Inspectorate have already said this project should be refused.\nIf this decision is to be green lighted, it will be hard not to think the new Government’s change of policy is behind the project being accepted, not the merits of the project itself - which we know to be flawed.\nI’d like to thank all those in the community who have helped fight this application and exposed the flaws in the proposal, lets hope the new Transport Secretary has the same thoughts as the last, and actually refuses it once and for all.\nYou can find out more here: Local MP warns Government not to break protocols on proposed Hinckley NRFI at expense of the community | Dr Luke Evans MP\nUPDATE: 20th December 2024\nI strongly urge everyone across our area who is registered as an Interested Party and wants to have their say on this proposal, to respond to the new information and submit further thoughts to the Planning Inspectorate by 7th February 2025.\nThe developer's responses to questions posed by the Department for Transport back in September are available on the Planning Inspectorate's website: Hinckley National Rail Freight Interchange - Project information\nThe previous Transport Secretary said she was ‘minded to refuse’ consent, as per the Planning Inspector’s recommendation. I hope the new Transport Secretary takes the same view and rejects this proposal for good.\nUPDATE: 6th December 2024\nAs many across our area will know, the previous Secretary of State for Transport, Louise Haigh, announced in September a delay for the decision on the proposed Hinckley National Rail Freight Interchange until March 2025.\nIt’s as clear to me as it is to the public that the local impact of the proposed Hinckley NRFI far outweigh any proposed national benefits, especially when considering the many concerns around the information and the basis being used to justify the proposal.\nAlberto Costa, MP for South Leicestershire where the HNRFI risks being built, and I have written to the new Transport Secretary to bring her up to speed. You can read the letter via the attached pdf.\nUPDATE: 11th September 2024\nYesterday, Alberto Costa and I spoke in a Westminster Hall debate following the Transport Secretary's decision to delay her decision on the proposed Hinckley NRFI.\nI was pleased to see the new Transport Secretary is 'minded to refuse' consent following the Planning Inspectorate's recommendation, but ask why the decision is being delayed rather than follow the Planning Inspector's recommendation of turning down the proposal.\nYou can watch highlights from our speeches here: Local MPs call on Labour Transport Secretary to refuse planning permission for Hinckley rail hub | Dr Luke Evans MP\nUPDATE: 10th September 2024\nI cautiously welcome the new Transport Secretary’s decision to give greater consideration to the proposed Hinckley National Rail Freight Interchange, but I’m pleased to see that she is ‘minded to refuse consent’.\nIt’s as clear to me as it is to the public that the consequences locally far outweigh any proposed national benefits, especially when considering the concerns around the information and the basis being used to justify the proposal.\nI am pleased to see that the Secretary of State is inclined to agree, and will be working to find out what further information she is seeking.\nYou can find out more here: Local MP's 'cautiously optimistic' as Government 'minded to refuse' planning consent to Hinckley rail hub | Dr Luke Evans MP\nUPDATE: 29th August 2024\nLast month I and Alberto Costa, MP for South Leicestershire where the proposed Hinckley National Rail Freight Interchange risks being built, wrote to the new Labour Transport Secretary to reiterate our concerns about the proposal.\nWe urged her to consider the damaging impact the Hinckley NRFI would have on our local infrastructure and environment, predominantly Burbage Common, if she accepted the planning application.\nI have since received a response from the Minister of State for Rail, Lord Hendy, which states ‘as this is still a live planning application, it would not be appropriate for me to discuss the merits of the application.’\nAlberto and I wrote to the Transport Secretary following a press conference by the new Labour Chancellor, Rachel Reeves, during which she said “[I will] ask the Secretaries of State for Transport and Energy Security and Net Zero to prioritise decisions on infrastructure projects that have been sitting unresolved for far too long.”\nAfter the Chancellor’s comments about ‘prioritising’ infrastructure applications such as this, I am concerned that the new Transport Secretary’s decision on the proposed Hinckley NRFI will overlook the many deficiencies and not give due weight to the considerable concerns of people across Hinckley and Bosworth and South Leicestershire.\nI truly hope the new Labour Government will not be moving the goalposts to fit their agenda at the expense of our community.\nHere’s a reminder of the letter: Local MPs warn Labour against ‘railroading’ concerned constituents on the proposed Rail Hub | Dr Luke Evans MP\nUPDATE: 25th July 2024\nAlberto Costa, MP for South Leicestershire where the proposed Hinckley National Rail Freight Interchange (NRFI) risks being built, and I have written to the new Secretary of State for Transport to reiterate our concerns on the substantial and material impact this development could have on our area.\nWe have asked for assurances that due process will be followed and the views of our community will not be overridden.\nYou can read our letter here: Local MPs warn Labour against ‘railroading’ concerned constituents on the proposed Rail Hub | Dr Luke Evans MP\nUPDATE: 21st May 2024\nYou may have seen that an “agreement” has been made with an large international logistics company to “develop, lease and operate” the proposed Hinckley National Rail Freight Interchange.\nTo avoid any confusion I want to make it clear that the proposals are still just that… proposals.\nThe Planning Inspectorate is currently examining evidence gathered during the 6 month Examination Stage which took place from September to March, and *no decision has been made* regarding the application by Tritax Symmetry for the Hinckley National Rail Freight Interchange.\nThis “agreement” has no bearing on whether the proposal will be recommended by the Planning Inspectorate and is not an indication of what the Inspectorate’s recommendation will be.\nBoth myself and Alberto Costa, MP for South Leicestershire where the HNRFI risks being built, have raised and continue to reiterate concerns about the impact this development will have on our environment – particularly Burbage Common – and local infrastructure.\nIf you’d like to be added to a mailing list for updates please drop me an email ([email protected]) and I can add your email address to the list.\nUPDATE: 6th March 2024\nThe final deadline for submission of evidence is this Friday 8th March. As you will know the application is currently with the independent Planning Inspectorate who are gathering evidence.\nYou can find more information about what can be submitted, and by who, using this link: https://national-infrastructure-consenting.planninginspectorate.gov.uk/projects/TR050007/examination-timetable\nThrough this link, you will also see that the examination is expected to close on 12th March 2024, then it will be passed over to the Planning Inspectorate to make a recommendation. It usually takes a number of months for such recommendations to be decided so there will be a ‘quiet period’ while this is being worked on by the independent Inspectorate.\nUPDATE: 29th November 2023\nIn a recent public meeting on the proposed Hinckley National Rail Freight Interchange I called on the Planning Inspectorate to not recommend this application to the Secretary of State for Transport.\nWhether it is concerns over modelling on employment and traffic levels, missing information or a lack of adequate time for legal consultees to carry out detailed assessments, the developer, Tritax Symmetry, have appeared to dodge and duck key questions throughout this whole process.\nAs I said to the Planning Inspectorate, if they cannot be sure that the national benefit of this Rail Freight Interchange fully outweighs the horrific impact it will have on our community, both in its build and operation, then they must recommend this application does not go ahead.\nYou can read more here: Dr Luke says 'The Planning Inspectorate must not recommend' HNRFI application | Dr Luke Evans MP\nUPDATE: 10th November 2023\nThe Planning Inspectorate has published the full recording of the Open Floor Hearing last week.\nYou can watch my speech here: (from 20m 20s) Hinckley National Rail Freight Interchange | YouTube\nUPDATE: 8th November 2023\nI am pleased to see that our local paper, The Hinckley Times, has reported on the lack of information from Tritax Symmetry and issues I raised regarding this proposal at last week's public meeting.\nI will continue to work on this issue and keep you updated.\nUPDATE: 2nd November 2023\nSpeaking at today's public meeting on the proposed HNRFI, I asked the Planning Inspectorate how it can pass judgment when the very statutory bodies it relies on are, themselves, unable to do so due to insufficient information provided by the applicant and urged them not to recommend the application.\nRead my thoughts on today's hearing here: Bosworth MP says Planning Inspectorate “must not recommend” Hinckley Rail Hub | Dr Luke Evans MP\nUPDATE: 25th September 2023\nThere’s still time for registered Interested Parties to have their say on the proposed Hinckley National Rail Freight Interchange.\nAlberto Costa, MP for South Leicestershire (where the rail hub risks being built), and I are working together to ensure the Planning Inspectorate hears ours and our communities key issues and concerns with the application.\nLearn more here: Local MPs urge residents and businesses to have their say on proposed Hinckley Rail Hub | Dr Luke Evans MP\nUPDATE: 14 September 2023\nOn Tuesday the Planning Inspectorate held the first meeting on the proposed Hinckley National Rail Freight Interchange (NRFI), in which process and decision deadlines were laid out and agreed.\nFollowing the meeting I wanted to make those of you who have registered as Interested Parties aware that the deadline for submission of comments and summaries on Relevant Representations and request to speak at future meetings is October 10th.\nUnfortunately, as I was sitting on a Legislative Committee in Parliament, I was unable to attend the meeting but a member of my team attended to represent me.\nI’m pleased to share that the concerns I raised in a recent letter to the Planning Inspectorate regarding the choice of venue for the initial meeting which was held in Leicester, and the date for both MPs not being able to attend, have been heard and that future meetings will be held locally. I have been informed that registered Interested Parties will be notified of these meetings with sufficient notice.\nIf you have registered as an Interested Party and are not receiving the email notifications from the Planning Inspectorate, please let me know and I will inform them.\nBelow is further information you might find useful...\nComments and summaries on Relevant Representations\nThe following links are useful in providing comments on your Relevant Representations (these would have been submitted in May and June when registering as an Interested Party):\n- What to submit in a Relevant Representation (sections 6 and 7 are most applicable): https://infrastructure.planninginspectorate.gov.uk/legislation-and-advice/advice-notes/advice-note-8-2-how-to-register-to-participate-in-an-examination/\n- How to participate in the upcoming Examination Stage: https://infrastructure.planninginspectorate.gov.uk/legislation-and-advice/advice-notes/advice-note-8-4-the-examination/\n- All documents pertaining to the application: https://national-infrastructure-consenting.planninginspectorate.gov.uk/projects/TR050007/documents\nRequests to be heard at future meetings\nRegistered Interested Parties who wish to speak at an Issue Specific Hearing, a Compulsory Acquisition Hearing or an Open Floor Hearing should also submit their requests to do so by October 10th.\nDetails of these meetings can be found on page 29 (E3) of the note pertaining to the Preliminary Meeting: https://infrastructure.planninginspectorate.gov.uk/wp-content/ipc/uploads/projects/TR050007/TR050007-001112-Rule%206%20Holding%20Doc.pdf\nFurther deadlines, including other issues to be submitted to the Planning Inspectorate by October 10th can be found from page 27 (E1) of the note pertaining to the Preliminary Meeting: https://infrastructure.planninginspectorate.gov.uk/wp-content/ipc/uploads/projects/TR050007/TR050007-001112-Rule%206%20Holding%20Doc.pdf\nI will continue to work alongside Alberto Costa, MP for South Leicestershire where the HNRFI risks being built, on this issue (you can see details of my work so far here: https://www.drlukeevans.org.uk/campaigns/NRFI-proposals) and will be in contact in due course with further updates.\nUPDATE: 31 August 2023\nFollowing news that the Preliminary Meeting for the Hinckley NRFI proposal is to take place on September 12th, I have written to the Planning Inspectorate to express my concerns relating to the choice of venue for the meeting.\nThere are many local venues, both in our area and in the South Leicestershire constituency (where the Hinckley NRFI is proposed to be located) which would have been suitable and, most importantly, easier for residents and Interested Parties to attend than the Leicester Tigers Conference and Events Venue.\nYou can read the letter here: Letter from Dr Luke Evans MP to the Planning Inspectorate - August 2023 | Dr Luke Evans MP\nUPDATE: 11 August\nI have now received formal notice from the Planning Inspectorate that the Preliminary Meeting for the Hinckley NRFI proposal is to go ahead on Tuesday 12th September.\nAll those who have registered as an Interested Party will have been emailed details of when and where the meeting will take place.\nIt's important to note that this meeting is not an opportunity for Interested Party's to share their views on the application.\nA livestream link of the meeting will be made available on this webpage if you wish to watch, with a recording published shortly after the meeting has taken place: Hinckley National Rail Freight Interchange | National Infrastructure Planning (planninginspectorate.gov.uk)\nUPDATE: 8 August\nI have received the following response from the Planning Inspectorate:\n\"The information was unfortunately released too early due to an error with the website. This has now been rectified and the banner has now been taken down.\n\"The invitations will be with all interested parties in due course.\"\nI will continue to monitor the PINS website and keep you all updated.\nUPDATE: 7 August\nThe Planning Inspectorate website states that the Preliminary Meeting for the Hinckley National Rail Freight Interchange proposals will take place on Tuesday 12th September 2023.\nPlease see below from the Planning Inspectorate for further information:\n\"The Preliminary Meeting will be held on Tuesday 12 September 2023. Invitations to this meeting have been sent to Interested Parties.\n\"The Preliminary Meeting is held in public and concerns procedural matters only. It is not essential to attend the Preliminary Meeting. Whether or not an Interested Party chooses to attend the Preliminary Meeting, they will still be sent details of how to further take part in the Examination.\n\"The Procedural Decision, setting the timetable for the Examination including deadlines for receipt of detailed Written Representations and for comments on the Relevant Representations made by other Interested Parties, will be made after the Preliminary Meeting and will be published on this project page. It will also be available on request from [email protected] and our helpline: 0303 444 5000.\"\nDespite registering as an Interested Party in June, I have not received an invitation - as mentioned in the first paragraph of the PINS update - to the meeting. I will be chasing this up.\nYou can stay up-to-date on the application's process here: Hinckley National Rail Freight Interchange | National Infrastructure Planning (planninginspectorate.gov.uk)\nUPDATE: 14 July\nYesterday Alberto Costa, MP for South Leicestershire where the Hinckley NRFI risks being built, and I hosted a roundtable meeting with the Planning Inspectorate, local parish councils and concerned community groups to discuss the proposals.\nYou can read more on this here: Discussing Hinckley NRFI proposals with the Planning Inspectorate | Dr Luke Evans MP\nUPDATE: 7 June\nToday I was pleased to see Alberto Costa, MP for South Leicestershire where the Hinckley NRFI risks being built, raise our community's concerns with the Deputy Prime Minister.\nAlberto raised local concerns about the 440-acre proposal’s environment impact, its potential to overburden infrastructure and the effect it may have for passengers using public transport. He went on to ask for the Deputy Prime Minister’s assurances that the planning process will be fair, robust and that residents will be listened to.\nYou can read more about Alberto's question and the Deputy PM's response here: Alberto raises local Rail Hub concerns with Deputy Prime Minister | Alberto Costa MP\nUPDATE: 17 May\nLast week, the Leader of the House of Commons, Penny Mordaunt MP, joined me in calling on concerned residents across Hinckley and Bosworth to share their views on the Hinckley NRFI proposals directly with the planning Inspectorate - who makes a recommendation based on evidence gathered.\nThis is a critical step in ensuring our community is listened to.\nYou can watch my question and Penny Mordaunt's response here: Dr Luke and Penny Mordaunt urge residents to share views on Hinckley NRFI proposals | Dr Luke Evans MP\nUPDATE: 12 May\nAlberto Costa, MP for South Leicestershire, and I have urged constituents and organisations to register as an Interested Party and share their thoughts on the proposed Hinckley National Rail Freight Interchange (NRFI).\nThis has been, and will continue to be, a long process. But this step is critical. For many people in our area who care deeply about our community and our environment. This is their chance to share their strong feelings towards the Hinckley NRFI proposals.\nIt’s imperative that constituents and organisations take the time to read the documents provided on the Planning Inspectorate website and share their thoughts on which parts of the proposals will impact their daily lives and our precious greenspace.\nI’m conscious this may feel like Groundhog Day to residents who took part in the – at times, very testing – public consultation held by the developer, Tritax Symmetry, last year.\nAny comments you provide as an Interested Party go straight to the Planning Inspectorate. So if you have an opinion, this is how to make it count!\nYou can read more here: Local MPs urge public to have their say on Hinckley Rail Hub proposals | Dr Luke Evans MP\nUPDATE: 10 May\nFrom today, constituents and organisations are able to register as an Interested Party and so that they may take part in the Examination Stage and share their thoughts on the Hinckley NRFI proposals.\nThis is your chance to formally have your say!\nYou can read about the proposals here: https://infrastructure.planninginspectorate.gov.uk/projects/east-midlands/hinckley-national-rail-freight-interchange/?ipcsection=overview\nRegister as an Interested Party here: https://national-infrastructure-consenting.planninginspectorate.gov.uk/register-have-your-say/TR050007\nUpon entering a few details (name, address, email and phone number) a page will appear which asks “What do you want to tell us about this proposed project?”\nThe page goes on to say ‘Your comments must be about what you consider to be the main issues and impacts. You can also include anything that may affect your day-to-day life.’\nAfter registering as an Interested Party, residents and businesses will be able to submit further comments during the Examination stage of the application.\nUPDATE: 14 April\nYesterday I received news that the application for a Development Consent Order (DCO) for the Hinckley National Rail Freight Interchange has moved onto the examination stage.\nThe application has now entered the formal pre-examination period.\nI would like to share with you correspondence I have received which details the next stages:\n\"During the pre-examination period, an inspector or panel of inspectors will be appointed as the Examining Authority from within the Planning Inspectorate. At this stage, all registered Interested Parties will be invited to attend a Preliminary Meeting, run and chaired by the Examining Authority, to discuss procedural issues and the timetable for examination.\n\"The examination stage will begin the day after the close of the Preliminary Meeting, at which point the Examining Authority will have six months to examine the application.\"\nIf you or anyone you know in our area would like to become an Interested Party and engage in the application process, you can find out more here: Participating in the process | National Infrastructure Planning (planninginspectorate.gov.uk)\nUPDATE: 31 March\nFollowing the meeting Alberto and I had with Huw Merriman, Rail Minister, we have received a letter from Huw detailing the next steps of the HNRFI proposals and how constituents can ensure their views are heard with regard to the proposal.\nIn short, he states that following the submission of the application by Tritax, should the application be accepted for consideration, residents can register as an 'Interested Party' in order to have their opinions heard on the proposals.\n\"Now an application has been submitted and should it be accepted for Examination, there will be an opportunity for anyone with an interest in the scheme to register to be an Interested Party and to be involved in the Examination of this application. More details on the application, next steps and how stakeholders will be engaged in the process should the application be accepted, can be found here.\n\"Following our meeting, I asked my officials to advise on the best way to ensure that local stakeholders in your constituencies can be informed of the Development Consent Order (DCO) process. As the Planning Inspectorate are responsible for examining applications for Nationally Significant Infrastructure Projects such as this one, including engagement throughout the application process with all relevant parties, they would be best placed to explain the process to your constituents rather than officials in the Department for Transport.\"\nI have attached Huw's full letter below.\nUPDATE: 21 March\nMy office has been informed that Tritax Symmetry, the developers behind the Hinckley National Rail Freight Interchange proposals, submitted an application to the Planning Inspectorate on Friday March 17th. You can see updates on the process and documents relating to the application here: https://infrastructure.planninginspectorate.gov.uk/projects/east-midlands/hinckley-national-rail-freight-interchange/\nI am currently in the process of arranging for local stakeholder groups to meet with the Planning Inspectorate to discuss how they may have a meaningful input in the process.\nI will keep this page updated on further developments with regard to the Hinckley NRFI and my work on this matter.\nUPDATE: 8 February\nI sat down with Alberto Costa MP, whose constituency of South Leicestershire risks the NRFI being built in, and Rail Minister Huw Merriman, to discuss the Government’s policy for the placement of Strategic Rail Freight Interchanges.\nWith multiple Rail Freight Interchanges already located within 40 miles of the proposed Hinckley site we must look at whether another one is truly necessary, particularly when it dominates and encroaches on the local environment, such as our wonderful Burbage Common. A joined up national strategy is essential.\nYou can read more about our meeting here: Local MPs raise national Rail Hub policy with Transport Minister | Dr Luke Evans MP\nUPDATE: 29 November 2022\nAlberto Costa, the MP for South Leicestershire - whose constituency the NRFI risks being built in - and I have written to the Transport Secretary to share our concerns over the Hinckley NRFI plans upon learning that proposals will be submitted in the next month or two.\nFollowing news that Tritax have concluded the consultation into the viability of a Rail Freight Interchange in Hinckley I have also written to the developers to request a list of any amendments made to the proposals previously shared with us. While lowering the maximum height of the building from 33m to 28m is welcome, many questions from our community regarding the strain on transport links remain unanswered.\nAlberto and I will continue to work together on this, ensuring the Government are aware of the concerns raised by many people across both Bosworth and South Leicestershire about the impact this will have on our infrastructure and the local environment, particularly our wonderful Burbage Common.\nRead more here: Leicestershire MPs raise concerns about the NRFI proposals with the Transport Secretary | Dr Luke Evans MP\nUPDATE: 03 November 2022\nConstituents have brought to my attention news from Tritax Symmetry that they are planning to submit proposals in the coming weeks. I have not formally received such information.\nI understand they have signalled, following concerns from people in our area, that the proposed maximum building height will be lowered from 33m to 28m.\nI have written to Tritax to ask:\n1. For a full list of amendments they’ve made, and\n2. A date for when they intend to formally submit these plans.\nAs ever I will keep in contact with Alberto Costa, the MP for South Leicestershire, whose constituency the NRFI risks being built in.\nThis is a work in progress, but I will continue to follow these updates closely and keep this page and my social media channels abreast of any relevant information my office and I receive.\nUPDATE: 6th July 2022\nMet with Robert Courts, a Department for Transport Minister, with Alberto Costa MP for South Leicestershire to discuss the upcoming proposals.\nAlberto and I raised concerns again formally with the Minister and asked, procedurally, what steps we can take to ensure our constituents’ strongly held views are heard.\nUPDATE: 21 June 2022\nDr Luke Evans, MP for Bosworth, spoke in a Westminster Hall Debate against the NRFI proposals. You can watch Luke's interventions here: Westminster Hall debate on the NRFI proposals\nRead the full transcript of the debate and the Minister’s response, here: Hinckley National Rail Freight Interchange - Hansard - UK Parliament\nUPDATE: 22 April 2022\nI personally don’t think the Rail Freight Interchange should go ahead. While it may help us nationally reach net zero, I am concerned by the overwhelming impact it will have on our roads and infrastructure and our local environment. There are further complications with the rail line outside of our constituency, and not to mention the fact that the East Midlands Freeport has been given the greenlight.\nThe Freeport is wonderful news for us all as it will bring 60,000 jobs and green investment to our region. Coincidently, it proposes to have a rail freight interchange within one of its three sites. This leads to the question: why do we need another just down the road in Hinckley?\nRead the rest of my article here: \"I don’t think the Rail Freight Interchange should go ahead\" says Bosworth MP in local paper | Dr Luke Evans MP\nUPDATE: 14 April 2022\nThank you to everyone who responded to my Protect Burbage Common survey. Below are a snapshot of the results.\nA paper copy of the survey was sent to around 12,500 residents who live in the vicinity of the proposed Interchange, and available on my website for 10 weeks. Just under 1,100 responses were received and the overwhelming majority (96%, equating to 1,049 respondents) stated they are against the proposals. The same number believe the Interchange would have a detrimental impact on the area with residents citing their biggest concerns being the environmental impact and burden on local infrastructure.\nI asked for respondents to note down some thoughts about the proposals. Tellingly, some of the most used words were ‘traffic’, ‘pollution’, ‘impact’ and ‘wildlife’. Concerns were also raised regarding the additional strain that the Interchange would place on the M69 and the A5. The latter is already under a lot of pressure and is another local issue I am working hard on. Simply put, I don’t believe our current infrastructure is fit for purpose, let alone adding the idea of a Rail Freight\nRead more at this link: Bosworth MP shares results of Protect Burbage Common survey | Dr Luke Evans MP\nUPDATE: 10th February 2022\nMP for Bosworth, Dr Luke Evans, has submitted a formal complaint to the developer of the proposed NRFI, after residents raised concerns regarding the organisation of a consultation event in Burbage, and the treatment of those who attended.\nDeveloper Tritax Symmetry held the event on the 24 January at Millenium Hall for people to view the Interchange proposals, speak to representatives from Tritax, and have their say on the plans.\nFollowing this event, however, several constituents contacted Dr Luke to report that some of those who attended had to wait outside in the cold for over an hour to get into the small venue, that no seating was set out for those who could not stand for long periods of time, that the information provided by Tritax staff was unclear, and that it was difficult to hear what was being said in the crowded room.\nAfter being made aware of this, the Bosworth MP has now formally complained in writing to Tritax Symmetry regarding the organisation of the event, and the treatment of those who attended.\nDr Luke said: “The public consultation is an absolutely vital part of the planning process for this proposal, and I am determined that local residents are given the opportunity to have their say, and are able to access the correct information to be able to do so. The conditions which local attendees reported at this consultation event were unacceptable, so I have formally submitted a complaint to the developer. Thank you to the local residents who brought the issue to my attention.”\nLocal MP launches campaign to Protect Burbage Common\nMP for Bosworth, Dr Luke Evans, has launched a campaign to protect Burbage Common from the proposed NRFI adjacent to Hinckley, following resident’s concerns that traffic and wildlife will be adversely affected.\nIf the plans are successful, the Interchange will be built just off the M69, with the potential to significantly impact much-loved local wildlife habitat, Burbage Common. The completed Interchange would include Industrial and storage/distribution units, a rail port and lorry park, dedicated road access directly from Junction 2 of the M69 and associated highway works, as well as landscaping including footpath and cycle links.\nAlthough the grounds where the Common is situated would remain, local residents have raised concerns that if the plans were successful, local traffic, wildlife and the environment would all be affected. Dr Luke met local community group Save Burbage Common in previous months, and joined fellow Leicestershire MP Alberto Costa at a parish council meeting in October to discuss the Interchange plans, and the impact on the local area.\nAs the Interchange is considered a proposal of national significance, a formal application will be made by Tritax Symmetry to the Secretary of State for a Development Consent Order through the Infrastructure Planning Unit, which is administered through the Planning Inspectorate.\nDr Luke said: “The proposals for the National Rail Freight Interchange have the potential to adversely affect our much-loved beauty spot Burbage Common, so I have launching a campaign to help protect it. Residents near the Common have raised concerns about traffic, wildlife and the environment, if the Interchange were to be built.”",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_category_Westminster-News/content_21.html": "Welcoming Hastings students to Westminster 31st January 2024 Lovely to welcome Year 11 students from Hastings High School down to Westminster today! We talked about Parliament, what an MP does and I answered questions on... Westminster News\nRecent vote on the Privileges Committee report 20th June 2023 I have received emails detailing a range of different views from people across our community regarding the Privileges Committee report and the vote on Monday. I... Westminster News\nDr Luke Evans MP supports ban on hunting trophy imports 17th March 2023 I was pleased to see the Hunting Trophies (Import Prohibition) Bill passed its third reading in the House of Commons on Friday March 17th. While I didn't get to... Westminster News\nBreakfast with the PM 10th January 2023 A memorable 40th birthday today as I was invited to sit opposite the Prime Minister in Number 10 and discuss our shared priorities. I raised: The NHS Energy... Westminster News\nLeicestershire MP's call for further funding in meeting with Chancellor 7th December 2022 This afternoon I sat down with Chancellor Jeremy Hunt and the six other Leicestershire MPs (Alberto Costa on the phone and Alicia Kearns slightly off camera) to... Westminster News\nCalling for a review into Rugby Union governance with the Sports Minister 16th November 2022 Just had a meeting with Sports Minister Stuart Andrew to raise concerns around Rugby Union governance You may remember that I recently asked the Leader of the... Westminster News\nSpeaker's report following the fracking vote on Wednesday 19th October 1st November 2022 Allegations of bullying and poor conduct of MPs from across the House were made following a vote regarding fracking on the 19th October. In this video the... Westminster News\nNew Prime Minister Rishi Sunak delivers his first speech on the steps of Number 10 25th October 2022 I wanted to share with you all the first speech from Prime Minister Rishi Sunak. Rishi spoke about his commitment to protecting vulnerable people through the... Westminster News\nBosworth MP affirms allegiance to King Charles III 21st September 2022 NOTICE: if the video is not showing please refresh this page to watch the clip. The video is playable however YouTube is, for some reason, showing an error... Westminster News",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_flooding-support-smaller-villages/content_11.html": "Flooding impacts many of the villages in our area. Yesterday I was able to raise an issue facing areas such as Witherley, Appleby Magna and Shenton, which are often significantly hit by flooding but struggle to receive support from the relevant agencies.\nHere you can see my exchange with the Secretary of State where I push for a better system - I hope they take this into account when they do their review.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_flooding-update-fenn-lanes-closure/content_34.html": "Heavy rainfall and flooding at the start of the year caused chaos in some of our villages, and I have been raising this both locally and down in Parliament.\nOne problem has been the dip in the road at Fenn Lanes by the Dadlington Crossroads which has been flooded for quite some time. After the water cleared, the road remained closed - causing significant disruption to local people.\nMany people have raised the impact of the road closures with me and I shared their concerns with Leicestershire County Council, which is responsible for highways and flood prevention and drain maintenance in our area.\nHere is their response:\n'Apologies for the delay in replying to your emails regarding Fenn Lanes.\nRegarding the water being removed and the road closure staying in place, this was due to the unsafe conditions of the carriageway following the flooding event.\nWe closed the road when we had the report of the depth of the water and vehicles becoming unable to pass. Unfortunately one vehicle was abandoned within the flood water and many vehicles were ignoring the road closure at the time. This unfortunately led to severe damage to the edge of the carriageway and the exposure of utilities within the verge.\nAs the conditions were not safe Leicestershire County Council took the decision that the road closure would have to remain in place.\nWe have a drainage team attending today [10/02/2025] to work on Fenn Lanes to carry out the necessary repairs to enable the carriageway to be reopened. We will be then working on Shenton Lane which is at the same cross roads. Fortunately at the time of the flooding event the water receded on Shenton Lane and the closure was not required to stay in place.\nWorks are also to be undertaken with a high pressure combi unit to cleanse and check the drainage network in the vicinity following the necessary repair works, but these works will require the road to be closed again for safety.'\n---\nI hope this is useful, and if there are further problems please do not hesitate to contact me at luke.evans.mp@parliament.uk",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_speech-pelvic-mesh/content_23.html": "Yesterday, in my role as Shadow Health Minister, I responded to a Westminster Hall debate on the First Anniversary of the Hughes report on the injustices suffered by victims of sodium valproate and pelvic mesh.\nThe debate was an important opportunity for the women and families affected by sodium valproate or pelvic mesh to get clarity from the Government on what progress is being made on the recommendations of the report and the way forward more broadly.\nYou an read my speech, and contributions from other MPs, here: Hughes Report: First Anniversary - Hansard - UK Parliament",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_warns-government-not-to-break-protocols-hinckley-rail-hub/content_28.html": "In light of yesterday’s announcements and the Chancellor’s plan for growth, I have urged the Government to follow the Planning Inspectorate’s recommendation to turn down the proposed Hinckley NRFI and to not break protocols at the expense of our community.\nA reminder of what’s happened so far:\n- In September the Planning Inspectorate released its report which recommended the Government reject the building consent application for the Hinckley NRFI.\n- The then-Transport Secretary, Louse Haigh, wrote that she was “minded to refuse” the application by Tritax Symmetry but requested additional information from the developer on eight specific points.\n- The developer, Tritax, has responded to these questions and registered Interested Parties now have until Friday 7th February to submit their thoughts on the proposal.\n- A decision on the HNRFI is expected to be made on, or by, the 10th of March.\nBoth myself and Alberto Costa, MP for South Leicestershire where the HNRFI risks being built, have been repeatedly raising concerns around the missing or insufficient evidence that has been submitted as part of this application.\nAfter the Chancellor’s comments about ‘prioritising’ infrastructure applications such as this, I am concerned that the Transport Secretary’s decision on the proposed Hinckley NRFI will overlook the many deficiencies and not give due weight to the considerable concerns of people across our area.\nI have been repeatedly raising objections around the impact the rail hub would have on our area, the additional pressure on our roads and infrastructure, issues around noise and light levels and the impact on our environment – particularly Burbage Common.\nYou can see the latest information provided by the developer here: Hinckley National Rail Freight Interchange - Project information\nIf you’re a registered Interested Party and want to provide further comments to the Secretary of State on this proposal, please do so by emailing: [email protected]\nYou can see more about my work on this here: Updates on the Hinckley National Rail Freight Interchange proposals | Dr Luke Evans MP",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_body-image-campaign-good-morning-britain/content_26.html": "Did you know 1 in 5 adults and 1 in 3 teenagers feel shame about the way they look?\nThis morning I was on Good Morning Britain to discuss my body image campaign and the impact that social media can have on how we perceive ourselves.\nThanks to the show for having me on and to James Lock for speaking so candidly about his experience and shining a light on body dysmorphia.\nYou can watch our discussion above.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_urges-government-continue-household-support-fund/content_17.html": "I know many people across our community are concerned and experiencing anxiety about the removal of winter fuel payments, and now how changes to Personal Independence Payments might impact them.\nOne of the ways that people and families are able to access emergency help if they need it is through the Household Support Fund, which is on the 5th iteration since it was set up in 2021.\nIt's currently due to run out in 2026, at the same time the Government's welfare cuts come into effect.\nIn an Urgent Question on the impact of PIP reforms, I asked the Disability Minister whether the Government will commit to a future iteration of the Household Support Fund.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_campaigns_support-available-cost-living/content_18.html": "UPDATE: 31st October\nFrom today over 9,000 eligible households in Bosworth will receive a £300 cost of living support payment to help ease pressures this winter.\nPlease be cautious of scams - you do not need to apply nor enter your bank details at any point. If you’re eligible, you will receive this support payment automatically between 31st October and 19th November.\nUPDATE: 25th September\nIf you’re entitled to a Winter Fuel Payment for winter 2023 to 2024, you will get an extra £150 or £300 paid with your normal payment from November 2023.\nThe full amount of Winter Fuel Payment (including the Pensioner Cost of Living Payment) you will get for winter 2023 to 2024 depends on when you were born and your circumstances during the qualifying dates.\nYou can get a Winter Fuel Payment for winter 2023 to 2024 if you were born before 25 September 1957.\nUPDATE: 1st July\nFrom 1 July 2023, households without a pre-payment meter no longer receive an Energy Price Guarantee discount on their gas and electricity bills.\nThis is because the Ofgem price cap is lower than the Energy Price Guarantee level, meaning households will pay rates capped by the price cap.\nFor the period of October to December 2023, the Ofgem price cap has been set at £1,834 for a typical household per year. This represented a further fall in the cost of mains gas and electricity from the previous period, which stood at £2.074 for the period of July to September 2023.\nThe Energy Price Guarantee will remain in place as a safety net until the end of March 2024 should energy prices increase above £3,000 per year.\nUPDATE: 24th April\nThe first of the 2023/24 Cost of Living support payments totalling £900 will be received by most eligible households from tomorrow.\nThree cost of living support payments will be made this year, £301 between April and May, £300 in the winter and £299 in Spring 2024.\nIf you are a recipient of Universal Credit, Income-based JSA, Income-based ESA, Income Support and / or Pension Credit you will receive your payment automatically between 25 April and 17 May 2023.\nPeople on tax credits and no other low income benefits can expect to receive the first of three payments between 2 May and 9 May 2023.\nUPDATE: 21st March\nTimes are still tough, particularly for those most vulnerable, so I’m pleased the Government is continuing to support people and families across our community.\nCheck what financial support you are eligible for here: https://www.gov.uk/check-benefits-financial-support\nUPDATE: 7th February\nI asked the Employment Minister, Guy Opperman MP, about how the Government is ensuring that the most vulnerable in our community are supported with cost of living pressures.\nWatch our interaction here: How is the Government supporting the most vulnerable, asks local MP | Dr Luke Evans MP\nUPDATE: 27th January\nBritish Gas have provided the below information on additional commitments they've made for prepayment customers:\n- £10 million credit support fund: non-repayable prepayment meter credit up to £250 on for those struggling with energy costs. British Gas will identify those who would most benefit for this and there is no need for customers to apply.\n- Extra vulnerability checks: enhanced processes around assessing and identifying vulnerabilities to ensure support is targeted where it is needed, and self-disconnections are identified.\n- No remote switches: a commitment to not remotely switch customers to prepayment meters this winter unless the customer requests it.\n- Smart prepayment meters: Ensuring those who are struggling with energy costs have smart prepayment meters to make sure any issues are identified quickly, and support provided.\nThey have specified that customers will not need to contact British Gas to apply.\nFurther infromation can be found here: British Gas Energy Support Fund\nUPDATE: 13th January\nYou may have seen that wholesale gas prices have reduced and even dropped back to levels not seen since Russia’s illegal invasion of Ukraine last February, which spiked energy costs throughout 2022.\nA briefing from EnergyUK - the trade association for the energy industry - explains why these wholesale reductions will not immediately lead to lower energy bills for households and non-domestic users. Below are some key points, and I’ve attached the full briefing to this page (you may have to scroll to the bottom to read the pdf).\n“To protect households and businesses from market volatility, energy companies ‘hedge’ by buying gas and electricity in advance of when it is needed. Hedging and the price cap introduce a time lag between shifts in the wholesale market and what consumers pay.\n“There is still a lot of uncertainty and volatility, making it hard to know what will happen to energy prices in 2023.\n“For the first half of 2023, savings from falling wholesale energy costs will be felt by the Government, not billpayers.\n“The price cap limits how much suppliers can charge domestic customers on a Standard Variable Tariff. It is set by assessing the costs suppliers face, including the wholesale price of the energy they buy. The wholesale cost of energy allowed in the price cap is based on the market cost of electricity in the months prior to the period the price cap applies to. This means that what consumers are paying for electricity and gas today is partly determined by wholesale prices in the autumn. There is, therefore, a time lag between changes in wholesale prices and changes in retail costs.\n“In January 2023, the price cap is the annual equivalent of £4,279 for a typical household, but £1,779 will be paid by the Government because of the Energy Price Guarantee which limits typical bills to £2,500. Additionally, households are receiving £400 between October 2022 and March 2023.\n“Why is there uncertainty about bills falling? There are several sources of uncertainty and causes to think that prices will not fall significantly in the short-term:\n- We are not in a period of steadily falling wholesale prices. Rather, tight supply conditions are causing prices to swing wildly according to external events. For example, wholesale gas prices more than doubled then halved again over the [last] two months of 2022.\n- No one knows what will happen this year, we are in turbulent economic and geopolitical times, creating uncertainty about how much gas and electricity will cost in the coming months and years.\n- Significant quantities of Russian gas was still flowing to Europe until the closure of the Nord Stream 1 pipeline in August 2022 – six months after the invasion. This meant Europe could still fill its storage for this winter partly using Russian gas. That will not be possible in summer 2023, meaning it may be harder to find gas for next winter.\n- After an initial period of disruption, the end of the 'Zero Covid' policy in China is expected to lead to a significant increase in economic activity. In turn, this will increase demand for gas in China – raising prices and making it harder for the UK and Europe to attract LNG shipments.”\nUPDATE: 10th January\nToday the Treasury announced a UK-wide Energy Bills Discount Scheme – a new energy support scheme that will provide all eligible UK businesses and other non-domestic energy users with a discount on high energy bills until 31 March 2024, following the end of the current scheme, the Energy Bill Relief Scheme.\nThis further support follows the government’s unprecedented package for non-domestic users through this winter through the current scheme, worth an estimated £18 billion.\nThrough the scheme, from 1 April 2023 to 31 March 2024, eligible non-domestic customers who have a contract with a licensed energy supplier will see a unit discount of up to £6.97/MWh automatically applied to their gas bill and a unit discount of up to £19.61/MWh applied to their electricity bill. The relative discount will be applied if wholesale prices are above a price threshold of £302/MWh for electricity and £107/MWh for gas.\nA substantially higher level of support will be provided to businesses in sectors identified as being the most energy and trade intensive.\nUPDATE: 5th January\nVulnerable households across Bosworth, including those in receipt of Universal Credit, Income Support, Pension Credit and more, will receive a further £900 as part of the Government’s work to support people through the cost of living increases.\nThe £900 will be split into three payments over the course of the financial year. Exact payment windows will be announced closer to the time but are spread across a longer period to ensure support is consistent. They will be broadly as follows:\n£301 – First Cost of Living Payment – during Spring 2023\n£300 – Second Cost of Living Payment – during Autumn 2023\n£299 – Third Cost of Living Payment – during Spring 2024\nPeople claiming certain disability benefits and pensioners will receive a one-off payment:\n£150 – Disability Payment – during Summer 2023\n£300 – Pensioner Payment – during Winter 2023/4\nMore information on the help available for households to assist with cost of living pressures can be found here: Cost of Living Payment - GOV.UK (www.gov.uk)\nAlso announced in the Chancellor’s Autumn Statement on November 17th:\n- Commitment to the Triple Lock, meaning pensions with increase in line with inflation.\n- 10.1% increase for people in receipt of Pension Credit, worth up to £1,470 for a couple and £960 for a single pensioner.\n- Uprating benefits in line with inflation for 10 million working-age families, costing around £11 billion.\n- Largest ever increase in the National Living Wage, bringing it to £10.42 an hour.\n- £1 billion year-long extension of the Household Support Fund in England and associated devolved nations.\nThis is in addition to the 2022 support package, which included:\n- £650 for over 8 million of the most vulnerable households\n- £300 support payment for pensioners\n- £150 for over six million disabled people\n- £150 Council Tax rebate for all households in bands A-D\n- £400 energy bill grant for all households\n- Cap on wholesale gas and electricity prices for households and non-domestic users (businesses, schools, hospitals etc) to reduce soaring costs.\nFinally, and importantly, please be cautious of scams. You do not need to apply for any of this support and you will not be asked for your bank details at any point.\nForward any suspicious emails to [email protected] or forward the text to 7726 (for free).\nIf you believe you have been the victim of an online scam or fraud, please call 0300 123 2040.\nUPDATE: 8th November 2022\nToday I have welcomed news that the second cost of living support payment, worth £324 to over 9,000 people and families across Bosworth, will be made between today and the end of the month.\nRead more about this targeted support, worth up to £1200 for nearly 8 million of the most vulnerable households, here: Dr Luke Evans MP welcomes second cost of living support payment for 9,100 people and families in Bosworth | Dr Luke Evans MP\nUPDATE: 24nd October 2022\nThe Government have created a 'Help for Households' website which signposts to the different support available, for anything from energy costs to childcare and transport.\nVisit the page via this link: Help for Households - Get government cost of living support\nUPDATE: 1st October 2022\nToday the cap on standing charges and unit prices for electricity and gas came into force, for both households and non-domestic users such as businesses, charities, schools and hospitals.\nWe can all save money on our bills by taking sensible steps to reduce energy consumption where possible (i.e. the more you use, the more you pay). The caps are as follows:\nDomestic users (in the East Midlands assuming payment is made via a direct debit):\n- For Gas:\n- Unit rate: 10.24 per kWh\n- Standing charge: 28.49p per day\n- For Electricity:\n- Unit rate: 33.02p per kWh\n- Standing charge: 45.77p per day\n(Source for the above, please note that caps vary slightly for each region: https://www.moneysavingexpert.com/utilities/what-are-the-price-cap-unit-rates-/ )\nNon-domestic users:\n- For gas: £75 per megawatt hour (MWh)\n- For electricity: £211 per MWh\nThis is in addition to the £400 which will be credited to household energy accounts over the course of the next six months (starting this month), averaging at £66 per month. People on prepayment meters should keep an eye out for discount cards which will be arriving each month.\nFinally, and importantly, please be cautious of scams. You do not need to apply for either the Energy Bills Support Scheme (the £400) or the Energy Price Guarantee (which implements the cap) and you will not be asked for your bank details at any point.\nPlease forward any suspicious emails to [email protected].\nUPDATE: 23rd September 2022\nToday the Chancellor, Kwasi Kwarteng, outlined this Government’s plan for growth. Here are some of my key takeaways for people and businesses in Bosworth:\n- Caps on gas and electricity unit prices, £400 for every household and up to £1200 for the most vulnerable.\n- From today you won’t pay stamp duty on the first £250,000 when you buy a house (up from £125,000) which will help people in Bosworth onto the housing ladder and, in time, for retirees to downsize to.\n- Launching 38 Investment Zones across England, including in Charnwood, Coventry and Leicestershire County Council to help regional growth – I will be following this up.\n- Allowing companies to invest tax free up to £1 million on the likes of machinery to encourage growth.\nOne important side note is that there is already a windfall tax in place. In May, via the Energy Profits Levy, taxes on profits made by energy companies extracting gas and oil in the UK increased from 40% to 65%.\nThere was much more announced, read the full details here: The Growth Plan 2022 - GOV.UK (www.gov.uk)\nUPDATE: 8th September 2022\nToday the Prime Minister set out immediate plans to assist people in Bosworth and across the nation with household energy bills\n- The Energy Price Guarantee places a cap on unit rates and standing charges for domestic electricity and gas prices, starting in October.\n- Businesses will be offered an equivalent guarantee for six months, and after six months further support will be provided for vulnerable sectors.\n- The Government will continue to invest in homegrown energy to ensure we have the long term energy supply and security that our nation needs.\n- The cap on standing charges and unit rates means we can all save money on our bills by taking sensible steps to reduce energy use where possible.\n- As previously announced, lower income homes can access further help with energy efficiency measures under the Government’s Energy Company Obligation (ECO4).\nThis is in addition to the support announced in May:\n- Most households to receive £550 in support (£400 energy relief over 6 months starting in October for everyone, plus a £150 Council Tax rebate for houses in bands A-D)\n- Nearly 8 million of the most vulnerable households to receive at least £1,200\n- Pensioners to receive £850 in support\nFor more information, please visit this link: Government announces Energy Price Guarantee for families and businesses while urgently taking action to reform broken energy market - GOV.UK (www.gov.uk)\nUPDATE: 23rd June 2022\nThis Minister for Climate Change and Corporate Responsibility, Lord Callanan, has today set out the Energy Company Obligation scheme which places an obligation on the larger energy suppliers to install energy efficiency and heating measures to people’s homes.\nLord Callanan said: \"ECO4 [the latest iteration of this scheme] will support around 450,000 homes and is expected to save on average £290 a year for the most vulnerable with up to £1,600 for those living in the least energy efficient homes. However, those savings could average £600 this winter. The passing of these regulations will bring legislative certainty to suppliers and the supply chain, enabling them to ramp up delivery with confidence before winter.\n\"Since 2013, the Energy Company Obligation scheme has installed around 3.5 million energy efficiency measures in 2.4 million homes across Great Britain. Around nine per cent of all households in Great Britain had a measure installed under ECO up to the end of quarter 1 2022.\"\nUPDATE: 26th May 2022\nI am really pleased to see, after writing to the Chancellor, Rishi Sunak, and speaking to him in private about this issue, that the triple lock will apply to the state pension.\nMany people in Bosworth and across the country were worried about what it meant for them when the triple lock was suspended, so this was an important and necessary update from the Chancellor's recent announcement.\nI was also happy to hear the Chancellor has announced plans which will help the whole country with increases in the cost of living.\nThe £37 billion package will be bolstered by support from oil and gas companies who will be 90% better off when they reinvest for our future - this helps with our energy security, net zero commitments and, importantly, affordability.\nIt was right that the Government waited until we had the full picture of what the energy price cap would increase to in the Autumn before announcing the following measures...\n- Most households to receive £550 in support\n- Nearly 8 million of the most vulnerable houses to receive at least £1,200\n- Pensioners to receive £850 in support\nRelief for energy bills has also been doubled, from £200 to £400 for every household and will not need to be repaid. The £400 will be credited directly to energy accounts starting in October 2022.\nYou can watch the full announcement here: Parliamentlive.tv - House of Commons.\nRead about the Government's assistance here: Cost of Living Support - GOV.UK (www.gov.uk)\nFind out what help you are eligible for here: Cost of Living Payment - GOV.UK (www.gov.uk)\nUPDATE: 1st April 2022\nPeople in Bosworth have, quite rightly, asked me what the Government is doing to help with the escalating cost of living, and it is something which I am very conscious of, and regularly working on. Although we are fortunate to be an area with high local employment, there are families across the community who will undoubtedly struggle in the months ahead with rising costs seen across the globe, and an elderly population who should not be forgotten.\nMy team and I continue to assist constituents where we can through casework, much of this inflation is being driven by the rising cost of energy due to increased demand worldwide – and that feeds through into pressures on the cost of living. I completely understand constituent anxiety over rising prices and inflation.\nMy work down in Westminster\nPlease click here to read more about the work I have done in calling for extra support for cost of living pressures: My work on the cost of living | Dr Luke Evans MP\nGovernment work in this area\nSince the start of the pandemic, the Government has announced a £400 billion package of support to protect jobs and income. The economy is in recovery, with a record number of people on the payroll, with recent ONS statistics showing the UK's GDP grew by 1.3% in Quarter 4 of 2021.\nAlthough Government intervention can be limited with the global rising costs of energy, I am pleased the UK Government have acted and implemented a £9 billion package of support to help 28 million households with the cost of living:\nYou can find out more above the above provisions here: Government support for energy bills and the cost of living - factsheets - GOV.UK (www.gov.uk)\n- Increased the National Living Wage by 6.6%, meaning an extra £1000 a year for a full-time worker\n- Announced a non-repayable £150 cash rebate for homes in Council Tax bands A-D – equivalent to 80 per cent of all households, helping both lower and middle-income families\n- Froze the licence fee at £159, halting an increase to £180\n- Introduced a £1000 tax cut for nearly 2 million families, through the cut to the Universal Credit taper\n- Cut fuel duty by 5p per litre for a full year\n- Continued to freeze fuel duty for 12 consecutive years - this has saved the average driver over £1,900 compared to the pre-2010 escalator.\n- Allocated £1 billion for helping those in need on bills and other essentials - In England, the fund will be distributed via upper-tier Local Authorities. At least a third of the £500 million extension funding (£140m) will be spent on pensioners on low incomes and at least another third (£140m) will be spent on families with children.\n- Announced £144 million of discretionary funding for local authorities to support households not eligible for the council tax rebate\n- Continued the Holiday Activity and Food Program for children on Free School Meals with £200 million\n- Retained the Energy Price Cap, helping 15 million households\n- After asking a Parliamentary question regarding support for vulnerable individuals struggling with the cost of energy bills, I welcomed the news that the Warm Homes Discount will be increased and eligibility extended by one-third to 3 million vulnerable households (worth £150). You can read the full Ministerial response here: Written questions and answers - Written questions, answers and statements - UK Parliament; Find out more here: Warm Home Discount Scheme - GOV.UK (www.gov.uk)\n- Since 2011, over £3 billion in direct support has been provided to low-income and vulnerable households under the Warm Home Discount scheme\n- A £200 ‘smoothing’ rebate on energy bills for all households from their supplier\n- Delivered Cold Weather Payments of an extra £25 per week to vulnerable households in exceptionally cold weather: Cold Weather Payment - GOV.UK (www.gov.uk)\n- Pledged £3 billion over this Parliament to help more than half a million lower income homes become more energy efficient, saving households on average £290 per year\n- Winter Fuel Payments are the largest benefit paid to pensioners, and will continue to be available to all pensioners: Winter Fuel Payment: Eligibility - GOV.UK (www.gov.uk)\nSpring Statement\nOn the 23rd March, The Chancellor announced his annual Spring Statement setting out further support the Government is putting in place during these difficult times. I note this was not a full budget, which will be announced in the Autumn.\nThe Chancellor unveiled a new Tax Plan to ease the rising cost of living and to deliver the biggest cut to personal taxes in a quarter of a century:\n- Cutting fuel duty by 5p for 12 months – a £5 billion tax cut and largest fuel duty cut ever.\n- Cutting National Insurance now – a £6 billion tax cut for 30 million working people across the UK from July, worth over £330 a year – 70 per cent of people will pay less tax even after the levy.\n- Cutting the basic rate of Income Tax to 19p from 2024 – the first income tax cut for 16 years, a £5 billion tax cut for over 30 million workers, savers and pensioners.\n- Cutting business employment taxes now by raising the Employment Allowance to £5,000 – a tax cut for half a million small businesses worth up to £1,000 per business.\n- Cutting VAT on energy saving materials like solar – a tax cut only possible because of Brexit.\n- Doubling the Household Support Fund to £1 billion for councils to support the most vulnerable.\n- Creating the conditions for private sector-led growth – through Autumn Budget tax cuts on business capital investment and R&D.\n- Building on our over £9 billion package of support to help households with £350 to address rising energy costs.\nYou can find out more here: Chancellor announces tax cuts to support families with cost of living - GOV.UK (www.gov.uk)\nUPDATE: 10th December 2021\nOn a purely personal level, I understand concerns around energy costs for pensioners and the most at-risk individuals when it comes to fuel poverty. From my conversations in Westminster, I also understand this has been reflected by many, whether parliamentary colleagues or Ministers.\nGlobal gas prices are high due to various factors, including an increase in demand following the end of lockdowns in various countries and in return economies reopening; a cold winter in the UK; high demand in Asia for liquified natural gas (LNG) transported globally by freight which has meant that far less LNG has reached Europe; and weather events in the US limiting supply to Europe. With reduced variety of supply globally and much higher than anticipated demand, high wholesale gas prices have subsequently driven an increase in wholesale power prices, with a few short-term markets trading at, or near, record levels.\nAs a final note, customers may be able to reduce their energy bills by shopping around for a better deal. Changing energy provider has never been easier, either online or over the phone, with comparison sites providing useful information on the best deals. Almost 500,000 energy customers switched to a new supplier each month in 2020, according to Energy UK.\nUseful links to help with energy bills this Winter:\n- Citizens Advice has published useful guidance on switching energy suppliers online: https://www.citizensadvice.org.uk/consumer/energy/energy-supply/get-a-better-energy-deal/switching-energy-supplier/\n- Energy UK’s brief on the actions the energy industry is taking to support customers: Energy sector offers helping hand | Energy UK (energy-uk.org.uk)\n- NEA provide a free support service on energy bills, benefits advice and income maximisation: WASH Advice - NEA\n- Simply Energy provide impartial and independent advice on heating your home: Simple Energy Advice\n- EDF Warm Home discount: https://www.edfenergy.com/for-home/help-support/warm-home-discount\n- Leicestershire County Council also have a Warm Homes Fund: https://www.leicestershire.gov.uk/health-and-wellbeing/seasonal-health/leicestershire-warm-homes-fund\nHome Energy Improvements\nAs part of the Clean Growth Strategy to make as many homes as possible reach EPC Band C or above, there are grants and support available for home energy improvements such as cavity wall and loft insultation.\n- Find national and local energy grants here: Find energy grants and ways to save energy in your home - GOV.UK (www.gov.uk)\n- Hinckley and Rugby Building Society provides funding for customers to carry out green home improvements: Green mortgages | Hinckley & Rugby Building Society (hrbs.co.uk)\n- As part of the Smart Energy GB campaign, you can request a free Smart Meter from your energy supplier to measure and display how much gas/electricity is being used in the home, to reduce energy waste and save money.\n- Under the Government’s Energy Company Obligation, energy suppliers fund the installation of energy efficiency measures in households: Energy Company Obligation (ECO) - Support for improving your home | Ofgem\n- The Energy Company Obligation follows previous supplier obligations and was introduced in 2013. It obliges energy suppliers above a certain size to reduce home heating costs through the installation of energy efficiency and heating measures. The scheme, ECO4, is focused on households who are low income and vulnerable, or at risk of fuel poverty, living in inefficient Energy Performance Certificate Band D-G homes, with a greater focus on insulation, making greater improvements to the least energy efficient homes.\n- Which? guide to the Energy Companies Obligation: Energy Company Obligation (ECO) - Which?",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_campaigns_planning-our-area/content_20.html": "Building development in our area is a big concern and therefore I spend a lot of my time exploring this issue, especially as it can have such a large impact across our neighbourhoods. However, this often leads me to frustration as, at the crux of it, local planning is the sole domain of the Borough Council, and as an MP I have no legal powers in determining applications.\nBelow is some information on planning which may explain what is happening locally, why it's happening and who is responsible for what.\nWhat it means for our area to not have an up-to-date Local Plan\nUPDATE: 26th April 2023\nToday I raised the failure of the Liberal Democrat-run Hinckley and Bosworth Borough Council to produce an up-to-date Local Plan with the Prime Minister.\nYou can watch watch my question and the PM's response above, and read more about the impact that not having an up-to-date Local Plan in place is having on communities such as Burbage, Stoke Golding, Barwell and Markfield here: Bosworth's MP raises the importance of having an up-to-date Local Plan with the Prime Minister | Dr Luke Evans MP\nUPDATE: 30th March 2023\nThe effect of not having an up-to-date Local Plan is well surmised by the recent appeal decision regarding an application for development in Markfield:\n“17. The main parties agree that the ‘tilted balance’ set out by paragraph 11d) of the Framework is triggered in this instance, as HBBC cannot demonstrate a five-year housing land supply and because a number of relevant development plan policies are out of date. Paragraph 11dii) states that planning permission should be granted unless any adverse impacts of doing so would significantly and demonstrably outweigh the benefits, when assessed against the policies in the Framework taken as a whole.”\nFor context, planning permission for the development of 93 homes off Ashby Road, Markfield was granted by the Inspectorate, despite residents in Markfield working diligently to produce a Neighbourhood Plan, because HBBC's failure to produce an up-to-date Local Plan means that Neighbourhood Plans across our area are being ridden roughshod over as \"HBBC cannot demonstrate a five-year housing land supply\".\nYou can read more about my campaign for Government to strengthen protections for Neighbourhood Plans in the relevant section below.\nI have attached below the full appeal decision for this development, should you wish to read further.\nI believe that the fundamental problem at the centre of most of our planning problems concerns Hinckley and Bosworth Borough Council not having an up-to-date local plan. Despite the protestations of the leadership of our Council, the lack of an up-to-date local plan means our area is open to speculative development, with very little legal protection to try to stop inappropriate development; a huge cause for concern for me. Every day that goes past without and up to date plan our community is vulnerable to speculative development.\nI have explored this issue further at Westminster. You can watch my intervention here: Question to the Housing Minister | In Parliament | Dr Luke Evans MP\nDue to the occasionally unfortunate emotive nature of the planning debate, where people seek to take entrenched positions - sometimes for unproductive ends - I must stress that I am not against all development across our area. We do need to build more homes to ensure that local people, including our key workers, our young people seeking their first rung on the property ladder, families, and those who have retired and are looking to downsize, are able to have a suitable home to call their own.\nHowever, I hope that development is sustainable embracing new technologies (especially energy saving devices mindful of the worldwide energy situation) and it's not to the detriment of necessary infrastructure whether that be our roads, public transport routes, local health and education provision or community spaces.\nIn essence, for me it boils down to “the right houses, in the right place, with the right infrastructure, that is right for our environment.”\nI have heard misleading statements blaming the current issues about a lack of a local plan on Government policy. This is not correct. Both the Conservatives and Lib Dem’s in their manifesto’s committed to a target of 300,000 houses needed a year, which I broadly agree with.\nIn 2021 the Leader of the Liberal Democrat Party, Sir Ed Davey, welcomed an increase in their yearly housebuilding target from 300,000 to 380,000 by saying \"our Local Authorities [that includes Lib Dem-ran Hinckley and Bosworth Borough Council] do want more houses\".\nIt is important to note that Government planning policy gives Planning Authorities, like the Borough Council, the power to plan the most suitable locations for future development and the infrastructure to support this through the Local Plan.\nSadly, due to a lack of clear direction being set by the current controlling group at Hinckley and Bosworth Borough Council, our area has not had an up-to-date local plan for some time now. This is the reason why so many speculative and piecemeal applications are being approved. Every day without an up-to date plan our community is vulnerable to inappropriate development. I have been pressing the Borough Council to address this issue as a matter of urgent priority.\nHere you can see I raised the delay-plagued Local Plan with Levelling Up and Housing Secretary Michael Gove: Housing Secretary shares Bosworth MP’s dismay at Borough Council’s delay | Dr Luke Evans MP\nNational Government is aware of this issue; but the Local Plan process needs to be completed locally, by Hinckley and Bosworth Borough Council. The Housing Minister specifically wrote to the Borough Council about the delay in their plans. In a letter to myself and my parliamentary colleagues across Leicestershire dated 3 May 2022, the Minister stated:\n“I should reiterate that it is critical for local areas to have an up-to-date Local Plan in place.”\nThe plan should identify development needed in an area, the location of the development, and certainly is provided for communities, businesses, and developments. The Minister states local communities must be at the heart of all stages in the planning process, including local plans, neighbourhood plans, design codes and on development applications. To be fair to our Council, some progress has been made, but not at a level which I think is satisfactory.\nProgress of the Local Plan\nThe Council recently completed an important stage in the consultation process, setting out a vision and framework for future development in our area. You can read further about the Regulation 19 (Publication) phase of the Local Plan via this link: Local Plan Regulation 19 consultation | Local Plan Review Regulation 19 | Hinckley & Bosworth Borough Council (hinckley-bosworth.gov.uk)\nRepresentations closed on Wednesday 23 March 2022, and I will continue to seek updates from the Council on this important issue. However, at the time of writing, the latest update from the Borough Council states an up-to-date Local Plan is due to be adopted in August 2025.\nI am also aware of further concerns raised by Leicestershire County Council about the Draft Local Plan not having an accompanying up-to-date Sustainability Appraisal. Issues have been raised about transport, schools and environment and I have urged the Borough Council to work with the County Council and address the significant issues that appear to be at the heart of this dispute, but again I must recognise my limitations.\nI cannot determine the progress of the local plan, as local planning is the sole domain of the Borough Council. However, I will continue to engage with the Leader of the Council to encourage the process forward, which I am concerned seems to be extremely cumbersome and without the necessary urgency.\nYou can find further information on how the Hinckley and Bosworth Borough Council Local Plan is progressing here: Local plan review 2020 to 2039 | Hinckley & Bosworth Borough Council (hinckley-bosworth.gov.uk)\nHousing: Leicestershire v Leicester\nI recently joined my parliamentary colleagues across the County in a meeting with the Housing Minister, the Rt Hon Stuart Andrew MP to raise concerns about the overspill housing numbers from Leicester expected across Leicestershire and Rutland. I am seeking an appointment with the Housing Minister to explore these process issues in further depth.\nI, along with my Conservative colleagues, believe that the City of Leicester should, and could, do more to attract necessary inward investment to regenerate areas of the city to attractive quality housing developments. I was pleased the Minister did acknowledge these important points and he assured us that the Levelling Up and Regeneration Bill may assist us to ensure that our concerns are considered in a fair and workable manner minimising the unnecessarily high housing numbers due to be placed on local authorities in Leicestershire and Rutland.\nWhich is why I was pleased to see the Government commit to replacing the onerous duty to co-operate with a more flexible requirement in the Levelling Up and Regeneration Bill, which is currently progressing through the House. You can read more on this here: Bosworth’s MP welcomes removal of onerous housing overspill requirement | Dr Luke Evans MP\nI will continue to follow the Bill with interest.\nThe Planning Department\nI have considerable professional sympathy for staff working in the Planning Departments in Local Councils. I believe that everyone working in public service, comes to work with a sense of duty and wants to do their very best for their local community. However, I do have concerns about staffing levels in the Planning Department at Hinckley and Bosworth Borough Council, on which I have already made enquiries with the Council’s leadership.\nFollowing my recent meeting with the Chief Executive, I wrote to Homes England to ask whether there is any further support they can offer the Borough Council to address some of the staffing and logistical challenges currently being faced by the borough Council’s Planning Department.\nSubsequently, Homes England offered to support the Council in the development of a longer-term recruitment and retention strategy. Homes England were willing to have those conversations at one of their regular meetings with HBBC, should that be helpful.\nHomes England is supporting the first phase of Public Practice’s national expansion. Public Practice is a social enterprise who have successfully implemented a professional placement programme which matches skilled people with public authority hosts. I offered to link the Council with Public Practice.\nI cannot order the Council to pursue a course of action, but I do hope that the Council positively reviews this representation.\nWhat have I been doing at Westminster?\nI thought that it would be helpful to highlight my ongoing work about national planning policy at Westminster. In my first year as your MP, I submitted substantial responses to the Government’s call for evidence about possible changes to national planning policy. This was an important moment in terms of the future of the planning system.\nI also worked with other parliamentary colleagues to get changes to the planning algorithm which determines the number of houses that are targeted to be built in given areas. I argued that a potential 100% increase in our housing numbers was untenable, and I was pleased that the Government eventually agreed that the numbers would stay the same as the previous system.\nYou can see my speech about the topic here: Planning reform and house building targets in relation to the White Paper | Dr Luke Evans MP\nI raised the issue with the Housing Minister: Question to the Housing Minister | In Parliament | Dr Luke Evans MP\nProtecting the Countryside\nI am also looking to explore ideas about the importance of protecting our treasured countryside. My intervention in a Westminster Hall debate on Wildbelt Designation is one such example.\nYou can watch my speech here: Planning Debate | Dr Luke Evans MP.\nI always look for further opportunities at Westminster to explore these issues.\nNeighbourhood Plans\nI am aware that for many communities across Bosworth, the Neighbourhood Plan process has been an essential and worthwhile activity that has helped local people to determine the future of their communities.\nYou can read more about neighbourhood plans via this weblink: Neighbourhood planning - GOV.UK (www.gov.uk).\nI advocate for a stronger role for neighbourhood plans in local and national planning policy.\nIn January 2022, I asked the Minister for Housing and Planning about the role of neighbourhood plans in future national planning policy. I will continue seek to champion the cause of neighbourhood plans at Westminster with the aim of making the process more straightforward and the protections offered more robust.\nLast year I secured a Westminster Wall Debate on Neighbourhood Planning, you can read about the debate and watch my speech here: Legislate to protect Neighbourhood Plans, urges Bosworth MP | Dr Luke Evans MP\nLand Banking\nI recently asked the Planning Minister what is being done to tackle ‘land banking’, where developers buy a section of land but don’t build on it.\nI believe we need the right houses in the right place, with the right infrastructure and the right protections for our heritage and environment. We need houses that families can aspire to and, in our area, we need houses that older generations can downsize to.\nBut appropriate space for housing is finite and developers who land bank take those opportunities away from our community.\nYou can watch the Minister's response here: Bosworth's MP welcomes plans to tackle land banking | Dr Luke Evans MP",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_warns-against-over-regulating-football/content_3.html": "No one wants to see clubs collapse through poor ownership. Equally, the Premier League is the pinnacle of football and revered across the world; we must not strangle it.\nA good regulator will guard the spirit of the game, without chaining its soul and squeezing the life out of it.\nMy intervention on the Football Governance Bill as it returns to the House of Commons.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_new-prime-minister-rishi-sunak-delivers-his-first-speech-steps-number-10/content_29.html": "I wanted to share with you all the first speech from Prime Minister Rishi Sunak.\nRishi spoke about his commitment to protecting vulnerable people through the Covid pandemic and current cost of living pressures, as well as the importance of bringing growth and stability to our nation.\nInformation on support available for the cost of living can be found here: Support available for the cost of living | Dr Luke Evans MP\nDo give it a listen.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_accessibility/content_9.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_category_Speeches-in-Parliament/content_4.html": "Hinckley and Bosworth MP warns against over-regulating football 29th April 2025 No one wants to see clubs collapse through poor ownership. Equally, the Premier League is the pinnacle of football and revered across the world; we must not... Speeches in Parliament\nDr Luke Evans MP calls on Government to hold groups complicit in rape gang cover-ups to account 28th April 2025 Given the rape gangs scandal is so widespread, I and many others across the country want to see a national inquiry which has the power to compel witnesses to... Speeches in Parliament\nLocal MP asks what support is available for pensioners who had their Pension Credit applications rejected 9th April 2025 When the Labour Government announced it was restricting Winter Fuel Payments last year, its advice to people who asked what support would be available to them... Speeches in Parliament\nSpeech on Eating Disorder Awareness 4th April 2025 Earlier this week, in my role as Shadow Health Minister, I responded to a Westminster Hall debate on Eating Disorder Awareness. Many of you will know that this... Speeches in Parliament\nMy speech on the Royal British Legion and the contributions of local branches such as Hinckley 2nd April 2025 It's been over 12 years since MPs last debated the role of the Royal British Legion in Parliament, so today I led a debate on the role of the RBL and all that... Speeches in Parliament\nDr Luke raises impact of errors and delays to NHS pension statements 1st April 2025 Today I was granted an Urgent Question on the Government's failure to meet multiple statutory deadlines for issuing NHS pension statements. These delays, and... Speeches in Parliament\nHinckley and Bosworth MP urges Government to continue Household Support Fund 29th March 2025 I know many people across our community are concerned and experiencing anxiety about the removal of winter fuel payments, and now how changes to Personal... Speeches in Parliament\nMy speech on the Hughes Report and victims affected by sodium valproate and pelvic mesh 28th March 2025 Yesterday, in my role as Shadow Health Minister, I responded to a Westminster Hall debate on the First Anniversary of the Hughes report on the injustices... Speeches in Parliament\nDr Luke asks the Chancellor how much abolishing NHS England will cost 27th March 2025 Today, shortly after her emergency Budget, I asked the Chancellor how much it will cost to abolish NHS England as the Department of Health couldn't give an... Speeches in Parliament",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_local-mp-speaks-opposition-hinckley-national-rail-freight-interchange-proposals/content_35.html": "Since becoming Bosworth’s MP I have been working alongside Alberto Costa, neighbouring MP, to protect our area against the proposed Hinckley National Rail Freight Interchange.\nWe are still awaiting formal confirmation of the next steps and results of the public consultation by Tritax Symmetry, the developer.\nLast week Alberto – whose constituency the NRFI risks being built in – secured a Westminster Hall debate on this issue with Transport Minister Wendy Morton. The debate was for 30 minutes and, unfortunately, with shorter debates only the one MP is granted time to speak. However I was able to make a few interventions and raise some important points.\nRead the full transcript of the debate and the Minister’s response, here: Hinckley National Rail Freight Interchange - Hansard - UK Parliament\nAlberto and I will continue to work together on this issue and keep you updated on any new developments.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_campaigns/content_2.html": "Updates on the Hinckley National Rail Freight Interchange proposals UPDATE: 11th March 2025 Further to yesterday’s news that the application for the Hinckley NRFI has been rejected, I wanted to share with you the Secretary of...\nFlooding UPDATE: 13th February 2025 Heavy rainfall and flooding at the start of the year caused chaos in some of our villages. One problem has been the dip in the road...\nThe A5 UPDATE: 11th October 2024 Every time the Watling Street bridge is hit - like it was yesterday - Hinckley, Higham on the Hill, Wykin and Burbage become a rat run...\nAnimal Welfare UPDATE: 27th August Since becoming your MP I've campaigned for stronger protections for our pets and harsher punishments for those who seek to do them harm, so...\nSupporting our farmers UPDATE: 17th May Delighted to share that ASDA has launched a 'Buy UK' section online, meaning all major UK supermarkets have supported my campaign for a 'Buy...\nImmigration, asylum and borders UPDATE: 1st May 2024 You may be interested to read this update on the Government's plan to cut migration: \"Mass migration is unsustainable and unfair on the...\nStatement on Israel and Gaza UPDATE: 27th March 2024 On Monday afternoon I met with Lord Cameron, the Foreign Secretary as part of a private meeting with MPs, to discuss the ongoing...\nDrainage, water quality and storm overflows UPDATE: 11th March The amount of sewage being spilled into our rivers is completely unacceptable - and whilst the Government has taken tough action to tackle...\nSupport available for the cost of living UPDATE: 31st October From today over 9,000 eligible households in Bosworth will receive a £300 cost of living support payment to help ease pressures this winter...\nPlanning in our area Building development in our area is a big concern and therefore I spend a lot of my time exploring this issue, especially as it can have such a large impact...\nEnvironmental protections UPDATE: 2nd February I welcome this week's announcement from the Government of its Environmental Improvement Plan, with the clear goal of improving nature and...\nCost of living updates UPDATE: January 2023 Vulnerable households across Bosworth will receive a further £900 this financial year. Exact payment windows will be announced closer to...",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_my-thoughts-autumn-budget/content_32.html": "With this Budget it is clear Labour has deceived the public and broken promises not to raise taxes. Raising National Insurance on employers is, in the Chancellor’s own words, a jobs tax. For all the talk of growth, even the OBR have downrated its growth forecast from March 2024 by 0.7pc, to 1.1pc.\nWhile I welcome the announcement of £1bn for Special Educational Needs and the freezing of fuel duty, both of which I have campaigned for, it can’t be said enough how simply changing the rules to borrow £50bn extra is a dereliction of duty and another demonstrable broken promise by the now Chancellor.\nPeople in our community know that the money you borrow has to be paid back, this will come at a cost to jobs, growth and inflation. After all, there is no such thing as Government money just taxpayers heard earned cash.\nHere, our farmers, our cafes and pubs and even our holidays have all seen tax increases. Without any clear plan for growth, I’m really worried about what the next year holds for people across our area.\nGoing forward, I’ll be campaigning for the Government to re-commit to funding Leicester’s two new hospitals – a decision on which has been put off until next year – as well as exploring how we can secure new capital funding for local schools which the Labour Government has just announced.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_campaigns_environmental-protections/content_13.html": "UPDATE: 2nd February\nI welcome this week's announcement from the Government of its Environmental Improvement Plan, with the clear goal of improving nature and halting the decline in our biodiversity.\nYou can read more about the plan here: https://www.gov.uk/government/publications/environmental-improvement-plan\nAs the Prime Minister said at COP27, ‘there is no solution to climate change without protecting and restoring nature’.\nFive years ago the 25 Year Environment Plan set out our vision and the ten complementary goals designed to leave the environment in a better state than we inherited.\nEnvironmental protections\nSeveral constituents have sent me a campaign email from RSPB which falsely represents and accuses the Government of not caring about nature following last Friday’s fiscal event (dated 23.09.2022) and the Chancellor’s announcement of the Growth Plan. This is not a correct representation of the Government’s actions or intentions.\nThe email insinuates, in essence, that the Government is considering weakening environmental laws.\nThis - as the Department for Environment, Farming and Rural Affairs has stated - is simply not right.\nThe Secretary of State for the Environment, Ranil Jayawardena, has said the following:\nWe are not scrapping our reforms. The environment, farming and economic growth go hand-in-hand and we are committed to our schemes that will support out farmers to produce high-quality food and enhance our natural environment.\nThe Government announced that:\n- Some of the more bureaucratic processes within the planning system will be streamlined to enable businesses to invest and high quality jobs to be created more easily in selected investment zones,\n- Food security will also be carefully considered alongside the need for environmental protection, this is an important issue and which local farmers have told me they have been particularly concerned about.\nThe campaign email I have received is misinformation and misrepresents the announcement on both of these points.\nSuccessive Governments have implemented legally binding targets and plans to protect the environment and wildlife in the United Kingdom. The Environment Act of 2021 ‘sets clear statutory targets for the recovery of the natural world in four priority areas: air quality, biodiversity, water and waste, and includes an important new target to reverse the decline in species abundance by the end of 2030’. Future planning reforms, as proposed in the Growth Plan, will be assessed with the Government’s commitment to the environment in mind.\nFor more information on the Government’s commitment to environmental protections please see this link: Government reiterates commitment to environmental protections - Defra in the media (blog.gov.uk)",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_surgeries/content_8.html": "Luke holds regular surgeries, open to all constituents, to offer support and advice. However, these are by appointment only due to the number of people who attend. Surgeries are intended as an opportunity to discuss the outline of your problem and to determine if Luke can help in any way.\nTo book an appointment, please call the constituency office on 07920 619812 or email [email protected]. You will need to provide your full name, full address with postcode and details of your query.\nSurgeries are usually held at Luke's constituency office on a Friday.\nLuke deals with a wide range of issues on behalf of constituents on a daily basis. Before seeking an appointment, it is best to contact him or his staff by email or telephone as he is often able to assist you without needing to book an appointment at a surgery.\nEmail: [email protected]\nWrite to: Dr Luke Evans MP, House of Commons, London, SW1A 0AA.\nTel: 07920 619812\nIMPORTANT: When contacting Luke you must supply your full address and postcode so we can ensure you are a constituent. Parliamentary protocol prohibits Luke from acting for constituents who are represented by another MP and delaying receipt of this information could result in a delay in action being taken on your case.\nData Protection Notice\nAny personal information that you give to me will be handled confidentially by me and the staff in my office. You can read the full privacy notice here\nIf you would like information about the Data Protection generally, contact the Information Commissioner’s Office through their website http://www.ico.gov.uk/ or advice line 08456 306 060.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_planning-inspectorate-letter-august-2023/content_33.html": "Those of you who have registered as an Interested Party with the Planning Inspectorate for the application regarding the proposed Hinckley National Rail Freight Interchange should have now received an invitation to the Preliminary Meeting which is to be held on 12th September.\nIt's important to note that this upcoming meeting is not an opportunity for Interested Party's to share their views on the application, but actually a discussion on how the consultation should work. There will be further meetings for residents to engage in that focus on the substance of the proposal and their views.\nIn this vein, I wanted to share with you that I have already raised my concerns about the process.\nI have written to the Planning Inspectorate regarding the choice of venue for this meeting. There are many local venues, both in our area and in the South Leicestershire constituency (where the Hinckley NRFI is proposed to be located) which would have been suitable and, most importantly, easier for residents and Interested Parties to attend, than the Leicester Tigers Conference and Events Venue.\nWhile there is the option to join the meeting online, it is not always easy to contribute effectively to this type of meeting when joining remotely. I have asked for reasons as to why this venue was selected and requested that future meetings be held locally.\nI also wanted to take this opportunity to share with you that, due to the event being held on a Tuesday, I will not be able to attend. This is another complaint I and my colleague Alberto Costa MP have raised. I am required to be in Parliament that day to sit on a Bill Committee, through which MPs scrutinise legislation before it is written into law. Members of my team will be attending in my place to ensure our community is represented, and I have asked the Planning Inspectorate to consider holding future meetings on a Friday so that the Members of Parliament for the affected areas (myself and Alberto Costa, the MP for South Leicestershire) are able to attend and represent our constituents.\nYou can read the letter in the attached file.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_category_Opinions/content_24.html": "My response to the Chancellor's emergency Budget 26th March 2025 The Chancellor caused a storm with her October Budget, and now she’s complaining about the rain. In October the Chancellor increased spending by £70bn, taxes by... Opinions\nI want to hear your views: Local Government reorganisation 24th March 2025 Earlier this year the Labour Government announced that it is pushing ahead with Local Government reorganisation and has imposed a legal deadline on all 21 two... Opinions\nMy thoughts on the Autumn Budget 2024 30th October 2024 With this Budget it is clear Labour has deceived the public and broken promises not to raise taxes. Raising National Insurance on employers is, in the... Opinions\nColumn from Dr Luke Evans MP: Respect - The Cornerstone of the Conservative Future 22nd July 2024 I am one of the lucky ones. One of the 121 Conservative MPs recently elected. Yet, I must confess, my victory feels rather Pyrrhic. For those unfamiliar with... Opinions\nDr Luke Evans MP speaks to Politics Live panel 16th July 2024 Good to be back on BBC's Politics Live today - the day before the King's Speech - talking about the resignation of the Welsh First Minister, energy security... Opinions\nWith the election next week, who do you want to be Hinckley & Bosworth's next Member of Parliament? 28th June 2024 Next week is crunch time. As people across Hinckley and Bosworth go to the polls, they will be deciding who will be the strong voice for our area as the next... Opinions\nA General Election has been called, who are you voting for? 23rd May 2024 You will, no doubt, have heard the Prime Minister has called a General Election. The date is set for Thursday the 4th of July. For some of you this will be very... Opinions\nI want to hear from you: childcare funding and support for parents 9th May 2024 What are your views on childcare provision? Whether you are a parent, grandparent or work in the field, I would love to know your thoughts! Access to affordable... Opinions\nVote now for your favourite dog breed! 22nd March 2024 Did you know our area was in the top 10 constituencies in the UK (that's out of 650!) to sign the petition to strengthen legislation against animal cruelty... Opinions",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_news_local-mp-celebrates-recent-successes-his-ongoing-campaign/content_22.html": "Image: Dr Luke Evans MP at a recent Summer Reception held in Westminster to celebrate work to foster healthier representations of body image, kindly sponsored by Boots UK.\nAn ongoing campaign by Dr Luke Evans, MP for Bosworth, to place a label on images where body proportions have been digitally manipulated received a significant boost this week as it forms part of the newly announced Women’s Health Strategy.\nThanks to Dr Luke’s continued efforts and campaign to foster healthier representations of body image, the Women’s Health Strategy makes reference to future policy on digitally altered images including mandatory labels when body proportions have been digitally manipulated.\nThe Women’s Health Strategy, a 10-year plan, is the first of its kind for England and aims to look more holistically at women’s health. The strategy hopes to create a seamless journey for women as they engage with health services throughout their life.\nIn the document there is an acknowledgement of the issue of body image, stating “The government acknowledges the possible link between digitally altered body images and mental health, including the potential harms such a link may cause. The Government will consider further proposals to tackle body image issues related to digitally altered images, such as mandatory kite marks, as part of the Online Advertising Programme and our future plans for mental health.\n“The Government’s priority will be ensuring that any intervention is evidence-based and makes a real and positive difference and will set out its approach in due course.”\nThis assurance by the government follows news that household-brands such as Marks and Spencer, John Lewis, Dove, Boots and Boohoo Group have signed Dr Luke’s Body Image Pledge. The Pledge is a voluntary commitment which brands, charities and organisations have taken to not digitally alter a person’s body proportions in any advertising or direct imagery.\nDr Luke Evans MP said “This is an issue which affects many people. Men and women, young and old. I’m pleased to see the proposals for a label on images where body proportions have been digitally altered incorporated in the Women’s Health Strategy.\n“I believe it is testament to the need for change on this issue that such prominent companies are supporting my campaign. Many of which have been working to their own honest-advertising principles long before I became an MP, but current momentum behind the Body Image Pledge shows that we are stronger when we come together as one.\n“By taking this voluntary commitment these organisations have acknowledged the detrimental impact that viewing warped and unrealistic body proportions can have on a person’s mental health and body image. It’s a big step in promoting responsible advertising.\n“I urge other brands, charities and organisations to show the same commitment towards fostering healthier representations of body image and sign the Pledge.”",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk_cdn-cgi_l_email-protection/content_31.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_drlukeevans_org_uk_/https_www_drlukeevans_org_uk/content_1.html": "Dr Luke's campaign success: securing a re-commitment to funding for Leicester’s hospitals 20th January 2025 Read full article Contact me Dr Luke Evans MP10 Priory Walk, Hinckley, LE10 1HU07920 619812[email protected]On FacebookOn Twitter Hinckley and Bosworth MP warns against over-regulating football 29th April 2025 Read full article Find me on Twitter Am I Your MP? Enter your postcode Postcode Hinckley & Bosworth Constituency\nDr Luke's campaign success: securing a re-commitment to funding for Leicester’s hospitals 20th January 2025 Read full article"
}