{
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_node_7810/content_7.html": "I am very pleased to hear my right hon. Friend commit to the efficient use of defence spending, which we may not have seen in the past. Will he comment on the excellent example of his recent...",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_contact/content_13.html": "Skip to main content\nMain navigation\nHome\nNews\nContact\nContact\nLeave this field blank\nAssociation Office\n60 Bolton Street, Bury, BL9 0LL\n01617644548\nFind me on Facebook\nFollow me on Twitter\nFollow my Photos\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_cookies/content_16.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_CYCLOPS/content_15.html": "James Daly has welcomed new measures by the Conservative Government to tackle anti-driver road schemes and overzealous traffic enforcement, helping to reduce journey times for motorists as part of its long-term Plan for Drivers.\nDraft statutory guidance for councils has been published on Low Traffi\nEarlier today, James Daly MP for Bury North met with the Managing Director of Transport for Greater Manchester to discuss the latest phase of the Bee Network and the £3.57 billion in funding from the Government’s City Region Sustainable Transport Settlement (CRSTS).\nHow do we judge ourselves?\nI am in the position where quite rightly many in my constituency have strong views on my actions, views, votes and conduct as their Member of Parliament. MP’s like everyone else are not perfect and do not pretend to be.\nIt was recently announced by Transdev, the company which operates the 467/468 “Trax” bus service that connects Bury, Fairfield Hospital and Rochdale along Rochdale Old Road that “due to funding for extra journeys from Transport for Greater Manchester coming to an end”, the service has been reduced t\nIn a question in the House of Commons to the Secretary of State for Transport, it was confirmed to Bury North MP, James Daly, that a lane rental scheme could be coming to Greater Manchester soon.\nBut what is a lane rental scheme?\nAs global inflation driven by Putin’s illegal war in Ukraine continues to put pressure on households, the Conservative Government is delivering its £94 billion cost of living support package to help vulnerable and low-income families across the country.\nThis is why, as part of this recor\nA stark example of the incompetent manner, in which the Labour Party have run our local council has been seen recently in the extraordinary admission that Bury MBC overvalued its investment in Manchester airport by almost £15 million.\nAs a result, Bury Town Hall has wiped £14.8 million from its bal\nJames Daly welcomes the beginning of the Conservative Government’s Network North plan, which will invest £1 billion of HS2 savings to deliver long-term improvements to bus services across the Midlands and the North.\n£150 million of this funding is being invested now with Greater Manchest\nThe Conservative Government has consistently supported families in the face of global high inflation through our £94 billion Cost of Living support package including 26 million payments through our Household Support Fund.\nThat is why this Conservative Government has launched Household Support F\nWorking class heritage is in the spotlight once again as Historic England announces further funding to uncover the stories of people and places often missing from the history records.\nCastles, cathedrals and grand country houses are well documented but far less is known about ‘everyday heri",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_ourplan/content_2.html": "We have a positive plan for our area of Bury North - created from feedback from local residents like you!\nWe want to hear your views on Our Plan for Bury North to help shape the future of our area!\nYou can share your views using the button below, or look at the work we've done on our Our Plan points below 👇",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_about-james-daly/content_17.html": "Born in Huddersfield, James spent most of his working career as a criminal defence solicitor and local councillor in Bury. Before his election to Parliament, James was a partner in a local Law Firm where he was also head of the Conveyancing Department. He is a governor of two schools and was, until recently, Chair of a nursery school that was recently awarded an outstanding Ofsted inspection.\nHe is 41 and has lived and worked in the North West for 16 years. He is married to Jo, and has two young sons.\nIn his spare time, James is an avid rugby league and cricket supporter.",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk/content_1.html": "Campaigns\nLatest news\nFollow me on Twitter\nMy Plan\nLike my Facebook Page!\nGet in touch with me!\nAssociation Office\n60 Bolton Street, Bury, BL9 0LL\n01617644548\nBury North\nDissolution of Parliament\nMuch of the content on this website was established while I was a Member of Parliament. As Parliament has been dissolved there are no MP's until after the General Election on 4th July.\nStay in Touch with me!\nIs James your Candidate?\nEnter your postcode to confirm that James Daly is your candidate.",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_work-experience/content_18.html": "I offer work experience opportunities to students from the constituency. The placement gives young people an insight in to local politics and a chance to boost their skills. Students will be able to help with a number of tasks:\n- Casework, depending on the age and ability of the student\n- Researching an issue\n- Taking press-cuttings\n- Writing press releases\n- Accompanying the MP to a meeting or event in the House or in the Constituency\n- Assisting with office duties\n- Answering queries from constituents, either by 'phone or by email\nPlease contact us to enquire about work experience in my office.",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_node_7811/content_8.html": "Skip to main content\nMain navigation\nHome\nNews\nContact\nDefence Funding: Efficient Spending | Defence | Commons debates\nWhat steps he plans to take to ensure efficient use of increased defence funding.",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_news_james-daly-welcomes-ps3726146-conservative-government-funding-support-children-send-across/content_20.html": "James Daly has welcomed the news that Bury is set to benefit from £3,726,146 of funding to ensure children with special educational needs and disabilities (SEND) and alternative provision (AP) receive an education that meets their needs in high-quality environments for the years to come.\nThe Conservative Government are investing a record annual £850 million in councils to create new places for young people with SEND and AP in mainstream and special schools. This will provide specialist support for children with autism, learning difficulties, mobility difficulties, and more to meet their extra needs.\nSince coming into office, this Conservative Government has opened 108 new special schools, with a further 92 on the way, so every child can access the right support at the right time, and benefit from a world-class education.\nThis marks a tripling in previous levels of investment with this £2.6 billion package from 2022 to 2025. This Government is delivering 60,000 more special needs places since 2010 to ensure no parent has to fight for the right support for their children.\nThe Conservative Government are sticking to the plan to ensure all children, including those with SEND and AP, are able to make the most of their world-class education so they can secure a brighter future for themselves, their families, and our country.\nCommenting, James Daly MP said:\nI want every child within my constituency to have the same opportunity to meet their potential, so it is vital that children with SEND and AP get the support and resources they need.\nI am, therefore pleased to see that the Conservative Government are investing £3,726,146 in Bury which will deliver the education that meets the needs of children with SEND, as the Conservative Government sticks to the plan to deliver on their promise of a brighter future for this generation and the next.\nCommenting, Education Secretary Gillian Keegan said:\nToday we are taking another step to ensure our education system provides all children with the very best start in life.\nWe are making sure no parent has to battle to get the right type of school to meet their needs, and improving the school estate so all children are taught in the best classrooms for generations to come",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_news/content_5.html": "James Daly says Thank You for your support Wednesday, 31 July, 2024 Hi everyone, I hope you’re all safe and well. I wanted to take a moment to address you directly now that the dust has settled from the General Election. As many of you know, I had the great honour of representing Bury North in Parliament. It has been a privilege to serve this community, and I’m incredibly grateful for the trust you placed in me over the years. Four weeks ago, the people of Bury... Local News\nA clear plan and bold action to cut taxes and reward hard work for people across Bury North 18th June 2024 The UK has faced unprecedented challenges in recent years caused by the pandemic and Putin’s illegal invasion of Ukraine. By sticking with the plan, the... Local News\nHappy Eid Al Adha 17th June 2024 I wanted to take this opportunity to wish every single Muslim across Bury North joy and peace on Eid al Adha. I am wishing all Muslims across Bury North joy... Local News\nThe Conservative Manifesto - What will Bury North see? 14th June 2024 Conservative Party Manifesto: a clear plan taking bold action to deliver a secure future for Bury North The UK has faced unprecedented challenges in recent... Articles\nJames Daly will deliver for older people - From the Manifesto 13th June 2024 Conservative Party Manifesto: a clear plan taking bold action to deliver a secure future for pensioners across Bury North The UK has faced unprecedented... Articles\nJames Daly MP welcomes 8.5% increase to the State Pension 9th April 2024 As of Monday 8th April, the State Pension has risen by 8.5%, in line with average earnings growth from last year, as per the triple lock guarantee. This means... Westminster News\nHelp support the East Lancashire Railway 9th April 2024 East Lancashire Railway (ELR) has been a huge part of our community in Bury for many years and its infrastructure is just as integral as the steam and diesel... Local News\nJames Daly welcomes £3,726,146 of Conservative Government funding to support children with SEND across Bury 26th March 2024 James Daly has welcomed the news that Bury is set to benefit from £3,726,146 of funding to ensure children with special educational needs and disabilities (SEND... Local News\nConservative Party Chairmen visits Radcliffe FC game 25th March 2024 On Saturday 23rd March, Conservative Party Chairman, Richard Holden went to see Radcliffe FC play against Ashton United. He was accompanied by Bury North MP... Local News\nHome Secretary visits Bury to discuss knife crime 25th March 2024 On Friday 22nd March, Home Secretary James Cleverly visited Bury to hear about the knife crime challenges facing Bury. He was joined by Bury North MP James Daly... Local News\nState Retirement Pensions: Arrears | Department for Work and Pensions | Written Answers To ask the Secretary of State for Work and Pensions, if he will make an assessment of the potential merits of providing additional information on (a) his Department's website and (b) the State...\nDefence Funding: Efficient Spending | Defence | Commons debates What steps he plans to take to ensure efficient use of increased defence funding.\nDefence Funding: Efficient Spending | Defence | Commons debates I am very pleased to hear my right hon. Friend commit to the efficient use of defence spending, which we may not have seen in the past. Will he comment on the excellent example of his recent...\nFootball Governance Bill | Commons debates This is a unique regulatory Bill, in that it regulates the preservation of football clubs—in my view, it is regulation to save something, rather than regulation regarding competition. It is...\nFootball Governance Bill | Commons debates I am very interested in what the hon. Gentleman says. There are some very important points regarding redistribution, but there is also a very important point about the competent management of...\nFootball Governance Bill | Commons debates My hon. Friend makes a sensible point, which not many people will know: Bury and Bolton were in essentially the same financial situation. Both had gone into administration at the same time. The...",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_parliament/content_3.html": "Tweet Here, you can see James Daly's latest speeches and appearances in Parliament (provided by theyworkforyou)\nState Retirement Pensions: Arrears | Department for Work and Pensions | Written Answers To ask the Secretary of State for Work and Pensions, if he will make an assessment of the potential merits of providing additional informati\nDefence Funding: Efficient Spending | Defence | Commons debates I am very pleased to hear my right hon. Friend commit to the efficient use of defence spending, which we may not have seen in the past.\nDefence Funding: Efficient Spending | Defence | Commons debates What steps he plans to take to ensure efficient use of increased defence funding.\nFootball Governance Bill | Commons debates This is a unique regulatory Bill, in that it regulates the preservation of football clubs—in my view, it is regulation to save something, ra\nFootball Governance Bill | Commons debates My hon. Friend makes a sensible point, which not many people will know: Bury and Bolton were in essentially the same financial situation.\nFootball Governance Bill | Commons debates The hon. Member—as he knows, I am from the same part of the world as him—is making some excellent points.\nClause 1 - Designation of High Streets | High Streets (Designation, Review and Improvement Plan) Bill | Public Bill Committees It is a pleasure to serve under your chairmanship, Sir Charles. I warmly welcome the Bill, but may I make one point?\nBusiness of the House | Commons debates The Mayor of Greater Manchester’s vanity project of a 493-square-mile clean air zone has cost the taxpayer nearly £100 million.\nBusiness of the House | Commons debates The Mayor of Greater Manchester’s vanity project of a 493-square-mile clean air zone has cost the taxpayer nearly £100 million.",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_news_conservative-party-chairmen-visits-radcliffe-fc-game/content_14.html": "On Saturday 23rd March, Conservative Party Chairman, Richard Holden went to see Radcliffe FC play against Ashton United. He was accompanied by Bury North MP James Daly.\nRadcliffe recently completed the building of a new 3G pitch, funded with £1.8 million from the government’s Football Foundation, plus a further £600,000 from the local authority.\nRichard Holden MP said:\nThe Community Ownership Fund has been a really big issue for this area, especially with James’ historic work with Bury Football Club and getting that over the line.\nBury was the first big outlier of these larger Community Ownership Fund things because they need more money than had been given to smaller funds previously.\nComing up today was just to see what the guys, Paul and the team behind Radcliffe Borough, what they are looking to do now with Radcliffe Cricket Club, and what they can do for the future of that.\nThe Community Ownership fund is funding from the government to support community groups in England, Scotland, Wales and Northern Ireland to take ownership of assets and amenities at risk of being lost. £1 million from this fund was given for the community purchase of the historic Gigg Lane.\nSpeaking on the new Independent Football Regulator, Holden said:\nProtecting clubs from unscrupulous ownership, that’s one side of it. On the other side is that bigger long-term thing on that deal between the EFL (English Football League), which represents smaller clubs, versus the Premier League.\nWe want it to generously support the rest of the entire football period, including clubs like Radcliffe and Bury, so that we don’t see in the future as many financial pressures on them. We want to see that movement up and down, which is exactly what fans want to see, clubs being able to move up and down.\nThe fanbases want to see that too, that there is potential some day for clubs like Radcliffe or Bury to move up the football table, theoretically all the way to the top, and its important that that is maintained.\nJames Daly MP said:\nIt was wonderful to have Richard Holden with me at the Radcliffe game, this past weekend. Football is a big part of our community here in Bury and it was great to see the passion and support the fans have for the team.\nThe Community Ownership Fund and the government’s Football Foundation are allowing our teams in Bury to be able to get the facilities and dedicated owners that clubs need to succeed.\nThe Independent Football Regulator is long overdue and the work that it will do to ensure that clubs like Bury FC don’t fall into the wrong hands and lead to collapse from poor management will be crucial to the sports success from the ground up.\nThe new government legislation establishes the Independent Football Regulator as a standalone body, independent of both government and the football authorities. The body will be equipped with robust powers revolving around three core objectives: to improve financial sustainability of clubs, ensure financial resilience across the leagues, and to safeguard the heritage of English football.\nUnder the Football Governance Bill, new owners and directors will face stronger tests to stop clubs falling into the wrong hands and face the possibility of being removed and struck off from owning football clubs if they are found unsuitable.\nFor the first time, clubs from the National League all the way to the Premier League will be licensed to compete in men’s elite football competitions in England. The proposed licensing regime will be proportionate to any problems, size and circumstances and involve a system of provisional and full licenses, to give clubs time to transition.\nPrime Minister Rishi Sunak said:\nFootball has long been one of our greatest sources of national pride. Up and down the country, it brings people together in celebration or commiseration.\nBut for too long some clubs have been abused by unscrupulous owners who get away with financial mismanagement, which at worst can lead to complete collapse – as we saw in the upsetting cases of Bury and Macclesfield Town.\nThis Bill is a historic moment for football fans – it will make sure their voices are front and centre, prevent a breakaway league, protect the financial sustainability of clubs, and protect the heritage of our clubs big and small.",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_map-locations/content_4.html": "Skip to main content\nMain navigation\nHome\nNews\nContact\nMy map",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_news_happy-eid-al-adha/content_6.html": "I wanted to take this opportunity to wish every single Muslim across Bury North joy and peace on Eid al Adha.\nI am wishing all Muslims across Bury North joy, peace, and prosperity on this blessed occasion of Eid Al Adha.\nMay your sacrifices be rewarded, and your prayers be answered. Enjoy the festivities!",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_node_7807/content_22.html": "I am very interested in what the hon. Gentleman says. There are some very important points regarding redistribution, but there is also a very important point about the competent management of...",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_campaigns/content_19.html": "Your views on immigration policy Having delivered Brexit, the UK can now control immigration again. So help shape our immigration policy - by letting me know your priorities.\nReverse Labour's cuts to the 467/468 bus service It was recently announced by Transdev, the company which operates the 467/468 “Trax” bus service that connects Bury, Fairfield Hospital and Rochdale along...\nIncreasing Face-to-Face GP Appointments Last year, Bury had the lowest number of Face-to-Face GP Appointments in the country. I started a petition to increase the number of Face-to-Face GP Appointments available. More doctors and investment is a good start. But we can go further. So why not share your priorities for improving our local NHS by completing and returning this short survey?\nLocal Crime Survey We’ve recruited 20,000 extra police officers - which means 1,280 for our area! So why not share your priorities for them?\nThe Big Radcliffe North and Ainsworth Survey I want to hear your priorities for Radcliffe North and our nation. The Boundary Commission has been considering where the boundary of each constituency should...\nCampaign to save the Fusiliers Museum grant I have started a campaign to save the £62,000 grant the Fusiliers Museum receives from Bury Council. This is a fantastic cultural and historical institution for...\nReport a Broken Street Light As we head towards the longer, darker nights, it is vital our street lights are in full working order to ensure we are all kept safe on our streets. If you have...\nShould Bury Re-Join Lancashire? With the recent turmoil over the Greater Manchester Mayor's plan to charge motorists, I started thinking, just how much do people feel close to GM or Lancashire...\nJames Daly's Pothole Patrol If you see a pothole across Bury, Ramsbottom or Tottington you can use this tool to report it and I'll do whatever I can to ensure it's filled in!",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_news_help-support-east-lancashire-railway/content_21.html": "East Lancashire Railway (ELR) has been a huge part of our community in Bury for many years and its infrastructure is just as integral as the steam and diesel engines that rely on it for the safety of their passengers and crew.\nThat is why I am supporting ELR’s bid for funding from the Community Ownership Fund so that Higher Woodhill Viaduct can get the necessary renovations it needs to be able to keep functioning safely.\nBut the ELR also needs your help. To get involved head over to their website or use this link: Support the Viaduct - The East Lancashire Railway (eastlancsrailway.org.uk) and fill in the form at the bottom of the “Support the Viaduct” page",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_news_category_Reports/content_11.html": "Update on the Nationality and Borders Bill 25th April 2022 As you will be aware, in order to protect this country, the Home Secretary has the power to deprive someone of their British citizenship where it would not... Reports\nChanges to blood donation criteria and how you can register! 14th December 2020 Please share to try and boost our blood donor numbers! Today the Government are making a landmark change to the criteria to be a blood donor: Reports",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_node_7806/content_10.html": "This is a unique regulatory Bill, in that it regulates the preservation of football clubs—in my view, it is regulation to save something, rather than regulation regarding competition. It is...",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_school-visits/content_12.html": "Every year, MPs welcome hundreds of schoolchildren to Parliament and I am always tries to meet visitors from the constituency to talk about the politics and history of Westminster, the work of an MP and about local issues.\nIf you would like to book a tour of the Palace of Westminster, please contact my office.\nTours can be booked for groups of 20 people and repeated tours from the same school are acceptable. Unfortunately, I cannot meet travel costs.\nFor more details, such as the best times to arrange a tour of Parliament, please visit www.parliament.uk/visiting/visiting-and-tours/ukvisitors . Please be aware that tours do need to be booked months in advance.\nThere are also free educational visits which, in addition to a tour of the Palace, offer children and students the chance to learn more about Parliament through interactive workshops. There is also a travel subsidy available to state schools which could cover up to 75% of your travel costs.\nAll bookings are made by phone, one school term in advance, on a given date. To make a booking for an educational visit, please visit www.parliament.uk/education/visiting-parliament .",
  "https_www_jamesdaly_org_uk_/https_www_jamesdaly_org_uk_news_conservative-manifesto-what-will-bury-north-see/content_9.html": "Conservative Party Manifesto: a clear plan taking bold action to deliver a secure future for Bury North\n- The UK has faced unprecedented challenges in recent years caused by the pandemic and Putin’s illegal invasion of Ukraine. By sticking with the plan, the Conservatives have restored economic stability, reduced inflation, boosted wages, created more jobs, cut taxes and increased growth. But there is more to do.\n- That is why the Conservative Party’s 2024 election manifesto will set out a clear plan, backed by bold action, to secure a brighter future for people across Bury North. The manifesto promises to continue cutting taxes for working people and the self employed, introduce a new Help to Buy scheme for first time buyers, and deliver 100,000 new high-quality apprenticeships for young people – funded by reforming welfare and tackling tax avoidance.\n- Only the Conservatives have a clear plan and will take the bold action needed to deliver a brighter and more secure future for generations to come.\nJames Daly has welcomed the launch of the Conservative Party’s 2024 election manifesto, setting out a clear plan and bold action to build a brighter future for people across Bury North\nAs part of the clear plan to support working people and build a strong economy, the Conservatives will continue to cut taxes for workers and the self-employed, protect pensioners through the Triple Lock Plus, give working parents 30 hours of free childcare for children aged nine months to when they start school, and end the unfairness in Child Benefit by moving to a household system, so families don’t start losing Child Benefit until their combined income reaches £120,000.\nFor young people, the Conservatives will provide a more secure future by creating more opportunities, from introducing mandatory National Service to funding 100,000 high quality apprenticeships. They will transform 16-19 education by introducing the Advanced British Standard, and we will protect children by banning phones during the school day to focus on education and ensure transparency with parents over what children are being taught.\nTo safeguard our borders and national security, the Conservatives will boost defence spending to 2.5 per cent of GDP by 2030, introduce a legal cap on migration to guarantee that numbers will fall every year and stop the boats by removing illegal migrants to Rwanda.\nBold action will also be taken to strengthen public services and local communities, including increasing NHS spending above inflation every year, recruiting 8,000 new police officers and cutting antisocial behaviour, and investing £36 billion in local roads, rail and buses and backing drivers.\nThe Conservatives will also help more people onto the housing ladder by abolishing Stamp Duty for homes up to £425,000 for first time buyers and introduce a new Help to Buy scheme, as well as championing our rural communities and continuing to invest in communities across Scotland, Wales and Northern Ireland.\nThe choice is clear in this election: stick with the clear plan and bold action to deliver a brighter future with Rishi Sunak and the Conservatives, or go back to square one with Keir Starmer and the same old Labour Party who have no plan and would just increase taxes by £2,094.\nJames Daly said:\n“I know the past few years have been challenging following Putin’s illegal invasion of Ukraine and Covid, which is why we have a clear plan to deliver a brighter and more secure future.\n“Our bold action will support working people, young people and pensioners to build a stronger economy, provide young people with more opportunities for a secure future, safeguard our borders and national security, and strengthen our communities.\n“The choice for voters at this election is clear: stick with Rishi Sunak and the Conservatives who have a clear plan and will take the bold action needed to secure a brighter future for people across Bury North. Or go back to square one with Keir Starmer and the same old Labour who will put up taxes by £2,094 for every working household.\nThe Prime Minister Rishi Sunak said:\n“We Conservatives have a plan to give you financial security. We will enable working people to keep more of the money you earn because you have earned it and have the right to choose what to spend it on.\n“Keir Starmer takes a very different view. He says he’s a socialist, and we know what socialists always do: take more of your money. And we know that the plans Labour have already announced will require them to increase taxes on working households by £2,094.\n“We Conservatives have had to take difficult decisions because of Covid. But we are now cutting taxes for earners, parents and pensioners.\n“We are the party of Margaret Thatcher and Nigel Lawson, a party, unlike Labour, that believes in sound money.\n“In this party, we believe that it is morally right that those who can work do work, and that hard work is rewarded with people being able to keep more of their own money. We will ensure that we have lower welfare so we can lower taxes.”"
}