{
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_parliament/content_7.html": "It has been the greatest honour to represent Stafford as your Member of Parliament.\nAs your local candidate at the forthcoming General Election, I am looking forward to getting out on the doorstep over the coming weeks to listen to you and discuss my track record of delivery for Stafford.\nAhead of tomorrow’s Budget, Theo Clarke MP joined neighbouring MPs to push the Chancellor (the Rt. Hon. Jeremy Hunt MP) to increase investment in Stafford and the West Midlands.\nAhead of the Autumn Statement, Stafford MP Theo Clarke, alongside neighbouring MPs, met the Chancellor to raise her priorities on behalf of Stafford residents.\nTheo Clarke and the Leader of the House of Commons Penny Mordaunt have visited Beaconside as the Stafford MP continues her opposition to its use as accommodation for asylum seekers.\nTheo showed the cabinet minister the building and area on Friday and told her about local people’s concerns that hous\nStafford MP Theo Clarke will meet with the Home Secretary to discuss plans to house asylum seekers at Beaconside after raising the issue in Prime Minister’s Questions on her first week back from maternity leave.\nSerco has appealed against a decision by the council refusing permission to house peopl\nTheo Clarke MP for Stafford returned to parliament today (Monday) following six months’ maternity leave caring for her daughter.\nShe swore an oath of allegiance to King Charles in the House of Commons – something Mrs Clarke had been allowed to delay with the permission and support of The Speaker wh",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_birth-trauma-report/content_4.html": "Welcome, I am delighted to announce the publishing of Listen to Mums: Ending the Postcode Lottery on Perinatal Care.\nThe Inquiry's report was launched on the 13th of May 2024 in the Palace of Westminster. This is the culmination of the APPG for Birth Trauma's work over the past nine months. Please find a link to the report at the bottom of this page.\nIf you wish to reference our report, please use the following citation:\nAll-Party Parliamentary Group on Birth Trauma Listen to Mums: Ending the Postcode Lottery on Perinatal Care (2024)\nBackground\nOn the 9th of January 2024, the All-Party Parliamentary Group (APPG) on birth trauma in the UK Parliament set up an inquiry to investigate the reasons for traumatic birth and to develop policy recommendations to reduce the rate of birth trauma. Research shows that about 4-5% of women develop post-traumatic stress disorder (PTSD) after giving birth – equivalent to approximately 25,000-30,000 women every year in the UK. Studies have also found that a much larger number of women – as many as one in three – find some aspects of their birth experience traumatic. Birth Trauma affects 30,000 women across the country every year. 53% of women who experienced birth trauma are less likely to have children in the future and 84% of women who experienced tears during birth, did not receive enough information about birth injuries ahead of time.\nThe cross-party inquiry was led by Theo Clarke MP and Rosie Duffield MP and aims to find out more about the experiences of women who have been affected by traumatic birth. The inquiry gathered written and oral evidence to inform the policy report which includes practical policy recommendations for the UK Government. Seven sessions to hear evidence ran on consecutive Mondays in Parliament between the 5th of February and the 18th of March 2024.\nThe inquiry invited written submissions both from parents and from professionals who work in maternity. It was open to everyone in the UK, and we particularly welcomed submissions from people from marginalised communities such as those who were racially minoritised, LGBT, economically disadvantaged, homeless, asylum seeking or displaced, care experienced, neurodivergent or facing any other circumstances which means their voice was less likely to be heard.\nThe Inquiry objectives were to:\n1. Identify common features in maternity care (antenatally, during labour and birth, and postnatally) that contribute to birth trauma.\n2. Highlight examples of good practice, both in the quality of maternity care and in providing support to women who have had traumatic birth experiences.\n3. Look at the impact of birth trauma on women’s relationships, ability to bond with their baby and future decision-making (e.g. whether to have another baby, whether to return to work).\n4. Find out whether current postnatal services to diagnose and treat women’s physical and mental health problems are up to scratch. This would include, for example, looking at whether severe obstetric tears are being diagnosed promptly, whether mental health problems are being identified at the six-to- eight-week check, and whether perinatal mental health teams are accepting and treating women within an appropriate time frame.\n5. Develop parameters for understanding the possible economic cost of birth trauma, with a view to informing future research.\n6. Influence government policy by identifying areas where maternity care could be improved to minimise birth trauma and by highlighting ways in which postnatal support can be optimised to meet women’s physical and psychological needs after traumatic birth.",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_news_parliament-theo-clarke-mp-highlights-importance-support-parents-children-special-educational/content_10.html": "Theo Clarke MP for Stafford recently held a roundtable on Autism in Stafford. Following this roundtable, Mrs Clarke asked the Minister for Children, Families and Wellbeing about the new support the Government will be providing for parents of children with special educational needs?\nTheo Clarke MP for Stafford:\n“I welcome the Government’s new improvement plan on special educational needs and disabilities. I recently held an autism roundtable in Stafford to discuss the pressures parents are facing with gaps in support locally. What new support will now be available for parents of children with special educational needs?”\nClaire Coutinho MP, Minister for Children, Families and Wellbeing:\n“I thank my hon. Friend for that question and for meeting me when she pressed me on this issue. We will be putting lots of things in place for parents, but in particular we will be ensuring that a specialist workforce is in place, that increased funding is going into schools and that there is better communication from councils, which is one of the new standards we will be bringing in. Hopefully, all that will help give parents confidence in the system. On the particular challenge with EHCPs, we will be streamlining and digitising them, which will hopefully help parents with the bureaucracy of trying to get their children the support they need.”",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_cookies/content_9.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_parliamentary-and-sag-members/content_6.html": "Parliamentary Committee of Inquiry:\nChair: Theo Clarke MP (Member of Parliament for Stafford)\nCo-Chair: Rosie Duffield MP (Member of Parliament for Canterbury)\nVice-Chair Cherilyn Mackrory MP (Member of Parliament for Truro & Falmouth)\nVice-Chair Bell Ribieiro-Addy MP (Member of Parliament for Streatham)\nMark Pawsey MP (Member of Parliament for Rugby)\nDarren Henry MP (Member of Parliament for Broxtowe)\nHelen Morgan MP (Member of Parliament for North Shropshire)\nSally-Ann Hart (Member of Parliament for Hastings & Rye)\nSpecial Advisory Group (SAG) Members:\nDr Kim Thomas – CEO of the Birth Trauma Association, Secretariat for APPG for Birth Trauma\nNikki Wilson – CEO of Make Birth Better\nRhiannon Evans – Head of Communications and Public Affairs at Mumsnet\nLaura Seebohm – CEO of Maternal Mental Health Alliance\nGill Castle – Owner of Stoma Chameleon and Birth Trauma Campaigner\nChloe Oliver – CEO of the MASIC Foundation",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_news_theo-clarke-mp-pushing-investment/content_11.html": "Ahead of the Autumn Statement, Stafford MP Theo Clarke, alongside neighbouring MPs, met the Chancellor to raise her priorities on behalf of Stafford residents. This included asking for measures to tackle flooding, invest in our high streets and support for small businesses, the lifeblood of our economy.",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk/content_1.html": "Latest news Breaking the Taboo serialised in Mail on Sunday Theo Clarke is pleased to announce the Daily Mail's serialising of her upcoming… Theo Clarke meets Royal College of Midwives Theo Clarke was delighted to meet with the Royal College of Midwives (RCM), as… Breaking the Taboo with Theo Clarke, Episode 10 This week our host Theo is joined by Dr Jessica Heron, the Chief Executive of… Contact Information Theo Clarke FacebookTheo Clarke TwitterTheo Clarke InstagramTheo Clarke LinkedIn\nBreaking the Taboo serialised in Mail on Sunday Theo Clarke is pleased to announce the Daily Mail's serialising of her upcoming…\nTheo Clarke meets Royal College of Midwives Theo Clarke was delighted to meet with the Royal College of Midwives (RCM), as…\nBreaking the Taboo with Theo Clarke, Episode 10 This week our host Theo is joined by Dr Jessica Heron, the Chief Executive of…",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_news_breaking-taboo-available-pre-order/content_8.html": "I am delighted to announce that my book, Breaking the Taboo, is now available for pre-order. You can find the links here on Biteback Publishing's website. Thank you for your support. Together, we will make a difference on birth trauma.\nI am delighted to announce that my book, Breaking the Taboo, is now available for pre-order. You can find the links here on Biteback Publishing's website. Thank you for your support. Together, we will make a difference on birth trauma.",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_media/content_2.html": "Ms Clarke is an experienced communicator and has dealt with the media on topics as varied as art, birth trauma, and sustainable development. Some of her media appearances can be found here.\nTheo Clarke is pleased to announce the Daily Mail's serialising of her upcoming book, Breaking the Taboo. It can be read physically and online. The first section can be read here.\nMs Clarke appeared on Sky News' Kay Burley Show alongside Gill Walton (Chairwoman of the Royal College of Midwives) to discuss a recent report highlighting an increasing number of mothers and babies dying during, or soon, after childbirth.You can watch the interview here (note: on X).\nMs Clarke appeared on GMB this morning to discuss the increase in newborn babies and mothers dying during and shortly after pregnancy. Ms Clarke discussed her story and the findings of the APPG on Birth Trauma's report.\nMs Clarke is delighted to announce the launch of her Global Birth Trauma Alliance.Ms Clarke stated: \"Today I am launching the new Global Birth Trauma Alliance to campaign for change to improve maternity care in the UK and around the world. We need a #MeToo movement for birth trauma.\nMs Clarke was featured in The Times today. The piece criticised the Health Secretary (West Streeting) for failing to act on promises made in the wake of the APPG on Birth Trauma's report launch in May.\nTheo Clarke appeared on the Today Programme this morning to discuss the findings of the Care Quality Commission's report into British maternity services. She stated that it was 'absolutely outrageous' that poor maternity care was not becoming the exception.\nTheo Clarke contributed to an important article by The Guardian, released today, concerning the National Childbirth Trust's focus on 'natural births'. Ms Clarke believes it is vitally important that mothers have the right to make an informed choice about the method of giving birth.\nStafford MP Theo Clarke was today interviewed by Channel 5 News on the launch day of her Birth Trauma Inquiry. Watch the recording below to hear her powerful case for action.\nThe Daily Mail covered Ms Clarke's Birth Trauma Inquiry, focussing on the 'lived experience' of mothers impacted by it. The article commented on the praise given to Ms Clarke by the Health Secretary, Victoria Atkins.",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_theo-clarke_org_uk/https_www_theo-clarke_org_uk_about-theo/content_5.html": "Theo Clarke was the Member of Parliament for Stafford. She chaired the first parliamentary inquiry into birth trauma in British history and previously set up the All-Party Parliamentary Group for Birth Trauma in the House of Commons. Theo has served as parliamentary private secretary at the Departments for Education, Business and Trade and HM Treasury, in addition to being trade envoy for the Prime Minister. She won Speech of the Year at the Parliamentarian of the Year Awards and was included in the prestigious Top 100 Women in Westminster list in 2025 and 2024.\nTheo hosts the hit podcast 'Breaking the Taboo' which ranks in the Top 5 most listened to shows in the UK for alternative health. Prior to being elected, Theo was the Chief Executive of the Coalition for Global Prosperity, backed by the Gates Foundation. She currently sits on the Board of the United Nations Association UK as their Vice Chair."
}