{
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-mp-joins-prime-minister-and-other-female-members-parliament-commemorate-100th/content_63.html": "Amanda Milling, MP for Cannock Chase joined other female Members of Parliament as the Prime Minister launched a series of year-long events and exhibitions to mark 100 years since some women were given the right to vote. On 6th February 1918, Parliament passed the Representation of the People Act 1918 which reformed the electoral system enabling all men over 21 to vote and, for the first time, giving some women the right to vote.\nThere are now a record number of women in the House of Commons, with 208 women elected to Parliament at the General Election in 2017. Theresa May and the Conservatives have a proud record of promoting women in politics. The first woman to sit in the House of Commons was Conservative MP, Nancy Astor. In addition to this, the Conservatives were the first party in the western world to elect a female Prime Minister, Margaret Thatcher.\nAmanda Milling MP said: “It was a real honour to join the Prime Minister and other female Members of Parliament at the event to mark the 100th anniversary of women having the right to vote. We have come a long way in 100 years. I am pleased to say that we have more female Members of Parliament than ever before and I am particularly proud that the Conservative Party have had two female Prime Ministers.”\nThe Cannock Chase MP is now calling on more women to stand for public office and represent the Conservative Party at all levels “I am very keen to see more women involved in politics, and more women representing and working within the Conservative Party at all levels. I remember when I left school fewer than 10% of MPs were women, it is now 32%. That is real progress but we definitely need to do more to encourage more women into politics.”",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_my-week-westminster-02022016/content_16.html": "As your MP I am very aware that Westminster seems like a long way from Cannock Chase in more ways than one. With this blog I can tell you a little bit about what I do in Westminster during the week – if I was to write about everything this would be rather long and very dull… so here is a flavour!\nIn addition to the normal duties of a Member of Parliament I sit on a number of Select Committees, which convene each week. Most weeks I will have a session of both the Business, Innovation & Skills (BIS) Committee and the Sub-Committee on Education, Skills and the Economy.\nIn the BIS Committee this week, we had the first oral evidence session forour inquiry into Exports and the role of UK Trade & Investment (UKTI). This saw academics and business groups share their views and opinions regarding UK exports. The aim of this particular inquiry is to look at whether the Government’s export targets are achievable, and to make sure businesses are getting sufficient support and encouragement from the Government and UKTI to export our great British products and services.\nOn Tuesday I spoke in the second reading of the Enterprise Bill. I used my speech to call for apprenticeships to be given a higher profile and status in order to increase their uptake. Whilst Cannock Chase has been topping the Staffordshire tables for apprenticeship starts, I want to see more young people get the opportunity to start an apprenticeship and progress to a higher level apprenticeship. You can watch my speech can be found here - http://goo.gl/MEG9U4.\nOn Wednesday I had the opportunity to promote the gem that is Cannock Chase and, in particular, talk about the great cycling trails which are suitable for both mountain bikers and families. I have also been shown proposals by a local cycling charity, Cycle_R, to convert disused rail lines on the Chase into new bike trails, something I found very interesting.\nThursday was less exciting, as the day was lost in a whirlwind of back to back meetings that seemed to blur into one!\nToday, I have been back in Cannock Chase discussing local economic issues such as training and careers advice for young people and new development sites for businesses with the Chairman of our Local Enterprise Partnership. The day has ended with a busy few hours drafting my latest e-newsletter and writing to constituents.\nI hope you found this diary entertaining, I will post another one next week and, as always, if you have any issues or need my help with anything, please email me on [email protected], call me on 01543 877142 or pop into my constituency on Market Street in Hednesford.\nI hope you have a nice weekend!",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-mp-calls-debate-illegal-waste/content_65.html": "Amanda Milling, Member of Parliament for Cannock Chase, has called for a Parliamentary debate on the issue of illegal waste.\nIn a recent debate, the Cannock Chase MP called on the government to set aside time in Parliament to debate the issue of illegal waste sites and fly tipping, following her calls to review and tighten environmental laws.\nCiting local residents' experience as 'horrendous', Amanda Milling has been seeking a review of regulations, enforcement action and the introduction and implementation of stricter penalties following a fire at an illegal waste site in Slitting Mill, near Rugeley. With illegal waste dumping becoming an increasing problem nationally, as well as in Staffordshire, the Cannock Chase MP believes it is time for the government, the Environment Agency and local authorities to step up action to tackle the issue.\nStaffordshire has seen two large fires at illegal waste sites in recent months. The first was a fire at a farm in Slitting Mill which saw 1,000 tonnes of illegally dumped waste burn, taking over two weeks for Staffordshire Fire and Rescue bring it under control. The waste was then capped with soil but continues to burn underneath the stack six months on. More recently there was a fire at Milton, Stoke-on-Trent, centred on a building containing 1,500 tonnes of recycled plastics. According to the Environment Agency, the company, Hanbury Plastics Recycling (Stoke) Ltd, did not have an environmental permit and had been issued with legal notices to clear waste plastics.\nFly-tipping has also been well documented and publicised recently and is causing much local concern with 471 cases of fly-tipping in Cannock Chase last year, according to figures released by the Department for Environment, Food and Rural Affairs.\nAmanda Milling said: “The Slitting Mill fire was horrendous for local residents and the cost of managing it has been a significant pressure for the fire service. Six months on it is still burning underneath the soil cap and continues to emit smoke. I want to see local authorities and agencies to make sure they are using all of their powers to tackle illegal waste dumping and where it is required legislation tightened to make it harder for such sites to spring up. Illegal waste sites are a problem in Staffordshire and present a real fire risk, but we are not alone, this is an increasing issue nationally and a significant cost to the tax-payer.\"\nShe added: “Illegal waste sites are just one part of them problem, fly-tipping is just as serious and can result in rural roads, industrial estates and many other places becoming a dumping ground for irresponsible individuals. We need to step up moves to address these issues. On the one hand we need to make sure legalisation is tightened but we also need to ensure locally the laws are used.\"\nThe Cannock Chase MP has been working with Staffordshire Fire & Rescue Service and other agencies to learn lessons from the incident at Slitting Mill, adding:\n\"The fire at Slitting Mill highlighted numerous issues. The fire should never have happened in the first place, begging questions as to whether agencies were being sufficiently robust in dealing with the illegal waste dumping in the first instance and previous fines clearly hadn't acted as a deterrent. When the fire did occur it was clear that the Fire Service were limited in what they could do as there were conflicting priorities from the other various agencies involved. We need to learn lessons need from this in terms of ensuring a co-ordinated, effective and efficient response. This is one of the many issues that I have been working on with the Fire Service, other agencies and government ministers over the last few months.\nThe Cannock Chase MP is currently seeking to secure a debate in Parliament to raise the profile of the problem and urge on Ministers to review policy.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-mp-highlights-cannock-chase%E2%80%99s-superfast-broadband-lottery/content_55.html": "Amanda Milling, MP for Cannock Chase, yesterday raised the concerns of local residents and businesses in Parliament’s debate about the variations that exist in terms of superfast broadband roll out. Amanda drew on the complaints and issues raised by constituents in casework as well as a survey that she recently conducted.\nEarlier this year, a survey conducted by uSwitch identified Sandy Lane in Cannock as having the fastest broadband in the whole country. However, as Amanda described, not all residents and businesses across the Cannock Chase constituency enjoy such fast broadband speeds.\nIn her speech, Amanda cited Keys Business Park as an example of an area which has yet to be superfast enabled. This follows a recent visit to a business, Bluechipworld Sales and Marketing Ltd, manufacturers of high tech devices and a key supplier to Tesco.\nAmanda commented:\n“Bluechipworld’s design team are based here in Cannock. With a site in China they are regularly having to send designs over to their offices there. You can imagine how shocked I was to learn that it can take anywhere between 4 and 6 hours for these designs to be transmitted. For me, this demonstrates how important it is that we get superfast broadband rolled out as quickly, efficiently and universally as digital connectivity is key to improving our businesses and, in turn, our country’s productivity.”\nAmanda also criticised BT for listing areas as being ‘available to order’ where the service is not actually available, citing the woes faced by residents of Fair Oaks in Birches Valley.\nAmanda said:\n“Fair Oaks in Birches Valley is served by the Rugeley exchange and a street cabinet both of which have been upgraded to deliver fibre broadband. However, the way in which the technology has been employed means that the properties are too far from the street cabinet for a cable to be connected. You can imagine my surprise when I went onto the Superfast Staffordshire website which states the area is superfast ready. I am very concerned that this is not the case and that there is a danger these properties miss out on connection if this is not highlighted. I also believe that this is very misleading to consumers.”\nAmanda added:\n“It is good news that more premises across our area are getting access to superfast broadband. As we become increasingly reliant on technology it is essential that we all have good mobile and broadband coverage and speeds. It is great news that the residents of Sandy Lane in Cannock have the fastest broadband speeds in the country but I want to ensure that all residents and businesses of Cannock Chase enjoy these broadband speeds and in superfast time.”\nAmanda will be seeking a meeting with BT representatives to pursue the issue for local residents and businesses.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_general-election-2024/content_9.html": "The Prime Minister has called a General Election which will be held on the 4th July.\nIt is an incredible honour to be your Member of Parliament and I will be campaigning to remain your MP.\nI am proud to represent Cannock Chase and I want to continue to be your champion and go to Westminster to fight for all you that live here.\nOver my time as your Member of Parliament we have delivered many successes together. These have included:\n• £20m Levelling Up investment to regenerate Cannock town centre\n• Additional funding for local transport improvements across Cannock Chase\n• Better local train services\n• Getting more police on the streets and £500,000 Safer Streets funding\n• And in Rugeley, Staffordshire’s first through-school\nThis is on top of growing our economy, saving the average worker £900 a year, tackling immigration and so much more.\nI have also been active day in and day out supporting residents with their problems, lobbying ministers and supporting local businesses.\nOver the weeks ahead, I look forward to speaking to as many of you as possible in my campaign to continue to be your local MP and to set out my vision on how we continue to improve Cannock Chase in the years ahead.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_devastating-events-afghanistan/content_27.html": "It’s been truly devastating to watch the events unfolding in Afghanistan. Day by day we’ve seen heartbreaking scenes of men, women and children trying to leave.\nEarlier in August Parliament was recalled so that the Prime Minister could update the House on the action the Government would take and has been taking since then.\nThe United Kingdom, and many in Cannock Chase, have played a huge role in Afghanistan over the past decades.\nThis is why the Prime Minister made clear we will do everything we can to help those in Afghanistan.\nUnder extreme and tense circumstances over 12,000 people have been evacuated and more than 7,300 eligible local staff and their families have been welcomed to the UK as part of the Afghan Relocation and Assistance Policy. We will continue this effort until the deadline.\nThe Government and local councils across the country are working to resettle the many thousands of Afghan nationals. We owe it to the brave men and women who worked with us on the frontline.\nRight here in Cannock Chase we are playing our part. Already we have offered to support interpreters and their families to find new homes. As the Defence Secretary has said: “We have always made clear that nobody’s life should be put at risk because they supported the UK Government to promote peace and stability in Afghanistan.”\nThe Government’s immediate priority has been on evacuations of British citizens and Afghan staff, but we will continue to work with the international community to agree a joint approach to respond to the situation in Afghanistan going forward.\nIf you need any assistance, please email me on [email protected], write to me at 11a Market Street, Hednesford, Cannock, WS12 1AY, call 01543 877142 (during office hours). Please always ensure you have provided your full name and address.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_local-election-results/content_22.html": "I am delighted that the Conservatives have increased their majority on Cannock Chase District Council in the recent local elections.\nThis is a clear reflection of the brilliant job the local Conservatives are doing to deliver for the people of Cannock Chase.\nIn my last column, I set out the local Conservatives’ ambitious plans for our area and what they have already achieved for the people of Cannock Chase.\nI would like to say a huge congratulations to all of those elected - and a massive thank you to everyone who helped during the campaign and, of course, everyone who voted Conservative.\nIn Westminster, the Conservative Government is also delivering for the people of the UK.\nAt the close of the latest Parliamentary Session, we have delivered new laws that are laying the foundations for a stronger and fairer Britain – driving up standards in the NHS, taking back control of our borders, making the most of our Brexit freedoms and helping to level up the whole country.\nNow that we have left the EU, we have introduced new laws to allow public authorities to financially support British businesses without facing burdensome red tape, and to ensure we have world leading standards of animal welfare.\nWe have also taken important steps to strengthen our borders and crack down on dangerous criminals in the UK. The Nationality and Borders Act clamps down on people smuggling gangs and makes it easier to remove those from the UK with no right to be here.\nIt also confirms our ability to relocate illegal immigrants as part of the Government’s landmark Migration and Economic Development Partnership with Rwanda.\nMeanwhile, the Police, Crime, Sentencing & Courts Act introduces tougher sentences for the most serious crimes, which along with the Judicial Review & Courts Act means the police and courts now have the powers they need to target the most dangerous criminals and deliver justice for victims.\nAs ever, if you have any issues at all that you need my help with, email me at [email protected], call 01543 877142 or visit www.amandamilling.com/contact",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_cannock-chase-mp-calls-higher-profile-and-status-apprenticeships/content_71.html": "Amanda Milling, Member of Parliament for Cannock Chase used a speech in Parliament to call for apprenticeships to be given a higher profile and status in order to increase uptake.\nWhilst Amanda Milling MP recently welcomed figures which showed that Cannock Chase topped the tables in Staffordshire for apprenticeship starts between August and October last year, she wants to see more young people get the opportunity to start an apprenticeship and progress to higher level apprenticeships in 2016.\nIn the debate, Amanda showed her support of the Government’s Enterprise Bill which will see the term apprenticeship protected in the same way the term ‘degrees’ is protected. The legislation will mean that only those qualifications that meet statutory requirements can be described as an apprenticeship.\nShe also welcomed a recent announcement by the Secretary of State for Education which will mean that schools will have to offer balanced career advice, promoting both university degrees and apprenticeships.\nIn her speech, Amanda called on the government to do more nationally to promote apprenticeships to help address awareness and understanding of apprenticeships, as well as their value. She called for a national advertising campaign to increase the profile of apprenticeships, similar to the ‘Exporting is GREAT’ campaign. The Minister of State (Minister for Small Business, Industry and Enterprise), The Rt Hon Anna Soubry announced that there were plans for such a campaign in the Spring.\nAmanda, a keen advocate of apprenticeships, has been promoting apprenticeships both in Parliament and in Cannock Chase and last year ran an event with local businesses to outline the benefits of taking on an apprentice. In her speech, she outlined the benefits of apprenticeships to businesses as well as to those that become apprenticeships.\nWith the majority of apprenticeships being Level 2, Amanda called for more to be done to encourage apprentices to go on to higher levels, with a report published last Autumn by the Sutton Trust suggesting that the earning potential of people who have undertaken higher level apprenticeships rivals that of people with degrees.\nAmanda Milling said: “University degrees are not right for all, with some young people and careers better suited to apprenticeships. This is why I am pleased the government is doing more to put apprenticeships and degrees on a level footing. It is important that only high quality apprenticeships can be called such and this is why I am pleased that the term ‘apprenticeship’ will be protected. I also believe that it is really important that we guide young people to all the options available to them after school – whether that be academic or vocational qualifications, such as apprenticeships.\nShe added: “Cannock Chase businesses and young people have been embracing apprenticeships, with us recently topping the Staffordshire tables in terms of apprenticeship starts. But I want us to continue to encourage young people to take this chance to ‘earn while you learn’, and become an apprentice which will give them all the skills to have a great career.\nYou can read Amanda’s speech in the debate by clicking here – http://www.publications.parliament.uk/pa/cm201516/cmhansrd/cm160202/debtext/160202-0003.htm#16020271000472.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_events_feed/content_56.html": null,
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-announces-winners-cannock-chase%E2%80%99s-best-independent-shops-and-market-stalls-2014-/content_48.html": "Prospective Conservative MP for Cannock Chase, Amanda Milling has announced who has been crowned the Cannock Chase’s winning best independent shops and market stalls.\nThe local shop titles were won by three relative newcomers to our high streets, Caffe Del Nino in Cannock, Sheepcraft Yarns in Hednesford and Pretty on the Inside in Rugeley. The winning market stalls were two very well established market traders The Chicken Stall (in Cannock’s Indoor Market) and Meat to Please You (Rugeley market).\nThe competition asked people to vote for their favourite independent retailer over the last month and Amanda announced the results as part of Small Business Saturday.\nAmanda said: “This competition was a small way of letting our local retailers know how much we appreciate and support them.\n“Here in Cannock Chase, we are really lucky to have many wonderful and unique independent shops who are the lifeblood of our communities.\n“The competition was really close across all the categories but we have five very worthy winners. It is great to see such a range of different types of businesses win as well as the well-established and newcomers to our high streets.\n“It was a real privilege to visit each of the winners and give them the good news and present them with their certificate. Once again I would like to congratulate each of them.\n“I’d also like to put on record my thanks to all of those who supported our independent retailers by voting in the competition.”",
  "https_www_amandamilling_com_/https_www_amandamilling_com_parliament/content_33.html": "For more information about what Amanda does in her role as Member of Parliament for Cannock Chase, please use the links on the left. You can also read Amanda's latest speeches and appearances in Parliament below:\nFor more information about what Amanda does in her role as Member of Parliament for Cannock Chase, please use the links on the left. You can also read Amanda's latest speeches and appearances in Parliament below:",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_chase-line-update/content_20.html": "Train users in Cannock Chase have faced more than their fair share of issues over the years. These have included trains being delayed, cancelled, or terminated early, as well as persistent incidents of antisocial behaviour (ASB) and fare-dodging.\nMany of these issues have been actioned for passengers, with new trains, longer platforms and the lines’ electrification. However, some problems have remained, including the last service from Birmingham New Street.\nThis train only goes as far as Hednesford, stopping short of Rugeley. This means passengers are often forced to rely on lifts from family and friends, or taxi services, to get home to Rugeley.\nWhile I appreciate timetabling is an immensely complicated issue, Network Rail is responsible for this decision. I have written to the Chief Executive, Andrew Haines, to again reiterate the need for the last service of the day to reach Rugeley.\nIssues around ASB and fare-dodging are also frequently reported by constituents. I recently met with West Midlands Trains (WMT) and heard about the innovative ways they are tackling ASB on the Chase Line.\nThis work is contributing to a much-improved train performance with fewer services being held up to get unruly passengers off the train. Opportunities for people to fare-dodge are also being closed down and more people are being fined.\nI have witnessed first-hand how the actions of a minority of train users impacts everyone else using the service. And while I welcome the work being done by WMT, it is clear much more needs to be done to put an end to ASB on our trains.\nI am proud the Government is committed to delivering the biggest investment in our railways since Victorian times. Investment is expected to be £47.9 billion between 2019 and 2024.\nI know many workers are now returning to the office and need the Chase Line to get to work. With this in mind, I will work even harder to ensure passengers get the service they deserve.\nAs ever, if you have any issues you need my help with, please email me at [email protected], call 01543 877142 or visit www.amandamilling.com/contact.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_ps20m-plan-cannock-town-centre/content_14.html": "The Conservatives have today (Saturday 1st June) announced 30 more towns will each benefit from £20 million as part of their Long-Term Plan for Towns, taking the total number of towns in the programme to over 100. Local people in each town will decide how the money will be used for long-term regeneration of their area.\nTalent is spread evenly across the UK, but opportunity is not. The Conservatives’ levelling up plans have begun to address this, with £15 billion of government funding and billions more in private investment creating real improvements already. But we will go further.\nLabour has offered no plan for how to improve these towns. Instead, they have criticised the Conservatives for directing this funding to the places that need it most.\nThrough freeports and investment zones, the Conservatives have turbocharged private investment in places that have been overlooked. Already, these zones have attracted new businesses, generated billions in private investment and created thousands of jobs where they are most needed.\nLocal people, not those in Westminster, will decide how the money will be spent. New Town Boards will be set up to bring together community leaders, businesspeople, local government, and the local MP, to develop and deliver the plan for their town. Bringing decision makers closer to the people and businesses this transformational funding will affect is an important element of this plan.\nAmanda Milling, Conservative candidate for Cannock Chase, said:\n\"I am thrilled that Cannock will benefit from a further £20 million to transform the town as part of the Conservatives’ Long Term Plan for Towns. This builds on the £20 million of Levelling Up funding to regenerate the town centre.\n\"I have been working hard to ensure Cannock Chase attracts investment, so this new funding is excellent news. If re-elected I will continue to champion Cannock Chase to attract even more investment into all of our towns to make our area an even better place to live and work.\"\nRishi Sunak, Prime Minister said:\n“We the Conservatives have a plan for towns because we know they are the beating heart of our country. This bold action will transform 30 more towns – reviving their high streets, growing their local economies and making people feel proud of the place they call home. Labour’s record in government shows they don’t care about towns – neglecting their needs, allowing them to decline and focusing instead on cities. Sir Keir Starmer has no plan to unlock opportunities in towns and would take us back to square one. Building on our strong track record of levelling up in Teesside and the Midlands, we will go further across the country to build a secure future for our children and grandchildren.”\nMichael Gove, Levelling Up Secretary, said:\n“This bold action will be transformational for towns around the country. It will allow local people to take back control - creating better jobs, improving transport and generating more investment. The Conservatives have a clear plan to spread opportunity so that talent and hard work, not geography, determine people’s life chances. Sir Keir Starmer has no plan and no idea how to help people help themselves, just patronising platitudes that would take us back to square one.\"",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_demolition-rugeley-power-station-cooling-towers/content_19.html": "Last weekend we saw the iconic cooling towers of Rugeley demolished.\nFor some of you they were where you worked. For me they’ve always been my sign that I’m back home.\nThere is no doubt this is an end of an era as the last link to our area’s mining history is removed from the landscape.\nWhilst many of us will miss those towers that represent our industrial heritage and for so long dominated the landscape we must also look forward.\nIn the month of the G7, an event that brings leaders from across the globe together to discuss how we can protect our planet for future generations, this is Cannock Chase’s contribution to that mission.\nNot only will this site become home to thousands of people and will have sustainability at its core with low carbon homes.\nRugeley will be central to a project to design a new zero carbon smart local energy system for the town. This project which will show how such a system can reduce carbon and energy costs for local residents.\nIn November we will be hosting COP26 to highlight climate change, the environment and net zero are a global issue.\nI’m proud that right here in Cannock Chase we’ll be playing our part and accelerating the United Kingdom’s path to a greener future.\nAlso this site will have space for new employment opportunities – bringing jobs and investment to our area. And ensure the next generation get the skills they need at a new John Taylor MAT through school.\nThe demolition of the cooling towers marks the end of an era, we now need to look forward to new opportunities for Rugeley.\nAs always, if you have any issues you need my help with, please email me on [email protected], call 01543 877142 or visit www.amandamilling.com/contact.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_sgt-watchman-v-features-again-parliament/content_68.html": "Cannock Chase MP, Amanda Milling, has saluted the Staffordshire Regimental mascot in Parliament a year after he was crowned the “Paw-blic” favourite in the 2016 Westminster Dog of the Year competition.\nSpeaking in Parliament the Cannock Chase MP praised the work undertaken by Sgt Watchman V and his handler, Greg Hedges, promoting the Staffordshire Regimental family and wider armed forces causes across the county.\nWatchman was crowned the Westminster Dog of the Year “Paw-blic” vote winner in 2016 and the Cannock Chase MP was keen to salute his work raising the profile of the military community over the past year.\nWatchman is a regular attendee at military parades, ceremonies and remembrance events with his handler giving up much of his free time to undertake his role. This enables Watchman to also support a number of military causes including the Royal British Legion Poppy Appeal, RSPCA and many other local charities.\nAmanda Milling MP said: “I am a big fan of Watchman and I am always impressed by the work he and his handler do to support local regimental history and many local charities. This week saw a new “Westminster Dog of the Year” crowned, however Watchman was a real hit last year and holds a position steeped in history. We are so lucky to have such an iconic, hardworking and loved mascot as our symbol, and I wanted to share my admiration in Parliament on the anniversary of his achievement in the 2016 Westminster Dog of the Year competition.“\nSgt Watchman V is a Staffordshire bull terrier and mascot of the Staffordshire Regimental Association. He was previously the mascot for the Staffordshire Regiment, before it was disbanded in 2007 and merged with other regiments to form the Mercian Regiment.\nSgt Watchman V is the fifth mascot to bear the name Watchman and the latest in a line of mascots stretching back to 1882.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_cannock-chase-mp-amanda-milling-raises-rugeley-miners-memorial-damage-parliament/content_53.html": "Amanda Milling, Member of Parliament for Cannock Chase, has raised the damage caused to the Rugeley Miners Memorial with the Government.\nIn September, a new memorial to the 115 miners who were killed underground while working at the Lea Hall and Brereton Collieries was unveiled in Rugeley. The request for the memorial originally came from Lea Hall and Brereton Collieries Memorial Society in 2011. The memorial is four imposing miners statues created by Andy De Comyn. The four nine foot sculptures located on Globe Island in Rugeley are made from concrete resin and weigh between 1500-2000kg. Recently on a Saturday night, one of the four statues was severely damaged when a car crashed into it and fled the scene. The damage has, rightly, caused a lot of upset in Rugeley and an appeal has been made for anyone with information to contact Staffordshire Police.\nSpeaking in the House of Commons, Amanda Milling MP asked the Rt Hon John Whittingdale MP, The Secretary of State for Culture, Media and Sport to condemn the actions of the callous driver.\nAmanda Milling said: “I had the honour and privilege to attend the unveiling on the memorial. The damage that has been done is just awful. It is so upsetting to see the damage caused, not only because it is in memory of the local miners who died, but because so many people and local groups like Lea Hall and Brereton Collieries Memorial Society worked so hard to make the project a reality.”\nRt Hon John Whittingdale MP, The Secretary of State for Culture, Media and Sport said: “I entirely share my hon. Friend’s feelings. I was concerned to hear about the damage to the memorial to the miners who lost their lives, especially as it came so soon after more than 2,000 people lined the town’s streets for its unveiling in September. I am sure that the whole House will join my hon. Friend in condemning the actions of the person responsible.\"\nHe added that: “I can tell her that my Department administers the memorial grant scheme. If a registered charity is responsible for the care of the memorial, it will be able to benefit from a refund of VAT paid on repair work.”\nAmanda welcomed the support available from the refunding of VAT and reminded the public that anyone with information should come forward saying, “The damage to the car would be very obvious, so please do the right thing and notify the police. I know everyone looks forward to the statue being restored to it’s former glory.”\nAnyone who may have witnessed the crash should call Staffordshire Police on 101, quoting incident 91 of November 28, or call Crimestoppers anonymously on 0800 555 111.\nPicture source: http://www.expressandstar.com/wpmvc/wp/wp-content/uploads/2015/12/miner4.jpg",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_supreme-court-article-50-judgement/content_67.html": "The voters of Cannock Chase were clear on 23rd June 2016 in the EU referendum with the majority voting for the UK to leave the EU.\nThe Supreme Court have this morning judged that Parliament will be required to vote on whether to trigger Article 50. I will uphold the will of my constituents and will vote in Parliament to trigger Article 50 when the Bill comes to the House.\nThere has already been a non-binding vote on this issue on Wednesday 7th December 2016.\nThe motion stated Parliament \"should respect the wishes of the United Kingdom as expressed in the referendum on 23 June; and further calls on the Government to invoke Article 50 by 31 March 2017\".\nI supported this motion and will continue to support the will of the people and my constituents.\nI will also support the Government in getting the best trade deal with the EU for the UK. I believe the Prime Minister outlined a clear plan as to how we are going to act and the opportunities it offers the UK.\nThe Prime Minister said that the government plan will:\n• Provide certainty where it can;\n• Control our own laws;\n• Strengthen the Union;\n• Maintain the Common Travel Area with the Republic of Ireland;\n• Control immigration;\n• Preserve rights for EU nationals in Britain, and British nationals in the EU;\n• Protect workers’ rights;\n• Protect free trade with European markets, while leaving the Single Market;\n• Seek new trade agreements with other countries;\n• Make the UK the best place for science and innovation;\n• Maintain cooperation in the fight against crime and terrorism;\n• Ensure a smooth, orderly Brexit without a ‘cliff edge’.\nThis is a sensible and clear plan and the Government has my full support seeing the democratic will of the people fulfilled.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-mp-supports-wear-it-pink/content_59.html": "Amanda Milling MP poses in pink at Westminster to support Breast Cancer Now’s vital research.\nAmanda Milling, Member of Parliament for Cannock Chase, has dressed in pink to lend her support to Breast Cancer Now’s flagship fundraiser, wear it pink, which will see thousands of people across the UK adding a splash of pink to their outfits on Friday 20 October and raise vital funds for breast cancer research.\nAmanda Milling is encouraging her constituents in Cannock Chase to join her, and sign up to take part in the UK’s biggest pink fundraiser. The event, which takes place during October’s Breast Cancer Awareness Month, is in its 16th year and has raised over £30 million to date for Breast Cancer Now’s life-saving research.\nAmanda Milling joined fellow parliamentarians in Westminster to show her support for the thousands of women and men affected by breast cancer each year, encouraging people across the UK to take part on wear it pink day.\nAnyone can take part in wear it pink, which brings together schools, workplaces and communities. All you need to do is wear something pink, or hold a pink event at home, work or school, and make a donation to Breast Cancer Now. Whatever you do, you’re helping the charity achieve its aim that, if we all act now, by 2050 everyone who develops breast cancer will live.\nAmanda Milling MP said: “Breast cancer is the most common cancer in the UK. One in eight women will face it in their lifetime, and every year around 11,500 women and 80 men lose their lives to the disease. This is why I’m urging everyone in Cannock Chase to take part in wear it pink on Friday 20 October. It’s such a fun and easy way to support Breast Cancer Now’s vital research, and help stop breast cancer taking the lives of those we love.\nAlso in attendance was Sky News presenter and former Olympic gymnast Jacquie Beltrao. Jacquie, who was diagnosed with breast cancer in 2013, is lending her support to wear it pink in the hope that thousands of people across the country will take part in the event.\nJacquie Beltrao said: “I’m very proud to support wear it pink; it’s a great excuse to dress up in pink and have some fun while raising money for a really important cause. I have had breast cancer myself and following my diagnosis and treatment have become incredibly passionate about raising awareness and funds for research.\n“Wear it pink has raised over £30 million to date for Breast Cancer Now, which is incredible. The event raises funds for the charity’s world-class research, which will hopefully one day put a stop to this dreadful disease. That is why I’m asking people across the country join me, and the MPs who took part in Westminster, by adding a splash of pink to their outfits on wear it pink day and donating to Breast Cancer Now. I hope lots of people across the UK take part!”\nBaroness Delyth Morgan, Chief Executive at Breast Cancer Now, said: “It is fantastic that so many MPs dressed up in pink at our Westminster wear it pink event and we are really grateful for all of the support and enthusiasm shown. We hope that by wearing pink, Amanda Milling will encourage her constituents in Cannock Chase to get involved in their local community and help us fund life-saving research this Breast Cancer Awareness Month. Wear it pink is a wonderful opportunity for communities across the UK to come together and have fun, whilst showing their support for everyone affected by breast cancer. Simply by wearing something pink and donating, you’re raising funds for life-saving research and helping Breast Cancer Now reach our goal that, by 2050, everyone who develops breast cancer will live.\nTo take part in wear it pink this October, please visit wearitpink.org/2017 for further details, fundraising ideas and how to register for your free fundraising pack.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-mp-raises-cannock-chase-ancient-woodland-debate/content_69.html": "Amanda Milling, Member of Parliament for Cannock Chase, has spoken in a debate on ancient woodland and used the opportunity to speak of the importance of Cannock Chase to the local area.\nThis general debate on the protection of ancient woodland and trees was timely as the Cannock Chase MP had been on a tour of the Chase only the week before with the team from Cannock Chase AONB. This tour was an opportunity for Amanda to see the variety of the Chase’s landscape and habitat as well discuss some of the challenges faced in terms of balancing human use of the Chase with the protection of the natural environment.\nThis debate gave the MP for Cannock Chase the opportunity to talk about the contribution Cannock Chase makes to the local economy, local life as well as talk about the need to ensure visitors use the Chase in a responsible way.\nAmanda Milling said: “We are incredibly lucky to have the Chase on our doorstep. It is a beautiful landscape and there are lots of activities on offer for visitors and locals to enjoy. Whilst I am keen to encourage people to make the most of having this wonderful natural environment on their doorstep, it is also important that we do so in a responsible way. We need to ensure that the Chase is preserved for generations to come. I would like to thank the team at Cannock Chase AONB for taking me on a tour which gave me a valuable insight for the debate.\nAmanda added: “We need to protect and conserve the Chase which was designated an AONB in 1958 because of its beautiful landscape, wildlife and history. There are some simple measures we can take, for instance, parking at the designated parking areas, sticking to the trails and paths that are signposted and also washing boots to avoid plant and tree diseases being transmitted.”\nAmanda also took the opportunity to encourage people to take part in Staffordshire County Council’s consultation regarding the management of the countryside estate, including parts of Cannock Chase. She said: “Cannock Chase is not for sale but the Council is looking how best it can manage the site. While it they recognise that the current ownership and management of Cannock Chase is seen to be the most appropriate option, there are other managements setups the public can voice their opinion on. I know that, like me, the residents of Cannock Chase are passionate about the Chase and I would encourage them to take part in the consultation to ensure their voice is heard.”\nStaffordshire County Council is looking at a number of ways in which the Staffordshire County Council sites are managed. It has stated that its preferred option for Cannock Chase is the current setup, however it would like to know what the pubic think. Anyone wanting to take part in the consultation can do so by calling 0300 111 8000, e-mailing [email protected] or visiting http://www.staffordshire.gov.uk/yourcouncil/consultationandfeedback/consultation-and-feedback.aspx until 24th January.\nYou can watch the whole Westminster Hall debate here - http://www.parliamentlive.tv/Event/Index/7b6e79e2-f42b-48f4-a0e2-e908c5cb28a9\nYou can see Amanda’s speech here - http://goo.gl/HXRdRz",
  "https_www_amandamilling_com_/https_www_amandamilling_com_privacy/content_21.html": "This document outlines how Amanda Milling: processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Amanda Milling:\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Amanda Milling: .\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Amanda Milling: , or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Amanda Milling: via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_support-pensioners/content_30.html": "I hope that everyone had a lovely Easter break and enjoyed time with family and friends. Many people will have been visiting parents, grandparents, and extended family, enjoying quality time together.\nI know that many local people support the older members in their families and as a community we all want to assist our older generations and those who are more vulnerable.\nMany pensioners in Cannock Chase will live on fixed incomes, making many local pensioner households susceptible to rising prices because of high inflation. This is something that many local constituents have contacted me about, setting out their concerns and the squeeze on their household finances.\nI am delighted that this Conservative Government has delivered again on our commitment to protect the Triple Lock for pensioners. We have just seen the very welcome news that pensioners are now benefiting from the Government’s 10.1 per cent increase in the Basic State Pension from April 2023 – including 18,753 pensioners here in Cannock Chase. This represents the biggest ever cash increase in the state pension.\nAs the Government delivers on its five priorities, including halving inflation, this inflation-busting increase in the Basic State Pension will ensure pensioners’ income is protected.\nThis is not the only support for pensioners. In addition to this uplift, pensioners will benefit from another £300 Pensioner Cost of Living Payment this winter, continuing the Government’s direct support for those groups most vulnerable to the effects of high inflation caused by Putin’s illegal war in Ukraine.\nI know that the impact of rising prices has been particularly challenging for many households here in Cannock Chase, and not just pensioners who live on fixed incomes.\nIf you are struggling with the cost of living or your energy bills, please do get in touch with me. I can provide you with useful information and advice regarding your energy costs and what support is available to help with the cost of living.\nAs ever, please do not hesitate to raise any issues with me by telephone on 01543 877142, via e-mail at [email protected] or in writing to 11a Market Street, Hednesford, Cannock, Staffordshire, WS12 1AY.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_visit-visit-hawkins-logistics-brereton/content_32.html": "It was great to recently visit Hawkins Logistics in Brereton.\nHawkins are a long established logistics company and have been in the area for decades.\nIt was great to meet the team as well as learn more about the logistics industry and the different types of services Hawkins provide to small, medium and large businesses.\nI also saw how much Hawkins Logistics love being part of the local community.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_useful-links/content_5.html": "The official government website, a 'one stop shop' for all enquiries relating to government services.\nOfficial website which offers information about the House of Commons and the House of Lords.\nThe Citizens Advice service helps people resolve legal, money and other problems by providing free, independent and confidential advice.\nHundreds of new jobs are advertisied here each week for you to search through.\nNHS 111 health advice and information service allows you to check your symptoms online and find out how to get trusted information on conditions.\nWebsite for the Crimestoppers Trust that operates the 0800 555 111 hotline, this can be used to pass on information about crime anonymously.\nThe Warm Front scheme installs insulation and heating improvements to make homes more energy efficient.\nAdvice on consumers rights and the scams to avoid.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_anzac-day-2022/content_24.html": "Today we mark Anzac Day 2022.\nOn Sunday 24 April, I attended an annual Anzac Day service to commemorate the New Zealand Rifle Brigade being transferred to Brocton camp on Cannock Chase in 1917.\nThe service was also attended by representatives from the High Commissions of Australia and New Zealand, Her Majesty’s Lord Lieutenant of Staffordshire and Staffordshire’s High Sheriff - as well as members of the armed forces, local council mayors, chairmen and the MP for Stafford, Theo Clarke.\nThere has been a service on Cannock Chase to honour these fighters almost every year since 1918 – with ceremonies only cancelled during World War Two and during the Covid pandemic.\nCannock Chase War Ceremony has 93 Commonwealth graves, including 73 members of the New Zealand Rifle Brigade.\nWe owe a great debt of gratitude to all those who have fought to defend our country - but on Anzac Day we particularly remember those from Australia and New Zealand, including members of the New Zealand Rifle Brigade.\nI am very proud of the work carried out by local armed forces charities, including the Stafford Royal British Legion, to ensure that the bravery and sacrifices of the New Zealand Rifle Brigade are remembered here in Cannock Chase each year.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_about-rss/content_29.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_about-cannock-chase/content_11.html": "This seat was created for the 1997 General Election and was held by the Labour Party for 13 years. In 2010 a Conservative MP was elected at the General Election with a large 14% swing, the largest Labour to Conservative swing in the election.\nIn 2015 Amanda Milling was elected with a majority of 4,923, a further increase on the majority of the previous Conservative MP. This was increased further to 8,391 in 2017 and 19,897 in 2019.\nCannock Chase Constituency has the same boundaries as Cannock Chase District Council and includes the communities of Brereton & Ravenhill, Bridgtown, Brindley Heath, Cannock, Cannock Wood, Chadsmoor, Etching Hill, Hazel Slade, Heath Hayes & Wimblebury, Hednesford, Norton Canes, Rawnsley and Rugeley.\nThe constituency contains Cannock Chase, itself, an area of woodland and heathland, the smallest designated Area of Outstanding Natural Beauty in mainland Britain.\nThe area has a rich mining history and now the former mining sites are home to new businesses. The area has been extensively regenerated in the last few decades and has a growing economy.\nThe constituency is bordered by Walsall to the south, South Staffordshire to the West, Stafford to the North and Lichfield to the East.\nThe M6 Toll and A5 run through Cannock Chase and it is close to the M6, as well as several other major motorway routes. It is also served by the West Coast Main Line and the Rugeley to Birmingham commuter line, referred to as the Chase Line.\nThe seat has many parish councils which cover much of the constituency. The principle local authorities are Cannock Chase District Council and Staffordshire County Council.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_update-amanda-milling-mp/content_23.html": "During the recent Cabinet reshuffle, I was privileged to be given a new position in Government as Minister for Asia at the Foreign, Commonwealth and Development Office, focusing on the Asia brief. I’m looking forward to banging the drum for the United Kingdom on the global stage.\nWhile my new role in government will involve promoting Global Britain I will continue to work hard for the good people of Cannock Chase and make sure to put us on the map across the globe.\nSince being appointed to my new role I opened the flower festival at St Michael’s Church in Brereton, popped to the Gala in Cannock Park where the Blackwatch Pipe Band put on a fine show and attended the Rugeley Rifle Club annual awards. It’s been a real joy to see our community coming back to life as coronavirus restrictions have eased.\nI also had the privilege to open the new Digital Skills Centre at Cannock College. This state-of-the-art facility will allow people to gain digital related qualifications to enter specialised digital careers. This is a very welcome addition to our local college and it will help provide people across Cannock Chase with skills for jobs of the future.\nThe greatest honour of my life will always be becoming the Member of Parliament for Cannock Chase. I will continue to raise your concerns with the relevant authorities or Government ministers. Wherever I can, I will always seek to resolve the issues you bring to my attention.\nAs ever, if you need my assistance with any matters you can email me on [email protected], write to me at 11a Market Street, Hednesford, Cannock, WS12 1AY, call 01543 877142 or visit www.amandamilling.com/contact.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_record-funding-local-road-confirmed/content_36.html": "Highways related matters are frequently raised with me, whether this be the state of the roads, parking issues or congestion. As such, I am always urging the Government to make more funding available to Staffordshire County Council so they can get these issues addressed.\nThis is why I am thrilled that the Government announced Staffordshire’s £285 million allocation from the Local Transport Fund. This will see an unprecedented increase in transport funding for Staffordshire, with the view to improving everyday local journeys for people.\nLast year the Prime Minister committed to ensuring every pound that would have been spent on HS2 Phase 2 will be invested into transport improvements that benefit far more people, in far more places, far more quickly. Every penny of the £19.8 billion committed to the Northern leg will go to the North and every penny of the £9.6 billion committed to the Midlands leg will be distributed across the Midlands, with the £6.5 billion saved by our new approach to Euston benefitting the rest of the country.\nStaffordshire’s £285 million allocation from the Local Transport Fund is a historic level of funding that can be used for the transport infrastructure that local communities really want. The new funds can pay for new roads, new mass transit systems, more EV charge-points or refurbished bus and train stations, to filling in potholes.\nThe decisions as to how to spend the money will be made by locally elected representatives, not Whitehall. I will therefore be working with Staffordshire County Council as they develop their plans regarding the projects that will be funded from this unanticipated boost. I would therefore be keen to hear your views on what you believe the priorities should be here in Cannock Chase. Please do let me know either e-mailing me at [email protected] or calling on 01543 877142.\nThis latest announcement builds on the progress of delivering reallocated HS2 spending into new transport schemes across the country. The Government have extended the national £2 bus fare cap. They announced the first down payment of a £1 billion investment in buses, with £150 million being allocated over the next year across the North and Midlands. And the government set out details of the new £8.3 billion road resurfacing fund, with the first £150 million already reaching local authorities.\nI am sure you will agree that the Local Transport Fund is a fantastic opportunity to improve local transport infrastructure which will make a real difference to our everyday journeys.\nAs always, if you require my help with anything at all, please do not hesitate to contact me.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news/content_3.html": "Winter Fuel Payment Wednesday, 16 October, 2024 I am disappointed that my successor, Labour MP Josh Newbury voted to cut the Winter Fuel Payment. This was a political choice. Labour have turned their backs on vulnerable pensioners and have instead chosen to award inflation busting pay rises to their union masters. Join over 100,000 people and sign our petition to get Labour to stop this callous cut: keepwinterfuel.com Local News\n£20m plan for Cannock town centre 1st June 2024 The Conservatives have today (Saturday 1st June) announced 30 more towns will each benefit from £20 million as part of their Long-Term Plan for Towns, taking... Local News\nRecord funding for local road confirmed 26th May 2024 Highways related matters are frequently raised with me, whether this be the state of the roads, parking issues or congestion. As such, I am always urging the... Local News\nPrime Minister visits Cannock College 24th May 2024 It was fantastic to welcome the Prime Minister, The Rt Hon. Rishi Sunak, to Cannock College. The Cannock campus has been a real success story for South... Local News\nNew Community Diagnostic Centre at Cannock Chase Hospital 23rd May 2024 I recently visited the new Community Diagnostics Centre at Cannock Chase Hospital. It’s no secret that our NHS was badly hit by the pandemic. That’s why the... Local News\nGeneral Election 2024 22nd May 2024 The Prime Minister has called a General Election which will be held on the 4th July. It is an incredible honour to be your Member of Parliament and I will be... Local News\nArmed Forced Spending Increase 17th May 2024 When I am out and about speaking to constituents, it is clear just how much everyone values our Armed Forces. I have been lucky enough to spend time with the... Local News\nCannock Chase Cemetery Anzac Day ceremony 29th April 2024 This weekend I attended the Anzac Day ceremony at the Commonwealth War Graves Commission Cemetery on Cannock Chase. When the New Zealand troops returned home in... Local News\nSafety of Rwanda Bill received Royal Assent 29th April 2024 Last week we celebrated St. George’s Day, our national day where we take time to celebrate our history, our heritage, and our character; reflect on what it... Local News\nVisit to visit Hawkins Logistics in Brereton 26th April 2024 It was great to recently visit Hawkins Logistics in Brereton. Hawkins are a long established logistics company and have been in the area for decades. It was... Local News",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_cannock-chase-mp-speaks-about-importance-national-citizen-service/content_66.html": "Amanda Milling, Member of Parliament for Cannock Chase, has spoken in Parliament about the importance of the National Citizen Service (NCS) in helping young people kick start a successful career.\nSpeaking in the debate on the Queen’s Speech, the Cannock Chase MP outlined the benefits of the NCS, which is a voluntary programme open to 15 – 17 year olds and is designed to encourage personal and social development through activities requiring leadership, teamwork and communication. Since its introduction 200,000 young people have benefited from this life changing experience.\nAmanda Milling said: “It is not just our education system alone that can help to improve our young people’s life chances. The National Citizen Service is a fantastic programme that, to date, has enabled 200,000 15 to 17-year-olds benefit from new and different life experiences. I have been incredibly fortunate to see first-hand the benefits gained by young people in Cannock Chase who have taken part in the programme which is delivered locally by Coachright. I have joined participants in planning their community projects, packing bags for customers in Sainsbury’s to raise money for local charities and filling boxes for the Cannock and District Food Bank.”\nThe Cannock Chase MP wants to see young people better prepared for life after school and welcomed moves outlined by the government to extend the National Citizen Service to more young people, while also placing a duty on schools to make them promote the programme to their pupils and parents.\nAmanda Milling added: “At NCS graduation ceremonies I have seen how participants have grown in confidence, learned new leadership and team-building skills, and been truly inspired. I welcome plans to extend the scheme so that more young people from a variety of backgrounds can benefit from this life-changing experience. “\nCoachright is a not-for-profit organisation delivering sports and recreational activities in communities across the West Midlands, you can contact Coachright at www.coachright.co.uk. Anyone wanting to get involved in the National Citizen Service can find out more information on the website at www.ncsyes.co.uk.\nYou can watch Amanda’s speech here - http://goo.gl/i2ifRK",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_category_Speeches-in-Parliament/content_47.html": "Cannock Chase MP Speaks About Importance of the National Citizen Service 27th May 2016 Amanda Milling, Member of Parliament for Cannock Chase, has spoken in Parliament about the importance of the National Citizen Service (NCS) in helping young... Speeches in Parliament\nAmanda Milling MP encourages local groups to apply to the ‘Proceeds of Crime Fund’ 23rd March 2016 In Prime Minister’s Questions today, Amanda Milling, Member of Parliament for Cannock Chase, urged community safety groups from Cannock Chase to apply for... Speeches in Parliament\nCannock Chase MP Calls on Government To Review Energy Generation Policy 26th February 2016 Amanda Milling, the Member of Parliament for Cannock Chase, spoke this week in a debate in Parliament about Biomass. She used the debate as an opportunity to... Speeches in Parliament\nCannock Chase MP calls for higher profile and status for apprenticeships 6th February 2016 Amanda Milling, Member of Parliament for Cannock Chase used a speech in Parliament to call for apprenticeships to be given a higher profile and status in order... Speeches in Parliament\nAmanda Milling MP raises Cannock Chase in ancient woodland debate 22nd December 2015 Amanda Milling, Member of Parliament for Cannock Chase, has spoken in a debate on ancient woodland and used the opportunity to speak of the importance of... Speeches in Parliament\nCannock Chase MP Amanda Milling raises Rugeley Miners Memorial damage in Parliament 12th December 2015 Amanda Milling, Member of Parliament for Cannock Chase, has raised the damage caused to the Rugeley Miners Memorial with the G overnment. Speeches in Parliament\nAmanda Milling MP highlights Fire Authority savings failure 14th October 2015 Amanda Milling, Member of Parliament for Cannock Chase recently criticised Staffordshire Fire and Rescue Authority in Parliament for cutting frontline provision... Speeches in Parliament\nAmanda Milling MP highlights Cannock Chase’s superfast broadband lottery 13th October 2015 Amanda Milling, MP for Cannock Chase, yesterday raised the concerns of local residents and businesses in Parliament’s debate about the variations that exist in... Speeches in Parliament",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_category_Reports/content_43.html": "Record number of young people in Cannock Chase studying core academic subjects 3rd February 2015 Amanda Milling, Prospective Conservative MP, has welcomed the news that more students in Cannock Chase are studying the core academic subjects which will help... Reports\nNew jobs numbers show Conservatives’ long-term economic plan bringing more security to Cannock Chase 21st January 2015 Amanda Milling, Prospective Conservative MP for Cannock Chase has welcomed new figures showing 1,541 fewer people in Cannock Chase are now claiming Jobseeker’s... Reports\nNew figures show Conservatives’ plan is delivering security for families in Cannock Chase 19th December 2014 Amanda Milling has welcomed new figures showing 1,437 fewer people in Cannock Chase claiming Jobseeker’s Allowance compared to 2010 - a 65% per cent fall. Reports\nAmanda Milling announces winners of Cannock Chase’s Best Independent Shops and Market Stalls 2014 Competition 8th December 2014 Prospective Conservative MP for Cannock Chase, Amanda Milling has announced who has been crowned the Cannock Chase’s winning best independent shops and market... Reports",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_number-62-bus-will-not-be-withdrawn-june-2022/content_34.html": "I know how important the No 62 bus service from Cannock to Lichfield is to many residents across Cannock Chase.\nAfter concerns were raised about its possible withdrawal, I contacted the Traffic Commissioner for the West Midlands, Chase Rider and Staffordshire County Council to stress the importance of the No 62 bus route.\nI am pleased that Staffordshire County Council have stated the service is secure for the time being and will not be withdrawn in June 2022 as originally believed.\nWhilst this news is undoubtedly positive, Chase Rider maintains that the No 62 bus continues to make a loss. I would strongly encourage all residents to make as much use of the service as possible to demonstrate the importance this route holds to the local community.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_falklands-liberation-day/content_17.html": "Last week, we marked 40 years since the British Armed Forces liberated the Falkland Islands.\nI wholeheartedly salute the heroism of those who served in the Falklands War, and especially the 255 British troops who died in the conflict. Their bravery ensured the people of the Falklands Islands can be justly proud of the prosperous and secure future they have built for their islands since 1982.\nI have been heartened by the series of events which have been planned by the Royal British Legion in the run up to Liberation Day. I was especially proud that these events culminated in a special service at the National Memorial Arboretum in Staffordshire on 14 June.\nAs the Minister for the British Overseas Territories, I recently visited the Falkland Islands and attended the 40th anniversary of the liberation of Goose Green and laid a wreath in honour of those who gave their lives in the battle.\nIt was brilliant to see what's been built in the last 40 years – and to see their thriving economy, diverse communities and how the islands have reversed population decline. What's not changed is the islanders' determination to decide their own future - a cause that everyone should support.\nIn Cannock Chase I have been very concerned to read social media reports about the rise in anti-social behaviour on West Midlands Trains services, particularly on the Chase Line. Passengers should feel safe and comfortable on public transport and I am saddened to hear that this has recently not been the case for several of my constituents.\nPlease be assured that I have flagged this issue directly with both West Midlands Trains and the British Transport Police to request that urgent action is taken to help address this problem.\nAs ever, please do not hesitate to raise any issues with me by telephone on 01543 877142, via e-mail at [email protected] or in writing to 11a Market Street, Hednesford, Cannock, Staffordshire, WS12 1AY.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_category_Local-News/content_41.html": "Winter Fuel Payment 16th October 2024 I am disappointed that my successor, Labour MP Josh Newbury voted to cut the Winter Fuel Payment. This was a political choice. Labour have turned their backs on... Local News\n£20m plan for Cannock town centre 1st June 2024 The Conservatives have today (Saturday 1st June) announced 30 more towns will each benefit from £20 million as part of their Long-Term Plan for Towns, taking... Local News\nRecord funding for local road confirmed 26th May 2024 Highways related matters are frequently raised with me, whether this be the state of the roads, parking issues or congestion. As such, I am always urging the... Local News\nPrime Minister visits Cannock College 24th May 2024 It was fantastic to welcome the Prime Minister, The Rt Hon. Rishi Sunak, to Cannock College. The Cannock campus has been a real success story for South... Local News\nNew Community Diagnostic Centre at Cannock Chase Hospital 23rd May 2024 I recently visited the new Community Diagnostics Centre at Cannock Chase Hospital. It’s no secret that our NHS was badly hit by the pandemic. That’s why the... Local News\nGeneral Election 2024 22nd May 2024 The Prime Minister has called a General Election which will be held on the 4th July. It is an incredible honour to be your Member of Parliament and I will be... Local News\nArmed Forced Spending Increase 17th May 2024 When I am out and about speaking to constituents, it is clear just how much everyone values our Armed Forces. I have been lucky enough to spend time with the... Local News\nCannock Chase Cemetery Anzac Day ceremony 29th April 2024 This weekend I attended the Anzac Day ceremony at the Commonwealth War Graves Commission Cemetery on Cannock Chase. When the New Zealand troops returned home in... Local News\nSafety of Rwanda Bill received Royal Assent 29th April 2024 Last week we celebrated St. George’s Day, our national day where we take time to celebrate our history, our heritage, and our character; reflect on what it... Local News",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_statement-eu-referendum/content_44.html": "Given that the decision on membership of the European Union will be made via a referendum, each voter in the United Kingdom will have the opportunity to have their say. This referendum is a once in a generation opportunity to vote on our membership and is one of the biggest decisions we will make. As such, it is a personal choice every voter needs to decide for themselves.\nThis is not a decision that MPs will be voting on in Parliament on behalf of their constituents. The Conservative Party is neutral on this matter and will not campaign for either outcome and how an MP personally votes is not subject to a whip. MPs, as individuals, are free to choose themselves how they use their ballot paper on the 23rd June. I am therefore simply outlining how I will be personally voting.\nI have been thinking long and hard about this and the decision has been finely balanced. Whilst the EU is far from perfect, I have weighed up all of the issues which are, in my view most important, such as local economic prosperity, international trade partnerships, national security and the United Kingdom’s standing in the world. Based upon this I have decided that I will personally be voting to stay in a reformed European Union when I get my ballot paper.\nI recognise that there are compelling arguments and strong feelings on both the ‘In’ and ‘Out’ sides. However politicians will not decide the result of the referendum, the result is in the hands of the public. I will have just one vote of the 75,000 votes that could be cast in the Cannock Chase constituency. Between now and the 23rd June I believe it is most important that the official ‘In’ and ‘Out’ campaigns focus their energy on informing all voters in the constituency of their arguments, so that everyone can make up their minds in a fully informed way.\nI will not be telling constituents how they should vote. As an MP the most effective role I can take in the coming months is to facilitate this debate and enable members of the public to hear both sides of the argument, so that this deeply personal decision can be made from a fully informed and considered position. As such, I will be organising public hustings closer to the referendum, where representatives of the official ‘In’ and ‘Out’ campaigns can make their case and residents can hear both sides of the argument.\nI have always believed there should be a renegotiation of the terms of our membership of the EU, followed by a referendum. The referendum will now be decided on the streets of the United Kingdom, not in Parliament, and it is up to the official campaigns to persuade the public which way to cast their votes.",
  "https_www_amandamilling_com_/https_www_amandamilling_com/content_1.html": "Winter Fuel Payment 16th October 2024 Read full article Out and about with Amanda £20m plan for Cannock town centre 1st June 2024 Read full article Like Amanda on Facebook Record funding for local road confirmed 26th May 2024 Read full article",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_prime-minister-visits-cannock-college/content_35.html": "It was fantastic to welcome the Prime Minister, The Rt Hon. Rishi Sunak, to Cannock College.\nThe Cannock campus has been a real success story for South Staffordshire College and over the years I have proudly supported the team as the college has gone from strength to strength.\nDuring the visit the Prime Minister met and chatted with students and staff, and even got the opportunity to try his hand at bit of engineering and bricklaying, under the supervision of students.\nThank you to the team and students at Cannock College for making the PM so welcome and for doing an amazing job demonstrating what an asset the college is to our area and showcasing the skills students are gaining at the college.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_pausing-step-four-lockdown-roadmap/content_37.html": "Last week the Prime Minister announced a pause to the next stage of the roadmap on the 21st June.\nI know many of you are disappointed by this news. But with the Delta variant spreading fast and infection rates rising across the country, including here in Cannock Chase where they’ve trebled, we have had to act to keep people safe.\nThis decision shows our commitment to keeping people safe and protecting our NHS as well as our determination not to go back into another lockdown.\nWhen we set out on our roadmap to freedom a few months ago, we were clear progress should be cautious but irreversible.\nIf you’re like me you will have been enjoying going back to the pub and meeting up with friends. By taking this step to pause the next stage of the roadmap we can carry on getting our lives back to normal, while ensuring we don’t go backwards.\nEveryone has made huge sacrifices over the past year, staying at home to protect the NHS and to save lives. These sacrifices have been hard, but necessary to control the virus and we don’t want to waste the efforts that have been made to do this.\nBy taking the tough, but sensible decision to delay the next step of the roadmap we will give our NHS a few more crucial weeks to vaccinate millions more younger adults and complete our roadmap to freedom.\nI know this news will be hard for people who work in industries that remain closed or operating at limited capacity. But I can assure you the Government will continue to support these sectors until restrictions have been lifted.\nOver the next few weeks let’s work together to enjoy summer safely by continuing to follow guidelines to keep each other safe. By being cautious now we have the chance – in the next four weeks – to save many thousands of lives by vaccinating millions more people and steer the country along the road to freedom.\nAs always, if you have any issues you need my help with, please email [email protected], call 01543 877142 or visit www.amandamilling.com/contact.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_category_Articles/content_10.html": "Meeting Local Businesses, Organisations and Leaders in Cannock Chase 4th July 2022 There are so many brilliant businesses across Cannock and recently I met with local entrepreneur, Steve Mallows, who has set up Cannock Eats – a food delivery... Articles\nFalklands Liberation Day 21st June 2022 Last week, we marked 40 years since the British Armed Forces liberated the Falkland Islands. I wholeheartedly salute the heroism of those who served in the... Articles\nHer Majesty The Queen's Platinum Jubilee 6th June 2022 It has been wonderful to see so many of you enjoying the Platinum Jubilee over the weekend. And I have been proud to see all the Union Jacks and Jubilee flags... Articles\nNumber 62 Bus Will Not be Withdrawn in June 2022 27th May 2022 I know how important the No 62 bus service from Cannock to Lichfield is to many residents across Cannock Chase. After concerns were raised about its possible... Articles\nSports Minister launches new mountain biking trail in Cannock Chase 20th May 2022 The Sports Minister, Nigel Huddleston MP, joined Amanda Milling MP and Theo Clarke MP at Forestry England’s launch of two new mountain biking trails in Cannock... Articles\nLocal Election Results 9th May 2022 I am delighted that the Conservatives have increased their majority on Cannock Chase District Council in the recent local elections. This is a clear reflection... Articles\nCannock Chase Businesses Visit Parliament for Staffordshire Day 26th April 2022 I was delighted to welcome two Cannock Chase businesses to Parliament today as part of Staffordshire Day celebrations. The owners of Chocolate Treasures and... Articles\nAnzac Day 2022 25th April 2022 Today we mark Anzac Day 2022. On Sunday 24 April, I attended an annual Anzac Day service to commemorate the New Zealand Rifle Brigade being transferred to... Articles\nLocal Elections 2022 25th April 2022 Local elections will take place on 5 May to elect 13 district councillors across Cannock Chase. These elections matter – they will decide who runs services in... Articles",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_get-jabbed/content_45.html": "We have always known that a mass vaccination programme would be our best hope to get life back to normal as quickly as possible. It is also the most effective way to keep you and your loved ones safe.\nNew data suggests our vaccine programme has so far prevented an estimated 7.2 million infections and 27,000 deaths in England alone.\nThat is why I want to encourage every adult over the age of 18 to book an appointment for both jabs as soon as possible.\nThis will help to ensure we can irreversibly remove all lockdown restrictions on 19th July, and progress to Step Four of the Lockdown Roadmap.\nDue to rapid spread of the more transmissible Delta variant, progress to Step Four was paused last month. However, this has given the NHS time to vaccinate millions more people. I am delighted that since 14th June, around one million more over 40s have received their second doses.\nThe evidence is clear that two doses provide highly effective protection against the Delta variant. Once you have been double jabbed, you are less likely to catch coronavirus, pass it on to your family and friends, or die from the disease.\nBooking a jab is straightforward and can be done via the NHS website or by calling 119. Local vaccine centres have also been running weekend walk-in sessions where you can ‘grab a jab’ without an appointment.\nI would like to thank every single healthcare worker and volunteer who have ensured the success of our vaccine roll-out. I am also grateful to everyone who has already come forward and been jabbed.\nThe case for getting vaccinated is clear, so please get your jab when you can, so together we can keep each other and our loved ones safe.\nAs always, if you have any issues you need my help with, please email me at [email protected], call 01543 877142 or visit www.amandamilling.com/contact",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_cannock-chase-mp-calls-government-review-energy-generation-policy/content_50.html": "Amanda Milling, the Member of Parliament for Cannock Chase, spoke this week in a debate in Parliament about Biomass. She used the debate as an opportunity to again raise the issue of the potential closure of Rugeley Power Station with Ministers, calling for more work to be done by the Government to explore policies that would encourage and incentivise the conversion of coal fired power stations to biomass.\nEarlier this month, Engie, the owners of Rugeley Power Station announced its potential closure this Summer. Rugeley B is the latest in a list of five power stations that have recently announced that they may close or partially close. Whilst the Government announced last year that it is looking to phase out coal fired energy production by 2025, the country is seeing coal fired power station closures being accelerated given rapidly deteriorating market conditions.\nWhilst the owners of Rugeley B did investigate the conversion from coal to biomass fuel in 2012, they subsequently made the decision in 2013 not to pursue this option. With the closure of power stations across the country Amanda believes there is now a need for Government to revisit their policy in terms of biomass, before the infrastructure is lost for ever.\nBiomass, is a low carbon renewable energy source, which provides greater reliability and flexibility compared with other renewable energy sources, such as wind and solar. However, Amanda believes that the benefits of biomass are currently not fully recognised in government policy and it is not necessarily competing on a level playing field when compared to other renewable sources as the ‘whole system costs’ are not being factored into policy making.\nCoal fired power stations can be converted to use biomass, extending their life, and enabling the existing infrastructure to be utilised, rather than having to build new energy generating facilities.\nAmanda Milling said: “These power stations provide the infrastructure for potential conversion to biomass and their workforces also have the specialist skills that are required to operate a power station. I have therefore suggested that the Government should help to facilitate a more level playing field in terms of the way energy sources such as wind and solar are compared to biomass. Research shows that if biomass was considered on a level playing field then conversion projects would be more economically viable and could help us save some of our power stations.”\nAmanda Milling also raised concerns with the Government about the loss of the existing power generation infrastructure as business rates are incurred up until the point when a power station is demolished, meaning that owners have no incentive to retain the existing infrastructure. With the acceleration of power stations closing through market conditions, Amanda is concerned that there is a real danger that these assets will soon be gone, potentially putting pressure on the UK’s energy security.\nAmanda added: “With business rates incurred up until the point at which a power station is demolished there is no incentive to retain the infrastructure, in fact, quite the opposite – an incentive to demolish as quickly as possible. Once these power stations are closed and demolished that’s it – the infrastructure which could be used to support alternatives, such as biomass, will be gone forever.”\nThe MP concluded by calling on the Government to expedite investigations into biomass as a realistic alternative to other renewables and encourage and incentivise the conversion of these last remaining coal fired power stations.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_meeting-local-businesses-organisations-and-leaders-cannock-chase/content_12.html": "There are so many brilliant businesses across Cannock and recently I met with local entrepreneur, Steve Mallows, who has set up Cannock Eats – a food delivery app which allows you to easily order your favourite takeaways from local restaurants.\nThe app means local independent businesses pay a lower fee to the delivery company, so they keep more money from their sales. It’s great to see businesses working together and by using the app, you’re helping local businesses and keeping money local!\nI have also recently visited Cannock JobCentre Plus. It was fantastic to meet the team and hear about the support they provide.\nWe discussed the range of programmes and tailored support they’re providing to help local people into work, including connecting young people with local employers.\nThey host regular jobs fairs in the area and I would encourage anyone who is looking for a job to keep an eye out for upcoming events on their website.\nI was delighted to meet the new Local Policing Commander for Cannock, Chief Inspector Laura Morrey. We discussed a number of priority issues in the area, including the recent reports of anti-social behaviour in Cannock town centre. We also spoke about the new policing model which will see more focus on local policing enabling officers to work more proactively in our communities.\nI have also had meetings with the Council and other organisations about how we can improve our local area and secure more funding for Cannock Chase.\nI am very grateful to all the local residents who took part in Cannock Chase District Council’s town perception survey which aimed to get a clearer view about how residents and visitors viewed Cannock town centre. The feedback will go on to inform the Council’s plans for the £20 million Levelling Up Fund which was secured by the Council last year.\nAs ever, if you have any issues at all that you need my help with, email me at [email protected], call 01543 877142 or visit www.amandamilling.com/contact",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_local-elections-2022/content_28.html": "Local elections will take place on 5 May to elect 13 district councillors across Cannock Chase.\nThese elections matter – they will decide who runs services in our area – and how much we will pay for them.\nI know that households are worried about the rising cost of living. And so - keeping bills down and cutting council waste is more important than ever.\nSince 2021, Cannock Chase District Council has been led by the Conservatives who have done a brilliant job to boost local investment and provide quality services as part of their ambitious plans for Cannock Chase.\nThe local Conservative group have a clear vision for Cannock Chase. And have wasted no time in delivering their plans.\nTheir plans include ensuring businesses can thrive, innovation is encouraged, and aspiration is supported. I was delighted we secured £20 million investment to revitalise Cannock town centre after years of neglect. And the Council have distributed grants to support local businesses struggling because of the pandemic.\nThey are also linking businesses and colleges to meet skills demands. This includes assisting with the newly built Digital Skills Centres situated within Cannock and Tamworth College.\nThe District Council is also committed to improving the lives of local residents and protecting our environment. This includes by improving recycling services, protecting Cannock Chase and by investing in local leisure centres – including helping to deliver the £1.25 million investment programme at Rugeley Leisure Centre.\nThe Council have also secured investment to improve our local play areas, and to repair bridges and boardwalks. You will often see Conservative councillors out and about on litter picks or repainting our playgrounds.\nI have been on the campaign trail with the Conservative councillors and candidates. And I know just how deeply they care about our community.\nTo ensure the District Council continues to deliver for the people of Cannock Chase, please vote for your hard-working Conservative candidates on 5 May.\nAs ever, if you have any issues at all that you need my help with, email me at [email protected], call 01543 877142 or visit www.amandamilling.com/conta",
  "https_www_amandamilling_com_/https_www_amandamilling_com_about-amanda-milling/content_31.html": "Amanda studied Economics and Statistics at University College London, after which Amanda built up a successful career in market research, specialising for a large part in the financial services sector. Before entering Parliament, Amanda was Director and Head of Clients at Optimisa Research. In 2009 Amanda became a local Conservative Councillor and was a campaign organiser for several local and national elections.\nAmanda was first elected to Parliament in 2015. In that Parliament she served on the Business, Innovation and Skills Select Committee as well as the Education, Skills and Economy Sub-Committee and Committees for Arms Export Controls. As part of these committees Amanda has been involved in some high profile inquiries, including those looking at the quality of Higher Education, the working practices at Sports Direct and the collapse of BHS. Amanda also took part in the Army branch of the Armed Forces Parliamentary Scheme.\nUp until the General Election in June 2017, Amanda served as a member of the Business, Energy and Industrial Strategy Select Committee. In the last Parliament she also served on several Bill Committees including the Higher Education and Research Bill, Welfare Reform Bill, the Policing and Crime Bill and the Children and Social Work Bill. Amanda served as a Parliamentary Private Secretary to the Foreign and Commonwealth Office Ministers, before being appointed an Assistant Government Whip in the 2018 New Year reshuffle. Amanda was appointed Deputy Chief Whip in July 2019. In the 2020 reshuffle, Amanda served as Minister without Portfolio and Chairman of the Conservative Party, and also appointed to the Privy Council. From September 2021 to September 2022 Amanda served as a Minister of State at the Foreign, Commonwealth & Development Office. Since 14 November 2023 Amanda has served as a Government Whip (Lord Commissioner of HM Treasury).\nAmanda’s main areas of interest in Parliament have been Education and Young People (including career advice, apprenticeships and higher education), Blue Light Services (collaboration), the Armed Forces and Business & Enterprise (with a particular focus on trade & exports).\nLocally, Amanda has been an active campaigner on many local issues. These include the closure of the Rugeley B Power Station and its redevelopment, maintenance of the local road network, the delivery of the Chase Line electrification project and tackling overcrowding on the line, illegal waste site fires, the odour coming from Poplars Tip and supporting young people into work.\nAmanda supports a wide variety of local groups, organisations and local charities including the Royal British Legion, the Rotary Clubs, the Lions Clubs and Soroptimists, Newlife Foundation for Disabled Children, CHAPS and the Hibbs Lupus Trust – to name a few!\nAmanda was born in Burton upon Trent and brought up in a nearby Staffordshire village. Living in Cannock Chase means that Amanda is always out and about in Cannock, Hednesford, Rugeley and our villages attending events as well as visiting residents and businesses.\nKeep up to date with Amanda’s work by following her on Facebook at fb.com/amanda.milling",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_safety-rwanda-bill-received-royal-assent/content_51.html": "Last week we celebrated St. George’s Day, our national day where we take time to celebrate our history, our heritage, and our character; reflect on what it means to be English and be proud of being a part of our great Union. Whatever you did to celebrate St George’s Day, I hope you enjoyed it.\nTurning to Parliament, last week we finally passed the Safety of Rwanda Bill, which also received Royal Assent to become an Act of Parliament.\nWe have made good progress stopping the boats – the number of small boat arrivals fell by a third in 2023. But that is not enough.\nFor as long as this route is viable, people will keep coming.\nThis is why Rwanda matters. The only way to stop the boats is to remove the incentive to come – by making clear that if you come here illegally, you will not be allowed to stay.\nAfter months of delay from Labour and their members in the House of Lords – we have passed the Safety of Rwanda Act.\nThis means that – after two years – we can start the process to send the first flights of illegal migrants to Rwanda and deter people from coming illegally in the first place.\nThere will be no further delays. We will do the final training of caseworkers, conduct the case-file reviews and, and now the Act has received Royal Assent, we will detain the first cohort of migrants for removal. We will send the first flight to Rwanda in 10-12 weeks, with multiple flights every month over the summer and beyond until the boats are stopped.\nThis is one of the most complex operational endeavours carried out by the Home Office, but we are ready and plans are in place.\nIt should be this country and your government who decides who comes here, not criminal gangs.\nThat’s why we will do whatever it takes to get flights off and stop the boats.\nThe recent news of deaths in the English Channel demonstrates just how important this Bill is. We must stop people making these perilous journeys. We must stop the boats to save lives and protect our borders.\nAs always, if you require my help with anything at all, please do not hesitate to contact me via e-mail at [email protected] or by telephone on 01543 877 142.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_feed/content_46.html": null,
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_winter-fuel-payment/content_39.html": "I am disappointed that my successor, Labour MP Josh Newbury voted to cut the Winter Fuel Payment.\nThis was a political choice. Labour have turned their backs on vulnerable pensioners and have instead chosen to award inflation busting pay rises to their union masters.\nJoin over 100,000 people and sign our petition to get Labour to stop this callous cut: keepwinterfuel.com",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_armed-forced-spending-increase/content_7.html": "When I am out and about speaking to constituents, it is clear just how much everyone values our Armed Forces. I have been lucky enough to spend time with the brave men and women of our Armed Forces and this is a message I always impart to our service personnel.\nBe it serving soldiers or veterans, everyone I speak to in Cannock Chase has a heartfelt respect and gratitude for our Armed Forces community. I would particularly like to thank the Hednesford Branch of the Staffordshire Regimental Association for inviting me to their recent Annual Dinner.\nFurther away from Cannock Chase it is clear that we live in an increasingly insecure world, and the Government recently made a major announcement on defence spending.\nWe will increase defence spending to 2.5 per cent of GDP by 2030. Given the deteriorating security environment and with inflation falling to 3.2 per cent, we can now set 2030 as the date to meet our new 2.5 per cent of GDP defence spending commitment.\nThis increase in defence spending will be fully funded with no increase in borrowing or debt. We have a clear plan for what we will spend, when we will spend it, and how we will pay for it. This plan makes the UK the largest defence power in Europe and the second largest in NATO.\nThe UK is leading the way in Europe and setting a new standard among the major NATO economies. At this turning point in European security, if 2.5 per cent becomes a new benchmark for NATO partners to reach, allied defence spending would increase by over £140 billion. That would provide safety and security for the British people that far outstrips anything we could achieve alone.\nOur increased investment will be focused on: firing up the UK industrial base, including £10 billion on the new munitions strategy; ensuring that our Armed Forces are benefiting from the latest technology, and guaranteeing our long-term support to Ukraine. We will also make sure that this new investment is spent more effectively with a radical set of reforms.\nDefence of the realm is and should be, a major priority of any government and so I very much welcome this recent announcement.\nAs always, if you need my help with anything at all, please do not hesitate to contact me via e-mail at [email protected] or by telephone on 01543 877 142.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_record-number-young-people-cannock-chase-studying-core-academic-subjects/content_54.html": "Amanda Milling, Prospective Conservative MP, has welcomed the news that more students in Cannock Chase are studying the core academic subjects which will help them to get the best start in life.\nThe new English Baccalaureate (EBacc) is awarded when students achieve A* to C in five core GCSE subjects including English, Maths, Science, Humanities and Languages – the courses that universities and employers value the most. New figures show that the EBacc is encouraging more young people in our area to study the core academic subjects.\n275% more students in Cannock Chase are now taking a GCSE in these subjects, meaning they are gaining the skills they need to get a good job or go on to further study.\nThese figures follow news that there are now 1.75 million more people in work since 2010 and university applications are at a record high, further evidence that the Conservatives’ long-term economic plan is securing a better future for Britain.\nAmanda Milling commented: \"Young people in Cannock Chase deserve the very best start in life. That means they need good quality, rigorous exams which help them gain the skills they need to succeed. Sadly, under the last Labour Government subjects were dumbed down, employers lost faith in exam grades and our young people were let down.\n\"That’s why it is great news that the action the government has taken to improve standards in our schools is paying off locally, with new figures showing 37.5% of young people in our area are taking up the subjects which will help them find a good job or university place.\n\"Conservatives are working to a long-term economic plan to secure a better future for Britain and a crucial part of that is delivering the best schools and skills for young people in Cannock Chase. These new figures show that plan is working, and we need to stick to it so that even more young people in our area can gain the skills they need to get on in life.\"",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_new-community-diagnostic-centre-cannock-chase-hospital/content_15.html": "I recently visited the new Community Diagnostics Centre at Cannock Chase Hospital.\nIt’s no secret that our NHS was badly hit by the pandemic. That’s why the government has made the NHS a top priority.\nThe government has recruited record numbers of doctors and nurses to cut waiting lists. Alongside this the government have been investing in a programme of new community diagnostic centres, including in Cannock. This means local people can get quicker diagnoses, catch problems earlier and get the treatment they need.\nThis latest investment in the hospital sees it now playing host to cutting edge equipment that will see patients getting faster diagnosis of their health issues.\nThe new Community Diagnostic Centre that has opened at Cannock Chase Hospital has four state-of-the-art scanners, two CT scanners and two MRI scanners. The new facility will take around 30,000 images per year, taken to help diagnose patients quicker and more efficiently.\nWe all know how hard our local doctors, nurses and medical professionals work and how much they care for their patients. But they also need the investment in the best equipment and facilities, which is why I’m so pleased that this investment has taken place at Cannock Chase Hospital.\nPatients from Cannock Chase, as well as the wider area, will be seen at this facility, easing the burden on other local hospitals, and speeding up diagnosis of conditions.\nIt is great news that the facility is now open and scanning its first patients.\nCannock Hospital is at the heart of the community and delivers a wonderful service to everyone. We all know how important the hospital is to us all. This investment and new facilities on site see the value of the hospital enhanced even further.\nIf you have been at the new diagnostic centre, please let me know how you got on, especially if you have positive comments you would like me to pass on to the team from the hospital.\nAs always, if you need my help with anything at all, please do not hesitate to contact me via e-mail at [email protected] or by telephone on 01543 877 142.",
  "https_www_amandamilling_com_/http_www_amandamilling_com_contact/content_49.html": "Living here means that Amanda is always out and about in Cannock, Hednesford, Rugeley and our villages visiting residents and businesses.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_cannock-chase-businesses-visit-parliament-staffordshire-day/content_18.html": "I was delighted to welcome two Cannock Chase businesses to Parliament today as part of Staffordshire Day celebrations.\nThe owners of Chocolate Treasures and Icon Exhibitions and Displays were representing Cannock Chase at an annual event which celebrates the best of Staffordshire.\nChocolate Treasures is located in Heath Hayes and sells beautiful chocolates and ice-creams. The business also won my ‘Best of Cannock Chase’ shops competition at the end of 2021 after receiving the highest number of public votes.\nIcon Exhibitions is a Norton Canes based business which builds and assembles bespoke exhibition stands and displays for businesses across the UK and abroad.\nBoth businesses are real assets to Cannock Chase – providing brilliant employment opportunities and contributing to our local economy.\nBoth also have international customers allowing them to fly the flag for Cannock Chase around the world.\nHaving grown up in Staffordshire and now representing Cannock Chase – I will always champion the wonderful people, businesses, and communities of our county.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_cannock-chase-cemetery-anzac-day-ceremony/content_40.html": "This weekend I attended the Anzac Day ceremony at the Commonwealth War Graves Commission Cemetery on Cannock Chase.\nWhen the New Zealand troops returned home in 1919, local people took it upon themselves to remember ‘The Fallen’ in a ceremony each year.\nThis annual ceremony has taken place every year since 1918, except during the Second World War and lockdown.\nAlong with members of the armed forces, the local community and of course Waychman VI, we all paid our respects to the fallen. As ever, this was an incredibly moving ceremony.\nLest we Forget.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_category_Opinions/content_13.html": "Support for Pensioners 20th April 2023 I hope that everyone had a lovely Easter break and enjoyed time with family and friends. Many people will have been visiting parents, grandparents, and extended... Opinions\nUpdate from Amanda Milling MP 29th September 2021 During the recent Cabinet reshuffle, I was privileged to be given a new position in Government as Minister for Asia at the Foreign, Commonwealth and Development... Opinions\nDevastating events in Afghanistan 31st August 2021 It’s been truly devastating to watch the events unfolding in Afghanistan. Day by day we’ve seen heartbreaking scenes of men, women and children trying to leave... Opinions\nChase Line Update 23rd July 2021 Train users in Cannock Chase have faced more than their fair share of issues over the years. These have included trains being delayed, cancelled, or terminated... Opinions\nGet Jabbed 9th July 2021 We have always known that a mass vaccination programme would be our best hope to get life back to normal as quickly as possible. It is also the most effective... Opinions\nPausing Step Four of Lockdown Roadmap 21st June 2021 Last week the Prime Minister announced a pause to the next stage of the roadmap on the 21st June. I know many of you are disappointed by this news. But with the... Opinions\nDemolition of Rugeley Power Station cooling towers 10th June 2021 Last weekend we saw the iconic cooling towers of Rugeley demolished. For some of you they were where you worked. For me they’ve always been my sign that I’m... Opinions\nStatement on the EU referendum 24th February 2016 This is not a decision that MPs will be voting on in Parliament on behalf of their constituents. T he decision on membership of the European Union will be made... Opinions\nMy Week in Westminster - 02.02.2016 5th February 2016 With this blog I can tell you a little bit about what I do in Westminster during the week. Opinions",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-mp-highlights-fire-authority-savings-failure/content_70.html": "Amanda Milling, Member of Parliament for Cannock Chase recently criticised Staffordshire Fire and Rescue Authority in Parliament for cutting frontline provision in Cannock and Rugeley, whilst refusing to consider making savings in back office functions instead.\nAmanda Milling MP raised the issue in Parliament with Mike Penning, the Minister for Policing, Crime and Criminal Justice, when asking what the government is doing to encourage the merging of back office functions between police and fire authorities.\nAmanda said: “I was incredibly disappointed when Staffordshire Fire and Rescue Authority ignored calls for consideration to be given to merging back office functions with Staffordshire Police, instead ploughing on with cuts in frontline services which have resulted in fire engines being removed from both Cannock and Rugeley. I firmly believe that these cuts to our local frontline fire service provision could have been avoided if Staffordshire Fire and Rescue Authority had engaged in talks with Staffordshire Police about sharing services and resources.\"\nAmanda also pointed to a statement made by Mr Dartford, Chief Fire Authority Officer last year –\n\"Times have changed significantly in recent years, with the public sector facing ever increasing financial pressures which is why it is absolutely vital that we work ever more closely with our partners to ensure our residents continue to receive a first-class service.”*\nAmanda commented: “While the Fire Authority believe this and said this only last October, they are refusing to put this intention into practice for the benefit of front line provision.”\nResponding to Amanda Milling MP, Home Office Minister Mike Penning MP said the Government is seeing this form of greater integration elsewhere in the country and he was unsure as to why Staffordshire is not doing the same, describing emergency services working together as 'common sense'.\nAmanda Milling, and a number of other Staffordshire MPs, have raised the issue of back office mergers between Staffordshire Fire and Rescue Service and Staffordshire Police after the Staffordshire Police and Crime Commissioner, Matthew Ellis, said he would welcome such a move.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_staffordshires-mps-join-forces-celebrate-staffordshire-parliament/content_52.html": "Amanda Milling MP joined fellow Staffordshire and Stoke's MPs, local government, businesses, charities and local heroes to host the 2018 ‘Celebration of Staffordshire’ in Parliament.\nThe County's 12 MPs were joined by Staffordshire County Council, the Chambers of Commerce and Local Enterprise Partnership to show off the best that Staffordshire has to offer to the variety of Government Ministers, media and MPs.\nThe attendees from across the County ranged from small local causes, such as Tamworth Boxing Club and Caudwell Children in Newcastle-under-Lyme, to larger businesses such as Stoke's Mr Kipling's Cakes and Cannock Wood’s ATP Group. Five Cabinet ministers and numerous MPs also attended the event and heard each organisation’s successful stories.\nThe event was held in the ornate Jubilee Room, an annex of the historic Westminster Hall, where tilers from Staffordshire famously built the entrance to the room.\nSpeaking after the event Cannock Chase MP, Amanda Milling, said: “It was wonderful to see so many parliamentary colleagues, small businesses, charities and local heroes come together for a celebration of Staffordshire in Parliament. I was very pleased to support and attend the event and I was thrilled that so many Cabinet Ministers and fellow MPs were able to attend to hear first-hand the success that is happening in our county – it really was the place to be in Parliament. I was also delighted that Cannock Chase was represented at the event, with ATP Group from Cannock Wood one of the exhibitors.”\nPhilip Atkins, Leader of Staffordshire County Council, said: “Days like this are invaluable opportunities to talk to potential investors about the economic opportunities in Staffordshire, our commitment to providing the physical and electronic infrastructure for future growth and how an increasingly skilled workforce can help new businesses prosper and existing ones thrive in a county with a good quality of life.”\nStoke-on-Trent and Staffordshire Local Enterprise Partnership chairman David Frost CBE said: “We are delighted to be joining forces with our MPs, businesses, local authorities and other organisations to celebrate and champion our area as a great place to live, work, invest and do business. The LEP has an important role as a business-led organisation bringing partners together to shape and drive economic growth with policies that are tailored to local needs and aspirations. We are proud to have the opportunity of this Parliamentary showcase for our achievements in bringing more and better jobs to our region, raising skills levels and promoting Stoke-on-Trent and Staffordshire around the world.”",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_sports-minister-launches-new-mountain-biking-trail-cannock-chase/content_26.html": "The Sports Minister, Nigel Huddleston MP, joined Amanda Milling MP and Theo Clarke MP at Forestry England’s launch of two new mountain biking trails in Cannock Chase Forest ahead of the Commonwealth Games. Perry’s Trail and the Pedal and Play Trail were officially opened at the launch. Perry’s Trail is named after the Commonwealth Games’ mascot and the Pedal and Play Trail is aimed at younger cyclists. Cannock Chase Forest is the location for the mountain biking event in the Commonwealth Games 2022 but the trails are now open for everyone to enjoy. The cycling improvements have been made possible by funding and support from Sport England along with British Cycling, Birmingham City Council, Staffordshire County Council, Cannock District Council and the Birmingham 2022 Commonwealth Games Organising Committee. Commenting, Nigel Huddleston MP, Sports Minister, said: “It was a pleasure to join my fantastic colleagues Amanda and Theo at the launch of Forestry England’s brand new mountain bike trails in Cannock Chase. They are both great advocates for the Commonwealth Games. Not only will the trails be used for the 2022 Commonwealth Games but the site is levelling up access to cycling facilities for all and will leave a lasting legacy for the community.” Amanda Milling MP, said: “It was brilliant to welcome the Sports Minister to Cannock Chase to see the fantastic work that’s been done by Forestry England and to see the site of the mountain biking for the upcoming Commonwealth Games. It was great to see cyclists making use of the new trials and a local group using the Pedal and Play trail. The trails are open now and everyone across Cannock Chase and beyond are able to enjoy them.” Theo Clarke MP, said: “I was pleased to join the Sports Minister and my neighbouring MP Amanda Milling at the official opening of Forestry England’s new mountain bike trails in Cannock Chase which will be used for the upcoming Commonwealth Games. It was great to see the fantastic new facilities for kids on the Pedal and Play trail. I’m delighted that Staffordshire is hosting the mountain biking competition this summer and encourage everyone locally to get involved and support the Games.”",
  "https_www_amandamilling_com_/https_www_amandamilling_com_map-locations/content_2.html": "This map illustrates the locations of news articles on this website. Click on the markers to visit the relevant pages.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_autumn-statement-2023/content_64.html": "Like many countries around the world, the UK has faced profound economic challenges caused by the twin effects of Covid-19 and Putin’s illegal invasion of Ukraine causing supply issues, increasing inflation and energy costs. These issues have led to high inflation and interest rates across many of the world’s major economies.\nAgainst a difficult backdrop, the UK is back on track. Inflation has halved, the economy has recovered more quickly from the pandemic than first thought, and debt is on track to fall. This has delivered much-needed stability so we are now able to focus on the long-term decisions required to strengthen our economy, drive growth in the years ahead and allow the Government to deliver tax cuts for millions of people.\nLast week, the Chancellor unveiled the Government’s Autumn Statement in the House of Commons, announcing the biggest tax cuts for working people and British business since the 1980s to get Britain growing.\nThis will see taxes cut for 27 million working people, helping people keep more of their hard-earned money. The government will cut National Insurance by 2% from January. For the average worker earning £35,000 a year, that delivers a much needed £450 tax cut. We will be passing the legislation to enable this on Thursday.\nTax will also be cut and simplified for 2 million of the self-employed, again through cuts to National Insurance.\nIn addition to tax cuts, the National Living Wage will be increased to record levels.\nFor pensioners, in line with our Triple Lock, pensions will be increased by 8.5 per cent in April. In addition we will also provide targeted support for those struggling with energy costs, through schemes such as the Warm Home Discount and the Winter Fuel and Cold Weather payments.\nThe most vulnerable who are struggling the most with the cost of living will see their Local Housing Allowance increase.\nAlso the government is increasing all working age benefits by 6.7 per cent.\nThere are a wide range of tax cuts for businesses, both large and small.\nI welcome the measures set out in the Autumn Statement which lead the way to achieving long-term, sustainable growth, with a wide ranging package of tax cuts, while getting borrowing lower and reducing inflation.\nThese actions are another step forward in tackling the long-term challenges facing the UK, so we can build a more dynamic economy that delivers prosperity across the country and delivers the change the country needs.\nAs always, if you require my help with anything at all, please do not hesitate to contact me via e-mail at [email protected] or by telephone on 01543877142.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_category_Westminster-News/content_42.html": "Autumn Statement 2023 27th November 2023 Like many countries around the world, the UK has faced profound economic challenges caused by the twin effects of Covid-19 and Putin’s illegal invasion of... Westminster News\nKing's Speech 2023 16th November 2023 On Tuesday 7 November, HM King Charles III delivered his first speech as our Monarch. In it he set out the Government’s agenda for the coming year, outlining 21... Westminster News\nStaffordshire’s MPs join forces to celebrate Staffordshire in Parliament 5th November 2018 Amanda Milling MP joined fellow Staffordshire and Stoke's MPs, local government, businesses, charities and local heroes to host the 2018 ‘Celebration of... Westminster News\nAmanda Milling MP welcomes ban on ivory sales 6th April 2018 Cannock Chase MP, Amanda Milling, has welcomed an announcement by the Environment Secretary, the Rt Hon Michael Gove MP, that the UK will introduce a ban on... Westminster News\nAmanda Milling MP joins Prime Minister and other female Members of Parliament to commemorate 100th Anniversary of women’s right to vote. 6th February 2018 Amanda Milling, MP for Cannock Chase joined other female Members of Parliament as the Prime Minister launched a series of year-long events and exhibitions to... Westminster News\nSgt Watchman V features again in Parliament 3rd November 2017 Cannock Chase MP, Amanda Milling, has saluted the Staffordshire Regimental mascot in Parliament a year after he was crowned the “Paw-blic” favourite in the 2016... Westminster News\nAmanda Milling MP supports “wear it pink” 19th September 2017 Amanda Milling MP poses in pink at Westminster to support Breast Cancer Now’s vital research. Amanda Milling, Member of Parliament for Cannock Chase, has... Westminster News\nAmanda Milling MP calls for debate on illegal waste 13th March 2017 Amanda Milling, Member of Parliament for Cannock Chase, has called for a Parliamentary debate on the issue of illegal waste. In a recent debate, the Cannock... Westminster News\nSupreme Court Article 50 Judgement 24th January 2017 The voters of Cannock Chase were clear on 23rd June 2016 in the EU referendum with the majority voting for the UK to leave the EU. The Supreme Court have this... Westminster News",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_new-figures-show-conservatives%E2%80%99-plan-delivering-security-families-cannock-chase/content_62.html": "Amanda Milling has welcomed new figures showing 1,437 fewer people in Cannock Chase claiming Jobseeker’s Allowance compared to 2010 - a 65% per cent fall. This means more people with the self-respect and security of a good job and a regular pay packet.\nPeople are getting off benefits and into work across the West Midlands, with 94,000 more people in work compared to the last election.\nOverall there are now a record 30.80 million people in work, with 1.75 million more people in work since 2010.\nAmanda Milling said: \"It’s great news that 1,437 fewer people in Cannock Chase are relying on Jobseeker’s Allowance to get by. This is a clear sign that the Conservatives' long-term economic plan is working – helping people get off benefits and into work.\n\"This is happening because we’ve been backing businesses to create more jobs with lower taxes and better infrastructure, and fixing the welfare system to make sure work pays.\n\"This means a better future for families in Cannock Chase, as more people have the financial security and self-respect that comes with a good job and a regular pay-packet.\"",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_new-jobs-numbers-show-conservatives%E2%80%99-long-term-economic-plan-bringing-more-security-cannock-cha/content_58.html": "Amanda Milling, Prospective Conservative MP for Cannock Chase has welcomed new figures showing 1,541 fewer people in Cannock Chase are now claiming Jobseeker’s Allowance since 2010 - a 67% per cent drop. This means more people bringing home a regular pay packet – with the self-respect and sense of security that a good job brings.\nPeople are getting off benefits and into work across the West Midlands with 114,000 more people in work since the last election.\nIn total a record 30.8 million people are now in work, up by 1.75 million since the last election.\nThe new figures also show regular pay rising by 1.8 per cent on the year, and private sector pay up 2.2 per cent – well ahead of inflation.\nAmanda said: \"It’s great news that 1,541 fewer people in Cannock Chase are relying on Jobseeker’s Allowance, and wages are now increasing. This is a clear sign that the Conservatives’ long term economic plan is working, delivering a more financially secure future for families.\n\"This is happening because we’ve been taking action to fix the economy - backing businesses to create more jobs with better infrastructure and lower jobs taxes, and fixing the welfare system so that work always pays.\n\"Next May voters in Cannock Chase will face a choice: between the competence of sticking with the Conservatives’ plan which is delivering a more secure future for families - where more people have the self-respect and peace of mind that comes with a regular pay packet - or putting that all at risk with the economic chaos a vote for one of the other parties would bring.\"",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_her-majesty-queens-platinum-jubilee/content_25.html": "It has been wonderful to see so many of you enjoying the Platinum Jubilee over the weekend. And I have been proud to see all the Union Jacks and Jubilee flags decorating our high streets and houses.\nI know there have been lots of street parties and events across the constituency. This has demonstrated the best of our communities as we have come together to celebrate Her Majesty The Queen’s 70-year reign.\nLast week, I was pleased to attend The Staffordshire Lieutenancy’s Platinum Jubilee Garden Party at Staffordshire County Showground.\nAs well as celebrating Her Majesty’s glorious reign, the event was also an opportunity for the County to recognise the collective effort that has been so evident and beneficial throughout the Covid-19 pandemic.\nI was truly honoured to also attend a special Platinum Jubilee Service of Thanksgiving at St Paul’s Cathedral.\nIn the run up to the Jubilee, I was delighted to plant a tree at Cannock Chase High School to mark the Queen's Platinum Jubilee with the Deputy Lord Lieutenant of Staffordshire, Mrs Sarah Elsom, and students and staff from the school.\nAll 12 Staffordshire and Stoke MPs are planting a tree to form part of The Queen’s Green Canopy which will increase the number of trees and woodland across the UK.\nThe Jubilee really has given us all a chance to come together and celebrate our communities, what makes us British and, of course, Her Majesty The Queen.\nI would also like to pay tribute to all those who have worked over the bank holiday – from doctors and nurses to shopworkers and police officers.\nFinally, as many of you will be aware, last year, Cannock Chase District Council was awarded £20 million from the Government's Levelling up Fund programme to transform part of Cannock town centre.\nCannock Chase District Council is asking residents to take part in a questionnaire as part of their public consultation on how the money will be spent. I would encourage all constituents to fill in the questionnaire, and more information can be found on the Council’s website.\nAs ever, if you have any issues at all that you need my help with, email me at [email protected], call 01543 877142 or visit www.amandamilling.com/contact",
  "https_www_amandamilling_com_/https_www_amandamilling_com_accessibility/content_38.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_kings-speech-2023/content_61.html": "On Tuesday 7 November, HM King Charles III delivered his first speech as our Monarch.\nIn it he set out the Government’s agenda for the coming year, outlining 21 new Bills that Ministers intend to pass during the next Parliamentary session.\nThe King’s Speech is a historic ceremony which officially marks the start of a parliamentary session, bringing together the monarchy, peers, and MPs. The last time King Charles read out the Queen’s speech, it was on behalf of his mother, Queen Elizabeth II.\nHis Majesty set out our long-term plans to deliver on our key priorities to deliver increased growth and prosperity across the United Kingdom.\nThis new legislative programme is important as it will focus on delivering the right long-term decisions which will secure and safeguard our future prosperity.\nLegislation will focus on four key areas:\nFirst, growing the economy by introducing Bills that protect our energy security, secure the benefits of Brexit, and ensure we have the right framework for tech firms to compete and grow in a global market.\nSecond, strengthening society by protecting the health of young people, supporting private renters, landlords and leaseholders, and upholding animal welfare.\nThird, keeping people safe by making sure the police have the powers they need, criminals get the punishment they deserve, and society is protected from terrorism. This includes the Sentencing Bill and the Criminal Justice Bill, giving the police more powers to keep us safe.\nFourth, promoting our national interests by backing our Armed Forces, supporting Ukraine, and leading the way on the challenges of the future: climate change and AI.\nThe measures in the King’s Speech shows the scale of our ambition. We will deliver true and lasting change including cutting inflation, upholding national security, introducing tougher sentencing, protecting the health of young people, and supporting renters and leaseholders.\nI welcome this ambitious legislative agenda and look forward to bringing forward long-term solutions to the problems faced by individuals, families, and businesses across Cannock Chase.\nI look forward to working with colleagues in Parliament to help shape and guide this ambitious legislative agenda over the coming parliamentary session.\nAs always, if you require my help with anything at all, please do not hesitate to contact me via e-mail at [email protected] or by telephone on 01543 877142.",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-mp-encourages-local-groups-apply-%E2%80%98proceeds-crime-fund%E2%80%99/content_60.html": "In Prime Minister’s Questions today, Amanda Milling, Member of Parliament for Cannock Chase, urged community safety groups from Cannock Chase to apply for grants from Staffordshire Police and Crime Commissioner’s ‘Proceeds of Crime Fund’.\nThe Commissioner’s ‘Proceeds of Crime Fund’ sees the money seized from criminals going straight back into local communities across Staffordshire. The Police and Crime Commissioner for Staffordshire, Matthew Ellis, is calling on community safety groups to apply for grants of between £3,000 and £15,000 for projects that will help reduce crime and antisocial behaviour across the county.\nAmanda Milling commented: “It is absolutely right that the proceeds of crime are returned to the local communities that have been the victims of crime. This is why I would encourage local community safety groups from across Cannock Chase to apply for the grants being made available from the Commissioner’s ‘Proceeds of Crime Fund’. I want to make sure that here in Cannock Chase we get our share of the money being made available to help reduce crime and tackle anti-social behaviour.”\nThe Cannock Chase MP added: “Matthew has been an excellent Police and Crime Commissioner for Staffordshire since his election back in November 2012 and I believe that this scheme is just one of many examples of ways in which he has been delivering real value for everyone in Cannock Chase.”\nThe Commissioner’s ‘Proceeds of Crime Fund’ is supporting projects in conjunction with local policing teams and local authorities. It is made up of assets and money seized by Staffordshire Police from criminals under the Proceeds of Crime Act. Bids have to demonstrate a clear connection with reducing crime and fit into one of the Commissioner’s four priority areas: intervening early, putting victims first, preventing offender and re-offending, and improving public confidence. Partner agencies involved in community safety locally can apply individually or in collaboration. The latest application window is open now until 14 April 2016.\nStaffordshire’s Police and Crime Commissioner, Matthew Ellis said: “I changed the way things were done in Staffordshire in 2013 to make sure that every bit of funding received from the proceeds of crime goes to fund community safety. Criminals take from law-abiding people, police take the ill-gotten gains from criminals and it all ends up back in communities, benefiting law-abiding people. What goes around comes around! I’ve seen first-hand across Staffordshire how this money is being spent at a local level to tackle the root causes of crime, prevent offending, support victims and help make communities safer.”\nIn response to Amanda Milling’s question, the Prime Minister said that Police and Crime Commissioners provide greater clarity to local people on the issue of policing and when they bring forward good ideas, such as Matthew’s ‘Proceeds of Crime Fund’, they should be rewarded at the ballot box.\nMatthew Ellis was elected as Staffordshire’s Police and Crime Commissioner in November 2012, when these positions were first introduced replacing the old Police Authorities. Police and Crime Commissioner elections will be taking place on Thursday 5 May.\nMore details, including application forms and animated videos about the fund are available at www.staffordshire-pcc.gov.uk/fund\nYou can watch Amanda’s question to the Prime Minister here – http://goo.gl/vc6YOL",
  "https_www_amandamilling_com_/https_www_amandamilling_com_contact/content_6.html": "Living here means that Amanda is always out and about in Cannock, Hednesford, Rugeley and our villages visiting residents and businesses.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_amandamilling_com_/https_www_amandamilling_com_news_amanda-milling-mp-welcomes-ban-ivory-sales/content_57.html": "Cannock Chase MP, Amanda Milling, has welcomed an announcement by the Environment Secretary, the Rt Hon Michael Gove MP, that the UK will introduce a ban on ivory sales.\nThe proposed ban will be the toughest in Europe and amongst the toughest in the world – helping to protect elephants for future generations. The move follows a consultation which had more than 70,000 responses – with over 88 per cent in favour of the ban.\nThe UK has long been a global leader in the international fight against the illegal ivory trade. But over the last decade, the number of elephants has declined by almost a third and around 20,000 a year are still being slaughtered due to the global demand for ivory – showing there is more to do.\nAs part of the Government’s action to tackle the Ivory trade, at a recent European Environment Council, the UK called for EU member states to ban commercial trade in raw ivory – which is already banned in the UK – within the EU as soon as possible.\nFollowing on from the ground breaking conference on the illegal wildlife trade held in London in 2014, the UK will host the fourth international conference on the illegal wildlife trade in October. This will bring global leaders to London to tackle the strategic challenges of the trade.\nEnvironment Secretary, the Rt Hon Michael Gove MP said: “Ivory should never be seen as a commodity for financial gain or a status symbol, so we will introduce one of the world’s toughest bans on ivory sales to protect elephants for future generations. The ban on ivory sales we will bring into law will reaffirm the UK’s global leadership on this critical issue, demonstrating our belief that the abhorrent ivory trade should become a thing of the past.”\nAmanda Milling MP said: “This announcement confirms that this Conservative Government will make every effort to halt the heart-breaking decline in Africa’s elephant population in recent years. We need to leave our planet in a better state for the next generation, with stronger protections for animal welfare, but also cleaner air, greener spaces and tougher action on plastic waste.”\nThe CEO of Tusk Trust, Charlie Mayhew MBE, said: \"We are delighted that the Government has listened to our concerns and given the overwhelming public response to their consultation is now moving decisively to introduce tough legislation to ban the trade in ivory in the UK. The narrowly defined exemptions are pragmatic. The ban will ensure there is no value for modern day ivory and the tusks of recently poached elephants cannot enter the UK market. We welcome the fact that Ministers are sending such a clear message to the world that the illegal wildlife trade will not be tolerated and every effort will be made to halt the shocking decline in Africa’s elephant population in recent years.”",
  "https_www_amandamilling_com_/https_www_amandamilling_com_cookies/content_4.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_amandamilling_com_/https_www_amandamilling_com_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}