{
  "http_www_alexchalk_com_/https_www_alexchalk_com_contact/content_11.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nGET IN TOUCH\nYour Name\nYour Last Name\nYour Email\nMessage Subject\nLeave us a message...\nSend Message\nWe've received your message!\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_mp-cheltenham/content_20.html": "Alex was elected as Member of Parliament in May 2015 and was re-elected in 2017 and 2019.\nAs a backbencher he served on the Justice Select Committee, and campaigned on issues including legal aid, the environment and cyber security. Alongside other MPs, including Richard Graham from the neighbouring Gloucester constituency, Alex successfully campaigned to raise the maximum sentence for stalking from five to ten years.\nHe led a Parliamentary inquiry, together with the Children’s Society and Young Minds charities, into the impact of social media and cyber bullying on young people’s mental health. The findings, derived from the evidence of over 1,000 young people, are still receiving national and international attention. They have led to significant progress in this area.\nIn 2019, following months of campaigning - including a petition signed by 20,000 local residents - Alex successfully blocked Trust bosses' plans to shut Cheltenham's A&E, after it had been earmarked for closure. Speaking at the Despatch Box in the House of Commons, the then Health Secretary announced \"In light of the extensive representations made to me by my honourable friend (Alex Chalk) made regarding the A&E in Cheltenham, I have spoken to the Chief Executive of Gloucester Hospitals Trust and I can announce that Cheltenham's A&E will remain open and that no proposals to close the A&E at Cheltenham will be part of the forthcoming consultation.\"\nDuring his time as a backbencher, Alex was Chair of the All Party Parliamentary Group (APPG) on Pro Bono and Public Legal Education; Vice-Chair of the APPG on Cycling; Vice-Chair of the APPG on Bees; Vice-Chair of the APPG on Eating Disorders; and a member of the APPG for Highways Maintenance.\nAlex sent regular updates to his constituents about what he was been doing in Cheltenham and Westminster.\nClick on the links below:",
  "http_www_alexchalk_com_/https_www_alexchalk_com_about/content_16.html": "Alex Chalk is a prominent British politician, lawyer, and public servant.\nHe was educated at Winchester College and Magdalen College Oxford (Modern History). After working post-university as a speechwriter for William Hague as Leader of the Opposition, he studied for the Graduate Diploma in Law at City University, graduating with 'Distinction' in 2000.\nHe secured tenancy at 6 Pump Court (common law) before later moving to 6KBW College Hill (leading criminal law set).\nIn a sixteen-year career as a barrister, Alex specialised in serious fraud, counter-terrorism and homicide. He appeared in many high-profile cases that were widely reported in the media - from bomb plots to major cross-border fraud. Instructed by the SFO, FCA and many others, he also prosecuted a number of acolytes of Anjem Choudary, who has been described as the face of Islamist extremism in the UK.\nHe was elected as the Member of Parliament for Cheltenham in 2015, and was re-elected in 2017 and 2019.\nIn Parliament, Alex quickly gained a reputation as an independent-minded and thoughtful parliamentarian.\nConsidered a \"rising star\" of the 2015 intake he campaigned to increase the maximum sentence for stalking, following the ordeal suffered by one of his constituents, a Cheltenham GP. He fought successfully for a homelessness hub to be set up in the town, and used his platform in Parliament to face down attempts to shut Cheltenham's A&E.\nHe describes his driving passion as social mobility, something which lay behind his vision to transform the town into a national cyber hub to create opportunities for young people from all backgrounds. He successfully secured over £42m from central Government for his plans.\nAlex was appointed a minister in 2020, and served in a series of roles, including HM Solicitor General for England & Wales and Lord Chancellor & Secretary of State for Justice.\nHe is married with three young children, and splits his time between London and Cheltenham.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_alex-introduces-fundamental-reforms-to-justice-system/content_21.html": "Alex Introduces Fundamental Reforms to Justice System\n- Alex Chalk\n- Oct 24, 2023\n- 1 min read\nAlex has announced a fundamental shake-up of the justice system that takes dangerous offenders off the streets for longer while rehabilitating lower risk offenders.The reforms include:\nRapists to stay locked up for all of their sentences, building on the Government's work to keep the most dangerous offenders in prison for longer\nEnding the merry-go-round of reoffending by legislating for a presumption against prison sentences of less than 12 months. Instead of going to prison, the lowest risk and first-time offenders will be given a chance to turn themselves away from a life of crime by repaying their debt to society by cleaning up neighbourhoods and scrubbing graffiti off walls.\nStepping up work to remove thousands of foreign prisoners by deporting them earlier and agreeing more transfer agreements with other countries\nLegislating to allow prisoners to be held in overseas prisons\nReviewing the incentives around early guilty pleas, to save the courts time and spare victims the ordeal of giving evidence in court\nYou can watch Alex's statement in the House of Commons by clicking HERE\nYou can read Alex's OpEd in The Telegraph by clicking HERE\nYou can read more about the reforms by clicking HERE",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_alex-chalk-lord-chancellor-how-to-fix-britain-s-prisons/content_25.html": "The Rest is Politics: How to fix Britain’s prisons\n- Alex Chalk\n- Aug 27, 2024\n- 1 min read\nUpdated: Sep 9, 2024\nWhat are the powers of the Lord Chancellor? How important are friendships in politics? What needs to change to solve the prison crisis in the UK?\nRory and Alastair are joined by Lord Chancellor and Secretary of State for Justice Alex Chalk to answer all these questions and more.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_categories_westminster-news/content_7.html": "top of page\nAlex Appointed as Lord Chancellor and Secretary of State for Justice\nThe Prime Minister has appointed Alex as Lord Chancellor and Secretary of State for Justice. He is Cheltenham's first ever Cabinet...\nApr 21, 2023\nAlex Cuts Steel on Latest Royal Navy Frigate\nAlex was invited to Rosyth naval dockyard in Scotland to cut steel on HMS Active, the latest Type 31 frigate for the Royal Navy. The...\nJan 29, 2023\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_alex-resigns-as-hm-solicitor-general/content_13.html": "Alex Resigns as HM Solicitor General\n- Alex Chalk\n- Jul 5, 2022\n- 1 min read\nCheltenham MP Alex Chalk has resigned as HM Solicitor General for England and Wales.\nHe had been the first MP from Cheltenham to serve in Government since the 1850s.\nIn a letter to Boris Johnson, Mr Chalk said it was “with great sadness” he was quitting the post but added he could not “defend the indefensible”.\nHe wrote: “To be in government is to accept the duty to argue for difficult or even unpopular policy positions where that serves the broader national interest. But it cannot extend to defending the indefensible.\n“The cumulative effect of the Owen Paterson debacle, Partygate and now the handling of the former Deputy Chief Whip’s resignation, is that public confidence in the ability of Number 10 to uphold the standards of candour expected of a British Government has irretrievably broken down. I regret that I share that judgement.\n“This comes at a moment of intense challenge for our country, when trust in government can rarely have been more important. I’m afraid the time has therefore come for fresh leadership.”\nChalk was the first Minister of State to resign and was the third to resign after the Chancellor Rishi Sunak and Health Secretary Sajid Javid.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_alex-interviewed-by-laura-kuenssberg/content_3.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nSearch\nAlex Interviewed by Laura Kuenssberg\nalexchalk28\nSep 9, 2024\n0 min read\nRecent Posts\nSee All\nLBC: Nick Ferrari is joined by Former Justice Secretary Alex Chalk\nThe Rest is Politics: How to fix Britain’s prisons\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_alex-takes-decisive-action-so-that-the-wrongly-convicted-no-longer-face-being-charged-for-saved-li/content_18.html": "Alex Takes Decisive Action so that the Wrongly-Convicted No Longer Face Being 'Charged' for Saved Living Expenses\n- Alex Chalk\n- Aug 9, 2023\n- 2 min read\nAndrew Malkinson spent 17 years in jail for a crime he did not commit. He was locked up in 2004 for rape, only to be cleared following the emergence of DNA evidence which showed his conviction was unsafe.\nWhen I heard about the case, my blood ran cold. As a prosecutor for many years, I believed to my bootstraps in the importance of ensuring that trials were fair and convictions were safe. It underpins a prosecutor’s duty to the court.\nTo make matters worse for Mr Malkinson, it emerged that he was at risk of having any future compensation award slashed on the basis that his living expenses whilst in prison should be deducted. That struck me as fundamentally unfair. It surely cannot be right that victims of devastating miscarriages of justice, wrongly languishing in prison, should be penalised again in this way. It felt to me like a double injustice.\nSo over the weekend I intervened to scrap the rule with immediate effect.\nFrom now on, victims receiving payments under the miscarriage of justice compensation scheme will not be liable for ‘board and lodging’ deductions. Those wrongly jailed for more than ten years will instead be entitled, subject to meeting the relevant statutory test, to an award of up to £1m with the final sum determined by an independent assessor.\nThat’s only right and fair.\nBut what about previous cases? I’ve looked into them, and am reassured to discover that no such deductions have been made in the last decade. Since 2006 when the relevant principle was established, there have been just three cases where the board and lodging deduction was applied. Of those three, the deductions were a relatively modest 3%, 3% and 6%.\nStill, I will look at past cases carefully, and make a decision about what is fair in all the circumstances.\nOn my appointment as Lord Chancellor, I stated that my priorities for office were to ensure that the guilty were convicted, but also that the innocent walk free. Both matter equally. Andrew Malkinson’s case makes me feel more strongly about that than ever.\n[Column published in the Cheltenham Post]",
  "http_www_alexchalk_com_/https_www_alexchalk_com_accessibility/content_14.html": "Accessibility\nThis accessibility statement relates to this website.\nIt is important to make websites accessible to the widest possible audience. Therefore, this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not substantially impede navigating the website.\nYou should be able to:\n-\nZoom in up to 300% without text spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n-\nNavigate most of the website using a keyboard.\n-\nNavigate most of the website using speech recognition software.\n-\nListen to most of the website with a screen reader.\n-\nRead most of the website with a Braille device.\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat We Do to Improve Accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility, including:\n-\nImproving layouts and colours to enhance simplicity and contrast.\n-\nEnsuring that text appears in a legible font size.\n-\nEnsuring that tap targets are an accessible size and not too small or close together.\n-\nConsidering accessibility in all design and functionality decisions.\n-\nPublishing best practices for website administrators relating to content accessibility.\nHow Accessible is the Website?\nDue to the devolved nature of content management, the responsibility for accessibility of content rests with the content creators. The developers are aware of potential issues that could arise, such as:\n-\nImages used as links.\n-\nBroken links.\n-\nText as images in some locations, such as infographics and logos, without supportive descriptions.\n-\nNon-optimal images and PDFs, such as scanned letters.\n-\nSome historic images lack alternative text (prior to August 2016, when alt text became mandatory).\n-\nNot all videos feature subtitles and/or descriptive text.\nThe developers cannot take responsibility for content added to the website but strive to resolve issues where possible through functionality improvements and disseminated best practices. It is entirely possible for content creators themselves to resolve these accessibility issues.\nBrowser Accessibility\nThis website has been optimised for the latest versions of the following browsers:\n-\nGoogle Chrome\n-\nMozilla Firefox\n-\nApple Safari\n-\nMicrosoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to Request Information in an Accessible Format\nThis website has its own administrator, and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting Accessibility Problems\nThis website has its own administrator, and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, you can contact the Equality Advisory and Support Service (EASS).",
  "http_www_alexchalk_com_/https_www_alexchalk_com_barrister/content_6.html": "“Phenomenally bright… a very good advocate\" (Chambers & Partners)\n“A persuasive and forceful advocate” (Legal 500)\nPrior to his election, Alex prosecuted and defended in the most serious cases, including international fraud, terrorist bomb plots, multi-handed rape cases and murder. Instructing solicitors have included the Serious Fraud Office ('A' Panel) and the Financial Conduct Authority. Alex has also provided pro bono advice – including to Nasrin Sotoudeh, a prisoner of conscience previously held captive in Iran.\nWhite Collar Crime\nAlex has instructed to advise and defend corporate clients. In relation to media investigations he acted for a number of prominent journalists in proceedings arising out of Operation Weeting (phone-hacking) and Operation Elveden (corrupt payments to public officials). He has acted on behalf of company directors accused of offences under the Insolvency Act 1986 and has represented corporate clients in relation to proceedings brought by the Environment Agency as well as under the Property Misdescriptions Act 1991.\nAlex has experience of prosecuting on behalf of HMRC, the Department for Business, Innovation and Skills, the Office of the Immigration Services Commissioner and others. In addition he has prosecuted privately, including on behalf of an internet company\nin proceedings alleging the criminal misappropriation of online metadata.\nTerrorism\nAlex has been instructed in the most serious terrorism cases. In 2013 he acted in the prosecution of six defendants accused of planning an extremist terrorist atrocity in the UK, using an improvised explosive device (IED), firearms and swords. He also has experience in prosecuting offences under section 58 of the Terrorism Act 2000 – including possession of documents useful to those seeking\nto manufacture IEDs and evade detection. Alex is used to dealing with highly sensitive material, as well as advising on complex disclosure issues. He is familiar with marshalling large volumes of documentation, and advising on electronic trial presentation.\nInquests and Public Inquiries\nAlex has appeared at inquests and public inquiries, including an inquest arising out of the murder of two private security contractors, shot dead by a colleague in Iraq.\nCriminal Litigation\nAlex prosecutes and defends in cases of homicide. He has appeared in several Operation Trident cases at the Central Criminal Court, including a double murder relating to targeted executions in south London. Other cases have included gang murder, and drug-related shootings. In this context he has developed experience in handling sensitive disclosure issues, assessing material ranging from covert\nhuman intelligence source reports to prison surveillance recordings. As Defence Counsel Alex has successfully defended clients charged with murder and attempted murder arising out of serious gang violence in London, as well as gun crime.\nAlex also acts in cases involving serious sexual offences. He has, for example, prosecuted six defendants accused of abducting two teenagers from Telford and subjecting them to a weekend of rape, sexual violence and degradation. He also prosecutes and defends in fatal road traffic cases, and is an experienced cross-examiner of experts.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_podcasts/content_8.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nIN THE MEDIA\nPodcasts, TV interviews etc\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_alex-s-net-zero-bill/content_27.html": "Alex's Net Zero Bill\n- Alex Chalk\n- Apr 25, 2019\n- 2 min read\nClimate change is not some theoretical future possibility – it is a present reality.\nThe five warmest years in recorded history have been since 2010. Easter Monday was the hottest on record. This January Australia experienced its warmest month ever, with power stations forced to shut down. Last year wildfires broke out in the Arctic Circle.\nWe can choose to dismiss these events as a coincidence. We can ignore the fact that they have taken place alongside soaring levels of atmospheric carbon dioxide. Or we can listen to the overwhelming majority of climate science which concludes that the evidence of humankind’s influence on the climate is now unanswerable.\nThat's what we must do, and I want Cheltenham to play its part in framing our national response. So I have decided to introduce a Bill to Parliament on 30 April which would limit the UK’s carbon emissions to net zero by 2050. If passed, we would become the first nation in the G20 to enshrine this target in law, showing radical leadership to the rest of the world. Our country may only be responsible for around one per cent of global greenhouse gas emissions, but we have a responsibility to act.\nWe have a tradition of global leadership too. The Climate Change Act 2008 was pioneering legislation which mandated the reduction of emissions by 80% on 1990 levels. As a result carbon emissions have dropped by 42% - the best performance, according to PWC, of any major economy.\nNow the evidence shows we must now be even more bold. And I know from listening to young people in Cheltenham like those I met recently at Bournside School, that this is their priority too. And this law would help to avoid tipping point events such as the melting of the permafrost, releasing vast amounts of methane, and the collapse of polar sea ice.\nThe time for action is now. We must protect Planet A because there is no Planet B.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_latest-news-from-me/content_26.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nSearch\nLBC: Nick Ferrari is joined by Former Justice Secretary Alex Chalk\nAlex Chalk\nSep 4, 2024\n0 min read\nRecent Posts\nSee All\nAlex Interviewed by Laura Kuenssberg\nThe Rest is Politics: How to fix Britain’s prisons\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog/content_23.html": "top of page\nSep 9, 2024\nLBC: Nick Ferrari is joined by Former Justice Secretary Alex Chalk\nAlex answers questions from Nick Ferrari on Grenfell and the latest in British politics\nSep 4, 2024\nThe Rest is Politics: How to fix Britain’s prisons\nWhat are the powers of the Lord Chancellor? How important are friendships in politics? Rory and Alastair interview Alex Chalk\nAug 27, 2024\n£500,000 of Government Funding Gives Green Light for Gloucestershire Cancer Institute\nYou did it! Thanks to the wonderful support of so many local people, I’m delighted to report that our campaign for the Gloucestershire...\nMay 22, 2024\n\"A Gloucestershire Cancer Institute Would Ensure That Fewer Cheltenham Families Experience the Tragedy of Cancer\"\nA huge privilege of being Cheltenham’s MP is being able to support exceptional people – Cheltonians whose actions and achievements can...\nMay 15, 2024\nCheltenham's YMCA Play Leading Role in our Fight to End Homelessness\nAs one of Cheltenham’s YMCA honorary vice-presidents, I was delighted to join dozens of hardy souls at the YMCA Sports Centre off Arle...\nMar 6, 2024\nAlex Introduces Fundamental Reforms to Justice System\nAlex has announced a fundamental shake-up of the justice system that takes dangerous offenders off the streets for longer while ...\nOct 24, 2023\nAlex Takes Decisive Action so that the Wrongly-Convicted No Longer Face Being 'Charged' for Saved Living Expenses\nAndrew Malkinson spent 17 years in jail for a crime he did not commit. He was locked up in 2004 for rape, only to be cleared following...\nAug 9, 2023\nAlex Appointed as Lord Chancellor and Secretary of State for Justice\nThe Prime Minister has appointed Alex as Lord Chancellor and Secretary of State for Justice. He is Cheltenham's first ever Cabinet...\nApr 21, 2023\nAlex Cuts Steel on Latest Royal Navy Frigate\nAlex was invited to Rosyth naval dockyard in Scotland to cut steel on HMS Active, the latest Type 31 frigate for the Royal Navy. The...\nJan 29, 2023\nAlex Resigns as HM Solicitor General\nCheltenham MP Alex Chalk has resigned as HM Solicitor General for England and Wales. He had been the first MP from Cheltenham to serve in...\nJul 5, 2022\nAlex's Net Zero Bill\nClimate change is not some theoretical future possibility – it is a present reality. The five warmest years in recorded history have...\nApr 25, 2019\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_tags_former-justice-secretary/content_33.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nLBC: Nick Ferrari is joined by Former Justice Secretary Alex Chalk\nAlex answers questions from Nick Ferrari on Grenfell and the latest in British politics\nSep 4, 2024\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_tags_alex-chalk/content_30.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nLBC: Nick Ferrari is joined by Former Justice Secretary Alex Chalk\nAlex answers questions from Nick Ferrari on Grenfell and the latest in British politics\nSep 4, 2024\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_categories_holyrood-news/content_4.html": "top of page\nAlex Introduces Fundamental Reforms to Justice System\nAlex has announced a fundamental shake-up of the justice system that takes dangerous offenders off the streets for longer while ...\nOct 24, 2023\nAlex Takes Decisive Action so that the Wrongly-Convicted No Longer Face Being 'Charged' for Saved Living Expenses\nAndrew Malkinson spent 17 years in jail for a crime he did not commit. He was locked up in 2004 for rape, only to be cleared following...\nAug 9, 2023\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_defence-procurement/content_28.html": "In October 2022 Alex was appointed Minister for Defence Procurement (MinDP).\nHe acted quickly to set in train far-reaching reforms to Britain's military acquisition framework which he described as 'wasteful' and 'sclerotic'. In a speech to the Make UK Defence Summit, he called for the procurement process to be radically speeded up, noting:\n\"Perfect is the enemy of the good. 80% capability today is far preferable to 100% capability tomorrow - particularly as all too often, tomorrow never comes.\"\nAs MinDP, his responsibilities included:\n-\nNuclear Enterprise\n-\nDefence procurement; Air, Land, Maritime and Joint domain\n-\nComplex Weapons\n-\nTrade, Exports, Foreign Investments and Economic Security\n-\nDefence and Security Industrial Strategy (DSIS)\n-\nDefence Industry Relationships\n-\nEquipment Plan\n-\nDefence Digital\n-\nShipbuilding Programmes (MOD)\n-\nScience and Technology (Dstl)\n-\nR&D and Innovation\nHe worked closely with Five Eyes and NATO colleagues, as well as senior industry and military leaders.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_alex-cuts-steel-on-latest-royal-navy-frigate/content_10.html": "Alex Cuts Steel on Latest Royal Navy Frigate\n- Alex Chalk\n- Jan 29, 2023\n- 1 min read\nAlex was invited to Rosyth naval dockyard in Scotland to cut steel on HMS Active, the latest Type 31 frigate for the Royal Navy. The ceremony was attended by representatives from Poland, Indonesia, the USA, Denmark, Ireland and other nations - as well as Falklands veterans.\nHMS Active will be a cutting edge, highly capable vessel and will become the backbone of the fleet’s global operations by the decade’s end.\nIt will intercept illegal activity, gather intelligence, provide humanitarian relief as well as having the ability to adapt to the ever-evolving threats of the 21st century.\nAlex was joined by Second Sea Lord Vice Admiral Martin Connell and Falklands' veterans who served on Active's immediate predecessor,\nWriting on Facebook, Alex said:\n\"A privilege to cut steel today for our latest Type 31 frigate. HMS Active will be the twelfth ship of that name to serve in the Royal Navy and will be the most capable yet.\n\"It was moving to be joined by veterans of Active’s immediate predecessor which saw action in the Falklands War in 1982. They served with great skill and courage, and watched with pride as construction began on the new ship.\"\nTo watch a video of Alex's visit, please click HERE\nTo learn more about the second Type 31 Frigate, please click HERE",
  "http_www_alexchalk_com_/https_www_alexchalk_com_privacy/content_17.html": "Data Protection and Privacy Policy\nThis document outlines how Alex Chalk processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Alex Chalk.\n2. Contact\nIf you have any questions about this policy, need more information about how we use your data, or would like to exercise any of your rights, please contact Alex Chalk.\n3. Lawful basis for processing\nAll processing is carried out by consent or under the legitimate interest of Alex Chalk, or public interest. This covers processing for casework, campaigning, and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement, including fundraising activity for such purposes.\n4. Data sources\nData held is provided by you when you contact us and through correspondence with third parties in response to cases taken up on your behalf. We may also hold data you provide when we contact you—such as participating in a survey or petition. If you do not wish for us to contact you by telephone, please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors provided by councils to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standards, and we store our data on servers located in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as permitted in clauses 22, 23, and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision allows data to continue flowing between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA, so it may be necessary to transfer your personal data outside of the EEA. Where such a transfer takes place, we will ensure it is protected in the same way as if the data were inside the EEA and only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• An adequacy decision issued by the European Commission determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract with the recipient of the data obliging them to protect the data to EEA standards.\nIt is not legally permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held no longer than necessary. Some types of data may be held longer than others, typically for a maximum of two election cycles. We review the data held each election cycle to determine whether it should be maintained or put beyond use. We also comply with ICO's guidelines regarding petitions.\n9. Subject Access Requests\nWe will verify the identity of any individual making a request, ask for further details if needed, and respond within one calendar month once we confirm it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests with details, including identifiable information, indefinitely.\nData subjects have the right to:\n• Be informed whether any personal data is being processed.\n• Be given a description of the personal data, the reasons for its processing, and whether it will be shared with other organisations or people.\n• Receive a copy of the information comprising the data and details of its source, where available.\n10. Will we share your data with anyone else?\nIf you contact us about a personal or policy issue, your data may be shared with a third party, such as local authorities, government agencies, public bodies, health trusts, regulators, etc., while dealing with your enquiry. Any third parties we share your data with are required to keep your details securely and use them only for the intended purpose.\nWe may also need to share your data with third parties, such as the police, if required by law.\nUnless otherwise specified, data may be shared with entities of political party associations, federations, branches, groups, and affiliates to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions via the Contact form are sent directly to their destination. The nature of casework and other enquiries is not retained on the website, but this information is available for a limited period on servers for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is used only as outlined here and within your reasonable expectations based on the nature of the communication, while recognising the need for political engagement in supporting democratic processes.\n11. Data Rights\nYou have the following rights at any time:\n• Right of access – to request a copy of the information held about you.\n• Right of rectification – to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – to request data held about you be erased, under certain conditions.\n• Right to object – to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – and to avoid being subject to the legal effects of automated processing or profiling.\n• Right to judicial review – if our office refuses your request under rights of access, we will provide a reason. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with how your data has been processed, you can complain to the Information Commissioner’s Office (ICO), the supervisory body authorised under the Data Protection Act 2018 to regulate personal data handling within the UK. The ICO’s contact details are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held, please contact Alex Chalk via the contact information on this website.\nPlease note that proof of identity is required to exercise any of the above rights regarding personal data.\nWe retain the right to update this policy at any time. If there are significant changes affecting your rights, we will notify you in advance.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_lorem-ipsum-dolor-sit-amet-consectetur-adipiscing-elit/content_34.html": "£500,000 of Government Funding Gives Green Light for Gloucestershire Cancer Institute\n- Alex Chalk\n- May 22, 2024\n- 2 min read\nYou did it! Thanks to the wonderful support of so many local people, I’m delighted to report that our campaign for the Gloucestershire Cancer Institute at Cheltenham General has succeeded.\nAfter several meetings I had with the Prime Minister and Health Secretary, the Government listened and agreed to provide £500,000 of new funding for this transformational new facility. It means we’ve got the green light for the full business case, and the project can now go ahead.\nSpearheaded by the excellent Cheltenham & Gloucester Hospitals Charity, the GCI will revolutionise cancer care in our town. It will provide a modern environment for patients, together with digital consulting rooms, space for research, and therapeutic outside space.\nThat in turn will lead to earlier screening, faster diagnosis and referral. All in all, even better treatment for people living with and beyond cancer. For all those who have been affected by cancer, or know someone who has, this is such positive news.\nThese new facilities are over and above what the NHS alone could provide, and is a major shot in the arm for Cheltenham General. Critically, it will also help us attract and retain the very best cancer clinicians.\nCombined with generous individual donations secured by the Cheltenham and Gloucester Hospitals Charity, this Government funding is the latest vote of confidence in the future of Cheltenham General.\nIt comes on top of the £17.2m Chedworth Surgical Unit which opened to patients earlier this year, and the £10.2m provided last year to build a new orthopaedic theatre and birthing unit. We’ve also secured a £6.5m upgrade of CGH’s Radiology Department, as well as £2 million for a new Apollo theatre, £1.25 million for a new cancer-busting robot, and £900,000 to upgrade A&E waiting facilities.\nAll in all, it takes the total capital investment in our hospital since 2015 to over £40m.\nNone of this would have been possible without the fantastic support from local people. I can’t thank Echo readers enough!\n[Column published in the Gloucestershire Echo]",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_categories_latest-news/content_15.html": "top of page\nSep 9, 2024\nLBC: Nick Ferrari is joined by Former Justice Secretary Alex Chalk\nAlex answers questions from Nick Ferrari on Grenfell and the latest in British politics\nSep 4, 2024\nThe Rest is Politics: How to fix Britain’s prisons\nWhat are the powers of the Lord Chancellor? How important are friendships in politics? Rory and Alastair interview Alex Chalk\nAug 27, 2024\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com/content_2.html": "About Alex Chalk\nAlex is a Partner at Jones Day in the Global Disputes, Government Regulation and Investigations & White Collar Defence practices.\nDuring sixteen years at the Bar, Alex prosecuted and defended in widely reported cases, including serious fraud (acting for the Serious Fraud Office 'A' Panel, the FCA and others). He also appeared in cases of terrorism, homicide and serious sexual violence. Alex has practised in courts ranging from the Central Criminal Court (Old Bailey) to the Court of Appeal.\nIn 2015 Alex was elected MP for Cheltenham. During the following nine years he secured over £180m of investment for the town, successfully opposed plans to close the town's A&E and pursued his agenda of promoting opportunity and social mobility in his constituency.\nAlex served as Lord Chancellor & Secretary of State for Justice, HM Solicitor General and Minister of State for Defence Procurement. He was the first Cheltenham MP since the seat's creation in 1832 to sit in Cabinet.\nAlex is married with three children and splits his time between London and Cheltenham.\nNews & Updates\nFrom December 2024 to January 2025 Alex appeared at the Old Bailey as lead prosecution counsel in the case of Hassan Sentamu - a 17-year old male charged with the murder of 15-year old Elianne Andam in Croydon.\nHassan Sentamu was convicted as is awaiting sentence.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_cookies/content_29.html": "Cookies\nCookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device in the following ways:\n-\nRecognising your device so that you don’t have to give the same information several times during one task.\n-\nMeasuring the number of people visiting the website to ensure that our servers can load web pages quickly at peak times.\n-\nBenchmarking anonymised data to improve the design and functionality of the website, including when we occasionally test and experiment with new technologies to enhance your online experience.\n-\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g., for advertisers), and therefore there are no cookie management preferences. However, you can still control what cookies are used by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies currently in use on this website. Any cookies that are currently being tested will not be documented in this list until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings or using third-party tools, depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\n-\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click ‘OK,’ a session cookie will be set so that the pop-up doesn’t display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won’t display again the next time you visit the website if that visit is within 30 days. -\npopup\nRemembers when you’ve closed a pop-up so that it doesn’t appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won’t display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on websites.\nFacebook cookies\nIf this website displays a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website displays a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud, and improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube’s page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player—both by Flickr and its parent company, Yahoo. For more information, please visit Yahoo’s cookies pages.\nOther Google cookies\nThere may be Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google’s privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies, you may not be able to access certain areas or features of this website.\nThis policy is reviewed regularly. Please check back in the future for updates and changes.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_tags_lbc/content_35.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nLBC: Nick Ferrari is joined by Former Justice Secretary Alex Chalk\nAlex answers questions from Nick Ferrari on Grenfell and the latest in British politics\nSep 4, 2024\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_lord-chancellor/content_19.html": "In April 2023, Alex was appointed Lord Chancellor and Secretary of State for Justice - the first Cheltenham MP to join the Cabinet since the constituency's creation in 1832.\nThe Lord Chancellor is one of the most ancient offices of state, dating back many centuries. The Lord Chancellor is appointed by the monarch on the advice of the Prime Minister and is a senior member of the Cabinet. They head the Ministry of Justice as the Secretary of State for Justice, with responsibility for a budget of around £14bn and over 80,000 employees. Previously the Lord Chancellor also acted as Speaker of the House of Lords and therefore sat on the Woolsack. The Lord Chancellor was also head of the judiciary and the senior judge of the House of Lords in its judicial capacity. However, under the Constitutional Reform Act 2005, the Lord Chancellor ceased to be the Speaker of the Lords, and was replaced by the Lord Speaker. In addition, the Lord Chief Justice is now head of the judiciary, and the Lord Chancellor may no longer sit as a judge.",
  "http_www_alexchalk_com_/http_www_alexchalk_com/content_1.html": "About Alex Chalk\nAlex is a Partner at Jones Day in the Global Disputes, Government Regulation and Investigations & White Collar Defence practices.\nDuring sixteen years at the Bar, Alex prosecuted and defended in widely reported cases, including serious fraud (acting for the Serious Fraud Office 'A' Panel, the FCA and others). He also appeared in cases of terrorism, homicide and serious sexual violence. Alex has practised in courts ranging from the Central Criminal Court (Old Bailey) to the Court of Appeal.\nIn 2015 Alex was elected MP for Cheltenham. During the following nine years he secured over £180m of investment for the town, successfully opposed plans to close the town's A&E and pursued his agenda of promoting opportunity and social mobility in his constituency.\nAlex served as Lord Chancellor & Secretary of State for Justice, HM Solicitor General and Minister of State for Defence Procurement. He was the first Cheltenham MP since the seat's creation in 1832 to sit in Cabinet.\nAlex is married with three children and splits his time between London and Cheltenham.\nNews & Updates\nFrom December 2024 to January 2025 Alex appeared at the Old Bailey as lead prosecution counsel in the case of Hassan Sentamu - a 17-year old male charged with the murder of 15-year old Elianne Andam in Croydon.\nHassan Sentamu was convicted as is awaiting sentence.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_categories_opinions/content_12.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nCheltenham's YMCA Play Leading Role in our Fight to End Homelessness\nAs one of Cheltenham’s YMCA honorary vice-presidents, I was delighted to join dozens of hardy souls at the YMCA Sports Centre off Arle...\nMar 6, 2024\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_alex-appointed-as-lord-chancellor-and-secretary-of-state-for-justice/content_32.html": "Alex Appointed as Lord Chancellor and Secretary of State for Justice\n- Alex Chalk\n- Apr 21, 2023\n- 1 min read\nThe Prime Minister has appointed Alex as Lord Chancellor and Secretary of State for Justice. He is Cheltenham's first ever Cabinet Minister.Alex's new Ministerial responsibilities include:\nOversight of all portfolios and Ministry of Justice strategy\nOversight of international business and future relations with the EU\nMoJ support for the Union\nResourcing of the department\nFunctions of the Lord Chancellor\nJudicial policy including pay, pensions and diversity (these and other operational decisions affecting the judiciary are reserved to the Lord Chancellor)\nCorporate services\nWriting on X, Alex said:\"Honoured to return to the Ministry of Justice as Lord Chancellor and Justice Secretary: a hugely important brief that upholds the values of our great country – the rule of law, justice for victims and the right to a fair trial.\"",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_categories_articles/content_22.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nAlex's Net Zero Bill\nClimate change is not some theoretical future possibility – it is a present reality. The five warmest years in recorded history have...\nApr 25, 2019\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_cheltenham-s-ymca-play-leading-role-in-our-fight-to-end-homelessness/content_31.html": "Cheltenham's YMCA Play Leading Role in our Fight to End Homelessness\n- Alex Chalk\n- Mar 6, 2024\n- 2 min read\nAs one of Cheltenham’s YMCA honorary vice-presidents, I was delighted to join dozens of hardy souls at the YMCA Sports Centre off Arle Road to support their annual Sleep Easy last weekend. I have slept rough for YMCA many times in the past, and I know how gruelling it is to bed down in their cold and damp car park with just a cardboard box for shelter.\nThe sheer number who turned out is a sign of our community’s respect for the work of the YMCA. They do an extraordinary job of providing kindness, comfort and shelter to some of the most vulnerable people in our Cheltenham community. As I have said in Parliament, every rough sleeper is a living rebuke to us to do more, and the YMCA answers that call every day.\nTheir flagship £4.1m supported accommodation building on Vittoria Walk provides 73 rooms for those facing challenges, from addiction to relationship breakdown and mental health difficulties.\nTo back their work, I am delighted that we were able to secure nearly £1 million from the Government to set up our town’s first ‘homeless hub’ shortly after I raised the issue at Prime Minister’s Questions. That emergency hub is staffed all day, every day, to provide a safe environment off the streets. On arrival, staff make a rapid assessment and provide interventions tailored to the individual. Those might relate to mental health or substance abuse. Staff also design a personal housing plan to tackle the underlying drivers of the individual’s rough-sleeping.\nIn addition, outreach workers are also funded by Government, so that members of the public can report rough sleepers to the Streetlink portal knowing that the vulnerable individual will be contacted and offered rapid support.\nIn addition, I am delighted that just last week the Government awarded Cheltenham Borough Council a further £209,000 in Homelessness Prevention funding to provide homes for rough sleepers and to help prevent families from ending up without a roof over their heads.\nBut as well as emergency accommodation, we need follow-on homes too. That’s why I’m delighted we secured £3.8 million Government funding to secure 50 one and two-bedroom flats across Cheltenham and beyond for people facing homelessness.\nThere is of course more to do, but our community is coming together to address the challenges. And YMCA are playing a leading role.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_post_a-gloucestershire-cancer-institute-would-ensure-that-fewer-cheltenham-families-experience-the-trage/content_24.html": "\"A Gloucestershire Cancer Institute Would Ensure That Fewer Cheltenham Families Experience the Tragedy of Cancer\"\n- Alex Chalk\n- May 15, 2024\n- 2 min read\nA huge privilege of being Cheltenham’s MP is being able to support exceptional people – Cheltonians whose actions and achievements can leave you lost for words.\nCaspar Hambling and Ollie Burridge are two such people. Aged just fifteen, last Saturday the pair ran a stunning 50km in memory of their friend Ellison who died in 2021 from a rare form of bone cancer. They started their run at Cheltenham ParkRun in Pittville Park and ended it in Naunton Park. It is an astonishing and moving tribute, and I know I speak for the whole town in warmly congratulating them.\nTheir efforts were a powerful reminder, if one were needed, that cancer shatters lives.\nSo I am delighted to see such fantastic local support for plans for a new specialist cancer institute at Cheltenham General.\nSpearheaded by the excellent Cheltenham & Gloucester Hospitals Charity, I am passionate about this project because a Gloucestershire Cancer Institute would support earlier screening, faster diagnosis and referral. That in turn would improve treatment for people living with and beyond cancer.\nCheltenham is already recognised for the excellence of its cancer care. Some of the best clinicians in the country are based here on our doorstep, and patients come from as far away as Clwyd in Wales to be treated. They benefit from some of the most modern equipment and scanners anywhere in the world, as I know from visiting to see the brand-new £6.5m radiotherapy machines.\nBut I am determined we should go further still.\nI recently held talks with the Health Secretary to bang the drum for this project, making the case that funding from central Government would unlock the entire project.\nLike the Prime Minister, the health minister received my pitch positively, and I look forward to being able to share an update shortly.\nWith the £17.2m Chedworth Surgical Unit recently opening to patients, I believe we must keep up the momentum for further health upgrades so that fewer Cheltenham families experience the tragedy of cancer.\nIn doing so, let us remember to pay tribute the talent, dedication and commitment of local clinical staff. They may not run 50km, but they perform extraordinary heroics every single day.\n[Column published in the Gloucestershire Echo and Cheltenham Post]",
  "http_www_alexchalk_com_/https_www_alexchalk_com_hm-solicitor-general/content_9.html": "In 2021 Alex was appointed Solicitor General.\nThe Attorney General and the Solicitor General (with the Advocate General for Scotland) are known as the Law Officers. They are Ministers of the Crown and sit in one or other House of Parliament.\nThe Law Officers are the chief legal advisers to government. In that capacity they are consulted on the most sensitive or difficult legal issues facing the government, including issues of international and EU law. They deal with questions of law arising on government Bills and with issues of legal policy.\nThey also have oversight of major international and domestic litigation involving the Government.\nThe Attorney General, supported by the Solicitor General, has statutory responsibility for superintending the main prosecuting authorities in England and Wales – the Crown Prosecution Service (headed by the Director of Public Prosecutions) and the Serious Fraud Office.\nThe Attorney General has, with the Home Secretary and the Secretary of State for Justice, a shared responsibility for the development of criminal justice policy. This role in particular reflects the Attorney’s responsibility for the prosecuting authorities and their key place in the criminal justice system.\nThe Law Officers have a number of common law and statutory responsibilities which they discharge independently of government as “guardians of the public interest”. These include referring unduly lenient sentences to the Court of Appeal; applying for orders under the Supreme Court Act 1981 to declare persons vexatious litigants; intervening in certain proceedings to protect the interests of charities; and bringing proceedings for contempt of court.",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_categories_speeches-in-parliament/content_5.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nAlex Resigns as HM Solicitor General\nCheltenham MP Alex Chalk has resigned as HM Solicitor General for England and Wales. He had been the first MP from Cheltenham to serve in...\nJul 5, 2022\nbottom of page",
  "http_www_alexchalk_com_/https_www_alexchalk_com_blog_tags_nick-ferrari/content_36.html": "top of page\nRT HON ALEX CHALK KC\nABOUT ALEX\nMINISTERIAL ROLES\nLORD CHANCELLOR\nMINISTER FOR DEFENCE PROCUREMENT\nHM SOLICITOR GENERAL\nMP FOR CHELTENHAM\nBARRISTER\nCONTACT\nAll Posts\nLatest News\nSpeeches in Parliament\nOpinions\nWestminster News\nHolyrood News\nArticles\nLBC: Nick Ferrari is joined by Former Justice Secretary Alex Chalk\nAlex answers questions from Nick Ferrari on Grenfell and the latest in British politics\nSep 4, 2024\nbottom of page"
}