{
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_category_Articles/content_6.html": "Mims Davies MP supports Single Parents' Day 27th March 2023 I’m determined to help ensure the barriers to work & employment progression that my fellow single parents face are understood & fully broken down. Find more... Articles",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-global-poverty/content_54.html": "Poverty is one of the most urgent challenges of our time, and it is a sad reality that according to the World Bank, 12 million people around the globe still live in extreme poverty. While progress has been made in certain regions, you are right to point out that ongoing conflicts, extreme weather events and growing debt are all hindering development.\nI am aware of calls to introduce legislation to either compel private creditors to participate in debt relief schemes if a majority of creditors agree, or to ensure private creditors cannot sue debtor countries for more money than they would have received if they had participated in the DSSI. However, in my view, a market-based (contractual) approach to private sector participation in debt restructuring is the best way forward. Indeed, an International Monetary Fund (IMF) Review in September 2020 found this approach has been largely effective. Of course, private creditors should also participate in debt restructurings on terms at least as favourable as bilateral (i.e. country) creditors.\nThe UK has long championed increased funding, also known as international climate finance (ICF), to support developing countries to tackle and adapt to climate challenges. The last Government committed to spend £11.6 billion in ICF in the five years to 2025-26, targeting four priority areas: clean energy; nature for climate and people; adaptation and resilience; and sustainable cities, infrastructure and transport. I hope to see the new Government uphold this commitment.\nRegarding the conflict in Gaza, I welcome the deal which is currently on the table. The UK has long called for a deal such as this one, and I share the view of our diplomats that it is the best way to get the remaining hostages out, bring about a sustainable ceasefire leading to a permanent end to hostilities, and enable a significant scaling up of much-needed humanitarian aid. It is vital that all parties seize this opportunity and move towards a lasting peace which guarantees security and stability for both the Israeli and Palestinian people as swiftly as possible.\nThe last Government did everything it could to get aid into Gaza as quickly as possible by land, sea and air, including by trebling the UK’s aid commitment to the Occupied Palestinian Territories in the last financial year. I welcome the new Government’s commitment to increasing the amount of aid getting into Gaza and will be scrutinising the work of Ministers to ensure that this commitment is upheld.\nI am also deeply troubled by the situation in Sudan where both the Sudanese Armed Forces (SAF) and the paramilitary Rapid Support Forces (RSF) are still pursuing military victory amid accusations of violations of international human rights law, international humanitarian law and the laws governing the conduct of war including extremely concerning levels of conflict-related sexual violence.\nIt may reassure you to know the overall UK aid commitment for Sudan for 2024/25 is £89 million, thanks to a package announced earlier this year by the previous Government. I want to see an end to this appalling conflict, and to alleviating the plight of the Sudanese people. I will be closely monitoring the steps the Government takes towards supporting a peaceful outcome.\nPlease be assured that I will be following developments in all of the areas you have mentioned and will continue to support initiatives aimed at tackling extreme poverty worldwide.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_car-parking-charges-survey/content_58.html": "The Lib Dem-led Mid Sussex council delivered a crushing blow to the vibrancy of our towns and villages by imposing evening, Sunday and Bank Holidays charges.\nThe local Conservative Cllrs and I will ensure our communities views are heard on the unfair increase to East Grinstead parking charges voted through by Lib Dem, Green & Independent groups at Mid Sussex.\nConservatives unanimously opposed the changes of parking charges on Sundays, evenings & bank holidays.\nConservative councillors called for a multi-storey feasibility study for Queensway car park in East Grinstead this year and will continue to do so. They have my full backing. Please do take 5 minutes to share your views with me so I can raise this further.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-farming-update/content_45.html": "Thank you to those constituents who continue to share their concerns with me about the farming community and the importance of protecting our working farms.\nFamily farms and tenant farms are an intrinsic part of our national identity and I have always worked to actively support our farmers who are the backbone of the rural economy as well as stewards of the British countryside. As many of you are aware, I come from a family with a strong farming background myself and am proud to represent these hard-working men, women and families, especially in my constituency.\nI was, and remain, extremely concerned by the Government’s announcement in the Budget to make changes to Agricultural Property Relief (APR) and Business Property Relief (BPR) which is being referred to as the Family Farm Tax. Their intransigence on this matter beggars belief.\nMany people in this constituency have contacted me to share their deep dismay at this attack on the British farming community. I have also heard from many local farmers directly on the personal toll this is taking on their families so I was glad to join with them in solidarity in November and again in February, for the Farmers Rally in Westminster to urge the Government to listen, and at further events in Westminster.\nMims Davies MP joins Farmers in Parliament Square | Mims Davies\nI was also very pleased to vote on 4 December in support of the Official Opposition’s motion which called for an immediate reverse to this vindictive tax.\nThe Government announced in the Budget several measures which will negatively impact farming and rural communities such as speeding up the delinking of payments, introducing a fertiliser tax and changes to APR and BPR. The changes to APR and BPR will mean that from 6 April 2026, the full 100 per cent relief from inheritance tax will be restricted to the first £1 million of combined agricultural and business property. Above this amount, farmers will pay inheritance tax at 20 per cent.\nFarming organisations including the National Farmers Union, Countryside Alliance, Tenant Farmers Association and The Country Land and Business Association have all raised serious concerns about the harm this will cause to family farms and tenant farmers. The Central Association of Agricultural Valuers has also recently reported that up to 75,000 individual owners of farming businesses could expect to be affected over the coming generation, before considering the effect of inflation due to this change. That is the equivalent of five times the Government’s figure of 500 affected for the single year of 2026/27. They go on to say that,\n'even allowing for almost any plausible margin of error, it is reasonable for large numbers of farmers to expect to be adversely affected.'\nWe should be under no illusion these changes will see family farms split up and sold off. Families will lose their livelihoods and homes and there is no guarantee land sold will be used to grow food, risking food prices increases, more food being imported, and the countryside being concreted over. Indeed, in the Future of Farming debate, David Mundell MP (Conservative) pointed out,\n‘Given the value of land, it is being bought up by private equity firms and pension funds for use in industrial tree production or solar farms. Land is lost to food production as a result of such developments.’\nUnfortunately, the Labour Government is yet to listen to rural communities and change course. It was extremely disappointing that, when the Opposition forced a vote on the Family Farm Tax, not a single Labour Member of Parliament voted to support farmers or rural communities. Instead, they chose party politics and showed that they do not understand British farming or care about the countryside.\nI do not envy them having to go back to their constituents to explain yet another serious misjudgement.\nAlongside the Family Farm tax, attention was also given to the abrupt closure of the SFI scheme, food security, industrialised farming, the NI hikes, the double cab pick-up tax and concerns around Government plans to undercut property rights and force farmers to sell their land at below market value in the upcoming Planning and Infrastructure Bill.\nI have provided a link to the debate on the Future of Farming held on the 13th of March here: Farming - Hansard - UK Parliament\nSadly, I greatly agree with the words of my colleague Dr Caroline Johnson MP when she said,\n‘This is a debate on the future of farming. Many farmers in my constituency feel that, thanks to this Labour Government, they have no future in farming.’\nYou may also be interested in this round up:\nEconomic and planning policies: Impact on farming and rural communities - House of Lords Library",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-banter-bouncers/content_16.html": "I was very pleased to support the shadow Business team’s amendments at Report Stage on the 11th March 2025, relating to the third party harassment clause in the Employment Rights Bill.\nFirst of all, the Opposition laid an amendment to require the Secretary of State to conduct an impact analysis on Clause 18 and lay the findings before Parliament. The frontbench also laid amendments to exclude hospitality providers and sports venues from the duties imposed by the Clause because of the concern that the Employment Rights Bill will impose a \"banter ban\" in pubs and force landlords to police pub chat that risks offending employees. The Opposition has heard the concerns of the hospitality sector and has taken action, unfortunately it looks like the Government is not in listening mode.\nThe Employment Rights Bill is already causing considerable instability, uncertainty, and falling confidence, particularly amongst the 5.5m strong small business community. It will tie businesses up in red tape and means having to deal with a new regulator, the Fair Work Agency, which will have the power to enter any business premises, confiscate documents, levy fines and even creates new criminal offences with prison sentences of up to two years.\nThe Government claims that it has engaged in extensive consultations with businesses about these reforms, yet many business representatives have spoken out with serious reservations about this Bill. The Federation of Small Businesses has stated that the Bill will “inevitably deter small employers from taking on new people,” describing it as “rushed, clumsy, chaotic, and poorly planned.” Additionally, the Institute of Directors has reported that 57 per cent of its members would be less likely to hire staff, while the Confederation of British Industry has said that 54 per cent of businesses cannot afford the costs associated with this Bill.\nThe Government’s impact assessment suggests it could cost businesses up to £4.5 billion annually and could increase the number of strikes by 53 per cent. The public will pay the price – not just through uncollected waste, dysfunctional local government, and waves of low-threshold strike action - but also through higher taxes, lower wage growth and higher prices.\nThe Regulatory Policy Committee, the independent body tasked with scrutinising whether policy decisions are based on accurate fact, has found that eight of the twenty-three impact assessments for the Employment Rights Bill were \"not fit for purpose\". This raises very serious questions about how much worse for business this Bill might prove to be, especially given the fact that the Bill has already grown from 158 pages to 310 pages with several stages of the Bill left to go.\nTo be clear, HM Opposition is both pro-business and pro-worker. Whilst in office, the previous Government improved workers’ rights in several areas, including flexible working, parental leave, redundancy protections, ensuring that workers keep the tips left for them by their customers and significant increases to the National Living Wage.\nHowever, this legislation is being rushed through Parliament to meet a misguided promise from the Deputy Prime Minister to unions to introduce this legislation within one hundred days. I urge the Government to withdraw this Bill, consult properly, and work with HM Opposition to ensure that the economy and business, particularly SMEs, are not adversely impacted by these sweeping changes.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-catchup-parliament-and-events-locally/content_32.html": "Emile Heskey was in, who needs no introduction for football and Liverpool supporters. Emile was in discussing grassroot football and investments coming into Mid Sussex.\nMr Motivator also joined us for Mental Health Awareness Week discussing his work for supporting people's mental health\nJonny Wilkinson also joined us for Mental Health Awareness Week\nDHL also joined us up in the Lords, one of the largest aviation companies in the world including their parcel company based here in East Grinstead alongside my colleagues Henry Smith MP and Aviation Minister Anthony Browne\nKristy Adams for Mid Sussex and I spoke locally with mobile providers Vodafone discussing the not spots particularly in Cuckfield and Haywards Heath - new masts and change to follow\nJoined the brilliant Horsted Keynes May Fair\nThe Great Haywards Heath bike ride which I'll be starting off and thrilled Karen Pickering Olympic Swimmer will also be joining us.\nAnd of course, I'll be doing my Mid Sussex Radio show live there too starting bright and early!",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mps-statement-free-school-meals/content_33.html": "I fully appreciate a lot of people feel strongly about the issue of free school meals; many families across the country are struggling to get by and no child should have to go hungry. Equally, every child should have the opportunity to meet their potential regardless of their background or where they’re from. This includes access to regular, healthy and balanced meals throughout the day to ensure they are able to thrive in the classroom and, hopefully, encourage healthy and stable eating habits for life.\nBecause the previous Conservative Government widened eligibility, one in three children could get a free school meal in 2024, compared with one in six in 2010. That was even though 600,000 fewer children were growing up in workless households and that the proportion of people on low pay had halved. I hope the Government will commit to maintaining the current levels of eligibility.\nUnder the last Government, the Department for Education spent over £1 billion each year on free school meals, including through the Holiday Activities and Food (HAF) programme and school breakfast clubs. This included around £600 million on the Universal Infant Free School Meals (UIFSM) policy.\nIt is equally important, however, that policies meant to help children and families, such as free school meals, have the intended impact and reach those who need them most. Extending free school meals to all pupils, regardless of their family’s circumstances would mean money not being spent on the most disadvantaged pupils and instead going towards those who are already being provided with meals. We need better-targeted mechanisms to support children and families in the most need of help, instead of relying on indirect or substitute ones.\nAll infants (those in reception, year 1 and year 2) are eligible for free school meals. In 2014, we extended free school meal eligibility so that further education students can access them and in 2018, we introduced new eligibility criteria to support the transition to Universal Credit. These changes enabled us to help more children under the new system. We have also permanently extended eligibility for free school meals to children from families with No Recourse to Public Funds (subject to income thresholds).\nPractically, this means that 1.25m children in reception, years 1 and 2 receive Free Schools Meals, and 1.9m other pupils in all year groups because of household benefits. That’s around 37.5% of the total pupil population.\nI would like to see continued support for schools and children so that they are able to benefit from the national breakfast club programme which has created or improved breakfast clubs in up to 2,450 schools located in the most disadvantaged parts of the country. I am pleased that up to £38 million has been invested into the National School Breakfast Programme, using funds from Soft Drinks Industry Levy revenues supporting 280,000 children in some of the most deprived areas of England.\nAs your representative in Parliament, I will continue to hold the Government to account to ensure that adequate funding is provided to ensure every child within my constituency and across the country has regular, healthy meals.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-joins-ashdown-radio-newick-planning-water-issues-local-elections-and-more/content_34.html": "Mims Davies MP joins Ashdown Radio on Newick planning, water issues, local elections and more\nMims' full interview can be found here:\nhttps://www.ashdownradio.com/player/on-demand/items/mims-davies4\nMims Davies MP said:\nThank you to Ashdown Radio for having me again this morning.\nIt was a pleasure to join and discuss the very important issues here in East Grinstead, Uckfield, and the villages including local planning development, including the 250 new homes in Newick, local elections and campaigning, Ukraine, and more.\nI look forward to joining again in the future.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-energy-efficient-homes/content_55.html": "Thank you to those constituents who contacted me regarding the Government's Warm Homes Plan and asking me to attend the debate on the 12th of February. Unfortunately, I was not able to attend due to prior parliamentary commitments, however, I did study the debate transcript with interest and have provided a link to it here:\nFuel Poverty: England - Hansard - UK Parliament\nThe key priority of any government’s energy policy should be ensuring that people have access to secure, reliable, and affordable energy to stay safe and warm.\nThe previous Conservative Government made significant progress in improving the energy efficiency of homes. In 2010, only 14 per cent of homes were well insulated; today, that figure has risen to around 50 per cent.\nFor social housing, just 24 per cent were well insulated in 2010, compared to approximately 70 per cent now. Additionally, the Social Housing Decarbonisation Fund, established by the previous Government, provided 8,800 homes with free efficiency upgrades, saving households an average of £400 per year on energy bills.\nReducing energy costs remains the most important step to help people stay warm and secure. As my colleague, Nick Timothy MP, said in the debate,\n‘The challenge of fuel poverty affects people of all ages throughout the country. Rather than just creating new benefits and schemes to address the high cost of fuel, we need to resolve the root causes of energy costs more generally. Here, the Government are taking the country in a very worrying direction. The Energy Secretary promises to decarbonise the grid by 2030, and the Business Secretary wants to ban petrol and diesel cars by the same year. Tough standards on aviation fuel are being enforced; heat pumps are expected to replace gas boilers; expensive and intermittent renewable technologies funded by huge and hidden subsidies are favoured; and oil and gas fields in the North Sea are abandoned, left for the Norwegians to profit from what we choose to ignore.\nThe Energy Secretary has made much of the National Energy System Operator’s report on decarbonising the grid. He says that report shows that he can do so by 2030 without increasing bills, but in fact the report does not say that—and even then, its calculations rest on a carbon price that will rise to £147 per tonne of carbon dioxide. It is no wonder that, in reply to a question I asked him last week, the Energy Secretary would not rule out having a higher carbon price in Britain than in Europe. That will be terrible for families struggling with the cost of heating their home, but it will hurt them—and indeed all of us—in other ways.\nAs long as policy runs faster than technology and other countries do not follow our lead on climate change, decarbonisation will inevitably mean deindustrialisation. That will mean a weaker economy with lower growth, fewer jobs, and less spending power to help those who we have been discussing today—those who need support the most.’\nLike my colleagues, I am concerned that the current Labour Government’s target to decarbonise the entire electricity grid within just five short years is likely to drive up energy prices. Achieving this goal requires building more offshore wind capacity in the next two years than has been constructed in the past five and doubling grid and pylon infrastructure over the next five years compared to the past decade. The costs for these ambitions will inevitably be passed on to consumers through higher energy bills.\nIn addition, there are a number of households in East Grinstead and Uckfield who are not connected to the gas grid and who can pay over the odds for their heating. This is because, particularly in rural areas, certain types of house types are often much more difficult to heat due to much older building materials and a lack of insulation.\nI look forward to reviewing the details of the Labour Government's Warm Home Plan and hope it will build on the positive work of the previous Government, providing vital support to families who are less well-off, including those who live rurally, in heating their homes. However, it is clear ensuring energy efficiency and reducing costs should be a priority.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_21st-day-christmas-mims-davies-mp-presents-basepoint/content_25.html": "On the 21st Day of Christmas, Mims Davies MP presents - Basepoint\nBasepoint Haywards Heath, built in partnership with Mid Sussex District Council and West Sussex County Council, is a modern business centre, providing over 9,000 sq. ft. of space within 33 self-contained units available for rental on a short, fixed or long-term basis.\nThe facility also provides office, studio and workshop accommodation between 150 sq. ft. and 500 sq. ft, providing flexible serviced and managed offices, virtual offices and serviced meeting rooms, which aim to build small to medium size business communities.\nIf you are a new business and have grown beyond your kitchen or living room do look at the great local opportunities such as Basepoint and Freshmills to take the next step to growing your business!\nMims Davies MP said:\n\"Welcome to the 21st Day of Christmas!\nOn the 21st Day of Christmas, I am pleased to present - Basepoint.\nI was delighted to attend Basepoint’s ‘Starting and Growing your Business in Mid Sussex’ Event earlier this year.\nIt was fantastic to see the Economic Development Team from Mid Sussex District Council and Coast2Capital here as part of the open day which acted as a surgery for new and growing businesses to see how they can start & grow in Mid Sussex.\nWith the focus around all the help, advice and space available locally to showcase what a great place Mid Sussex is for businesses this was a great and informative event.\"",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-net-zero/content_39.html": "I want what supporters of Net Zero want: to leave the environment in a better state for the next generation. This is a commitment our party has had for decades now.\nThis important agenda has been enthusiastically pursued and, in recent times, somewhat hi-jacked, by political parties across the board for years but the reality should be dawning on everyone that achieving Net Zero by 2050 is impossible without devastating consequences for our economy and our energy security.\nDespite having abundant natural resources, we are still paying over the odds for electricity while becoming increasingly reliant on imports. This is the result of years of decisions that have prioritised targets over practical solutions. The Net Zero agenda, as currently pursued, has been poorly managed, set in law without a proper plan for delivery, with huge costs being passed on to households and businesses. We are now seeing the consequences in record energy bills, industries struggling under high costs, and a power grid that cannot guarantee reliability when we need it most.\nThe cost of energy in the UK is far too high, and this Labour Government’s Net Zero approach has only made things worse since coming into office.\nA balanced, considered and sensible energy policy must recognise that renewables are intermittent and unreliable, and that nuclear and gas still provide the firm, dispatchable power we need as part of the mix required. Yet instead of investing properly in nuclear, the Government has stalled progress, leaving the UK with a shrinking nuclear fleet. Similarly, its job-costing, ongoing hostility to North Sea oil and gas has risked thousands of jobs and is making us more dependent on foreign imports, often from countries with much lower environmental, human rights and working practice standards than our own.\nWe need an updated and serious plan that balances affordability, global and energy security, and sustainability. That means committing to new nuclear power stations, including getting on with building Small Modular Reactors rather than delaying further. It means removing unnecessary green levies and subsidies that drive up bills. It means making sure the grid is fit for purpose, rather than forcing unreliable generation onto a system that simply cannot cope. And it means recognising that climate policies must be achievable without damaging British industry or driving up the cost of living.\nPeople deserve an energy policy based on reality, not wishful thinking. That’s why, as part the Opposition's policy renewal, we are developing a credible alternative, one that will deliver cheap, secure, and sustainable energy without making people poorer in the process.\nIt is simply a fact that Net Zero by 2050 is impossible without bankrupting the country or leaving us utterly dependent on other countries for energy and critical minerals, probably both, so something has to change.\nThe challenge for the Opposition's energy policy commission is to work out how to run a responsible energy and economic policy, and move away from fossil fuel dependency. This is not the time to agree to arbitrary targets and pluck a date out of thin air; this is a time to plan.\nBelow, I have provided a link to the transcript for the Great British Energy debate. I want to draw attention to the Consideration of Lords Amendment 2. Dealing with the issue of modern slavery in the Renewables Industry and with cross-party support, it was still rejected by the Government.\nI believe this is a matter of huge importance in discussions around Net Zero and is, perhaps, an area overlooked by many in their current, single-minded focus to reach Net Zero targets at speed. Below are a few important extracts from the debate:\nSarah Champion Labour MP:\n‘Although I welcome this Bill, from the moment it started its journey through Parliament I have been issuing a warning. Without proper safeguards in place, our transition to net zero will be carried through on the backs of those in slavery.\nRenewable energy is vital for our transition to a low-carbon economy, but we know that human rights abuses are inherent in our green technology. There is evidence of child labour in cobalt mining in the Democratic Republic of the Congo, and of labour exploitation in nickel processing in Indonesia. Forced labour is committed at scale in Xinjiang in China, with the abuse of Uyghurs in steel production—a material that makes up nearly 80% of our wind turbines—and, of course, there is well-documented abuse in the production of solar panels.’\nAlex Sobel – Labour/Co-op MP:\n‘If GB Energy becomes reliant solely on solar panels from China, we will not just be complicit in human rights abuses but will create an enormous point of strategic vulnerability in our energy system. That would give the Chinese state a lever of influence over our critical infrastructure and undermine our sovereignty.\nProfessor Laura Murphy, who until January this year was senior policy adviser to the United States Department of Homeland Security on the Uyghur Forced Labor Prevention Act, and is perhaps the world’s leading expert on Xinjiang supply chains, stated:\n“From a human rights and climate perspective, the alternative of basing our green energy future on Xinjiang coal’s high carbon emissions and on the forced labour of oppressed communities is a higher and longer-term price to pay.”\nIf we allow GB Energy to contract with companies that profit from modern slavery, we directly undermine fair competition. No British worker can compete with a system that relies on forced labour. In our manifesto, we pledged secure, well-paid green jobs. My amendment seeks to ensure that British workers are not undercut by Chinese renewables companies that profit from modern slavery, and that GB Energy promotes not only the development of the UK’s renewable sector, but improved human rights conditions for all workers at each point in the supply chain.’\nAndrew Bowie MP -Opposition Shadow Minister for Energy for my party:\n‘Turning to today’s proceedings, far from the Secretary of State and the Minister’s insistence that Great British Energy will free us from reliance on foreign dictatorships, this headlong rush to clean power by 2030 will, in fact, make us more reliant than ever on the People’s Republic of China. He and his Ministers are quick to note the reluctance to rely on petrostate dictators. I wonder how he would characterise the People’s Republic of China, where political opposition is illegal, where citizens have more limited political rights than in the Russian Federation, where dissent is invariably punished and where the use of forced labour is proven…\nYet despite serious concerns about the national security implications, the ethical implications and the high climate emissions, the Secretary of State and Ministers are opening the gates to Chinese technology in our North Sea wind farms, to solar panels made with slave labour and to using coal power….\n…it was on this day in 1807 that the Abolition of the Slave Trade Act received Royal Assent, and 218 years on, Labour MPs are going to be whipped to allow the state to directly fund imports of goods built by slave labour in China…\n…it is right that we recognise now that the protections against the use of public money in supply chains with exposure to the use of modern slave labour need to be more robust. They are voting against this incredibly sensible amendment that seeks to protect some of the most oppressed people in the world, and to ensure that our net zero objectives, whatever one’s view of them, will not be built on the back of slave labour..\n…what we are seeing today is not simply the offshoring of our emissions, although we are, and it is not just about the offshoring of our energy security, although that is also true. Today we are seeing the offshoring of the Labour party’s moral compass, and we all know why: because clean power by 2030 demands it. The fact is that the Government will not achieve that target that they signed up to without the help of China and without importing this green revolution from coal-powered factories thousands of miles away. They are pursuing a made-in-China energy transition built on the back of slave labour and powered by Chinese coal.\nIt is quite ironic that the Minister is willing to stomach the higher carbon emissions associated with importing liquefied natural gas from abroad. The emissions are four times higher than those from drilling at home. The Government want to import solar panels manufactured using coal power and tainted by human rights abuses, rather than giving our domestic supply chains the time to grow. It is an irony that is not lost on us, and neither will it be lost on the country. This is, I am afraid, the pyrrhic victory of ideology over sense, and of zealotry over the national interest. It is bad for Britain, it is bad for bill payers and it really is quite bad for the climate.’\nYou can access the full transcript here: Great British Energy Bill - Hansard - UK Parliament and I hope this update is helpful.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-un-tax-convention/content_44.html": "I believe that international cooperation is important in tackling global tax challenges, and I urge Ministers to actively engage with the Organisation for Economic Co-operation and Development (OECD)'s and UN’s work on tax policy.\nIt is vital that international tax rules and standards are effective as well as inclusive. To this end, the previous Government supported consensus-based reform of the international tax rules through the OECD, including through the G20/OECD Inclusive Framework (with over 130 members) and the Global Forum (with over 160 members), in which non-OECD members participate on an equal footing. This reflects the strong expertise that sits within the OECD and the steps taken in recent years to become ever-more inclusive of the needs of developing countries.\nI welcome that the amount of unpaid UK tax (the tax gap) has fallen from 7.5 per cent in 2005/06 to 4.8 per cent in 2021/22. I am, however, concerned about the Government's commitment to further reducing the tax gap. In addition to offering piecemeal investment and an increase of compliance officers, the Government must set out comprehensive measures to crack down on non-compliance.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_about-rss/content_2.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-fur-trade/content_47.html": "My colleagues and I are committed to upholding high standards in animal welfare. While in government, we rightly set out our vision and crucial actions to introduce a range of world-leading reforms to improve the welfare and conservation of animals at home and abroad. More details are here:\nAction Plan for Animal Welfare - GOV.UK (www.gov.uk)\nRegarding fur farming, it has rightly been banned in the UK for 20 years and our legislation prohibits the keeping and breeding of animals solely or primarily for slaughter for the value of their fur. There are also additional strict restrictions on some skin and fur products that may never be legally imported into the UK. Those include fur and fur products from cats and dogs, whose import, export and placing on the market is prohibited.\nI do appreciate that there is considerable support for the complete banning of all imports of fur products - while fur cannot be farmed in the UK, it is still possible to import and sell other types of fur from abroad. However, I understand pleasingly the volume of fur that is imported and exported has fallen by 50% in the past five years.\nIn 2021, the Department for Environment, Food and Rural Affairs (Defra) published a call for evidence on the fur trade in Great Britain, which asked for views on animal welfare and on the social and economic impacts associated with the trade. Around 30,000 responses were received from businesses, representative bodies and individuals, demonstrating the strong public interest in this area.\nI know that officials from Defra have been analysing the responses received and have also engaged directly with stakeholders. I hope that Defra continues to build a solid evidence base on the fur sector, which will then be used to inform any future action on the fur trade. The Private Members’ Bill being brought forward by Ruth Jones MP, Fur (Import and Sale) Bill is scheduled to have its Second Reading take place on Friday 13 June 2025 and I look forward to assessing the detail of the Bill as it is presented in due course.\nI am also aware of the ongoing campaign to replace the real fur used in the bearskin King’s Guards' ceremonial caps with faux fur which I would like to address now.\nOur Guardsmen report they do take great pride in wearing the bearskin cap, as an iconic image of Britain, and the MOD is very sparing in the acquisitions that it makes. That said, I can assure you that the MOD would like to find a suitable alternative material to bearskin should one prove acceptable. This is a commitment the MOD takes very seriously and under Government was focussed on progressing this.\nIndeed, where sustainable, affordable and appropriate faux material exists, the MOD has moved forward and used it; the busby caps of the Royal Horse Artillery are a prime example. However, I believe those hats do not need to be worn with such regularity or all year round, indeed in reality they have to be worn all in the manner of very demanding conditions as the King’s Guards’ caps do.\nIndividual soldiers do not possess their own hats, rather they are cared for and shared within the Household Division and, despite their constant use, every effort is made to carefully prolong the longevity of each ceremonial cap I have been assured. On account of this, they usually last for more than a decade, with some having been in use for as long as 60 years.\nI understand that several tests conducted on potential faux fur products have shown that, while water penetration was reduced, it still did not meet the necessary standard, and performed poorly in the remaining basic requirements areas. In addition, the most recent test results, provided by PETA from an accredited testing house, have been analysed by the MOD. The analysis concluded that the fabric only met one of the five basic requirements.\nConsequently, the MOD have not, to date, seen evidence that a suitable faux fur product exists to be considered as an alternative. Until that material is sourced and proven, I can assure you that the UK goes to great lengths to ensure that the pelts that make the King's Guards' caps are procured in the most responsible way possible.\nTo be clear, I am reassured bears are never hunted to order for the MOD; the bear pelts used for the King’s Guards’ ceremonial caps are sourced exclusively from Canada and are a by-product of their programme to manage their wild bear population. Canada is a regulated market and a declared party to the convention on international trade in endangered species of wild fauna and flora.\nA Ministry of Defence, answer to written questions on King’s Guards: Uniforms on 25th January 2024 stated under the Conservative Government at the time:\n‘The MOD is open to considering the use of using human-made materials to replace natural fur items where they provide a suitable, affordable and sustainable alternative. As such we are prepared to assess accredited testing results of material to establish whether a synthetic alternative could meet the Department’s requirements for a replacement bearskin cap material.\nHowever, to date, and to the Department’s knowledge, an alternative has yet to meet the standards required to provide an effective replacement for the bearskin ceremonial caps.’\nFinally, I understand the Animal Welfare Committee has also been considering the issue of responsible sourcing in the fur industry, including the animal welfare standards and safeguards that apply to fur imported into this country.\nI will continue to follow this issue closely, and remain assured I will keep the new Labour Government progress under review and will write to the Minister asking for clarification on actions they are now taking.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_contact/content_12.html": "Skip to main content\nMain navigation\nHome\nAbout Mims\nNews\nLatest Newsletter\nNational Campaigns & Statements\nContact & Surgeries\nSign up to my Newsletter!\nSurveys\nContact\nLeave this field blank\nWestminster Office\nHouse of Commons, Westminster, London, SW1A 0AA\n0207 219 6853\n[email protected]\nWhen writing to me by letter or email please always include your full name and home address including postcode.\nPlease be aware I receive a large volume of correspondence, but will endeavour to respond as quickly as possible.\nFacebook\nTwitter\nInstagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-balneath-farm-south-chailey-owners-james-and-kirstie/content_3.html": "Mims Davies MP was pleased to be able to join James and Kirstie, owners of Balneath Farm, South Chailey.\nTheir family lives and works in our constituency of East Grinstead, Uckfield, and the villages as farmers and it's no secret the struggles there are a significant amount of current news stories covering the agricultural industry.\nInstead, we are reaching out to discuss the current success of our own agricultural business.\nBalneath Farm is an incredible, successful agricultural enterprise spanning 3,000 acres mostly based in EGU.\nThey have approximately 2,000 sheep, 800 cows and 500 acres of crops as well, as well as large areas of land committed to biodiversity and conservation.\nAs a family, and a business, they have their sights firmly set on the future and their passion is farming, and in order to continue, profit is of course key for them as they strive to improve their productive capacity and efficiency over the same acreage.\nThey have recently committed to constructing a brand new calf rearing facility, with the most up to date technology, facilities and animal welfare standards.\nYou can read Mims' latest statement on Family Farms here:\nhttps://www.mimsdavies.org.uk/news/mims-davies-mp-statement-family-farms\nMims Davies MP said:\nWhat a way to start the weekend in Chailey at Balneath Farm.\nA big thank you to James and Kirstie for meeting me today on their beautiful family farm - I even had the chance to feed their lovely cows!\nThey have roughly 2000 sheep, 800 cows, 500 acres of crop and a large area of land committed to biodiversity and conservation.\nI am a huge supporter of our local farmers who work so hard 24/7 365 to keep food on our plates. As we know, family farmers really need our support now more than ever and we need to remind the government of this.\nThis fantastic weather we’re having was also a bonus.\nLooking forward to the weekend and meeting even more business owners and residents - I hope everyone has a great weekend too!",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mps-statement-israel-and-gaza/content_26.html": "I remain committed to the pursuit of peace and stability in the Middle East. We ultimately want to be able to lift people’s eyes to a brighter future and sustainable, regional peace.\nThe events which have unfolded in the Middle East since 7 October 2023 have been truly appalling to witness. Israel suffered the worst terror attack in its history at the hands of Hamas. Civilians were brutally murdered and hundreds taken hostage and held in appalling conditions, unable to communicate with their families and without access to medicine and food. Like everyone else, I was horrified to see the emaciated condition of the recently released hostages as they were exhibited by masked, armed Hamas soldiers and very disturbed by accounts of the physical and psychological torture they endured.\nAs a direct consequence of the actions of Hamas on 7 October 2023 and their use of civilian infrastructure to undertake terrorist operations, Palestinian civilians have faced a devastating humanitarian crisis in Gaza. My thoughts are with both the families of those still held hostage, the remaining hostages held by Hamas and every innocent life, on both sides, which has been lost or impacted by this horrific conflict. I unequivocally support Israel’s right to defend itself against Hamas and indeed from all attacks by Iran’s proxy militias like Hezbollah or the Houthis. The attacks from Iran itself in recent months are a stark reminder of the existential threat Israel faces in the Middle East from those who choose violence and terrorism to achieve their goal of creating a new fundamentalist Islamic regional order. For this reason, both Hamas and Hezbollah are on the UK terrorist list and co-ordinated sanctions have been imposed on the Houthis.\nHowever, it is without question that too many have died in this terrible war. While international pressure, quite rightly, continues to be put on Israel to minimise civilian deaths, I welcome the admission by the Foreign Secretary, David Lammy, in his statement to the House that, “there can be no doubt that Hamas pays not the slightest heed to international humanitarian law and endangers civilians by embedding itself in the tightly concentrated civilian population and in civilian infrastructure.” The situation across Gaza remains truly desperate; it is important that international humanitarian law be respected and civilians protected, that Israel makes sure that humanitarian aid including food, water and shelter gets into Gaza and its distribution is not impeded. This must also be the case for northern Gaza.\nThe UK, under the previous Conservative Government, rightly did everything it could to get aid into Gaza as quickly as possible by land, sea and air, including by: trebling the UK’s aid commitment to the Occupied Palestinian Territories in the last financial year, establishing a field hospital in Gaza, participating in numerous airdrops of aid, and providing a package of support to help set up a maritime aid corridor to Gaza. It is vital that the UK continues to provide much-needed humanitarian support to alleviate the suffering of civilians in Gaza and continues to press Israel to take concrete steps to meet its commitment to increase the amount of aid getting to Gaza.\nI want, like everyone who has written to me, to see the Gaza conflict brought to a sustainable end as quickly as possible. The last Conservative Government advocated for negotiated pauses in the fighting, as they offer the potential to get hostages who remain in such cruel captivity out of Gaza, and much-needed humanitarian aid into Gaza. As we have thankfully seen, progress can be made to bring this conflict to an end if Hamas releases the hostages that it is holding. I therefore welcome the ceasefire that has been agreed, with hostages being released and more aid entering Gaza. When asked about current aid deliveries into Gaza, a UN humanitarian office (OCHA) spokesperson confirmed “We have been able to scale up humanitarian operations significantly with food, medical and shelter supplies and other aid during the ceasefire period.”\nTurning to the Government’s suspension of 30 arms export licences to Israel; announcing this decision on the day that Israel was burying murdered hostages, and within weeks of British military personnel and arms defending Israel from an Iranian attack, was difficult to swallow. Decisions like this also have important broader geopolitical implications, and we must be clear that there is no moral equivalence between Hamas and the democratically elected Government of Israel. Moreover, with Iran being responsible for funding and supporting terrorism and instability in the region, and their attacks on Israel, it is important that we do not weaken the ability of Israel to defend itself from these threats to their safety and to the interests of the West. However, I welcomed the prime minister reiterating Britain’s support for Israel and its right to self-defence in the House of Commons. I have provided a link to the statement here: UK policy on arms export licences to Israel: Foreign Secretary's statement - GOV.UK (www.gov.uk).\nI will be following developments closely.\nI welcome that the new Government is continuing the work of the previous Conservative Government last by supporting humanitarian agencies including UNRWA, UNICEF and UK Med to provide essential healthcare to civilians in Gaza. This included activities to improve water, sanitation and hygiene, which is vital in preventing the spread of diseases. I especially welcomed the series of three-day “humanitarian pauses” in central, southern, and northern Gaza, which allowed the vital polio vaccination campaign to proceed.\nI am aware of concerns about Israel's decision to pass legislation which, as of 30 January, revokes the privileges and immunities of UNRWA, forbids any contact between Israeli state entities, officials and UNRWA, and prohibits any UNRWA presence within Israel. This is highly significant because while most of UNRWA's projects take place in Gaza and the occupied West Bank, it relies on agreements with Israel to operate. Israel’s Prime Minister, Benjamin Netanyahu, has said UNRWA staff with links to Hamas must be held accountable and that Israel will work with international partners on next steps. Israel has also said it will work with other UN agencies, such as the World Food Programme, to deliver humanitarian aid. It has previously proposed that UNRWA needs to be replaced in a post-conflict Gaza. The UK has urged Israel to ensure that UNRWA can continue its operations and provision of essential services across the Occupied Palestinian Territories.\nWhile no one can doubt the size of UNRWA's distribution network, the organisation must work to rebuild the trust and confidence that has understandably been lost following the deeply troubling allegations that staff were involved in Hamas's appalling 7 October 2023 attacks and reports of Hamas using UNRWA facilities. As the Shadow Foreign Secretary has said, we cannot ignore the problems within UNRWA and it is in no one’s interests to pretend that they have not happened.\nI supported the previous UK Government’s decision to pause future funding for UNRWA when these serious allegations came to light. The last Conservative Government was clear with UNRWA that business as usual would not resume until allegations were dealt with and significant changes put in place as the integrity of this organisation had been deeply compromised by the events of October 7. As you will know, the current Government decided to overturn this suspension and has since provided UNRWA with £34 million. The Opposition has consistently raised concerns in Parliament about the Government's decision and will continue to call on the Government to prove that UK funding provided to UNRWA is reaching those most in need and not being abused by Hamas.\nPriti Patel MP, Shadow Foreign Secretary, said, “Ministers have now committed more taxpayers’ money to UNWRA but they need to prove to us that the £21m of funding they released in the summer reached those most in need. There are deeply worrying reports that criminal gangs are ambushing aid in Gaza. It would be unacceptable for British aid to be abused, used by terrorists, or if it failed to reach the most in need civilians.”\nI understand that the UN has now fired an additional nine UNRWA staff members - following the 12 fired previously. I believe that it is right that the UN has dismissed these individuals - it is critical that UN bodies ensure proper vetting of personnel and activities moving forward and that all links to the Hamas terrorist group be severed. We will hold the current Labour Government to account in making sure UNRWA fully implements all the recommendations made in the Colonna report so that this situation, where members of a UN humanitarian organisation are complicit in terrorism, can never arise again.\nI would also like to address the arrest warrant the International Criminal Court (ICC) has issued for Israel’s Prime Minister Benjamin Netanyahu and its former-Minister Yoav Gallant. Firstly, Israel is not a party to the Rome statute - the treaty that established the ICC and set the Court’s jurisdiction - and Palestine is not a recognised state. I, therefore, believe that the warrants issued for Mr. Netanyahu and Mr. Gallant have no basis in international law. In addition, I am deeply concerned by reports of process errors in the ICC’s investigation into Mr. Netanyahu and Mr. Gallant, and about the use by the prosecutor of an expert panel. I will continue to push the UK Government for greater clarity on these important matters.\nIt is my firm belief that the ICC’s decision to issue arrest warrants for Mr. Netanyahu and Mr. Gallant has done nothing to help secure the release of the poor Israeli hostages who have been held captive by Hamas for more than a year, nor will it help to get more aid into Gaza, or to deliver a sustainable end to this awful conflict. I fear that the only beneficiaries of this decision are Hamas and their terrorist sponsors, Iran, who have celebrated this propaganda coup as a great victory for Hamas and Hezbollah. By charging Israeli leaders alongside Hamas, the ICC appears to be drawing a moral equivalence between Israel’s war of self-defence and Hamas’ terrorism. I utterly reject any moral equivalence.\nI am also deeply concerned by the UK Government’s dithering response to the ICC’s warrant issue. Ministers have repeatedly failed to provide clarity, while spouting confused messaging. At this time, when the situation in Gaza remains fragile and sensitive, it is important that the Government provides clarity on its approach. My colleagues have challenged the Government over this in the House of Commons and will continue to press them over this and call for an intensification of diplomatic efforts to support the ceasefire, ensure the release of hostages, the provision of more aid into Gaza and a lasting and sustainable end to this conflict.\nIn the longer term, I continue to support a credible and irreversible pathway towards a two-state solution where a safe and secure Israel can live alongside a viable and sovereign Palestine, with peace and prosperity for both nations and the wider region. However, I strongly believe the UK should only recognise a Palestinian state at a time when it best serves the objective of peace. We must avoid premature declarations which would serve to vindicate the use of violence and terrorism as legitimate methods to achieve political goals. I will continue to encourage this Labour Government to act in accordance with this principle.\nThe current ceasefire agreement between Israel and Hamas marks an important moment for the Middle East; while it remains a fragile situation, I sincerely hope the ceasefire will usher in a sustainable end to the conflict and the UK Government must do everything in its power, working with our international partners, to support the ceasefire, the release of all hostages, the provision of aid, and press for a lasting and sustainable end to this conflict It is vital that all parties seize this opportunity to move towards a lasting peace which guarantees security and stability for both the Israeli and Palestinian people as swiftly as possible. I hope and pray they do.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk/content_1.html": "Mims Davies MP pleased to meet with Local Businesses in Uckfield discussing recent challenges 4th May 2025 Read full article Mims Davies MP at Balneath Farm, South Chailey, with owners James and Kirstie 3rd May 2025 Read full article Am I your MP? Enter your postcode Postcode Mims Davies MP questions Welsh Curriculum on promoting choking in relationships 2nd May 2025 Read full article Constituency Map\nMims Davies MP pleased to meet with Local Businesses in Uckfield discussing recent challenges 4th May 2025 Read full article\nMims Davies MP at Balneath Farm, South Chailey, with owners James and Kirstie 3rd May 2025 Read full article\nMims Davies MP questions Welsh Curriculum on promoting choking in relationships 2nd May 2025 Read full article",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-commits-speaking-ms-community-uk-parliament/content_36.html": "Mims Davies MP commits to speaking up for MS community in UK Parliament\nMS Awareness Week is the 28th April - 4th May and Mims Davies MP for East Grinstead, Uckfield, and the villages, attended a Parliamentary event hosted by the MS Society, to learn about issues facing the multiple sclerosis (MS) community.\nThe event – which followed the government’s recently announced plans to change disability benefits – saw MPs from across the political spectrum meet with people affected by MS. They were also joined by familiar faces including comedian Ivo Graham, legendary R&B artist Junior Giscombe and former Lioness captain Mary Phillip.\nOver 150,000 people live with MS in the UK, including 20,130 in the South East and around 4,000 in EGU.\nThe condition affects the brain and spinal cord, impacting how people move, think and feel. Symptoms are different for everybody and often invisible. But once diagnosed, MS stays with you for life, and over time your symptoms can worsen.\nMany people with MS rely on disability benefits like Personal Independence Payment (PIP) to help manage the extra costs of their condition. For example, paying for visits from carers to help with things like washing, cooking and going to the toilet. This means the government’s proposed changes to disability benefits, including plans tighten the PIP eligibility criteria, could have a significant impact on people with MS.\nMims Davies MP said:\nIt's important to talk to people with MS about the challenges they're facing, from support in work, accessing benefits to receiving treatment and care on the NHS. As a former Minister in DWP and the former Minister for Disability, this is really important to me.\nThis echoed the theme of this year's MS Awareness Week which is encouraging people to have #MSConversations.\nWorking in collaboration with the charity, I look forward to drawing attention to the challenges that people with MS face and calling for change.\nI will be wearing my MS society pin badge this week showing support.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-proposed-chinese-embassy/content_28.html": "I am deeply concerned about plans for the former Royal Mint Site, in the heart of our nation’s capital, to be converted into not just China’s largest diplomatic mission in Europe but the largest embassy of any nation in Europe. Even more concerning is the current Labour Government’s consistent and determined support for the embassy, something the Prime Minister, Deputy Prime Minister and Foreign Secretary have personally intervened to support.\nAs the emails I have received on this matter have pointed out, the proposed site is directly alongside sites of national importance, presenting a potential threat of foreign interference, including key fibre-optic cables vital to Britain’s internet network and London’s communication lines. It is concerning that immediately following the General Election last year, the Chinese Government reapplied for planning permission for the site despite plans having been previously and firmly rejected by Tower Hamlets Council, the Mayor of London and the last Conservative Government. It is also very concerning to hear of first-hand reports of disproportionately low offers to residents living, near or on the proposed site, to sell their homes.\nThe current Labour Prime Minister, Deputy Prime Minister, Foreign Secretary and Home Secretary have all prepared to wave through this application, despite serious warnings from the Met Police and our national security services about the site, and in complete contravention of the clear and well-expressed opinions of local people.\nI understand that the Planning Inspectors Inquiry on the matter has now concluded and Ministers will be making a decision in the coming weeks. It is essential that Ministers see sense and takes time to properly consider the serious national security concerns staring them right in the face.\nMore widely, it is my view that China poses a systemic challenge to the UK's values and interests. We cannot turn a blind eye to the endless hostile incursions of the Chinese Communist Party (CCP) and it is absolutely crucial that the Government keeps its approach to China under review.\nI am concerned that the Prime Minister’s attempts to befriend China could put the UK at risk. To echo the words of the Shadow Foreign Secretary, the Prime Minister needs to be honest about what he intends to compromise in his pursuit to make friends with China. I will continue to monitor the Government’s approach and press Ministers to focus on strengthening our national security in those areas where the actions of the CCP pose a threat.\nWith regards to human rights and fundamental freedoms, the Government should make clear that China must act in line with its obligations under international and national law. The UK should not shy away from making clear to China where deep concerns exist about its conduct, such as on human rights violations in Tibet and against the Uyghur Muslims and other minorities in Xinjiang.\nOf course, we cannot simply ignore China’s significance in world affairs. It is precisely because of China’s role in the world as a fellow member of the G20 and fellow permanent member of the UN Security Council, that we all expect China to live up to the international obligations and responsibilities that come with that stature.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-immigration-data/content_29.html": "It is indisputable the immigration numbers we have seen over the past few years have been far too high, and we should be looking to substantially reduce them. Therefore, I fully agree with the need to publish information about our immigration system transparently.\nIt is absolutely critical that we have access to a wide array of information to inform the policy decisions the Government makes regarding migration. That is why the Leader of the Opposition has expressed her support for a transparent approach to migration, including the publication of all available data. She also rightly emphasised that it is not just about releasing data but about improving the data and economic modelling that decision-makers rely on.\nPeople deeply care about immigration; an expanded range of data and information could help the UK to understand the issues facing our country and how best to address them. The last Government took steps to improve this transparency, providing regular updates on small boat crossings to ensure up-to-date data on this evolving issue was presented to the British public.\nKemi Badenoch has also made it clear in a speech on immigration that our future migration policy will have, at its core, a zero-tolerance approach to foreign criminals remaining in the UK. I hope this reassures you that, while I understand the need for data, we can go further and ensure our future migration system adopts a zero-tolerance approach.\nI fully support the use of data in our policy processes, and the more transparent the Government can be about this important issue, the better. Reducing immigration, both legal and illegal, requires concrete and realistic action, including steps to tighten visa rules and implement effective deterrents against illegal activities. The choice in tackling immigration lies between these approaches, rather than adopting superficial solutions unlikely to bring meaningful change to our system.\nI would note that in certain cases, there may be significant expenses or practical challenges associated with collecting and presenting data. In these cases, I would encourage the Government to take a sensible approach.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_category_Local-News/content_5.html": "Mims Davies MP pleased to meet with Local Businesses in Uckfield discussing recent challenges 4th May 2025 Mims Davies MP pleased to meet with Local Businesses in Uckfield discussing recent challenges Mims was pleased to be in Uckfield on Friday meeting with Partners... Local News\nMims Davies MP at Balneath Farm, South Chailey, with owners James and Kirstie 3rd May 2025 Mims Davies MP was pleased to be able to join James and Kirstie, owners of Balneath Farm, South Chailey. Their family lives and works in our constituency of... Local News\nMy Weekly Column for the Mid Sussex Times 1st May 2025 What a brilliant Greater Haywards Heath Bike Ride once again which travels across our wonderful area and across much of my constituency. Being at start is... Local News\nMims Davies MP joins Ashdown Radio on Newick planning, water issues, local elections and more 28th April 2025 Mims Davies MP joins Ashdown Radio on Newick planning, water issues, local elections and more Mims' full interview can be found here: https://www.ashdownradio... Local News\nMy Weekly Column for the Mid Sussex Times 26th April 2025 Wishing everyone a very Happy Easter! You may be aware we were in Parliamentary Recess and I’ve certainly made the most of it meeting lots of businesses... Local News\nMims Davies MP discusses nature-friendly farming at the Countryside Regeneration Trust’s Twyford Farm 24th April 2025 Mims Davies MP discusses nature-friendly farming at the Countryside Regeneration Trust’s Twyford Farm Mims Davies MP praised the amazing work of the Countryside... Local News\nMims Davies MP on BBC Politics South East speaking up for businesses 22nd April 2025 Mims Davies MP on BBC Politics South East speaking on businesses At the beginning of the month, Mims vowed to stand by the 900 businesses in East Grinstead... Local News\nMims Davies MP at Tulleys Farm Tulip Fest with Cllr Gary Marsh 20th April 2025 Mims Davies MP at Tulleys Farm Tulip Fest with Cllr Gary Marsh Mims was thrilled to be at Tulleys Farm's stunning Tulip Fest alongside local Councillor Gary... Local News\nMy Weekly Column for the Mid Sussex Times 19th April 2025 It was lovely and sunny at Chequer Mead when I recently met with Dean and Sarah. However, the brightness at the theatre dimmed when I heard about the impact of... Local News",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_22nd-day-christmas-mims-davies-mp-presents-servo-wealth/content_15.html": "On the 22nd Day of Christmas, Mims Davies MP presents - Servo Wealth\nServo Private wealth work with wealthy families, high net worth individuals, business owners and entrepreneurs as well as companies and charities to grow and protect the value of their, and their client’s wealth over the long term.\nTheir aim is to make the complex world of financial services clear, simple and tailored to their clients.\nTheir clients are typically self-made, successful individuals who are either building towards financial independence, or who are already financially independent of their work and are seeking to ensure their money lasts at least as long as they do. Working closely with their clients to enable them to achieve this whilst also continuing to enjoy and make the most of their current lifestyles.\nAlmost all of their clients, regardless of how or why they reach out to Servo Wealth, share one thing in common; they rely on their own wealth and resources to maintain their (and often their families’) lifestyles and financial security for the rest of their, and their families’ lives.\nMims Davies MP said:\n\"Welcome to the 22nd Day of Christmas!\nOn the 22nd Day of Christmas, I am pleased to present - Servo Wealth.\nIt was a pleasure to meet James Mallinson and his team at Servo Wealth earlier this year in their new offices in Haywards Heath.\nIt was great to understand his business further and to hear of his journey from starting his own company, to how they have grown since then. We discussed how he has taken on new personnel from other sectors and invested in their training. One employee previously enjoyed a prominent sports background and has worked incredibly hard to become an advisor within 18 months. A brilliant achievement.\nSo often, companies look to employ ‘sector ready’ personnel for recruitment when spotting potential, and training up and investing in a new employee can achieve so much for both the individual and the business.\"",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_cookies/content_27.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-fraud-error-debt-bill/content_46.html": "It is important to note that total benefit expenditure increased from £233.8 billion in 2022/23 to £266.2 billion in 2023/24, which amounts to a 13.9 per cent increase. Overpayments alone are calculated at £9.7 billion (3.7 per cent) in the last financial year.\nAmid this backdrop, I entirely agree that more action is needed to tackle fraud and error in the Welfare System and diligently defend taxpayers’ money. Public support for our welfare system is contingent on there being confidence that taxpayers’ money goes to those who need it, rather than into the hands of criminals.\nTo that end, the Labour Government looked at how to better investigate suspected fraud through new search, debt recovery and data powers. I welcome that the Government clearly appreciates the proposals of the last Government by imitating much of the plan that the Department for Work and Pensions (DWP) had under the last Government’s ‘Fighting Fraud in the Welfare System’ plan and Digital Protection and Digital Information Bill.\nA brand-new measure will see the time limit for civil claims against Covid fraud doubled from six to twelve years. This change in the ability to fight fraud committed during the pandemic will give the Covid Corruption Commissioner and the Public Sector Fraud Authority more time to investigate complex cases and apply their new powers retrospectively - including the ability to raid properties and retrieve money from Covid fraudsters’ bank accounts.\nHowever, it is vital that DWP is always careful to process data lawfully, proportionately, and ethically, with meaningful human input and safeguards for the protection of individuals. It is also important that it adheres to the Data Protection Principles, including the Purpose Limitation principle, which means that the DWP must ensure that data collected in accordance with this power is used for the purpose for which it was collected and incidental matters.\nIn October 2024, the Secretary of State for Work & Pensions announced that the Fraud, Error and Debt Bill would be making its way through Parliament. The Bill aims to protect vulnerable individuals alongside clamping down on fraudulent practices within the welfare system.\nI note some have concerns about privacy, which I absolutely share. As this Bill progresses, I will be pushing for the Government to make sure that proper safeguarding processes are in place to protect the most vulnerable. We must also make sure, whenever new powers are passed on, that there is proper scrutiny of how they are exercised so the impact can be monitored.\nWe do, however, have a duty to taxpayers to ensure that taxpayers' money is spent efficiently and that the welfare programmes we invest in truly improve livelihoods. If the Government commits further to safeguarding and stays true to the principle of reducing waste, we have an opportunity to make the welfare system work best for those who need it most. It should also be said we need to ensure there is sufficient money to fund vital public services which is why we need to cut out fraud.\nI understand that the Government has said that DWP will not have access to people’s bank accounts and will not share their personal information with third parties. I will be sure to closely scrutinise the contents of the Bill in the best interest of my constituents.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_category_Westminster-News/content_13.html": "Mims Davies MP questions Welsh Curriculum on promoting choking in relationships 2nd May 2025 Mims Davies MP questions Welsh Curriculum in the Chamber on promoting choking in relationships Mims Davies MP was in the Chamber in Westminster for multiple... Westminster News\nMims Davies MP in Westminster discussing Dame Vera Lynn Memorial Statue with Susan Fleet MBE ahead of VE Day 29th April 2025 Mims Davies MP in Westminster discussing Dame Vera Lynn Memorial Statue with Susan Fleet MBE ahead of VE Day Mims was thrilled to meet in Westminster with Susan... Westminster News\nMims Davies MP commits to speaking up for MS community in UK Parliament 27th April 2025 Mims Davies MP commits to speaking up for MS community in UK Parliament MS Awareness Week is the 28th April - 4th May and Mims Davies MP for East Grinstead... Westminster News\nMims Davies MP update from Westminster during first week back after Recess 25th April 2025 Mims Davies MP update from Westminster during first week back after Recess With Recess drawn to a close, Mims and her colleagues were back in Westminster this... Westminster News\nMims Davies MP Statement on 'Banter Bouncers' 21st April 2025 I was very pleased to support the shadow Business team’s amendments at Report Stage on the 11th March 2025, relating to the third party harassment clause in the... Westminster News\nMims Davies MP Statement on the Proposed Chinese Embassy 18th April 2025 I am deeply concerned about plans for the former Royal Mint Site, in the heart of our nation’s capital, to be converted into not just China’s largest diplomatic... Westminster News\nMims Davies MP Statement on the Planning & Infrastructure Bill 14th April 2025 The cry to go ‘further and faster’ was heard again in the Planning and Infrastructure Bill debate on the 24th of March this year where Angela Rayner scorned the... Westminster News\nMims Davies MP supports Bill to save British Steel as Parliament is recalled 12th April 2025 Mims Davies MP supports Bill to save British Steel as Parliament is recalled Mims and her colleagues weren't due to be back in Parliament until the 22nd April... Westminster News\nMims Davies MP Statement on Trade 11th April 2025 Let me be clear; I do not accept the premise that the Government has to choose between a close trading relationship with the EU and negotiating a new free trade... Westminster News",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-renters-rights-bill/content_35.html": "Like most people, I want to see a thriving private rented sector that works for landlords and tenants alike. I also want to see renting made more secure and affordable. However, any new regulations must be necessary and proportionate as over-regulation risks pushing good landlords out of the sector and empowering those who simply ignore the rules.\nI am concerned that the approach set out in the Government’s Renters’ Rights Bill will have the opposite effect.\nWith regard to Section 21 ‘no fault’ evictions, while I absolutely support the principle of giving tenants more security, the Government’s tenancy reforms could overwhelm the courts, cause gridlock in the justice system, and create even more problems for tenants.\nThis is something the Housing Select Committee warned the last Government about, highlighting that an unreformed court system could undermine tenancy reforms. It is therefore important that the new Government ensures the courts can process possession claims efficiently. Ministers must be upfront about the impact of these reforms, and it is worrying that the Government has again failed to publish an impact assessment alongside the Bill.\nMy main worry is that the Government’s proposals could cut supply in the private rented sector which risks driving up rents and making it harder for people to find a suitable home to rent. This is exactly what we have seen in Scotland where similar measures were implemented in 2017. The number of private rented properties in Scotland has decreased by 13 per cent, the number of private landlords has reduced by 11 per cent, and the number of homes available to let to tenants has reduced by 17 per cent. These are statistics that I do not want to see replicated.\nI have also carefully considered Shelter’s campaign on the Renters’ Rights Bill and, while I recognise that rent controls may sound attractive, in practice they can have a negative impact on the sector. Evidence from Britain and around the world shows that rent controls can discourage investment in the private rented sector and lead to declining property standards as a result. There are also examples that rent controls may encourage more illegal subletting and can have an inadvertent negative impact on the supply of housing.\nI do not believe any of this would be in the interest of renters and so, while I do not feel able to support this specific proposal, I assure you that I will continue to closely follow and scrutinise the Bill as it progresses through Parliament.\nLike you, I want to see tenancies sustained as far as possible and I believe the Government should do everything it can to support long-lasting tenancies wherever possible. I do, however, think preventing landlords from using possession grounds for a period of two years could stop them from regaining their property when they have a genuine reason to do so.\nWith regard to practices such as guarantors and upfront rent, I believe it is important that landlords retain the ability to ensure a sustainable tenancy for both parties. However, I do not think asking for a large amount of rent in advance should be the norm.\nAs a fellow pet owner, I wholeheartedly agree pets can make excellent companions and are an important part of the lives of millions of people. As part of the Renters' Rights Bill, the Government is proposing to give tenants the right to request a pet, which landlords must consider and cannot unreasonably refuse.\nLandlords can benefit from making their properties open to tenants with pets, where appropriate as it can increase demand, lead to longer tenancies and attract more responsible owners.\nHowever, it is worth bearing in mind that not all properties are suitable for pets. Landlords have the right to protect their properties from damage and are required to comply with health and safety standards, meaning they may not allow pets in all cases. It is also reasonable the Government ensures landlords can ask that tenants take out pet insurance to cover any damage to the property.\nWhat is crucial is that landlords and tenants are provided with clear guidance on the Government's reforms, and I will press Ministers to publish guidance in good time before these rules come into force. While I do not agree with the approach taken by the Government, I am committed to working constructively in Parliament to address these concerns and those of my constituents.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-assisted-dying-further-update/content_38.html": "As you will recall, MPs voted in favour of the Terminally Ill Adults (End of Life) Bill at its Second Reading, following which the Bill was scrutinised by a Public Bill Committee. Kim Leadbetter MP, the Bill’s sponsor, chose the 23 members of the Public Bill Committee that have gone through the Bill line by line.\nThe Public Bill Committee has now completed its work and has reported the Bill with amendments to the House. The Terminally Ill Adults (End of Life) Bill is now due to have its report stage and Third Reading in May. Amendments can be made to the Bill at Report Stage and the amendments to be considered are selected by the Speaker.\nAt this stage, all MPs—not just the ones on the Committee—can suggest changes. These changes will be debated, and MPs will vote on whether to accept them. After the Report Stage, MPs will have a final chance to debate and vote on the whole Bill, including any changes that have been made – this is called the Third Reading.\nIf MPs vote against the Bill at the Third Reading, this will stop the Bill altogether. If they vote to pass the Bill, a new amendment put forward by Kim Leadbeater, under pressure from the Labour Government, changes the maximum implementation period from two years to four years.\nIn my view, the Public Bill Committee has illustrated why this legislation is, in reality, so unworkable. Not only has the Bill sponsor been forced to delay the implementation of assisted dying powers until at least 2029, this process has also removed a key safeguard in terms of the High Court judge and grant the Senedd (or Welsh Parliament) the powers to block assisted dying in Wales. Crucially, the Bill still contains no detail on how services will be delivered, regulated or held to account.\nMany constituents have written to me to voice their profound concern that the safeguard of the High Court judge has been removed from the Bill. This is a concern I also share. In addition to two doctors, the original Bill said that a High Court judge would have to check each person’s eligibility for an assisted death before granting that right. This included whether they were of sound mind and had not been coerced into ending their life. It was a key pillar of the Bill’s ‘thorough and robust’ safeguards.\nHowever, the Bill has now been amended to replace the oversight of a judge with that of a panel of experts - made up of a psychiatrist, a lawyer and a social worker. The decision to remove the involvement of the High Court judge comes as no surprise to me. Given the backlogs in the courts, this was never a serious proposal but convinced many wavering MPs to support the Bill at Second Reading.\nIncredibly, it is reported Ms Leadbetter failed to consult the Royal College of Psychiatrists (RCP) before giving them a central role in the panels. The president of the RCP would have told the Bill Committee, it is understood, that there are many challenges with this proposal, including workforce shortages.\nWhile it is convention that the make-up of these committees reflects the view of the House of Commons at a bill’s Second Reading, I also share real concerns the Committee was deeply unbalanced in favour of those who support changing the law – with 14 supporters of the Bill and 9 opponents - and that this has clearly contributed to the removal of safeguards in the Bill and the rejection of many proposed safeguards.\nAs is usual, members of the committee have laid various amendments to the Bill in their bid to strengthen and improve this potential legislation. This includes 327 amendments which sought to provide additional safeguards, such as legally excluding those with eating disorders and Down’s syndrome. It is extremely disappointing these were given short shrift and were, staggeringly, voted down with little justification given by the Bill’s supporters.\nMany are also asking if a Private Members Bill is the best way to consider a social issue of such importance and to create such a wide-ranging law? Does it have enough parliamentary time or attention? Here, I should stress again that amendments can be laid when the Bill returns for Report Stage on the floor of the House. This is when the Bill will be debated and voted on again by all MPs in the House of Commons main chamber.\nI hope as many MPs as possible will be there to carefully scrutinise this re-drafted Bill and its huge societal implications ahead of that debate. I certainly will be there to play my part.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_24th-day-christmas-mims-davies-mp-presents-cats-protection-and-jupps/content_22.html": "It's Christmas Eve!\nOn the 24th Day of Christmas, Mims Davies MP presents - Cats Protection and Jupps Fish and Chips\nMims Davies MP was pleased to visit Cats Protection’s National Cat Adoption Centre to see first-hand how the charity helps cats both in the local area and across the UK.\nThe centre, in Chelwood Gate, rehomes hundreds of unwanted and abandoned cats every year across Sussex. Mims met staff and volunteers at the centre before a behind-the-scenes tour where she met some of the cats currently looking for new homes.\nJupps was founded some 57 years ago by Dennis and Sheila who built the business up. One of their 3 children, Martyn, took over back in 1987 with his wife Marie and children Louisa & Megan.\nJupps Fish and Chips is based in Burgess Hill on 80 West Street, RH15 8NX, and pride themselves in only serving the best fish and chips.\nAll their products are cooked to order, if you cannot see what you require, you can simply ask on arrival. Jupps work on the moto \"only sell what you would eat or give to any of the family\".\nMims Davies MP said:\n\"It's Christmas Eve! Welcome to the 24th Day of Christmas!\nOn the 24th Day of Christmas, I am pleased to present - Cats Protection and Jupps Fish and Chips\nIt was a joy to visit Cats Protection during the first week of recess this Summer. I was delighted to visit the Cats Protection’s National Cat Adoption Centre in Chelwood Gate, meeting with the staff, volunteers and seeing the kittens and the cats currently awaiting rehoming.\nIt was fantastic to see how well all the cats are cared for by staff and volunteers who go the extra mile to ensure the welfare of their feline residents.\nCats Protection relies on donations and volunteers, so if you have some free time and love cats, please do get in touch with them - they would love to hear from you.\nJupps is a true family business, launched 57 years ago by Dennis and Sheila, with one of their children, Martyn, joining the business too. This fabulous fish and chips business truly work hard to provide only the best and 'only sell what you would eat or give to any of the family'!\"",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-community-cohesion/content_59.html": "The UK has been a multi-faith, multi-ethnic success story, and I firmly believe the cultural diversity of our population is something we can take great pride in. Millions of people from around the world have come and settled in the UK over the last 3 decades, drawn to our diverse, open and tolerant society.\nDiversity can be a strength, but only so long as people feel they are all part of one and the same society, rather than many different societies in one country.\nLike everyone, up and down the country, I was deeply shocked and saddened by the events of the summer of 2024 and my thoughts and prayers remain with the victims of the Southport attack, their family and friends, and the people of Southport. That three little girls were so cruelly taken by a barbaric attack at their summer dance school can still be scarcely believed. Those families involved in that day will never forget the terror their youngsters encountered and we all salute the bravery of those who ran into harm to save and protect lives.\nIt is vital that the right steps are taken to ensure that no child, no family, and no community has to face the distress that the people of Southport felt. In terms of those events – both the heinous attack on innocent children and the subsequent disorder and terrible riots that broke out following this attack, in the town and further afield - it was essential that the Government enforced the law. I strongly condemn the acts of violence, the unacceptable attacks on police officers and the criminal damage caused during these and, indeed, in all outbreaks of civil or community disorder.\nI am, like many, also incredibly concerned about the growing impact of misinformation and disinformation online on our society making daily lives a misery for many. Too many rush to comment and pass judgement online; the spreading of dangerous gossip and speculation on the internet clearly amplifies division, distress, grief and anger. We have seen this from all sides of the political spectrum and, sadly, we continue to see it.\nWe all have a personal responsibility to check before we share information.\nIt is becoming increasingly clear community cohesion needs to be worked at, not simply taken for granted so my colleagues and I are committed to fostering stronger, more integrated communities where people—regardless of their background—live, learn, work, and socialise together, united by shared rights, responsibilities, and opportunities.\nAs part of this, it is essential that our immigration policies support effective integration for those who come to our country, emphasising the importance of a common vision and shared values based on our democratic practices, equality, freedom, women’s rights, diversity, fairness and the rule of law. We need to actively help create a real sense of belonging for those joining our national community.\nLike you, I firmly believe in the importance of building stronger, more integrated communities. As a country, we must continue to recognise and value the common themes which bind us all together and I want to see Ministers working to build people's sense of community and belonging.\nWe must strive to bring people together, to share and strengthen the liberal values that have made our country successful and peaceful for so long – a country that so many have chosen to make their home.\nYou can be certain I will be closely monitoring this new Labour Government’s work in this area.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-supports-single-parents-day/content_10.html": "I’m determined to help ensure the barriers to work & employment progression that my fellow single parents face are understood & fully broken down.\nFind more information on latest support that’s out there in my piece for #GraziaUK this #SingleParentsDay\nhttps://graziadaily.co.uk/.../mims-davies-as-a-single-mum/\nI’m so lucky to have wonderful local support, friendships & daily help and assistance-plus very understanding kids!\nAs Minister for Social Mobility, I want people to be able to get where they want to & I’m determined to help #SingleParents to progress & thrive in their family & work lives in every way.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-discusses-nature-friendly-farming-countryside-regeneration-trusts-twyford-farm/content_19.html": "Mims Davies MP discusses nature-friendly farming at the Countryside Regeneration Trust’s Twyford Farm\nMims Davies MP praised the amazing work of the Countryside Regeneration Trust (CRT) during a recent visit to Twyford Farm, West Sussex – highlighting the vital role of farmers as stewards of the land and champions of nature-friendly farming.\nThe visit, hosted by CRT tenants Bob Felton and Liz Wallis, showcased the charity’s work to restore biodiversity, tackle climate change, and support sustainable rural livelihoods through careful land stewardship and farm diversification.\nThe CRT is calling on Mims to help address the growing challenges facing the rural economy, particularly uncertainties surrounding environmental funding and regulation.\nDuring Mims' visit, she also explored the importance of diversification for small farms, including the role of rural tourism and holiday accommodation in supporting local economies.\nMims Davies MP said:\nIt is vital our unique and ancient landscape remains constant, and the charity really makes a difference.\nBob and Liz are doing amazing work alongside community volunteers and groups to promote nature friendly farming, helping reverse the biodiversity decline and combat climate change alongside farming and other diversification projects including vital local accommodation for visitors to our lovely area and to meet some new-born spring lambs too.\nOur working farms and the farmers who manage them are the guardians of our landscapes and play a crucial role in our countryside.\nIt was great to see all the Bob and Liz have achieved and to hear about their plans for their next 10 years.\nHead of Estates at the CRT, Kerriann McLackland said:\nWe were delighted to welcome Ms Davies to Twyford Farm.\nShe has a strong background in farming and, while in opposition, it was incredibly valuable to speak with her about the real-world challenges our tenants face.\nFunding uncertainty is one of the biggest issues – Bob and Liz are currently on the High Level Stewardship Scheme, rather than Sustainable Farming Incentive (SFI), which was suddenly closed to new applicants, and, while they have been told it will be renewed, they have been given no date for this, which makes long-term planning extremely hard.\nMims was particularly interested in understanding the barriers that farms like Twyford face in developing accommodation options and was passionate about understanding the regulations that can make this difficult.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_my-weekly-column-mid-sussex-times-52/content_17.html": "It was lovely and sunny at Chequer Mead when I recently met with Dean and Sarah. However, the brightness at the theatre dimmed when I heard about the impact of the parking charges in East Grinstead. As we know, the Lib Dems, supported by other parties, have introduced Sunday, Bank Holiday, and Evening charges and the highest rates in the district are in this town and it’s affecting footfall and businesses, including the theatre. I met the Chief Executive of the Council regarding the impact of the parking charges, the effect on the high street footfall, and sharing the views of residents who have emailed, called or completed my online survey.\nI was pleased to join the theatre recently at the volunteers’ fair and am excited to join them for some of their brilliant upcoming shows, including Cinderella Panto at the end of the year! Following conversations with Kathryn Hall, there will be a pass for their vital volunteers to help make sure the shows happen. It’s time for Councillors to understand the misguided impact of their choices; this, with business rate hikes and the NI rises, means our businesses and local organisations are struggling to feel positive and we must shop and back local.\nI met with ‘Cash Access UK’ - who will be progressing our new Banking Hubs coming to East Grinstead and Uckfield, ensuring they were aware of the hike in parking charges and to keep this in mind whilst choosing a suitable location in EG. Their introduction is very welcome news for our amazing small businesses, older residents, our more vulnerable residents, and anyone needing face-to-face contact – and yes, they’ll be dealing with cash. Do take 5 minutes to share your views on what services you need- https://www.mimsdavies.org.uk/banking-hubs-survey. I will be receiving regular updates from Cash Access and ensure I keep residents up to date.\nI’ve booked another of my in-person Q&A 'Meet Mims' events - this time in Turners Hill, joined by some of the local Councillors. My series of MP events aims to engage with as many residents as possible, to hear your views and to take questions on local and national matters. These events are free, relaxed, with no age limit and you don't have to submit a question - if you don't want to. See you there for a natter!\nFinally, Lewes District Council have now launched their Housing Allocations Policy Consultation with a deadline of 5pm Friday 18th April. Currently the council have a 'Choice Based Lettings' system and are proposing to change it to a 'Property Match' system. Please don’t hesitate to share any views - the consultation on this can be found on my website.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-global-hunger/content_40.html": "There is increasing concern about the levels of hunger around the world caused by poverty, changing demographics, climate change and conflict. I believe that it is essential the UK builds on the last Government’s work and continues to put global climate action and food security at the top of its foreign policy agenda.\nThe previous Conservative Government’s 2023 Development White Paper set out thoughtful plans to support conflict prevention and recovery and to transform global food systems by using cutting edge technology, including AI and data management to support international efforts to predict conflict and find inclusive, sustainable solutions. I do hope that the new Government takes these innovative ideas forward.\nGlobal conflict is exacerbating the existing global food crisis. However, even before this, millions around the world were suffering from food insecurity and malnutrition. Preventing conflict-induced hunger and famine is therefore a priority for the UK, and I would like to take this opportunity to highlight some of the crucial work being done in this area.\nThe UK uses its influence within multilateral organisations to help prevent conflict-induced hunger. For instance, under the previous Government, the UK used its seat at the UN Security Council to implement resolution 2417, which enables reporting and early warnings to the UNSC when parties to conflict are blocking access to humanitarian support and destroying assets. The UK also works with other UN Security Council members to increase accountability for the use of starvation as a weapon of war.\nIt may also interest you to know that the Famine Prevention and Humanitarian Crises Compact was agreed during the UK’s G7 Presidency. Under this compact, the UK provided its share of the $7 billion in humanitarian assistance to the countries one step from famine. Moreover, the UK and other G7 states made commitments to address critical funding gaps; promote humanitarian access; respect for International Humanitarian Law and protection of civilians; scale-up anticipatory action; partner with the World Bank Group to enhance crisis preparedness and response; and strengthen our data and analysis to facilitate early action. In my view, it is vital that the new Government builds on the work of the previous and continues to deliver on these commitments.\nI also believe that it is important this Government continues to work with multilateral organisations to ensure food security. The UK has a world leading reputation in this respect: UNICEF has described the UK as “a champion and one of the largest funders of tackling the most severe form of malnutrition in children [and] wasting.” I was delighted that the previous Government extended its partnership to deliver nutrition and prevent child wastage with UNICEF. The current partnership runs until 2030, supported by a total of £61 million. I understand the partnership is on track to deliver essential nutrition actions for at least six million children in nine countries. I hope the current Government recognises the important work that the UK and UNICEF are delivering in this area. I also welcomed the previous Government’s 2021 Nutrition for Growth commitment, which allocated at least £1.5 billion between 2022 and 2030 to address the nutrition needs of mothers, babies and children.\nI recognise that climate change is having a significant effect on food security, especially in developing nations. I believe that the UK Government should continue to play its part slowing the rate of climate change by continuing to pragmatically reduce emissions. Indeed, under the last Government, the UK became the first G7 country to legislate to achieve net zero by 2050 and the fastest decarbonising G20 country. However, UK action alone is not enough to protect food chains around the world from the effects of climate change. This is why the previous Government also called for global ambition and action to reduce emissions across all sectors, including in agriculture, forestry and other land use, which is collectively responsible for roughly 23 per cent of global emissions. At COP28, the UK Government, building on its agreement to provide a specific fund for loss and damage at COP27, announced a fund worth £1.6 billion for climate projects, including those aiming to stop and reverse deforestation, protect the natural environment and accelerate the global transition to clean and renewable energy.\nThe UK Government also agreed to scale up its partnership with the World Bank in order to boost global climate-resilient farming practices and committed £10 million worth of funding to the UN’s Food and Agriculture Organisation (FAO) to help smallholder farmers to improve their incomes in ways that reduce their impact on the natural world, particularly with regard to forestry.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-airport-expansion/content_51.html": "There are some who say expanding airport capacity will only benefit ‘wealthy jet-setters and airline bosses’ but our UK air connectivity plays a vital role in supporting economic growth right across the country and, most particularly, locally. It underpins the UK’s position as a hub for global trade through air freight, which represented 57% of the UK’s non-EU exports by value in 2023. Air freight is particularly important for supporting export-led growth in sectors where goods are of high value or time critical.\nInternational connectivity drives investment in the UK, granting global companies access to British markets, and adds billions to the UK economy through tourism. In 2023, overseas residents spent over £31 billion on their visits to the UK. According to the Department for Transport (DfT) analysis of Office for National Statistics (ONS) statistics, the air transport sector directly contributed £14 billion to UK GDP in 2023 and provided over 140,000 jobs across the UK in 2022, supporting many more jobs. These support families and homes, laying bare the challenges on getting this right of our local community and our economy.\nTwo major issues around airport expansion which I have been asked to address by constituents, are the impact it may have on our national climate change goals and the possibility of increased noise pollution affecting our local community. Firstly, I am aware that any environmental impact will be considered as part of the Development Consent Order process, and the Climate Change Committee will assess aviation’s role in our carbon budgets in due course. It is welcome news the technical consultation and analysis as part of the last Government's Jet Zero programme showed the aviation sector can achieve net zero without Government intervention to limit aviation growth. I would strongly encourage the Government to preserve people's ability to fly while supporting consumers in making sustainable aviation travel choices. Airports are also expected to set targets for sustainable passenger and staff travel to the airport that align with the UK's national climate change goals, with progress monitored by their respective Airport Transport Forums.\nNoise is regulated at all British airports. This can include noise limits and restrictions on night flights while some airports operate grant schemes to install sound insulation in affected homes. The Department for Transport's approach to managing aircraft noise has historically been based on the principles of the International Civil Aviation Organisation’s (ICAO) Balanced Approach to aircraft noise management. This ensures that decisions regarding an airport’s operations take into account both health and economic factors. Operating restrictions are only introduced at airports if there are no other ways of achieving the desired benefits. Night flight restrictions, importantly, have existed at Heathrow since 1962, Gatwick since 1971, and Stansted since 1978. The current system, often referred to as the \"Quota Count\" system, was established in 1993. This system places limits on both movements and the amount of noise energy that can be emitted at each airport with fines imposed if noise departure limits are breached.\nThe last Government consulted on proposals for the next night flight regime of Heathrow, Gatwick and Stansted Airports as the current regime is due to expire in October 2025 and this government has stated that, as proposed in the consultation, the movement and Quota Count limits at Heathrow and Gatwick for the next regime will remain the same as they are now.\nAt major airports with more than 50,000 movements per year, noise regulation is agreed locally, often through local planning agreements. Airport operators are required to prepare airport Noise Action Plans and it is up to individual airports to determine, including through public consultation, the most effective measures to implement within an action plan. It is welcome that all major airports within scope of the regulations have produced their noise action plans for 2024 to 2028. Where the government sets the procedures, these are monitored by the airport’s noise and track-keeping systems. Data is received from National Air Traffic Services radars and permanent noise monitors located around the airport. Adherence to the noise abatement procedures is reported via the airport’s flight performance report, which is available on the airport’s website.\nMore broadly, technology is already making a significant difference, and new aircraft models make between 30 and 50 per cent less noise on take-off and landing than previous equivalent models. I hope that the government continues to support steps that effectively reduce aircraft noise and ensures companies follow existing rules.\nThe Conservative Government plans for airport expansion were always focussed on building a new hub and increased capacity at Heathrow, not Gatwick. We can all recognise that the completion of a third runway at Heathrow does have the potential to bring considerable economic benefits for the UK which would be welcomed. Therefore, in principle, I do not oppose the construction of a suitable third runway acknowledging the environmental impact and constraints. More broadly, I do not believe net zero targets should override the need for economic growth and prosperity. This is, of course, a question of striking a suitable balance for our next generation and to address local concerns and air quality challenges. However, the Conservative transport minister Jesse Norman was clear in October 2023 that it was up to the airport to submit a Development Consent Order application which demonstrates the project will meet “strict criteria on air quality, noise and climate change, as well as being privately financed”. This is now being actively encouraged by the current Labour Government in their elusive search for much needed UK growth.\nIt is surprising to see the Labour Government's direct support for this project despite the Prime Minister's previous opposition, the previous publicly declared, clear opposition of the current Secretary of State for Transport and seven other current Cabinet Ministers including the Energy Secretary, Heathrow not having yet submitted a Development Consent Order and the absence of clear plans from the Government regarding airspace, noise and additional work that would have to be done around the airport.\nThe 12th of February 2025 saw the announcement of a new multibillion-pound investment programme from Heathrow Airport which will see the investment of billions in a new expansion programme for new terminal buildings, aircraft stands, passenger infrastructure and its third runway plans as part of its project of expansion. While this was welcomed by the Labour Government, the decision to expand Heathrow Airport must be based not merely on principle but on practicalities. I would note that there are clear and significant logistical barriers that would make its construction challenging. Therefore, the Government must address these clear challenges. It is only right the Government and Heathrow fully answer the reasonable questions and concerns of local people before the project moves forward. Ultimately, Heathrow expansion must be a privately funded, private sector project, and any development must ensure that it delivers for both local communities and the fare paying public.\nIn the case of Gatwick, a separate planning process is already well under way with London Gatwick Airport having formally submitted a development consent order on 6 July 2023 to convert its standby runway for regular use. A decision by the Labour Government is imminent. This has been undermined, in my view, by the clear indication from this government that they wish to see it proceeding. This change could potentially allow the airport to serve 75 million passengers, up from 45 million and I appreciate there are many valid concerns about the proposal and the way it has been proposed.\nI have always disagreed with this ‘back door’ approach to expansion. I have been clear on that with the management at hearings. To that end, I have had regular meetings with the leadership team at Gatwick to share the concerns of constituents around this process and other surface travel issues, particularly east/west, including connectivity, bus and rail links and road capacity in order to protect the environment, minimise noise and air pollution while still creating the jobs we need in our local communities. We met most recently again at the Party Conference and I will be meeting with them again once the proposals have been decided. This is expected by the 27th February 2025 so the decision is very much due.\nIt is essential the Government carefully reviews the proposal to ensure it strikes a balance between the clear and vital economic benefits to our area and maintaining standards and environmental protections. Importantly, they must fully consider the clear views of a range of local people and key stakeholders such as the railways, to ensure our communities served by this airport receive a fair deal and uncertainties around future changes in airspace, additional noise, surrounding infrastructure, housing and transport needs as well as the environment are properly addressed. I will be following this issue very closely on behalf of my constituents whatever the outcome to make sure the balance between jobs, opportunities and our local environment are managed sustainably and effectively.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_banking-hubs-survey/content_56.html": "I'm thrilled to announce we have 2 new Banking Hubs coming to East Grinstead town and Uckfield town.\nI know this will be very welcome news for our amazing small businesses, older residents, our more vulnerable residents, and anyone who needs face-to-face contact and who deals with cash.\nI am launching a quick online survey to gather resident's views on possible locations, opening hours, services available and more, which I will feedback to the CashAccess team I met with on this topic.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-safer-phones-campaign/content_53.html": "As a parent, like many of you, I worried about whether my children will grow up healthy, make friends at school, and feel safe both online and offline. Like you, I want all children to have a fulfilling childhood, learning the skills they’ll need for the future while staying protected in the digital world. Therein lies the conundrum. I am a single parent and these are difficulties for us all, whatever our situation, as young people see phones as a positive and a rite of passage.\nI am aware that the UK chief medical officer, among others, has reviewed the scientific evidence and concluded that an association between screen-based activities and poor mental health exists, but existing research does not yet prove a causal relationship. However, this does not mean we should rule out taking a precautionary approach, whilst considering all the impacts.\nIn fact, I do think the decision on whether a child should have access to a smartphone should not be made by the Government. Instead, we should work widely and together to empower parents to make the right call for their children and their individual circumstances. It is my belief that choice is a liberty that parents and children should be allowed to exercise. We should be talking to our youngsters while protecting them from inappropriate viewing, online bullying and other harmful activities with age-appropriate controls, restrictions on screen time and much more. I am not certain we can fully turn back the clock.\nI agree that online platforms must roundly take responsibility for the harmful effects of the design of their services and their business models. That is why the previous Government introduced the Online Safety Act, which puts the onus on platforms to ensure that children are protected. This includes removing and limiting the spread of illegal content and taking steps to prevent similar material from appearing. In addition, user-to-user and search service providers must also provide age-appropriate protections to children from 'priority' content that is harmful to children, such as bullying and content that depicts or encourages serious violence.\nI know that mobile phones can be a huge distraction to learning for pupils and, if unregulated in classroom settings, lead to a significant loss of learning time. That is why I urge the current Government to continue to strengthen the Department for Education's action on classroom mobile phone usage making clear that use should be prohibited throughout the school day. Headteachers must be provided with advice and support on how to successfully prohibit mobile phone use, including at break times, to tackle disruptive behaviour and online bullying whilst boosting attention during lessons.\nJosh MacAlister OBE MP says his Bill aims to make smartphones less addictive for children and empower families and teachers to cut down on children’s daily smartphone screen time. Whilst I agree with the sentiment of the Honourable Member's Private Members' Bill, I will need to review its details when it is published before deciding whether to lend my support.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-uk-climate-commitments/content_30.html": "I welcome the increased debate on this issue and thank those constituents who brought it to my attention. However, due to prior diary commitments, I was unable to attend the drop-in event in Parliament hosted by Greenpeace on 11 September.\nIt is crucial that we recognise the importance and urgency of action needed on climate change. The UN's Intergovernmental Panel on Climate Change has concluded that the world is warming faster than anticipated, the effects of which are being seen in every single region of our planet. Immediate global action is needed to limit warming, heatwaves, heavy precipitation, droughts, and loss of Arctic Sea ice, snow cover and permafrost.\nThe debate on climate change has, unfortunately, been stuck between two extremes and we must acknowledge it is important to bring everyone with us as we forge ahead in eradicating the UK’s contribution to climate change. We can do this and still meet our international commitments whilst meeting pragmatic domestic targets that do not burden hardworking British households.\nThe UK was the first G7 country to legislate to achieve net zero by 2050, and the UK has made progress in cutting emissions faster than any other G7 country, having already reduced emissions by 50 per cent since 1992, compared to 41 per cent in Germany, and 23 per cent in France, as well as surpassing the targets most countries have set for 2030.\nIt is this over-delivery on reducing emissions that provides the space to take a more pragmatic, proportionate, and realistic approach to reaching net zero that continues to ensure our country's energy security. It is a pity that, instead, the Government is forging ahead with its pledge to decarbonise by 2030. This will lead to higher bills and increase our dependence on batteries and cables from China.\nIt is worth noting that the UK accounts for less than one per cent of global emissions and clearly global action is required. When the UK took on the COP26 Presidency, in partnership with Italy, only 30 per cent of the world was covered by net zero targets. Since COP26, the figure is around 90 per cent. Progress is being made to combat climate change but more must be done from those countries who contribute the most to carbon emissions.\nWhile I believe achieving net zero by 2050 is feasible and consistent with avoiding the most damaging climate change, aiming for zero emissions by 2030 is almost certainly impossible, disruptive, not required by the science, economically unfeasible and risks undermining consensus. I urge the Government to commit to a fairer and more pragmatic path to achieving net zero that eases the financial burden on British families.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-wildlife-crime/content_31.html": "Wildlife crime can have significant, detrimental consequences on communities and livelihoods, not to mention the potential pain and suffering to animals so I understand the importance of tackling wildlife crime which is any activity that goes against legislation protecting the UK's wild animals and plants.\nI know that the Department for Environment, Food and Rural Affairs and the Home Office fund the National Wildlife Crime Unit (NWCU) to tackle these crimes. The NWCU provides intelligence, analysis and investigative assistance to the police and other law enforcement agencies across the UK to support them in investigating wildlife crime. This can include cases referred by the Border Force, the National Crime Agency or individual forces. The NWCU also works with EUROPOL and INTERPOL to tackle international wildlife crime activity.\nStrategic and tactical assessments from the NWCU take into consideration the views of the Wildlife Conservation Advisory Group, which highlight priorities based on the conservation status of specific species and review all other non-priority intelligence to identify any emerging threats. These assessments ultimately drive the operational response to tackling wildlife crime in the UK.\nWhile non-notifiable wildlife crime can still be investigated, I understand that the last Government's approach was to keep under review any legislative proposals to increase the range of wildlife crimes that have notifiable status. Chief Constables have operational independence to tackle crimes that matter most to their communities. I am aware this Government has said, \"there are no plans currently to make wildlife crimes notifiable.\"\nHowever, any case of cruelty towards any animal is completely unacceptable and I would fully welcome prosecutions against anyone found to have caused unnecessary suffering to an animal. As you may already know, under the provisions in the Wildlife and Countryside Act 1981, The Wild Mammals (Protection) Act 1996 and Animal Welfare Act 2006, there are a range of offences around injuring and inflicting unnecessary suffering on wildlife.\nIn addition, the last Conservative Government's Animal Welfare (Sentencing) Act 2021 fulfilled its commitment to increase the sentences available to our courts for the most serious cases of animal cruelty, including acts against wildlife, by raising the maximum penalty for this offence to five years’ imprisonment and/or an unlimited fine. New measures in the Police, Crime, Sentencing and Courts Act came into force on 1st August 2022, which empowered and equipped the police and courts with the powers they need to combat hare coursing. The precise sentencing of individuals convicted of wildlife crimes is, however, a matter for judges, which is rightly the case given judicial independence. I understand your desire to see these crimes appropriately punished; however, it is necessary to ensure that any punishment is proportionate to the crime. Ensuring an appropriate balance is in place is critical to protecting wildlife from harm\nIt remains unclear if the new Labour Government will continue with the approach of the last Government or change course. I assure you I will follow any developments closely.\nAs always, if you believe that someone has broken the law in relation to hares, badgers, or indeed any other animal, I would urge you to report the matter to the police who can investigate further.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-community-energy/content_41.html": "Community energy projects involve groups of people coming together to purchase, manage, generate, or reduce consumption of energy. This includes solar panels, wind farms, hydropower, rural heat networks, electric vehicle charging points and fuel poverty alleviation schemes. Programmes are usually not-for-profit, and profits raised from projects are reinvested back into the communities in which they power.\nCommunity energy projects can play a vital role in reducing carbon emissions and empowering local areas to benefit from low-carbon heat and electricity. Community energy can create jobs and investment but also importantly, engages with communities in the transition to a new energy system. These initiatives can deliver real value to communities, and I strongly believe national and local governments must collaborate to ensure no one is left behind in the transition to cleaner energy. To that end, I have been contacted by constituents who are concerned about the lack of clarity from the Labour Government around future funding for these projects.\nAs the Shadow Secretary of State for Energy, Andrew Bowie MP said in the Great British Energy Bill debate on the 25th March 2025,\n‘We have debated this Government’s energy policies on many occasions in the past few months. We have frequently debated the merits, or lack thereof, of Great British Energy, an organisation about which we still know very little—what it is for and what it will do.’\nThe Community Energy Fund introduced by the previous Conservative Government supported both urban and rural communities to develop local renewable projects. Similarly, the Local Net Zero Accelerator helped local councils attract private investment in green growth. Following the passage of the Energy Act 2023 through Parliament, the previous Government was committed to consulting on the barriers to community energy projects by launching a call to evidence.\nIn a departure from this, this Government has promised to establish a publicly owned entity called Great British Energy, to encourage investment in local green projects. Building on previous efforts, this Government’s Great British Energy plan includes a Local Power Plan to support community-owned renewable energy, with a target of generating 8GW of power.\nHowever, there are serious questions about whether Great British Energy will produce any energy at all or merely act as a funding vehicle for large companies. More must be done to remove barriers for community energy projects, such as reforming licensing regulations to allow them to sell electricity directly to local customers and addressing the high costs and delays of securing grid connections. Existing schemes, like the Smart Export Guarantee, also need strengthening to provide greater financial certainty.\nPlanning policies also need to better reflect the benefits of community energy. Recognising these benefits as a material consideration and using Neighbourhood and Local Area Energy Plans to build support could help embed these projects into local priorities. Additionally, the potential for community energy to incentivise demand flexibility must be explored to reduce carbon emissions.\nWe do now know that the role of Community Energy has been put into the Bill explicitly and that the Government has committed an additional £5 million to the community energy fund, giving it some short-term certainty.\nHowever, Michael Shanks MP, Parliamentary Under-Secretary of State at the Department for Energy Security and Net Zero, speaking for the Government added that,\n‘Going forward, those projects will be on the basis of the individual investment propositions put forward. Individual projects in Scotland or in other parts of the UK will therefore apply for funding, they will be considered alongside other investments and those investments will be made.’\nI will continue to question whether Great British Energy delivers real results or becomes another costly initiative that fails to deliver on its promises. Communities deserve affordable energy, secure supplies, and tangible benefits from the transition to renewables. I will hold the Government to account and make sure the focus is on cheap bills and secure energy for communities.\nThe link to the full debate transcript can be found here:\nGreat British Energy Bill - Hansard - UK Parliament\nYou may also be interested in reading this statement: Net Zero April 25",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_ps204-million-cash-boost-kickstart-largest-ever-expansion-childcare/content_18.html": "Today the Government has announced a £204 million cash boost to kickstart the largest ever expansion of childcare, supporting parents to return to work and helping to grow the economy.\nAs a mum of two, I know the cost of childcare can be a real struggle for parents, and too often becomes a barrier to work.\nThat is why I welcomed the announcement of the largest ever expansion of free childcare at the Spring Budget – and today, nurseries are set to receive an initial investment of £204 million to kickstart delivery. The Government has also announced plans to provide all parents of primary school children access to childcare in their local area between 8am and 6pm – and 16 local authorities have already been selected to work with the Government to develop plans for this universal provision.\nThis initial investment of over £200 million will be transformational for working families and a huge step forward in delivering the largest ever expansion of childcare to help grow the economy.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-brain-tumours/content_52.html": "Brain tumours have blighted so many lives: every year around 12,100 people in the UK are diagnosed with a brain tumour and just 14 per cent of people survive their disease for 10 years or more. I know there is much more to be done to improve survival and quality of life for people affected by a brain tumour and I am pleased to be an Officer for the All Party Parliamentary Group (APPG) on Brain Tumours. We are committed to raising awareness of the issues facing the brain tumour community in order to improve research, diagnosis, information, support, treatment and care outcomes.\nThe previous Government sought to build on the legacy of Dame Tessa Jowell’s campaigning in her final months, by committing to make the treatment 5-ALA – which enables more accurate surgery on brain tumours – available in every neurosurgical centre in England.\nI recognise the value of research into the causes, treatment and care for brain tumours, and commend the work of patient groups such as The Brain Tumour Charity and Brain Tumour Research in this area. As part of the Dame Tessa Jowell Brain Cancer Mission, since 2018, the National Institute for Health and Care Research (NIHR) has committed £11.3 million across 16 projects for research into brain tumours. My understanding is that funding remains available from the original £40 million announced in 2018.\nI fully appreciate that there is further work to be done in tackling this disease and have brought your views to the attention of my colleagues on the Shadow Health team, to ensure they are aware of the continued strength of feeling and crucial work to be done. Ministers have recently committed to ensuring that people with brain tumours have access to effective treatments through their planned National Cancer Plan, and I will be holding Ministers to account for delivering on their promises.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-animal-free-science/content_49.html": "We are a nation of animal lovers, and animal welfare has been a key priority since my election to parliament so I completely understand that the use of animals in science, including toxicity testing, is a highly sensitive and emotive issue. Thank you to those onstituents who wrote to let me know they have signed a petition in support of an immediate ban on dogs being used for scientific and regulatory procedures. This petition will be scheduled for a debate in Parliament because it has reached the required threshold of 100,000 signatures and I will endeavour to attend that debate if I can.\nI am proud the UK is one of the world's leading nations in the development of non-animal methods; I am keen to ensure that these are utilised wherever is possible and I will support work which aims to accelerate the point at which animal research and testing is no longer necessary, having been fully replaced by effective alternatives. Sadly, however, technology is not yet at a point to wholly replace animal testing for important applications tackling some of the most significant human health conditions.\nTherefore, I understand the current approach has been to support and accelerate advances in biomedical science and technology to reduce reliance on the use of animals in research. To achieve this, funding has been used to support the development and dissemination of the three Rs which aim to replace the use of animals not necessary for research; to reduce the use of animals in the meantime; and to refine to eliminate or reduce distress to those animals already involved. I strongly advocate for these methods and believe they will greatly improve our animal welfare standards, the economy and the safety of chemical products in the UK. Such technologies have the potential to reduce the reliance on the use of animals, improve the efficiency of drug research and development, and deliver safer, cheaper and more effective medicines to patients.\nThis is primarily delivered through the National Centre for 3Rs (the NC3Rs) which works, nationally and internationally, to drive the uptake of non-animal technologies, and through research into the development of alternatives by Innovate UK, the Medical Research Council, and the Biotechnology and Biological Sciences Research Council. Since it was established, the NC3Rs has invested £89.3 million in research and £27 million in contracts through its CRACK IT Challenges innovation scheme for UK and EU based institutions, with that funding mainly focused on approaches for safer assessment of pharmaceuticals. It was most welcome that, in February 2024, the previous Conservative Minister responsible announced that investment to the NC3Rs was to double from £10 million per year to £20 million per year. It is to be hoped that the new Government will sustain this level of funding.\nThe Home Office licences programmes of work using animals in science, including testing to satisfy regulatory requirements set out in legislation. I understand establishments must only conduct work for limited permissible purposes, according to the terms of their licences, which the Home Office assures through audit and inspection processes.\nThe current Labour Government has a manifesto commitment to phase out animal testing altogether. It is a noble aim. I look forward to reading its strategy to achieve this when it is published later this year. The law already requires that animals are only used in science where there are no alternatives, where the number of animals used, and potential harm is the minimum needed to achieve scientific benefit. I, along with my colleagues in Opposition, am keen to work with the Government on reaching a point at which testing on animals is no longer necessary.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_category_Media/content_21.html": "Mims Davies touring Handcross High Street's brilliant small businesses 19th June 2024 Mims Davies touring Handcross High Street's brilliant small businesses from Handcross Butchers to JO.CO. #ShopLocal \"Take a tour round the brilliant Handcross... Local NewsMedia\nMims Davies out bright and early speaking with commuters at East Grinstead train station 19th June 2024 \"Another bright and early start this morning! This time in East Grinstead at the train station with the team talking to commuters on their way to London. Even... Local NewsMedia\nMims Davies on BBC Politics South East 19th June 2024 Mims Davies on BBC Politics South East discussing pot holes, opportunities for young people, and of course the Euros. \"I was thrilled to be on BBC Politics... Local NewsMedia\nMims Davies in Balcombe this morning with Cllr Marsh discussing Parking and Fracking 18th June 2024 \"It was indeed another early start this morning, this time in the lovely Balcombe alongside Cllr Gary Marsh speaking with commuters at the station. It’s clear... Local NewsMedia\nMims Davies MP in Westminster discussing the General Election Announcement 23rd May 2024 An update from Mims Davies MP in her Office in Star Chamber Court in Westminster, discussing the recent General Election Announcement from the Prime Minister. MediaWestminster News\nMims Davies MP catchup from Parliament and events locally 19th May 2024 Emile Heskey was in, who needs no introduction for football and Liverpool supporters. Emile was in discussing grassroot football and investments coming into Mid... Local NewsMediaWestminster News\nMims Davies MP Roundup in Parliament 18th May 2024 Mims Davies MP's weekly roundup on work taking place in Parliament Passing the new pensions special rules Theo Clark bringing forward the cross party Birth... MediaWestminster News\nMims Davies MP's Local and Parliamentary Catch up from Westminster 27th April 2024 Mims Davies MP's Local and Parliamentary Catch up from Westminster Mims Davies MP catching constituents up on the Rwanda Bill & Smoking and Vaping Bill in... Local NewsMedia\nMims Davies MP Hosts 'A Taste From Across Mid Sussex' in Parliament 21st March 2024 Mims Davies MP was thrilled to host her second in a series of 'A Taste From Across Mid Sussex' in Parliament. These events are a fantastic opportunity for... MediaWestminster News",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_category_Speeches-in-Parliament/content_9.html": "£204 million cash boost to kickstart the largest ever expansion of childcare 7th July 2023 Today the Government has announced a £204 million cash boost to kickstart the largest ever expansion of childcare, supporting parents to return to work and... Speeches in Parliament",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-factory-farming/content_50.html": "There are a number of different farming systems within the UK and farms of all sizes have a role to play in promoting sustainable UK agriculture. I know that the previous Government sought to promote efficient, competitive farming, but did not seek to favour large- or small-scale farms.\nI note your concerns about pollution and the environmental impact of farming. While the last Government was committed to minimising pollution from all types of farming, including production systems where animals are housed indoors for some or all of the year and which accumulate manures and slurries, much remains unclear on whether the new Labour Government will maintain this focus. Indeed, as you may be aware, it was disappointing that the Labour manifesto only had 87 words on farming so I sympathise with the sector which I imagine is seeking clarification on the new Government's policies.\nHowever, I hope I can reassure you that the UK's legal standards, including the nitrates and silage, slurry and agricultural fuel oil regulations, all require manure produced in livestock housing (including slurry) to be stored responsibly and for a long enough time to ensure it is spread in a way that minimises water pollution. Furthermore, the farming rules for water and nitrates regulations require these manures to be spread according to appropriate volumes, locations and timescales to minimise pollution.\nIn addition, the last Government introduced farming schemes to provide revenue and capital funding to help farmers build the infrastructure necessary to manage manures to reduce pollution. For example, a dairy farmer has been able to utilise Sustainable Farming Incentive funding for measures to reduce soil erosion and runoff from their fields, and Slurry Infrastructure Grant funding to expand and cover their slurry store according to best practice.\nMore broadly, all farms must comply with comprehensive UK law on animal health and welfare, planning, veterinary medicines and environmental legislation. Stockmanship and high husbandry standards are key to ensuring appropriate welfare standards for all farmed animals.\nThe last Government committed to supporting farmers to exceed the UK's existing world-leading animal welfare standards, including through the Animal Health and Welfare Pathway. As part of this, a full monitoring, evaluation and learning plan for the pathway was in place to help assess the impact of financial support being offered to farmers.\nI firmly believe that protecting the natural environment is important across the country for the benefit of future generations. Regarding your concerns, please know that I understand your worries about nature, the environment, animal welfare and planning reform. It is important that the planning system takes many factors into consideration and I will hold the Government’s planning reforms to account.\nI hope the Labour Government does not let farmers or the environment down by failing to take this issue as seriously as the last Government did. However, the new Government has already broken promises to farmers as shown by the callous family farm tax which will see families lose their livelihoods and homes, and there is no guarantee land sold will be used to grow food risking food prices increases, more food being imported, and the countryside being concreted over.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-rooftop-solar/content_42.html": "It is abundantly clear that, where appropriate, solar panels can put unused roof space to good use and are an important technology in helping to reduce carbon emissions so I was pleased when the previous Conservative Government committed to widespread deployment of rooftop solar. Indeed, 99 per cent of all rooftop solar has been installed under a Conservative-led government.\nOur ambition for 70 gigawatts of solar capacity by 2035 required a significant increase in both ground-mount and rooftop solar and we were clear that the extensive deployment of rooftop solar, on domestic, industrial and commercial property to make effective use of available surfaces, was a priority with the potential to help protect agricultural land and our rural landscapes.\nIn November 2023, the Department for Housing, Communities and Local Government announced expanded development rights, making it easier for more homeowners and businesses to install rooftop solar panels without the need for planning permission in most cases.\nThe last Conservative Government also consulted on plans for a Future Homes Standard that would ensure all new homes can be built zero-carbon ready, including by using solar panels where appropriate. I sincerely hope the new Government will take the views gathered during the consultation into consideration and press forward with the last Government's work to encourage more solar panels on new homes.\nLike you, I believe the Labour Government must support the deployment of rooftop solar across the country and it is very welcome news they are continuing the Solar Taskforce created by the last Government to bring together key players from government, industry, regulatory and other relevant organisations to drive forward an increase in solar power.\nRegarding the New Homes (Solar Generation) Bill, I understand this would see solar panels mandated on all new homes. While I share the view that solar has an important role to play in helping us decarbonise the power sector, it is worth noting that some roofs are not suitable for solar panels due to structural strength, difficulties with maintenance access or the direction of the building. I therefore support work to encourage the use of solar panels on new homes where appropriate.\nAs you may be aware, the Labour Government decided not to support this Private Members’ Bill on the 17th January and I have provided the link to the debate transcript here: New Homes (Solar Generation) Bill - Hansard - UK Parliament.\nFinally, I would like to say how proud I am that the UK is the first major economy to halve its emissions, cutting them by 50 per cent between 1990 and 2022 while growing our economy by 79 per cent. I believe, however, that our route to net zero must balance ambition with realism. I am aware this Labour Government has not yet made any estimate as to the amount of non-residential building roof space that is available and suitable for the installation of solar panels. Without knowing this, tripling existing solar capacity by 2030 will be incredibly difficult. I look forward to examining the Government's plans when its 'Solar Roadmap' is published.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-joins-farmers-parliament-square/content_57.html": "Mims Davies MP was pleased to join farmers today in Parliament Square against inheritance tax\nParliament Square was gridlocked with farmers and their tractors from all over the land, coming together, to protest Labour's new inheritance tax.\nFrom April 2026, inherited agricultural assets worth more than £1m, which were previously exempt, will be liable to the tax at 20%.\nFarmers joined together again alongside Mims Davies MP and her colleagues, protesting the new tax and ensuring their voices are heard as this isn't their first protest outside Parliament.\nMims could also be seen supporting farmers multiple times in November:\nMims Davies MP, SoS for Wales, joins Farmers in Protest outside Westminster | Mims Davies\nMims said:\nToday I've been with farmers from up and down the land who are hacked off about what's happening to their livelihoods and their businesses.\nAs you can see in the video Parliament square today was absolutely blocked off.\nThis is a way of life, a commitment to the area we can’t ever take for granted and vital for all our food security.\nFarmers are here again to make their point that - we need our food, we need our food security, we need our farmers, and they need a fair deal from this Labour government.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-tulleys-farm-tulip-fest-cllr-gary-marsh/content_7.html": "Mims Davies MP at Tulleys Farm Tulip Fest with Cllr Gary Marsh\nMims was thrilled to be at Tulleys Farm's stunning Tulip Fest alongside local Councillor Gary Marsh and her dog TJ.\nTulleys' tulip fields, set in the beautiful West Sussex countryside, are a sight to behold. This year, they've planted 1.5 million tulip bulbs, having over 100 different varieties of tulips, early, mid and late bloomers.\nAt no point in the season is the field in full bloom. If you visit early, you’ll see the later varieties in bud, if you visit later in the season then you’ll see the early varieties have lost their petals. They plant lots of rows with mixes, that contain early, mid and late season, which helps to ensure the fields look fabulous for visitors through until they close for the season.\nNEW FOR 2025:\nThis year, Tulleys' Tulip Festival is blooming with exciting new attractions! Visitors can wander through enchanting light-up trails in the woods, where the vibrant beauty of tulips meets the captivating stories of their origins, creating an immersive journey that combines stunning visuals with the rich history of these iconic flowers.\nYou can discover the tranquil charm of Tulipa Lake, offering peaceful waterside views, and stroll along the picturesque Tulip Trail, perfect for serene walks and endless photo opportunities. Don’t miss the chance to capture memories with friends and loved ones with the iconic Whispering Windmill, a favourite festival landmark, while lively roaming street characters bring energy and surprises to every corner of the event.\nAs the sun sets, the magic continues with Tulip Nights, where the fields glow with radiant light under the moonlit sky, transforming the festival into an unforgettable evening of springtime wonder.\nMims Davies MP said:\nIt was an absolutely stunning day out at Tulleys Farm Tulip Fest with Cllr Gary Marsh and my favourite four legged friends - TJ.\nIt was also special to celebrate my TJ's 13th birthday!\n'A Taste of Holland' right on our doorsteps! We're so lucky and they even have new attractions which are perfect for over 15 photo opportunities for lasting memories.\nTheir Tulip Fest also has tasty sweet Dutch treats for you to try, as well as the beautiful Tulip Bar for a quick refreshment, alongside live roaming musicians. A truly magical day out.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_sign-my-newsletter/content_4.html": "Tweet Please fill out the form on the left hand side, or below if you're on a mobile phone, to subscribe to my regular newsletter to see what I'm doing for residents both locally and in Parliament.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-stands-farmers-and-encourages-residents-sign-stop-farm-tax-petition/content_37.html": "Mims Davies MP stands up for Farmers and encourages residents to sign Stop The Farm Tax Petition\nLabour’s family farm tax is going to be devastating for the local farmers here in East Grinstead, Uckfield and the villages. Let alone the thousands of farms beyond our constituency. Families that have farmed will have to sell up as a result.\nAt a time when we need to grow more food in Britain, we need to buy more British food, how can Labour justify this and think this will help.\nPlease see the petition below to sign:\nMims also said in her recent speech during day 2 of the Budget Debate:\nI represent a rural constituency, and it is clear that local farmers will be hit by the changes to inheritance tax—we just need to read the messages from the NFU today. I am afraid that the subterfuge and the hoodwinking of the farming community will be felt not just by Opposition Members, but across everybody’s communities.\nI recently read out in Westminster Hall the words of a local farmer, whose concerns were purely about business confidence at that point. The same farmer wrote to me again this week—I remind the House that farmers are working people, and they work 365 days and 52 weeks a year—to say:\n“My family’s farm and estate are currently economically viable but there is no chance that they would ever produce sufficient cash flow to make it possible for us to cover any significant amounts of inheritance tax. If we are struck by excessive taxation we will no longer be able to produce 7,000,000 litres of milk per annum or timber for the nation. The heritage of 200 years could be gone.”\nFarmers across my constituency are stunned. This is a hammer blow for family businesses, as the shadow Chancellor said, and we will oppose the Budget. It does not fix the foundations; it is a set of dangerous ground works.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_national-campaigns-and-statements/content_24.html": "This page provides a direct link to Campaign replies and statements. Sorted alphabetically by title.\nA\nAssisted Dying Bill November 24\nAssisted Dying Bill - an Update February 25\nAssisted Dying Bill - A Further Update April 25\nAI and the Creative Industries February 25\nB\nBreast Cancer Awareness October 24\nC\nMims Davies MP pledges to raise awareness of unpaid carers in Parliament October 24\nCommunity Cohesion December 24\nProposed Chinese Embassy April 25\nD\nDisability Price Tag campaign November 24\nE\nFuture of the UK-EU Relationship October 24\nEmployment Rights Bill November 24\nEnergy Efficient Homes March 25\nF\nStop The Farm Tax Petition Nov 24\nFurnished Holiday Lettings Tax Regime October 24\nFraud, Error & Debt Bill February 25\nG\nGeneral Election Petition January 25\nH\nHospice Funding Crisis October 24\nHealthy School Meals October 24\nI\nIncome Tax Thresholds November 24\nJ\nK\nL\nLiterary Landscapes January 25\nLive Facial Recognition February 25\nM\nMental Health for Young People November 24\nN\nNature Friendly Planning February 25\nO\nOfficial Development Assistance March 25\nP\nProtecting the Environment & Rewilding September 24\nMims Davies MP letter to Secretary of State on NPPF/Planning Consultation September 24\nProstate Cancer and symptoms to watch out November 24\nPlanning & Infrastructure Bill April 25\nR\nRenters' Rights Bill November 24\nS\nMims Davies MP's letter to Prime Minister re VAT on Private School fees September 24\nSickness & Disability Benefit Reforms January 25\nT\nU\nUK Climate Commitments October 24\nUN Convention on Older People April 25\nV\nVeterans' Compensation March 25\nW\nWinter Fuel Allowance November 24\nWinter Fuel Allowance Update November 24\nWork Capability Assessment Reforms January 25\nWater (Special Measures) Bill March 25\nWater Industry and the Water Bill March 25\nY",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-greyhound-racing/content_43.html": "Let me start by assuring you I take the welfare of all animals, including greyhounds, very seriously. As you may already know, anyone failing to provide for the welfare of a racing greyhound in their care is liable to prosecution under the Animal Welfare Act, as well as enforcement action from the sport’s governing body, the Greyhound Board of Great Britain (GBGB). New legislation came into force in 2021, increasing the maximum sentence for the worst animal cruelty offences from six months to five years.\nThe Welfare of Racing Greyhounds Regulations 2010 were reviewed in 2016 under the previous Government, both by the Department for Environment, Food and Rural Affairs (Defra) and the House of Commons Environment, Food and Rural Affairs Committee. The review found that, judged against their original objectives, the regulations have been broadly effective. The review also identified areas where the industry could take further action, and Defra has worked closely over the last few years with the GBGB to ensure these actions are taken. This includes the annual publication of injury, euthanasia and retirement statistics, and addressing welfare issues at the GBGB affiliated trainers’ kennels. The GBGB's long-term welfare strategy will further promote and protect welfare at all stages of a racing greyhound’s life, not just its racing career. The new Government has confirmed it is monitoring the GBGB’s progress in delivering the strategy. Should further measures and protections be required, I hope that the Government will consider options which are targeted, effective, and proportionate.\nAt present, the British Greyhound Racing Fund collects a voluntary levy from bookmakers which directly supports greyhound welfare and the sport’s integrity. I am aware that around 95 per cent of all licensed betting offices, including those online, are contributing to the voluntary greyhound levy, however, I continue to encourage any remaining bookmakers to follow suit. The Government must ensure that the voluntary contributions reflect the benefits the betting industry derives from Greyhound Racing as a betting product, keeping in mind the important role the levy has in supporting the growth and sustainability of the sport. I understand the GBGB have launched a Keep Welfare On Track campaign, which is calling for all bookmakers to pay a levy that is statutory rather than voluntary.\nThere are 21 licensed stadiums in Great Britain, regulated by the main industry regulatory body, the GBGB. The GBGB has estimated that the British greyhound industry employs over 7,000 people across the country, with an annual turnover estimated at £2.6 billion. In 2019/20, betting on greyhound racing raised £35m through the General Betting Duty, making a significant contribution to our economy.\nThe Welsh Labour Government announced its intentions to ban greyhound racing in Wales on the 18th February. I will follow the progress of the Implementation Group with interest and hope the likely reduction in the amount of money generated from the voluntary levy will not leave vital greyhound welfare charities unfunded, harming former racing greyhounds. I understand the current Culture Secretary, Lisa Nandy MP, has made it clear this Labour Government has no plans to follow in Wales’ footsteps by banning greyhound racing.\nSignificant progress has been made to improve greyhound welfare; I welcome the efforts the sport is making to address the issues which have been raised and will be following any developments in Wales closely as they happen.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_about-mims-davies-mp/content_8.html": "Thrilled to be MP for East Grinstead, Uckfield and our villages with 19,319 residents putting their trust and support in me.\nI am a mum of two, and I have helped to care for my elderly parents through their ill health. I studied Politics at University and was the first person in my family to go, suffer the debts and succeed as a result of the opportunity!\nI served as a Councillor for almost 6 years in Mid Sussex at Parish, Town and District level and a Member of Parliament for a further 4 years in Eastleigh and know what it takes to make a difference in the community. You can find a record of my work in the new section archives on this website. I was very proud to have won twice this seat for our great party. I had a fantastic time doing this job and loved every minute. As my personal circumstances changed during that time, I chose not to rest and so a new candidate could carry the mantel forward. Coming home to Mid Sussex is fantastic as it means I can continue to make a difference in front line politics and be there for my daughters more after my divorce.\nDuring my time as a Councillor and as a keen sportswoman I founded the Mid Sussex Marathon Weekend, with three races run across East Grinstead, Haywards Heath and Burgess Hill, was a member of Haywards Heath Harriers and set up the thriving Haywards Heath Sports Forum. I loved being a Town Councillor and started my time on local councils when I was co-opted onto Hurstpierpoint and Sayers Common Parish Council.\nI have worked in a variety of fields - in retail, hospitality but mainly media, events and communications. Most notably for the AA, BBC and the Police. I most recently worked in Road Safety alongside the Police and their Partners where I helped reduce the number of people killed or seriously injured on the roads. That was a job I truly enjoyed, making a difference in the community and this outcome really matters to me.\nI am in politics as I care about people, community and doing what is right, and know this understanding and commitment is really important in modern politics. I do pride myself on speaking my mind and standing up for all those who need assistance.\nI am continuing my record of hard work, community action and reaching out to those who feel disconnected from politics.\nI love reading, history, creative writing, 80's pop music, pub quizzes, gin and tonics, anything fizzy to drink ideally followed by a curry! I am a member of the National Trust and enjoy getting involved with matters across the community large or small. I like volunteering and have been a trustee of a local veterans' charity.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_my-weekly-column-mid-sussex-times-51/content_14.html": "Wishing everyone a very Happy Easter! You may be aware we were in Parliamentary Recess and I’ve certainly made the most of it meeting lots of businesses, residents, pub owners, local farmers, the NFU, Newick Afternoon Club to listen to their panel discussion for the Assisted Dying Debate, and so much more. From Wivelsfield, and Barcombe, to Pease Pottage, Uckfield, East Grinstead, Scaynes Hill, and Horsted Keynes I’ve many more local engagements booked in my packed-out MP diary.\nOn my first day of Recess, I was pleased to be in Chailey at The Five Bells with Tom, who owns several pubs in our area. We discussed the importance of thriving pubs and the challenging times being faced in hospitality. I’m a strong supporter of our locals, and it's essential they receive the support needed to keep going and thriving. If you can, please support our pubs.\nI was thrilled to join the team at beautiful Bluebell Railway with their stunning carriages. For over 60 years the railway has been the backdrop for hundreds of films, TV dramas, fashion shoots and music videos including Downton Abbey, Black Mirror, SAS Rogue Heroes, Indiana Jones, Gucci photoshoots and more! Bluebell have fantastic events including fish and chip supper trains, luncheons, trainmaster days, and 'brick builders carriage' - a unique brick-building experience in their fantastic carriages on selected trains this Easter holiday! So do get booked in!\nWhat a therapeutic morning it was, as my team and I joined Sheffield Park & Garden volunteering at their new 'Garden for the Future' planting trees. Pippa and her team where offering volunteering slots to help them plant their beautiful trees. If you spare some time and would like to be in a gorgeous garden and marking your mark email - [email protected].\nIf you haven’t already been to Tulleys Farm’s stunning Tulip Field – it’s a must! I’d the pleasure of seeing this incredible local family business which is a tremendous asset to our area and fantastic for first time jobs, wider employment opportunities in the food sector and continues to back our local economy - it was a great day to be there on my dog TJ’s 13th birthday too with local Cllr Gary Marsh.\nI was pleased to join BBC Politics South East last Sunday, discussing the latest political news discussing SEND provision in our area and support for local businesses in East Grinstead, Uckfield, and the villages given the impact National Insurance hikes and business rates.\nDo sign up to my Newsletter via my website to keep up-to-date on the work I’m doing and my to join upcoming ‘Meet Mims’ Q&A events or head to my social media for more updates.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_category_Christmas-Advent-Calendar-2023/content_11.html": "On the 25th Day of Christmas, Mims Davies MP presents - Headway Sussex 25th December 2023 It's Christmas Day! On the 25th Day of Christmas, Mims Davies MP presents - Headway Sussex This year, Mims chose the fantastic charity, Headway Sussex, and... Christmas Advent Calendar 2023\nOn the 24th Day of Christmas, Mims Davies MP presents - Cats Protection and Jupps 24th December 2023 It's Christmas Eve! On the 24th Day of Christmas, Mims Davies MP presents - Cats Protection and Jupps Fish and Chips Mims Davies MP was pleased to visit Cats... Christmas Advent Calendar 2023\nOn the 23rd Day of Christmas, Mims Davies MP presents - Upmarket American Diner 23rd December 2023 On the 23rd Day of Christmas, Mims Davies MP presents - Upmarket American Diner This Café and Emporium Café serves a selection of foods, including homemade... Christmas Advent Calendar 2023\nOn the 22nd Day of Christmas, Mims Davies MP presents - Servo Wealth 22nd December 2023 On the 22nd Day of Christmas, Mims Davies MP presents - Servo Wealth Servo Private wealth work with wealthy families, high net worth individuals, business... Christmas Advent Calendar 2023\nOn the 21st Day of Christmas, Mims Davies MP presents - Basepoint 21st December 2023 On the 21st Day of Christmas, Mims Davies MP presents - Basepoint Basepoint Haywards Heath, built in partnership with Mid Sussex District Council and West... Christmas Advent Calendar 2023\nOn the 20th Day of Christmas, Mims Davies MP presents - Stoner's Jewellery 20th December 2023 On the 20th Day of Christmas, Mims Davies MP presents - Stoner's Jewellery A much loved and valued Fantastic independent local business that has been in Burgess... Christmas Advent Calendar 2023\nOn the 19th Day of Christmas, Mims Davies MP presents - ITL Integrated Tools Ltd 19th December 2023 On the 19th Day of Christmas, Mims Davies MP presents - ITL Integrated Tools Ltd Insulated Tools Ltd have a 45 year track record of producing insulated tools to... Christmas Advent Calendar 2023\nOn the 18th Day of Christmas, Mims Davies MP presents - Little Orchid 18th December 2023 On the 18th Day of Christmas, Mims Davies MP presents - Little Orchid Little Orchid is a friendly, professional hair styling service based in Mid- Sussex... Christmas Advent Calendar 2023\nOn the 17th Day of Christmas, Mims Davies MP presents - Vim Albourne and Jigsaw 17th December 2023 On the 17th Day of Christmas, Mims Davies MP presents - Vim Albourne and Jigsaw VIM is a specialist provider of neurological and musculoskeletal healthcare (MSK... Christmas Advent Calendar 2023",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_cdn-cgi_l_email-protection/content_60.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-statement-turing-scheme/content_48.html": "I am pleased that the Turing Scheme has been at the heart of the UK’s post-Brexit vision where young people have greater opportunity to experience other cultures and learn vital skills for life and work, regardless of their background.\nThe Turing Scheme gives students the chance to develop new skills, gain vital international experience and boost their employability.\nSince its introduction following the UK's departure from the Erasmus+ programme, the Turing Scheme has provided funding to support more than 160,000 international placements. In addition to travel and living costs, for students from disadvantaged backgrounds, the Turing Scheme covers items that students may need to be able to travel, including vaccinations, visa applications, passports and insurance costs. For the 2024/25 academic year, over £105 million has been allocated to send more than 43,000 students from across the UK on study and work placements around the world.\nThe Turing Scheme has significant advantages over the Erasmus+ programme, with higher numbers of students from disadvantaged backgrounds able to study abroad. In 2014/15, those with parents in managerial or professional occupations from the UK were taking part in Erasmus+ at a rate 50 per cent higher than those whose parents had working-class jobs. By contrast, under the Turing Scheme, nearly two-thirds of participants this academic year are from disadvantaged backgrounds.\nResearch published in January 2024 shows that in its first year alone, the scheme has strengthened partnerships across the globe, beyond Europe. Now in its third year, the scheme has gone from strength to strength with the latest figures showing that more than 40,000 students are set to benefit in 2023/24 academic year, 60 per cent of which are from disadvantaged backgrounds or underrepresented groups. This includes around 1,800 additional students from disadvantaged backgrounds in the further education sector alone compared to last year.\nThe report also highlights how the scheme has supported universities, colleges and schools across the country to strengthen existing partnerships and develop links with a wider range of countries such as the USA, Japan and Canada, not just EU countries. Students reported benefits including a significant improvement in both skills and academic knowledge, and the opportunity to experience different cultures, fostering a richer international outlook that goes beyond traditional classroom learning.\nOverall, I believe the Turing Scheme is widening access to international opportunities, and I am pleased the Government has committed to reinvesting in it.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_news_mims-davies-mp-pleased-meet-local-businesses-uckfield-discussing-recent-challenges/content_20.html": "Mims Davies MP pleased to meet with Local Businesses in Uckfield discussing recent challenges\nMims was pleased to be in Uckfield on Friday meeting with Partners 4 Training and Claire from Claire Davies Hairdressing Ltd.\nClaire's is based in Uckfield with its warm and friendly atmosphere, aiming to inspire the whole family because their team welcomes all ages. Their aim is to ensure that everyone leaves the salon feeling and looking their best.\nClaire's has been established for decades and commits to continued training, ensuring her whole team offers unbeatable expertise to ensure hair services and treatments are tailor-made for your specific needs:\nhttp://www.clairedavieshairdressinguckfield.co.uk/index.html\nPartners 4 Training are a Private Work Based Training Academy, VTCT Approved, Specialising in Training Courses for Hairdressing, Barbering and Beauty Therapy. They've been Established since 2003 and have achieved fantastic results for all of their courses and are even up for an award.\nTheir classes are small and friendly, ensuring you get individual attention with high quality salon surroundings, in a relaxed atmosphere with supportive and approachable staff that all work within the industry:\nhttps://www.partners4training.co.uk\nMims was recently on BBC Politics South East discussing the difficulties businesses are facing due to Labour's hikes, the Employment Rights bill, Jobs tax rise, and how MPs can better support them.\nMims Davies MP said:\nI was so pleased to be in Uckfield on Friday meeting with local businesses.\nI met with Partners 4 Training and Claire, owner of Claire Davies Hairdressing who spoke with me about the real challenges they’re facing and just how tough it is with the recent increase in business costs.\nThank you both for your incredibly hard work and for speaking with me.\nAnd huge congratulations to Partners 4 Training who are up for an amazing award - Large Independent Training Provider of the Year! Keeping everything crossed for you.\nI know times are tough right now, but if you can, please do go out and support our local businesses here on our high streets in East Grinstead, Uckfield, and the villages.",
  "https_www_mimsdavies_org_uk_/https_www_mimsdavies_org_uk_events_feed/content_23.html": null
}