{
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_category_Articles/content_24.html": "Latest column: Labour plans to bulldoze green belt 19th March 2025 Peter Fortune MP's latest column in the News Shopper. We need to build more homes for the next generation. Renting a flat, let alone buying a house, is too... Articles\nLatest column: Labour threat to Bromley and Biggin Hill schools 19th February 2025 Peter Fortune MP's latest column in the News Shopper. Our country faces some significant challenges from falling economic confidence to out of control... Articles\nLatest column: Labour's job tax will hit Bromley and Biggin Hill 29th January 2025 Peter Fortune MP's latest column in the News Shopper. Employers locally face tough choices this year. Every business, charity, and organisation I speak to... Articles\nLatest column: My plan for 2025 2nd January 2025 Peter Fortune MP's latest column in the News Shopper. A new year means new resolutions for the months ahead. For 2025, I'm avoiding the easily breakable... Articles\nPeter Fortune: I'll fight against Labour's tax on our schools 28th June 2024 I’ll back our fantastic schools and fight Labour’s damaging plans to tax private education. Schools in Bromley and Biggin Hill need fairer funding, not “bigger... Articles\nPeter Fortune: I'll ensure young people can get on the property ladder 28th June 2024 Bromley and Biggin Hill are wonderful places to live, but rents are too high, and homeownership is out of reach. I’ll back plans to get London building to house... Articles\nPeter Fortune: I'll be your local voice in Parliament 28th June 2024 I’m the only candidate for Bromley and Biggin Hill who is local with a track record of service and delivery. The choice is clear: Sadiq Khan’s Labour candidate... Articles\nPeter Fortune: I'll protect our green belt 28th June 2024 The Labour Party wants to \"flatten the green belt\" in Bromley and Biggin Hill. Don't let them. As your next Conservative MP, I'll protect the green belt while... Articles\nPeter Fortune: I'll end this war on motorists 28th June 2024 I stood up to Sadiq Khan in City Hall. Now, I'm standing for Parliament to end Labour's highway robbery. If you elect me as the next Conservative MP for Bromley... Articles",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_northpoint-residents-deserve-help-fire-safety-costs/content_12.html": "Peter Fortune MP this week urged the Government to help reimburse Northpoint residents who have faced financially ruinous costs after finding dangerous cladding.\nAfter the Grenfell Tower tragedy, Northpoint was one of the buildings found to be clad in the same dangerous material, aluminium composite material. While the Conservative government's remediation fund paid for the cladding to be removed and replaced, leasehold residents faced over £700,000 in costs for waking watches, fire wardens and alarms until the work was completed.\nIn a question to the Building Safety Minister Alex Norris, Peter Fortune MP asked the Government what steps it will take to reimburse residents.\nYou can watch here: https://youtu.be/aXEFceYafaM",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_category_Opinions/content_28.html": "Latest column: Labour is squeezing Bromley motorists 16th April 2025 Peter Fortune MP's latest column in the News Shopper. Labour is squeezing Bromley motorists. Driving charges in London can now cost up to £40 a day, but even... Opinions",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news/content_4.html": "Latest column: Labour is squeezing Bromley motorists Wednesday, 16 April, 2025 Peter Fortune MP's latest column in the News Shopper. Labour is squeezing Bromley motorists. Driving charges in London can now cost up to £40 a day, but even more if you are a van driver. That's because Sadiq Khan has imposed a new toll on the Blackwall Tunnel this month — ending over a century of free crossings. For cars crossing at peak times, the toll will cost them £8 a day for a trip across... Opinions\nLatest column: Labour plans to bulldoze green belt 19th March 2025 Peter Fortune MP's latest column in the News Shopper. We need to build more homes for the next generation. Renting a flat, let alone buying a house, is too... Articles\nUpdate on wrongful fines at Bromley South rail station 13th March 2025 Bromley and Biggin Hill MP Peter Fortune said: \"Several people have contacted me recently regarding wrongful fines for stopping on the access road next to... Local News\nPeter Fortune MP on BBC's Politics London 9th March 2025 Bromley and Biggin Hill MP Peter Fortune appeared on BBC's Politics London to discuss Labour's housing policies, a new report showing boys are in crisis, and... Media\nPeter Fortune MP: Labour is taxing British businesses to the brink 5th March 2025 Peter Fortune MP stood up for the nearly 4,800 small businesses across Bromley and Biggin Hill in Parliament today. In the House of Commons, Mr Fortune told the... Speeches\nPeter Fortune MP launches Small Business Survey 4th March 2025 Bromley and Biggin Hill MP Peter Fortune has launched a survey of small businesses and traders to understand their priorities and challenges. There are nearly 4... Local News\nPeter Fortune MP votes against Labour's family business tax 26th February 2025 Peter Fortune MP today voted to stop Labour's assault on family businesses across Bromley and Biggin Hill. The Conservatives tabled a motion in Parliament today... Speeches in Parliament\nLatest column: Labour threat to Bromley and Biggin Hill schools 19th February 2025 Peter Fortune MP's latest column in the News Shopper. Our country faces some significant challenges from falling economic confidence to out of control... Articles\nLatest column: Labour's job tax will hit Bromley and Biggin Hill 29th January 2025 Peter Fortune MP's latest column in the News Shopper. Employers locally face tough choices this year. Every business, charity, and organisation I speak to... Articles\nNorthpoint residents deserve help with fire safety costs 23rd January 2025 Peter Fortune MP this week urged the Government to help reimburse Northpoint residents who have faced financially ruinous costs after finding dangerous cladding... Local News",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_privacy/content_18.html": "This document outlines how Peter Fortune processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Peter Fortune\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Peter Fortune.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Peter Fortune, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Peter Fortune via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_my-plan/content_16.html": "I'm Peter Fortune. I served Bromley for 14 years as a local Councillor in Hayes & Coney Hall and stood up against Sadiq Khan in City Hall. Now, I'm standing up for you as your Member of Parliament for Bromley and Biggin Hill.\nI have a strong record of delivery across Bromley and Biggin Hill. I was the Deputy Leader of Bromley Council, responsible for transforming our local children's services to become 'Good' with 'Outstanding Leadership'. As your London Assembly Member, I stood up against Sadiq Khan and his ULEZ expansion. I've served my country, and community and will be a strong voice for you in Parliament.\nI'll campaign for more funding for our schools\nWe are lucky to have so many wonderful local schools. When I was Bromley's Lead Councillor for Education, I fought hard to support our schools and was proud that they were all rated 'Good' or 'Outstanding'. But I know the struggles some face. Historic unfairness in school funding means they don't get the money they deserve. I'll fight for fairer school funding to help our young people succeed.\nProtect our green spaces\nBromley and Biggin Hill is a great place to enjoy our beautiful countryside. Not only that, but our brilliant green spaces like Norman Park, Churchill Gardens and the surrounding green belt protect our local environment and make this a fantastic place to live, work and raise a family. I'll fight any attempt to weaken or damage green belt protections.\nI stood up to Labour Mayor, Sadiq Khan, and fought against the ULEZ expansion\nI led the fight against Labour's damaging £12.50 a day driving charge. People in rural areas like Biggin Hill rely on their cars to get around, see family and friends, run their small businesses, and get to work. Sadiq Khan is now working on new road pricing schemes which will make you pay more. I'll continue to fight Labour's highway robbery.\nSupporting local businesses\nWe have many fantastic businesses in Bromley and Biggin Hill, from small family-run ventures to huge multinational companies. I want to ensure our area is a great place to start and grow a business and that we have sufficient transport infrastructure to support a growing economy.\nHousing a new generation\nWe need more suitable and appropriate housing. I want every young person to have the chance to buy their own home or rent affordably. I'll fight for more family housing and against inappropriate high-rise blocks protecting the unique character of Bromley and Biggin Hill.\nInvesting in our NHS\nI've worked in social care and know how vital a well-supported social care system is for families and communities. Due to Government investment, our NHS trust has benefitted from 110 more doctors, 187 more nurses, and 41 more GPs. We're also building a new £20 million endoscopy unit at the Princess Royal University Hospital. But we need to do more. I'll fight for more investment to improve patient care, fund social care, and cut waiting lists locally.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_update-wrongful-fines-bromley-south-rail-station/content_7.html": "Bromley and Biggin Hill MP Peter Fortune said: \"Several people have contacted me recently regarding wrongful fines for stopping on the access road next to Bromley South rail station.\n\"I raised this issue with the Metropolitan Police, who own the road and instructed Britannia Parking to enforce the double yellow lines outside Bromley Police Station. They made this decision due to the congestion caused by drivers making rail station pick-ups and drop-offs that delayed and blocked police vehicles leaving the station. It's not within Bromley Council's responsibilities as it's a privately owned road.\n\"However, some drivers have been wrongfully fined for stopping on the road when entering the Waitrose. Britannia Parking has installed a new camera to prevent this confusion in the future. I encourage drivers who were wrongfully fined to appeal any penalty charge notices they may have received directly from them.\n\"I look forward to meeting Network Rail and Southeastern soon to discuss access at Bromley South rail station.\"",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_latest-column-winter-fuel-payments/content_20.html": "Peter Fortune MP's latest column in the News Shopper.\nTemperatures are plummeting, and energy bills are rising again. The Government's decision to strip winter fuel payments from more than ten million pensioners will leave many in the cold this winter.\nOver 50,000 people across the London Borough of Bromley have lost up to £300 of energy bill support this winter. While some wealthy pensioners may be able to absorb the blow, many others worried about the cost of living will not.\nThe Government knows the benefit cut will push up pensioner poverty. New figures show 100,000 more pensioners will soon be living in relative poverty. We also know from charities that some pensioners will not survive this winter if they cannot heat their homes.\nIt's a cruel decision and a surprise. After all, Gordon Brown created the winter fuel payment to tackle pension poverty when he was Chancellor. Every Conservative government since has protected it. But this new Labour government's first action in office was to slash it.\nThe welfare cut comes at a terrible time. Despite Labour's election promise to cut energy costs by £300, these bills are increasing again.\nEnergy bills for the typical home are 10% higher this winter, costing people £149 more to stay warm and turn on the lights. The energy regulator has confirmed that bills will rise again from January to £1,738. This is driving inflation up again, which means higher shop prices.\nWith bills rising and support removed, many pensioners locally are worried this winter. I've spoken to constituents who are fearful they cannot make ends meet without the winter fuel payment. Others are worried about their elderly relative, who they know is struggling.\nOver half a million people have signed Age UK's petition to save the winter fuel payment. In Parliament, Conservative MPs, including myself, forced a vote on the change. One of my first votes on behalf of Bromley and Biggin Hill was to keep the payments. But sadly, Labour MPs overwhelmingly voted to approve the welfare cut, and the Chancellor refused to reconsider the cut in her Budget.\nWhat can we do now? As one of Bromley borough's two Conservative MPs, I will continue campaigning to restore winter fuel payments. But I am also urging everyone over state pension age or anyone concerned about elderly family members to check if they are eligible for Pension Credit.\nThis benefit is worth over £3,900, but a million pensioners entitled to receive it haven't signed up. If you think you might be eligible, there is support to apply. Age UK is a brilliant charity that can help with a free advice line on 0800 678 1602, and Citizens Advice also offers superb support on 0800 144 8848.\nI do not understand Labour's decision. The Government has cut winter fuel payments to save £1.5 billion, claiming it cannot afford them. However, the Budget raises taxes by £40 billion and increases public spending by £70 billion. Our country can afford to keep pensioners warm. Sadly, this Government is the first in nearly thirty years to choose not to.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_latest-column-labour-threat-bromley-and-biggin-hill-schools/content_9.html": "Peter Fortune MP's latest column in the News Shopper.\nOur country faces some significant challenges from falling economic confidence to out of control immigration. This is what should be keeping Labour politicians up at night. Especially as the Chancellor’s job-cutting Budget starts to bite businesses across the country, and illegal channel crossings increase by a third on their watch.\nWith so much to do and so many of their policies going wrong, one thing Labour ministers should avoid is meddling with what isn’t broken. Yet that’s precisely what Education Secretary Bridget Phillipson is doing with her ill-considered Schools Bill - and it will impact schools across Bromley and Biggin Hill.\nThis rushed legislation attempts to solve a problem that doesn’t exist. Phillipson claims it will increase educational standards, but England’s schools are already some of the best in the world. Our schools are ranked seventh best globally for maths and ninth for reading and science. Over a decade ago, under the last Labour government, they languished in the 21st, 19th, and 11th positions, respectively.\nThere are undoubtedly challenges in education, not least in recruiting more teachers and improving the provision for children with special educational needs. However, the Schools Bill will not solve these challenges. Instead, it’s undoing decades of progress by stripping school leaders and teachers of the freedoms they need to drive up educational standards.\nLabour’s legislation will strip schools of freedoms over curriculum and staffing. Superb schools that have crafted knowledge-rich curriculums must return to a national agenda set by Whitehall despite outperforming other schools. Headteachers will be stripped of the power to hire excellent teachers from independent schools or overseas because they don’t have Qualified Teacher Status, adding to teacher shortages and the cost of recruitment.\nThree local schools almost faced pay cuts because Labour’s initial plans would stop schools from varying teachers' pay. Luckily, following our Conservative campaign in Parliament, they amended their plans to halt academies paying teachers more. But this is one minor improvement of a still poor bill.\nWhenever I go into a school locally - whether they are independent embattled by Labour’s new education tax or academies worried about losing their freedoms - everyone seems baffled by Labour’s plans. Nor have I heard a convincing argument from a Labour MP in Parliament for why taxing and putting a straight-jacket on schools is a good idea.\nLocally, we’ve seen our schools go from strength to strength. In July 2024, Ofsted ranked 96% of schools in the Bromley and Biggin Hill constituency as ‘good’ or ‘outstanding’. Soon we will not be able to so easily tell how our schools are doing as Labour is axing Ofsted’s rating system; this is good news for Labour who risk crashing educational standards but bad news for parents choosing schools.\nWhen state schools are thriving, educational standards are higher than ever, and independent schools are easing the pressure and providing sports facilities to communities, Labour’s policies can only be described as one thing: thoughtless vandalism that must be dropped.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_category_Westminster-News/content_27.html": "Why I voted no to the Assisted Dying Bill 29th November 2024 Today, I voted against a private members' bill that would legalise assisted suicide for terminally ill adults expected to pass away within six months. It was a... Westminster News\nPeter Fortune MP asks Labour to rule out pay-per-mile road pricing in London 21st November 2024 Today, Peter Fortune MP urged the Transport Secretary Louise Haigh to discourage London Mayor Sadiq Khan from introducing road pricing. Peter's question comes... Westminster News\nPeter Fortune MP delivers maiden speech 11th September 2024 Peter Fortune MP delivered his maiden speech in Parliament today during the debate on building safety and resilience. Westminster News\nWhy I voted to keep winter fuel payments 10th September 2024 Today in Parliament, I voted against Labour's proposal to cut winter fuel payments for more than 10 million pensioners. The Government attempted to force the... Westminster News",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_school-visits/content_13.html": "Every year, MPs welcome hundreds of schoolchildren to Parliament and I am always tries to meet visitors from the constituency to talk about the politics and history of Westminster, the work of an MP and about local issues.\nIf you would like to book a tour of the Palace of Westminster, please contact my office.\nTours can be booked for groups of 20 people and repeated tours from the same school are acceptable. Unfortunately, I cannot meet travel costs.\nFor more details, such as the best times to arrange a tour of Parliament, please visit www.parliament.uk/visiting/visiting-and-tours/ukvisitors. Please be aware that tours do need to be booked months in advance.\nThere are also free educational visits which, in addition to a tour of the Palace, offer children and students the chance to learn more about Parliament through interactive workshops. There is also a travel subsidy available to state schools which could cover up to 75% of your travel costs.\nAll bookings are made by phone, one school term in advance, on a given date. To make a booking for an educational visit, please visit www.parliament.uk/education/visiting-parliament.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_about-rss/content_14.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_map-locations/content_25.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_peter-fortune-mp-launches-small-business-survey/content_23.html": "Bromley and Biggin Hill MP Peter Fortune has launched a survey of small businesses and traders to understand their priorities and challenges.\nThere are nearly 4,800 small businesses and traders locally. But they face significant challenges, from shoplifting and tool theft to rising taxes and business rates, that threaten jobs, local growth and our high streets.\nThe survey results will inform Peter's work in Parliament and local campaigns as part of his work to deliver for Bromley and Biggin Hill. If you are a trader or own a small business employing fewer than 50 people, complete the survey today.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_category_Speeches/content_15.html": "Peter Fortune MP: Labour is taxing British businesses to the brink 5th March 2025 Peter Fortune MP stood up for the nearly 4,800 small businesses across Bromley and Biggin Hill in Parliament today. In the House of Commons, Mr Fortune told the... Speeches",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_work-experience/content_29.html": "I offer work experience opportunities to students from the constituency. The placement gives young people an insight in to local politics and a chance to boost their skills. Students will be able to help with a number of tasks:\n- Casework, depending on the age and ability of the student\n- Researching an issue\n- Taking press-cuttings\n- Writing press releases\n- Accompanying the MP to a meeting or event in the House or in the Constituency\n- Assisting with office duties\n- Answering queries from constituents, either by 'phone or by email\nPlease contact us to enquire about work experience in my office.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_category_Media/content_22.html": "Peter Fortune MP on BBC's Politics London 9th March 2025 Bromley and Biggin Hill MP Peter Fortune appeared on BBC's Politics London to discuss Labour's housing policies, a new report showing boys are in crisis, and... Media\nPeter Fortune MP on BBC's Politics London 16th December 2024 Bromley and Biggin Hill MP Peter Fortune appeared on BBC's Politics London to discuss Labour's winter fuel payments cut, damaging housing plans, and rising... Media",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk/content_1.html": "Your Member of Parliament for Bromley and Biggin Hill\nMy name is Peter Fortune, and I am the local Conservative MP for Bromley and Biggin Hill. Here you can find my news, campaigns, and more about me. I'm here to help, so please don't hesitate to get in touch.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_events_feed/content_21.html": null,
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_cookies/content_26.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_category_Local-News/content_6.html": "Update on wrongful fines at Bromley South rail station 13th March 2025 Bromley and Biggin Hill MP Peter Fortune said: \"Several people have contacted me recently regarding wrongful fines for stopping on the access road next to... Local News\nPeter Fortune MP launches Small Business Survey 4th March 2025 Bromley and Biggin Hill MP Peter Fortune has launched a survey of small businesses and traders to understand their priorities and challenges. There are nearly 4... Local News\nNorthpoint residents deserve help with fire safety costs 23rd January 2025 Peter Fortune MP this week urged the Government to help reimburse Northpoint residents who have faced financially ruinous costs after finding dangerous cladding... Local News\nOur country can afford to keep pensioners warm 10th December 2024 Bromley and Biggin Hill MP Peter Fortune talked to local pensioner Dennis in Hayes today about Labour's decision to cut winter fuel payments for millions of... Local News\nPeter Fortune MP urges Chancellor to protect Bromley pothole funding 28th November 2024 Peter Fortune MP today urged the Chancellor to continue the previous Government's plan to invest £8.2 billion in repairing the nation's roads until 2034 using... Local News\nBiggin Hill: Water Supply Update 28th November 2024 Peter Fortune MP is in regular contact with Thames Water about the water supply issues in Biggin Hill. Please find the latest update below. If you or your... Local News\nLatest column: Winter Fuel Payments 27th November 2024 Peter Fortune MP's latest column in the News Shopper. Temperatures are plummeting, and energy bills are rising again. The Government's decision to strip winter... Local News\nPeter Fortune MP lays wreath at Bromley War Memorial 11th November 2024 Peter Fortune MP attended the Remembrance Sunday service at Bromley Parish Church with civic leaders, including the Mayor of Bromley, Councillor Dr David... Local News\nPeter Fortune MP backs campaign to commemorate local heroes 8th November 2024 Bromley and Biggin Hill MP Peter Fortune has today backed a campaign to commemorate the brave pilots and navigators of the Photo Reconnaissance Units (PRU)... Local News",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_accessibility/content_3.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_latest-column-labour-squeezing-bromley-motorists/content_2.html": "Peter Fortune MP's latest column in the News Shopper.\nLabour is squeezing Bromley motorists. Driving charges in London can now cost up to £40 a day, but even more if you are a van driver. That's because Sadiq Khan has imposed a new toll on the Blackwall Tunnel this month — ending over a century of free crossings.\nFor cars crossing at peak times, the toll will cost them £8 a day for a trip across the river and back. But for van drivers, the bill will be £13. That's on top of Labour's expanded Ulez and the congestion charge, fuel costs and parking charges. It's becoming simply impossible for people to drive to work in London, impacting everyone reliant on driving, from tradesmen to NHS workers on shifts.\nThe opening of the Silvertown Tunnel is welcome, as is the news that the Lower Thames Crossing has been approved. The idea of tolls to pay for new infrastructure makes sense. But the Blackwall Tunnel is hardly new; it's 128 years old. And as we know, once tolls are introduced, they don't stop. The Dartford Crossing was paid for two decades ago, but Labour kept the toll.\nThere's now only one free crossing east of Tower Bridge at Rotherhithe. But how long will Sadiq Khan keep it free? It's also been over a decade since the Dart Charge was increased. But it's easy to see a financially irresponsible Labour government increasing it to raise more money. There's also the elephant in the room: Sadiq Khan's plan for pay-per-mile road charging.\nAs a London Assembly Member, I worked to expose Mayor Khan's preparations for road pricing in London, which London Centric fully exposed late last year. Under Labour's plans, motorists could be charged 40p per mile for driving in Outer London, 60p per mile in Inner London, and £2 per mile with a £5 fee for Central London.\nThis would be hugely damaging for communities like Bromley and Biggin Hill, where people are highly reliant on cars. Speaking to Labour politicians across the capital in Parliament and previously in City Hall, they don't understand what life is like in a London suburb.\nWe don't have the London Underground or District Light Railway. Biggin Hill doesn't even have a train station, much to the surprise of one Labour figure who I recently debated on the BBC's Politics London.\nBut this is exactly the sort of thing that a Labour government would be tempted to introduce, either in cities or nationally. After all, Sadiq Khan's former Deputy Mayor for Transport, Heidi Alexander, who oversaw the initial expansion of Ulez, is now the Secretary of State for Transport.\nIf the economy continues to slow under Labour's tax rises and red tape —which will cost employers over £1,000 a year more per employee — they'll look to Sadiq Khan's anti-motorist policies to raise money. As your MP, I'll be fighting to ensure they do not use driving charges to squeeze more money from working people locally.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_peter-fortune-mp-backs-campaign-commemorate-local-heroes/content_19.html": "Bromley and Biggin Hill MP Peter Fortune has today backed a campaign to commemorate the brave pilots and navigators of the Photo Reconnaissance Units (PRU) during the Second World War, including two local heroes, Anthony Brown and Nigel Bottome.\nThe covert intelligence operations flown by PRU pilots and navigators were critical to the war effort but had one of the lowest life survival rates. Peter has joined calls for a national monument to commemorate their service. Over 1,700 pilots are thought to have flown the missions, including two Bromley residents, Brown and Bottome.\nHe also backs the Spitfire AA810 Project to restore the plane last flown by Alastair \"Sandy\" Gun as a living memorial, which crashed on a PRU mission over Norway. After the crash, Sandy was captured and sent to Stalag Luft III, where he helped dig the tunnel 'Harry' to escape the prisoner-of-war camp immortalised in the film 'The Great Escape' before he was sadly caught and executed on 6th April 1944 at the age of 24.\nPeter laid a tribute in memory of Brown and Bottome at the poppy garden in Parliament, where every MP plants a poppy on behalf of their constituents in memory of all who served.\nPeter said: \"Photo reconnaissance was one of the riskiest operations during the war. Nearly half of the pilots who flew these missions lost their lives, flying planes stripped of armour and guns to carry cameras deep into enemy territory.\n\"The life expectancy of pilots in PRU was only two and a half months. But thanks to their bravery, over 26 million images of enemy operations and installations were taken. This intelligence was critical to defending our country's freedom and defeating the Nazi war machine, aiding critical operations from D-Day to the Dambusters Raid. However, there is no national memorial for these pilots.\n\"I'm supporting the Spitfire AA810 Project to memorialise these brave pilots, remembering the service of Bromley pilots Brown and Bottome, who flew these dangerous missions and survived the war.\nIf you are a relative of Brown or Bottome, please get in touch, as the Spitfire AA810 Project would like to learn more about their post-war lives as part of their work to commemorate these pilots.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_cdn-cgi_l_email-protection/content_5.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_category_Speeches-in-Parliament/content_30.html": "Peter Fortune MP votes against Labour's family business tax 26th February 2025 Peter Fortune MP today voted to stop Labour's assault on family businesses across Bromley and Biggin Hill. The Conservatives tabled a motion in Parliament today... Speeches in Parliament\nPeter Fortune MP: Labour is vandalising education 9th January 2025 Peter Fortune, MP, has warned that Labour's plans to strip schools of freedom over pay, curriculum, and staffing could cause school standards to slip across... Speeches in Parliament\nLabour's education tax will impact thousands locally 8th October 2024 Labour's plan to impose VAT on independent schools will impact thousands of pupils locally and put state schools under pressure, warned Peter Fortune MP as he... Speeches in Parliament",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_parliament/content_11.html": "Tweet Here, you can see Peter's speeches and appearances in Parliament (provided by theyworkforyou):-",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_meet-peter-fortune/content_17.html": "Peter was elected as the Member of Parliament for Bromley and Biggin Hill in July 2024. He has lived in Bromley with his wife and family for nearly 20 years, serving the community as a local councillor and then as a London Assembly Member.\nHe grew up on a council estate in Lambeth and attended Bishop Thomas Grant School in Streatham, South London. After leaving school, he worked in the UK and abroad before moving to Bromley to start a family. He then worked at the News Shopper and other local media titles while his wife taught at local primary schools.\nIn May 2010, Peter was first elected as a Bromley councillor representing Cray Valley East (2010-14). He then served Hayes and Coney Hall (2014-21). He was Deputy Leader of Bromley Council and Portfolio Holder for Children, Education and Families, leading the transformation of Children's Services, which received an Ofsted grade of 'Good' with 'Outstanding Leadership' in 2019.\nPeter then served as the London Assembly Member for Bexley and Bromley until 2024. During this time, he served as the Deputy Leader of the Conservative Group, Chairman of the Budget and Performance Committee, and Deputy Chairman of the Planning and Regeneration Committee.",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_peter-fortune-mp-votes-against-labours-family-business-tax/content_10.html": "Peter Fortune MP today voted to stop Labour's assault on family businesses across Bromley and Biggin Hill.\nThe Conservatives tabled a motion in Parliament today calling on the Government to support family businesses and reverse its tax rises, including changes to employers' national insurance contributions, business rates, and business property relief.\nIn the House of Commons, Mr Fortune said: \"Britain's economy is stuttering because of this Government's failing policies. A family business tax to break up thriving enterprises. A jobs tax to make it more expensive for businesses to employee people. A business rate hike to squeeze the already struggling British high street.\n\"Every employer I speak to in my constituency of Bromley and Biggin Hill tells me they have no choice but to cut jobs, wages, and investment. That's true whether it's a nursery in Bromley Common, a large franchisee on Bromley High Street or a charity serving our borough. This is what an anti-business government looks like, not a pro-growth one.\n\"Britain cannot afford Labour's assault on family businesses.\"",
  "https_www_peterfortune_co_uk_/https_www_peterfortune_co_uk_news_biggin-hill-water-supply-update/content_8.html": "Peter Fortune MP is in regular contact with Thames Water about the water supply issues in Biggin Hill. Please find the latest update below. If you or your family need help, please email [email protected].\n----\nSunday 01 December - Morning update\nI've received a further update from Thames Water this morning on Biggin Hill's water supply.\nI'm told only two homes are still experiencing interruptions in their supply, and 85 more have low pressure.\nThames Water fixed the water main overnight, allowing the local reservoir to start refilling. This process will continue throughout the day, increasing supply. In the meantime, tankers will inject more water into the network.\nWhen running your tap for the first time, you may notice cloudy water. This is normal and does not pose a health risk; it will clear if you run it for a short time.\nThe bottled water station reopened at 9am in the Waitrose car park this morning.\nSaturday 30 November - Morning update\nI've received a new update from Thames Water about the water supply in Biggin Hill.\nAfter rerouting water in the pipe network and using tankers, most of the 2000-plus homes impacted now have water again. However, I'm told 120 homes remain affected.\nThames Water has narrowed down the location of the burst to a 900-meter length of pipe in the Grays Road area. After further testing, they should be able to determine the exact location and fix the pipe. This may disrupt Grays Road.\nUntil the pipe is fixed, Thames Water will use tankers to pump water into the network to supply the remaining properties. In the meantime, bottled water will be delivered to these homes.\nFriday, 29 November - Morning update\nThis morning, Thames Water provided another update about the water supply problems affecting homes in Biggin Hill.\nThanks to overnight work, many homes now have water again. However, due to the area's topography and the complicated nature of the network, some properties in higher areas are still without water.\nThames Water expects some homes to experience low water pressure and potentially briefly drop out again. However, I am told this will be temporary.\nI’m told extra tankers are being brought into the area to increase the network's pressure.\nSome homes experience cloudy water when their supplies come back. Thames Water says this is perfectly normal and poses no health risks. If you run your taps for a short period, the water will clear.\nThe bottled water station at the Waitrose car park reopened this morning. Thames Water will also continue to deliver bottled water to customers on its Priority Service Register.\nThursday, 28 November - Evening update\nI have spoken to Thames Water this evening regarding the ongoing water supply problems affecting Biggin Hill.\nEngineers have found that a 10-inch mains pipe from Knockholt burst suddenly, causing the outage. I'm told they can now rezone the pipe network and restore water tomorrow.\nHowever, Thames Water has warned that the land's topography means several homes may still experience intermittent supply disruptions or low water pressure. I have asked how long this might last.\nUntil fixed, Thames Water will continue to provide bottled water, with the station at Waitrose car park remaining open until 9pm. They are looking for a second location for another bottled water station. Thames Water is still delivering bottled water directly to vulnerable residents.\nI will post more updates as soon as I receive them.\nThursday, 28 November - Afternoon update\nThis afternoon, I received a further update from Thames Water regarding bottled water supplies for affected homes.\nThames Water has opened a bottled water station at the Waitrose car park in Biggin Hill. I understand they've dispatched two lorries with bottled water for residents affected by supply outages.\nAs the car park is small, the station is creating heavy congestion on Main Road in Biggin Hill. Four Thames Water staff members are on-site to help limit disruption and distribute supplies.\nThey are still attempting to identify the problem.\nI will post more updates as soon as I receive them.\nThursday, 28 November - Morning update\nThames Water updated me this morning about the supply outage, which I understand is affecting some homes in Biggin Hill.\nOvernight, a team of engineers investigated the issue. While Thames Water believes the issue is a burst pipe, they have yet to identify the source of the problem. Additional engineers are now in the area to find the issue. Until the cause is discovered, they cannot provide a timeline of when service will resume.\nI understand this mainly affects Tatsfield and Knockholt, but some homes in Biggin Hill are also affected. Thames Water has brought in tankers to limit the impact on the area.\nThey are also delivering bottled water to customers on their priority service register and are looking for a location to open a bottled water station as soon as possible. I am enquiring about the impact on Biggin Hill residents and where the bottled water station will be."
}