{
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_news_category_Media/content_10.html": "Ministerial Visit to France 19th February 2024 Michael went to France, to see first-hand the Franco-British co-operation that is being done to combat smuggling networks and illegal Channel crossings. Last... Media\nMichael on Radio Solent 27th November 2023 Michael spoke to Steve Harris on BBC Radio Solent about his brother Edward, and the dangers of carbon monoxide poisoning. You can listen to the interview online... Media\nMichael writes for The Times about Domestic Violence 27th April 2023 Michael has written for The Times about the importance of collaboration when tacking domestic abuse, and how the role of independent domestic abuse advisers is... Media",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_news_category_Speeches-in-Parliament/content_14.html": "Michael answers questions about deporting Illegal Migrants 15th April 2024 Michael recently answered questions in the House of Commons about returning Illegal Migrants to their Home Country: Henry Smith (Crawley) (Con) 4. What recent... Speeches in Parliament\nMichael Speaks to Lords Amendments 19th March 2024 The Safety of Rwanda Bill returned to Parliament today, and Michael was on duty - opening the debate, and summing it up at the end. You can watch his speech... Speeches in Parliament\nMichael speaks in Knife Crime Debate 7th February 2024 Michael spoke on behalf of the Government in an important debate about knife crime. Speeches in Parliament\nRwanda Bill Debates 18th January 2024 As the Minister for Countering Illegal Migration, Michael summed up the Committee Stage debate in Parliament this week for the Safety of Rwanda Bill. He also... Speeches in Parliament\nMichael closes Debate 19th December 2023 In his new role as Illegal Migration Minister, Michael was asked to close the debate on the Rwanda Bill. You can see watch his speech here, or read it on... Speeches in Parliament\nRetained EU Law Bill 15th June 2023 As the heatwave engulfed London on Monday, Michael welcomed back the ‘Retained EU Law Bill’ to the House of Commons to take back control of our laws. He opened... Speeches in Parliament\nMichael Brings Retained EU Law Bill to Parliament 24th May 2023 Michael brought forward the Retained EU Law Bill to Parliament, and opened the debate: Speeches in Parliament\nMichael answers questions in the House of Commons 30th March 2023 In his role as Solicitor General, Michel answered questions in the House of Commons alongside the Attorney General. Speeches in Parliament\nMichael responds in Adjournment Debate 24th November 2022 In his role as Solicitor General, Michael was asked to respond in an adjournment debate. In the response, he explains a little more about the unduly lenient... Speeches in Parliament",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_professional-privacy-notice/content_11.html": "Privacy Notice - General Data Protection Regulation\nPlease read the following information carefully. This privacy notice contains information about the information collected, stored and otherwise processed about you and the reasons for the processing. It also tells you who I share this information with, the security mechanisms I have put in place to protect your data and how to contact me in the event you need further information.\nWho Am I?\nMichael Tomlinson collects, uses and is responsible for personal information about you. When I do this, I am the data controller of this information for the purposes of the GDPR and the Data Protection Act 2018.\nIf you need to contact me about your data or the processing carried out you can use the contact details at the end of this document.\nWhat do I do with your information?\nInformation collected\nWhen carrying out the provision of legal services or providing a reference I collect some or all of the following personal information that you provide:\n- personal details\n- family details\n- lifestyle and social circumstances\n- goods and services\n- financial details\n- education, training and employment details\n- physical or mental health details\n- racial or ethnic origin\n- political opinions\n- religious, philosophical or other beliefs\n- trade union membership\n- sex life or sexual orientation\n- genetic data\n- biometric data for the purpose of uniquely identifying a natural person\n- criminal proceedings, outcomes and sentences, and related security measures\n- other personal data relevant to instructions to provide legal services, including data specific to the instructions in question.\nInformation collected from other sources\nThe same categories of information may also be obtained from third parties, such as other legal professionals or experts, members of the public, your family and friends, witnesses, courts and other tribunals, investigators, government departments, regulators, public records and registers,\nHow I use your personal information: Purposes\nI may use your personal information for the following purposes:\n- to provide legal services to my clients, including the provision of legal advice and representation in courts, tribunals, arbitrations, and mediations\n- to keep accounting records and carry out office administration\n- to take or defend legal or regulatory proceedings or to exercise a lien\n- to respond to potential complaints or make complaints\n- to check for potential conflicts of interest in relation to future potential cases\n- to promote and market my services\n- to carry out anti-money laundering and terrorist financing checks\n- to train other barristers and when providing work-shadowing opportunities\n- to respond to requests for references\n- when procuring goods and services\n- to publish legal judgments and decisions of courts and tribunals\n- as required or permitted by law.\nWhether information has to be provided by you, and why\nIf I have been instructed by you or on your behalf on a case or if you have asked for a reference, your personal information has to be provided, to enable me to provide you with advice or representation or the reference, and to enable me to comply with my professional obligations, and to keep accounting records\nThe legal basis for processing your personal information\nI rely on the following as the lawful bases on which I collect and use your personal information:\n- If you have consented to the processing of your personal information, then I may process your information for the Purposes set out above to the extent to which you have consented to me doing so.\n- If you are a client, processing is necessary for the performance of a contract for legal services or in order to take steps at your request prior to entering into a contract.\n- In relation to information which is in categories (g) to (o) above (these being categories which are considered to include particularly sensitive information and which include information about criminal convictions or proceedings) I rely on your consent for any processing for the purposes set out in purposes (ii), (iv), (vi), (viii) and (ix) above. I need your consent to carry out processing of this data for these purposes. However, if you do not consent to processing for purposes (iv) and (ix) (responding to potential complaints and providing a reference) I will be unable to take your case or to provide a reference. This is because I need to be able to retain all the material about your case until there is no prospect of a complaint and to provide an informed and complete reference.\n- In relation to information in categories (g) to (o) above (these being categories which are considered to be particularly sensitive information and include information about criminal convictions or proceedings), I am entitled by law to process the information where the processing is necessary for legal proceedings, legal advice, or otherwise for establishing, exercising or defending legal rights.\n- In relation to information which is not in categories (g) to (o) above, I rely on my legitimate interest and/or the legitimate interests of a third party in carrying out the processing for the Purposes set out above.\n- In certain circumstances processing may be necessary in order that I can comply with a legal obligation to which I am subject (including carrying out anti-money laundering or terrorist financing checks).\n- The processing is necessary to publish judgments or other decisions of courts or tribunals.\nWho will I share your personal information with?\nIf you are a client, some of the information you provide will be protected by legal professional privilege unless and until the information becomes public in the course of any proceedings or otherwise. As a barrister I have an obligation to keep your information confidential, except where it otherwise becomes public or is disclosed as part of the case or proceedings.\nIt may be necessary to share your information with the following:\n- data processors, such as my Chambers staff, IT support staff, admin support staff, email providers, data storage and content management providers\n- other legal professionals\n- experts and other witnesses\n- prosecution authorities\n- courts and tribunals\n- trainee barristers\n- lay clients\n- family and associates of the person whose personal information I am processing\n- in the event of complaints, the Head of Chambers, other members of Chambers who deal with complaints, the Bar Standards Board, and the Legal Ombudsman\n- other regulatory authorities\n- current, past or prospective employers\n- education and examining bodies\n- business associates, professional advisers and trade bodies, e.g. the Bar Council\n- the intended recipient, where you have asked me to provide a reference.\n- the general public in relation to the publication of legal judgments and decisions of courts and tribunals [this requires the production of a policy document to comply with this obligation – DPA Bill sch. 1 Part 2. para. 5(1)].\nI may be required to provide your information to regulators, such as the Bar Standards Board, the Financial Conduct Authority or the Information Commissioner’s Office. In the case of the Information Commissioner’s Office, there is a risk that your information may lawfully be disclosed by them for the purpose of any other civil or criminal proceedings, without my consent or yours, which includes privileged information.\nI may also be required to disclose your information to the police or intelligence services, where required or permitted by law.\nSources of information\nThe personal information I obtain may include information which has been obtained from:\n- other legal professionals\n- experts and other witnesses\n- prosecution authorities\n- courts and tribunals\n- trainee barristers\n- lay clients\n- family and associates of the person whose personal information I am processing\n- in the event of complaints, the Head of Chambers, other members of Chambers who deal with complaints, the Bar Standards Board, and the Legal Ombudsman\n- other regulatory authorities\n- current, past or prospective employers\n- education and examining bodies\n- business associates, professional advisers and trade bodies, e.g. the Bar Council\n- the intended recipient, where you have asked me to provide a reference.\n- the general public in relation to the publication of legal judgments and decisions of courts and tribunals\n- data processors, such as my Chambers staff, IT support staff, admin support staff, email providers, data storage providers\n- public sources, such as the press, public registers and law reports.\nTransfer of your information outside the European Economic Area (EEA)\nThis privacy notice is of general application and as such it is not possible to state whether it will be necessary to transfer your information out of the EEA in any particular case or for a reference. However, if you reside outside the EEA or your case or the role for which you require a reference involves persons or organisations or courts and tribunals outside the EEA then it may be necessary to transfer some of your data to that country outside of the EEA for that purpose. If you are in a country outside the EEA or if the instructions you provide come from outside the EEA then it is inevitable that information will be transferred to those countries. If this applies to you and you wish additional precautions to be taken in respect of your information please indicate this when providing initial instructions.\nSome countries and organisations outside the EEA have been assessed by the European Commission and their data protection laws and procedures found to show adequate protection. The list can be found here. Most do not. If your information has to be transferred outside the EEA, then it may not have the same protections and you may not have the same rights as you would within the EEA.\nI may transfer your personal information to the following which are located outside the European Economic Area (EEA):\n- cloud data storage services based in the USA who have agreed to comply with the EU-U.S. Privacy Shield, in order to enable me to store your data and/or backup copies of your data so that I may access your data when they need to. The USA does not have the same data protection laws as the EU but the EU-U.S. Privacy Shield has been recognised by the European Commission as providing adequate protection. To obtain further details of that protection see https://ec.europa.eu/info/law/law-topic/data-protection/data-transfers-….\n- cloud data storage services based in Switzerland, in order to enable me to store your data and/or backup copies of your data so that I may access your data when I need to. Switzerland does not have the same data protection laws as the EU but has been recognised by the European Commission as providing adequate protection; see https://ec.europa.eu/info/law/law-topic/data-protection/data-transfers-….\nIf I decide to publish a judgment or other decision of a Court or Tribunal containing your information then this will be published to the world.\nI will not otherwise transfer personal information outside the EEA (except as necessary for providing legal services or for any legal proceedings).\nIf you would like any further information please use the contact details at the end of this document.\nHow long will I store your personal data?\nI will normally store all your information:\n- until at least 1 year after the expiry of any relevant limitation period (which will usually be 6 years, but may be 12 years, or longer where the case includes information relating to a minor), from the date of the last item of work carried out, the date of the last payment received or the date on which all outstanding payments are written off, whichever is the latest. This is because it may be needed for potential legal proceedings, or referral to the regulatory authorities. At this point any further retention will be reviewed and the data will be marked for deletion or marked for retention for a further period. The latter retention period is likely to occur only where the information is needed for legal proceedings, regulatory matters or active complaints. Deletion will be carried out (without further notice to you) as soon as reasonably practicable after the data is marked for deletion.\n- I will store some of your information which I need to carry out conflict checks for the rest of my career. However, this is likely to be limited to your name and contact details and the name of the case This will not include any information within categories (g) to (o) above.\n- Information related to anti-money laundering checks will be retained until five years after the completion of the transaction or the end of the business relationship, whichever is the later;\n- Names and contact details held for marketing purposes will be stored indefinitely or until I or my clerks become aware or am/are informed that the individual has ceased to be a potential client.\nConsent\nAs explained above, I am relying on your explicit consent to process your information in categories (g) to (o) above. You provided this consent when you agreed that I would provide legal services, or you asked me to provide a reference.\nYou have the right to withdraw this consent at any time, but this will not affect the lawfulness of any processing activity I have carried out prior to you withdrawing your consent. However, where I also rely on other bases for processing your information, you may not be able to prevent processing of your data. For example, if you have asked me to work for you and I have spent time on your case, you may owe me money which I will be entitled to claim.\nIf there is an issue with the processing of your information, please contact my clerks using the contact details below.\nYour Rights\nUnder the GDPR, you have a number of rights that you can exercise in certain circumstances. These are free of charge. In summary, you may have the right to:\n- Ask for access to your personal information and other supplementary information;\n- Ask for correction of mistakes in your data or to complete missing information I hold on you;\n- Ask for your personal information to be erased, in certain circumstances;\n- Receive a copy of the personal information you have provided to me or have this information sent to a third party. This will be provided to you or the third party in a structured, commonly used and machine readable format, e.g. a Word or pdf file;\n- Object at any time to processing of your personal information for direct marketing;\n- Object in certain other situations to the continued processing of your personal information;\n- Restrict my processing of your personal information in certain circumstances;\n- Request not to be the subject to automated decision-making which produces legal effects that concern you or affects you in a significant way.\nIf you want more information about your rights under the GDPR please see the Guidance from the Information Commissioners Office on Individual's rights under the GDPR.\nIf you want to exercise any of these rights, please:\n- Use the contact details at the end of this document;\n- I may need to ask you to provide other information so that you can be identified;\n- Please provide a contact address so that you can be contacted to request further information to verify your identity;\n- Provide proof of your identity and address;\n- State the right or rights that you wish to exercise.\nI will respond to you within one month from when I receive your request.\nHow to make a complaint?\nThe GDPR also gives you the right to lodge a complaint with the Information Commissioners’ Office if you are in the UK, or with the supervisory authority of the Member State where you work, normally live or where the alleged infringement of data protection laws occurred. The Information Commissioner’s Office can be contacted at http://ico.org.uk/concerns/.\nFuture Processing\nI do not intend to process your personal information except for the reasons stated within this privacy notice. If this changes, this privacy notice will be amended and placed on my website.\nChanges to this privacy notice\nThis privacy notice was published on 1st December 2024.\nI continually review my privacy practices and may change this policy from time to time. When I do it will be placed on my website.\nContact Details\nIf you have any questions about this privacy notice or the information I hold about you, please contact me or my clerks [email protected]",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_member-parliament-mid-dorset-and-north-poole/content_9.html": "Constituency Work\nDuring his time as an MP, Michael kept constituents updated with his regular news items on his website, and a newsletter. You can see Photos of his work as an MP on flickr. He hosted work experience students every year, and you can read about their work here. Following their time in his office, several have subsequently been in touch with Michael to update him on their progress in careers in politics and law.\nMichael kept constituents up to date with useful information about grants and funding and sources of help for the Cost of Living.\nParliamentary Speeches\nYou can read all of Michael's Parliamentary contributions here: In Parliament\nAll Party Parliamentary Groups\nBefore Michael was a Minister, he was involved in a number of All Party Parliamentary Groups. All Party Parliamentary Groups (APPGs) are voluntary groups which bring together politicians from all parties, from both the Commons and the Lords, who have a shared interest in a particular topic. The groups might promote a particular industry or sport, commission reports into an area of life, raise awareness and understanding of a topic, and campaign to the Government on issues.\nMichael was involved in the following APPGs during his time in Parliament:\n- Youth employment (Chairman)\n- Armed Forces Covenant (Treasurer)\n- Autism\n- Beer\n- Bees (Vice Chairman)\n- Broadband and Digital Communications (Vice Chairman)\n- Cricket\n- Jordan\n- Romania (Vice Chairman)\n- Rural Services\n- Singapore (Vice Chairman)\n- Young Disabled People (Vice Chair)\nMichael also helped to co-ordinate the Lords & Commons cricket team, including regular tours to the Netherlands.",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_minister-countering-illegal-migration/content_5.html": "In December 2022 Michael was appointed by the Prime Minister to the role of Minister for Countering Illegal Migration.\nThis position was as a Home Office Minister of State, attending Cabinet. He was responsible for countering illegal migration: taking both primary and secondary legislation through Parliament; deterring small boat crossings and working with international organisations, such as the International Organisation for Migration. He signed a joint statement of cooperation with Vietnam, to reaffirm the UK's strong partnership Vietnam’s Ministry of Public Security, and worked with counterparts from Bangladesh and Albania to strengthen partnerships and intensify co-operation on economic, cultural and social issues, as well as migration issues.\nHe led a delegation to North Africa; including Cairo, Tripoli and Tunis; as well as to Kosovo and Albania. He was the first ever Home Office Minister in Tripoli, Libya.\nHe was sworn in as a Privy Councillor in February 2024 by His Majesty King Charles III to become a member of His Majesty’s Most Honourable Privy Council, entitling Michael to the style \"The Right Honourable\" for life.",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk/content_1.html": "Former Minister of State for Countering Illegal Migration, Solicitor General, Senior Government Whip.\nMP for Mid Dorset and North Poole 2015-2024.",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_news_day-life-hm-solicitor-general/content_7.html": "A day in the life of HM Solicitor General in Parliament\nI was appointed Her Majesty’s Solicitor General shortly before the Queen died, and then re-appointed by the current Prime Minister in October. Some of you have kindly asked about this and so here is some detail about how I spend my days in Westminster!\nI usually travel to London from Dorset late on Sunday evening, or very early on Monday morning and return home late on a Thursday. My first meetings are often with the Attorney General (AG), and the team who work for the Attorney General's Office. The Attorney General is my direct boss, and she and I have adjoining offices just off Central Lobby in Parliament. This has been the tradition on since at least the latter part of the 19th century. There are interlinking doors to ensure constant communication, but there is no doubt that her office is the grander of the two! We discuss the business in Parliament, and anything specific that we have been asked to look at by the Prime Minister. Part of our job is to provide legal advice to the Government. This is always confidential and the convention is that this is not disclosed - not even the fact of whether advice has been given, let alone the advice itself.\nI also sit on the cabinet sub committee called \"PBL\", the Parliamentary Business and Legislation Committee. This considers each Bill before it is introduced in Parliament. The Legal Department shares a building with the Ministry of Justice and is about half a mile away from Parliament, and being central London it is often quicker to walk. The department has staff who assist the Attorney General and I in our work, including preparatory work and research.\nFollowing these meetings, I usually return to my office to catch up on paperwork. Behind my office desk is the Solicitor General's red box. Lead-lined, and weighing in at around 5kg (about 11lb) when empty, I do not often carry it around! It can be locked and kept secure, but thankfully given the number of papers that I look at, the vast majority can be considered electronically. There are always court cases to be read through, and there may be documents to sign.\nOn sentencing, anyone can refer a case to the Attorney General if they think the sentence was too lenient. I review all the evidence and sentencing guidelines, before deciding whether to refer it to the Court of Appeal for a fresh look. There are specific cases that can be reviewed in this way, the most serious cases, including murder, rape, child cruelty and sex crimes, serious drug and terror offences and control and coercive behaviour.\nMy important work as a constituency MP still continues, and during the day I speak to my senior caseworker in Dorset or my senior parliamentary assistant to discuss constituents' cases and see regularly review any constituency-specific issues. If a Dorset school is visiting Parliament, I’m invited to do a Q&A session in the education centre, or I might meet a charity that wants to highlight their work in Dorset or the South West.\nIf we have upcoming Oral Questions to the Attorney General, I spend time researching and preparing for this. The AG and I share responsibility for answering these, and it is important to be fully ready before standing at the dispatch box. If the division bell rings it’s time to vote, and we all file through the lobbies to be counted. Each vote takes about 15 minutes, and there are often several votes, so it can be a long process. On Mondays Parliament sits until 10.30pm though it can sometimes sit much later. I try to call to my family back in Dorset most days, and then usually do some more box work and preparation for the next day, before getting some sleep, ready to face another day!",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_mediator/content_6.html": "Michael believes that there are many disputes that are ripe for mediation and as a qualified mediator he is able to undertake work as a mediator for a broad range of property, commercial and civil matters.\nHe has also appeared as an advocate at mediation. Following the changes to the Civil Procedural Rules, coming in to force on the auspicious date of the 1st October (Michael’s birthday) this year, the Court will now promote the use of alternative dispute resolution in response to the decision of the Court of Appeal in Churchill v. Merthyr Tydfil CBC [2023] EWCA Civ 1416. The Court will further actively encourage mediation.\nAs a Member of Parliament, Michael would often see the benefit of mediation in solving a range of disputes; from wider community disputes, to neighbour or more commercial matters.\nMichael has taken part in legal projects in both Sierra Leone and Rwanda; and is part of a team leading mediation training sessions in South Africa.\nFurther to his work as a constituency Member of Parliament, working with the NFU and the local farming community during his time as MP in Dorset, Michael is developing a specialism in agricultural work. Much of this work is particularly suitable for mediation.\nMichael was trained by and is a Member of the Society of Mediators and is a Civil Mediation Council Registered Mediator.\nTo instruct Michael, please contact his Chambers: 3PB\nYou can find Michael's mediation complaints policy here: Policy",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_former-mp-minister/content_4.html": "Michael was in Parliament from 2015 - 2024, and served under 5 Conservative Prime Ministers. You can read more about his work in Parliament using the links on the left.\nMember of Parliament for Mid Dorset and North Poole\nMichael was first elected as Member of Parliament for Mid Dorset and North Poole in May 2015, and re-elected in 2017 in again in 2019.\nHe served in several Government departments in various junior roles, including the Department for International Development, and the Department for Exiting the EU. He was a very active local constituency MP, supporting individuals, charities and businesses across Mid Dorset and North Poole.\nGovernment Whip\nHe served as a Government whip in the Department for Business, Energy and Industrial Strategy, the Department for Education and the Cabinet Office. In summer 2022 he was appointed senior whip as Vice Chamberlain to Her Majesty's Household. This role meant Michael had to write a daily update of Parliament's proceedings for Her Majesty the Queen.\nSolicitor General\nMichael was appointed to the role of His Majesty's Solicitor General by Liz Truss in 2022, and he was re-appointed by Rishi Sunak when he took office. Michael served as Solicitor General from September 2022 to December 2023. You can read about a typical day as Solicitor General here: A Day in the Life.\nMinister for Countering Illegal Migration\nIn December 2023 the Prime Minister asked Michael to join the Cabinet in the role of Minister for Countering Illegal Migration.",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_news_michael-brings-retained-eu-law-bill-parliament/content_15.html": "Tweet Wednesday, 24 May, 2023 Speeches in Parliament Michael brought forward the Retained EU Law Bill to Parliament, and opened the debate:\nMichael Thanks Volunteers Tuesday, 4 June, 2024 This week is volunteers week - a week to thank volunteers in our community. Thousands of people give hours of their time across Mid Dorset and North Poole doing volunteering.",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_barrister/content_13.html": "Michael practised for twelve years at 3PB (3 Paper Buildings) from their Bournemouth office – from 2003 up until he became an MP in 2015.\nBefore becoming an MP, Michael was on the Attorney General’s Regional Panel and undertook civil work, both advocacy and advisory, for all Government departments.\nMichael's practice continues to encompass a broad range of civil work, acting for both claimants and defendants, notably commercial and contract law, property and chancery cases and public law and regulatory. He also practises as a qualified mediator for any civil dispute cases.\nMichael has appeared in courts up to and including the Court of Appeal, helping individuals, businesses, charities and Local Authorities. He has been recognised on the 2025 Pro Bono Recognition list, showing that he has provided at least 25 hours of legal Pro Bono (free advice) last year.\nMichael undertakes cases nationwide and is frequently instructed in disputes right across the country. Given his background in Government, he has an interest in statutory interpretation and much of his work has an international flavour.\nYou can instruct Michael directly, without speaking to a solicitor. More information here: Direct Access.\nFor more information, and to instruct Michael, please see details on Michael's Chambers' website.",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_cdn-cgi_l_email-protection/content_16.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_cookies/content_2.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_direct-access/content_3.html": "Direct Access\nMichael is qualified to take instructions directly from the public – without the need for you to first instruct a solicitor. Not all cases are suitable for this – and you will need to be confident that you are able to undertake the necessary administrative work required. This might include collating papers and evidence, providing clear instructions to Michael, and corresponding with the Court. There is further information on Michael’s Chambers’ website here: Direct Access\nWhat can Michael do to help me?\nSpecifically, you can instruct Michael to:\n- Provide you with expert legal advice about the merits and potential outcomes in your case.\n- Assist you to draft correspondence.\n- Help to draft statements from litigants and witnesses.\n- Draft formal court documents.\n- Advise you on suitable experts and draft instructions to expert witnesses.\n- Offer you advice on the next steps to be taken in proceedings.\n- Assist you in trying to resolve your case without going to court (e.g. by way of mediation or other form of alternative dispute resolution).\n- Represent you in Court.\nHow Do I instruct Michael?\n3PB has a dedicated team for Direct Access, and you can find out more on their website: Direct Access Team\nHow Much will it Cost?\nThere are clear benefits to you of in instructing a barrister directly under this scheme: you will save money, as you’ll only be paying for one lawyer (a barrister as opposed to a barrister and a solicitor), and you will deal directly with that specialist barrister throughout your case. 3PB agree fixed or hourly fees in advance of work being undertaken, there is transparency and you can keep control of your legal costs.\nOnce the papers have been considered and your clear instructions have been received, a clerk will contact you with a proposed fee and, assuming that is agreed, they will send you a letter of engagement that sets out our terms and conditions, confirms the quote and requires your counter-signature. Fees are to be paid in advance of the work being undertaken. No fees are payable until that quote has been given, accepted and that letter of engagement signed.\nWhere can I find out more?\nIf you would like further information about direct access, you can complete 3PB’s form here: Direct Access Form. Further, the most reliable information is provided by the Bar Council and included on their website is the Bar Standards Board Handbook which provides current guidance about direct access: How to instruct a barrister",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_accessibility/content_12.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_michaeltomlinson_org_uk_/https_www_michaeltomlinson_org_uk_privacy/content_8.html": "This document outlines how Michael Tomlinson processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Michael Tomlinson\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Michael Tomlinson.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Michael Tomlinson, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Michael Tomlinson via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}