{
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_transport/content_8.html": "top of page\nMy Plan:\nGet Lincolnshire Moving\nBetter Roads, Faster Transport, A County That Works\nLincolnshire’s transport is slow, underfunded, and disconnected. Decades of neglect have left us with pothole-ridden roads, unreliable buses, and no long-term strategy. As Mayor, I’ll fix this\nKey Policies:\n-\nTransport for Greater Lincolnshire – A single body to oversee and improve transportAJ Messaging Model v3.0.\n-\nMajor Road Upgrades – Invest in key routes like A15, A16, A52, A17.\n-\nBetter Buses – More frequent and affordable services, especially in rural areas.\n-\nRail Connectivity – Push for direct services to major hubs like London and the Midlands.\n-\nFair Funding Fight – Lincolnshire gets 25% less transport funding than other areas—I’ll change that.\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_my-plan/content_5.html": "top of page\nA Stronger Lincolnshire:\nMy Plan for Real Change\nFor too long, Lincolnshire has been ignored by Westminster and failed by weak local leadership. Our roads are crumbling, our public services are underfunded, and businesses struggle with red tape. It’s time for a Mayor who will fight for our fair share, stand up for local people, and get things done.\n\"This manifesto is a plan for action—not empty promises. Below are my key priorities to fix Lincolnshire’s transport, create jobs, support local services, and put our county first.\n📌 Click on a section below to read more.\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_holbeach/content_12.html": "Holbeach\n- Clifford George Jenkyns\n- Feb 4\n- 1 min read\nUpdated: Feb 12\nYesterday, I was in Holbeach talking to residents and local businesses. They are fed-up of lack of investment in our roads and infrastructure. If elected your Mayor of Lincolnshire I will establish a 'Transport For Lincolnshire' and have a joined up approach so we can get Lincolnshire moving.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news_tags_people/content_35.html": "top of page\nEnough is Enough\nHaving lived in Boston, I have seen firsthand the devastating effects of uncontrolled migration on a local community. I say enough of...\nFeb 81 min read\n224 views\n0 comments\nBoston Belle Skipper Endorses Andrea For Mayor\n\"I'm thrilled that Boston stalwart and Skipper of the Boston Belle, Rodney Bowles, has endorsed me for Mayor of Greater Lincolnshire. I...\nFeb 61 min read\n131 views\n1 comment\nVote for Andrea: A Leader Who Will Stand Up for You and Your Family\nBoston Borough Council votes in secret to give themselves a pay raise on 20th January 2025 Across England, hardworking families are...\nJan 283 min read\n3,835 views\n0 comments\nFlooding in Lincolnshire\nThis week I met with some of our inspiring farmers in Lincolnshire who battle the elements daily to feed Britain. I saw firsthand the...\nJan 111 min read\n12 views\n0 comments\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_i-say-no-to-net-zero-desecrating-our-countryside-i-say-no-to-net-zero-damaging-british-industries/content_32.html": "I say No to Net Zero, desecrating our countryside.I say No to Net Zero, damaging British Industries.And I say YES to ditching Net Zero Full Stop!\n- Clifford George Jenkyns\n- Feb 4\n- 1 min read\nUpdated: Feb 12\nI say No to Net Zero, desecrating our countryside.\nI say No to Net Zero, damaging British Industries.\nAnd I say YES to ditching Net Zero Full Stop!",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news_hashtags_Lincolnshire/content_30.html": "top of page\nMeeting Residents in Billingborough to discuss Flooding\nI was in Billingborough meeting residents this week and saw the devastation in their homes left by the recent flooding. It's nonesenical...\nMar 81 min read\n23 views\n0 comments\nQ&A with 40 local Businesses\nA massive thank you to James Kirby for hosting 40 Lincolnshire businesses at his fabulous pub this week. It was a pleasure to speak to...\nMar 11 min read\n51 views\n0 comments\nEnough is Enough\nHaving lived in Boston, I have seen firsthand the devastating effects of uncontrolled migration on a local community. I say enough of...\nFeb 81 min read\n224 views\n0 comments\nDOGE Efficiency for Greater Lincolnshire\nJust as @elonmusk is ensuring government efficiency in Trumps administration, I will do the same in #Lincolnshire and root out the WOKE...\nJan 41 min read\n33 views\n0 comments\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_reform-local-goverment-launch/content_18.html": "Reform Local Goverment LaunchAgincourt SupportApr 11 min readOn Friday evening Reform made history by holding one of Britain's largest election rallies with 10,000 people. It was truly electric and inspiring and I was proud to be part of it.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk/content_1.html": "Why Andrea?\n-\nNot a career politician—A fighter who stands up for Lincolnshire.\n-\nProven track record - in Westminster and as a councillor\n-\nStrong, unapologetic voice on key issues— Immigration, crime, economy, and transport.\nKey Campaign Priorities\nAndrea Jenkyns\nfor Mayor of Greater Lincolnshire\nAndrea Jenkyns\nfor Mayor of Greater Lincolnshire\n-\nTransport for Greater Lincolnshire: Get Lincolnshire Moving: Better transport, roads, and connectivity.\n-\nTurbo Charging Skills: Skills for Lincolnshire: Employer-led apprenticeships to build a stronger local workforce.\n-\nProtecting Lincolnshire: Deliver proper flooding defences, fighting solar & wind farms. Supporting Lincolnshire farmers.\n-\nPrioritising Lincolnshire People: Local-first access to service, fair funding from Westminster, and a strong voice for Lincolnshire.\n-\nDOGE Lincolnshire: Cutting waste, lowering taxes, reducing bureaucracy, and pushing for more local control to deliver real results for residents.\n-\nGrowth Lincolnshire: Backing businesses with funding, driving high-tech innovation, and uniting local industries to create jobs and investment.\nVision\nA Greater Lincolnshire that puts its people first—where hard work is rewarded, communities are safe, businesses thrive, and rural voices are heard.\nA county with better roads, more substantial public services, and a future built on opportunity, not bureaucracy.\nMission\nFor too long, Westminster has overlooked Lincolnshire. As Mayor, I will fight for our fair share, securing investment in transport, infrastructure, and local industry. I will stand up for farmers, back small businesses, and ensure our public services work for the people, not government bureaucrats. I will cut waste, restore common sense, and put Lincolnshire’s priorities first.\nMy promise is simple: I will not be another career politician who takes orders from London. I will fight for Lincolnshire—its people, its businesses, and its future. No more excuses, no more delays, just real action and real results.\nGet Involved\nLatest News from Andrea's Campaign\nWHAT PEOPLE SAY\nJULIAN KNIGHT\nFairman Knight & Sons\nWe are happy to endorse Andrea, and Reform for Lincolnshire. She has what it takes to deliver for business in our county\nJAMES KIRBY\nStirlin Group\nHearwarming to hear of your positive plans for Lincolnshire. Common-sense & patriotism has a place in politics\nRodney Bowles\nBoston Belle Skipper\nGet's the job done!",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_doge-efficiency-for-greater-lincolnshire/content_37.html": "DOGE Efficiency for Greater Lincolnshire\n- Clifford George Jenkyns\n- Jan 4\n- 1 min read\nJust as @elonmusk is ensuring government efficiency in Trumps administration, I will do the same in #Lincolnshire and root out the WOKE spend and ensure every penny of taxpayers money is spent on things that matter. We will become a blueprint for common sense.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news_tags_no2netzero/content_33.html": "top of page\nI say No to Net Zero, desecrating our countryside.I say No to Net Zero, damaging British Industries.And I say YES to ditching Net Zero Full Stop!\nI say No to Net Zero, desecrating our countryside. I say No to Net Zero, damaging British Industries. And I say YES to ditching Net Zero...\nFeb 41 min read\n195 views\n1 comment\nMeeting with the 7000 Acres Group: Listening to Our Community's Concerns\nThis week, I had the privilege of meeting with residents and members of the 7000 Acres Group, who are leading a passionate campaign...\nJan 303 min read\n117 views\n0 comments\nScunthorpe Steel Works Visit\n24th January 2025 At Scunthorpe Steelworks, you can see what real industry means to communities and the economy. This site has powered...\nJan 271 min read\n128 views\n0 comments\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_about-andrea/content_3.html": "ABOUT ANDREA\nDame Andrea Jenkyns -\n-A strong, outspoken voice\nwith a footprint throughout Greater Lincolnshire.\nAndrea is a former Member of Parliament and former Lincolnshire County Councillor.\nShe went to primary schools in East Halton (North Lincolnshire) and Healing (North East Lincolnshire). And Secondary School at Matthew Humberstone School in Cleethorpes, and she went to Grimsby College. (All in North East Lincolnshire) She studied for her degree at the University of Lincoln.\nAndrea has also lived in Cleethorpes, North Somercotes (East Lindsey), and Boston (Boston Borough). She was a Conservative Lincolnshire County Councillor for Boston North West. Which covered Witham, Fenside, Hubberts Bridge, Holland Fen, Brothertoft and Amber Hill. Whilst a councillor, she was the Executive Support Councillor for Fire & Rescue, and Community Safety. And was on the council's Children and Young Peoples Scrutiny and Adult Social Care Scrutiny Committees. And also the Councillor lead on Lincolnshire's Children In Care Council.\nAndrea also used to work for the Lincolnshire Music Service and was a peripatetic music teacher in Mablethorpe Tennyson, Louth Academy, St Bedes Catholic School, Boston and Long Sutton Primary School (South Holland). Andrea was also previously a Musical Theatre Director for both Blackfriars Theatre Academy (Boston) and Polkadot in Spalding (South Holland). As a soprano she held many a charity concert including for the Doris Baham Dog Rescue, the Butterfly Hospice and for the Army Benevolent fund performing in Stoke Rochford, and she was also a Rotarian for the Boston Rotary. Andrea also previously worked in marketing for Burden's in Lincolnshire which supplied farming machinery. Andrea famously was elected in 2015 as the Conservative Member of Parliament for Morley & Outwood, unseating the then Shadow Chancellor Ed Balls.\n-An Outspoken Common Sense Voice in Politics\n-She Stood up for Brexit\nShe campaigned vigorously for Brexit, was the Deputy Chairman of the ERG (European Research Group and fought for Brexit in Parliament. She was on the European Scrutiny Committee, the Brexit Committee and a member of the Health and Social Care Committee.\nBoth Andrea and her young son are neurodiverse and so she has always been a strong voice for those with special educational needs (SEND).\n-A Former Minister\nAndrea was also a former Education Minister for Skills, Apprenticeships, Further and Higher Education. She was also a Government Whip and the Parliamentary Private Secretary to the Secretary of State for Housing, Communities and Local Government. The Mayoral brief also has responsibility for Skills.\nAndrea was formerly the Vice-President of the LGA (Local Government Association), and in parliament, she chaired the Local Democracy Group that was a voice for council's across the country.\nIn parliament, she stood up for common sense policies, including speaking up on the costs and effects of illegal migration, for low taxes, strong policing and justice, and was a strong pro-business voice.\nGreater Lincolnshire has been a big part of Andrea's childhood and adult life, and she is proud to stand as your Mayoral Candidate.\nShe is uniquely placed by not only having lived in all three areas of the Greater Lincolnshire region, but by both previously being elected in local government, and elected as an MP, she understands the workings of both local and national government and the importance of being a strong voice on the national stage for her constituents.\nAndrea has been a life-long Conservative but has always admired and supported Nigel Farage, and she worked with both Nigel and Richard Tice MP standing up for Brexit for years. During this period she stood up for farmers and also for the fishing industry, as her Grandfather Walter was a fisherman.\nShe is proud to stand as the Reform Candidate in the forthcoming Mayoral election. And wants to be your outspoken and effective voice who stands up for Greater Lincolnshire, and as she has always shown, she puts people ahead of politics and political parties.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_doge/content_7.html": "top of page\nMy Plan:\nDOGE Lincolnshire\nRooting Out Waste, Keeping Taxes Low, Running Efficiently\nLincolnshire taxpayers deserve value for money—not bloated bureaucracy. My DOGE (Department of Government efficiency) Lincolnshire plan will ensure efficiency and transparency.\nKey Policies:\n-\nMore Local Control – Push for increased powers from Westminster.\n-\nCut Government Waste – A dedicated efficiency team to slash unnecessary spending.\n-\nLower Taxes – Keep council tax low by eliminating ‘woke wastage’.\n-\nTransparency & Openness – Proper scrutiny of public spending.\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_people/content_16.html": "top of page\nMy Plan:\nPrioritising Lincolnshire People\nPutting Lincolnshire First in Housing, Services, and Support\nLincolnshire people should come first—whether it's housing, social services, or public funding. For too long, we've been left behind.\nKey Policies:\n-\nLincolnshire Fair Share (#LincsFairShare) – Secure more funding from Westminster\n-\nFighting against solar and wind farms on prime agricultural land.\n-\nHolding flooding authorities to account to deliver overdue prevention work.\n-\nManaged house building that works with the of residents, not against.\n-\nHomes4Heroes – A housing programme for veterans and service workers\n-\nLocal Access Priority – Lincolnshire residents get first priority for housing and services.\n-\nFight for a better devolution deal for Lincolnshire.\n-\nBetter NHS & Social Care – Fight for better-funded local healthcare.\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_flooding-in-lincolnshire/content_39.html": "Flooding in Lincolnshire\n- Clifford George Jenkyns\n- Jan 11\n- 1 min read\nUpdated: Feb 12\nThis week I met with some of our inspiring farmers in Lincolnshire who battle the elements daily to feed Britain. I saw firsthand the devastating flood damage to their farms. Our farmers risk so much, and Starmer is threatening the future of British farming with his abhorrent #FamilyFarmTax. The Environment Agency is also useless and needs disbanding. I will fight for our farmers.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_meeting-with-the-7000-acres-group-listening-to-our-community-s-concerns/content_25.html": "Meeting with the 7000 Acres Group: Listening to Our Community's Concerns\n- Agincourt Support\n- Jan 30\n- 3 min read\nUpdated: Feb 12\nThis week, I had the privilege of meeting with residents and members of the 7000 Acres Group, who are leading a passionate campaign against the construction of large solar farms on Lincolnshire's agricultural land. It was a significant opportunity to listen, learn, and understand the concerns of those who feel deeply about protecting our countryside and ensuring sustainable, community-focused development in our region.\nI met people from all walks of life: farmers, wildlife advocates, and residents who care deeply about Lincolnshire's future. Their commitment to preserving our farmland and natural environment was evident when I arrived. The group's concerns are not just about their immediate surroundings—they're about the bigger picture: the long-term impact on food security, our landscapes, and local biodiversity.\nOne key issue was the potential loss of fertile farmland to industrial-scale solar developments. \"Once it's gone, it's gone,\" one farmer told me, explaining how this land has provided food for generations. As someone who values the importance of a resilient local food supply, I understand how critical this point is. Lincolnshire's agricultural heritage should be celebrated and protected, not paved over in the name of quick energy solutions.\nResidents also expressed their concerns about the visual impact on the countryside. One person shared how their daily walks, once filled with open fields and wildlife views, would now be overshadowed by rows of solar panels. It's clear these developments don't just change landscapes—they change lives.\nThe group was equally concerned about the effect on local wildlife habitats. I heard heartfelt worries about how birds, pollinators, and other species might lose their homes if this land is transformed. As stewards of our environment, we must weigh these impacts carefully and ensure that green energy doesn't come at the expense of biodiversity.\nFlood risk was another pressing issue. Residents pointed out how agricultural land is vital in water management, soaking up rainfall and preventing floods. They explained that paving over large areas with solar panels and complex infrastructure could increase the risk of flooding in nearby villages. These are the kinds of concerns that need to be addressed with detailed assessments and transparent discussions.\nThe group's determination to promote a better way forward struck me most during the meeting. They're not opposed to renewable energy—they support it—but they want to see it done responsibly. They suggested alternatives, like prioritising solar installations on brownfield sites, industrial zones, and rooftops rather than sacrificing prime agricultural land.\nAfter hearing these concerns, I left the meeting feeling inspired and determined. Our residents' passion and knowledge inspired me, and I am determined to bring their voices into the broader conversation about Lincolnshire's future. This isn't just about opposing one set of plans—it's about finding solutions for our communities, environment, and future.\nAs we look ahead, I will continue to stand with our residents, advocating for responsible development that balances needs with the protection of our countryside. Lincolnshire's land, wildlife, and communities are too important to be sidelined in this debate. We can build a future that respects our heritage while embracing innovation.\nTo the 7000 Acres Group members and all the residents I met, thank you for sharing your time, perspectives, and hopes for our county. I'm with you and will ensure your voices are heard.\nSign the petition - Prioritise Food Security Over Industrial-Scale Solar Farms https://www.andrea4mayor.co.uk/solar-farm-petition",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_solar-farm-petition/content_9.html": "Solar Farm Petition\nProtect Lincolnshire’s Farmland: Prioritise Food Security Over Industrial-Scale Solar Farms\nTo: [Local Council/MP/Planning Authorities]\nWe, the undersigned, call for an immediate halt to large-scale solar developments on Lincolnshire’s agricultural land.\nLincolnshire is the breadbasket of Britain, producing food that feeds our nation. Yet, prime farmland is under threat from industrial solar farms that will take fertile land out of food production, damage our rural landscape, and disrupt local ecosystems.\nWe fully support renewable energy, but it must be done responsibly. That means prioritising solar panels on brownfield sites, industrial areas, and rooftops—not covering our most valuable farmland. Once this land is lost, it’s lost forever.\nWe demand:\n-\nA ban on large solar farms on high-quality agricultural land.\n-\nA commitment to food security by protecting Lincolnshire’s farmland for farming.\n-\nA renewable energy strategy that prioritises non-agricultural sites for solar development.\n-\nStronger local consultation so that residents’ voices are heard in planning decisions.\nOur countryside should not be sacrificed for poorly planned energy projects. Lincolnshire’s farmland is a national asset—let’s protect it for future generations.\nSign this petition below to demand action before it’s too late.\nPetition: Protect Lincolnshire's farmland: Prioritise food security over industrial-scale solar farms.\nWe value your privacy and are committed to protecting your personal data in compliance with the General Data Protection Regulation (GDPR). Any information you provide will be used solely for campaign purposes, such as communicating updates, responding to inquiries, and coordinating volunteer activities.\nWe will never share your data with third parties without your explicit consent. You have the right to access, amend, or delete your data at any time. To exercise these rights or learn more about our data protection practices, please contact [insert contact details or Data Protection Officer].\nBy providing your information, you agree to its use as outlined in our [Privacy Policy] https://www.andrea4mayor.co.uk/privacy-policy",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_volunteer/content_22.html": "Get Involved\nVolunteers like you are the heartbeat of Andrea’s campaign. Whether you want to deliver leaflets, display posters, amplify our message on social media, or connect with voters through calls, there’s a role for everyone. Your efforts will directly shape a stronger, more connected community. Join us today and be part of the team driving meaningful change. Every hour you contribute helps us get closer to a brighter future for all.\nPlease fill in your details below and we'll be in touch!\nJoin Andrea's Campaign Team\nWe value your privacy and are committed to protecting your personal data in compliance with the General Data Protection Regulation (GDPR). Any information you provide will be used solely for campaign purposes, such as communicating updates, responding to inquiries, and coordinating volunteer activities.\nWe will never share your data with third parties without your explicit consent. You have the right to access, amend, or delete your data at any time. To exercise these rights or learn more about our data protection practices, please contact [insert contact details or Data Protection Officer].\nBy providing your information, you agree to its use as outlined in our [Privacy Policy] https://www.andrea4mayor.co.uk/privacy-policy",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_scunthorpe-steel-works-visit/content_23.html": "Scunthorpe Steel Works Visit\n- Agincourt Support\n- Jan 27\n- 1 min read\nUpdated: Feb 12\n24th January 2025\nAt Scunthorpe Steelworks, you can see what real industry means to communities and the economy. This site has powered Britain's progress for generations, but rising energy costs, global competition, and harmful policies like Net Zero threaten it. Forcing heavy industries like steel to meet unrealistic carbon targets will drive jobs overseas and weaken our economy.\nInstead, we should focus on practical solutions that protect jobs, cut costs, and modernise production. Scunthorpe can thrive if we back it with common-sense policies that put British workers and businesses first—not global climate targets. It's time to stand up for industries that keep Britain strong.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_q-a-with-40-local-businesses/content_38.html": "Q&A with 40 local Businesses\n- Clifford George Jenkyns\n- Mar 1\n- 1 min read\nA massive thank you to James Kirby for hosting 40 Lincolnshire businesses at his fabulous pub this week. It was a pleasure to speak to our great local entrepreneurs, hear their stories, their concerns and discuss how I will support them and ensure that #Lincolnshire thrives. https://www.andrea4mayor.co.uk/my-plan",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news_tags_growth/content_26.html": "top of page\nLouth\nToday, I visited the wonderful Kenwick Park in Louth. It is a real hidden jewel of Lincolnshire. I have a plan to ensure Lincolnshire is...\nFeb 81 min read\n287 views\n0 comments\nBank Closures Are Killing Our Communities – And Neither Labour Nor The Tories Care\nAnother week, another blow to Lincolnshire's high streets. Lloyds Banking Group has announced yet more branch closures across our county....\nJan 303 min read\n110 views\n0 comments\nScunthorpe Steel Works Visit\n24th January 2025 At Scunthorpe Steelworks, you can see what real industry means to communities and the economy. This site has powered...\nJan 271 min read\n128 views\n0 comments\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_privacy-policy/content_11.html": "Privacy Policy\nIntroduction\nWe respect your privacy and are committed to protecting your personal data. This privacy policy explains how we collect, use, and protect your information when you visit Andrea’s website or interact with her campaign.\nWho We Are\nThis website is managed by Andrea’s campaign team. For any questions about this policy or how we handle your data, please contact us at andrea.jenkyns@reformparty.uk.\nWhat Data We Collect\nWe may collect the following types of information:\n-\nPersonal details: Name, email address, phone number, and postal address (e.g., when signing up to volunteer or subscribe).\n-\nTechnical information: IP address, browser type, and usage patterns (e.g., through cookies).\n-\nCommunications: Messages, feedback, or other correspondence sent through our contact forms or email.\nHow We Use Your Data\nWe only use your data for legitimate campaign purposes, including:\n-\nResponding to your inquiries.\n-\nSending campaign updates, newsletters, or event invitations (if you opt-in).\n-\nCoordinating volunteer activities.\n-\nAnalyzing website performance to improve user experience.\nLegal Basis for Processing\nWe process your personal data based on your consent, a contractual obligation, or legitimate interests, such as improving campaign outreach.\nHow We Store and Protect Your Data\nWe take appropriate technical and organizational measures to protect your data from unauthorized access, loss, or misuse. Your data is stored securely and only accessible to authorized campaign team members.\nData Sharing\nWe will not share your personal data with third parties without your explicit consent unless required by law.\nCookies\nOur website uses cookies to enhance user experience and analyze website performance. You can manage your cookie preferences through your browser settings.\nYour Rights\nUnder the UK GDPR, you have the right to:\n-\nAccess your personal data.\n-\nRequest corrections to any inaccurate or incomplete data.\n-\nRequest deletion of your data.\n-\nWithdraw consent for data processing.\n-\nObject to data processing for specific purposes.\nTo exercise these rights, please contact us at [insert contact details].\nChanges to This Policy\nWe may update this privacy policy periodically. Please check this page for the latest version.\nContact Us\nIf you have any questions or concerns about this privacy policy, please email us at andrea.jenkyns@reformparty.uk or write to us at 124 City Road, London, EC1V 2NX.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_meeting-residents-in-billingborough-to-discuss-flooding/content_36.html": "Meeting Residents in Billingborough to discuss Flooding\n- Clifford George Jenkyns\n- Mar 8\n- 1 min read\nI was in Billingborough meeting residents this week and saw the devastation in their homes left by the recent flooding. It's nonesenical to see that ditiches have been filled over the years, rivers, drains, and banks not being dredged. Also, I hear how some councils in the East Midlands have given those homeowners affected by flooding, relief from paying their council tax for a few months. This should be happening in Lincolnshire too!\nGovernments of all levels and all colours have let down the people of #Lincolnshire. If you elect me as your Mayor, I will set up and lead an action committee that will have key partners, including district councils, central government, Environment Agency, Drainage Boards, etc. We need to metaphorically bang heads together. It is about time we stopped the silo approach and have decisive action. Action Not Just Words. I will be the voice of the silent majority.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_vote-for-andrea-a-leader-who-will-stand-up-for-you-and-your-family/content_27.html": "Vote for Andrea: A Leader Who Will Stand Up for You and Your Family\n- Agincourt Support\n- Jan 28\n- 3 min read\nUpdated: Feb 12\nAcross England, hardworking families are crushed by relentless council tax hikes, secretive spending, and mismanaged priorities. From Boston's self-serving pay rises to Grantham's tripled precept and North East Lincolnshire's commercial gambles, councils are proving they're out of touch with the people they serve. It's time to elect a leader who will put ordinary families first—I am that Leader.\nA Tax Crisis You Can't Afford\nMillions of households now face council tax hikes that defy logic and fairness. Families in the Royal Borough of Windsor and Maidenhead could see a shocking 25% rise, adding £451 to annual bills. Birmingham and Bradford councils are following suit, pushing up to 15% increases. Even North East Lincolnshire approved a 5% rise, claiming it will avoid service cuts but offering little more than superficial fixes like a £250,000 street-cleaning scheme.\nMeanwhile, Grantham Town Council plans to triple its precept, hiking annual costs for Band D households from £4 to £12. Leaders blame predecessors' poor budgeting, but the community is left wondering: Where will the money really go? When will residents see the promised improvements to public services?\nBoston: The Worst Example of Council Arrogance\nIn Boston, the betrayal is even starker. The council secretly voted for massive pay increases for its leaders. The Leader's allowance jumped to £20,000 a year, with the Deputy Leader's rising to £12,000—a combined 43% increase. Committee chairs saw a shocking 233% rise in their allowances, costing taxpayers an additional £51,820 annually. This decision was made privately, without consulting the people who fund their salaries.\nAs families in Boston struggle with the cost of living, poor public transport, and crumbling roads, their leaders line their own pockets. This isn't just mismanagement—it's a disgrace.\nMisplaced Priorities in North East Lincolnshire\nIn North East Lincolnshire, council leaders approved a nearly 5% tax increase while promising \"visible improvements\" like a new environmental \"hit squad\" to clean streets. At the same time, they've funnelled resources into commercial investments like the redevelopment of Freshney Place, all while Ofsted rates their children's services as \"inadequate.\" This pattern of chasing headlines instead of addressing real issues shows a council disconnected from the needs of its residents.\nWhy We Need Reform UK\nThese stories share a common thread: councils exploit legal loopholes, hike taxes, and prioritise their interests over the public good. Families pay more but receive less, all while leaders operate in secrecy and squander resources.\nI have a better way forward:\nStopping the tax hikes: I will fight against councils exploiting loopholes to push through unreasonable increases that hurt families already struggling with rising costs.\nBringing transparency to council spending: No more secret pay raises or backroom deals. Every penny spent will be open to public scrutiny.\nPrioritising essential services: From fixing roads to improving education and healthcare, I will ensure taxpayer money goes where it's genuinely needed.\nHolding councils accountable: Iwill demand better financial management and push back against wasteful projects that don't benefit residents.\nThe Choice is Clear\nWe've seen what happens when councils operate unchecked: skyrocketing taxes, poor services, and leaders who prioritise themselves. I understand the struggles of ordinary families and will fight to protect your interests. I have the courage to challenge the status quo and demand better for you and your community.\nThis election isn't just about stopping these injustices—it's about building a future where councils work for the people, not against them. Vote for me on May 1st, and let's make that future a reality.\nTo get involved, please pledge to support me at andrea4mayor.co.uk/pledge",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news_hashtags_FamilyFarmTax/content_40.html": "top of page\nHOME\nABOUT ANDREA\nMANIFESTO\nNEWS\nGET INVOLVED\nCONTACT\nMore\nUse tab to navigate through the menu items.\nDame\nANDREA\nJENKYNS\nAll Posts\nFlooding in Lincolnshire\nThis week I met with some of our inspiring farmers in Lincolnshire who battle the elements daily to feed Britain. I saw firsthand the...\nJan 11\n1 min read\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_3-days-to-save-british-steel/content_17.html": "3 Days to Save British Steel\n- Clifford George Jenkyns\n- Apr 9\n- 1 min read\nThree days to save British Steel\nNigel Farage Richard Tice and I went to British Steel today and Reform have put forward proposals to save British Steel.\nNot only is it strategically important for Britain, if we lose it, we will be the only country in the G20, who does not have our own Steel making capabilities.\nUt must importantly we must save it for the local communities who have worked there for generations.\nWe will fight for you and keep up the pressure on Government.\nIt is time to turn this crisis into an opportunity for Britain. May our industries thrive once more.\nPress conference including our proposals on link here;\nAfterwards, we went with the fantastic, passionate steelworkers to the Blue Bell Inn.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_enough-is-enough/content_28.html": "Enough is Enough\n- Clifford George Jenkyns\n- Feb 8\n- 1 min read\nUpdated: Feb 12\nHaving lived in Boston, I have seen firsthand the devastating effects of uncontrolled migration on a local community. I say enough of having open doors to Britain. Enough of people getting our houses when they haven't even paid any taxes. Enough, it's about time we put the residents across #Lincolnshire at the heart of all our decisions and policies.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_growth/content_13.html": "top of page\nMy Plan:\nGrowth Lincolnshire\nBacking Local Businesses, Driving Innovation, Creating Jobs\nBusinesses are the backbone of Lincolnshire’s economy, but they’re held back by red tape, weak infrastructure, and lack of investment. I’ll fix that.\nKey Policies:\n-\nBusiness Start-Up & Growth Fund – Financial support for small businesses.\n-\nFight to reduce tax and red tape that's holding our businesses back.\n-\nLincs Defence & Innovation Cluster – Attracting high-tech investment.\n-\nAI & Digital Hub – Making Lincolnshire a leader in cutting-edge industries.\n-\nLincolnshire Business Network – A single platform to unite and support local enterprises.\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news_tags_skills/content_34.html": "top of page\nHOME\nABOUT ANDREA\nMANIFESTO\nNEWS\nGET INVOLVED\nCONTACT\nMore\nUse tab to navigate through the menu items.\nDame\nANDREA\nJENKYNS\nAll Posts\nScunthorpe Steel Works Visit\n24th January 2025 At Scunthorpe Steelworks, you can see what real industry means to communities and the economy. This site has powered...\nJan 27\n1 min read\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_bank-closures-are-killing-our-communities-and-neither-labour-nor-the-tories-care/content_20.html": "Bank Closures Are Killing Our Communities – And Neither Labour Nor The Tories Care\n- Agincourt Support\n- Jan 30\n- 3 min read\nUpdated: Feb 12\nAnother week, another blow to Lincolnshire's high streets. Lloyds Banking Group has announced yet more branch closures across our county. This time, Brigg, Louth, Sleaford, Gainsborough, Skegness, and Halifax in Sleaford are losing their banks. This isn't just an inconvenience—it's a devastating hit to our communities.\nFor years, we've seen banks pull out of our towns and villages, stripping away essential services and leaving thousands of residents—particularly the elderly, small businesses, and those without reliable internet—without access to cash and in-person banking. The result? More isolation, hardship, and yet another sign that Lincolnshire is being left behind.\nNeither Labour nor the Conservatives have lifted a finger to stop this. They've let it happen, year after year, as if rural communities like ours don't matter. The Tories like to talk about supporting businesses and \"levelling up,\" but where is that support when local traders in Brigg or Skegness can't deposit their takings without driving miles out of town? Labour, on the other hand, pretends to stand up for working people. Yet, under their watch (and with their silence in opposition), banks have been shutting down across the country, making life more challenging for the people they claim to represent.\nWe're told digital banking is the future. That's fine for those in cities with full-fibre broadband and an app for everything. But here in Lincolnshire? Many of our rural areas still struggle with basic internet access. Pensioners in Louth who have banked in person all their lives aren't suddenly going to become tech wizards overnight. And what happens when your banking app fails, your card is lost, or fraudsters strike? You're left with nowhere to go.\nThe Real Cost of These Closures\nThis isn't just about banking—it's about the slow death of our high streets and the stripping away of essential services that people rely on. Every bank that shuts means fewer people coming into town, fewer businesses surviving, and fewer reasons for young people to stay in Lincolnshire.\nPost Offices are supposed to pick up the slack when the banks go, but they're closing, too. Mobile banking vans? They're a stopgap at best, with patchy availability and no proper support. Banking hubs? A handful have been set up nationally, but they're a token effort, nowhere near enough to replace what's been lost.\nLincolnshire Deserves Better\nWe're tired of being ignored. Lincolnshire contributes billions to the UK economy—through farming, manufacturing, tourism, and logistics—yet we are treated like an afterthought. There would be outrage if these closures were happening on this scale in London or Manchester. But because it's happening here, where we don't have the media's attention or the political clout, they think they can get away with it.\nWell, they can't. I will fight tooth and nail for the people of Lincolnshire to get the services, infrastructure, and respect we deserve. Our communities matter, our people matter, and it's time we had leaders who fight for us—not just when an election rolls around, but every day.\nIn the meantime, I have written to the Chief Executive of the Lloyds Banking Group asking for an explanation and answers on what they are doing to support those customers who will be cut off.\nThe next time you hear a Tory or Labour politician talking about \"supporting communities,\" ask them this: where were you when Lincolnshire's last bank closed?",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_no-2-net-zero/content_21.html": "top of page\nMy Plan:\nNo to Net Zero Madness\nProtecting Jobs, Cutting Bills, Common-Sense Energy Policies\nNet Zero policies are crippling Lincolnshire’s economy—driving up energy costs and killing jobs. We need an approach that works for people, not bureaucrats.\nKey Policies:\n-\n• End Net Zero Mandates – Stop policies that destroy jobs and raise energy prices\n• Support for Farmers & Industry – Scrap restrictions harming agriculture and steel\n• Support residents fighting against Ed Miliband’s disastrous net zero agenda.\n• Invest in Nuclear & Hydrogen – A practical, long-term energy strategy\n• Lobby national government for abolish regulations and policies that hold back Lincolnshire businesses.\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_louth/content_29.html": "Louth\n- Clifford George Jenkyns\n- Feb 8\n- 1 min read\nUpdated: Feb 12\nToday, I visited the wonderful Kenwick Park in Louth. It is a real hidden jewel of Lincolnshire. I have a plan to ensure Lincolnshire is the best place to live, bring up our children and visit. We need to promote what a beautiful county it is.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news_tags_doge/content_24.html": "top of page\nWe should Champion Meritocracy, Not DEI\nI have always believed that as a society we should champion meritocracy. I do not believe in identity politics, and believe that in...\nFeb 82 min read\n612 views\n0 comments\nVote for Andrea: A Leader Who Will Stand Up for You and Your Family\nBoston Borough Council votes in secret to give themselves a pay raise on 20th January 2025 Across England, hardworking families are...\nJan 283 min read\n3,835 views\n0 comments\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_boston-belle-skipper-endorses-andrea-for-mayor/content_31.html": "Boston Belle Skipper Endorses Andrea For Mayor\n- Agincourt Support\n- Feb 6\n- 1 min read\nUpdated: Feb 12\n\"I'm thrilled that Boston stalwart and Skipper of the Boston Belle, Rodney Bowles, has endorsed me for Mayor of Greater Lincolnshire. I first met Rodney many years ago when I was his local councillor in Boston. We worked together on many issues, not least of which was the local flooding problems. Rodney is known across the area for his experience and knowledge of Boston and its waterways, and I'm thrilled to have his backing\"\nDame Andrea Jenkyns - 6th Feb",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_skills/content_10.html": "top of page\nMy Plan:\nSkills for Lincolnshire\nBuilding Skills, Boosting Jobs, Growing Lincolnshire’s Economy\nWe need to prepare people for the future—not just talk about it. My Skills for Lincolnshire plan will ensure everyone has the training they need for good jobs.\nKey Policies:\n-\nEmployer-Led Apprenticeships – A Skills Board run by businesses.\n-\nA joined up approach that delivers trained people ready for employment.\n-\n£18M Adult Education Budget – Focus on STEM, AI, defence, and digital skills.\n-\nMore Technical & Trade Training – Invest in engineering, agriculture, and manufacturing careers.\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news/content_2.html": "top of page\nNo to Pylons\nOnly Reform UK has a plan to push back on Pylons desecrating our Lincolnshire countryside. This afternoon Richard Tice and I visited...\nApr 111 min read\n512 views\n0 comments\n3 Days to Save British Steel\nThree days to save British Steel Nigel Farage Richard Tice and I went to British Steel today and Reform have put forward proposals to...\nApr 91 min read\n95 views\n0 comments\nReform Local Goverment Launch\nOn Friday evening Reform made history by holding one of Britain's largest election rallies with 10,000 people. It was truly electric and...\nApr 11 min read\n365 views\n0 comments\nApr 110 min read\n24 views\n0 comments\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_no-to-pylons/content_14.html": "No to Pylons\n- Clifford George Jenkyns\n- Apr 11\n- 1 min read\nOnly Reform UK has a plan to push back on Pylons desecrating our Lincolnshire countryside. This afternoon Richard Tice and I visited residents in Loddington on the Isle of Axholme to hear their concerns. We are fighting for you. Reform says 'No to Pylons'.",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_news_tags_transport/content_15.html": "top of page\nHOME\nABOUT ANDREA\nMANIFESTO\nNEWS\nGET INVOLVED\nCONTACT\nMore\nUse tab to navigate through the menu items.\nDame\nANDREA\nJENKYNS\nAll Posts\nHolbeach\nYesterday, I was in Holbeach talking to residents and local businesses. They are fed-up of lack of investment in our roads and...\nFeb 4\n1 min read\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_save-british-steel/content_6.html": "top of page\nHOME\nABOUT ANDREA\nMANIFESTO\nNEWS\nGET INVOLVED\nCONTACT\nMore\nUse tab to navigate through the menu items.\nDame\nANDREA\nJENKYNS\nAll Posts\nSearch\nSave British Steel\nClifford George Jenkyns\nApr 11\n0 min read\nRecent Posts\nSee All\nNo to Pylons\n3 Days to Save British Steel\nReform Local Goverment Launch\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_contact/content_4.html": "top of page\nHOME\nABOUT ANDREA\nMANIFESTO\nNEWS\nGET INVOLVED\nCONTACT\nMore\nUse tab to navigate through the menu items.\nDame\nANDREA\nJENKYNS\nCONTACT ANDREA\nGet Involved\nFirst name\nLast name\nEmail\nHow can you help?\nVote for Andrea\nDeliver Leaflets\nAttend Action Days\nDigital Campaigning\nOther\nMessage\nPostcode\nSign up to receive email/text messages\nSubmit\nBack the Fight for Lincolnshire – Every Pound Helps Us Win!\nDonate to Andrea's Campaign\nbottom of page",
  "https_www_andrea4mayor_co_uk_/https_www_andrea4mayor_co_uk_post_we-should-champion-meritocracy-not-dei/content_19.html": "We should Champion Meritocracy, Not DEI\n- Clifford George Jenkyns\n- Feb 8\n- 2 min read\nUpdated: Feb 12\nI have always believed that as a society we should champion meritocracy. I do not believe in identity politics, and believe that in politics, business and society, we should pick the right person for the job, regardless of background, gender, sexuality or religion.\nIf elected as your mayor, I will certainly challenge the 'Diversity, Equity and Inclusion', woke culture that has taken ahold of the west, it is holding back Britain.\nI have always fought against this political correct culture, even when I was a Lincolnshire County Councillor, and the nine years I was an MP.\nI am the only candidate who stands against this. You Conservative candidate at the Council which he runs, employs diversity officers and has their annual rainbow flag raising ceremony. I dont care who people love, life is too short, be happy, I dont care if as a bloke you want to wear a dress, just dont expect me to call you a woman, and do not push this on young children. What adults do, thats up to them and none of our business. As Mayor, the only flags I will raise is the Union flag and our County flag.\nYou Labour mayoral candidate is also on the woke DEI bandwagon, in his role at a local football club, he has taken the club through diversity and inclusion on steriods and they have evan won an award for it. He actually publicly has stated in a Guardian article, that 'Diversity and Inclusion..is a moral priority'. Surely it should just be about football!\nMy view is, just be kind and treat people as you wish to be treated, there is certainly no need for councils to spend £100,000's per year on diversity officers.\nBelow is a link to an article I have written previously on this https://www.express.co.uk/comment/expresscomment/1088393/international-women-s-day-8-march-conservative-mp-andrea-jenkyns-comment"
}