{
  "https_www_michael-elston_com_/https_www_michael-elston_com_an-end-to-party-politics/content_2.html": "MICHAEL ELSTON\nINDEPENDENT\nBolton, Bury, Manchester, Oldham, Rochdale, Salford, Stockport, Tameside, Trafford, Wigan\nGREATER MANCHESTER\nAN END TO PARTY POLITICS\nIt's not surprising that Party Politics is so bitterly divisive, each of the old political parties having exploited those segments of society from which they received little or no support.\nPolitics doesn't have to be like this.\nIt is possible to have Authorities that don't exploit the public.\nIt is possible to have Councillors and MPs who are willing to represent everyone in their wards and constituencies.\nIt is possible to have a fairer system of taxation.\nIt is possible to have ideas that are put into practice based on their own merits and not purely because they are devised by the party in power.\nIndependents won 228 seats at this year's local elections and there are now 461 Independent candidates, spread across 317 constituencies, standing in the General Election, together with 14 parties of Independents, fielding a further 26 candidates between them.\n#4thJuly #IndependentsDay #VoteMichaelElston",
  "https_www_michael-elston_com_/https_www_michael-elston_com_no-more-bailiffs/content_6.html": "top of page\nMICHAEL ELSTON\nINDEPENDENT\nBolton, Bury, Manchester, Oldham, Rochdale, Salford, Stockport, Tameside, Trafford, Wigan\nGREATER MANCHESTER\nNO MORE BAILIFFS\nIf elected,\nMichael Elston will prohibit bailiffs from operating in Greater Manchester.\nbottom of page",
  "https_www_michael-elston_com_/https_www_michael-elston_com_contact/content_8.html": "top of page\nMICHAEL ELSTON\nINDEPENDENT\nBolton, Bury, Manchester, Oldham, Rochdale, Salford, Stockport, Tameside, Trafford, Wigan\nGREATER MANCHESTER\nIf you would like to volunteer for Greater Manchester's Neighbourhood Watch, please email:\nvolunteer@michael-elston.com\nFor enquiries about Michael Elston's NHS Survey: nhssurvey@michael-elston.com\nFor other enquiries, please email:\nenquiries@michael-elston.com\nbottom of page",
  "https_www_michael-elston_com_/https_www_michael-elston_com/content_1.html": "MICHAEL ELSTON\nINDEPENDENT\nBolton, Bury, Manchester, Oldham, Rochdale, Salford, Stockport, Tameside, Trafford, Wigan\nGREATER MANCHESTER\nMany thanks to everyone who has sent messages, emails and letters of support over the last few years. Sorry for taking so long to reply to so many people; I've been overwhelmed and under the cosh since my leaflets were distributed throughout Greater Manchester in April 00001. I have read all your correspondence and I'll continue trying to get back to everyone as soon as I have the opportunity. Very best wishes for Christmas and the New Year, Michael Elston\n4th July 2024\nIndependents Day\nThere are 461 Independent candidates, spread across 317 constituencies, standing in the General Election, together with 14 parties of Independents fielding a further 26 candidates between them.\nMichael Elston is standing as Independent candidate for Bury South.\n9th November 2023\nThe Greater Manchester Holiday\nThis year's Greater Manchester Holiday, 8th, 9th & 10th November, featured a Dance Festival (including Baroque Dance, Regency Dance, Tudor Dance and Bhangra workshops and a Baroque Ball with Baroque Dance performance and live music on period instruments) at Stretford Public Hall, together with the usual festivities throughout Greater Manchester.\n20th August 2023\nIt's Time To Rise\nIt was my pleasure to address the crowd at the It's Time To Rise music festival in Ulnes Walton, Lancashire. I spoke about democracy and why it's such a bad thing.\n24th August 2022\n\"Strength in Independence\"\nBest wishes for peace in Ukraine on Independence Day of Ukraine.\n26th July 2022\nMichael Elston Presented With Carved Map of Bucha by Mayor Anatolii Fedoruk\nIn Bucha, the city that came under Russian occupation from 27th February to 1st April 2022, Mayor Anatolii Fedoruk showed Michael Elston the mass graves and discussed the atrocities that had taken place there. Inside the Church of St. Andrew the First-Called Apostle, Father Andrii Halavin led a tour of the photographic display recording some of those atrocities.\n26th July 2022\nMichael Elston visits Ukraine\nDirect TV's news report and article:\nChannel 5's news report and article:\n20th March 2021\nNYAS 'Trouble With The Law' Campaign\nI am supporting the National Youth Advocacy Service's campaign, which calls for better support and protection for care-experienced children and young people within the criminal justice system.\n3rd January 2021\nThe Greater Manchester Flag\nThanks to Wez from Oldham for writing this - “It’s great minded business men with strong hearts like our Mr Michael Elston that will help bring forth the light at the end of this dark tunnel we have been led into, as the industrial heart of our crippling economy, Greater Manchester and its people have always strived and have given their all to keep the clockwork ticking. The Greater Manchester county flag may not be considered a legal registered flag anymore but never the less it will always symbolise where we came from and how far we have come into fruition. We are great and we will always win our battles with strength and honour! We will not be forced into the tunnels any more. We will Prosper and protect our rights.🐝“ - Wesley Holden\n2nd December 2020\nElectric Buses Manufactured in Greater Manchester\nMellor Coachcraft, based in Rochdale, manufactured the world's first fully electric low floor small bus. These are perfect for bus routes with smaller passenger numbers and also for reintroducing bus routes that have been discontinued.\n5th November 2020\nLocal Small Business Owner Victimised by Manchester City Council\nAbid Halim is the proprietor of Shoe Box on Dickenson Road in Longsight. Like many small businesses, Abid is entitled to small business rates relief. However, Manchester City Council has repeatedly refused to grant it, instead serving Abid with a bankruptcy petition, in spite of the fact that he does not owe Manchester City Council anything at all. The hearing will be on 17th November. UPDATE: The case has been transferred to the Business and Property Courts. A contested hearing will take place on the first available date after 15th December.\n20th February 2020\nMichael Elston meets Volt UK\nChapter One Books, the independent coffee shop and bookstore in Manchester's Northern Quarter, hosted Volt's Meet & Greet. Volt is a very positive, forward-thinking, pan-European political party. Many of its members have never previously been politically active. Alex Haida, Manchester City Lead, explained some of Volt's policies, including citizen empowerment and European Union reform. Volt may be influential in our future relationship with Europe.",
  "https_www_michael-elston_com_/https_www_michael-elston_com_no-more-fines/content_3.html": "top of page\nMICHAEL ELSTON\nINDEPENDENT\nBolton, Bury, Manchester, Oldham, Rochdale, Salford, Stockport, Tameside, Trafford, Wigan\nGREATER MANCHESTER\nNO MORE FINES!\nIf elected,\nMichael Elston will rescind all fines issued against anyone who votes for him.\nbottom of page",
  "https_www_michael-elston_com_/https_www_michael-elston_com_nhssurvey/content_7.html": "top of page\nMICHAEL ELSTON\nINDEPENDENT\nBolton, Bury, Manchester, Oldham, Rochdale, Salford, Stockport, Tameside, Trafford, Wigan\nGREATER MANCHESTER\nMichael Elston's NHS Survey\nWhen I first stood in the local elections in 2018, I invited members of the public and medical professionals alike to write in to my NHS Survey.\nI’ve now set up a website for anyone who wishes to share their experiences:\nbottom of page",
  "https_www_michael-elston_com_/https_www_michael-elston_com_no-more-corruption/content_4.html": "top of page\nMICHAEL ELSTON\nINDEPENDENT\nBolton, Bury, Manchester, Oldham, Rochdale, Salford, Stockport, Tameside, Trafford, Wigan\nGREATER MANCHESTER\nNO MORE CORRUPTION\nIf elected,\nMichael Elston will remove council officials from our police stations and from our law courts, will remove powers to issue legal notices without due legal process and will set up an independent body to investigate allegations of corruption.\nbottom of page",
  "https_www_michael-elston_com_/https_www_michael-elston_com_the-right-to-a-fair-trial/content_5.html": "top of page\nMICHAEL ELSTON\nINDEPENDENT\nBolton, Bury, Manchester, Oldham, Rochdale, Salford, Stockport, Tameside, Trafford, Wigan\nGREATER MANCHESTER\nThe Right to a Fair Trial\nIf elected,\nMichael Elston will overturn any magistrates' court or county court judgment issued against a defendant who has not been informed that the trial is taking place, who has not been given sufficient time to find legal representation, or without a trial having taken place at all.\nbottom of page"
}