{
  "https_www_ranil_uk_/https_www_ranil_uk_cdn-cgi_l_email-protection/content_12.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_ranil_uk_/https_www_ranil_uk_news_local-mp-says-police-need-more-powers/content_5.html": "Member of Parliament for North East Hampshire, Ranil Jayawardena MP, presented his petition on unauthorised traveller encampments to the House of Commons on Wednesday 13th June 2018.\nAlmost two thousand residents of North East Hampshire and the wider United Kingdom signed his petition.\nThe petition calls on HM Government to give the police more powers to tackle unauthorised traveller encampments by: (a) making trespass a criminal offence for which the police can direct trespassers to leave; (b) enabling the police to direct travellers to alternative sites within 25 miles, even where this crosses the current retriction of a county boundary; and (c) enshrining a presumption against retrospective planning applications whereby appellants cannot be resident during any appeal.\nMr Jayawardena will use the support expressed by signatories to the petition to respond on behalf of his constituents to the consultation on powers to tackle unauthorised traveller encampments currently being run by the Ministry for Housing, Communities and Local Government, and which closes on Friday 15th June.\nRanil Jayawardena MP said:\n\"Thank you to all those who supported my petition. Together, we can demonstrate to HM Government the strength of feeling amongst the silent majority that more must be done to tackle unauthorised encampments, which have often been hubs for anti-social behaviour.\"\nHe continued:\n\"It is great that the Ministry of Housing, Communities and Local Government is listening and I hope that they pay careful attention to the consultation responses and give the police the powers that they desperately need.\n\"It is only right that everyone be equal under the law—you or I would not be able to build or chop down whatever we wanted, wherever we wanted, especially on someone else's land. It is time to act.\"\nYou can read the proceedings here.",
  "https_www_ranil_uk_/https_www_ranil_uk_about-north-east-hampshire/content_4.html": "The constituency boundaries of the North East Hampshire changed at the 2024 election. Some of the maps above show the changes that have taken place.\nIt might be helpful to explain a little more about our constituency, the towns and villages it includes, and the different tiers of local authority that represent you too.\nThe Parliamentary Constituency of North East Hampshire is among the most beautiful in all England. Its major town is Fleet – which is bordered by Church Crookham and Elvetham Heath – and it also includes Bramley, Crondall, Crookham Village, Eversley, Greywell, Hartley Wintney, Hook, Long Sutton, Odiham, Old Basing and Lychpit, Sherfield on Loddon, Upton Grey and the west of Yateley. The boundaries of this Parliamentary seat encompass some of the most desirable and affluent towns and villages anywhere in the country.\nThe area also has a long association with the Armed Forces. RAF Odiham is a front line support helicopter base working within the Joint Helicopter Command. North East Hampshire is well served by transport links, as well as having direct train routes into London. Consequently, the area is popular with commuters, but it also contains many flourishing local businesses.\nBorough or District Council\nMuch of our interaction with the council is through our borough or district council – and there are two covering North East Hampshire. You can see this in the map above.\nTo the west, we have Basingstoke and Deane Borough Council, which covers the villages within the Wards of Basing and Bramley.\nTo the east, we have Hart District Council, which covers Hartley Wintney, Hook, Odiham and surrounding villages in the centre of the constituency, as well as Yateley West, Fleet and Church Crookham in the east.\nWhichever one represents your neighbourhood, your borough or district council is responsible for bin collections, planning applications and administering your council tax – a part of which they pass on to the county council.\nWhile some people might say Hart voted one way in any election or decision, it is important to know that North East Hampshire does not include all of Hart District and represents significant two big Wards of the Borough of Basingstoke and Deane too.\nCounty Council\nAs well as the borough and district council ward boundaries, each Hampshire County Council councillor represents a division in our constituency. As you can see from the map above, these are larger than the district council wards and don’t necessarily line up. Hampshire County Council is responsible for our local roads, schools and social care.\nYou can find out who your councillors are at: https://www.writetothem.com\nWe also have a directly elected Police and Crime Commissioner for the whole of Hampshire and two Integrated Care Boards (ICBs) are responsible for making decisions about NHS spending in our area.",
  "https_www_ranil_uk_/https_www_ranil_uk_news_local-mp-calls-level-playing-field-residents-facing-unruly-travellers/content_7.html": "Ranil Jayawardena – Member of Parliament for North East Hampshire – took the opportunity at a recent Parliamentary Debate on “Gypsies and Travellers and local communities” to speak out for local constituents, calling for reform of the outdated law in this area which puts the interests of travellers above those of local residents.\nHaving received a lot of correspondence from constituents reporting vandalism, trespassing and threats from travellers in North East Hampshire, Mr Jayawardena took the opportunity to raise the concerns of constituents with the Minister of State for Communities and Local Government, Alok Sharma.\nMr Jayawardena pushed for a review of the law in this area, noting that the current law takes too long to effect; does not give the police sufficient powers to act if the disruption caused is below the threshold of public disorder; and states that the police can only move trespassers on if there is a permitted traveller encampment within the same local authority.\nOn this latter point, Mr Jayawardena claimed that there is a wholly unlevel playing field between the rights of everyday citizens compared to those of gypsies and travellers, stating:\n“If I build a home because I want to live somewhere without permission, the local authority doesn’t have to give me another plot. It’s a totally unlevel playing field and something must be done.”\nHe continued:\n“We do have discrimination in this country, not against Travellers and Gypsies, given the number of advocates they clearly have on the Opposition Benches, but against the hard-working, honest residents of communities up and down the land. They are the silent majority - and are, too often, the forgotten people.”\nRanil Jayawardena continued by taking the opportunity to commend a number of local councillors working on cases in this area, including County Councillor Rhydian Vaughan, who has been working on a traveller case in Bramley, where it is alleged that children of travellers have been firing ball bearings at windows in the vicinity; Borough Councillor Venetia Rowland, who has been working on the illegal felling of 500 trees in Sherfield by travellers; and Silchester Parish Council, which has been tackling the retrospective planning application from an unauthorised traveller encampment.\nRanil Jayawardena concluded his contribution to the debate by saying:\n“I hope today’s debate will be the start of a real shift in Government policy. A policy that’s not shifted since 1994, and will lead to the government reconsidering criminal legislation in this area – recasting existing legislation to make it work. More must be done. Constituents demand it – and, boy, do they deserve it.”",
  "https_www_ranil_uk_/https_www_ranil_uk_news_ranil-jayawardena-mp-welcomes-ps201500-investment-hart-leisure-centre/content_11.html": "Ranil Jayawardena MP has welcomed the news that Hart Leisure Centre in North East Hampshire will benefit from a £201,500 investment to improve its energy efficiency.\nThe funding is part of the Swimming Pool Support Fund which has invested £80 million into 442 swimming pools across the country since last year.\nThe investment will fund energy efficiency measures at Hart Leisure by installing solar panels, relieving financial pressure by reducing running costs.\nUnder the new sports strategy, the Government is aiming to get 3.5 million more people active by 2030, meeting the Chief Medical Officer’s guidance of 150 minutes per week of exercise for adults and 60 minutes per day for young people.\nAlongside the Swimming Pool Support Fund, this Government is investing over £300 million in grassroots sports facilities including football pitches and tennis courts, sticking to the plan to get more people active, improving people’s health to ensure a brighter future for all.\nRanil Jayawardena, Member of Parliament for North East Hampshire, said:\n“Hart Leisure Centre in North East Hampshire is a brilliant facility, allowing people of all ages and abilities to access the mental and physical benefits that come with exercise.\n“That is why I am delighted that Hart Leisure Centre has received £201,500 investment from this Government, improving the pools energy efficiency, keeping running costs down and giving more people the opportunity to swim whilst reducing our environmental impact.\n“By sticking to the plan, this Government has been able to invest in swimming pools across the country, improving people’s health to create a brighter future for all.”\nSports Minister Stuart Andrew said:\n“We are sticking to our plan to get millions more people active by 2030, because we know that active people are fitter, happier and healthier.\n“Millions of people swim every year in England, but increased energy costs mean some pools are struggling financially.\n“This further £60 million of support from the Government and Sport England will ensure hundreds of swimming pools can lower their operating costs in the long run, and continue to provide an important service for communities across the country.”",
  "https_www_ranil_uk_/https_www_ranil_uk/content_1.html": "North East Hampshire\nWho is your local campaigner?\nEnter your postcode to confirm that Sir Ranil Jayawardena is your candidate.\nLocal campaigns\nLocal news\nContact me\nPlease get in touch if I can help you.\nThe Office of Ranil Jayawardena,\nThe Bury, Odiham, Hampshire, RG29 1NB\nThe Bury, Odiham, Hampshire, RG29 1NB\n(01256) 702468\nIt is really important that you include your full name and postal address in correspondence.\nIt is really important that you include your full name and postal address in correspondence.",
  "https_www_ranil_uk_/https_www_ranil_uk_news_ranil-jayawardena-mp-opinion-piece-june-2018/content_9.html": "Since my election in 2015, I have received almost 10,000 pieces of casework—ranging from animal cruelty to the Yemen. Almost none have been as ongoing and persistent, however, as concerns over unauthorised traveller encampments and the behaviour in and around them.\nA great many people—indeed, not just here in Hampshire but across the country as a whole—feel frustrated that in many areas of our law, there is simply not a level playing field. Further, the system discriminates against the hard-working, honest residents of communities up and down the land—the silent majority—far too often.\nFrom littering to lighting fires; from vandalism to victimising vulnerable residents of neighbourhoods; the law needs to change to give our police the powers they need in order to deal with crime and antisocial behaviour more effectively, wherever it arises, whoever is involved.\nI was very pleased when HM Government launched a consultation into what can be done to ensure local authorities and the police are able to deal with illegal encampments more effectively. In order to answer the concerns of my constituents, I will be submitting my own legislative proposals to ensure we see the level playing field that people deserve, by focusing on three main areas.\nFirst, ending the ability of travellers to play the planning system; there are far too many cases where unauthorised encampments have sought retrospective planning approval, which has been granted due to presumption in their favour.\nSecond, at present, the police can only move travellers on if there is an alternative pitch for them to move to elsewhere inside the Hampshire boundary. This arbitrary ban on crossing county boundaries has had its day. I am calling for additional powers so that police can move travellers on to any suitable pitch within 25 miles as well—even if it means crossing county borders.\nFinally, under current legislation, too many conditions must be met before the police can remove trespassers; from necessitating two or more people be present; there being evidence of abuse or criminal damage; or there being six or more caravans. I say that trespassing alone should be a crime and that should be grounds enough for eviction. This is how the law works in the Republic of Ireland and it would work very effectively here also.\nI recently launched a petition to show HM Government the large level of support for these proposals that exists in North East Hampshire. We’ve already had a great response to the campaign and I urge you too to sign and share my petition—ranil.uk/travellers—if you want to see action on this issue also. When we work together, we’re stronger.\nIf you have thoughts on the above, or anything else, I would love to hear from you, so do get in touch either by email: [email protected] or post: Ranil Jayawardena MP, House of Commons, London, SW1A 0AA.\nP.S. Details of my future, regular, free public Q&As for constituents will be on my website here.",
  "https_www_ranil_uk_/https_www_ranil_uk_transformourtowns/content_8.html": "I have always wanted a brighter, more dynamic future for our communities. Transform our towns is my public campaign to help kick-start and support regeneration across Hampshire and the Isle of Wight, breathing new life into our local high streets, retail spaces, services, restaurants, and high-quality housing — and protecting our countryside from unnecessary development in the process.\nOur towns and cities have a rich history but, with significant development in the 1960s and 1970s, many no longer meets today’s needs. It’s time for a fresh start and this surely must be a huge opportunity from the devolution that the government is providing our area.\nCouncils across the area have sought to take regeneration forward, as shown by the news reports on this page. Having led the regeneration of Basing View in Basingstoke — securing a new Waitrose and John Lewis, and launching projects to reinvigorate the leisure park and traditional high street — I know the transformative power of well-planned development and I have a track record of regeneration delivering profit to the taxpayer.\nThough I left Basingstoke and Deane Borough Council in 2015, after my election to Parliament, my belief in the need for regeneration across Hampshire remains — and it is now urgent. Our towns deserve to be places that reflect our modern lifestyles and aspirations.\nObjective\nOur goal is simple: to regenerate our towns and cities so they once again become vibrant centres of community life. By investing in modern, high-quality, purpose-driven development, we can:\n- Revitalise high streets: Replace tired, empty shopping centres with lively spaces that offer unique experiences and cater to modern needs.\n- Create new opportunities: Develop areas that provide first-time buyers with affordable homes, as well as creating appealing options for older residents looking to downsize, all within walking distance of essential shops and services.\n- Protect our countryside: By providing housing within our town centres, which reflects changing market demand, we can prevent unnecessary development in the wonderful countryside across Hampshire and the Isle of Wight.\n- Stimulate local growth: Drive job creation and economic growth by fostering environments where retail, leisure, and high-quality housing coexist to create thriving town centres.\nBenefits\nA modern, attractive town centre\nImagine our town centres transformed into vibrant hubs where residents and visitors alike can enjoy a blend of retail, dining, and community activities. Modern town centres can benefit from the best of Britain's traditional architecture, so that development is in keeping with its surroundings. With a rejuvenated high street:\n- Enhanced community life: Modern spaces encourage social interaction and create a sense of place, making our towns more welcoming.\n- Improved retail experience: New experiences on the high street that focus on service, quality and local flavour, rather than the older model of selling everything that used to be.\n- Sustainable housing options: New, well-designed homes will offer a mix of choices for first-time buyers and downsizers, anchoring our communities in the heart of the town, and boosting footfall to underpin the commercial offer.\nEconomic growth and local prosperity\nRevitalising our towns isn’t just about aesthetics — it’s about creating lasting economic benefits:\n- Job creation: New retail spaces and services mean more local employment opportunities, supporting a new economy centred on experiences and quality.\n- Investment in the future: Upgraded town centres attract further investment, helping to maintain a cycle of growth and renewal.\n- Community empowerment: A thriving town centre supports local businesses, ensuring that our communities remain resilient and self-sustaining.\nA modern approach for a modern economy\nMany of our towns were built in an era that no longer reflects contemporary needs. By embracing regeneration, we can update these spaces to support a modern economy that values experiences, sustainability, and community engagement. This approach not only caters to the current market demands but also lays the foundation for long-term economic stability and growth.\nImpact\nThe economic imperatives for regenerating our towns are clear. In today’s competitive landscape, outdated town centres hold back local growth, limiting job creation, investment, and overall prosperity. By revitalising our high streets and urban cores, we can unlock significant economic potential — creating vibrant, sustainable hubs that attract both new businesses and high-quality residential development. This regeneration can draw on the best of traditional architecture to replace the concrete of the past, but is not just about aesthetics; it’s about re-energising our local economies, enhancing public services, and ensuring that our communities are well-equipped to meet the challenges of the modern era.\nJoin the movement\nI’m inviting you to be part of this transformative journey. Let’s work together to regenerate our towns and cities, creating vibrant centres that offer quality housing, exciting retail experiences, and thriving local economies. Your support can help unlock the full potential of our communities and ensure that Hampshire remains a place where everyone can flourish.\nStand with us. Transform our towns for a better, brighter future.\nYour voice matters. Complete the 60 second survey below and help us build the communities we deserve.",
  "https_www_ranil_uk_/https_www_ranil_uk_cookies/content_10.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_ranil_uk_/https_www_ranil_uk_travellers/content_3.html": "I know the setting up of unauthorised traveller sites can be a nuisance for local communities and an inappropriate development of open space. Many local residents across North East Hampshire are rightly concerned about anti-social behaviour, fly-tipping, and noise related to unauthorised sites.\nThat is why I have campaigned on these issues since before I was elected as Member of Parliament.\nFollowing pressure from me and like-minded MPs, HM Government consulted on changes relating to powers for dealing with unauthorised encampments in 2018.\nIn response to this consultation, we presented a petition to Parliament that was signed by almost 2,000 people across North East Hampshire and surrounding communities. The petition asked HM Government make trespass a criminal offence, enable the police to direct travellers to alternative sites within 25 miles and enable the police to act when there are fewer than six vehicles.\nHM Government listened and a further consultation followed, in 2019, proposing how they could implement a new criminal offence for trespass and amend the Criminal Justice and Public Order Act (CJPO) – the legislation that sets out police powers in relation to unauthorised traveller sites – to extend police powers.\nFollowing this, the Police Crime Sentencing and Courts Act was passed – after the pandemic – in 2022. The Act significantly amended the CJPO Act and extended police powers:\n- A new criminal offence has been created for residing on land without consent, with or without a vehicle.\n- The threshold is now lower at which police can order trespassers to be removed.\n- The list of harms that can be considered by police when directing people away from land has been broadened.\n- Trespassers are now prohibited from returning to land within 12 months, when the limit was previously 3 months.\n- The Act also allows police to direct trespassers away from land that forms part of a highway.\nThe responsibilities of local authorities\nIn addition to police powers, local authorities have responsibilities to deal with unauthorised traveller sites through the planning system.\nIn 2015, HM Government published a summary of powers that public bodies have to help deal with illegal and unauthorised encampments. A range of powers are available to local councils, including:\n- Temporary stop notice\n- Possession order\n- Enforcement notice\nIncreasingly, local authorities are seeking injunctions to deal with unauthorised sites. Basingstoke and Deane Borough Council and Hampshire County Council applied for an injunction against the setting up of unauthorised traveller sites, which was granted by the High Court in 2019. Hart District Council have not done so, however.\nProgress has been made to tackle this issue, but I know the problem does continue to exist. If you are concerned about an unauthorised traveller encampment in the constituency, please do get in touch and I will use my ‘power to pester’ to urge the Police or Council to take action.",
  "https_www_ranil_uk_/https_www_ranil_uk_accessibility/content_6.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_ranil_uk_/https_www_ranil_uk_campaigns/content_2.html": "Transform our towns I have always wanted a brighter, more dynamic future for our communities. Transform our towns is my public campaign to help kick-start and support regeneration...\nHampshire to Heathrow I want a brighter, more connected future for Hampshire. Hampshire to Heathrow is my public initiative aimed at securing the future of rail travel in our region...\nChildren's use of smartphones Every child should have the opportunity to get the best start in life. But children are not able to make the best decisions for themselves. It’s our job – as...\nSex and Gender Issues Survey I am absolutely committed to protecting the rights and freedoms of women and girls. ‘Gender identity ideology’ – the belief that someone can have a ‘gender’...\nPothole Patrol North East Hampshire MP, Ranil Jayawardena, has launched a new campaign to fix potholes in the local area, which present a real danger for road users. The...\nYour views on regeneration Having led the regeneration of Basing View in Basingstoke — securing a new Waitrose and John Lewis, and launching projects to reinvigorate the leisure park and...\nNorth Hampshire Cycle Network I love cycling, and I know that my constituents do so too. Born as a response to the thousands of emails and messages I've received over the years - the North...\nUnauthorised Traveller Encampments I know the setting up of unauthorised traveller sites can be a nuisance for local communities and an inappropriate development of open space. Many local...\nBacking Our Servicemen and Women The first duty of HM Government is to keep us safe from those who do us harm—within or without. Our fantastic servicemen and women put their lives on the line...\nA New School For North Hampshire Our new school—FAQs, Information and Survey \"Our children deserve the best start in life—regardless of where they live or what their families can afford. \"As...\nDevolution across Hampshire and the Isle of Wight In his role as Chairman of the All-Party Parliamentary Group for Hampshire and the Isle of Wight, Ranil Jayawardena MP hosted a meeting in Parliament yesterday...\nBrownfield regeneration in Hart Defence Secretary and Ranil Jayawardena MP support brownfield regeneration in Hart District."
}