{
  "https_johnnymercer_co_uk_/https_johnnymercer_co_uk/content_1.html": "Welcome to the Official Website of Johnny Mercer, where you can contact him for any Business, Public Speaking or Media inquiries.\nJohnny Mercer now operates a discreet consultancy business and does not disclose his clients. Ranging from Strategic Risk to Public Policy, Government Affairs and Strategic Leadership, Johnny will always have an exploratory call to see if he could be a right fit for your business.\nShort or longer term projects; domestically or internationally. John is happy to provide references upon request.\nUse the contact form to initiate a discussion with Johnny directly.\nJohnny Mercer is happy to do a small number of bespoke speaking engagements both in the UK and Internationally. Reflecting on his remarkable journey from seeing the plight of his fellow UK Combat Veterans from the war in Afghanistan, to forcing structural changes in UK Government - all at a time of unique political and strategic international change - Johnny's famous \"Chatham House Rules\" speeches are in high demand.\nVisit Chartwell Speakers Bureau to find out if Johnny might be suitable at one of your events.\nAs the best-selling Author of the acclaimed \"We Were Warriors\" book and a BAFTA nominated Television participant, Johnny Mercer is regularly requested to appear in media projects. Whilst he has chosen not to appear since the July 2024 election, Johnny is interested in making films such as his documentary on Ukraine, his show with Alistair Campbell on 'Make me Prime Minister', and the BAFTA nominated 'Banged Up' - all on Channel Four.\nFor all media related enquiries, please contact Johnny's agent - andrew@cloud9management.co.uk\nA former UK government Cabinet Minister specialising in public affairs, strategic communication and crisis management, Johnny Mercer is trusted by successive UK Prime Ministers as a holder of strategic relationships and information of national importance, with a reputation for unpicking the most complex political and regulatory deadlocks. Johnny Mercer is an expert communicator and thought leader of sensitive legislation, especially where stakeholders are unaligned and issues are emotive. He's recognised across UK Government as being an expert in crisis communications and management. Delivered one of the most effective political social media campaigns of a generation. He led the transformation of government departments and delivered multi-billion pound projects that reach across the spectrum of public affairs, strategic communication and crisis management. An expert in deflecting politically motivated scrutiny, Johnny Mercer has a reputation for taking a principled stance even under intense political and legal pressure. Embodies legitimacy and trust.\nA combat Veteran from Afghanistan, Johnny Mercer left the UK Commandos in order to change the UK Government's approach to his generation of war Veterans. Elected at the first opportunity in a 'no-hoper' seat, Johnny Mercer set about reforming UK Veteran's care in the third sector, statutory provision and commercial environment. Serving two Prime Ministers, Johnny established the UK's first Office for Veterans Affairs and became the UK's first Veterans Minister at the UK Government Cabinet table.\nDuring two periods in Government, Johnny Mercer passed legislation into UK Law which enshrined the rights of the United Kingdoms' Armed Forces Veterans. He designed and operationalised multi-million pound Nation-wide programmes to deliver the UK's first Veteran specific pathways in mental and physical health; homelessness, the criminal justice system and commercial employment opportunities. He drafted the UK's first \"Veterans' Bill\" before leaving Parliament in July 2024.\nJohnny was particularly close to UK PM Rishi Sunak",
  "https_johnnymercer_co_uk_/https_johnnymercer_co_uk_privacy-policy/content_2.html": "Copyright © 2025 Official Website of Johnny Mercer - All Rights Reserved.\nDesigned by Johnny Mercer\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
}