{
  "http_www_kelly4rochesterandstrood_com_/http_www_kelly4rochesterandstrood_com/content_1.html": "As a local business women It was a privilege to have served as the Conservative MP for my home towns between 2015-2024. During my time in Parliament I served as the Minister for Small Business, Minister for Aviation & Maritime, Minister for Housing, Deputy Chief Whip and Minister for Childhood & Schools.",
  "http_www_kelly4rochesterandstrood_com_/http_www_kelly4rochesterandstrood_com_news_category_Opinions/content_6.html": "Chatham awarded extra funding from Home Office for safer streets 27th October 2023 I am delighted that the Home Office has announced the Safer Streets Fund (Round Five) 5, which includes £284,523.65 for Chatham Town Centre. The Safer Streets... ArticlesLocal NewsOpinions\nKelly Tolhurst MP Question to Policing Minister 19th September 2023 On Monday 18th September, I raised with the Policing Minister in the House of Commons the frustration and concern of constituents and businesses at the ongoing... ArticlesLocal NewsOpinions\nSoutheastern Reinstates 2 Trains an Hour to St Pancras 18th September 2023 I was very pleased to hear that Southeastern are going to be reinstating 2 trains an hour to St. Pancras from 10th December. Other Kent MPs and I have been... ArticlesLocal NewsOpinions\nKelly Tolhurst MP welcomes the decision to scrap the HIF 12th July 2023 I took a stand against the HIF proposals and the previous Council Leader back in 2018 when the full plans were made clear. Along with elected Ward Councillors... ArticlesLocal NewsMediaOpinions",
  "http_www_kelly4rochesterandstrood_com_/http_www_kelly4rochesterandstrood_com_debt-breathing-space-scheme/content_4.html": "In October 2016 I was delighted to launch my private members’ bill: The Families With Children in Debt (Respite) Bill. I have been honoured to receive significant support and was joined at the launch by a distinguished panel from the charity sector, including Martin Lewis from Money Saving Expert and Yvonne Forvague MP, Chair of the APPG on Debt and Personal Finance.\nHaving only been elected one year at this time, I was indeed surprised to be selected in the ballot to bring forward a Bill so soon. However, as many will know, the welfare of children and families has always been a paramount issue for me.\nThat is why I was delighted to team up with The Children’s Society once again with their campaign to introduce a ‘Breathing Space’ scheme for vulnerable people and families in debt. With the valuable assistance from Step Change debt charity and others from the sector, we have been able to produce a Bill and plan to build momentum around the issue.\nWhen it comes to problem debt, there is often unnecessary complications around getting the help and support needed to return to stability. Unfortunately, too many people don’t seek advice on their debt soon enough and creditors are not always giving people the help they need when they need it.\nProblem debt typically arises as a result of an income shock, such as sudden loss of employment or family breakdown, which can lead to a downward cycle of debt dependence and growing debt burden, at no fault of the individual themselves.\nThe Breathing Space Scheme will protect children and families in debt from the damage of debt enforcement and help them get back on their feet to repay their debts. Our energy and effort has now turned to ensuring the scheme delivers for families and does so as quickly as possible.\nIn Rochester and Strood alone, 15.9% of adults are over indebted accounting for over 13,700 people, many of whom could be vulnerable or have dependents.\nFollowing support from across the House of Commons and Lords, the Government has now committed to the implementation of a Breathing Space scheme.\nI am delighted to have been able to bring forward this new piece of legislation and showcase the best of our democracy for those families who find themselves in unfortunate circumstances through no fault of their own.\nI am also thankful for the widespread support I have received from colleagues and charities, such as the Children’s Society and Step Change Debt Charity, in putting together a strong campaign, and I look forward to pressing forwards ensuring the Breathing Space Scheme works in practice.",
  "http_www_kelly4rochesterandstrood_com_/http_www_kelly4rochesterandstrood_com_kelly-parliament/content_3.html": "Tweet You can read Kelly's speeches and appearances in Parliament below (provided by theyworkforyou):\nChatham Docks Basin 3 Redevelopment - [Sir Philip Davies in the Chair] | Westminster Hall debates Thank you, Sir Philip, for calling me to wind up. I thank the Minister for Housing, Planning and Building Safety, my hon.\nChatham Docks Basin 3 Redevelopment - [Sir Philip Davies in the Chair] | Westminster Hall debates Thank you, Sir Philip, for calling me to wind up. I thank the Minister for Housing, Planning and Building Safety, my hon.\nChatham Docks Basin 3 Redevelopment - [Sir Philip Davies in the Chair] | Westminster Hall debates Will the hon. Gentleman give way?\nChatham Docks Basin 3 Redevelopment - [Sir Philip Davies in the Chair] | Westminster Hall debates I am grateful to the shadow Minister. However, I would like to pull him up on the point he made about the nimby debate.\nChatham Docks Basin 3 Redevelopment - [Sir Philip Davies in the Chair] | Westminster Hall debates I am grateful to the shadow Minister. However, I would like to pull him up on the point he made about the nimby debate.\nChatham Docks Basin 3 Redevelopment - [Sir Philip Davies in the Chair] | Westminster Hall debates Will the hon. Gentleman give way?\nChatham Docks Basin 3 Redevelopment - [Sir Philip Davies in the Chair] | Westminster Hall debates I think the hon.\nChatham Docks Basin 3 Redevelopment - [Sir Philip Davies in the Chair] | Westminster Hall debates My right hon.",
  "http_www_kelly4rochesterandstrood_com_/http_www_kelly4rochesterandstrood_com_news_royal-engineers-freedom-parade-rochester/content_2.html": "An honour to attend the Corps of Royal Engineers Memorial service at Rochester Cathedral this morning remembering and giving thanks to all those brave men and women who have served and serve our country #RoyalEngineers we are all so proud to be the home of 1 RSME Regiment at Brompton Barracks. Fantastic Freedom of Medway parade in #Rochester with Lord-Lieutenant of Kent Lady Colgrain and Chief Royal Engineer Lieutenant General Sir Chris Tickell taking the salute. Great to also catch up with old friends",
  "http_www_kelly4rochesterandstrood_com_/http_www_kelly4rochesterandstrood_com_about-rss/content_5.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour."
}