{
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com/content_1.html": "Intro Video (background video that auto-plays without sound)\nJames Cartlidge MP\nMember of Parliament for South Suffolk\nI'm James Cartlidge and it’s a great honour to be the Member of Parliament for South Suffolk. Here you can find my latest news, campaigns and more about me and what I believe in.",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_privacy/content_9.html": "This document outlines how James Cartlidge MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is James Cartlidge MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact James Cartlidge MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of James Cartlidge MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact James Cartlidge MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_accessibility/content_12.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_news_suffolks-conservative-mps-seek-protection-councils/content_6.html": "Suffolk's Conservative MPs have written to the county council asking for town and parish councils to be protected in the devolved future of the county.\nNick Timothy, MP for West Suffolk, James Cartlidge, of South Suffolk, and Central Suffolk and North Ipswich's Patrick Spencer have collectively written to Tory council leader Matthew Hicks and cabinet member for devolution Richard Rout asking for certain assurances as devolution pushes on.\nTheir wish is that the council ensures that town and parish councils are protected in whatever new shape local government takes - amid plans by the UK government to do away with two-tier councils.\nIn their letter, the trio wrote: \"The proposals to change our council structure could done properly bring more efficient local government, improve transparency and accountability, and still give local residents more power over life in their local communities.\n\"Done badly, however, there is a risk that the change might mean important decisions are taken even further away from residents, and in a way that leaves them with less power than before.\n\"This is why we believe it is vital that any money saved through local government reform must remain in Suffolk.\n\"And it is why, as part of the reform, we believe we need clear and binding commitments about the powers and budgets of parish and town councils.\"\nThey would like to see a space where the community councils could have a say in their planning applications, flood prevention and road safety.\nThe MPs had also previously met with Mr Hicks and Mr Rout to discuss devolution plans, and said that they would be happy to meet to further discuss how these projections can be made.\nSuffolk County Council is currently looking to build one unitary authority for the entire area, which it says would be the only form to save money.\nOn the other hand, the district and borough councils are looking to build two or three local councils in Suffolk.\nPublished by the East Anglian Daily Times.",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_news_mp-pays-visit-archive-group/content_14.html": "With the Hadleigh Town Archive Group volunteers.\nA Member of Parliament has encouraged Hadleigh residents to make the most of their local archive, to stay in touch with their heritage.\nThe Hadleigh Archive Group welcomed South Suffolk MP James Cartlidge to the town’s Guildhall last week to showcase significant documents relating to the history of the town.\nVolunteers showed Mr Cartlidge a range of archived materials, such as a 1432 charter confirming the market, and market rights granted in 1252 to the Lord and Lady of Toppesfield Manor.\nThe archive group, which falls under the umbrella of Hadleigh Town Council, has conserved and catalogued thousands of documents, including more than 6,000 scanned photographs of the town through the ages.\n“I thoroughly enjoyed my visit to the Hadleigh Town Council Archives,” said Mr Cartlidge.\n“I would encourage any constituents who are interested in the history of the town to get in touch with the group directly.”\nTo contact the archive group, send an email to [email protected].\nPublished in the Suffolk Free Press.",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_supportforconstituents/content_2.html": "I’ve received lots of correspondence from concerned constituents about the Government’s plans to scrap the Winter Fuel Allowance. This page includes details about the Household Support Fund and how to apply for Pension Credit. If you are concerned about the impact of the regulations, or ever need my assistance, please do not hesitate to contact me on [email protected]\nHousehold Support Fund\nThe Government announced on 2nd September 2024 that the Household Support Fund would be extended to April 2025. This scheme is designed to support those who have been most affected by the rising cost of living and you can apply through the County Council. Please see here for more information - https://www.suffolk.gov.uk/community-and-safety/communities/healthier/cost-of-living-support/household-support-fund.\nPension Credit\nWhat is Pension Credit?\n- Pension Credit gives you extra money to help with your living costs if you’re over State Pension age and on a low income. Pension Credit can also help with housing costs such as ground rent or service charges.\n- You might get extra help if you’re a carer, severely disabled, or responsible for a child or young person.\n- You can get Pension Credit even if you have other income, savings or own your own home.\nAm I eligible for Pension Credit?\n- You must live in England, Scotland or Wales and have reached State Pension age to qualify for Pension Credit.\n- If you have a partner, you must include them on your application – to be eligible you must both be State Pension age, or one of you must be in receipt of Housing Benefit for people over State Pension age.\n- Pension Credit tops up:\n- Your weekly income to £218.15 if you’re single\n- Your joint weekly income to £332.95 if you have a partner\n- You may get extra amounts if you have other responsibilities and costs.\n- There is additional eligibility criteria to consider when applying for Pension Credit, so please make sure to read this page thoroughly before applying - https://www.gov.uk/pension-credit/eligibility\nHow to apply for Pension Credit:\n- You can apply online HERE, via the phone by calling 0800 99 1234 or by post by sending this form to Freepost DWP Pensions Service 3\n- You will need you National Insurance Number, information about your income, savings and investment, your bank account details\n- You can begin your application up to 4 months before you reach State Pension Age. You can check when you will State Pension age HERE.\n- You can apply any time after you reach State Pension age but your application can only be backdated by 3 months. This means you can get up to 3 months of Pension Credit in your first payment if you were eligible during that time.\n- If you need help with your Pension Credit application, voluntary organisations such as Citizens Advice or Age UK may be able to help",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_jobsfair/content_8.html": "James Cartlidge MP's Employment & Careers Fair\nFriday 4th April 2025\n10:00 - 13:00\nSudbury Arts Centre, Market Hill, CO10 2EA\nOn Friday 4th April, I am hosting my annual Employment & Careers Fair to link local businesses with people seeking employment, looking for new opportunities, and those looking to develop their skillset.\nA range of businesses and organisations have been invited to attend to discuss the employment opportunities, apprenticeships and work experience placements that they have to offer. We have received brilliant support so far from the Department for Work & Pensions and the local job centre who will be holding CV workshops and 1-1 advice sessions focussing on upskilling local people.\nIf you are looking for a new opportunity, please sign up below.",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_about-james-cartlidge/content_4.html": "James Cartlidge lives in the constituency with his family. James was a Babergh district councillor until May 2015, representing the parishes of Bures St Mary, Little Cornard and Newton Green. His professional background is as an entrepreneur, having founded Share to Buy, a shared ownership property portal, mortgage broker and host of the ‘London Home Show’, the capital’s biggest event for first time buyers.\nIn addition to running Share to Buy, James was previously a volunteer ‘dragon’ to the homelessness charity St Mungos’ Broadway, acting as a small business advisor, sitting on a panel to decide which clients of the charity would receive grants to start a small venture. James previously stood for Parliament in Lewisham Deptford (2005 general election). In his spare time, James is a drummer for a local pub band. He enjoys cycling around South Suffolk and spending time with his family in the beautiful countryside and villages of the constituency.\nJames was first elected to Parliament in 2015. Prior to the 2017 election, James was Chairman of the All Party Parliamentary Group on Housing and Planning. He was also a member of the Public Accounts Commission and sat on the Work and Pensions Select Committee. After the 2017 General Election, James was appointed as the Parliamentary Private Secretary (PPS) to the Health Ministers. At the beginning of 2018, James was promoted to PPS to the Secretary of State for Health & Social Care, Jeremy Hunt, and remained his PPS when Hunt was promoted to Foreign Secretary. Following Boris Johnson becoming Prime Minister in July 2019, James was appointed as PPS to the Secretary of State for Defence. In February 2020, James was appointed as PPS to the Chancellor of the Exchequer.\nMinisterial Appointments:\nFollowing the 2024 General Election, James was appointed as Shadow Secretary of State for Defence. He was previously Minister for Defence Procurement from April 2023 to May 2024, and Exchequer Secretary to the Treasury from October 2022 to April 2023.\nHe also served as Parliamentary Under Secretary of State at the Ministry of Justice between September 2021 and July 2022.",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_news_james-cartlidge-drones-are-future-warfare-and-anglo-ukranian-industrial-alliance-can-take-us/content_7.html": "James Cartlidge is Shadow Defence Secretary and has been MP for South Suffolk since 2015.\nIt is estimated that attack drones have been responsible for 80 per cent of all battlefield casualties in the Russia-Ukraine conflict.\nGiven that artillery is likely to have been the greatest battlefield killer of the first and second world wars, this emphasises the fact we are seeing a revolution in warfare in Ukraine – and one we need to learn from if we are to ensure our own defences are fit to fight the latest threats.\nUncrewed warfare thus forms the subject of my fourth and final thought piece for ConHome in advance of the Government’s Strategic Defence Review (SDR), promised ‘by the spring’.\nIn October 2023, as minister for defence procurement, I first visited one of the companies making drones that would go on to do real damage against Russian forces in Ukraine. Two particular facets of the capability I witnessed stood out.\nFirst, the long-range, one-way attack drone in question had good and bad days, as with all such systems. This is because evolution happens in drone wars at breathtaking speed and there is thus a need to constantly adjust the platform in question, in a process known as ‘spiral development’, so that it can maintain competitive edge.\nAs I visited, the company were receiving real-time feedback from the front line and adjusting their technology there and then. For a minister accustomed to the typically drawn-out procurement timescales of MoD ‘business as usual’, this was a revelation.\nThe other striking feature? The company was British, not Ukrainian. This was a start-up SME based in England that had produced a weapon that would have real impact in a European land war, against a peer military power, for a fraction of the cost and time associated with the missiles produced in such small numbers by the big defence companies (the ‘primes’).\nThis experience would serve as an inspiration when I launched the MoD’s first ever Defence Drone Strategy last February. Earlier this month Labour confirmed in a written answer that they would continue the Drone Strategy – so how are things progressing and what does this mean for the SDR?\nThere is no question that our armed forces possess a wide range of uncrewed capabilities. In ISR (Intelligence, Surveillance and Reconnaissance), the RAF’s Reaper drones have been in service since 2007, and though they represent a price point and capability redolent of the pre-Ukraine era (they were designed to survive) they have been highly successful in the Middle Eastern theatre.\nOn logistics, I launched the Drone Strategy at another British SME, Maidenhead-based Malloy Aeronautics, whose heavy-lift quadcopter drones have been used in Ukraine to resupply their army. It was recently confirmed that their T-150 model will be used by the Royal Navy to carry supplies between ships of the Carrier Strike Group – freeing up crewed helicopters to focus on other tasks.\nA key benefit of uncrewed systems is taking our service personnel out of harm’s way; one of the last procurements I announced at the MoD was securing 50 T-4 bomb disposal robots, which are also able to deal with chemical threats.\nMeanwhile the Royal Navy recently took delivery of its first uncrewed mine clearance vessel, another procurement built on considerable work undertaken by the previous Government and vital to protecting British interests given concerns over threats to cables and other subsea infrastructure.\nIf drones are becoming critical to warfighting, of course, then so too is effective counter-drone technology. I believe ‘Directed Energy Weapons’ could play a major role in protecting our people and platforms from drone threats, and I accelerated development of two: the DragonFire laser, to give our naval ships an anti-drone air defence by 2027, and the RF DEW kinetic soundwave weapon, potentially capable of knocking out multiple drones with one hit.\nHowever, there is a glaring weakness with our inventory: lack of mass. In the Defence Drone Strategy’s foreword I wrote:\n“It is in the uncrewed space that we will increasingly drive the mass of our forces, whilst in parallel strengthening the lethality and survivability of all our platforms and personnel”.\nWhether we like it or not, no magic wand could deliver vastly more traditional tanks, ships and combat planes in the near term; it would take years, and would be beset by the usual challenges of cost and recruitment. Whereas, drones can be far more affordably produced (and spirally developed) at extraordinary scale and pace.\nAs with everything in British defence, drone procurement is largely on hold whilst we await the SDR. To illustrate, I recently tabled a Parliamentary Question asking the MoD how many military drones they had purchased since last July’s election.\nThe answer? Three. Not three million, three thousand or even three hundred. Just three – and all for reconnaissance. Zero for attack.\nUkraine will produce around three million drones this year. We may not be at war, but our military surely needs hundreds of drones, if not thousands, just for training.\nOf course, the written answer stressed that – as we did – that Labour have been purchasing significant numbers of British-made attack drones for Ukraine. Yet the whole point of my Defence Drone Strategy was that whilst we would initially focus on providing drones to Ukraine, we would learn from that and develop our own domestic industrial base, to supply drones to the British armed forces at scale and at pace.\nTo understand the art of the possible, one only needs to see what is happening in Ukraine. Last week I visited a company in Kyiv producing vast numbers of lethal long-range one-way attack drones which rival far more expensive systems in terms of strike capability, but are produced in days rather than years – and at a far lower cost than traditional armaments manufacture.\nThe factory was abuzz with a workforce so obviously committed to the national endeavour of their country’s war effort. This was a recent start-up, producing a genuine mass of military effectors – piled high on over-brimming shelves, ready for the frontline – to an affordable budget and in rapid time.\nScale-up has been a traditional challenge for all British SMEs. How can our defence industrial sector deliver similar affordable mass?\nOne option is investment from a defence prime – and Malloy, together with other drone SMEs, have since been bought up by BAE Systems. But I happen to think one way to enable a step change in our munitions’ output is for British manufacturers, defence or otherwise, to team up with Ukrainian drone producers.\nOf course, any new lines of production would require security of IP, and need to be genuine ‘additional’ capacity, as the Ukrainian authorities would rightly never permit diversion of home-grown drones to international export whilst they are at war.\nBut, if such capacity was completely new, Ukrainian firms would benefit from a secure alternative base, away from the bombing threat. Most importantly, for us and them, any order could be doubled up to include the British armed forces, who would gain rapid access to affordable battle-winning kit.\nThere are still drone sceptics, and it was recently put to me by one such expert that NATO would ‘fight differently’ to Ukraine, and that NATO’s far greater number of fighter jets would theoretically avoid the attritional conflict that has arguably made drones so important in Ukraine.\nThis is not, however, just about one aspect of land warfare. Ukraine arguably pulled off one of the greatest naval victories of modern times in the Black Sea, following devastating attacks on Russia’s ‘traditional’ naval vessels by cheap but deadly maritime attack drones. Our own fleet was recently challenged by Houthi drones in the Red Sea, presenting a dilemma: how to deploy air defence systems without denuding missiles for ‘cheap’ targets?\nBut when we talk about drones we are really, in the medium-term, talking about ‘autonomy’: robot warfare. From uncrewed air defence ‘arsenal barges’ for the Navy, to robotic land systems able to resupply armies in battle, I am convinced that such drones offer the potential to transform our fighting capability across the board, especially when coupled with AI.\nSo a top priority for the SDR must surely be to set out a path for the UK to become a leading nation in the use of autonomous, pan-domain uncrewed systems. To do that, we need mass, and to gear up our industrial base. I believe that partnering with Ukrainian firms who have done this in real time would be a great starting point.\nPublished by ConservativeHome.",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_news_category_Local-News/content_11.html": "Suffolk's Conservative MPs seek protection for councils 20th April 2025 Suffolk's Conservative MPs have written to the county council asking for town and parish councils to be protected in the devolved future of the county. Nick... Local News\nJames Cartlidge: Drones are the future of warfare, and an Anglo-Ukranian industrial alliance can take us there 14th April 2025 James Cartlidge is Shadow Defence Secretary and has been MP for South Suffolk since 2015. It is estimated that attack drones have been responsible for 80 per... Local News\nHadleigh Community Primary School to transform outdoor area 10th April 2025 Hadleigh Community Primary School received a donation from Persimmon Homes Foundation pupils at Hadleigh Community Primary School will have their outdoor... Local News\nSouth Suffolk MP’s annual employment and careers fair set to return to Sudbury 3rd April 2025 An annual fair to help connect employers with young people and jobseekers in the Sudbury area is set to take place tomorrow. The South Suffolk Employment and... Local News\nEmployment & Careers Fair 2025 Feedback Form 1st April 2025 If you attended my 2025 Employment & Careers Fair, please provide your feedback on the form below. Local News\nSuffolk MPs respond to Rachel Reeve's Spring Statement 26th March 2025 Suffolk MPs were divided as the UK Chancellor delivered her controversial Spring Statement to the House of Commons. The biggest changes announced by Rachel... Local News\nOrmiston Sudbury Academy in Tudor Road to be redeveloped 19th March 2025 A secondary school in Sudbury will be demolished and rebuilt after plans were given the go-ahead. Building work at Ormiston Sudbury Academy, in Tudor Road... Local News\nJames Cartlidge supports The Angel Hotel Lavenham staff 19th March 2025 An MP has called for outstanding wage bills owed to staff that worked at a 600-year-old pub to be paid after it closed last month. South Suffolk MP James... Local News\nFormer factory to be entirely demolished 4th March 2025 Leaders 'delighted' at Delphi site demolition in Sudbury Local leaders say they are \"delighted\" to see demolition works begin at a former town factory site, but... Local News",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_news_my-latest-sfp-column-april-2025/content_3.html": "With the ‘on and off’ Trump tariffs, and the fate of British Steel requiring Parliament to sit on a Saturday – only the third time since I was elected almost a decade ago – it has felt like another period of swirling instability is upon us, the likes of which we would have all hoped to have passed with the back of the pandemic. Alas, challenging times remain on both the home economic front, and in terms of conflict abroad, so it’s perhaps appropriate that in this column I’ll be reflecting on my recent Sudbury Jobs Fair, and a very moving visit to Ukraine.\nFrankly, I am concerned by the state of our economy, both nationally and locally. Whilst trying to resist the temptation to stray too far into the overtly political, I cannot get over the irony of ‘emergency’ measures to keep furnaces burning for primary steel production, when two of our most important primary industries have been subject to such terrible treatment since the election: farming and North Sea oil.\nYes, the growing threats we face mean we need to think far more strategically about assets like British Steel. Nevertheless, when we import Norwegian fossil fuels from the same basin the Government refuse to drill in - for wholly ideological reasons - and our food security is threatened by existential taxes on family farms, it’s hard to accept that the Government is properly focused on making our country stronger.\nThere is increasing evidence that economic weakness is starting to filter through into available vacancies. Anecdotally, for my fourth Jobs Fair – held at the Sudbury Arts Centre on April 4th – I sensed both a longer queue of visitors and fewer vacancies.\nThat said, I’ve always remarked how our local economy tends to buck national trends and there were still plenty of jobs and opportunities on offer, including: retained fire fighters; bus driving; the Police; and technically skilled positions in the local silk industry and at Nestle Purina. In addition, there were plenty of apprenticeship opportunities too, alongside providers of support and training to help those lacking the confidence to return to the workplace. Overall, I was very pleased with both the turnout and the buzz of job-hunting that my event engendered in the heart of Sudbury. Moreover, despite the situation regarding the Bridge Project (who were previously running the Arts Centre day-to-day), their interim team still managed to put on an excellent event in what remains a top-class venue.\nThough fundamentally a constituency event, the Jobs Fair is not wholly separate from my responsibilities as Shadow Defence Secretary – and I say this not just because the Royal Navy and British Army were recruiting at the event. As I’ve said in recent media interviews in my Shadow Cabinet role, as a country we are going to have face up to the big challenge of spending less on welfare and more on Defence. That means shifting more people from disability benefits into meaningful employment, and building a more resilient nation.\nTo that end, it was inspiring to visit a drone manufacturer in Ukraine last week, to see the way their whole society is pitching in to the war effort. When I was Minister for Defence Procurement, I was determined to build a faster and more agile system for procuring military equipment. My inspiration was a visit to a UK drone company, producing a highly effective capability that has been used on the Ukrainian battlefield. But whilst we have produced some very technologically able drones in the UK, in Ukraine it’s the scale of their production which is so impressive.\nOf course, this is due to the country being at war, and that is something we would never again hope to face. The recent bombing of Sumy by Russia, killing civilians with a ballistic missile containing cluster munitions, was truly shocking. So on my visit to Kyiv, I was privileged to be able to lay flowers at the Wall of Memory, honouring those tragically lost in this senseless war.\nI know that the need to ‘toughen up’ as a nation – spending more on defence; tightening welfare rules – is uncomfortable territory for many. However, to visit a nation under constant threat of bombardment is to witness first-hand the consequences of failing to deter aggression. As this week we mark the 80th anniversary of the liberation of Bergen-Belsen concentration camp by the British Army, the lesson is the same as that in Ukraine: be strong as a nation and stand up to bullying dictators.\nPublished in the Suffolk Free Press.",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_campaigns_5050/content_10.html": "This month I will be turning 50 and I wanted to mark this by cycling 50 miles for a very special charity - although on my old mountain bike it will feel more like 100 miles!\nThe Bumblebee Children's Charity - based in Sproughton - is a specialist centre that works together with families to support babies and young children with physical difficulties by offering a free and fun filled sensory programme.\nHaving celebrated their 1st Birthday with them back in 2016 just after I was first elected, I have witnessed first hand for almost a decade the profound impact that this charity has on children and their families in Suffolk.\nIf you would like to sponsor me and help to raise money for the brilliant Bumblebee Children's Charity, please see the details below:",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_cdn-cgi_l_email-protection/content_15.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_campaigns/content_5.html": "South Suffolk Farming Group On Friday 7th February I held the inaugural meeting of my South Suffolk Farming Group in Semer. The aim of the meeting was to discuss how we can best support...\nFlooding in Hadleigh Visiting Hadleigh sluice gates. Please find below a response that I have received from the Environment Agency with regard to the sluice gates in Hadleigh.\nAssisted Dying Public Meeting Responding to the 'Assisted Dying' Westminster Hall debate on Monday 4th July 2022 as Justice Minister responsible for Criminal Law. You can find a copy of my...\nNominate a Community Champion 2025 In my time as the Member of Parliament for South Suffolk, I have met so many local people who do fantastic things for our local community. For the third year...\n50@50 This month I will be turning 50 and I wanted to mark this by cycling 50 miles for a very special charity - although on my old mountain bike it will feel more...\nCharity Funding Fair On Friday 6th October, I am hosting a 'Charity Funding Fair' in collaboration with the National Lottery Community Fund from 15:30 – 16:30 at Sudbury Town Hall...\nCommunity Surgery I will be holding a community surgery at the Freston Boot, IP9 1AB on Friday 21st July from 17:30. A community surgery gives you the opportunity to raise any...\nEmployment & Careers Fair 2023 James Cartlidge MP's Employment & Careers Fair Friday 17th February 2023, Hadleigh High Sports Centre. The Fair on Friday 17th February had more than 50 stands...\nSurvey of South Suffolk SMEs I am extremely concerned about the impact of the rise in energy costs on our local businesses. I have therefore launched a survey to collate feedback on the...\nEA GREEN New Pylons Survey - Offshore Alternative At a recent meeting of National Grid and East Anglian MPs, they said that an offshore alternative HAD been adequately consulted upon when they engaged with...\nEast Anglia GREEN Consultation April - June 2022 National Grid's East Anglia GREEN non-statutory consultation: A number of South Suffolk villages could be directly affected by National Grid’s proposals for a...\nImproving The Copdock Interchange National Highways are considering the proposed improvement of the A14 Junction 55 Copdock Interchange as part of their continued investment in the East of...",
  "https_www_jamescartlidge_com_/https_www_jamescartlidge_com_news_category_Reports/content_13.html": "Conservative response to the Strategic Defence Review 28th September 2024 Below you can find the Conservative response to Lord Robertson's Strategic Defence Review. Published on 28th September 2024. Reports"
}