{
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk/content_1.html": "Your local Green Party for all of Camden\nAction on climate change\nOnly Greens have a record of speaking up for action strong enough to tackle the climate change emergency.\nSocial Justice\nGreens are passionate about building a country where everyone has a good quality of life.\nOur community\nCommunity is at the heart of everything Greens do.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_news/content_10.html": "Highgate newsletter spring 2025 19th February 2025 / 19th February 2025 by brigitteascher Read more »\nIntroducing three Green candidates 14th August 2024 by brigitteascher On 5 September, by-elections will be held in three wards in Camden. This is to replace the councillors who were elected to Parliament a few months ago. Camden Green Party is proud that three excellent candidates will be standing in these wards. We hope they can count on your support! James Dicker – Camden Square […] Read more »\nSupport for Green Party candidates jumps 5th July 2024 / 29th October 2024 by brigitteascher After a general election that proved momentous for the country and the Green Party, we thank all of you who placed their confidence in one of our two candidates in Camden. In Hampstead & Highgate, Lorna Jane Russell received 6,630 votes, placing the Green Party in third place. This represents a massive increase in the […] Read more »\nGreen candidates selected for general election 2nd June 2024 / 2nd June 2024 by brigitteascher Camden Green Party has selected its parliamentary candidates in the two Camden constituencies, following internal elections. David Stansell, Chair of Camden Green Party, has been chosen as the candidate in Holborn and St Pancras, where he will take on Labour leader Keir Starmer. He brings a wealth of experience and previously stood for Parliament for […] Read more »\nZoe Garbett launches manifesto for London 8th April 2024 / 8th April 2024 by brigitteascher London’s Green candidate for mayor, Zoe Garbett, today launched the manifesto “for a greener, more affordable London”. Click here for the full manifesto, and here for the mini version. Read more »\nCandidate selected for Frognal 2nd April 2024 / 2nd April 2024 by brigitteascher Charles Harris has been selected to stand as the Green Party candidate in the upcoming by-election in Frognal. The by-election will be held on 2 May at the same time as the London-wide Mayoral and Assembly elections. Read more »\nResponse to Camden’s Local Plan consultation 15th March 2024 / 15th March 2024 by brigitteascher In our response to Camden Council’s consultation on its draft New Local Plan, Camden Green Party broadly welcomes the plan, though there are a number of areas where we think the plan could and should be strengthened. Click here to open the full document. Read more »\nRead all about current Green campaigns 13th February 2024 / 13th February 2024 by brigitteascher You want to find out what campaigns the Green Party is working on? Head to https://www.greenpartycampaigns.uk/ to read about campaigns on Rwanda and Gaza, Stop the Sewage, Dirty Profits Tax, to name just a few. Each comes with campaigning material that will help you bring the topic to life. It includes suggestions how to establish […] Read more »",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_07_05_support-for-green-party-candidates-jumps/content_6.html": "After a general election that proved momentous for the country and the Green Party, we thank all of you who placed their confidence in one of our two candidates in Camden.\nIn Hampstead & Highgate, Lorna Jane Russell received 6,630 votes, placing the Green Party in third place. This represents a massive increase in the vote share compared with the previous general election in 2019 – increasing from just under 4% then to 14% now.\nIn Holborn & St Pancras, 4,030 voters gave their confidence to David Stansell, also placing the Green Party third. Again, this is a doubling of the vote share – from just under 5% to 10% now.\nThank you all from our Green team at yesterday’s count in Camden Town Hall.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2023_07_31_candidates-selected-for-general-election/content_27.html": "Camden Green Party selected our parliamentary candidates in the two Camden constituencies, following internal elections in July. The two candidates will represent us at the next general election.\nDavid Stansell, Chair of Camden Green Party, has been chosen as our candidate in Holborn and St Pancras, where he will take on Labour leader Sir Keir Starmer.\nLorna Jane Russell has been selected as our candidate in the new Hampstead and Highgate seat, a constituency in which she spent eight years as a Camden councillor.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_category_uncategorised/content_7.html": "19th February 2025 / 19th February 2025 by brigitteascher\nRead more »\n10th October 2024 / 10th October 2024 by brigitteascher\n14th August 2024 by brigitteascher\nOn 5 September, by-elections will be held in three wards in Camden. This is to replace the councillors who were elected to Parliament a few months ago. Camden Green Party is proud that three excellent candidates will be standing in these wards. We hope they can count on your support! James Dicker – Camden Square […]\n5th July 2024 / 29th October 2024 by brigitteascher\nAfter a general election that proved momentous for the country and the Green Party, we thank all of you who placed their confidence in one of our two candidates in Camden. In Hampstead & Highgate, Lorna Jane Russell received 6,630 votes, placing the Green Party in third place. This represents a massive increase in the […]\n11th June 2024 / 11th June 2024 by brigitteascher\n2nd June 2024 / 2nd June 2024 by brigitteascher\nCamden Green Party has selected its parliamentary candidates in the two Camden constituencies, following internal elections. David Stansell, Chair of Camden Green Party, has been chosen as the candidate in Holborn and St Pancras, where he will take on Labour leader Keir Starmer. He brings a wealth of experience and previously stood for Parliament for […]\n8th April 2024 / 8th April 2024 by brigitteascher\nLondon’s Green candidate for mayor, Zoe Garbett, today launched the manifesto “for a greener, more affordable London”. Click here for the full manifesto, and here for the mini version.\n2nd April 2024 / 2nd April 2024 by brigitteascher\nCharles Harris has been selected to stand as the Green Party candidate in the upcoming by-election in Frognal. The by-election will be held on 2 May at the same time as the London-wide Mayoral and Assembly elections.\n15th March 2024 / 15th March 2024 by brigitteascher\nIn our response to Camden Council’s consultation on its draft New Local Plan, Camden Green Party broadly welcomes the plan, though there are a number of areas where we think the plan could and should be strengthened. Click here to open the full document.\n13th February 2024 / 13th February 2024 by brigitteascher\nYou want to find out what campaigns the Green Party is working on? Head to https://www.greenpartycampaigns.uk/ to read about campaigns on Rwanda and Gaza, Stop the Sewage, Dirty Profits Tax, to name just a few. Each comes with campaigning material that will help you bring the topic to life. It includes suggestions how to establish […]",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2023_12_10_petition-to-save-our-maternity-units/content_20.html": "Camden Green Party has launched a petition to stop the proposed closure of a maternity unit in North London – either at the Royal Free Hospital in Hampstead (the preferred option) or at the Whittington Hospital in Archway.\nLorna Jane Russell said: “We are extremely concerned about what this will mean for local parents, who will have to travel further, and potentially wait longer, for crucial maternity appointments and services.”\nUrging the NHS North Central London Integrated Care Board to think again, Lorna added that “a strong foundation during pregnancy and childbirth significantly shapes life outcomes and contributes to the reduction of health disparities. Ensuring that every family in North London has access to high quality maternity services is therefore critical. that every family in north London has access to high quality maternity services is therefore critical.”",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_03_15_response-to-camden/content_29.html": "In our response to Camden Council’s consultation on its draft New Local Plan, Camden Green Party broadly welcomes the plan, though there are a number of areas where we think the plan could and should be strengthened. Click here to open the full document.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2023_07_20_sian-takes-on-brighton-hove/content_24.html": "Sian Berry has been chosen by Brighton & Hove Green Party to represent the party in the next general elections. She is following in the footsteps of Caroline Lucas who spent the past 12 years tirelessly working to push for climate action in the Westminster Parliament.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_04_02_candidate-selected-for-frognal/content_13.html": "Charles Harris has been selected to stand as the Green Party candidate in the upcoming by-election in Frognal.\nThe by-election will be held on 2 May at the same time as the London-wide Mayoral and Assembly elections.\nCharles Harris has been selected to stand as the Green Party candidate in the upcoming by-election in Frognal.\nThe by-election will be held on 2 May at the same time as the London-wide Mayoral and Assembly elections.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_02_13_read-all-about-current-green-campaigns/content_21.html": "You want to find out what campaigns the Green Party is working on?\nHead to https://www.greenpartycampaigns.uk/ to read about campaigns on Rwanda and Gaza, Stop the Sewage, Dirty Profits Tax, to name just a few.\nEach comes with campaigning material that will help you bring the topic to life. It includes suggestions how to establish and run a campaign as well as posters and leaflets to use during the campaign.\nAll Green non-election campaigns are on this website, and not only that, you can subscribe to monthly updates on the topic, and propose ideas for future campaigns.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_whats-on/content_2.html": "Skip to content\nSkip to footer\nCamden\nMenu\nAbout us\nNews\nEvents\nGet involved\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nevents\nevents\nClick the link below for all the detail\nMay 8, 2025: Kentish Town action evening 8 May\nMay 10, 2025: Kentish Town action day 10 May\nMay 12, 2025: Highgate action evening 12 May\nMay 24, 2025: Highgate action day 24 May\nJune 12, 2025: Kentish Town action evening 12 June\nJune 14, 2025: Kentish Town action day 14 June\nTo top",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2025_02_19_highgate-newsletter-spring-2025/content_8.html": "Skip to content\nSkip to footer\nCamden\nMenu\nAbout us\nNews\nEvents\nGet involved\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nHighgate newsletter spring 2025\nHighgate newsletter spring 2025\n19th February 2025\n/\n19th February 2025\nby\nbrigitteascher\nTo top",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_about-us/content_9.html": "The Green Party is growing fast. We now represent people in Westminster and in a record number of local councils, as well as in the London Assembly.\nHere in Camden, we have one Green Councillor who adds that much needed voice to the Council chamber to address the critical issues that the older parties are not even discussing.\nWe are working on local issues; to improve the lives of all people in Camden, and to improve our local environment. As part of the Green Party of England & Wales, we share a deep concern for social and environmental justice, expressed through our national policies. We believe fair is worth fighting for.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us today so that we can achieve so much more for Camden.\nThe manifesto for the local elections in 2022 applies Green policy to Camden.\nFor a London focus, please read the manifesto launched by Zoe Garbett for the 2024 London mayoral campaign.\nThe Green Party Manifesto 2024 sets out what Greens are in politics to do: to end the system that keeps hurting the environment and all of us who rely on it – and to build a better alternative.\nThis programme isn’t like other parties’ manifestos, it has not been squeezed through focus groups and stripped down according to the latest polling. Instead it has been built from policies proposed and voted on by our members, looking to secure the long term future of the places and people they love.\nIt’s a vision of a better world, and together we can deliver it.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_06_11_highgate-newsletter-summer-2024/content_12.html": "Skip to content\nSkip to footer\nCamden\nMenu\nAbout us\nNews\nEvents\nGet involved\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nHighgate newsletter summer 2024\nHighgate newsletter summer 2024\n11th June 2024\n/\n11th June 2024\nby\nbrigitteascher\nTo top",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2023_10_18_1144/content_30.html": "After more than nine years as councillor for the Highgate ward, Sian Berry is stepping down from Camden Council as of 20 October to focus on her work to become the next Green MP for Brighton Pavilion.\nIn the most recent local election in May 2022, Sian received the support of 51% of the Highgate residents. “The work I have done here in the ward – alongside the incredible range of local resident groups we have in Highgate – has been so rewarding and enjoyable,” Sian wrote in her letter to Highgate residents.\n“Lorna Jane Russell has been selected to stand as my Green successor and I couldn’t recommend her more highly to you as a hard-working local champion. I saw how effectively she served for eight years on the council with me and was delighted when Lorna joined our Green Party team two years ago. I urge you to give Lorna your support in the forthcoming by-election.”\nSian continues to represent Green voters in London as one of the three Green members on the London Assembly.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_author_brigitte-ascher/content_5.html": "19th February 2025 / 19th February 2025 by brigitteascher\nRead more »\n10th October 2024 / 10th October 2024 by brigitteascher\n14th August 2024 by brigitteascher\nOn 5 September, by-elections will be held in three wards in Camden. This is to replace the councillors who were elected to Parliament a few months ago. Camden Green Party is proud that three excellent candidates will be standing in these wards. We hope they can count on your support! James Dicker – Camden Square […]\n5th July 2024 / 29th October 2024 by brigitteascher\nAfter a general election that proved momentous for the country and the Green Party, we thank all of you who placed their confidence in one of our two candidates in Camden. In Hampstead & Highgate, Lorna Jane Russell received 6,630 votes, placing the Green Party in third place. This represents a massive increase in the […]\n11th June 2024 / 11th June 2024 by brigitteascher\n2nd June 2024 / 2nd June 2024 by brigitteascher\nCamden Green Party has selected its parliamentary candidates in the two Camden constituencies, following internal elections. David Stansell, Chair of Camden Green Party, has been chosen as the candidate in Holborn and St Pancras, where he will take on Labour leader Keir Starmer. He brings a wealth of experience and previously stood for Parliament for […]\n8th April 2024 / 8th April 2024 by brigitteascher\nLondon’s Green candidate for mayor, Zoe Garbett, today launched the manifesto “for a greener, more affordable London”. Click here for the full manifesto, and here for the mini version.\n2nd April 2024 / 2nd April 2024 by brigitteascher\nCharles Harris has been selected to stand as the Green Party candidate in the upcoming by-election in Frognal. The by-election will be held on 2 May at the same time as the London-wide Mayoral and Assembly elections.\n15th March 2024 / 15th March 2024 by brigitteascher\nIn our response to Camden Council’s consultation on its draft New Local Plan, Camden Green Party broadly welcomes the plan, though there are a number of areas where we think the plan could and should be strengthened. Click here to open the full document.\n13th February 2024 / 13th February 2024 by brigitteascher\nYou want to find out what campaigns the Green Party is working on? Head to https://www.greenpartycampaigns.uk/ to read about campaigns on Rwanda and Gaza, Stop the Sewage, Dirty Profits Tax, to name just a few. Each comes with campaigning material that will help you bring the topic to life. It includes suggestions how to establish […]",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_donate/content_16.html": "Your donations can help transform camden\nWe have the huge opportunity to extend the successful track record of Green councillors in Camden – the past 17 years are only the beginning!\nWith your support, we can deliver real change at Camden town hall. Our job is to hold the council to account, make Camden deliver on their promises to fight the climate emergency and improve their housing provision. Furthermore, we are continuously pushing for more action on these important matters.\nWe are asking you to invest in achieving success in this campaign.\nStanding order or one-off donation\nYou can set up a regular payment or make a one-off donation to our bank account. This means we receive 100% of your donation for Camden campaigns.\n- Camden Green Party\n- Co-operative Bank\n- Sort code 08 92 99\n- Account no 65109674\nDonating online\nYou can also make a one-off donation or regular donation below. Please do bear in mind that Stripe will take a small transaction fee for every donation.\nPlease email us if you make a donation online, so we know who to thank!\nThe Green Party takes no money from big business. All our funds come from people like you!",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2023_10_18_1147/content_22.html": "Lorna Jane Russell has been selected to stand as Sian Berry’s Green successor. Sian Berry said in her letter to Highgate residents: “I couldn’t recommend Lorna more highly to you as a hard-working local champion. I saw how effectively she served for eight years on the council with me and was delighted when Lorna joined our Green Party team two years ago. I urge you to give Lorna your support in the forthcoming by-election.”\nLorna is local and lives in the Holly Lodge Estate. She serves as the Treasurer of the Tenants’ Resident Association, helping residents with complex issues relating to housing repairs, heating failures, and the estate’s roof fire exits.\nAs a local campaigner Lorna has worked closely with Sian on a range of topics: challenging the Council and housing associations to fix flats in disrepair; demanding action on rat running on local roads; organising community events, like local litter picks in Highgate.\nLorna was Camden Councillor for eight years – first as a Labour Councillor for seven years before joining the Green Party in 2021. She also served one term as the borough’s Deputy Mayor. She joined the Green Party because she felt she would be able to be an independent voice for resident’s needs. Free to speak up and free from the Labour whip telling her to vote a specific way.\nLorna said: “Highgate has had Green Councillors for nearly two decades. It would be a real honour to follow our former Councillors Sian Berry and Maya De Souza in representing you. I promise to follow their lead and be an independent, hard working voice for Highgate.”\nIn the forthcoming by-election, Sian urges Highgate voters “to give your one vote to the Greens to continue having a Green Councillor for accountability and balance. I know Lorna will do an excellent job”.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_10_10_highgate-newsletter-autumn-2024/content_25.html": "Skip to content\nSkip to footer\nCamden\nMenu\nAbout us\nNews\nEvents\nGet involved\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nHighgate Newsletter autumn 2024\nHighgate Newsletter autumn 2024\n10th October 2024\n/\n10th October 2024\nby\nbrigitteascher\nTo top",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_08_14_introducing-three-green-candidates/content_3.html": "On 5 September, by-elections will be held in three wards in Camden. This is to replace the councillors who were elected to Parliament a few months ago.\nCamden Green Party is proud that three excellent candidates will be standing in these wards. We hope they can count on your support!\nJames Dicker – Camden Square\nAfter moving to London for his studies, James quickly fell in love with the city. The stunning buildings, vibrant high streets, and incredible people of Camden inspired him to make this borough his home. Now, he’s committed to giving back to this borough, a place that has given him so much over the years.\nProfessionally, James is dedicated to helping businesses in their transition to net zero, and he works in energy and sustainability policy. If elected, he will fight for stronger protections for renters and leaseholders, enhance our beautiful green spaces and children’s play areas, and ensure our streets are safe for everyone,addressing both crime and air pollution.\nAlice Brown – Kentish Town South\nAlice lives with her family near Queen’s Crescent, and her husband Tom runs the bread stall on Queen’s Crescent market. She works as an architect in Archway, and her professional focus is retrofitting existing buildings and conservation.\nLocally, she is involved with community groups including Better West Kentish Town, Climate Emergency Camden, and Retrofit Kentish Town. She is chair of the West Kentish Town Conservation Area committee and was an advisor to Kentish Town Neighbourhood Forum.\nAs your councillor, Alice will hold Camden to account on housing repairs and maintenance, and building additional social homes. She will campaign to protect the environment and for better planning for people and planet.\nMichael Gomes Vieira – Kilburn\nHaving grown up in neighbouring Brent, Michael knows Kilburn and its unique needs well. He appreciates London’s diversity and, if elected, will work with police to protect all Londoners and crack down on far-right extremists.\nNow a Camden resident, Michael is appalled by the Labour-run Council’s terrible management of its estates, such as the iconic Alexandra Road Estate. Michael is determined to stand up to the Council and hold them to account for all residents – whether they be council tenants, private renters, leaseholders, or homeowners.\nMichael has a Masters in Political Science and takes a keen interest in sustainable food issues and public transport. He is especially passionate about buses and will campaign hard to increase bus frequencies in and around the borough.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_news_page_2/content_15.html": "Councillor Lorna Jane Russell ready to submit ceasefire motion to Camden 22nd January 2024 / 22nd January 2024 by brigitteascher Highgate Green Party councillor Lorna Jane Russell has drafted a motion calling for a ceasefire in Gaza, for the release of all hostages, and for more support for local community cohesion. Please find this to read here . Lorna is ready to submit this motion to Camden, but she needs help. All council motions require […] Read more »\nPetition to save our maternity units 10th December 2023 / 4th January 2024 by brigitteascher Camden Green Party has launched a petition to stop the proposed closure of a maternity unit in North London – either at the Royal Free Hospital in Hampstead (the preferred option) or at the Whittington Hospital in Archway. Lorna Jane Russell said: “We are extremely concerned about what this will mean for local parents, who […] Read more »\nLorna Jane Russell elected in Highgate 1st December 2023 by brigitteascher Lorna Jane Russell successfully defended the Green seat in Highgate in the by-election on 30 November by winning 59% of the vote. This was a significant improvement on the 51% won by the previous Green councillor, Sian Berry, in the 2022 local elections. With 46 of the 55 Camden seats held by Labour already, Lorna […] Read more »\nLorna Jane Russell standing to be Sian Berry’s successor in Highgate 18th October 2023 / 16th March 2024 by brigitteascher Lorna Jane Russell has been selected to stand as Sian Berry’s Green successor. Sian Berry said in her letter to Highgate residents: “I couldn’t recommend Lorna more highly to you as a hard-working local champion. I saw how effectively she served for eight years on the council with me and was delighted when Lorna joined […] Read more »\nSian Berry steps down as councillor to focus on Brighton Pavilion 18th October 2023 / 16th March 2024 by brigitteascher After more than nine years as councillor for the Highgate ward, Sian Berry is stepping down from Camden Council as of 20 October to focus on her work to become the next Green MP for Brighton Pavilion. In the most recent local election in May 2022, Sian received the support of 51% of the Highgate […] Read more »\nCandidates selected for general election 31st July 2023 / 16th March 2024 by brigitteascher Camden Green Party selected our parliamentary candidates in the two Camden constituencies, following internal elections in July. The two candidates will represent us at the next general election. David Stansell, Chair of Camden Green Party, has been chosen as our candidate in Holborn and St Pancras, where he will take on Labour leader Sir Keir […] Read more »\nSian Berry takes on Brighton Pavilion 20th July 2023 / 18th October 2023 by brigitteascher Sian Berry has been chosen by Brighton & Hove Green Party to represent the party in the next general elections. She is following in the footsteps of Caroline Lucas who spent the past 12 years tirelessly working to push for climate action in the Westminster Parliament. Read more »",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_category_uncategorised_page_2/content_17.html": "22nd January 2024 / 22nd January 2024 by brigitteascher\nHighgate Green Party councillor Lorna Jane Russell has drafted a motion calling for a ceasefire in Gaza, for the release of all hostages, and for more support for local community cohesion. Please find this to read here . Lorna is ready to submit this motion to Camden, but she needs help. All council motions require […]\nRead more »\n4th January 2024 / 4th January 2024 by brigitteascher\n10th December 2023 / 4th January 2024 by brigitteascher\nCamden Green Party has launched a petition to stop the proposed closure of a maternity unit in North London – either at the Royal Free Hospital in Hampstead (the preferred option) or at the Whittington Hospital in Archway. Lorna Jane Russell said: “We are extremely concerned about what this will mean for local parents, who […]\n1st December 2023 by brigitteascher\nLorna Jane Russell successfully defended the Green seat in Highgate in the by-election on 30 November by winning 59% of the vote. This was a significant improvement on the 51% won by the previous Green councillor, Sian Berry, in the 2022 local elections. With 46 of the 55 Camden seats held by Labour already, Lorna […]\n18th October 2023 / 16th March 2024 by brigitteascher\nLorna Jane Russell has been selected to stand as Sian Berry’s Green successor. Sian Berry said in her letter to Highgate residents: “I couldn’t recommend Lorna more highly to you as a hard-working local champion. I saw how effectively she served for eight years on the council with me and was delighted when Lorna joined […]\nAfter more than nine years as councillor for the Highgate ward, Sian Berry is stepping down from Camden Council as of 20 October to focus on her work to become the next Green MP for Brighton Pavilion. In the most recent local election in May 2022, Sian received the support of 51% of the Highgate […]\n31st July 2023 / 16th March 2024 by brigitteascher\nCamden Green Party selected our parliamentary candidates in the two Camden constituencies, following internal elections in July. The two candidates will represent us at the next general election. David Stansell, Chair of Camden Green Party, has been chosen as our candidate in Holborn and St Pancras, where he will take on Labour leader Sir Keir […]\n20th July 2023 / 18th October 2023 by brigitteascher\nSian Berry has been chosen by Brighton & Hove Green Party to represent the party in the next general elections. She is following in the footsteps of Caroline Lucas who spent the past 12 years tirelessly working to push for climate action in the Westminster Parliament.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_people/content_23.html": "Camden Green Party is run entirely by volunteers. We are a grassroots party made up of people who are passionate about green politics and making a difference.\nOur officers and campaigners play a key role in supporting our candidates for election campaigns and in planning the wider activity of the local party.\nHere are some of Camden Green Party’s core team, starting with our Green councillor, Lorna Jane Russell:\nLorna Jane Russell\nAlice Brown\nJames Dicker\nbrigitte Ascher\nkATE jONES\nHelen Doyle\nCllr Lorna Jane Russell’s surgeries are held at the Holly Lodge Community Centre, 30 Makepeace Avenue, London N6 6HL from 11am – 12noon every third OR fourth Saturday of the month. You can also contact her at lorna.russell@camden.gov.uk\nLorna’s 2025 surgery dates are:\nSaturday 18th January\nSaturday 22nd February\nSaturday 22nd March\nSaturday 19th April\nSaturday 24th May\nSaturday 28th June\nSaturday 19th July\nSaturday 20th September\nSaturday 18th October\nSaturday 15th November\nSaturday 20th December\nThere will be no surgery in August",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_contact/content_18.html": "If you’d like to find out how to get involved with Camden Greens, or like to talk to us about an issue you are concerned about, or would just like to have a chat, we can be reached in various ways.\nDrop us a line with questions, suggestions or issues\nYou can get in touch on X (formerly Twitter) @camdengp",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_04_08_zoe-garbett-launches-manifesto-for-london/content_28.html": "London’s Green candidate for mayor, Zoe Garbett, today launched the manifesto “for a greener, more affordable London”.\nClick here for the full manifesto, and here for the mini version.\nLondon’s Green candidate for mayor, Zoe Garbett, today launched the manifesto “for a greener, more affordable London”.\nClick here for the full manifesto, and here for the mini version.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2023_12_01_lorna-jane-russell-elected-in-highgate/content_31.html": "Lorna Jane Russell successfully defended the Green seat in Highgate in the by-election on 30 November by winning 59% of the vote. This was a significant improvement on the 51% won by the previous Green councillor, Sian Berry, in the 2022 local elections.\nWith 46 of the 55 Camden seats held by Labour already, Lorna said : “Residents saw the value in having opposition councillors to scrutinise the council and hold the administration accountable.”\nLorna added that locally residents were furious about issues like the “poor quality of council housing, rat-running on local roads, and the fact that Camden does not listen to the Highgate community”.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_01_04_latest-highgate-newsletter/content_19.html": "Skip to content\nSkip to footer\nCamden\nMenu\nAbout us\nNews\nEvents\nGet involved\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nUncategorised\nLatest Highgate newsletter\nLatest Highgate newsletter\n4th January 2024\n/\n4th January 2024\nby\nbrigitteascher\nTo top",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_author_brigitte-ascher_page_2/content_11.html": "22nd January 2024 / 22nd January 2024 by brigitteascher\nHighgate Green Party councillor Lorna Jane Russell has drafted a motion calling for a ceasefire in Gaza, for the release of all hostages, and for more support for local community cohesion. Please find this to read here . Lorna is ready to submit this motion to Camden, but she needs help. All council motions require […]\nRead more »\n4th January 2024 / 4th January 2024 by brigitteascher\n10th December 2023 / 4th January 2024 by brigitteascher\nCamden Green Party has launched a petition to stop the proposed closure of a maternity unit in North London – either at the Royal Free Hospital in Hampstead (the preferred option) or at the Whittington Hospital in Archway. Lorna Jane Russell said: “We are extremely concerned about what this will mean for local parents, who […]\n1st December 2023 by brigitteascher\nLorna Jane Russell successfully defended the Green seat in Highgate in the by-election on 30 November by winning 59% of the vote. This was a significant improvement on the 51% won by the previous Green councillor, Sian Berry, in the 2022 local elections. With 46 of the 55 Camden seats held by Labour already, Lorna […]\n18th October 2023 / 16th March 2024 by brigitteascher\nLorna Jane Russell has been selected to stand as Sian Berry’s Green successor. Sian Berry said in her letter to Highgate residents: “I couldn’t recommend Lorna more highly to you as a hard-working local champion. I saw how effectively she served for eight years on the council with me and was delighted when Lorna joined […]\nAfter more than nine years as councillor for the Highgate ward, Sian Berry is stepping down from Camden Council as of 20 October to focus on her work to become the next Green MP for Brighton Pavilion. In the most recent local election in May 2022, Sian received the support of 51% of the Highgate […]\n31st July 2023 / 16th March 2024 by brigitteascher\nCamden Green Party selected our parliamentary candidates in the two Camden constituencies, following internal elections in July. The two candidates will represent us at the next general election. David Stansell, Chair of Camden Green Party, has been chosen as our candidate in Holborn and St Pancras, where he will take on Labour leader Sir Keir […]\n20th July 2023 / 18th October 2023 by brigitteascher\nSian Berry has been chosen by Brighton & Hove Green Party to represent the party in the next general elections. She is following in the footsteps of Caroline Lucas who spent the past 12 years tirelessly working to push for climate action in the Westminster Parliament.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_01_22_councillor-lorna-jane-russell-ready-to-submit-ceasefire-motion-to-camden/content_14.html": "Highgate Green Party councillor Lorna Jane Russell has drafted a motion calling for a ceasefire in Gaza, for the release of all hostages, and for more support for local community cohesion. Please find this to read here .\nLorna is ready to submit this motion to Camden, but she needs help. All council motions require two councillors to support them – a proposer and a seconder – but unfortunately Lorna is the only Green Party councillor in the borough. She’s therefore keen to work with councillors from other parties to make this happen!",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_get-involved/content_4.html": "There has never been a better time to get involved with the work of the Green Party. Any help you can give us, from a regular donation to work on the doorstep, will make a real difference to getting Greens elected in Camden and working for a fairer, cleaner, more affordable future for everyone.\nOur elections are run entirely by volunteers, and the more of us get involved, the better we’ll do. Whether you have a few hours a month, or a spare day every week, we need you.\nHelp deliver newsletters\nWe make regular deliveries of newsletters and other material to support our campaigning and build relationships with our local communities. Help is always appreciated.\nCome to an action day\nWe hold action days to bring as many volunteers together as possible for a big push to keep us on track.\nPhone members of Camden Green Party\nHelp us phone our party members to find out what their concerns are and inform them how they can help to get more Green councillors elected.",
  "https_camden_greenparty_org_uk_/https_camden_greenparty_org_uk_2024_06_02_green-candidates-selected-for-general-election/content_26.html": "Camden Green Party has selected its parliamentary candidates in the two Camden constituencies, following internal elections.\nDavid Stansell, Chair of Camden Green Party, has been chosen as the candidate in Holborn and St Pancras, where he will take on Labour leader Keir Starmer. He brings a wealth of experience and previously stood for Parliament for the Greens in 2019.\nCouncillor Lorna Jane Russell has been selected as the candidate in the new Hampstead and Highgate seat, which covers the Highgate ward where she lives and serves as the ward’s councillor. It also includes her former ward of Fortune Green, which she represented on Camden Council from 2014 to 2022.\nBoth David and Lorna will stand for the Camden Green Party in the general election on Thursday 4 July 2024."
}