{
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_news_category_Speeches/content_7.html": "It’s time to abolish business rates 12th January 2021 Today I introduced a Ten Minute Rule Bill in the House of Commons which would bring an end to business rates and replace the revenue with a small increase in... Speeches\nNew Year Message 23rd December 2015 I am grateful for all the help and support as I have received in my first year as your MP. 2016 is full of opportunities that I very much hope, and will use all... SpeechesReportsLocal NewsArticles",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_thirsk-and-malton-small-business-survey/content_16.html": "Tweet A survey to understand more about the priorities of small businesses in Thirsk and Malton. Small Business Survey Current Government support Which category best describes your business? Business challenges Disabled access Thirsk & Malton Business Support Your details Leave this field blank Do you receive Small Business Rates Relief? Yes No Do you receive Retail, Hospitality or Leisure Relief? Yes No The last Government raised the employment allowance to £5000, has this benefitted your employers' national insurance bills? Yes No Not sure How confident are you in the Labour Government's ability to support small businesses? Very Somewhat Not at all How has your perception of government support for small businesses changed since the Labour Government came into power? Improved significantly Improved somewhat No change Worsened somewhat Worsened signicantly Have you made or are you considering any changes to your workforce due to the NICs increase? Reduced staff Delayed hiring No change Expanded workforce Other Which specific measure in the Employment Rights Bill do you feel will have the greatest impact on your business? Right to request flexible working Parental leave changes Sick pay entitlements No changes All of the above",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_news_category_Holyrood-News/content_13.html": "Skip to main content\nMain navigation\nAbout\nNews\nCampaigns\nSpeeches\nContact & Events\nApprenticeships\nNewsletter\nSmall Business Survey\nVote for your favourite pub!\nHolyrood News\nDomiciliary care should be central to social care reform\n1st December 2021\nHolyrood News",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_cookies/content_5.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_events/content_2.html": "Skip to main content\nMain navigation\nAbout\nNews\nCampaigns\nSpeeches\nContact & Events\nApprenticeships\nNewsletter\nSmall Business Survey\nVote for your favourite pub!\nFuture Events\nSurgery - Thirsk\n23rd May 2025\n9:00 - 10:30\nPlease contact my office to book an appointment.",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk/content_1.html": "Campaigns MP continues push on A64 with cross party support clear I’m pleased to share that I’ve sent a joint letter with Tom Gordon MP and Sir… Save our local best pub competition launches Here I'm launching my competition for the best pub in the Thirsk and Malton… 'Save our Local' launches in Thirsk and Malton As a former small business owner, and former Business Minister and, most… Latest news Key achievements for the people of Thirsk and Malton Delivering a Fairer Deal for Thirsk, Malton & FileyAs your MP, I’ve always… Rebuilding trust after tough local election results Aside from a stunning win by Paul Bristow in Cambs and Peterborough and some… MPs call for A64 dualling in joint letter to minister Three Members of Parliament have joined forces to press the Government for… Surgeries Surgery - Thirsk Friday, 23rd May 2025 Please contact my office to book an appointment. Find me on Facebook Find me on Twitter Contact Kevin Hollinrake Constituency Office109 Town Street, Old Malton, YO17 7HD01653 916417Kevin on FacebookKevin on Twitter Am I your MP? Enter your postcode Postcode Thirsk and Malton\nMP continues push on A64 with cross party support clear I’m pleased to share that I’ve sent a joint letter with Tom Gordon MP and Sir…\nSave our local best pub competition launches Here I'm launching my competition for the best pub in the Thirsk and Malton…\n'Save our Local' launches in Thirsk and Malton As a former small business owner, and former Business Minister and, most…\nKey achievements for the people of Thirsk and Malton Delivering a Fairer Deal for Thirsk, Malton & FileyAs your MP, I’ve always…\nRebuilding trust after tough local election results Aside from a stunning win by Paul Bristow in Cambs and Peterborough and some…\nMPs call for A64 dualling in joint letter to minister Three Members of Parliament have joined forces to press the Government for…",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_news_key-achievements-people-thirsk-and-malton/content_4.html": "Delivering a Fairer Deal for Thirsk, Malton & Filey\nAs your MP, I’ve always fought to make sure our part of North Yorkshire gets its fair share — and while there’s more to do, we’ve made real progress. From saving vital local services to securing major investment in infrastructure, I’ve worked hard to stand up for our towns, villages and rural communities.\nLocal Wins\n- Linton-on-Ouse Victory\nAfter months of campaigning alongside dedicated local residents and the Linton Action Group, the Government finally scrapped plans for an asylum processing centre. This outcome was thanks to tireless efforts from North Yorkshire Council, local councillors, North Yorkshire Police and many others who came together to oppose the plans. - Better Rail Access\nThirsk and Malton stations have seen real investment: £1 million for new lifts and a footbridge at Thirsk, and £150,000 for a raised platform at Malton. Thirsk has also been selected for further feasibility work under the Access for All programme. - Backing Local Culture\nI’ve helped secure funding for treasured local institutions including the North Yorkshire Moors Railway, Castle Howard and the Rural Arts Centre. In 2024, we also secured £50,000 for Malton Museum to establish a permanent home. - Lambert Hospital, Thirsk\nAfter working with Hambleton District Council, we saved Lambert Hospital from sale — it’s now being developed into the Herriot Hospice, bringing vital care back into local hands. - New A&E for Scarborough\nWe secured £40 million to build a brand-new A&E department at Scarborough Hospital, supporting residents in Filey and beyond. - Filey Fishermen Protected\nAfter pushing back against unviable proposals to limit fishing seasons, we opened the door to a sustainable, long-term future for Filey’s heritage fishing industry. - Education and Jobs\n£5.4 million for Easingwold School and a new £2 million sports hall and 4G pitch. At Dalton Industrial Estate, a £4 million investment supported hundreds of jobs. I’ve also launched a now-annual Engineering Apprenticeships Fair to connect young people with local employers. - Restoring Local Dentistry\nAfter unacceptable delays, Helmsley and Thirsk are once again getting NHS dental services — thanks to relentless local campaigning. - Championing Public Services\nOver £80 million a year in new funding has gone into our schools, SEND support, social care and policing. That’s helped deliver 58 more police officers across North Yorkshire. - Helped secure £25,000 funding for Ryedale Special Families from Omaze.\nFighting for Local Priorities\n- A64 Dualling\nAfter years of lobbying, the long-awaited A64 upgrade remains a live government project. We’re pushing hard both on the Mayor of North Yorkshire and the now Labour Government for a final decision in the next year to move to detailed planning and timelines. - Banking Hubs\nWith branch closures hitting rural towns hard, I’ve helped secure interim and permanent banking services in Filey, Pickering and Helmsley. - Water Quality and the Environment\nI’ve worked with the Environment Agency, DEFRA and Yorkshire Water to clean up local rivers and restore pride in our waterways. I’m a founding member of the Conservative Environment Group and continue to lead cross-party efforts to reduce litter and improve environmental standards. - Filey Town Bus\nI’m working with local residents and councils to bring back a community transport solution for Filey.\nHolding Government to Account\nNow serving as Shadow Secretary of State for Levelling Up, Housing and Communities, I continue to hold the current Government to account on housing targets, local government, extremism and planning reforms.\nI'm also very pleased to be a part of Kemi Badenoch's Policy Renewal, leading on housing, communities and local government. This is aimed at rebuilding Britain from the ground up and will form a project of work for the next few months and years ahead.\nNational Campaigns That Made a Difference\n- The Horizon Scandal\nAs a former Business Minister, I introduced the Post Office (Horizon System) Compensation Act 2024, which fast-tracked compensation for victims. Over £160 million has already been paid to 2,700 sub-postmasters, with £600,000 offered to each person wrongly convicted. I continue to call for prosecutions of those responsible. - Tackling Economic Crime\nI led efforts to pass the Economic Crime and Corporate Transparency Act 2023, introducing a new offence for failure to prevent fraud and giving Companies House powers to verify data. I also pushed back on SLAPP lawsuits and championed small businesses in financial services. - Parent Bereavement and Guardianship Acts\nTwo Private Members’ Bills I introduced are now law — offering bereaved parents paid leave and supporting families of missing people through Claudia’s Law. - Council Tax Debt Reform\nMy work with the APPG on Poverty helped change national guidance on council tax debt enforcement, making collection fairer and more compassionate. - Fighting for SMEs\nI co-created the Business Banking Resolution Service, improving access to justice for small businesses mistreated by banks. My campaign with victims of the HBOS Reading fraud also helped improve compensation processes at Lloyds. - Universal Credit Reform\nPushed through changes to reduce waiting times and protect those paid on weekly or four-weekly cycles. - Cladding and Fire Safety\nAfter Grenfell, I worked cross-party to ban combustible materials on new high-rise buildings and helped secure over £10 billion to remediate unsafe existing structures.\nA Record of Service\nOver the last few years:\n- Held hunreds of constituency surgeries\n- Helped over thousands of constituents directly\n- Remained a prolific parliamentary speaker and advocate\nLooking Ahead\nAs your MP and now Shadow Secretary of State, I remain committed to:\n- Delivering long-overdue infrastructure like the A64 upgrade\n- Supporting rural industries and local jobs\n- Campaigning for better housing, stronger communities and a fairer deal for the North\nThere’s more to do — and I’ll keep working every day to make sure your voice is heard in Westminster.",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_news_new-year-message/content_10.html": "I am grateful for all the help and support as I have received in my first year as your MP. 2016 is full of opportunities that I very much hope, and will use all of my endeavours to make sure, will benefit our constituency. Devolution, moving powers and money from Whitehall to our Town Halls, could bring about positive developments that will drive our economy forward. More people are in employment and the rewards for work are better with the introduction of the National Living Wage, something that I have strongly advocated. I am campaigning hard for better broadband and mobile connectivity for businesses, homes and schools. Cleaner, greener energy is both a national nad local opportunity and I will use all my efforts to make certain that the Government supports new technologies, and that should shale gas exploration proceed, it does not significantly impact on the environment or the countryside. We are lucky to live in an incredibly beautiful part of the world that must be protected for local people and visitors to enjoy long into the future. There is so much to be proud of in Thirsk & Malton, not just our scenery, but also our produce, and, most of all, our people. I will continue to support our teachers, healthcare professionals and emergency services whenever and wherever I can. Finally, a thought for all those who are away from home over the festive period, particularly our armed forces, we are rightly proud of their excellence and the unrivalled commitment they make on our behalf. My new year’s resolution will always be to serve you all to the best of my ability. I wish you all a Happy New Year.\nKind regards\nKevin",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_campaigns/content_8.html": "MP continues push on A64 with cross party support clear I’m pleased to share that I’ve sent a joint letter with Tom Gordon MP and Sir Alec Shelbrooke MP to Minister Lilian Greenwood, pressing for the long-overdue...\nSave our local best pub competition launches Here I'm launching my competition for the best pub in the Thirsk and Malton constituency as part of my wider campaign to 'Save our Local'. Pubs are facing a...\n'Save our Local' launches in Thirsk and Malton As a former small business owner, and former Business Minister and, most importantly, as someone who enjoys a pint at the local after a long day, I’m proud to...\nMPs Urge North Yorkshire Mayor to Back A64 Dualling Campaign Kevin Hollinrake MP, representing Thirsk and Malton, has today expressed frustration over the apparent lack of full support from the York & North Yorkshire...\nCampaigning for sustainable housebuilding in North Yorkshire It's vital to recognise the importance of sustainable and sensible housebuilding across North Yorkshire. While the need for new homes is undeniable, proposals...\nCampaigning for banking hubs across Thirsk and Malton As constituents know, I've been campaigning for Thirsk and Malton towns to have access to banking hubs, vital lifelines which can bridge the gap for individuals...\nHelmsley residents' access to postal services Update 7th November Helmsley will finally be opening its permanent Post Office on 26th November in Costcutter, replacing the temporary counter at the Black Swan...\nBringing community transport back to Filey Update October 13th: I've had several meetings since taking up this campaign and it is good to hear that there is a potential solution to the campaign to...\nMPs and mayoral candidate team up for A64 'Just Dual It' campaign I was pleased to welcome Guy Opperman, Roads Minister to a meeting near Hopgrove, York, along with mayoral candidate, Keane Duncan, local MPs, Julian Sturdy and...\nMP will not stop fighting for A64 upgrades after delay setback I share my constituents' disappointment that vital upgrades to the A64 are set to be delayed. Constituents will know I have worked tirelessly on this issue...\nMuch-needed dentistry provision finally secured for Helmsley I've been continuing to work hard on the issue of dental provision in the constituency and I'm pleased to announce that the procurement for a new NHS dental...",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_accessibility/content_6.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_map-locations/content_3.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_campaigns_campaigning-banking-hubs-across-thirsk-and-malton/content_14.html": "As constituents know, I've been campaigning for Thirsk and Malton towns to have access to banking hubs, vital lifelines which can bridge the gap for individuals and businesses when banks close their branches.\nA banking hub is a shared banking space, like a traditional bank branch but available to everyone. The hubs have a counter service where customers can withdraw and deposit cash, make bill payments and carry out regular banking transactions. They have private spaces where customers can speak to someone from their own bank about more complex issues. If strategically positioned, these hubs can address issues of accessibility, financial inclusion and small business growth. Post offices also clearly have a critical role to play here in supporting their long term viability, providing cash and banking services for customers and businesses, allowing them to withdraw and deposit cash, deposit cheques and check their current account balance.\nAs someone born and bred in this area, I know how devastating the impact of losing bank branches can be. I assure constituents I am doing everything I can to safeguard banking services as tangibly as possible.We may be able to use the potential of banking hubs and enhanced banking services to address the financial needs of rural areas and foster economic growth in our region.\nRecent updates below:\nFiley: In Filey, a temporary hub opened as of 16th September 2024, providing vital cash and banking services to the community of Filey. I'm working with Cash Access and Link on a permanent provision. As residents know, Filey currently has a temporary hub which I plan to visit November 2024. Regarding a permanent hub location, Cash Access are making progress towards a formal lease signing and we expect the permanent hub to open early next year.\nBedale: I know there's demand in Bedale for a banking hub and after conversations with LINK and Cash Access, I've submitted a community request for a banking hub in Bedale as of October 2024, stressing the benefit for Bedale, West Tanfield and surrounding villages. The key factor here is the need for walk-in advice which is so crucial in rural areas, which I have stressed to LINK.\nUpdate 26 November: Despite strong efforts, my bid for a Banking Hub in Bedale was sadly rejected due to the provisions provided by the Post Office being deemed sufficient. Nonetheless, we will keep the pressure up on LINK and Cash Access and I encourage you to contact my office with any concerns about banking provisions. However, in Parliament, the All-Party Parliamentary Group (APPG) for the Future of Financial Services is running an inquiry into access to banking and want to hear how banking closures and reduced services affect individuals and businesses. I have therefore made a submission to the APPGs inquiry, noting the points raised to me both in my ongoing small business survey and with general casework. I hope this feedback will help shape the case for better banking solutions being put to Government.\nHelmsley: As Helmsley has recently secured a permanent post office, opening in the latter part of 2024, a banking hub is not presently being considered due to the banking provisions already provided by the post office.",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_newsletter/content_9.html": "I send out a quarterly newsletter updating constituents in my work in Thirsk and Malton and in Parliament - if you would like to sign up please do so using the field on the left.\nMy Spring Newsletter 2025 can be found here.\nMy Winter Newsletter 2025 can be found here.\nMy Autumn Newsletter 2024 can be viewed here.\nMy Summer Newsletter 2024 can be viewed here.\nMy Spring Newsletter 2024 can be viewed here.\nMy Winter Newsletter 2023 can be viewed here.\nMy Autumn Newsletter 2023 can be viewed here.\nMy Summer Newsletter 2023 can be viewed here.\nMy Spring Newsletter 2023 can be viewed here.\nMy Winter Newsletter 2022 can be viewed here.\nMy Autumn Newsletter 2022 can be viewed here.\nMy Summer Newsletter 2022 can be viewed here.\nMy Spring Newsletter 2022 can be viewed here.\nMy Winter Newsletter 2021 can be viewed here.\nMy Autumn newsletter 2021 can be viewed here.",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_news/content_11.html": "Key achievements for the people of Thirsk and Malton Tuesday, 28 May, 2024 Delivering a Fairer Deal for Thirsk, Malton & Filey As your MP, I’ve always fought to make sure our part of North Yorkshire gets its fair share — and while there’s more to do, we’ve made real progress. From saving vital local services to securing major investment in infrastructure, I’ve worked hard to stand up for our towns, villages and rural communities. Local Wins Linton-on-Ouse Victory After... Local News\nRebuilding trust after tough local election results 2nd May 2025 Aside from a stunning win by Paul Bristow in Cambs and Peterborough and some decent results including by elections and Buckinghamshire and Northumberland, these... Westminster News\nMPs call for A64 dualling in joint letter to minister 26th April 2025 Three Members of Parliament have joined forces to press the Government for urgent action on the long-overdue dualling of the A64 between Hopgrove Junction and... Local News\nMP kicks off hunt for most loved Thirsk & Malton pub 8th April 2025 Here I'm launching my competition for the best pub in the Thirsk and Malton constituency as part of my wider campaign to 'Save our Local'. Pubs are facing a... Local News\nMP calls out Labour's catastrophic mess in Birmingham 31st March 2025 As part of my role as Shadow Local Government Secretary, I'm calling out Labour’s mess in Birmingham: bins uncollected, rats rampant, a city in chaos. Westminster News\nMP hosts Shadow Farming Minister meeting on cashflow conerns 28th March 2025 I was proud to welcome Robbie Moore, Shadow Farming Minister, to Bulmer, North Yorkshire, where we met with our hardworking farming community to confront the... Local News\nSpring Statement Analysis 26th March 2025 My thoughts on the Spring Statement: The Chancellor is either clueless or oblivious to what drives the economy; private enterprise. She inherited the fastest... Westminster News\nMP highlights Labour’s tax plans will hurt business and education 25th March 2025 🚨 Labour’s tax hike hits businesses 🍺🏢, shuts private schools 🎓🚪 & crams 90K kids into state classrooms 🏫📚. Speeches in Parliament\nKey concerns on Labour's Planning Bill regarding local accountability 24th March 2025 Full speech on Hansard here. Speeches in Parliament\nMP's FOI shows Mayor's lack of inaction on A64 13th March 2025 A Freedom of Information request submitted by a North Yorkshire MP has highlighted a pattern of spin, evasion and inaction by the Mayor of York & North... Local News",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_campaigns_save-our-local-best-pub-competition-launches/content_12.html": "Here I'm launching my competition for the best pub in the Thirsk and Malton constituency as part of my wider campaign to 'Save our Local'. Pubs are facing a raft of challenges and we must support them more than ever as we move into the summer months.\nAs former small business owner, Minister of State for Business – where I was responsible for the wellbeing of our pubs – and most importantly as someone who enjoys a pint down the local, I’m proud to launch the best Thirsk & Malton pub competition.\nIn Thirsk and Malton, the beer and pub sector directly supports over 3,000 jobs, with close to a third of those being taken up by 16-24 year olds. For many of these younger employees, these might well be their first jobs and play a crucial role in helping them begin their journey into the job market. As we begin our campaign to stand up for our local pubs, I’ll be reaching out to constituents to ask them to vote on their favourite local pub, to help us highlight those wonderful locals that play a crucial role in making this unbelievable constituency what it is.\nThe competition will run from today until Monday 2nd June, with a special recognition for the winner and runner up.",
  "http_www_kevinhollinrake_org_uk_/http_www_kevinhollinrake_org_uk_about-rss/content_15.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour."
}