{
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_vale-clwyd-local-nhs-champion/content_5.html": "I nominated Sharon Manning to attend the ‘NHS Champion’ event at No. 10 on 5 July 2023, the 75th Anniversary of the NHS.\nSharon’s service to the NHS has spanned a number of decades. She began working as a cleaner in Glan Clwyd Hospital in 1989. Over the years she worked her way up from an Auxiliary nurse, becoming a Staff Nurse at the North Wales Cancer Treatment Centre (NWCTC). In 2011, Sharon began working for Macmillan as a Cancer Nurse Specialist in gynaecological oncology. When Sharon was caring for patients, using her vast experience as a nurse, she began to devise better ways to care for patients effectively.\nIn 2017, Sharon was recognised for her role in improving care for cancer patients with an Innovation Award and Macmillan Fellowship for pioneering the use of the Rocket Drain Service. Her patients and then those more widely were able to avoid spending hours in outpatients every week and could enjoy more quality time with their loved ones. The burden on family members in having to help them attend weekly appointments was also reduced.\nWhat Sharon has achieved over the years for cancer patients in North Wales is quite remarkable. I was honoured to accompany Sharon to the Local NHS Champions reception and was pleased to have the opportunity to celebrate what she, and other Local NHS Champions, have achieved for patients and their families throughout the country.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_myplan/content_29.html": "Since my election in 2019, I have been proud to highlight the many fantastic contributions made by local businesses, groups and individuals in helping the Vale of Clwyd thrive. The articles below are a selection of the ways in which I have championed our local area in recent months.\nI am always looking to assist more local people, businesses and good causes, so please contact my office if you think I can help raise the profile of your work in the community and I will be happy to help where I can.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_cdn-cgi_l_email-protection/content_3.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_former-mp-attends-official-opening-new-prestatyn-police-station-which-he-long-campaigned/content_12.html": "Having led a campaign for a permanent police base in Prestatyn town centre, and having worked closely with North Wales Police and Denbighshire County Council on the matter over a number of years, former Vale of Clwyd MP Dr James Davies was thrilled to attend the official opening of the new police station today.\nNorth Wales Police and the Office of the Police and Crime Commissioner, working with Denbighshire County Council, developed part of a new building on the site of the former library on Nant Hall Road, which will be a 24hr base for response officers and the Neighbourhood Policing Team. It will have a front counter open to the public Tuesday to Saturday.\nThroughout his time as MP for the area, James repeatedly asked senior officers from North Wales Police to increase the visibility and accessibility of police services in Prestatyn, through the re-establishment of a permanent police base in the town centre.\nIn June 2022, he raised the matter in the House of Commons as a question to the Minister of State for Crime and Policing, when he said: “Neighbourhood crime and antisocial behaviour is better tackled with the police visibility and responsiveness that a town centre police station can provide”.\nHe also wrote to the Chief Constable, Amanda Blakeman, to request a meeting of key decision makers. This meeting took place in November 2023 and was positive, resulting in a breakthrough, with \"in principle\" support for a police base in Prestatyn.\nIn addition to engagement with the police on this issue, James held numerous discussions with officers from Denbighshire County Council on potential sites and the benefits of a police base to the authority’s Community Safety objectives. Cllr Hugh Irving (Prestatyn Central) was also instrumental in highlighting the matter within county council discussions.\nCommenting following today’s official opening, James said:\n“There have been concerns about police visibility in the town since the police were forced to move out of their former base within part of the former council offices at 6-8 Nant Hall Road, over five years ago.\n“During my time as MP, I was contacted regularly by concerned residents and businesses who were eager for a police presence in the town centre.\n“In my discussions with the police, I repeatedly highlighted the fact that there are much smaller towns in Denbighshire with a police station, and stressed that given Prestatyn's large population, and the influx of tourists in the summer months, a police station in Prestatyn town centre was much needed.\n\"As part of my campaign, I conducted a survey of residents and received an overwhelming response from over 1,000 people in support of permanent police base.\n“Having worked closely with North Wales Police on this over a number of years, today’s opening was certainly a proud moment, and I am confident the new station will act as a deterrent to crime and be invaluable in terms of ensuring rapid physical response. It will without a doubt, make Prestatyn a safer place for all.”",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_securing-new-build-prestatyn-high-school/content_30.html": "Prestatyn High School is the largest secondary school both in Denbighshire and North Wales. In the last visit by Estyn, the school was judged to be making ‘Good Progress’ in all areas. There is a sense of vibrancy and success about the Prestatyn High School community and leadership. This all deserves to be recognised with continued renovation of the school buildings and, moreover, a commitment to a new-build. I want to lead the charge for modern facilities for future learners. There are, of course, other schools in the local area which could also benefit from new buidings, such as in Denbigh.\nThe rebuilding of Prestatyn High School has long been debated by the local authority, which has been successful in recent years in securing funding for new school buildings in Denbighshire.\nIn 2017, the condition of the school buildings at Prestatyn High School was judged to be “poor” (in a range of good, satisfactory, poor, and bad). Despite careful management and maintenance, this will inevitably broadly remain the case. There are now heightened energy and environmental considerations which should also be reflected in the debate. The school also faces competition from the three nearest alternative secondary schools, all of which have been entirely renewed in recent times.\nIn February 2022, the council considered a motion to ‘seek additional Welsh Government funding in order to fund a complete re-build of Prestatyn High School based on earlier designs drawn up for the 21st Century School programme … to meet the current needs of secondary pupils of Prestatyn’. This was not agreed to. Rather, the council’s Modernising Education Board was asked to review the condition surveys of all schools.\nA report was prepared in April 2022 which, unsurprisingly, confirmed the earlier findings relating to Prestatyn High School and highlighted the cost of the authority’s general maintenance programme.\nIn July 2022, new lead member for education Councillor Gill German, presented a report to DCC’s cabinet which resolved: “Cabinet confirms the view of the Modernising Education Programme Board that no significant change had occurred in respect of the condition of school buildings and that the current policy order of schools is still current and correct.”\nThe position, therefore, remains as before and moves to seek a re-build of Prestatyn High School have for now been overlooked.\nThe council’s interest in Prestatyn appears to have slipped down the list since 2016 when the need to invest in Prestatyn in future bands of funding was first recognised and then highlighted to Welsh Government.\nThe current council leadership, led by Prestatyn Labour members, were elected only in May 2022. In their election leaflets they said, “…bids for Prestatyn have not been put in by successive Tory, Plaid Cymru and Independent led councils. It’s time for Prestatyn High.” In addition to the unfair criticism of previous councils, it is disappointing to say the least that they have broken this promise within a matter of weeks.\nIt is time for Prestatyn High School. This is not a 'political football'. I call upon all elected councillors in Denbighshire to build on the work of the local authority since 2016. Look back and seek funding from the Welsh Government.\nThe learners and staff of Prestatyn High School should be able to look forward to a completely modern and sustainable environment in which their community can learn.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_parliament/content_25.html": "Tweet Here, you can see Dr James Davies' latest speeches and appearances in Parliament (provided by theyworkforyou):\nTopical Questions | Energy Security and Net Zero | Commons debates I welcome Ofgem’s ongoing review of standing charges in electricity bills.\nWorld Species Congress | Westminster Hall debates I congratulate the hon. Lady on securing this important debate.\nWorld Species Congress | Westminster Hall debates I congratulate the hon. Lady on securing this important debate.\nFurnished Holiday Lettings: Taxation | Westminster Hall debates My hon. Friend is being very generous in giving way.\nFurnished Holiday Lettings: Taxation | Westminster Hall debates My hon. Friend is being very generous in giving way.\nUK Trade Performance | Commons debates I hugely welcome the upbeat nature of this statement and the Secretary of State’s reference to Britain joining CPTPP.\nCommunity Ownership Fund | Levelling Up, Housing and Communities | Commons debates There have already been three worthy beneficiaries of the community ownership fund in my constituency: the village shop in Llandyrnog; the S\nCommunity Ownership Fund | Levelling Up, Housing and Communities | Commons debates What assessment his Department has made of the potential impact of the community ownership fund on local communities.\nCommunity Ownership Fund | Levelling Up, Housing and Communities | Commons debates There have already been three worthy beneficiaries of the community ownership fund in my constituency: the village shop in Llandyrnog; the S\nCommunity Ownership Fund | Levelling Up, Housing and Communities | Commons debates What assessment his Department has made of the potential impact of the community ownership fund on local communities.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_business-champions-event-number-10/content_28.html": "I was pleased to invite Tony Palframan managing director of Phoenix Optical Technologies, St Asaph Business Park to attend a Business Champions Event in Downing Street. Tony founded the St Asaph based company in 1991 and since that time it has grown from strength to strength. The company and now makes optics for the defence industry. The event at Number 10 was hosted by the Chancellor Jeremy Hunt to recognise and celebrate the outstanding contributions of local businesses from across the UK. Speaking following his visit, Tony said: “It was an absolute privilege to attend this event at 10 Downing Street and I thank James for inviting me. “I was able to speak to other businesses from across the UK, and I also spoke with Stephen Crabb MP about his committee’s inquiry into what makes big businesses vulnerable, which was very useful. “Overall I had a fantastic day and it was a great honour to be able to represent my business and the area at such a prestigious event.” What Tony has achieved since establishing Phoenix Optical Technologies more than 30 years ago is highly commendable and I was very proud to have him at the event representing the Vale of Clwyd. Local businesses are vital for our economy, our day to day lives and our communities.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_accessibility/content_2.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_category_Opinions/content_17.html": "Privileges Committee: Boris Johnson 20th June 2023 I resigned from the Government (as PPS to the Department of Health and Social Care) last July. In doing so, I wrote to the then PM, Boris Johnson, saying: \"I... Opinions",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news/content_14.html": "Former MP attends official opening of new Prestatyn Police Station which he long campaigned for Monday, 18 November, 2024 Having led a campaign for a permanent police base in Prestatyn town centre, and having worked closely with North Wales Police and Denbighshire County Council on the matter over a number of years, former Vale of Clwyd MP Dr James Davies was thrilled to attend the official opening of the new police station today. North Wales Police and the Office of the Police and Crime Commissioner, working with... Local News\nPrestatyn Environment Projects “never cease to amaze” Wales in Bloom judge 20th September 2024 Prestatyn has been awarded a Silver Gilt in this year’s Wales in Bloom contest, scoring ‘very highly’ in the environment section. However, points were lost this... Local News\nPlaid and Greens prop up Labour to defeat vote of no confidence in Denbighshire Leader and Cabinet 11th September 2024 The Conservative Group on Denbighshire County Council yesterday supported a vote of no confidence in Denbighshire County Council’s Leader, Cllr Jason McLellan... Local News\nDenbighshire Conservative Group prompt Vote of No Confidence in Labour Leader and Cabinet 2nd September 2024 Members of the Conservative Group on Denbighshire County Council will be backing a Vote of No Confidence in Denbighshire County Council Leader, Cllr Jason... Local News\nFormer MPs condemn suggestions that upgrade and electrification of North Wales Coast mainline will be scrapped 31st July 2024 Six Conservatives, who represented North Wales as Members of Parliament until the General Election, have strongly condemned suggestions that the upgrade and... Local News\nWales in Bloom judge impressed by community efforts in Prestatyn and Meliden 29th July 2024 A Wales in Bloom judge has commended the efforts of volunteers in Prestatyn and Meliden for their committed efforts to ensure the area looks its best. Judge Jim... Local News\nMessage of thanks and reflection from Dr James Davies 8th July 2024 A very big thank you to all who put their trust in me at the ballot box last Thursday. Whilst I am incredibly disappointed not to have been elected to represent... Local News\nCall for new recycling system to be paused 18th June 2024 In light of the chaotic situation surrounding the roll-out of the new kerbside recycling system in Denbighshire, Dr James Davies has called on the Council’s... Local News\nBold action to cut taxes and reward hard work to deliver a more secure future for Clwyd East welcomed 14th June 2024 Dr James Davies, Conservative Parliamentary Candidate for Clwyd East has welcomed the launch of the Conservative Party’s 2024 election manifesto, setting out a... Local News\nDr James Davies celebrates 20 years serving the people of Denbighshire 14th June 2024 It is 20 years this week since Dr James Davies was first elected as a local councillor. When James was elected in 2004, he became the youngest member of... Local News",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_category_Local-News/content_19.html": "Former MP attends official opening of new Prestatyn Police Station which he long campaigned for 18th November 2024 Having led a campaign for a permanent police base in Prestatyn town centre, and having worked closely with North Wales Police and Denbighshire County Council on... Local News\nPrestatyn Environment Projects “never cease to amaze” Wales in Bloom judge 20th September 2024 Prestatyn has been awarded a Silver Gilt in this year’s Wales in Bloom contest, scoring ‘very highly’ in the environment section. However, points were lost this... Local News\nPlaid and Greens prop up Labour to defeat vote of no confidence in Denbighshire Leader and Cabinet 11th September 2024 The Conservative Group on Denbighshire County Council yesterday supported a vote of no confidence in Denbighshire County Council’s Leader, Cllr Jason McLellan... Local News\nDenbighshire Conservative Group prompt Vote of No Confidence in Labour Leader and Cabinet 2nd September 2024 Members of the Conservative Group on Denbighshire County Council will be backing a Vote of No Confidence in Denbighshire County Council Leader, Cllr Jason... Local News\nFormer MPs condemn suggestions that upgrade and electrification of North Wales Coast mainline will be scrapped 31st July 2024 Six Conservatives, who represented North Wales as Members of Parliament until the General Election, have strongly condemned suggestions that the upgrade and... Local News\nWales in Bloom judge impressed by community efforts in Prestatyn and Meliden 29th July 2024 A Wales in Bloom judge has commended the efforts of volunteers in Prestatyn and Meliden for their committed efforts to ensure the area looks its best. Judge Jim... Local News\nMessage of thanks and reflection from Dr James Davies 8th July 2024 A very big thank you to all who put their trust in me at the ballot box last Thursday. Whilst I am incredibly disappointed not to have been elected to represent... Local News\nCall for new recycling system to be paused 18th June 2024 In light of the chaotic situation surrounding the roll-out of the new kerbside recycling system in Denbighshire, Dr James Davies has called on the Council’s... Local News\nBold action to cut taxes and reward hard work to deliver a more secure future for Clwyd East welcomed 14th June 2024 Dr James Davies, Conservative Parliamentary Candidate for Clwyd East has welcomed the launch of the Conservative Party’s 2024 election manifesto, setting out a... Local News",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns/content_9.html": "Retaining the Blue Bin in Denbighshire Kerbside Recycling Change Scandal In June 2024, Denbighshire County Council scrapped the popular, easy-to-use and high-performing blue wheelie bin and switched...\nImproving Health Services in North Wales As a GP, and through working as an NHS doctor in the area over the last 20 years, I have become ever more concerned about local service provision through Betsi...\nPrioritising our children's education Education has been devolved in Wales for the last 25 years. This means that it is overseen by the Welsh Government in Cardiff. The Welsh Government levies some...\nBus services in Denbighshire Public transport is important to allow many people in the Vale of Clwyd to access vital services and reduce isolation for some of the most vulnerable in our...\nTheatr Clwyd Redevelopment UPDATE: At the Chancellor's Spring Budget 2024, Theatr Clwyd was awarded £1.6m for their redevelopment. Theatr Clwyd is a well-known and successful community...\nFfordd Parc Bodnant Estate Traffic Survey I have recently been contacted by a number of residents living on the Ffordd Parc Bodnant estate who are concerned about the volume of traffic passing through...\nDenbighshire's 'Wildflower' sites Denbighshire County Council’s “Wildflower Meadows Project” - now in its fifth year, and ever-expanding - has been an increasing source of frustration. These...\nThe Labour Welsh Government’s unworkable 20mph speed limit Do you support my campaign to overturn the 20mph default speed limit?\nEnhancing Rail Connectivity in North Wales A key priority for me during my time at Parliament has been to improve public transport connectivity in order to help Level Up our region. There have been long...\nPushing for a New Hospital at the Royal Alex The redevelopment of the Royal Alexandra Hospital site in Rhyl to create a new, fit-for-purpose North Denbighshire Hospital has been desperately needed for a...\nCalling for Better Access to NHS Dental Services NHS Dentistry in North Wales is provided via Betsi Cadwaladr University Health Board, on behalf of the Welsh Government. As MP for the Vale of Clwyd, I have...\nSecuring a Banking Hub for Prestatyn Over the past years, Prestatyn has lost branches of TSB, Barclays, Natwest, Royal Bank of Scotland, Santander, HSBC and some building societies. This left...",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_my-priorities-clwyd-east/content_8.html": "My priorities for Clwyd East are:\nImproving accessibility and safety within the NHS in North Wales\nHealthcare should not be a postcode lottery. The NHS in Wales has been devolved to Cardiff Bay for 25 years and as a GP, I am very concerned at the repeated and serious failings of Betsi Cadwaladr University Health Board. I will continue to champion patient safety and challenge poor standards. I believe that we need an urgent independent Public Inquiry into the NHS in North Wales. The quality of healthcare in North Wales must be driven up through better UK-wide comparable data on performance and outcomes and by aligning NHS audit and inspection mechanisms across Britain. Patients in North Wales deserve the right to access to NHS services elsewhere in the UK, should they so wish.\nLevelling Up our communities\nUsing public and private investment to regenerate our High Streets and support local businesses. The UK Government is delivering £10 million of LUF into Llangollen and environs, and £11 million for Ruthin town centre, helping preserve and enhance the heritage and culture of the area. In the latest round of Levelling Up Fund announcements a further £20million has been promised to help deliver important regeneration projects in Rhyl, Prestatyn and Denbigh. I am keen to see that Mold and Holywell receive similar investment. A £160m NE Wales Investment Zone is set to bring £1.7bn of investment in Flintshire and Wrexham, and thousands of jobs. Meanwhile, the Community Ownership Fund has allowed for the community buy-out of the Salusbury Arms in Tremeirchion the Llandyrnog Village Shop. The Sun Inn, Eryrys and the Llangollen Museum are the latest to also receive hundreds of thousands of pounds of support from the fund – supporting valued local facilities. This investment will allow regeneration of our High Streets, support local businesses, help make the area the best place to live, work, and play, and provide more and better paid jobs.\nTackling crime and antisocial behaviour\nStamping out anti-social behaviour and making our area safer. North Wales Police now have more officers than ever before but better visibility can provide reassurance and deter crime. I have successfully campaigned for a new police base in Prestatyn and I am now looking to secure an enhanced police station in Holywell. It is vital that antisocial behaviour is stamped out in our communities and that more rural areas do not get overlooked.\nImproving transport\nRegional transport requires vital investment to connect our communities. That is why I will work to implement the promised electrification of the North Wales Main Line and to secure a new Deeside Parkway station. I will also press for the improvement to A55 connections and bottlenecks. Potholes are an issue in many areas but local roads in Flintshire have been particularly neglected by the Labour County Council and this needs to be addressed. I will also continue to fight against the 20mph default speed limit brought in by Welsh Government.\nEnsuring a brighter future for our young people\nOur young people deserve the best opportunities in life. I want to see our young people have the best opportunities, and that requires a strong start. I will fight for new-build High School buildings in Prestatyn. I will work with businesses to promote apprenticeships and skills. I will also fight to ensure fit-for purpose digital connectivity.\nMaintaining and enhancing local quality of life and community pride\nWe must celebrate all that makes our community special. Working with community figures and businesses, I will ensure that local sports teams, charities, and arts, such as Theatr Clwyd in Mold, get the support they need. I will also work to protect and enhance our beautiful environment.\nMore information on these and many other important issues that I have been working on can be read on my Campaigns page.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_global-changemaker-awards/content_4.html": "Vale of Clwyd MP Dr James Davies is asking constituents to get in touch if they know an individual or school they would like to be put forward for the ONE Campaign’s Global Changemaker Awards. ONE’s Global Changemaker Awards have been designed to celebrate the role that members of the public play in making the UK a force for good in the world and the awards will showcase the very best of British spirit. The Awards will highlight the role that members of the public play in building up our global reputation and recognise those who have managed to go above and beyond to make change happen. The world is faced with a series of converging crises; the invasion of Ukraine, global hunger, climate change and health insecurity. It is sometimes difficult to remember to recognise the positive actions that individuals take each day to support global change when we are faced with such pressing challenges. That is why the ONE Campaign has set up the awards and asked MPs to nominate individuals and schools in their constituencies who have made a real difference, be that by carrying out charitable work overseas, volunteering in a local charity shop, or advocating for action on climate change. James wants to recognise as many of these inspiring individuals as possible to praise their efforts and hopefully encourage others who are looking to drive change. So, if you know an individual who is deserving of this award, then get in touch with Dr James Davies MP’s office at [email protected] using the subject line “Global Changemaker Awards”. There is no specific criteria for nominations. Commenting on the awards Dr James Davies MP said: “I am delighted that nominations have now opened for the ONE Campaign’s Global Changemaker Awards, to recognise those who have supported global change. “I am keen to recognise all those in the Vale of Clwyd who have made a difference on the world stage. If you know people in schools, organisations or the local community who have made a difference, big or small, in the world then please do get in touch with my office. The award winners will be celebrated at a parliamentary reception on Monday 27 November 2023.”",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk/content_1.html": "My Campaigns\nContact\nClwyd East Campaign Contact\n07761618272\nDo you live in Clwyd East?\nEnter your postcode to confirm that Dr James Davies is your candidate.\nI'm Dr James Davies, the former MP for Vale of Clwyd and the recent Conservative Parliamentary Candidate for Clwyd East. Here you can find news, campaigns and more about me.\nEnter your postcode to confirm that Dr James Davies is your candidate.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_retaining-blue-bin-denbighshire/content_23.html": "Kerbside Recycling Change Scandal\nIn June 2024, Denbighshire County Council scrapped the popular, easy-to-use and high-performing blue wheelie bin and switched to a less flexible system which has made recycling more difficult; left many streets in a littered state; and is unlikely to bring any improvement to recycling figures which could not have been achieved with the previous system.\nThe council followed this path under heavy pressure from the Labour/Plaid Welsh Government to adopt their preferred model, but did not have to do so.\nAt the time of implementation, Denbighshire County Council was close to having spent £22m of taxpayers' money on the changes - including £10m of its own funds (£1m from reserves and £9m borrowed).\nIn early October 2024, Denbighshire County Council's Labour/Plaid Cabinet acknowledged that the rollout of the new system \"hasn't worked as we envisaged\". £640,000 extra had already been spent on overtime, agency staff and the hire of additional vehicles. It was agreed to borrow £1.299m more to purchase additional recycling vehicles. It was also agreed to take on further staff and to increase the number of waste collection rounds by 40%. The result is to be an additional recurring cost to the council of £1.067m every year.\nThis outcome has vindicated concerns I raised in writing five years ago and repeatedly since (https://www.jamesdavies.org.uk/sites/www.jamesdavies.org.uk/files/2024-…) - including that the modelling of collection rounds was likely to be overly optimistic and that any switchover needed to be on a phased basis. In summary, I said in 2019: \"...it is not at all clear that the proposed changes would be less costly [than retaining the existing system], as both the initial and ongoing capital and revenue funding requirements are unlikely to be have been fully scoped. To put faith in over-optimistic theoretical modelling which indicates relatively small savings, while at the same time so many potentially costly unknowns exist, means exposing the council to excessive risk and is unlikely to be justified when it will result in a worse service for householders\".\nThe reason given for the service changes was the need to increase recycling rates, yet the most recent statistics (2023-24) demonstrated that Denbighshire was already achieving an impressive 67.6% recycling rate. It was performing above average for Wales, and second best out of the six councils in North Wales. Importantly, it was doing better than some councils which already had the model it intended to implement.\nThe actual reason for the change was always about trying to save money, and receiving millions in the process for setup costs from the Welsh Government. Yet the projected annual savings were always small and based on variable factors. As predicted, the £22m upfront cost of the change and now the additional £1.067m per annum cost mean that the inferior new system will cost the taxpayer significantly more than the successful former one.\nI consider the council's decision to ignore opposition and plough ahead regardless to be one of the worst decisions it has ever made, and to be unforgivable in the context of this year's 9.34% council tax increase.\nThe introduction of the new system in June 2024 followed on from many delays and cost increases in relation to the plans, the impact of which were never properly reviewed. The council proceeded on the basis of support from its Cabinet only - Full Council was never given a vote on the matter.\nThere are separate unpopular and onerous Welsh Government requirements that workplaces have had to conform to since April 2024, which do not apply in England.\nCampaign\nIn October 2019, amongst other measures, Denbighshire County Council (DCC) proposed to replace the blue wheelie bin with separate ‘kerbside sort’ recycling boxes stacked up on a trolley (the \"trolleybox\"). I responded to this proposal with a 5-page submission (as referred to above).\nSince before being re-elected as MP for the Vale of Clwyd in December 2019, I had campaigned on behalf of residents in Denbighshire to retain the blue bin kerbside recycling service.\nI have on many occasions since that time met and exchanged correspondence with senior officers and county councillors. There were other ways in which recycling rates could have been boosted while retaining the blue wheelie bin. However, they showed an unwillingness to reconsider or explore a range of other options or compromises.\nLimited consultation carried out by the council was dishonest - failing to spell out the fact that the blue bin was under threat. There was in general a reluctance to communicate the proposed changes to the public, in the knowledge that they would be very unpopular.\nI made two particular suggestions to the council in July 2021:\n(1) That optimal recycling promotion and enforcement activity be implemented on the existing system. If recycling rates were the true reason for the change, the council would already have been doing this.\n(2) That a full assessment be carried out on the impact of the forthcoming national Deposit Return Scheme, the details of which currently remain unclear, but which threatened to derail any business case for the council’s proposals.\nIn 2022 and early 2023, I made further calls for a re-evaluation of the council's plans, given spiralling costs. I was led to believe that there was always a Plan B which involved retention of the blue bin. However, there was a strong reluctance by the then newly elected council to examine this.\nIn the spring of 2023, I sent out 5,000 surveys which included a question about the kerbside recycling service. Replies indicated that the vast majority wanted to retain the existing system - but it was evident that many still remained unaware of the proposed changes.\nIn November 2023, I visited Shotton Mills Ltd (SML) with Gareth Davies MS and Denbighshire Conservative Councillors. This facility was the destination of Denbighshire's co-mingled blue bin kerbside waste, which it processed via a Materials Recovery Facility (MRF).\nThe company advised us that the UK has a requirement of 8m tonnes of cardboard per annum but currently only has the capacity to process and produce 3m tonnes. Britain currently exports recycled fibre to the continent and imports cardboard boxes. SML is therefore investing heavily in the site, converting its newspaper production to cardboard box production. They also intend to produce tissue products.\nSML will need to actively encourage councils to send it paper and cardboard waste so as to allow it to fulfil its future plans for the site. It sells sorted glass and plastic “downstream” and can continue to do this. As a result of the Welsh Government's policy strategy, it is now having to bring most of the waste it processes from elsewhere in the UK.\nMy assessment was that SML needed DCC’s paper and card waste in particular and that the collection of cardboard in a bag attached to a trolleybox has been a backward step, with the material being more liable to be wet, hampering the recycling process.\nCouncil Refuses to Listen\nUnfortunately, in March 2023 I was advised that: “the formal view of the council is that switching to the new waste model is not a mistake” and that “current [Labour-led] Cabinet…remain strongly supportive of the project…”\nThese plans were put in place despite the fact that other councils in the country, with UK Government encouragement, had been making the opposite move - from boxes to co-mingled wheelie bins - and that many residents in neighbouring Conwy, which already had a trolleybox system, continued to complain bitterly at the lack of space for cardboard and the mess created when the trolleyboxes blow over on windy collection days.\nDenbighshire CC confirmed to me that they had no plans to increase road sweeping to remove street litter under the new system, even though this was found to be necessary prior to the blue wheelie bin system being introduced.\nBackground\nBetween 2006 and 2012, the mixed recycling blue bin replaced a primitive system of recycling collections by way of a blue box and dumpy bag. As a resident and at that point also a County Councillor, I knew that the old system made recycling too difficult and frequently allowed litter to escape onto our streets.\nThe introduction of the co-mingled blue wheelie bin service was popular as well as successful. It helped Denbighshire County Council achieve excellent recycling rates compared with other counties. Recycling was made convenient and flexible and, of course, the environment benefited as a result.\nDespite this, the Welsh Government (WG) has persistently applied pressure on the council to move away from the blue bin, at significant cost to the taxpayer. For a number of years, the council rightly rejected this, producing leaflets and posters such as the one uploaded to this page.\nWhere from here?\nQuite apart from the scandalous costs involved, the new recycling system has been shown to be a step backwards. The trolleybox and attachments have limited capacity, are flimsy, and are prone to blowing over in the wind.\nNational legislation will increasingly require a simpler range of packaging that is more easily recyclable, while a UK-wide Deposit Return Scheme will also change the waste that needs collecting.\nIn my view, the County Council needs to look towards reinstating household wheelie bin collections for recyclable materials - possibly adopting dual stream co-mingled collections as are being introduced by other councils.\nThe council states that it cannot reverse the recent changes, else the Welsh Government will claw back millions of pounds of grant funding it has received. However, my understanding is that no serious discussions have yet taken place between the council and the Welsh Government to properly explore this matter. The new waste model has required the construction of a new depot on the Colomendy Industrial Estate in Denbigh and there is scope for this to be used in any scenario.\nN.B. The video above was filmed in 2019, before the project costs increased.\nYouTube video 2024 General Election:\nPrevious Facebook posts on this matter:\n9th Jan 2019: https://www.facebook.com/share/p/LTNo59bsjz33oD2r\n11th Jun 2019: https://www.facebook.com/share/p/4H1AF1vvB8bdzHAc\n16th Nov 2019: https://www.facebook.com/share/v/mk3tnkoPWktfPELJ",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_pushing-new-hospital-royal-alex/content_16.html": "The redevelopment of the Royal Alexandra Hospital site in Rhyl to create a new, fit-for-purpose North Denbighshire Hospital has been desperately needed for a number of years. This has been made ever clearer in recent years in view of the fact that Glan Clwyd Hospital is under immense pressure and has been struggling to cope. This new facility in Rhyl would ease some of the pressure and provide people with health services they can better depend on.\nThe Royal Alexandra Hospital site is more accessible than Glan Clwyd Hospital for many living on the coast and could provide a wide range of important services.\nFinal plans for the site set out that services will include:\n- Community beds, a same-day minor injuries and illness service, a treatment zone, and outpatient therapy and IV therapy services\n- Sexual health, community dental, radiology, adult psychology, older people’s mental health, and child and adolescent mental health services\n- Infrastructure improvements, including multi-disciplinary working spaces and car parking enhancements\n- The refurbishment of the existing Grade-II listed hospital building, as well as a new-build modern hospital\nI have been involved with this project since its inception. I argued in 2012, when a county councillor, that Chatsworth House Community Hospital in Prestatyn should not shut until a replacement such as this was in place.\nOver the last decade, I have taken every opportunity to emphasise the importance of a new Royal Alexandra Hospital to Ministers in the Welsh Government, who are ultimately responsible for following through on the project. Indeed, this hospital was promised to the people of North Denbighshire by the then Health Minister, and now First Minister, Mark Drakeford, back in 2013. However, regrettably they have not been as supportive of the plans as I would wish.\nIt was hoped that the Welsh Government would release capital funding to begin construction in December 2021. This did not materialise. I wrote to the Welsh Health Minister in January 2022 to register my concern.\nHaving not heard of progress from the Welsh Government on the project for some months, I wrote to the Health Minister again in May 2022, stating that eight years without any significant progress was unacceptable.\nMonths later, we were told there was a chance it could not go ahead at all. Therefore, I wrote directly to the First Minister in October 2022 to raise the importance of progressing with this development as quickly as possible. You can read this letter below. I received a response from the Welsh Health Minister who again stated that a decision was yet to be made.\nThe Health Minister at Cardiff Bay stated in her response me that, \"significant pressures [are] being experienced across NHS Wales schemes\", and that, \"difficult choices will need to, and are having to be made\".\nHowever, having obtained health capital budget figures for both Wales and England for comparison, I am not convinced this response stands up to scrutiny.\nThese figures show that for 2022/23 England plans to spend £185 per head on NHS capital projects, compared to £106 per head in Wales. The Barnett formula currently gives Wales a 20% funding premium, so spending on new hospital buildings in Wales is far lower than where it ought to be.\nI am clear that constituents in the Vale of Clwyd deserve better than this, and it is vital that the Welsh Government get their priorities right. The North Denbighshire Hospital is what constituents need, rather than more politicians in Cardiff Bay and an unworkable, costly scheme to create a blanket 20mph national speed limit.\nI will continue to push the Welsh Labour Government to prioritise this development and reach a positive decision on the Full Business Case as a matter of urgency.\nI am also working with the Health Board to encourage options for part of the development to be funded via other (regional) means.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_prestatyn-environment-projects-never-cease-amaze-wales-bloom-judge/content_11.html": "Prestatyn has been awarded a Silver Gilt in this year’s Wales in Bloom contest, scoring ‘very highly’ in the environment section.\nHowever, points were lost this year due to a lack of colourful displays in the Town Centre.\nWales in Bloom is a regional event that falls under Britain in Bloom, organised each year by the Royal Horticultural Society and designed to encourage community spirit and pride.\nIt used to be primarily a floral competition, but now it is much more community-orientated, and judges look at a variety of things, including litter, signage, graffiti and flyposting, woodlands and much more. It provides a useful opportunity to ensure the town is looking good ahead of the tourist season.\nThe judge, Jim Goodwin, completed his report on the town following his visit in July and told Prestatyn in Bloom Committee Members “you should not be disappointed that you have not achieved Gold this time. Silver Gilt is still a worthy award, for what you have achieved this year”.\nThe town received its highest score in the Environment section, with the judge stating “You never cease to amaze me in this section”. He was impressed with the Morfas, the seafront, the dunes, the Morfa Gateway Allotments, as well as the Ffrith.\nWork at the Roman Bath House was also commended.\nMr Goodwin said:\n“The wetlands are very special, but the Belted Galloways [cattle] proved elusive again. There is much more I could mention in this section, but you have an element here that is so successful.”\nIn the Community section, he was impressed with the educational work and Alpacas at Tiny Tots Day Nursery, the Hedgehog Hospital, and work at the Ffrith.\nIn the Horticulture section, points were lost due to the lack of colour in the Town Centre. Mr Goodwin said “reductions were apparent, and this needs to be addressed, if possible, in this area”.\nHowever, he commended the station and its surrounds for being “particularly colourful\".\nCommenting on the report Dr James Davies, who is Chair of Prestatyn in Bloom, said:\n“As the judge said, a Silver Gilt is still a commendable achievement. However, having previously been awarded Gold, it is disappointing that we were unable to maintain that standard this year.\n“The overriding reason for us slipping down the league table this year has been council cuts. We knew these were going to affect our overall score; there is no getting way from the fact that the floral displays in the town centre haven’t been as good this year.\n“Also, the town has not been as tidy due to the bin chaos we have seen across Denbighshire. Without a doubt this has resulted in more rubbish being strewn across our streets. We have also seen staff who would normally be maintaining our grassed areas and town centres, being taken off the job to collect bins.\n“The horticultural session sadly let us down this year. We will now do as the judge recommends and review this section and try to bring it in line with the other areas where we scored highly. As Mr Goodwin said: “a small improvement here would bring you back into contention with your nearby rivals”, which is what we want to ensure for next year.\"\nPositive discussions have already been held with the Town Clerk of Prestatyn Town Council with regard to town centre displays for 2025.\nThis year, Prestatyn also claimed the Norman Stewart Award, bestowed upon James for his long-time support for Prestatyn's entry to Wales and Britain in Bloom.\nJames has been the driving force behind a regular bloom entry since 2010 and was nominated for the award for demonstrating “unwavering commitment, passion, and dedication not only to the improvement of his hometown but also to the wider Wales and Britain in Bloom initiatives”.\nAwarding him with the accolade they also stated that James “has led the local team success over the last 14 years - no matter what else he had going on both personally and professionally, Bloom was always considered a priority. He underestimates the impact that his leadership has had on the local community. It is clear that he has been responsible for significant developments in his town and has plans for many further improvements”.\nThey also said that ever since being a teenager, James “has been a community champion and actively involved locally. He has never been one to showcase his personal achievements, but he deserves an enormous amount of credit. His drive, attention to detail and desire for perfection means that he cannot rest until every lamppost sticker has been removed! He has even trained his sons to love a litter pick”.\nJames added:\n“We may not have achieved Gold this time, but a Silver Gilt is still extremely impressive and we have much to be proud of.\n“2024 presented us with many challenges, but we remained committed and proved that dedication and hard work always pays off.\n“I would like to thank everyone involved in helping us achieve this result and I look forward to working with you all again, and hopefully getting us back to Gold status in 2025.”",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_start-work-new-north-denbighshire-community-hospital-hoped-be-imminent/content_24.html": "Vale of Clwyd MP Dr James Davies has welcomed news that work on the new North Denbighshire Community Hospital is set to start no later than December 3rd, subject to capital funding being released by the Welsh Government.\nLast month James contacted Betsi Cadwaladr University Health Board (BCUHB) to request an update on the development, situated on the site of the Royal Alexandra Hospital in Rhyl, and was pleased to be told in a response from the Chief Executive that an agreement has been reached with the contractor “based upon a start date of no later than 3rd December 2021”.\nWelcoming progress James said:\n“Having been involved in this project since its instigation, I have been keeping a close eye on its development and I am therefore very pleased to hear that work could get underway very soon. Obviously, this is subject to the capital funding being released by the Welsh Government and I really hope there are no delays on this front. Residents have been waiting long enough for this development.”\nThe response from the Chief Executive states:\n“Following submission of the revised Full Business Case to the Welsh Government on 8th March 2021, the Health Board received a number of comments and questions as part of the Welsh Government’s scrutiny process. A full response was provided by the Health Board to the scrutiny questions on 28th April 2021 and we are now awaiting final confirmation of Welsh Government capital funding.\n“NHS Wales Shared Services Partnership – Specialist Estates Services (NWSSP-SES) subsequently requested additional information, including: The full business case assumed a start on site date in May 2021; NWSSP-SES requested that the contractor update their price based upon a start on site of third quarter 2021.\n“I am pleased to confirm that we have now reached agreement with the contractor based upon a start date of no later than 3rd December 2021. Our Cost Advisors have confirmed that the revised price is reasonable and in their professional opinion represents value for money.\n“As a consequence, I can now confirm that all outstanding information has been provided to NWSSP-SES and I am hopeful that this important project will soon receive the final funding approval to proceed.”\nJames added:\n“This new hospital is much needed in the area and local residents are really looking forward to being able to easily access the modern healthcare facilities they require and deserve.\n“It was first promised in 2012, so it has been a long time coming. However, with a start date now in the diary, I am hopeful that we will see considerable progress very soon.\n“I will continue to liaise with the Health Board and keep residents updated on progress.”\nServices at the new hospital will include community beds, a same-day minor injuries and illness service, a treatment zone, and outpatient therapy and IV therapy services.\nSexual health, community dental, radiology, adult psychology, older people’s mental health, and child and adolescent mental health services will also be provided from the site.\nFurther, the development will incorporate infrastructure improvements, including multi-disciplinary working spaces and car parking enhancements.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_levelling-funding-bid-vale-clwyd-submitted-hm-government/content_22.html": "A £20 million Levelling Up bid for the Vale of Clwyd, under the UK Government’s Levelling Up Fund programme, has now been ‘locked in’, triggering the start of the assessment process.\nThe Vale of Clwyd bid forms two cohesive projects targeting Town Centre Regeneration and Environmental Regeneration and, if successful, can bring significant benefits, and impact positively on the area.\nVale of Clwyd MP Dr James Davies has been working closely with Denbighshire County Council throughout the application process.\nHe said:\n“If this bid is successful, it will bring many welcome changes to local communities.\n“I believe the projects within the application will support economic recovery, through regeneration and growth.\n\"It is clear to me it is a local priority to restore a sense of pride to Rhyl town centre, as the bid proposes.\n“The positive change this can bring can result in new opportunities and jobs for local people.\n\"I also very much welcome the plans for Denbigh, Prestatyn, Bodelwyddan, and Rhuddlan, which would make a difference to the everyday life of many in these towns – facilitating the success of local businesses, and encouraging active travel and well-being.\n“There has been much hard work put in to formulating this bid and I extend my thanks to all involved.\n“I very much hope the bid is successful and have ensured Ministers are well aware of its merits. We await the outcome this autumn.”\nVale of Clwyd bid projects:\nTown Centre/Regeneration Projects:\n* Rhyl Public Realm & Active Travel - Public realm (narrow carriageway and widen paths, granite setts or yorkstone paving, LED lighting, cycle parking, bollards, etc) and green infrastructure to Rhyl Town Centre.\n* Rhyl Central Promenade Scheme - Re-connecting the town centre with the promenade and beach. A phased approach to public realm improvements incorporating a greener / natural public realm and unifying the leisure offer. Edward Henry Street to Bath Street.\n* Rhyl Town Centre Gateway Scheme - Redevelopment of site opposite Apollo with a quality public realm scheme.\n* Rhyl Queens Building external - Improve the impact of Queens building through phase 1 of enhanced external elements, incorporating hard landscape (eg resin bound gravel, recessed service covers), street furniture (eg cycle shelter, cycle stand, tree seating, retractable canopy, ground lighting), fencing and soft landscaping.\n* Prestatyn Public Realm & Greening - Upgrades to the public realm, including native greening, on Prestatyn High Street.\n* Denbigh Hospital - Part of a wider financial package to facilitate progression of the scheme, together with active travel work to connect the site with the town.\n* Denbigh Buttermarket - Community Hub Repurpose a Grade II listed building to create a health, wellbeing and culture centre with a museum area and archives. Incorporating an area for work / training.\nEnvironmental Regeneration Projects:\n* Bodelwyddan Country Park Improvements - New woodland planting, trees and wildflower meadow. New access paths, car parking, toilets, ecological enhancements and landscaping. Upgrade play area and trench experience.\n* Prestatyn Repurposed Nature Walk - Include upgrades to Dyserth Way and accessibility for all at Morfa, to compliment and connect to DCC's recent work in the wetland area. Improvements to the Prestatyn Dyserth Way (PDW) on the track bed for cycling and walking will link the PDW to the signal box and around the wetlands. Conversion of the signal box into a community café / facility. Link the viewing platforms on the wetlands with cycling/walking around the periphery of the wetlands. Improve the paths around the Morfa's.\n* Rhuddlan Coed Y Brain Community Hub - Conversion of former children’s nursery into a community facility to provide toilets, kitchen and refreshments area and meeting room.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_enhancing-rail-connectivity-north-wales/content_26.html": "A key priority for me during my time at Parliament has been to improve public transport connectivity in order to help Level Up our region. There have been long term issues around investment in rail services to and from North Wales.\nIt is vital that rail infrastructure is improved so that we can tackle key issues such as deprivation and boost the economy of the region.\nExisting rail services were severely impacted by the pandemic, compounding connectivity issues.\nI have been involved in efforts to improve action on both fronts during my time in office.\nUntil appointment as Minister, I was Chair of the Mersey Dee and North Wales All Party Parliamentary Group, and I worked with Growth Track 360, the Mersey Dee Alliance and other political, business and local authority leaders to put forward the strong case for cross-border rail infrastructure investment. Investing in rail is one of the best ways to boost our regional productivity, create employment opportunities and address the need to hit our Net Zero Carbon target.\nI continually made representations to Transport and Treasury Ministers to ensure that the changes needed in rail infrastructure in North Wales were prioritised. Therefore, I was delighted by the Prime Minister's announcement that he will be investing £1billion to allow for electrification of the North Wales mainline. This will improve journey times and reliability and reduce the carbon footprint on the route.\nI have also put this issue directly to the Prime Minister, and he confirmed that Network Rail has now received funding to carry out feasibility work on improving the North Wales Main Line. You can see this contribution here: https://www.youtube.com/watch?v=UOj_GrBFZZo\nIt was also very welcome that, after making many representations on the issue myself, the Union Connectivity Review recognised the persistent calls of Growth Track 360 for rail improvements into our region. I also raised this directly with the Prime Minister after the interim report findings were published: https://www.youtube.com/watch?v=GI1lN9pXfgk\nI have been working to make sure electrification progresses as quickly as possible.\nHowever in the meantime, I also continue to raise the serious concerns of constituents at the standard of the Welsh Government's nationalised \"Transport for Wales\" rail services. These have the worst performance figures and the worst customer satisfaction rate of all rail services in Great Britain. I am pleased that in November 2023 the Office for Rail and Road (ORR) launched an investigation into poor train punctuality and reliability in the region. The ORR has found that performance is continuing to deteriorate while the wider network across Great Britain has seen performance stabilising.\nI have also repeatedly expressed my significant concern that Avanti West Coast services have remained far less frequent than before the pandemic and are still unreliable. It is clear that workforce reform is required to allow companies such as Avanti to deploy their workforce more flexibly. Even so, Avanti itself must accept responsibility for many of its workforce relations issues.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_volunteer-us/content_7.html": "A General Election has been called and we will be going to the polls on Thursday 4th July. If you would like to help Dr James Davies' campaign to become the first MP for Clwyd East, please complete the survey below:\nA General Election has been called and we will be going to the polls on Thursday 4th July. If you would like to help Dr James Davies' campaign to become the first MP for Clwyd East, please complete the survey below:",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_improving-health-services-north-wales/content_6.html": "As a GP, and through working as an NHS doctor in the area over the last 20 years, I have become ever more concerned about local service provision through Betsi Cadwaladr University Health Board. These issues long preceded the pandemic and were one of the reasons that drove me to seek election at the national level. I had found that the representations that I and others were raising 10-15 years ago were not being heeded - from the closure of community hospitals to the failure to keep up with other parts of the UK over necessary reforms, standards and infrastructure upgrades.\nI formerly worked at Glan Clwyd Hospital as a junior doctor and my insight now is assisted by work I undertake during Parliamentary recess as a GP in both NE Wales and W Cheshire; there is a very clear divide between NHS performance in the two, which was not the case prior to devolution.\nIn recent years, my concern has been heightened by large numbers of awful stories that have been brought to me by constituents and patients who have often come to harm unnecessarily – as well as colleagues who work in the health service. On a regular basis I am hearing from constituents with shocking accounts of difficult access, failing services and poor patient outcomes.\n- Healthcare in North Wales is a national scandal, say MPs and ITV report\n- ITV Wales examined preventable deaths in the North Wales NHS: Prevention of Future Deaths Reports 19/04/24\n- The former Secretary of State for Health, the Rt Hon Sajid Javid MP, gave an indication of his concerns here.\n- The NHS in Wales was discussed on Radio 4.\n- BCUHB was returned to Special Measures at the beginning of 2023.\n- Audit Wales report identified a \"deeply worrying degree of dysfunctionality\" at Betsi Cadwaladr.\n- Significant concerns were raised following HIW Inspections.\n- Accountancy firm, Ernest Young investigation revealed BCUHB wrongly and deliberately accounted for £122million\n- Secretaries of State for Wales and Health have called for an independent inquiry into BCUHB.\nIn Wales, the NHS has been under Labour control for the last quarter of a century – including via the devolved Welsh Administration since 1999. Since the early 2000s, the NHS in North Wales has become increasingly unfit for purpose. For too long, Welsh Labour Ministers have been letting down patients and the dedicated, hard working NHS staff in North Wales with poor management and organisation of the NHS across Wales as a whole.\nWhile still facing challenges, the NHS in most other parts of the UK performs far better and more safely, often with a lower expenditure per head of the population. It is a disgrace that some are feeling the need to move out of North Wales to other parts of the UK out of fear over the local health provision.\nIt has become clear to me in recent years that Cardiff Bay lacks the capacity and capability to improve the quality of the service here in North Wales and does not understand the nature of our region and the severity of the issues at hand. I therefore need your support to secure a public inquiry into the NHS in North Wales. I also want your backing for the introduction of UK-wide comparable statistics on NHS performance and outcomes. We need to ensure a minimum standard of care for all British citizens, as well as fully interoperable data.\nI believe that the pandemic has demonstrated how comparable data in the NHS can help improve policy decision and, ultimately, patient outcomes. Therefore, I have been pushing for the UK Government to mandate UK-wide comparable and interoperable data. By introducing UK-wide health data, politicians at all levels will be held to account, practitioners and policy makers can better share best practice, and, ultimately, equal health outcomes will be promoted. I am pleased that this pledge has been included in the Conservative Manifesto.\nWaiting lists in North Wales are a particular concern, and have contributed towards the vicious circle of decline and dysfunctional service provision that exists in A&E, the ambulance service and primary care. Currently there are 25,000 people in Wales who have been on a waiting list for two years or more. That compares to England - which has 20 times the Welsh population - where the equivalent figure is just 200.\nThe UK Government has twice offered to the Welsh Government to help reduce waiting lists in Wales by offering access to NHS hospitals in England. This offer is yet to be taken up. I believe that patients in North Wales should have the right to choose to access NHS hospital services anywhere in Britain.\nMore broadly, I have been working very hard to find ways to resolve these issues, despite devolution. Part of my campaign to improve the service has been to work with my Conservative colleagues in North Wales to push influential groups and stakeholders to take action and acknowledge the failings.\nI have met the Health Board repeatedly, along with the North Wales Community Health Council, the Senior Coroner for North Wales (East and Central), Healthcare Inspectorate Wales, the General Medical Council, Audit Wales, the Royal College of Surgeons, Health Education and Improvement Wales and Donna Ockenden.\nDetails of some of my recent efforts can be found at the bottom of this page under 'News'.\nIt is clear to me that we need to restore UK-wide audit and inspection mechanisms to ensure patient safety.\nYou can give me your views at: https://letstalk.conservatives.com/7D3C67A8-A948-EE11-A3B6-00505693FFD8\nI have also been made aware of the difficulties constituents in North Wales have had in accessing the 111 service. You can see my comments to ITV News on this issue here: https://www.youtube.com/watch?v=JuUg9D_J-bY\nGiven the reports I hear regularly of unacceptable and sometimes unsafe healthcare through Betsi Cadwaladr University Health Board, I was not surprised that the Health Board was returned to special measures. However, I remain concerned at the potential for a turnaround while longstanding layers of management remain largely untouched. You can read more of my thoughts on this here.\nI regularly raise individual cases with the Health Board and with GP surgeries to assist constituents with their concerns on matters of policy, process and access to services, and I welcome contact from anyone who feels I can assist.\nI am also aware of the significant issues many constituents are facing with accessing NHS dental services in the local area. This is sadly representative of an underlying, significant issue with access to NHS dentistry across Wales more broadly. Therefore, I have been calling for rapid improvements in this area, and you can read more details on my recent efforts here.\nThe UK Government is providing historic funding for the NHS, and is committed to investing in our health and public services properly. There are 200,000 more employees in the NHS since 2012 and UK expenditure on health is now ranked 6th out of the 38 OECD countries as a percentage of GDP. Despite difficult national financial circumstances, NHS spending has increased every year since 2010 - in total by over a third in real terms.\nUnfortunately, there is no quick fix to local NHS failures. However, I have a good understanding of the problems that exist and their causes and am actively working with colleagues on all options available.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_north-wales-conservative-mps-conclude-programme-meetings-about-local-healthcare/content_15.html": "In the final of several meetings to discuss serious concerns regarding healthcare provision in North Wales, the region’s Conservative MPs have met senior representatives of Audit Wales, including Auditor General Adrian Crompton.\nOver the last number of weeks, the MPs have met the North Wales Community Health Council, the Senior Coroner for North Wales (East and Central), Healthcare Inspectorate Wales, the General Medical Council and Donna Ockenden.\nThe Welsh Government has been responsible for healthcare in Wales since devolution in 1999.\nAudit Wales has a remit to assure the public that devolved public money is being managed well, and empower the Welsh public sector to improve. In recent years, it has published a string of critical but constructive reports on the NHS in North Wales.\nDuring the meeting, it was agreed that the senior management at the Health Board was now good, and that progress had been made in some areas. However, it was accepted by all that very major issues persist and in some cases, continue to worsen. Key matters raised included the importance of the Health Board’s medium term proposals, the effectiveness of middle management, and the need for clinicians to be signed-up to improvement plans.\nMPs committed to sharing with Audit Wales issues of concern being raised with them by residents over the coming months. They now intend to discuss the outcomes of their meetings, with a view to ensuring all necessary steps are taken to prioritise patient safety.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_north-wales-conservative-mps-meet-senior-coroner-discuss-local-healthcare/content_20.html": "As part of an ongoing programme of meetings regarding healthcare provision in North Wales, regional Conservative MPs have met the Senior Coroner for North Wales (East and Central).\nThe Senior Coroner, Mr John Gittins, has a statutory responsibility to investigate violent, unexplained or custodial deaths, amounting to nearly 3,000 per annum. This gives him a unique perspective on patient care and management processes.\nDespite Betsi Cadwaladr University Health Board (BCUHB) having been lifted out of special measures in November 2020, regional Conservative MPs - Sarah Atherton (Wrexham), Simon Baynes (Clwyd South), Virginia Crosbie (Ynys Môn), Dr James Davies (Vale of Clwyd), David Jones (Clwyd West) and Robin Millar (Aberconwy) – have been receiving worryingly high and increasing levels of correspondence from local residents regarding delays to, and inconsistencies with, treatment.\nOne issue at the forefront of discussions was A&E delays and their impact on wider healthcare provision. It was recently stated that BCUHB is the worst performing area in Wales against the four-hour A&E target, with only 59.5% being seen within four hours. Partly as a consequence of this situation, ambulance response times are often being extended far beyond what is acceptable, with detrimental consequences. During the meeting, the Senior Coroner, who has the responsibility to issue ‘Prevention of Future Death’ reports (Regulation 28), noted that he produced reports on this matter as far back as 2013 and that the challenges have intensified, particularly since the Covid-19 pandemic.\nThe MPs referred to welcome engagement with the current senior management of the Health Board and the fact that the challenges affecting the NHS in North Wales do not primarily relate to funding. The NHS in Wales has been managed by the Labour Government in Cardiff Bay since devolution in 1999.\nHaving called two meetings – with the Senior Coroner and the Community Health Council – the North Wales MPs are building a comprehensive picture of the challenges facing Betsi Cadwaladr University Health Board. The MPs are also meeting Healthcare Inspectorate Wales, the General Medical Council and Audit Wales in the coming weeks.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_fighting-safe-and-accessible-nhs-north-wales/content_13.html": "As a General Practitioner I have first-hand experience of how the healthcare system in North Wales is letting too many people down. My parliamentary inbox is full of concerns from those who have suffered as a result - both patients and healthcare staff.\nI need your support to secure a public inquiry into the NHS in North Wales. I also want your backing for the introduction of UK-wide comparable statistics on NHS performance and outcomes. We need to ensure a minimum standard of care for all British citizens.\nYou can sign up to support this campaign at https://go.backourcampaign.co.uk/vale-of-clwyd-health",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_securing-banking-hub-prestatyn/content_32.html": "Over the past years, Prestatyn has lost branches of TSB, Barclays, Natwest, Royal Bank of Scotland, Santander, HSBC and some building societies. This left Prestatyn High Street without a single bank or cash machine, despite being a busy regional shopping centre.\nFollowing a successful campaign to reinstate cash machines within the High Street, I turned my focus to the revival of banking services within the town centre.\nA landmark agreement at the start of 2022 led to banks and leading consumer groups forming a “Cash Action Group”. LINK took on the role of assessing the impact of proposed bank branch closures on communities. As of 4th July 2022, the agreement was extended to include communities where bank closures have already taken place. LINK can recommend new cash services, such as banking hubs and ATMs, according to the cash access needs in each community. New services will then be delivered by a new banking hub company set up by the banks, or, in the case of ATMs, by LINK.\nThe Government’s Financial Services and Markets Bill puts this very welcome voluntary arrangement on a statutory footing.\nI led discussions with LINK to highlight Prestatyn’s need for face-to-face banking facilities and put the town forward for assessment for a banking hub. I also raised Prestatyn’s need for banking services within a number of Parliamentary debates.\nI arranged for LINK to visit Prestatyn for a second time, for a tour of the town centre. The purpose of this visit was to provide context to data being used in the decision making progress and to illustrate the real need locally for a banking hub within the town centre. During the visit, LINK also spoke with a number of business owners, who reiterated the need for easier access to banking services in the town.\nI was therefore delighted when LINK confirmed Prestatyn will be home to a Banking Hub.\nThis Hub was the first in Wales and opened at the of 2023. It is based in the former HSBC building at the bottom of Prestatyn High Street and accommodates Halifax, NatWest, Barclays, Santander and HSBC.\nI know that the Banking Hub is already appreciated by many.\nI am aware other communities across the constituency are also in need of face to face banking facilities and I have submitted a consultation response to the Financial Conduct Authority's \"Access to Cash\" consultation to share my views on how local communities could benefit from a change in the current legislation.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_cleaning-rhyl-cut-and-prestatyn-gutter/content_18.html": "As MP for the Vale of Clwyd, I have been made aware repeatedly of problems associated with the Rhyl Cut and Prestatyn Gutter, and the resulting impact on constituents. Both the Cut and Gutter are watercourses, and each is designated as a statutory ‘main river’. Often, sections are almost completely overgrown with vegetation, and issues include fly-tipping, litter, and stagnant water – with associated smells, flies and vermin. I am saddened to see the environmental and associated wildlife distress arising from these problems.\nIn February 2021, I created a petition relating to the ongoing maintenance arrangements for the Cut and Gutter, to demonstrate the level of concern among residents. This petition was signed by over 600 people. I presented the petition to the House of Commons in July 2021, to encourage key decision makers to act and commit to a more regular maintenance schedule for the entire lengths of the Cut and Gutter. The petition argued that the existing ownership rights should not prevent the creation of an effective system of oversight.\nIn October 2021, Natural Resources Wales (NRW) sent me a Briefing Note. NRW had completed three stages of work: it had undertaken flood risk modelling; drafted reports; and produced long-term management and maintenance strategies for the first time. This work carried out by the Flood Risk Management Teams was very welcome, but it largely overlooked concerns over littering and vermin.\nDenbighshire County Council (DCC) Communities Scrutiny Committee have also considered the issues raised by the petition, although we await any action further to this.\nWhilst DCC and its predecessor authorities have fenced off sections of the Cut and Gutter, apparently to prevent access to the watercourses, they state that as they have no ownership rights over the land, they have no responsibility for its maintenance. In terms of the law, it is the case that landowners on either side of the watercourse have this responsibility (‘riparian ownership’). However, there are significant practical as well as health and safety risks which would prevent most residents acting accordingly. This is partly because of the type of litter and waste that can be present. Indeed, it is also one of the reasons given by state agencies for not carrying out such work, even if they did so in the past.\nThus, there is a stalemate which I continue to challenge. Residents in Rhyl and Prestatyn, and visitors, require a permanent solution involving the regeneration of this environment which could also provide a haven for wildlife rather than home for vermin and rubbish.\nIn November 2021, I met representatives from NRW locally. I conveyed to them a list of specific problems which had been raised with me by constituents. While the new maintenance regime was planned for April 2022, this was still not expected to address all the environmental and amenity concerns.\nIn January 2022, following on from my meeting and contact with NRW, they sent me a summary of Maintenance Activities. They had identified rural sections of the Cut and Gutter where some vegetation (cutting) activity could be reduced (to every five years) while other areas would benefit from more frequent (twice annual) attention. Most sections were to remain with a cut once a year. NRW has produced a maintenance summary document which can be accessed below\nIn subsequent correspondence, NRW have stated they are progressing with work to identify areas along the Cut and Gutter where access improvements may be made to facilitate machine access. Relevant private landowners have consented to their proposals. They have also established contact within DCC for the local authority owned sections and have been discussing similar options with them. This should help improve ease of maintenance, while physical measures are also being looked at to make fly-tipping more difficult.\nI have engaged with the Chief Executive of DCC on this matter and hope the work that NRW has already agreed to undertake moves the situation in the right direction. I will continue to highlight the problems with maintenance of the Cut and Gutter generally, in addition to as and when constituents contact me.\nFrom September to November, NRW undertake its annual maintenance to sections of the Cut and Gutter. This consists of weed cutting to the watercourses and maintaining flood risk structures (including trash screens, flapped outfalls, and embankments) and the removal of blockages which have the potential to cause flooding, including trees.\nIn summary, NRW has adopted new maintenance plans but these are not sufficient to deal with all the concerns of residents whose properties are located near to the Cut and Gutter. The issues go beyond flood risk.\nI have a meeting scheduled with NRW, DCC and Keep Wales Tidy, with a specific focus on the Cut and Gutter in the hope of further improvements.\nIn the meantime, I welcome any contact from constituents in connection with concerns about the environment of the Cut and Gutter.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_campaigning-permanent-police-base-prestatyn/content_27.html": "24th January 2024: NEW TOWN CENTRE POLICE STATION TO COME TO PRESTATYN!\nPrestatyn Town Centre has thrived in recent years and is much busier than it once was. Although crime in the town is relatively low, antisocial behaviour does exist, and success sadly also brings with it a level of criminal activity. It is only right therefore that residents and visitors see the town policed appropriately.\nI regularly meet senior officers from North Wales Police. I have asked them on many occasions to increase the visibility and accessibility of police services in Prestatyn, through the re-establishment of a permanent police base in the town centre. In addition to engagement with the police on this matter, I have held a number of discussions with officers from Denbighshire County Council on potential sites and the benefits to the authority’s Community Safety objectives.\nI raised the issue in the House of Commons as a question to the Minister of State for Crime and Policing in June 2022. Next, I conducted a survey of residents and received an overwhelming response in support of this campaign.\nI then wrote to the Chief Constable, Amanda Blakeman, to request a meeting of key decision makers. This meeting took place in November 2023 and was positive, resulting in \"in principle\" support for a police base in Prestatyn. Work between North Wales Police and Denbighshire County Council officers then took place further to this and the police announced on 24th January 2024 the very welcome news that a new police station would be coming to the town.\nUntil 2012, Prestatyn had its own police station on Victoria Road. Following the station closure, a police base operated successfully within Denbighshire County Council offices on Nant Hall Road, until their closure in 2018. Local police officers currently operate from Rhuddlan Police Station. The police also have a small working space in the Fire Station on Marine Road, Prestatyn which I have been reassured local police officers are encouraged to use, but this can never realistically meet the town’s requirements.\nNowadays, there are several ways to report crime to the police. I monitor the statistics closely and am concerned about incidents particularly in and around the town centre. However, all too often there is a sense amongst constituents that the police are there to react to criminal behaviour rather than keep the peace and prevent crime. In my view, neighbourhood crime, and anti-social behaviour in town centres, is best tackled with the visibility and responsiveness that a police station can provide.\nI know North Wales Police has a vision to make North Wales the safest place in the United Kingdom. Police officers from the Denbighshire coastal area are as keen as me to see this vision achieved in this part of the Vale of Clwyd. I believe a permanent police base will provide residents and businesses in the town with peace of mind, make all feel safer and reduce crime.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_news_welsh-government-urged-prioritise-north-denbighshire-community-hospital-development/content_21.html": "Vale of Clwyd MP Dr James Davies has written to the Welsh Health Minister criticising the eight year lack of progress on the development of the North Denbighshire Community Hospital and calling for the Welsh Government to “reach a positive decision on the Full Business Case as a matter of urgency”.\nJames has supported the exciting plans for the new hospital on the site of the Royal Alexandra Hospital in Rhyl since they were first mooted and in recent years has consistently applied pressure to move the development forward.\nHe is therefore frustrated by the lack of progress and in a letter to the Welsh Health Minister, Eluned Morgan MS, says it is “unacceptable” and that patients “deserve better”.\nJames last received an update from the Health Minister on January 25th, but having not heard anything for the past four months, and in light of last week’s HIW report into the Emergency Department at Ysbyty Glan Clwyd which highlighted a catalogue of failings, has contacted her again in a bid to progress the development.\nHis letter states:\n“As you will be aware, discussions relating to the transformation of this site have been ongoing since 2014. Whilst I acknowledge that the scope of the project has since expanded, I feel that eight years without any significant progress is unacceptable. Given that four months have elapsed since your response, I regret that I feel obliged to further prompt the matter. The publication of the recent HIW report into the Emergency Department at Ysbyty Glan Clwyd provides the latest in a long run of evidence of the dire situation my constituents are often faced with when attempting to access unplanned health care.\n“The development of the Royal Alexandra site would provide a much-needed minor injuries unit, alleviating some pressure on A&E at the district general hospital and improving the quality and safety of local healthcare services. My constituents deserve better and I would be grateful if Welsh Government could prioritise this development and reach a positive decision on the Full Business Case as a matter of urgency.”\nServices at the new hospital will include community beds, a same-day minor injuries and illness service, a treatment zone, and outpatient therapy and IV therapy services.\nSexual health, community dental, radiology, adult psychology, older people’s mental health, and child and adolescent mental Health services will also be provided from the site.\nFurther, the development will incorporate infrastructure improvements, including multi-disciplinary working spaces and car parking enhancements.\nJames added:\n“This project has been desperately needed for a long time and residents were excited to hear of the plans when they were first announced. However, they are now losing faith that these will ever come to fruition. Last week’s HIW report and the latest figures on Emergency Department waiting times in Wales, which showed Ysbyty Glan Clwyd is the worst performing hospital with 2 in 3 patients waiting over four hours to be seen, have further demonstrated why the Welsh Government needs to stop dragging its heels over this and instead deliver the service the people of north Denbighshire desperately need.”",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_map-locations/content_33.html": "Skip to main content\nDr James Davies\nFormer MP for Vale of Clwyd\nMain navigation\nAbout James Davies\nMy Priorities\nNews\nCampaigns\nClwyd East\nCommunity Updates\nPledge your support for James\nVolunteer for Us\nIn Parliament\nContact\nDr James Davies\nFormer MP for Vale of Clwyd\nMy map",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_contact/content_10.html": "Skip to main content\nDr James Davies\nFormer MP for Vale of Clwyd\nMain navigation\nAbout James Davies\nMy Priorities\nNews\nCampaigns\nClwyd East\nCommunity Updates\nPledge your support for James\nVolunteer for Us\nIn Parliament\nContact\nDr James Davies\nFormer MP for Vale of Clwyd\nContact\nLeave this field blank\n[email protected]\nClwyd East Campaign Contact\n07761618272\nJames on Facebook\nJames on X\nJames on Instagram\nJames on LinkedIn\nJames on YouTube\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_jamesdavies_org_uk_/https_www_jamesdavies_org_uk_campaigns_eisteddfod-yr-urdd-denbighshire-2022/content_31.html": "Vale of Clwyd’s Dr James Davies MP joined the opening day festivities of the Eisteddfod yr Urdd Denbighshire 2022 at Kilford Farm in Denbigh. The week-long festival was the first and largest national cultural event held for the young people of Wales since the Covid-19 pandemic.\n2022 marked the event’s 100th year anniversary and thousands of competitors from across Wales had the opportunity to perform on stage in one of the three pavilions.\nCommenting, James said:\n\"After two years of disruption to this esteemed national cultural event, it was great to welcome Eisteddfod yr Urdd to the Vale of Clwyd and to see it so well attended, with almost 120,000 visiting over the week.\n\"Urdd officials were delighted with the event which saw merit in all the major competitions and the ceremonies held on an outdoor stage were well received and well attended.\n\"Over the course of the week nearly 500 competitions were held for children and young people up to the age of 25, including singing, poetry, dancing, art and much more, with many local school pupils taking to the stage. A huge well done to everyone who competed.\""
}