{
  "https_seanwoodcock_uk_/https_seanwoodcock_uk_campaign-gallery/content_5.html": "Skip to content\nMy Story\nMy Priorities\nCost of Living\nHousing\nClimate Change\nNHS & Social Care\nBrexit\nIn Parliament\nCampaign Gallery\nPrivacy Policy\nGet in touch\nCampaign Gallery\nThe Experienced, Local Voice that Our Area Deserves\nFor Banbury, Chipping Norton and North Oxfordshire Villages\nStanding in solidarity with JDE coffee factory workers against plans to introduce Fire & Rehire, alongside fellow Labour councillors\nWith North Oxfordshire Villages’ stalwart Anne Cullen in Cropredy\nProud Chair of Oxfordshire Co-operative Party\nAt a constituency fundraiser with Sir Keir Starmer\nKnocking on doors in my ward\nWith my good friend and co-councillor, Lynne Parsons in Shutford\nCampaigning with Andrew Gwynne MP against cuts to local government\nAttending Remembrance Sunday with other Labour councillors\nCanvassing with Chipping Norton Councillor and former Labour Police & Crime Commissioner candidate Laetisia Carter\nSpeaking on the issue of land-banking at Co-operative Party conference\nOn BBC Oxford news\nCelebrating Perran Moon’s local election win in 2019\nDiscussing health & housing with Wes Streeting MP\nAt the duck pond in Wroxton, the village where I went to primary school\nOn site at the emerging Castle Quay 2 Development\nCaring about our environment and our rural communities is deeply personal for me\nSpeaking at Labour Party Conference 2023, in Liverpool\nOut in Uxbridge and South Ruislip for the by-election, Summer 2023\nOn the campaign trail with Anneliese Dodds MP\nWith my good friend, deputy group leader and Cherwell District Councillor Amanda Watkins with her husband, local musician Peter Watkins and Ziggy, in Hook Norton\nOut in Mid Bedfordshire for the by-election, October 2023",
  "https_seanwoodcock_uk_/https_seanwoodcock_uk_my-story/content_6.html": "Sean Woodcock\nI’m a local councillor and Leader of the District Council Labour group who is Banbury born and bred.\nFor years, I’ve knocked on thousands of doors across Banbury. The message from people is clear; we need a Labour government to build a better Banbury.\nA bit more about me\nI was born at the Horton Hospital, the eldest of five, and went to Wroxton and then the Warriner schools. My Mum is a carer while my Dad has run a local business for 40 years. After attending university in Reading and then Birmingham, I got a job working in housing and regeneration in Oxford.\nI joined the Labour Party in 2007 and I am still proud of a government that tried to protect ordinary people from the impact of a financial crisis caused by bankers.\nSince that government left office in 2010, I’ve witnessed everything get worse; from people’s standards of living, to public services and Brexit. Particularly as a councillor, the impact of cuts in local government finance have left our roads covered in potholes, support services stretched to breaking point and a lack of infrastructure to support new development.\nDespite the challenges, as District Council Labour group Leader I’ve fought to make life better for residents in Cherwell despite the council being controlled by the Conservatives.\nOur council was the first Tory-led one to adopt the Co-operative Party motion on Modern Slavery in 2018 when I proposed it. We got a Climate Emergency Motion passed in 2019. And we provided the ideas which Cherwell adopted for tackling the cost of living crisis in 2022.\nHaving knocked on thousands of doors in Banbury and beyond, I know that Labour can win; but only by talking to as many voters as possible. Nothing beats getting out on the doorstep and that’s where you will find me as candidate.\nAnd with over a decade of experience in the Oxfordshire housing sector, I know that to win we need to provide answers to the housing crisis. As Labour candidate, I would push for the next Labour government to build more homes, at genuinely affordable rates and to provide a welfare system that supports people instead of punishing them.\nWhen I’m not canvassing, I can be found jogging round my ward, spending time with my nieces and nephews or watching sport like football and rugby including Banbury United and Banbury Bulls.\nBanbury deserves a Labour MP and as a local lad, nothing would make me prouder than to have that chance to serve.",
  "https_seanwoodcock_uk_/https_seanwoodcock_uk/content_1.html": "I'm Sean Woodcock, Banbury born and bred, and a seasoned campaigner. Throughout the year, I’ve knocked on thousands of doors and met hundreds of residents. They are fed up of Victoria Prentis and want a Labour MP who truly represents their community. Let's beat the Conservatives together.",
  "https_seanwoodcock_uk_/https_seanwoodcock_uk_in-parliament/content_2.html": "Skip to content\nMy Story\nMy Priorities\nCost of Living\nHousing\nClimate Change\nNHS & Social Care\nBrexit\nIn Parliament\nCampaign Gallery\nPrivacy Policy\nGet in touch\nIn Parliament",
  "https_seanwoodcock_uk_/https_seanwoodcock_uk_contact/content_4.html": "Skip to content\nMy Story\nMy Priorities\nCost of Living\nHousing\nClimate Change\nNHS & Social Care\nBrexit\nIn Parliament\nCampaign Gallery\nPrivacy Policy\nGet in touch\nContact\nI want to hear from you!\nGet in touch\nParliamentary and general queries\nsean.woodcock.mp@parliament.uk\nConstituent concerns and casework queries\nsean.woodcock.casework@parliament.uk\nTwitter\n@seanlwoodcock\nFacebook\n/SeanLWoodcock",
  "https_seanwoodcock_uk_/https_seanwoodcock_uk_privacy-policy/content_7.html": "- Who we are\nOur website address is: https://seanwoodcock.uk\nThis page explains how we collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data. This is separate to how the national Labour Party uses your personal data and you should refer to their privacy policy for further information about this: www.labour.org.uk/privacy-policy\nThe Office of Sean Woodcock is the data controller as defined under the General Data Protection Regulation (“GDPR”) and responsible for your personal data (referred to as “we”, “us” or “our” in this privacy policy).\n- Our contact details\nName: Office of Sean Woodcock Member of Parliament for Banbury\nAddress: House of Commons, London, SW1A 0AA\nPhone Number: To be confirmed\nE-mail: sean.woodcock.mp@parliament.uk\n- Purpose of this Privacy Policy\nThis privacy policy aims to give you information on how we collect and process your personal data through:\nyour use of this website (including, but not limited to, any data you may provide through this website by, for example, signing up as a to receive communications on Anneliese Dodds parliamentary activities and constituency updates.\nengaging with us on third party websites and platforms.\nCasework.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n- The type of personal information we collect\nThe office of Sean Woodcock MP will only collect and use personal information for the specific purpose for which it has been obtained.\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data), or data related to deceased individuals.\nWhen submitting sign up forms on this website, you may be asked for personal information. In each case, we will ask for your consent to use your information, and we will only use it for the purposes for which you provide it.\nWe currently collect and process the following information:\nCookies and pixels on this website\nInformation sent to us to fulfil casework and policy requests.\n- How we obtained your personal information and why we hold it\nMost of the personal information we process is provided to us directly by you for one of the following reasons:\nProvided by you – directly\nBecause you have contacted our office with a casework or policy enquiry, or other issue.\nProvided by you – indirectly\nYour name and address is legally taken from the electoral register, in order for us to participate in the democratic process;\nAs you interact with our website, we will automatically collect technical data about your equipment, browsing actions and patterns – where this is strictly necessary to enable the delivery of the website to you, then these cookies will be downloaded automatically. We collect this personal data by using cookies and other similar technologies. We may also receive technical data about you if you visit other websites employing our cookies. Please see our cookie notice further down in this Privacy Policy for further information. You will have the option of declining cookies which are not strictly necessary for the delivery of the website if you do not wish to provide this kind of data to us.\n- Donating to the Party\nThe information we ask for is used to process your donation and, if you donate more than £500, to check that you are on the electoral register which is a legal requirement under the Political Parties, Elections and Referendums Act 2000. If you donate more than £1,500 to a Labour Party accounting unit (eg. Constituency Labour Party or the Scottish Labour Party) or more than £7,500 to the Labour Party nationally in the course of a calendar year, your name and the amount of your donation will be reported to the Electoral Commission for publication on their public register of donations to the Labour Party. Donation information will be stored in our membership database and used to keep you informed of Labour news, campaign and other opportunities to support the Party.\n- Legal basis to process personal data\nUnder the General Data Protection Regulation (GDPR), the lawful bases we rely on for processing this information are:\n- Your consent. You are able to remove your consent at any time. You can do this by contacting sean.woodcock.mp@parliament.uk\n- Legal entitlement. MPs have a legal entitlement to your name and address from the electoral register, even where you have asked not to be contacted.\n- Public task. This may be used where we process personal data in the public interest (which has a clear basis in law).\n- Legitimate interests. We may contact you by post using this lawful basis, but we always ensure we balance your rights and freedoms against our proposed legitimate interest.\n- If you are a member of the Labour Party, we may rely on this lawful basis to contact you, where it is defined within the Party’s Rule Book.\n- How we store and retain your personal information\nYour information is securely stored at the Office of Sean Woodcock MP, House of Commons, London, SW1A 0AA, or securely stored in our parliamentary email and casework management system.\nWe will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. We will delete all other personal data we no longer need in line with our internal retention policies.\nWe will regularly review the personal information we hold to ensure that its use is necessary and proportionate.\nWe will then securely and permanently dispose of your information by shredding your file (if paper) or deleting your case and associated files from our case system and computer system.\n- Cookies and Analytics\n9.1 What are cookies?\nCookies are small text files that web servers give to browsers to store on users’ machines (computers, tablets or mobile devices). They enable the website to recognise requests as coming from the same browser. Cookies are designed to allow the website to recognise its users on subsequent visits, or to authorise other designated websites to recognise these users for a particular purpose. Cookies can be essential for the operation of an application or to improve the user experience. They can also be used to track user behaviour.\nInformation collected by cookies is classed as personal data.\nFor more information on cookies, their use and how to block them, you may want to visit www.aboutcookies.org.\n9.2 Managing cookies\nYou can set your browser to not accept cookies, but this may limit your ability to use the Services. You can also opt out of receiving interest-based ads from certain ad networks here (or if located in the European Union, here).\nIn your web browser (for example, Google Chrome, Microsoft Internet Explorer, Mozilla Firefox or Apple Safari), you can control which types of cookies you allow. Most browsers accept cookies automatically, but you can alter the settings of your browser to erase cookies or prevent automatic acceptance if you prefer. You can turn cookies on or off using your browser’s settings and you can also delete cookies and clear your browser’s cache (also known as your internet viewing history). Visit the ‘Options’ or ‘Preferences’ menu on your browser to change settings, and check the following links for more browser-specific information:\nGoogle Chrome: https://support.google.com/chrome/answer/95647?hl=en\nMicrosoft Internet Explorer: https://support.microsoft.com/en-us/help/17442/windows-internet-explorer-delete-manage-cookies\nMozilla Firefox: https://support.mozilla.org/en-US/kb/cookies-information-websites-store-on-your-computer?redirectlocale=en-US&redirectslug=Cookies\nApple Safari: https://support.apple.com/en-gb/guide/safari/sfri11471/mac\nThe Information Commissioner has also provided guidance here: https://ico.org.uk/your-data-matters/online/cookies/\n- Third Party Links\nThis website may contain links to other websites, or embedded content from other websites. We are not responsible for the content or privacy practices of these websites.\nThis website may include links to third party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n- Information rights\nUnder data protection laws, you have rights including:\nYour right of access – You have the right to ask us for copies of your personal information.\nYour right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure – You have the right to ask us to erase your personal information in certain circumstances\nYour right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights, though we may apply a basic administration fee where your information right is determined as being either “manifestly unfounded” or “manifestly excessive”. If you make a request, we have one month to respond to you, though an additional two months may be applied subject to the application of an exemption available to data controllers.\nPlease contact us at:\nSean Woodcock MP\nHouse of Commons\nLondon\nSW1A 0AA\n- How to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at:\nSean Woodcock MP\nHouse of Commons\nLondon\nSW1A 0AA\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk\nChanges to the Privacy Policy\nWe keep our privacy policy under regular review (at least on an annual basis) and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website and we encourage you to regularly check back for any updates about how your data is used.",
  "https_seanwoodcock_uk_/https_seanwoodcock_uk_priorities/content_3.html": "Tackling The Cost of Living Crisis\nThere is currently no bigger issue than the fact that hundreds of families in our constituency are choosing between heating and eating. Tackling this issue is the most pressing challenge facing us after 13 years of Conservative government.\nHaving knocked on thousands of doors across the area, this huge worry is the one that keeps local people up at night.\nPreventing folk from starving and freezing is the greatest immediate challenge we face from 13 years of Conservative failure.\nLiving standards have steadily decreased over the years of Conservative rule. But the jumps in inflation caused by the Conservative’s reckless handling of the economy means that this has become an urgent crisis. As a councillor for one of the most deprived wards in the country, I was given daily reminders of this in my casework.\nAs Labour group leader, I pushed the Conservatives running Cherwell to start taking urgent action as early as Summer 2022; ahead of people turning on their heating in the Winter. Labour in Cherwell forced the Conservatives to agree to a food emergency motion, with warm welcome venues set up and food vouchers sent out to the most in need.\nWe’ve had enough of words from our MP. With a track record of delivery, I promise action as your Member of Parliament.\nFixing Our Broken Housing Market\nThe importance of having a place to call ‘home’ cannot be over-estimated. Having stable accommodation improves health and wellbeing, is good for the local economy and the educational outcomes of our children.\nBut the single biggest strain on people’s finances in this cost-of-living crisis is paying for the roof over their heads. We’ve become used to seeing houses built across our area. Yet rents keep going up while the housing waiting list gets longer.\nThere is no way around fixing the housing crisis without building more homes. The Conservatives have abandoned housebuilding and so it falls on the next Labour government to deliver.\nBut homes need to be genuinely affordable and they need to be supported by proper investment in infrastructure and local services.\nLocally, as Labour group leader on Cherwell, I have pushed for more affordable housing in the Local Plan, to match Oxford’s 50% on new build sites.\nAnd we delivered a Tenants’ Charter for Cherwell, to improve standards across the area, in spite of opposition from the local Conservatives. Because renters need protection from landlords who go missing when repairs need doing, but do not when it comes to increasing the rents.\nThe next Labour government must redress the balance to protect tenants.\nTackling Climate Change\nThe Climate Emergency is the biggest crisis facing humanity. Tackling it is not only essential but also an opportunity for us to reshape our economy for the 21st Century.\nWe are uniquely positioned, with our links to the automotive industry and proximity to universities in Oxford, to take a global-leading role in this industry.\nLocally as leader of Cherwell Labour, I have helped drive the agenda to get change through locally. This includes bans on the council’s use of single-use plastics in its operations, the phasing in of peat-free compost and the 2019 declaration of a Climate Emergency.\nWe’re being held back by the sticking plaster politics of the Conservatives, who are too scared of being labelled ‘woke’ to take the urgent action we need.\nProtecting and enhancing NHS and social care\nUnfortunately 24 hours in A&E is no longer just a TV programme; it’s the reality of the NHS under the Conservatives.\nThe Horton Hospital, where I was born, has ambulances queuing outside it while people sit in the corridors waiting for beds. This is not the fault of the brilliant NHS staff who we applauded during COVID. It’s down to the Conservatives.\nMeanwhile our social care system is under-resourced and under-valued, with carers like my Mum feeling under increasing pressure to do more, in less time and for worsening pay and conditions.\nWhen I was a young child, I had a serious heart condition that required emergency surgery. Without the NHS, I would likely not be here. It is, rightly, the Labour Party's proudest achievement.\nThat's why I've always fought for it.\nLocally, I’ve campaigned to protect our NHS for nearly a decade and served on the Horton Health and Overview Scrutiny Committee that condemned the permanent downgrade of the Horton Hospital’s maternity unit.\nWe need a new health and social care system that ensures the right care is delivered, at the right time to the right people.\nAs your Labour MP, I will always put our NHS first.\nBeing honest about Brexit\nI joined the Labour Party as a passionate and proud European. I campaigned for Remain and supported a second referendum. I make no apologies for either.\nBut those votes were lost and, as painful as it is, rehashing old arguments about in or out gets us nowhere.\nThat doesn’t mean that we accept the status quo. It is obvious now that the Conservatives' Brexit deal is not working. Queues at Dover every Bank Holiday and Half Term are a visible symbol of the mess we are in. Businesses across our area are battling increased regulation and costs when trying to trade with our closest neighbours.\nThis is bad for business and it’s bad for Britain.\nAs your MP, I’ll push for a closer relationship with our European friends and allies, that does away with the damage done by the Conservatives."
}