{
  "https_jessphillips_net_/https_jessphillips_net_node_28/content_10.html": "The Rwanda Bill is a colossal waste of taxpayers' money and Parliament’s time, both of which could have been spent on addressing the actual problems facing this country.\nThose who supported it should be ashamed of how they’ve let down their constituents for the sake of headline chasing and political posturing.",
  "https_jessphillips_net_/https_jessphillips_net_node_37/content_9.html": "Jess Phillips MP has been appointed as Under-Secretary of State in the Home Office, minister responsible for Safeguarding and Violence against Women and Girls.",
  "https_jessphillips_net_/https_jessphillips_net/content_1.html": "Skip to main content\nToggle navigation\nMain navigation\nHome\nContact\nNews\nHome\nJess Phillips - Labour MP for Birmingham Yardley\nAction against spiking\nNeighbourhood policing\nDA specialists to be embedded in 999 control rooms\nMORE NEWS\nAction against spiking\nNeighbourhood policing\nDA specialists to be embedded in 999 control rooms\nMORE NEWS",
  "https_jessphillips_net_/https_jessphillips_net_news/content_7.html": "Skip to main content\nToggle navigation\nMain navigation\nHome\nContact\nNews\nNews\nAction against spiking\nNeighbourhood policing\nDA specialists to be embedded in 999 control rooms\nBCFC activities in Acocks Green\nTackling Commercial Sexual Exploitation\nJess appointed Minister for Safeguarding\nOpposing the early release of violent criminals\nUK response to Israeli military action in Rafah\nMeeting at the United Nations\nInfected Blood Inquiry petition\nCriminal Justice Bill committee\nRwanda Bill: wasting taxpayers money\nPagination\nNext page\n››",
  "https_jessphillips_net_/https_jessphillips_net_node_34/content_15.html": "The Prime Minister and the minister responsible for policing have both said that violent criminals would not be part of any early release scheme. So why is my inbox full of emails from victims of rape and abuse, sending me cases where perpetrators of multiple awful crimes are being released early from prison?",
  "https_jessphillips_net_/https_jessphillips_net_node_33/content_12.html": "With an active military incursion into Rafah and no credible plan for civilian evacuation, Israel is in breach of Britain’s red lines. What is the Government going to do about it?",
  "https_jessphillips_net_/https_jessphillips_net_node_31/content_16.html": "In April 2023 Sir Brian Langstaff gave his final recommendations on compensation for victims of the infected blood scandal, yet there was no mention of compensation in the Spring Budget almost a year later.\nPlease sign my petition online here, which I will be presenting in Parliament.",
  "https_jessphillips_net_/https_jessphillips_net_node_35/content_14.html": "For the next two weeks BCFC will be running sports activities for 8 to 14 year olds in Stockfield Park, Acocks Green.\nIt's free to attend and you can signup on arrival so a great opportunity for local kids!\nBCFC Summer Activities Programme\nWhere: Stockfield Park, B27 6TR\n(on Cedars Avenue)\nWhen: Monday - Friday, 3pm-7pm\n12th - 16th August\n19th - 23rd August\nCost: Free to attend for all children aged 8-14, sign up on the day.\nActivities:\nFootball, Cricket, Dodgeball\nSnacks and water provided for participating children\nFor further information please contact steven.davies@bcfc.com",
  "https_jessphillips_net_/https_jessphillips_net_node_32/content_11.html": "It was my privilege to have the opportunity to raise the plight of Palestinians at the United Nations. I met with Palestinian officials and was focused on gathering information on the war’s effect specifically of women and children in Gaza.\nUnlike most conflicts women and children have made up 70% of the casualties. I've made links with women's rights groups on the ground and will be working with them going forward. Also pushed our UK diplomats on issue of the Israeli attacks on British aid agencies and that raising such attacks with Israel was not enough.",
  "https_jessphillips_net_/https_jessphillips_net_privacy/content_4.html": "PRIVACY POLICY\nWho We Are\nThis Privacy Policy relates to information about you (“personal data”) which is obtained by Jess Phillips Campaigns.\nIf you have registered to support the Jess Phillips campaign, your data will only be held by Jess Phillips Campaigns.\nJess Phillips Campaigns’ registered address is 62 Yardley Road, Acocks Green, Birmingham, B27 6LG.\nOur Data Protection Officer is contactable at privacy@jessphillips.net .\nThe privacy statement for Jess Phillips Member of Parliament can be found here https://www.jessphillips.net/privacy-mpoffice\nJess Phillips Campaigns’ Purpose\nJess Phillips Campaigns’ purpose and overall mission is to promote and support campaigns and candidates.\nWe take active steps to make sure that our supporters are aware of the ways in which they can help us achieve our overall purpose.\nWhat personal data might Jess Phillips Campaigns collect about you?\nWe may collect the following types of personal data: your name, email address, postal address, telephone or mobile number, bank account details to allow our payment processors to process donations, details about payments to and from you and other details of products and services you have purchased from us, and details of any political opinions that you express to us or volunteering you may wish to undertake.\nSpecial Categories of Personal Data\nWe do not collect \"special categories of personal data\" about our supporters (this includes details about your race or ethnicity, religious or philosophical beliefs, sex life, sexual orientation, trade union membership, information about your health and genetic and biometric data), unless we have your express consent. Clear notices will be provided on application forms for such events so that it is clear what information we need and why we need it. By virtue of what we do, we collect details of your political opinions, either generically or specifically, which we are entitled to do as a not-for-profit body with a political aim, where that data is processed only in relation to supporters in connection with our purposes and not disclosed without your consent.\nAll special categories of personal data are stored on a secure database, to which only a limited number of relevant staff have access. It is deleted when no longer relevant, is (save as stated below) never shared with third parties, and, if at the date of your request, we still hold it, is available to you at any point should you wish to see it.\nIn order to promote the Jess Phillips Campaign, we may, where it is lawful to do so, share your data with other organisations and bodies that share the aims, values and principles of Jess Phillips, and which support the aims of the Jess Phillips Campaign.\nWhy does Jess Phillips Campaigns use your personal data?\nWe may process your personal data for a number of reasons, and Jess Phillips Campaigns will only use your personal data where it has an appropriate legal basis, such as: (1) where the processing is in our own legitimate interest; (2) it is in compliance with a legal obligation; (3) it is necessary to perform a contract between us and you; and/or (4) you have consented to our use of your personal data.\n1) Legitimate interest:\nWe may rely on our own legitimate interest to process your personal data for the following reasons:\n• To keep a record of donations made and actions taken by our supporters and our communications with them.\n• To support volunteers at their events.\n• To record campaigning actions by supporters.\n• Service administration, such as administering any donations you have made, to confirm receipt of donations (unless you have asked us not to do that), and to say thank you and provide details of how your donations might be used.\n• In relation to correspondence you have entered into with us whether by letter, email, text, social media, message board or any other means, and to contact you about any content you provide.\n• For internal record keeping, so as to keep a record of your relationship with us.\n• To use IP addresses to identify the location of users, to block disruptive use and to establish the number of visits from different countries.\n• For market research.\n• To analyse and improve the activities and content offered by Jess Phillips Campaigns website to provide you with the most user-friendly navigation experience. We may also use and disclose information in aggregate (so that no individuals are identified) for marketing and strategic development purposes.\n• For the dissemination of relevant information to journalists.\n2) Legal obligation:\nWe may also need to comply with legal requests where disclosure is required or permitted by law. For example, to government bodies for tax purposes or law enforcement agencies for the prevention and detection of crime, subject to such bodies providing us with a relevant request in writing.\n3) Contract:\nWe may process your personal data where it is necessary for the performance of a contract with you, such as for completion of transactions you have entered into with Jess Phillips Campaigns or the activity or online content you have signed up for.\nWhere we need to collect personal data by law, or under the terms of a contract we have with you, and you fail to provide that data when requested, we may not be able to perform the contract we have or are trying to enter into with you (for example, where you make online purchases or donations). In this case, we may have to cancel a product or service you have with us but we will notify you if this is the case at the time.\n4) Consent:\nWe will only process your personal data for the following reasons with your consent:\n• To send you marketing information about our projects, fundraising activities and appeals.\n• To invite you to participate in surveys or research about Jess Phillips Campaigns or our work.\nYou may withdraw your consent at any time. Please see the “What are your rights?” section of this privacy policy below for instructions on how to withdraw consent.\nWhen you opt out of receiving updates.\nIf you provide us with data, through the website or otherwise, and opt out of subscribing to updates, your data will only be used to contact you directly by the office team to discuss the reasons for opting out. Your data will not be used for any other purpose.\nData processed outside of the UK\nYour data is only processed outside the UK where Jess Phillips Campaigns has verified that appropriate standards and safeguards are in place.\nWhen and why we will send you personalised marketing communications\nJess Phillips Campaigns will only contact you for marketing purposes, for example to keep you up to date with our work and our campaigns, or let you know of ways in which you can support that work, where we have your consent or we are otherwise allowed to do so.\nWe will make it easy for you to tell us if you would like to receive marketing communications from us and hear more about our work and the ways in which you would like to receive this information. You can withdraw your consent at any time, and we will not send you marketing material if you tell us that you do not wish to receive it.\nHow and when we collect personal data about you\nJess Phillips Campaigns may collect your personal data in the following circumstances:\nWhen you give it to us DIRECTLY:\nYou may give us your personal data directly when you sign up as a supporter, make a donation, sign up for one of our events or when you communicate with us.\nWhen you give it to us INDIRECTLY:\nYou may give us your personal data indirectly when you sign up at events such as community meetings or street stalls, or via a sponsored petition campaign on a third-party website. These independent third parties will pass your data to Jess Phillips Campaigns where you have indicated that you wish to support Jess Phillips Campaigns and have given your consent to Jess Phillips Campaigns processing your personal data or it is a necessary part of completing a contract with you.\nWhen you access Jess Phillips Campaigns’ Social Media:\nWe might also obtain your personal data through your use of social media such as Facebook, WhatsApp, Twitter or LinkedIn among others, depending on your settings or the privacy policies of these social media and messaging services. To change your settings on these services, please refer to their privacy notices, which will tell you how to do this.\nWill Jess Phillips Campaigns share your personal data with anyone else?\nWe will only use your personal data within Jess Phillips Campaigns for the purposes for which it was obtained. Jess Phillips Campaigns will not, without your consent, share or sell your personal data with any third party for their own marketing purposes, and you will not receive marketing from any other companies, charities or other organisations as a result of giving your details to us.\nJess Phillips Campaigns’ Suppliers\nWe may need to share your personal data with service providers who help us to deliver our projects, fundraising activities and appeals, for instance through handling responses to our emergency appeals. These \"data processors\" will only act under our instruction and are subject to pre-contract scrutiny and contractual obligations containing data protection clauses that protect your personal data. We do not allow these organisations to use your data for their own purposes or disclose it to other third parties without our consent and we will take all reasonable care to ensure that they keep your data secure.\nFacebook and other Social Media Sites\nWe may also use your email address and phone number to match to your account on Facebook or other social media sites in order to show you Jess Phillips Campaigns content while using these services. We only do this where you have opted in to marketing emails or phone calls and we keep your data secure by encrypting it. No data we hold about you is retained by the third party.\nIn addition, we may also use your email address and phone number to link to Facebook or other social media sites in order to identify other users of these sites whom we believe would be interested in Jess Phillips Campaigns, and we may then show them Jess Phillips Campaigns content. No data we hold about you is retained by the third party.\nTo prevent this use of your data you can contact us directly and state that you do not wish to be contacted in this way.\nWe also use Facebook pixels on this site. A Facebook pixel allows us to follow the actions of users after they are redirected to our website by clicking on a Facebook advertisement. The collected data remains anonymous. No personal data is collected by Jess Phillips Campaigns as a result of using these pixels.\nTo change you Facebook pixel preferences please click here https://www.facebook.com/ads/website_custom_audiences\nUpdating your preferences with Jess Phillips Campaigns will not guarantee that you never see Jess Phillips Campaigns content on social media, since the social media site may select you based on other criteria and without your data having been provided to or by Jess Phillips Campaigns.\nInformation about cookies\nOur cookie declaration is found https://jessphillips.net/cookie-declaration\nHow long will Jess Phillips Campaigns keep your personal data?\nWe will hold your personal data on our systems for as long as is necessary for the purposes described above, and in accordance with applicable laws for no longer than 7 years from the end of the year in which the data was last used..\nWhere you contribute material to us, e.g. user generated content or in response to a particular campaign, we will only keep your content for as long as is reasonably required for the purpose(s) for which it was submitted unless otherwise stated at the point of generation.\nWhat are your rights?\nWhere Jess Phillips Campaigns relies on your consent to process your personal data, you can withdraw this consent at any time. If you wish to withdraw your consent please contact us via our email or address provided below.\nYou are entitled, in accordance with applicable law, to object to or request restriction of processing of your personal data, and to request access to, rectification, erasure and portability of your own personal data. The accuracy of your information is really important to us. We want to ensure that we are able to communicate with you in ways that you are happy with, and to provide you with information that is of interest. If you are aware of changes or inaccuracies in your personal data you should inform us of such changes so that the personal data may be updated and corrected.\nYou will not have to pay a fee to access your personal data (or to exercise any of the other rights listed above). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive.\nIf you wish to change how we communicate with you, or update the information we hold, then please contact us:\n• email us at privacy@jessphillips.net\n• write to us at: Jess Phillips Campaigns, 62 Yardley Road, Acocks Green, Birmingham, B27 6LG.\nAdditionally, you can opt out of email separately:\n• Email - You can opt out of marketing emails at any time by clicking the unsubscribe link in any marketing email from Jess Phillips Campaigns.\nHow long will it take for these changes to be effective?\nWe endeavour to meet the following service levels where supporters opt-out of receiving marketing information:\n• Email - 24 hours from receipt of email.\n• SMS - 24 hours from receipt of opt out request.\n• Telephone - 24 hours from receipt of request to opt out.\n• Mail - 28 days from receipt of 'do not mail' request. This period is longer than for other channels due to the production times for mailing campaigns, and in most cases, we would expect the change to be effective much more quickly.\nHow Jess Phillips Campaigns keeps your data safe\nWe ensure that there are appropriate technical controls in place to protect your personal details. Where possible, our online forms use industry standard encryption and our network is protected and routinely monitored.\nWe undertake regular reviews of who has access to information that we hold to ensure that your personal data is only accessible by appropriately trained staff, volunteers and contractors.\nWe use external companies to collect or process personal data on our behalf. We do comprehensive checks on these companies before we work with them, and put a contract in place that sets out our expectations and requirements, especially regarding how they manage the personal data they collect on our behalf, or have access to. We have a robust partner monitoring framework to ensure these contractual obligations are met.\nHow to make complaints about this policy or raise privacy concerns\nIf you would like more information, or have any questions about this policy, please contact our team by email at privacy@jessphillips.net or write to us at: Jess Phillips Campaigns, 62 Yardley Road, Acocks Green, Birmingham, B27 6LG.\nTo make a formal complaint about Jess Phillips Campaigns’ approach to data protection or raise privacy concerns directly with our data protection team, please contact:\nData Protection Officer, Jess Phillips Campaigns, 62 Yardley Road, Acocks Green, Birmingham, B27 6LG.\nEmail: privacy@jessphillips.net\nYou also have the right to make a complaint direct to the UK's data protection authority, the Information Commissioner's Office (ICO). The ICO can be contacted at: https://ico.org.uk/global/contact-us/\nConcerns can be also be logged via the ICO website.\nChanges to Jess Phillips Campaigns’ Privacy Policy\nThis Privacy Policy may be updated from time to time so you may wish to check it each time you submit personal data to Jess Phillips Campaigns. The date of the most recent revisions will appear on this page. If you do not agree to these changes, please do not continue to use the Jess Phillips Campaigns website to submit personal data to Jess Phillips Campaigns. If material changes are made to the Privacy Policy we will notify you by placing a prominent notice on the website.\nLast updated 23rd March 2022\nCookie Information",
  "https_jessphillips_net_/https_jessphillips_net_contact/content_6.html": "Contact\nContact Details\nTelephone: 0121 708 2412\nEmail: jess@jessphillips.net\nWrite: House of Commons, London, SW1A 0AA\nOffice Opening\nFollowing the recent security advice for MPs, meetings with the Jess and casework team will be by appointment only. You can get in touch using the contact details to book a convenient time.\nPlease note, due to strict Parliamentary protocol MPs can only take on cases for residents living in their constituency.",
  "https_jessphillips_net_/https_jessphillips_net_node_39/content_5.html": "The Government is committed to restoring neighbourhood policing across the country to restore community confidence and keep our streets safe.Watch below:",
  "https_jessphillips_net_/https_jessphillips_net_node_38/content_3.html": "The government is committed to halving violence against women and girls over the next decade. As part of measures to achieve this aim, domestic abuse specialists will be embedded in 999 control rooms to advise on risk assessments and work with officers on the ground, to ensure that victims get a fast response when needed and are referred to support services as quickly as possible.\nThese specialists will be backed up by dedicated teams to improve how the police respond to these kinds of calls, including using new technology to respond more quickly such as rapid video response.",
  "https_jessphillips_net_/https_jessphillips_net_node_41/content_2.html": "The government is taking action to tackle drink spiking.If somebody purposefully seeks to harm someone else, humiliate them, cause them distress, and even to immobilise them for other crimes, very severe punishments need to be meted out.",
  "https_jessphillips_net_/https_jessphillips_net_node_36/content_13.html": "I was pleased to contribute to the recent Parliamentary debate on Commercial Sexual Exploitation. Please read my contribution below:\n“I am grateful to my hon. Friend the Member for Gower (Tonia Antoniazzi) for securing this debate, which, as she pointed out, is my first as a Home Office Minister—although definitely not my first on this subject, by any stretch of the imagination. From the outset, let me say that it is a privilege to have been asked by the Prime Minister to serve, and to work on some of the issues to which I have devoted much of my life both inside and outside this building.\nWe have an enormous task on our hands. Debates such as this underline why it is so critical that we make real progress in protecting women—and in this instance, men as well, and all people—from harm. We know that sexual exploitation disproportionately affects women and girls. As I said, it affects men as well, although those who are buying sex tend always to come from the same group.\nIt is time that we treat tackling violence against women and girls as the national emergency that it is. New Government policies will be announced in due course, but I want to restate that I believe passionately that change in this area is needed and, until it is achieved, we must not rest. On hearing accounts such as those we have heard tonight from my hon. Friend, I am not sure how we could come to any other conclusion. I will continue to work closely with charities and non-governmental organisations—I have met almost all those mentioned by my hon. Friend—to support services in advancing their efforts to protect survivors and hold perpetrators to account.\nTurning to the specific points of the debate, this Government will use every lever available to stop commercial sexual exploitation, and all kinds of sexual exploitation. We are committed to tackling the harms that it brings. The most vulnerable in our society deserve nothing less. When looking at commercial sexual exploitation, it is undeniable that we have to consider carefully those who are exploited under the guise of completely legitimate prostitution. That is often the argument that comes back, but not one that we should recognise.\nWe are only a couple of weeks into the new Government, so I hope that Members will understand that I am not in a position today to make commitments on specific policies. However, I want to make it clear to my hon. Friend and all Members that they will be coming, and she has my word that I expect change in this space. Currently, the acts of buying and selling sex are not in themselves illegal in England and Wales. However, some activities that can be associated with prostitution are offences, including activities linked to exploitation, which she talked about.\nThe Sexual Offences Act 2003 makes it illegal to pay for the sexual services of a prostitute subjected to force, threats or any other form of coercion or deception. This is a strict liability offence, meaning that it is not a valid defence that the defendant did not know that the person was being exploited or had been subject to force or coercion. As my hon. Friend pointed out, I have very grave concerns about how well this works in practice—I am happy to say from here that it does not. Like so many convictions that we seek for crimes of violence against women and girls, the numbers are woeful.\nWe want to understand the scale of the issue and how best to respond to it. The Home Office is currently providing £1.36 million of funding to Changing Lives—I declare that I was the chair of the Changing Lives adult sexual exploitation partnership, though I am no longer—to address the current gaps in evidence of the levels and types of online abuse and exploitation, to help us better understand the pathways that are needed to improve support. This is important work and I thank the amazing Changing Lives for undertaking it. We are also providing £378,000 of funding over two years to Trevi Women, which provides trauma-informed support to women survivors wishing to exit on-street prostitution.\nWe are aware of the different legislative approaches to prostitution, such as those implemented in Northern Ireland and different parts of Europe. There is a wide range of potential legislative approaches. Further work is needed to understand the options we will have as a Government. I will work with the NGOs and charities to explore those options, ensuring that the protection of women and girls from exploitation is at the forefront of our approach.\nThe trafficking of women and girls for sexual exploitation is a horrific crime, and we are determined to safeguard victims and to bring ruthless perpetrators of this crime to justice. That means ensuring that the police relentlessly pursue perpetrators who pose the greatest risk to women and girls, using all the tools at our disposal to protect victims and get dangerous perpetrators off our streets.\nAs I am sure hon. Members are aware, sexual exploitation is a significant part of the trafficking space in this country. We will build on the Online Safety Act 2023 to ensure that online companies fulfil their duty to eradicate\nthis exploitation from their sites. There is much work to do in this particular space, as has been highlighted by my hon. Friend. I have had many cases where this has not been handled well at all. Indeed, there are images of me on pornographic websites that I cannot get taken down.\nWe will use every lever to halve violence against women and girls in the next decade in the Home Office and across the whole of Government, with policing and other experts. The demand for commercial sexual services fuels the exploitation of women who are forced or coerced into prostitution. The use of commercial sexual services should not be normalised. We will look across\nGovernment to use all the levers available to change attitudes in the longer term, reducing demand for commercial sexual services and protecting women from exploitation.”",
  "https_jessphillips_net_/https_jessphillips_net_node_29/content_8.html": "Yesterday during a committee for the Criminal Justice Bill I explained to the Minister that passing laws and making announcements achieves nothing for domestic violence victims unless you properly resource the organisations who have to deliver that legislation."
}