{
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_Bexley-Superloop/content_3.html": "Thomas is working with Old Bexley and Sidcup's Member of Parliament, Louie French MP and local Bexley Councillors Kurtis Christoforides and Cameron Smith to get the SL3 Superloop service to stop in Bexley Village.\nThomas is working with Old Bexley and Sidcup's Member of Parliament, Louie French MP and local Bexley Councillors Kurtis Christoforides and Cameron Smith to get the SL3 Superloop service to stop in Bexley Village.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_report-back/content_13.html": "Thomas sends our regular ‘Report Back’ newsletters to keep constituents informed of his work at City Hall and in the local area.\nBelow you can view the most recent Report Back messages. You can subscribe to receive the report back emails using the sign up box on the left.\nReport Back November - December 2024 - Click Here\nReport Back September - October 2024 - Click Here\nReport Back May - August 2024 - Click Here",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_campaigns_improve-public-transport-connectivity-0/content_2.html": "Cities are built on their public transport networks and Outer London is missing out. Thomas will lobby for improved connectivity across Bexley and Bromley.\nThomas will campaign to get the DLR extended to Thamesmead and Belvedere, the Elizabeth line extended to Ebbsfleet via Erith, to restore lost services to London Bridge and Cannon Street, and to improve bus services to our rural communities like Biggin Hill, Keston and Downe.\nThomas also wants the London bus fleet to be the cleanest and least polluting in the world. But at the moment there are too many diesel buses operating on our roads, he wants to see these replaced with less polluting vehicles to help improve local air quality.\nThomas started out in politics as a public transport campaigner. He founded a local Rail Users Group and successfully campaigned for increased bus capacity – including securing a whole new bus route.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_city-chief-challenged-over-west-wickham-common-and-spring-park-plans-local-councillors-and/content_20.html": "London Assembly Member for Bexley and Bromley, Cllr Thomas Turrell, has written to Chris Hayward, the political leader of the City of London Corporation which governs the Square Mile, to oppose the Corporation's plan to reduce the amount they pay Councils like Bromley to maintain the City's Commons. These include West Wickham Common and Spring Bank.\nThe letter, which was sent in late February, had the support of Thomas’ fellow Hayes and Coney Hall Councillors Alexa Michael and Josh Coldspring-White, as well as West Wickham Councillors Mark Brock and Hannah Gray.\nAcross London, the City of London Corporation owns, and is responsible for, a number of open spaces which are not within the Corporation's geographic boundary. These include famous open spaces like Hampstead Heath. In Bromley, the Corporation owns West Wickham Common in Coney Hall and Spring Bank in West Wickham which is on the boundary with Croydon. The Corporation currently pays councils like Bromley a grant to cover the cost of maintaining these open spaces.\nHowever, the media outlet London Centric has reported leaked documents that expose how the Corporation, has been planning to reduce these grants since July 2024. The report claims that the Corporation is looking to set a fundraising target on the land instead and will pay a subsidy for any difference between the target and the maintenance cost. Thomas Turrell AM and fellow Councillors representing Hayes and Coney Hall and West Wickham Wards fear if the fundraising target is not met, it will create a shortfall in the maintenance budget and the land will not be properly maintained.\nThe London Centric report claims that the fundraising will come from increased private events on the land like festivals. While festivals may be achievable for Hampstead Heath, Thomas has questioned whether West Wickham Common and Spring Bank, which are predominantly woodland, will be able to do the same. Thomas has also raised concerns about the popular open public spaces being closed off for private events.\nIn his letter, Thomas invites Chris Hayward to visit the sites to see for himself that they are not viable for big fundraising events. He also criticises the lack of public consultation and the secrecy surrounding the plans.\nThomas said:\n“These plans will see popular public land closed off, more congestion on the roads, and a reduction in maintenance. The City of London Corporation needs to look again at these plans. Before making any final decision, they must consult with local people who will be most affected. I do not think these plans are feasible and have written to the Chairman of Policy, the de facto Leader of the City of London Corporation to express my concerns. I hope he will accept my invitation to come and visit Wickham Common and Spring Bank, so he can see how much residents cherish these open green spaces.\nDenying the community access to these sites and lumbering residents with the noise and congestion that comes with large-scale events is not the proper way to treat local people. I hope that the City of London Corporation will rethink these ill-judged proposals.”",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_accessibility/content_17.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_map-locations/content_9.html": "Skip to main content\nMain navigation\nHome\nAbout me\nMy map\nNews\nMy Plan\nCampaigns\nContact\nMy Map",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_questions-mayor-total-number-and-annual-budget-metropolitan-police-officers-directly-or-funded/content_15.html": "Question No: 2024/4304\nQuestion: Thomas Turrell (Bexley and Bromley) - 19th December 2024\nPlease will you provide me with the total number of Metropolitan Police Officers (including Community Support Officers) which have been funded entirely or partially by TfL since May 2016 and in which specific units they have been deployed?\nAnswer: Sir Sadiq Khan (Mayor of London) - 31st January 2025\nBelow are the total number of budgeted Metropolitan Police Officers and PCSOs funded by Transport for London (TfL) from financial year 2016/17 to date. Under the current structure for 2024/25, TfL’s funding contributes either entirely or partially towards the following FTE. Please see my response to Mayor's Question 2024/4305 for more information.\nThe variation year on year is explained by the level of vacancies held by the MPS against TfL funded positions:\nTfL does not hold the data on which specific units these officers have been deployed.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_category_Articles/content_19.html": "Labour to Take Winter Fuel Payment From 88,246 Pensioners Across Bexley and Bromley 4th September 2024 London Assembly Member for Bexley and Bromley, Thomas Turrell, has called on the Labour Government to reverse its plan to scrap the Winter Fuel Payment which... Articles\nThomas Encourages Local Residents and Businesses to Take Part in Blackwall and Silvertown Tunnel Toll Consultations 22nd July 2024 London Assembly Member for Bexley and Bromley, Thomas Turrell, is urging local residents to have their say in the consultation on the tolling of both the... ArticlesLocal News\nThomas Turrell Selected As Conservative London Assembly Candidate for Bexley & Bromley 22nd March 2024 Local Councillor, Thomas Turrell, selected as the Conservative Party Candidate to succeed Peter Fortune AM as Bexley and Bromley’s London Assembly Member. ArticlesLocal News\nChilham Way Shopping Parade Improvements Secured 17th March 2024 Hayes and Coney Hall Ward Councillors were thrilled with the news that their bid for funding improvements to the Chilham Way shopping parade has been accepted... ArticlesLocal News\nCouncillors Call for Police Base Re-Opening 13th March 2024 Hayes and Coney Hall Councillors celebrated success at the Civic Centre on Monday 11th March as motions they proposed and seconded respectively were passed by... ArticlesLocal News",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk/content_1.html": "Bring Athletics Home: Ambitious Plans for Crystal Palace Sports Centre 18th March 2025 Read full article Campaigns Have the SL3 Stop in Bexley Village Thomas is working with Louie French and local Councillors to make the case for… Bromley North to Canary Wharf Superloop Petition Peter Fortune MP and Thomas Turrell AM have launched a petition to connect… Improve Bus Services for Rural Communities Councillors Josh Coldspring-White, Alexa Michael and Thomas Turrell are… Question to the Mayor: Speed Cameras 12th March 2025 Read full article Find me on Facebook My Plan Fairer Deal for Motorists Thomas will campaign to reverse the ULEZ expansion to Outer London and stop… Keep Our Neighbourhood Police in the Neighbourhood Thomas wants to see local police officers patrolling local streets, not being… Improve Public Transport Connectivity Cities are built on their public transport networks and Outer London is missing… Questions to the Mayor: TfL 2030 EV infrastructure strategy 12th March 2025 Read full article Find me on Twitter Action in your area\nBring Athletics Home: Ambitious Plans for Crystal Palace Sports Centre 18th March 2025 Read full article\nHave the SL3 Stop in Bexley Village Thomas is working with Louie French and local Councillors to make the case for…\nBromley North to Canary Wharf Superloop Petition Peter Fortune MP and Thomas Turrell AM have launched a petition to connect…\nImprove Bus Services for Rural Communities Councillors Josh Coldspring-White, Alexa Michael and Thomas Turrell are…\nFairer Deal for Motorists Thomas will campaign to reverse the ULEZ expansion to Outer London and stop…\nKeep Our Neighbourhood Police in the Neighbourhood Thomas wants to see local police officers patrolling local streets, not being…\nImprove Public Transport Connectivity Cities are built on their public transport networks and Outer London is missing…",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_questions-mayor-ev-infrastructure/content_23.html": "EV infrastructure\nQuestion No: 2025/0487\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat assessment have you made of the Electric Vehicle market in 2025?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nThe electric vehicle market continues to evolve and change following industry innovations and economic trends.\nLondon’s electric vehicle registrations are rising steadily, within the range forecast in my London Electric Vehicle Instructure Strategy, which was between 1 million to 1.4 million electric vehicles by 2030 (34-49 per cent of cars and vans).\nThe latest published data (June 2024) shows that London has almost 187,000 plug-in cars registered (7 per cent of all cars) and 6,000 plug-in vans (3 per cent of all vans). Transport for London will be updating these forecasts and plans to publish them, along with a refresh of the commitments in the Strategy, later this year.\nI very much welcome the Government’s planned restoration of the phase out date of 2030 for new cars powered solely by an internal combustion engine. In line with my net zero ambition, I consider that a strong and consistent approach from Government is required to give motor manufacturers and the EV charging infrastructure industry the certainty it needs to continue to invest in and support the delivery and use of zero emission vehicles.\nQuestion No: 2025/0488\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat discussions have you had with electric vehicle industry leaders since your re-election?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nI remain committed to London becoming a net zero carbon city by 2030 and I continue to regularly engage with electric vehicle industry (EV) leaders. For instance, my Deputy Mayor for Transport met with the industry’s representative body ChargeUK on 28 January and discussed issues ranging from to the industry’s fixed costs relating to energy supply to the availability of suitable sites for EV Infrastructure.\nMy officers have regular engagement with the Society of Motor Manufacturers and Traders, with commercial vehicle representatives from organisations such as the British Vehicle Rental Leasing Association, and also manufacturers, including Volvo and Renault Trucks.\nMy officers also run the quarterly London Charge Point Operators (CPO) Forum, in which the operators can raise and discuss issues, challenges and opportunities for EV infrastructure delivery across London and gain forward visibility of my initiatives such as electrification of the GLA vehicle fleet. Transport for London is also undertaking regular market engagement with CPOs as part of its delivery of rapid charge points on its road network and plans for charging hubs. Feedback from this engagement will enhance and streamline future delivery.\nQuestion No: 2025/0489\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat is your assessment of the current infrastructure of electric charging points across London?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nMy London Electric Vehicle Infrastructure Strategy (EVIS), published in 2021, forecast that London will need between 40,000 and 60,000 public charge points by 2030. The Greater London Authority (GLA) and Transport for London (TfL)are updating these forecasts and plan to publish this, along with a refresh of the commitments in the Strategy, later this year.\nThe latest data from Zapmap shows that, as of 31January 2025, there are 22,700 public charge points across London. Almost 1,350 of these are rapid charge points and there are more than 50 hub sites with six or more rapid charge points. The number of public charge points in London has increased by 148 per cent since December 2021 when EVIS was published, showing excellent progress.\nPublic charge point delivery is tracking well against forecast need, with numbers of chargers being installed meeting TfL’s projections, but there is still concern about not enough of the right type of devices in the right places. We are also looking to support charging infrastructure to better serve key user groups such as commercial vehicles, as well as to encourage more inclusive and accessible charge point infrastructure.\nQuestion No: 2025/0490\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nDo you think that current progress on electric charging points is sustainable to hit your net zero target of 2030?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nMy preferred pathway for London to achieve net zero in carbon emissions by 2030 is the ‘Accelerated Green’ pathway, based on Element Energy’s analysis. Under this pathway an estimated 34-40,000 public chargers will be required to meet demand in 2030, of which 4,000-5,000 could be rapid (50 kW and above) chargers.\nThis is broadly consistent with my Electric Vehicle Infrastructure Strategy, published in 2021, which forecast that London will need between 40,000 and 60,000 public charge points by 2030.\nI am proud to say that we are on track to meet this forecast. As of 31 January 2025 – London has over 22,700 public charge points across London, with almost 1,350 of these being rapid charge points.\nQuestion No: 2025/0491\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat engagement have you had, as Mayor and Chair of Transport for London, with the EV sector about the ending of the Congestion Charge Exemption for EVs at the end of 2025?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nPlease refer to my response to Mayor’s Question 2025/0493.\nMy Deputy Mayor for Transport, who leads on all issues relating to transport, has met with a number of stakeholders to discuss the impact of the proposed end to the Cleaner Vehicle Discount. This includes Uber, Addison Lee, Zipcar, the Healthy Air Coalition, Impact on Urban Health and ChargeUK. He has also written to BVRLA, Zipcar, Logistics Association, Faircharge, SMMT, Logistics UK and Clean Cities Campaign. My Deputy Mayor for Transport is also due to meet with Logistics UK and the Federation of Small Businesses in the coming weeks to discuss this issue.\nAny proposals to make changes to the Congestion Charge, including the Cleaner Vehicle Discount, would be subject to public consultation to inform potential changes to the scheme.\nQuestion No: 2025/0492\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat is the total investment you have made in electric vehicle infrastructure and vehicles since your election in 2016, including the funding source?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nAs a result of my policies, London continues to lead the way in the transition to zero emission vehicles. I have overseen a massive increase in electric vehicle (EV) charging infrastructure - London now has over 22,700 public charge points, which is almost a third of the UK’s public charge points and includes almost 1,350 rapid charge points. Transport for London has installed over 300 of these rapid charge points and is continuing to deliver new rapid and ultra-rapid charge points on its road network and in hubs across its estate, as well as supporting borough delivery of slow-to-fast and rapid charge points, providing the infrastructure that drivers, particularly those who cannot charge at home, need to make the transition to EVs.\nI do not have a breakdown of the investment I have made in EVs and charging infrastructure given the broad range of delivery, support and incentives that have been available over my terms as Mayor, including private sector contributions and financial support from government. Using a combination of funding sources, I have been enabling London’s transition to zero emission buses, decarbonising GLA fleets, operating the taxi delicensing scheme and plug-in taxi grants, supporting EV purchases through my scrappage schemes and delivering rapid charging infrastructure. Boroughs have also delivered charging infrastructure as part of wider packages of measures using Mayoral funding sources such as the Mayor’s Air Quality Fund, Local Implementation Plan funding and Business Low Emission Neighbourhoods.\nQuestion No: 2025/0493\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nHas TfL carried out an assessment of the impact of extending the CCZ Cleaner Vehicle Discount (CVD) to 2030 on business fleets transitioning to EVs?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nThe objective of the Congestion Charge is to reduce traffic and manage congestion in central London. This requires Transport for London (TfL) to carefully balance discounts and exemptions to ensure support is provided to those who need it most, without undermining the traffic benefits of the charge. To support those who need to drive in the zone to do so in the cleanest possible vehicle, a 100% ‘green discount’ for low or zero emissions vehicles has always been offered. The discount criteria has tightened every few years as vehicle technology improves and vehicle numbers grow.\nThe Cleaner Vehicle Discount (CVD) was introduced in 2019 following public consultation and analysis of impacts, including on user groups such as car clubs, Private Hire Vehicles and businesses. Around 20,000 vehicles were registered for the discount at the start of 2019, which comprised of two phases and is due to end in December 2025. Registrations now stand at nearly 116,000 vehicles. The scheme is kept under review to ensure it continues to be effective against its objectives.\nI have asked TfL to consider what further support can be offered to those making the shift to electric vehicles in central London to ensure we are also making progress towards my goal of a net zero carbon city by 2030. Any proposal to make changes to the Congestion Charge, including the CVD, would be subject to public consultation and supported by an evidence base, including impact assessments which would consider impacts on businesses and other user groups.\nQuestion No: 2025/0494\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nCan you make an assessment of the impact of the missed ZEV mandate target for 2024 on TfL’s decision to end the CCZ Cleaner Vehicle Discount (CVD) in 2025?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nLondon is outpacing the rest of the UK with new electric car registrations, with 187,000 electric cars and 6,000 plug in vans already registered in the capital, the highest of any UK region. We are also leading the way on infrastructure provision, with over 22,700 public charge points, around a third of all EV charging infrastructure across the UK.\nThe objective of the Congestion Charge is to reduce traffic and manage congestion in central London. This requires TfL to carefully balance discounts and exemptions to ensure support is provided to those who need it most, without undermining the traffic reduction impact of the charge.\nI have asked TfL to consider what further support can be offered to those making the shift to electric vehicles in central London, to ensure we are also making progress towards my goal of a net zero carbon city by 2030.\nQuestion No: 2025/0495\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWill you commit to an updated cost-benefit analysis of the CCZ CVD 2025 deadline to consider new evidence on the slow growth of the UK’s EV market?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nPlease see my response to Mayor’s Question 2025/0493\nQuestion No: 2025/0496\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nHas TfL modelled the financial impact of removing the CCZ CVD on fleet businesses operating in Greater London, particularly private hire vehicle (PHV) operators?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nPlease see my response to Mayor’s Question 2025/0493\nQuestion No: 2025/0497\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nHave you considered extending the CCZ CVD specifically for business fleets to ensure you can meet your goal of achieving Net Zero by 2030?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nPlease see my answer to Mayor’s Question 2025/0493.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_campaigns/content_6.html": "Have the SL3 Stop in Bexley Village Thomas is working with Louie French and local Councillors to make the case for the Superloop (SL3) to stop in Bexley Village.\nBromley North to Canary Wharf Superloop Petition Peter Fortune MP and Thomas Turrell AM have launched a petition to connect Bromley to Canary Wharf with a new express bus service.\nImprove Bus Services for Rural Communities Councillors Josh Coldspring-White, Alexa Michael and Thomas Turrell are campaigning to improve bus services to rural communities like Keston Village.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_chilham-way-shopping-parade-improvements-secured/content_25.html": "Hayes and Coney Hall Ward Councillors were thrilled with the news that their bid for funding improvements to the Chilham Way shopping parade has been accepted by Bromley Council.\nThe funding came from the latest tranche of the Local Shopping Parade Initiative, which offers up to £10,000 of funding to shopping parades across the Borough to improve the aesthetics and facilities. Cllrs. Coldspring-White, Michael and Turrell submitted a bid for Chilham Way after listening to concerns among residents that the parade had been neglected following the recent departure of key businesses. The Councillors’ bids for improvements were accepted. As a result, Chilham Way will receive a village sign, two new planters, hanging baskets, benches and replacements for the noticeboards.\nCouncillor Alexa Michael said:\n“We are so happy to see this much-needed funding awarded to the Chilham Way shopping parade as a result of our bid. Chilham Way shopping parade desperately needs a cash injection to see it revitalised. This money will help to prevent antisocial behaviour; it will provide benefits to current businesses and encourage new ones. We hope this funding will go some way to returning some community pride to the Chilham Way shopping parade and the surrounding area.”\nHayes and Coney Hall Ward Councillors want to thank Bromley Council once again for accepting their bid. They will update residents on progress once further details are received.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news/content_16.html": "Bring Athletics Home: Ambitious Plans for Crystal Palace Sports Centre Tuesday, 18 March, 2025 London Assembly Member for Bexley and Bromley, Thomas Turrell, is supporting ambitious plans to breathe new life into the National Sports Centre at Crystal Palace, after years of underfunding in the centre. Local News\nQuestion to the Mayor: Speed Cameras 12th March 2025 Questions from Thomas Turrell AM (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan, on speed cameras. Written Questions News\nQuestions to the Mayor: TfL 2030 EV infrastructure strategy 12th March 2025 Questions from Thomas Turrell AM (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan on Transport for London's (TfL) Electric Vehicle infrastructure... Written Questions News\nQuestions to the Mayor: GLA/Mayoral Funding to Boroughs 11th March 2025 Questions from Thomas Turrell AM (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan on funding to councils in London. Written Questions News\nOne Year On “Fantasy” ULEZ Report Shows Little Change 7th March 2025 A new report examining the impact of the ULEZ expansion scheme paints a “fantasy” of London’s air quality, says the local London Assembly Member. Local News\nQuestions to the Mayor: New 358 Bus 5th March 2025 Questions from London Assembly Member Thomas Turrell to the Mayor of London, Sir Sadiq Khan, on the new 358 bus model. Written Questions News\nQuestions to the Mayor: LIP Funding 28th February 2025 Questions from London Assembly Member, Thomas Turrell, to the Mayor of London, Sir Sadiq Khan, on LIP Funding. Written Questions News\nQuestion to the Mayor: Amending Existing Superloop Routes 28th February 2025 Question from Thomas Turrell (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan, on amending existing Superloop routes. Local News\nQuestions to the Mayor: EV infrastructure 28th February 2025 Questions from Thomas Turrell to the Mayor of London, Sir Sadiq Khan, on EV infrastructure in London. Written Questions News\nCity Chief Challenged Over West Wickham Common and Spring Park Plans by Local Councillors and Assembly Member 28th February 2025 London Assembly Member for Bexley and Bromley, Thomas Turrell, has written to Chris Hayward – the political leader of the City of London Corporation, to oppose... Local News",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_questions-mayor-new-358-bus/content_26.html": "358 Buses\nQuestion No: 2025/0546\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nSince the introduction of the new ‘Tram Buses’ on route 358 how many vehicles have broken down because of a) a lack of electrical power or b) other reasons?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nThe operator is responsible for managing fleet availability and vehicle maintenance. This includes the deployment of spare vehicles which are incorporated into the fleet as contingency, should breakdowns occur.\nTransport for London (TfL) has oversight of vehicle breakdowns through lost mileage data. Please see my answer to MQ 2025/0548.\nTfL is working with the operator in these early stages of the new service to develop metrics that are best suited to evaluating the opportunity charging technology longer-term.\nQuestion No: 2025/0549\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nHow does the level of lost mileage since the introduction of the new ‘Tram Buses’ on route 358 compare to the figures for the diesel buses which previously operated the route?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nPlease see my answer to Mayor’s Question 2025/0548.\nRoute 358 is currently operating with the electric ieTram buses and being supported by the diesel fleet in the early stages of this technology. It is therefore not yet possible to directly compare the data on lost mileage for the two fleet types. As the service matures, Transport for London will be in a better position to provide a more meaningful comparison between electric and diesel operation.\nThe period since the launch of the ieTram buses has been impacted by traffic mileage losses owing to roadworks on the route, which have increased the lost mileage on route 358 in the short term.\nQuestion No: 2025/0550\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nOn what dates were each of the Irizar ‘Tram Buses’ for use on route 358 delivered from Spain? What was the cost of storage in the UK?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nThe vehicle delivery schedule and the cost of bus storage is the responsibility of the operator. The vehicles were delivered from Spain to align with the installation of the pantograph chargers, supporting testing and training before the launch of the service.\nQuestion No: 2025/0551\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat is the estimated depreciation of each ‘Tram Bus’ whilst in storage?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nThe cost of purchasing and depreciating vehicles is the responsibility of the operator and is embedded within the route contract.\nQuestion No: 2025/0552\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat is the purchase price of each ‘Tram Bus’, and how does this compare with other electric single deck buses purchased by London bus operators?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nThe cost of purchasing vehicles is the responsibility of the operator and is embedded within the route contract price.\nQuestion No: 2025/0553\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nGiven that the Irizar ‘Tram Buses’ are a one-off purchase, what is the cost of maintaining each vehicle and training/familiarising staff compared with other types of vehicle?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nThe cost of maintaining the Irizar buses on route 358 is the responsibility of the operator and is embedded within the route contract price. Training and familiarisation for maintaining and driving new vehicles is a process carried out by the operator when any new bus is introduced on the network.\nQuestion No: 2025/0554\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat was the cost of purchasing and installing the pantograph chargers at each of the four locations for routes 132 and 358, including staff time and obtaining planning permission?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nRoute 132 utilises one privately owned pantograph charger at Bexleyheath bus garage. The cost of this charger, as well as staff time and any required planning permissions, is embedded within the route contract.\nThe cost of installing the two pantograph chargers for route 358, alongside staff and overheads, are embedded in the total cost of the bus route contract.\nThe cost of the pantograph charging infrastructure is coupled with the tender for the operation of the route 358. The total cost is therefore embedded within the award of this operating contract and Transport for London is unable to provide a breakdown due to commercial confidentiality.\nQuestion No: 2025/0555\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWho owns or rents the land on which the pantograph at Orpington Station was constructed, and how much is being paid to use the land?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nTransport for London (TfL) leases the land on which the pantograph structure has been erected. TfL’s immediate landlord is now the Arch Company, but when the lease was completed in 1999, London Regional Transport (LRT) entered into the lease with Railtrack PLC for an annual peppercorn rent (nominal amount). LRT paid Network Rail a premium in 1999.\nQuestion No: 2025/0556\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nExcluding the buses on routes 132 and 358, how many miles does an a) double deck and b) single deck electric bus operate between charges?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nOperated mileage varies across the bus network, and charging schedules are aligned to service frequency requirements, the vehicle type and battery capacity. The operator is responsible for managing the sequence of vehicle charging for each bus type per route.\nQuestion No: 2025/0557\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nBefore proceeding to install pantograph chargers on routes 132 and 358, what studies were made of similar installations in other towns & cities in the UK and overseas?\nAnswer: Sir Sadiq Khan (Mayor of London): 28th February 2025\nAs part of the development of the route 358 pantograph charging project, Transport for London (TfL) engaged with other UK operators which had installed pantograph charging technology. Birmingham Airport and The Harrogate Bus Company hosted TfL at their charging sites as part of a knowledge sharing exercise. TfL representatives also visited the Jema and Irizar pantograph charger installation in Amiens, France.\nQuestion No: 2025/0547\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nSince the introduction of the new ‘Tram Buses’ on route 358, how many times has a vehicle had to turn short of its destination and passengers required to leave the bus as a result?\nAnswer: Sir Sadiq Khan (Mayor of London): 5th March 2025\nPlease see my answer to Mayor’s Question 2025/0548.\nSince the launch of the new ieTram bus fleet on route 358, the route has lost approximately eight per cent of its scheduled mileage. Approximately five per cent of this lost mileage is attributed to traffic and other on-road issues.\nAs part of their service control strategy, bus operating companies may change the start and/or end point of specific buses in response to network disruption to ensure the lowest average wait time for customers and ensure adherence to driver hours regulations. As these changes are implemented dynamically - either proactively before a vehicle starts its trip or reactively based on unanticipated mid-journey delays - it is not possible to provide a figure for the number of times a bus has been turned short of the advertised destination and resulted in passengers being required to leave the bus.\nBy installing rapid-charging pantograph infrastructure on one of London's longest bus routes, this innovative trial will provide valuable learning for the future.\nTransport for London continue to work closely with the bus operator responsible for running the route 358, alongside other stakeholders, to improve the reliability of the service for its customers.\nQuestion No: 2025/0548\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nSince the introduction of the new ‘Tram Buses’ on route 358 how much mileage has been lost as a result of vehicles breaking down or vehicles turning short of their destination?\nAnswer: Sir Sadiq Khan (Mayor of London): 5th March 2025\nPlease see my answer to Mayor’s Question 2025/0547.\nSince the launch of the new ieTram bus fleet on route 358, the route has lost approximately eight per cent of its scheduled mileage. This includes all instances of vehicles failing to run as scheduled for any reason, including vehicle unavailability, traffic delays, etc.\n2.1 per cent of this lost mileage is attributed to vehicle breakdowns or mechanical issues. This includes lost mileage for the diesel fleet which has been supporting the route in the early stages of the new technology.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_cdn-cgi_l_email-protection/content_32.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_about-thomas-turrell/content_4.html": "Thomas lives in Shortlands, Bromley, with his wife Gemma and their two cats. His dad was raised in Belvedere, where generations of the family have lived.\nHe has been a London renter for over a decade has worked in the Financial Services sector for nearly 10 years prior to his election to the London Assembly.\nThomas has always played an active role in the community, as a School Governor, NHS Foundation Trust Governor and as a trustee of a number of charities, including Vice-Chair and Treasurer of a national charity with a multi-million-pound budget. Before entering politics Thomas was a transport campaigner, successfully campaigning for more capacity on crowded bus routes, including by securing a whole new route. He also founded a local Rail Users Group.\nSince 2022 he has served on Bromley Council, representing Hayes and Coney Hall ward. He was Executive Assistant for the Environment Portfolio between 2022-24, where he was responsible for the multi-million investment into Kelsey Park. He has also been Vice-Chairman of the Renewal, Recreation and Housing Scrutiny Committee.\nAs a Councillor he has campaigned to re-open local police bases, helped secure additional resource for neighbourhood police teams to tackle speeding, helped get funding for improvements to shopping parades, been campaigning for barriers at Hayes station and campaigned against the loss of Cannon Street services.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_question-mayor-speed-cameras/content_5.html": "Speed Cameras\nQuestion No: 2025/0558\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nCan the Mayor confirm if TfL will still install new speed cameras to enforce speed limits on both borough and TfL owned roads?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nTransport for London (TfL) remains committed to expanding its speed camera network on both TfL and borough roads in the future. TfL is not currently installing new speed cameras on the network whilst it continues to work with the Metropolitan Police Service to build capacity to enforce more offences and begin the process of re-letting its existing safety camera contracts. TfL and the police have committed to supporting boroughs with speed non-compliance using speed guns and mobile cameras where speeding is found to be an issue. This enforcement is prioritised based on risk and harm.\nOnce TfL is in a position to expand the network, it will prioritise locations for safety cameras using a methodology that was developed in consultation with boroughs and London Councils pre-pandemic. Whilst the methodology hasn’t changed, TfL needs to take into account any changes in travel patterns and road user behaviour, as well as the significant changes made to road layouts during the pandemic, and so will run the analysis again.\nThe locations for safety cameras will be based on the results of the analysis.\nQuestion No: 2025/0560\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nHow many requests for speed cameras have been refused by TfL each year since 2020?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nTransport for London (TfL) does not hold a comprehensive record of requests for speed cameras. TfL works with its policing partners to understand and respond to concerns received from the public and boroughs with regard to speeding. Suitable responses to speeding concerns may include engineering solutions, police deployment, mobile enforcement or other initiatives.\nThrough TfL's investment in mobile speed cameras, TfL has set up a process for London boroughs to request additional speed enforcement where community concerns exist. Borough officials can make requests directly to TfL and cameras are then deployed to locations not covered by its fixed camera network. Mobile cameras have been successfully deployed to locations across London, carrying out both enforcement and acting as a visual deterrent.\nQuestion No: 2025/0562\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat locations are due to have a new speed camera installed in the coming year?\nAnswer: Sir Sadiq Khan (Mayor of London): 5th March 2025\nTransport for London (TfL) remains committed to expanding its speed camera network on both TfL and borough roads in the future. However, TfL is not routinely installing new speed cameras on the network at this time whilst it continues to work with the Metropolitan Police Service to build capacity to enforce up to one million offences and begin the process of re-letting its existing safety camera contracts. TfL and the police have committed to supporting boroughs with speed non-compliance using speed guns and mobile cameras where speeding is found to be an issue. This enforcement is prioritised based on risk and harm.\nTfL is currently upgrading existing camera corridors with new average speed technology on major routes in London. These upgrades are taking place on the A316, A2, A40 and A406 as part of ongoing efforts to improve road safety in the capital. Works on the A316 are reaching completion, with further camera upgrades to take place over the coming months.\nAs part of several measures TfL is undertaking with the Metropolitan Police Service and London Borough of Enfield to tackle road danger and anti-social behaviour on the A10, it will also be extending the existing average speed camera system at this location. These additional cameras will cover the southern section from Southbury Road to the A406. Several other measures are being progressed, including but not limited to an injunction prohibiting ‘car cruising’ meets across the borough and recruiting volunteers for Community and Junior RoadWatch sessions.\nQuestion No: 2025/0561\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat criteria does TfL use to determine if it accepts or refuses a request for a new speed camera from the police and/or a council?\nAnswer: Sir Sadiq Khan (Mayor of London) - 12th March 2025\nTransport for London (TfL) has a network of over 800 speed and red-light enforcement cameras across London. These have been placed at sites where there has been a history of collisions or poor road user behaviour, creating risk to other road users. TfL also operates 7 mobile speed cameras in partnership with the MPS.\nTfL works with its policing partners to understand and respond to concerns received from the public and borough councils with regard to speeding. Suitable responses to speeding concerns may include engineering solutions, police deployment, mobile enforcement, and other initiatives. My response to question 2025/0558 provides further detail.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_thomas-turrell-selected-conservative-london-assembly-candidate-bexley-bromley/content_30.html": "Local Councillor, Thomas Turrell, selected as the Conservative Party Candidate to succeed Peter Fortune AM as Bexley and Bromley’s London Assembly Member.\nThe Conservative Party have selected local Councillor, Thomas Turrell as their candidate for the upcoming elections to the London Assembly. Thomas Turrell has been a Councillor since 2022, representing Hayes & Coney Hall on Bromley Council.\nOn the Council Thomas has served as Assistant Executive on the Environment portfolio, where he has been responsible for overseeing the multi-million investment in Kelsey Park, which includes the desilting of the lakes and re-opening the wooden footbridge.\nSince being elected Thomas has campaigned on several local issues, including improving bus connectivity in rural parts of Outer London. Something he has criticised the Superloop for not addressing. He has also campaigned for the re-opening of police bases closed in 2018 by the current Mayor of London, Sadiq Khan.\nCommenting on his selection Thomas said:\n“I am proud and honored to have been selected as the Conservative Party Candidate for Bexley & Bromley for the GLA elections on 2nd May. This constituency covers my home in Bromley and my family roots in Bexley.\nThese elections are vital for our area. We have a real chance to get rid of a Mayor of London who has been disastrous for our area; expanding ULEZ which is a tax on local motorists, not delivering the river crossings east of Blackwall Tunnell that we desperately need and closing our police bases while crime is rising. We must end his eight years of failure.\nIf I am fortunate enough to be elected on May 2nd my priorities will be ensuring the residents and businesses of Bexley & Bromley get the focus, support and investment they deserve from City Hall. I will be campaigning for more river crossings, restoring police bases, scrapping the ULEZ and stopping the dreadful idea the current Mayor has for pay per mile.”\nIncumbent London Assembly Member Peter Fortune announced he would not seek re-election after he was selected as the Conservative Parliamentary Candidate for the new Bromley and Biggin Hill constituency.\nPeter Fortune AM was the Assembly Member for Bromley & Bexley since May 2021. The Greater London Authority is the scrutiny body of the Mayor of London. The role of London Assembly members is hold the Mayor and Mayoral advisers to account by examining their work to ensure promises are delivered.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_questions-mayor-tfl-2030-ev-infrastructure-strategy/content_8.html": "TfL 2030 Electric Vehicle infrastructure strategy\nQuestion No: 2025/0498\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nIn the TfL 2030 electric vehicle infrastructure strategy, an estimate was made for 1,000 rapid chargers which could be accommodated on GLA Group land. How many rapid charging points have been installed on GLA Group land since December 2021?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nThere were 300 rapid charge points installed between 2017 and 2021, including Glass Yard charging hub, which opened in September 2021.\nSince December 2021, a further 12 rapid charging bays have been installed on GLA land, with a further 145 being actively progressed in partnership with Charge Point Operator. This includes 70 bays across five hub sites at Hangar Lane, Canning Town, Hatton Cross, Tottenham Hale and Hillingdon Circus and 75 on TfL’s road network, which will be released in batches throughout in 2025.\nQuestion No: 2025/0499\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nWhat progress have you made in establishing a North London hub?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nMy Electric Vehicle Infrastructure Strategy, published in December 2021, noted that delivering a rapid charging hub in north London was a priority. Since this time, the delivery of rapid charge points by the private sector, including hub sites has increased and there are now a number of hub sites across London.\nIn December 2024, Places for London, Transport for London’s property company, appointed Fastned as its joint venture partner to deliver an initial five seed sites. The first five sites are located at Hanger Lane (Ealing), Canning Town (Newham), Hatton Cross (Hillingdon), Tottenham Hale (Haringey) and Hillingdon Circus (Hillingdon). Please see the response to 2025/0502 for more details.\nQuestion No: 2025/0500\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nIn the TfL 2030 electric vehicle infrastructure strategy, it says in the future 'boroughs will be encouraged to continue and enhance delivery of residential slow-to-fast charge points on their land'. What conversations have you had with boroughs about funding and development of land for residential EV charging points?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nI am continuing to support London’s boroughs to deliver the electric vehicle (EV) charging infrastructure that Londoners will need to support their transition to EVs. My officers published an EV infrastructure borough support pack in January 2024 to assist boroughs to develop their local EV infrastructure strategies and deliver public charge points.\nLondon has been allocated almost £39m of Government Local EV Infrastructure funding. This funding aims to expand the delivery of primarily low-powered charge points, increasing the number of local public charge points for residents who cannot charge at home. The majority of these will be delivered on borough roads, meeting the need for charging near to home. My officers are working closely with London Councils to support the delivery of these charge points.\nMy officers also continue to support boroughs looking to deliver rapid and ultra-rapid charge points across their land, for example in car parks or on-street. This includes sharing site selection processes, procurement templates and best practice for delivering infrastructure.\nQuestion No: 2025/0501\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nIn the TfL 2030 electric vehicle infrastructure strategy, it says in the future 'boroughs will be encouraged to continue and enhance delivery of residential slow-to-fast charge points on their land'. Can you provide a breakdown of boroughs with residential slow-to-fast chargers and rapid charging points?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nLondon continues to lead the way with the delivery of public electric vehicle charging infrastructure. The breakdown of charge points by London borough is attached.\nSource: Department for Transport, public charging infrastructure, correct at 1 January 2025 Electric vehicle public charging infrastructure statistics: January 2025 - GOV.UK\nQuestion No: 2025/0502\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nIn the TfL 2030 electric vehicle infrastructure strategy, it says the 'Commercial Development team is pursuing opportunities to roll out our own rapid charging hubs, using available land'. How many rapid charging hubs have been installed since December 2021 and what land has been used (TfL, GLA Group etc)?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nSince the publication of the 2030 Electric Vehicle Infrastructure Strategy, we have made significant progress in pursuing opportunities to roll out rapid charging hubs. Three hubs have already been rolled out by TfL (in Woolwich, Stratford and City of London), and in November 2023, Places for London launched a competitive tender to procure a joint venture partner to develop and manage a network of ultra-rapid electric vehicle charging hubs. In December 2024, Places for London announced that Fastned had been selected as its joint venture partner to potentially deliver up to 65 sites across London, with GLA Group land being the priority but third party sites also being considered.\nPlaces for London and Fastned have agreed to jointly invest in the development of an initial five charging hubs, comprising over 70 ultra-rapid charging bays. These initial sites are all located on TfL land. In January 2025, Fastned and Places for London submitted their first planning application for 12 ultra-rapid electric vehicle charging bays at Hatton Cross in Hillingdon. If approved, the joint venture will begin construction and hopes to see the first assets operational within 12 months.\nQuestion No: 2025/0503\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nIn the TfL 2030 electric vehicle infrastructure strategy, it says an application platform interface would be developed to support improving the user experience and providing more reliable information on individual charge points. Was funding secured for this service and has this been developed?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nMy London Electric Vehicle Infrastructure Strategy identified a need to develop a real-time and open Application Platform Interface of all charge points across London to improve user experience and provide more reliable information on individual charge points, subject to an initial feasibility study and Government funding.\nTransport for London (TfL) undertook initial feasibility work in 2022 to identify how it could develop a real-time information system for charge points across London. However, without Government funding, and with the subsequent Government consultation on proposals to regulate and improve the consumer experience of finding and using public charging infrastructure, including opening up charge point data, TfL did not progress this. The resulting Public Charge Point Regulations require that charge point operators provide accurate open data on all their charge points, including availability, location, connector types, pricing, payment methods and time restrictions. This data is available to mapping services and makes it easier for consumers to locate public charge points that meet their needs and to be confident that they will be in good working order.\nQuestion No: 2025/0505\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nIn the TfL 2030 electric vehicle infrastructure strategy, there were plans to establish an EV Ethics and Sustainability Committee. Has this been established and what have you done to support this?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nMy Electric Vehicle (EV) Infrastructure Strategy acknowledged that questions have been raised around the source and end-of-life sustainability of the materials used to manufacture batteries and committed to seek a partner to set up an EV ethics and sustainability committee to engage with others, such as international cities, governments, trade bodies and non-government organisations to identify collective international action to address the ethics and sustainability of the supply chain for EVs.\nMy officers worked with C40 Cities, who hosted a series of virtual seminars for cities in their Zero Emission Vehicle Network, to address local priorities and requests to learn more about cities can look at emerging issues in the EV lifecycle. One option for cities is to use responsible procurement requirements covering ethical sourcing across supply chains, and this has been adopted in London.\nThe Greater London Authority and Transport for London are members of the Electronics Watch Low-Emission Vehicles Programme and require that companies they contract have robust ethical and sustainability policies to ensure the highest standards are met on the environment and workers' rights.\nQuestion No: 2025/0506\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nIn the TfL 2030 electric vehicle infrastructure strategy, there was a commitment to have London level forecasts to be updated every 2-3 years starting from 2022. Have you published your 2024 or 2025 forecasts, and what engagement with the sector have you and TfL had to reach this figure?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nMy London Electric Vehicle (EV) Infrastructure Strategy, published in December 2021, included modelling which forecast that London will need between 40,000 and 60,000 public charge points by 2030. This updated the infrastructure forecasts to 2025 set out in my earlier EV Infrastructure Delivery Plan, based on the input from my EV Infrastructure Taskforce.\nMy strategy committed to update these forecasts every two to three years, reflecting government policy changes, evolving technologies, and electric vehicle uptake. Transport for London (TfL) is updating the modelling and will publish an update later this year alongside a refresh of the commitments in the strategy. TfL is engaged with charge point operators on its planned modelling update through the London Charge Point Operators Forum, and will undertake further engagement with industry representatives ChargeUK and others on the modelling and updated commitments.\nQuestion No: 2025/0504\nQuestion: Thomas Turrell AM (Bexley and Bromley) - 25th February 2025\nIn the TfL 2030 electric vehicle infrastructure strategy, it envisages 'the first bus garage shared infrastructure', which was subject to securing funding. Was this funding awarded and has this been completed?\nAnswer: Sir Sadiq Khan (Mayor of London) - 12th March 2025\nI have committed to a zero emission bus fleet by 2030 and Transport for London (TfL) continues to work closely with key stakeholders to achieve this. There are currently 1,878 zero emission tailpipe buses in the London fleet, and more than 1,000 buses on order. TfL is working with stakeholders to ensure the necessary infrastructure is available to enable this transition.\nHowever, there remain several challenges to the sharing of charging infrastructure in bus garages with other vehicles, including space constraints and safety and security concerns. Unfortunately, government funding has not been forthcoming to support this. However, my officers will continue to explore with bus operators any opportunities to pilot the sharing of bus garage charging infrastructure.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_campaigns_new-police-minibus-hayes-west-wickham/content_24.html": "Along with my fellow ward councillors and Bob Stewart MP, I am calling on the Deputy Mayor of London (Police & Crime) to fund a new Police vehicle for the Safer Neighbourhood Teams (SNTs) in the Wards of Hayes & Coney and West Wickham Wards to use jointly.\nThe SNTs have been working from Bromley Police Station since January 2022 after the Labour Mayor of London closed the Police base in West Wickham which was used by both sets of SNTs. This means that more Police time is being spent traveling to and from the Wards. Bob and the Councillors argue that a marked minibus would allow the SNTs to have a mobile base in the community and not be dependent on public transport.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_Extend-The-SL4/content_33.html": "Peter Fortune MP and Thomas Turrell AM have launched a petition to connect Bromley to Canary Wharf with a new express bus service.\nTransport for London plans to launch a new Superloop route — the SL4 — from Grove Park to Canary Wharf next year. It will stop at Blackheath and Lee. However, it will not come into Bromley, meaning people here cannot easily access the new service.\nWe believe the new Superloop route should be extended to run from Bromley North via Plaistow Green. This would allow more people to access the service, expand people's transport choices, and connect the service with the other two Superloop routes from Bromley, which run to Bexley and Croydon.\nWe propose three additional stops at Burnt Ash Library, Plaistow Green and Bromley North to achieve this.\nIf you agree, please sign the petition to extend the Superloop from Bromley North to Canary Wharf.\nWe call on the Mayor of London and Transport for London to extend the SL4 from Bromley North to Canary Wharf.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_labour-take-winter-fuel-payment-88246-pensioners-across-bexley-and-bromley/content_28.html": "- The Labour Government has chosen to scrap the Winter Fuel Payment for 88,246 pensioners across Bexley and Bromley despite promising to protect the benefit during the general election.\nLondon Assembly Member for Bexley and Bromley, Thomas Turrell, has called on the Labour Government to reverse its plan to scrap the Winter Fuel Payment which will impact ten million pensioners, including 52,062 in Bromley and 36,184 in Bexley.\nJust weeks after the election, the new Labour Chancellor Rachel Reeves has announced a cut to the Winter Fuel Payment which will reduce it by between £100 and £300, money that would usually have helped pensioners with their heating bills during the winter.\nBetween 2010 and 2023, the Conservatives had lifted over 200,000 pensioners out of absolute poverty. The Conservative Government’s unprecedented cost of living support following Putin’s illegal invasion of Ukraine also prevented 400,000 pensioners from falling into absolute poverty after housing costs in 2022-23.\nLabour’s scrapping of the Winter Fuel Payment comes despite Labour’s Chief Secretary to the Treasury, Darren Jones MP, saying that Labour had ‘no plans to make changes’ to pensioner benefits.\nThomas said:\n“The new Labour Government has chosen to remove the Winter Fuel Payment from over 88,000 pensioners across Bexley and Bromley and this will have a devastating impact on vulnerable people this winter.\n“Rachel Reeves must reverse this decision so that those who worked hard and saved all of their life, live with dignity and security in retirement.”",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_Fairer-Deal-for-Drivers/content_27.html": "Labour and Sadiq Khan have been running London since 2016, and in that time we’ve seen two ULEZ extensions, plans for tolls at Blackwall tunnels, no new parking facilities with new housing, and traffic chaos caused by so-called “Low Traffic Neighbourhoods. All designed to force drivers off the road. But in Bexley and Bromley local people and small businesses have to rely on their cars to get about because there is no alternative. The Mayor and his team just do not understand Outer London, as demonstrated by how dangerously close we came to Labour introducing Pay-Per-Mile on our roads – something which was only defeated because of the work of the Conservatives in London.\nAs the London Assembly Member for our beautiful boroughs I will always stand up for and fight for a better deal for our motorists.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_question-mayor-amending-existing-superloop-routes/content_29.html": "Question No: 2025/0542\nQuestion: Thomas Turrell (Bexley and Bromley) - 25th February 2025\nWhen will TfL launch formal consultations on plans to amend the Superloop routes in South London, such as extending the SL5 to terminate in Croydon and reducing the SL7 to start in Sutton?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nTransport for London (TfL) is not planning to change the SL5 or SL7 routeings at this time; and therefore there are no current plans to consult on changes to these routes. TfL continues to review the Superloop network to ensure it best meets the needs of Londoners.\nTfL has recently launched consultation on a proposed new Superloop route BL1 (https://haveyoursay.tfl.gov.uk/bl1-superloop) and I expect TfL to launch two further consultations on Superloop expansion (https://haveyoursay.tfl.gov.uk/superloop-expansion) soon.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_thomas-turrell-am-delivers-transport-policing-petitions-sadiq-khan/content_7.html": "City Hall Conservatives Assembly Member Thomas Turrell AM has today presented the Mayor of London Sadiq Khan with two petitions by residents in Bexley & Bromley regarding issues with local transport and policing.\nThe first petition calls on the Mayor of London to provide a Superloop bus stop in Bexley Village for the SL3 Express bus service, which passes through the village but does not stop there. Petitioners claim that the stop would help alleviate congestion on Penhill Road and avoid delays to the service.\nThe second petition calls on the Mayor and MOPAC to reverse plans to close the Coldharbour Police Base on William Barefoot Drive, and to commit instead to keeping the police base open, in order to reassure local residents and tackle crime. Opponents to the closure claim that moving the local police to Kidbrooke Village would leave residents in Mottingham, ColdHarbour and New Eltham less safe. Assembly Member Turrell was joined at City Hall this morning by Greenwich Conservative Councillors Matt Harley and Roger Tester (Councillors for Mottingham, Coldharbour and New Eltham ward) to present the petition under the Greater London Authority’s Standing Orders.\nIn a statement, Thomas Turrell AM said:\n“I am honoured to be able to present these petitions to the Mayor of London on behalf of Mottingham residents in both Bromley and Greenwich, and it is my sincere hope that Sadiq Khan listens to residents’ concerns. I’m also grateful to support local champions Cllrs Matt Harley and Roger Tester, who have worked closely with me to raise this issue and seek answers for our constituents.\nPolicing and transport are very important topics and its time that the Mayor sat up and listened to what people want for their local communities, and provide the support they’re asking for.”",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_thomas-turrell-welcomes-additional-314-and-289-weekend-bus-services/content_31.html": "London Assembly Member for Bexley and Bromley, Thomas Turrell, has welcomed news from Transport for London (TfL) that additional Sunday bus services will operate on the 314 and 289 bus routes. Thomas is continuing to campaign to make public transport in Outer London more reliable.\nThe additional services for both routes will begin on Saturday 31 August. For the 289 route (Elmers End Interchange to Purley Station) buses will operate every 15 minutes instead of every 20 minutes during Sunday daytimes and every 20 minutes instead of every 30 minutes during the early mornings on Sunday. On the 314 route (Eltham Bus Station to New Addington) buses will also operate more frequently with services every 20 minutes instead of every 30 minutes on Sunday and in the early morning on Saturday and Sunday.\nAs a Councillor for Hayes and Coney Hall ward, as well as London Assembly Member for Bexley and Bromley, Thomas has campaigned for improved bus services for Outer London and welcomes the additional services to these routes.\nThomas said:\n“Public transport in Outer London has been lacking, so I am passionate about improving reliability and frequency for local residents. This is an important step towards this from TfL so I welcome the announcement and look forward to looking into other ways we can improve this for the rest of the borough.”",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_questions-mayor-lip-funding-0/content_14.html": "Question No: 2025/0543\nQuestion: Thomas Turrell (Bexley and Bromley) - 25th February 2025\nHow much has each London Borough received in LIP (Local Implementation Plan) Funding for each year since 2016?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nPlease see my response to Mayor’s Question 2024/4300, found here: MQ2024/4300. LIP funding for the next financial year will be confirmed in spring.\nQuestion No: 2025/0544\nQuestion: Thomas Turrell (Bexley and Bromley) - 25th February 2025\nWhat has the total LIP Funding Budget been every year since 2016?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nPlease see my response to Mayor’s Question 2024/4300, found here: MQ2024/4300. LIP funding for the next financial year will be confirmed in spring.\nQuestion No: 2025/0545\nQuestion: Thomas Turrell (Bexley and Bromley) - 25th February 2025\nBroken down by year and borough, how much money has TfL given boroughs via LIP Funding to spend on LTNs since 2016?\nAnswer: Sir Sadiq Khan (Mayor of London) - 28th February 2025\nLow Traffic Neighbourhoods (LTNs) is one of the terms used for a traffic management scheme, and schemes of this nature can also be described and categorised in different ways.\nThe scale of these schemes, and the variety of restrictions used to implement them, vary extensively. There is no uniform definition of what constitutes an LTN, so unfortunately Transport for London is not able to provide a breakdown of how much funding has been given to each borough to implement them.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_campaigns_improve-bus-services-rural-communities/content_22.html": "Councillors Josh Coldspring-White, Alexa Michael and Thomas Turrell are campaigning to improve bus services to rural communities like Keston Village.\nCouncillors Josh Coldspring-White, Alexa Michael and Thomas Turrell are campaigning to improve bus services to rural communities like Keston Village.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_news_category_Written-Questions-News/content_12.html": "Question to the Mayor: Speed Cameras 12th March 2025 Questions from Thomas Turrell AM (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan, on speed cameras. Written Questions News\nQuestions to the Mayor: TfL 2030 EV infrastructure strategy 12th March 2025 Questions from Thomas Turrell AM (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan on Transport for London's (TfL) Electric Vehicle infrastructure... Written Questions News\nQuestions to the Mayor: GLA/Mayoral Funding to Boroughs 11th March 2025 Questions from Thomas Turrell AM (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan on funding to councils in London. Written Questions News\nQuestions to the Mayor: New 358 Bus 5th March 2025 Questions from London Assembly Member Thomas Turrell to the Mayor of London, Sir Sadiq Khan, on the new 358 bus model. Written Questions News\nQuestions to the Mayor: LIP Funding 28th February 2025 Questions from London Assembly Member, Thomas Turrell, to the Mayor of London, Sir Sadiq Khan, on LIP Funding. Written Questions News\nQuestions to the Mayor: EV infrastructure 28th February 2025 Questions from Thomas Turrell to the Mayor of London, Sir Sadiq Khan, on EV infrastructure in London. Written Questions News\nQuestion to the Mayor: Local Implementation Plans Funding 10th February 2025 Question from Thomas Turrell (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan, about fuding from Transport for London (TfL) to local councils for... Written Questions News\nQuestions to the Mayor: Total Number of and Annual Budget for Metropolitan Police Officers directly or funded by TfL since 2016 31st January 2025 Questions from London Assembly Member Thomas Turrell ( Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan, on the subject of the tnumber of Metropolitan... Written Questions News\nQuestions to the Mayor: Parking on Police Owned Access Road in Bromley 28th January 2025 Question from Thomas Turrell AM (Bexley and Bromley) to the Mayor of London, Sir Sadiq Khan, outside Bromley South station. Written Questions News",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_about-rss/content_21.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_privacy/content_11.html": "This document outlines how Thomas Turrell AM processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Thomas Turrell AM\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Thomas Turrell AM.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Thomas Turrell AM, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Thomas Turrell AM via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_contact/content_10.html": "Skip to main content\nMain navigation\nHome\nAbout me\nMy map\nNews\nMy Plan\nCampaigns\nContact\nContact\nLeave this field blank\nLondon Assembly Contact Details\nCity Hall Conservatives, Kamal Chunchie Way, London E16 1ZE\n[email protected]\nCouncil Contact Details\nc/o Members Room, Bromley Civic Centre, Stockwell Close, Bromley BR1 3UH\n[email protected]\nFind me on Facebook (@ThomasTurrellAM)\nFind me on Twitter (@ThomasFTurrell)\nFind me on Instagram (ThomasFTurrell)\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "http_www_thomasturrell_co_uk_/http_www_thomasturrell_co_uk_archived-campaigns/content_18.html": "Improving Chilham Way Shopping Parade Conservative-run Bromley Council is investing £50,000 to improve five shopping parades across the borough. Each parade will receive up to to £10,000 for...\nA new police minibus for Hayes & West Wickham Along with my fellow ward councillors and Bob Stewart MP, I am calling on the Deputy Mayor of London (Police & Crime) to fund a new Police vehicle for the Safer...\nSave the Cannon Street trains from Hayes station I am part of a campaign trying to save the Cannon Street Services on the Hayes Line. Southeastern Railways announced in September that the service would be..."
}