{
  "https_ruthcadbury_org_/https_ruthcadbury_org/content_1.html": "Your local voice in Parliament\nI am honoured to have served as your MP since 2015, working hard for this community, listening to what matters to you and representing your views in Parliament.\nI have lived here in the constituency for over 30 years. That is why I am passionate about being a champion for our community in Parliament and beyond.\nSince first being elected, I have responded to requests for help and support at the rate of 10,000 per year. Each month I visit schools, community groups, residents' associations and businesses.\nI will always work to remove the barriers to opportunity - fighting to make our part of West London fairer, greener and more prosperous.\nI currently sit as Chair of the Transport Select Committee, whose job it is to scrutinise the transport industry and transport policy. I have held a number of shadow ministerial briefs, including; Prisons, International Trade, and housing and local government.\nNews\nIn the Chamber...\nFor a full list of my spoken contributions, visit Spoken contributions of Ruth Cadbury - MPs and Lords - UK Parliament\nConstituency update...\nAs Transport Committee Chair...\nAdvice and support\nBelow is a list of handy services - whether you need help regarding the Council, housing, welfare, elderly support, immigration, mental health, or domestic abuse.\nThese two services provide advice and support across a range of topics.\nHounslow Connect\nYour go to platform for local activities, advice, guidance and support in Hounslow\nCitizens Advice Bureau\nContact us by Phone\nYou can call us on: 0808 278 7830 (freephone)\nMon-Fri, from 10am to 4.00pm\nContacting the Council\nHousing\nWelfare Support\nSupport for the Elderly\nImmigration Matters\nMental Health\nSupport for Violence, Abuse and Harassment\nHow can I help?\nContact\nThere are many ways I can help constituents with problems or concerns.\nParliamentary protocol prevents me from intervening on behalf of another MP’s constituents. To find out if I\nam your MP, enter your postcode here before getting in touch. (Find your MP - MPs and Lords - UK Parliament)\nPlease email ruth@ruthcadbury.org.uk\n*Remember to include your postcode, so I know you’re one of my constituents.\n*Remember to include your full contact details and any relevant reference numbers (e.g. DWP Home Office) and my ZA reference if we’ve corresponded on the same issue before.\nPhone 020 8581 3646 between 10 am - 2 pm Monday to Thursday and we will do our very best to assist you or call 020 7219 8590\nYou can also request a one-on-one surgery meeting. I hold regular surgeries, both in person and online.\nIndividual Issues\nI can help constituents with a wide range of individual issues. Generally, I am able to help with any issue that falls under the responsibility of central government, such as problems with welfare benefits, immigration and health. There are some issues I am not able to help with, but my team will be able to offer advice on where you can find the help that you need.\nHere is a link to support I can provide on immigration matters. (Immigration Information | Ruth Cadbury MP)\n*Please note that all enquiries are treated the same. I do not expect my staff to tolerate unacceptable be-\nhaviour from any constituent or stakeholder. For my full policy on vexatious or persistent communications,"
}