{
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_news/content_5.html": "04 December 2024\nBury Times\nBury North MP James Frith says in his column that Labour is building a country where every person, regardless of background, has an equal voice\n...04 December 2024\nManchester Evening News\nHundreds of people have signed the petition so far\n...04 December 2024\nBury Times\nBury North MP James Frith will \"work tirelessly to advocate for amendments\" to \"strengthen safeguards\" after an assisted…\n...",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_local-government-public-services/content_8.html": "Please note that many agencies and organisations have formal complaints and appeals processes. I cannot intervene or help until all these channels have been exhausted. With enquiries about local government and public services, it is best to enquire with the council first before attempting to get in touch with my office.\nYour local council can help with a range of issues.\nEmail address\nAddress\nPhone Number\nEmail address\nAddress\nPhone Number\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_my-work/content_4.html": "Result: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Failed\nResult: Motion Passed\nResult: Motion Passed",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_contact/content_14.html": "Please note that due to strict Parliamentary protocol, I am only able to make enquiries on behalf of my own constituents. To check if you live in my constituency, check your MP here.\nAs your MP I can help with a variety of issues and concerns.\nKeeping the issue private or make a personal appointment to discuss the issue. This can often go a long way to providing a solution to your issue.\nI can also help to make the issue public by raising it in the House of Commons, where it will be officially recorded, and could potentially come to the attention of the press and public.\nOutside Parliament, you can request that I speak at an event concerning your issue, pledge my support to a campaign or write to the local media on your behalf.\nMy team in Bury & North can often help without you having to attend an advice surgery. Contact my constituency office via one of the ways listed below and a member of the team will get in touch.\nEmail address\nPhone number\nAddress\nOpening hours\nEmail address\nAddress",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_imigration-visas/content_2.html": "Please note that many agencies and departments have formal complaints and appeals processes. I cannot intervene or help until all these channels have been exhausted. When all these processes have been completed, I can support an enquiry or complaint to the relevant Home Office department.\nAll cases vary. My office will ask for specific details regarding your application so we can get a quick response to your enquiry. Please also attach any important documentation regarding your case to any correspondence with my office.\nIn urgent cases, my staff will work hard to receive answers quickly from the Home Office regarding applications or urgent travel needs. Please ensure that you attach all important documentation and details to any correspondence to help ensure a swift conclusion to your enquiry.\nThe Home Office can help with a range of issues.\nEmail address\nPhone Number\nEmail address\nPhone Number\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_privacy-policy/content_18.html": "Skip to content\nHome\nFind Help\nLocal Government & Public Services\nNHS\nImmigration & Visas\nEducation\nHousing\nOther Matters\nMy Work\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nInstagram\nTiktok\nLinkedin\nSign up to my newsletter\nKeep up to date with my work as your MP.\nFirst Name\nLast Name\nEmail\nPhone Number\nI consent to receiving updates from James about his work in Bury North. I understand I can opt out at any time. See\nPrivacy Policy\nfor more details.\nSubscribe\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_update-on-assisted-dying/content_17.html": "This last week, I voted against the Assisted Dying Private Members Bill. I was honoured to be one of just 50 MPs called to speak in the debate. I expressed my concern that this Bill risks profoundly and irreversibly changing the principles of our health service and end-of-life care.\nI intend to engage in good faith with the Bill and its progress.\nFollowing the vote, I co-signed a letter to Kim Leadbeater MP, the sponsor of the Bill, Welcoming her pledge to appoint a Bill Committee representative of the range of opinions expressed in the debate. My priority now, whether you are for or against this, is that if the Bill passes into law, it must be safe and effective for its stated purpose.\nI have long championed Hospice and Palliative Care. My 2018 report as MP made recommendations agreed with by Greater Manchester NHS. End-of-life care remains a blind spot in our NHS, funded on a shoestring. We must ensure this Bill doesn’t shift focus from improving living as life draws to a close with terminal illness to simply ending life sooner.\nThe safeguards may sound rigorous on paper, but the strained state of our NHS means many patients do not have a consistent relationship with a named doctor. We are attributed to health centres rather than named doctors. Someone’s experience of this could depend on which doctor they see—one who raises assisted dying as an option versus one who does not.\nThis troubling prospect makes assisted dying risk becoming a ballot. Views on assisted dying vary widely among GPs, meaning the outcome could hinge on the doctor you see.\nThis is before considering the forces of marketing, commercialisation, and the industry that will spring up this becomes Law. Notably alarming is the argument about funding disparities: hospices receive just 30% funding while assisted dying could yet be fully funded at 100%. Casework from constituents highlights struggles to access justice, health, education support, or, worse, instances of state neglect and the failure of safeguards on paper, passed into law.\nDisability rights groups warn about the dangers of normalising assisted dying. For many, this represents not a choice but a shift undermining the value we place on protecting the vulnerable. It falls on the strongest to scrutinise this Bill.\nWe should expect more agility from our NHS. While dying is the ultimate binary experience, end-of-life care should be sophisticated and personalised. A system endorsing assisted dying risks forfeiting these expectations.\nThe debate was a high point in parliamentary discourse. It was a conscience vote, without party whipping, where MPs engaged deeply and disagreed well. I promise to continue engaging constructively with this Bill. Many will interpret my stance as a denial of its progress —it is not. It is now on the Bill to address the significant concerns many of us still hold.",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com/content_1.html": "You’ve elected me to make a difference in Bury North and to champion our town.\nMy team and I are here to resolve problems, get answers and do our best for everyone here. I’m on your side, striving for the results you need for the challenges we face.\nAs your MP, I want to ensure I represent you in any way I can. If you need my help, please visit my help pages below to learn more about how I can help you.",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_other-matters/content_11.html": "Please note that many agencies and organisations have formal complaints and appeals processes. I cannot intervene or help until all these channels have been exhausted.\nHow I can help:\nI can raise matters which impact the constituency on your behalf in the House of Commons.\nI can write to relevant departments or officials on your behalf to aid in enquiries or complaints if necessary.\nI can write to secretaries of state and other ministers regarding relevant issues once all other channels of enquiry or complaint have been exhausted.\nWhat I can't do:\nI cannot help in settling disputes between family members, neighbours, or between yourself and an employer.\nI cannot give legal advice or interfere in court cases or any decisions previously made in a court of law.\nI cannot provide any financial or business advice.",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_james-frith-mp-to-hold-event-to-help-people-maximise-their-income/content_7.html": "James Frith, Labour MP for Bury North, has organised a ‘drop in’ style surgery to enable Bury residents to check if they could be entitled to more benefits than they are currently claiming, notably Pension Credit. Age UK estimates that 1500 older people in Bury North are eligible for this benefit but not claiming it.\nMr Frith and his team will be working in collaboration with Citizen’s Advice Bury and Bolton, and Calico to offer practical advice and guidance to people looking to maximise their income for the often financially challenging winter months.\nMr Frith said: “I know that winter can be a challenging time for many people, with the cost of Christmas and increased energy bills. My team and I are here for anyone in Bury North who is struggling.\n“I’m pleased to be able to hold this drop in alongside Citizen’s Advice Bury and Bolton, Calico and Bury Council to help people work out their entitlements and make sure they are claiming what they deserve. I committed to being a proactive, accessible MP that works hard for you, and that is exactly what I have been doing and will continue to do.\n“If you have any concerns about your income and want to find out if you can access more support, myself and my team will be happy to help so come along to our drop in.”\nThe drop in will take place on 22 November between 3pm and 5pm. Attendees are asked to register their interest in attending at bit.ly/MaximisingYourIncomeBN. Spaces are limited.",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_housing/content_12.html": "Please note that many agencies and organisations have formal complaints and appeals processes. I cannot intervene or help until all these channels have been exhausted. If you live in a council house in Bury, please make your complaint directly to the council. If you live in a house owned by another housing association, please go through their formal complaints process. If you live in a privately rented house, please direct your complaint to Housing Standards at Bury Council. If you are homeless, please declare yourself as homeless to Bury Council.\nYour local council can help with a range of issues.\nEmail address\nPhone Number\nEmail address\nPhone Number\nEmail address\nPhone Number\nEmail address\nPhone Number\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_terms-of-use/content_9.html": "Skip to content\nHome\nFind Help\nLocal Government & Public Services\nNHS\nImmigration & Visas\nEducation\nHousing\nOther Matters\nMy Work\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nInstagram\nTiktok\nLinkedin\nSign up to my newsletter\nKeep up to date with my work as your MP.\nFirst Name\nLast Name\nEmail\nPhone Number\nI consent to receiving updates from James about his work in Bury North. I understand I can opt out at any time. See\nPrivacy Policy\nfor more details.\nSubscribe\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_cookie-policy/content_10.html": "Skip to content\nHome\nFind Help\nLocal Government & Public Services\nNHS\nImmigration & Visas\nEducation\nHousing\nOther Matters\nMy Work\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nInstagram\nTiktok\nLinkedin\nSign up to my newsletter\nKeep up to date with my work as your MP.\nFirst Name\nLast Name\nEmail\nPhone Number\nI consent to receiving updates from James about his work in Bury North. I understand I can opt out at any time. See\nPrivacy Policy\nfor more details.\nSubscribe\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_about/content_3.html": "You’ve elected me to make a difference in Bury North and to champion our town.\nMy team and I are here to resolve problems, get answers and do our best for everyone here. I’m on your side, striving for the results you need for the challenges we face.\nIt is an honour to serve Bury North as Member of Parliament.\nBury North is my family’s hometown. Our roots are firmly planted here. My great-grandfather was a vicar in Bury and my grandfather was born in the same place as my first two children.\nI’ve been lucky to have worked in a variety of jobs in service and across sectors. My focus has been education and social enterprise. Education and the best for young people is my passion.\nAs your MP, my team and I can achieve great results for you and your family. I cherish our constituency work; it’s the best thing about being an MP.\nI can advocate for you, amplify your voice, strengthen your team and champion your cause. If you have come to me for support, it may be because something needs changing, correcting or getting done. As your MP, I’ll make sure your problem is heard. If you’ve had to fight for your right, I can help you finish that fight.\nI want anyone who might need my help to know they can reach out to me. I will always do my best for our town and all those living and working in it.\nGrowing up, my dad was a Church of England minister and mum worked with young people leaving the care system. I grew up knowing what it meant to take responsibility to help others. Service and empathy have been ingrained in me and they are the reasons I am committed to serving you.\nI know what can be achieved by being a visible presence in the community, having the right values and being there for people when they ask for help. I know how vital support can be when you are most in need and facing difficult circumstances. Just as important is celebrating our successes and championing the best of us and our town.\nThe issues and challenges that I personally have faced give me motivation and make me determined for your causes. Whether that’s my own experiences with Special Educational Needs (SEN) or success against the odds fighting for others, I know we’re stronger standing together.\nIn and around Manchester and touring the UK\nDegree in Politics, Economics and Sociology\nWorked for education secretary\nLeader in SME\nBusiness and social enterprise All Together\nBury Council\nSenior Counsel\nBury North",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_education/content_15.html": "Please note that many agencies and organisations have formal complaints and appeals processes. I cannot intervene or help until all these channels have been exhausted. All schools are required to have their own procedure for handling complaints. The Office for Standards in Education (Ofsted) have also provided guidance about how to complain about schools. If your query is in relation to an Education Health Care (EHC) assessment, please seek assistance from the EHC Assessment and Review Team at Bury Council.\nThese organisations can help with a range of issues.\nEmail address\nAddress\nPhone Number\nPostal address\nEmail address\nEmail address\nAddress\nPhone Number\nPostal address\nEmail address\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_about-me/content_6.html": "You’ve elected me to make a difference in Bury North and to champion our town.\nMy team and I are here to resolve problems, get answers and do our best for everyone here. I’m on your side, striving for the results you need for the challenges we face.\nIt is an honour to serve Bury North as Member of Parliament.\nBury North is my family’s hometown. Our roots are firmly planted here. My great-grandfather was a vicar in Bury and my grandfather was born in the same place as my first two children.\nI’ve been lucky to have worked in a variety of jobs in service and across sectors. My focus has been education and social enterprise. Education and the best for young people is my passion.\nAs your MP, my team and I can achieve great results for you and your family. I cherish our constituency work; it’s the best thing about being an MP.\nI can advocate for you, amplify your voice, strengthen your team and champion your cause. If you have come to me for support, it may be because something needs changing, correcting or getting done. As your MP, I’ll make sure your problem is heard. If you’ve had to fight for your right, I can help you finish that fight.\nI want anyone who might need my help to know they can reach out to me. I will always do my best for our town and all those living and working in it.\nGrowing up, my dad was a Church of England minister and mum worked with young people leaving the care system. I grew up knowing what it meant to take responsibility to help others. Service and empathy have been ingrained in me and they are the reasons I am committed to serving you.\nI know what can be achieved by being a visible presence in the community, having the right values and being there for people when they ask for help. I know how vital support can be when you are most in need and facing difficult circumstances. Just as important is celebrating our successes and championing the best of us and our town.\nThe issues and challenges that I personally have faced give me motivation and make me determined for your causes. Whether that’s my own experiences with Special Educational Needs (SEN) or success against the odds fighting for others, I know we’re stronger standing together.\nIn and around Manchester and touring the UK\nDegree in Politics, Economics and Sociology\nWorked for education secretary\nLeader in SME\nBusiness and social enterprise All Together\nBury Council\nSenior Counsel\nBury North",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_local-mp-appointed-to-influential-select-committee/content_13.html": "James Frith, Labour MP for Bury North, has been appointed to the Culture, Media and Sport Select Committee.\nThis cross-party committee of MPs is responsible for scrutinising the work of the Department for Culture, Media and Sport and associated public bodies.\nIt examines government policy, spending and administration in areas relating to arts, culture, the media, and sport. The committee’s make up reflects the political balance in parliament and MPs are elected by colleagues from their own parties.\nMr Frith, who was elected to parliament in July, welcomed his appointment and said he was looking forward to starting work.\nHe said: “I’m delighted to have been elected by my peers to serve as a member of the Culture, Media and Sport Select Committee.\n“This committee will do important work in a number of areas that are of vital importance to Bury North. Not least of all the new football regulator, which is much-needed and of great significance to Bury. The ejection of Bury FC from the football league was a no fan-fault eviction and this must not be allowed to happen anywhere again.\n“I also look forward to championing the role of arts, culture and heritage in our town centres. The work of this committee, from small venues in town centres to high streets events and arts, heritage and history, will help us improve the social, economic and cultural capital of our towns, boosting prosperity and enriching life and living here.”",
  "https_www_jamesfrithforburynorth_com_/https_www_jamesfrithforburynorth_com_nhs/content_16.html": "Please note that many agencies and organisations have formal complaints and appeals processes and organisations such as Patient Advice and Liaison Service (PALS) would be able to help you navigate this. I cannot intervene or help until all these channels have been exhausted. When all of these processes have been completed, I can support a complaint to the Parliamentary and Health Service Ombudsman (PHSO) about UK Government departments and other UK public organisations. Please consult their website first for further information.\nThese organisations can help with a range of issues.\nEmail address\nAddress\nOpening hours\nPhone Number\nEmail address\nAddress\nPhone Number\nEmail address\nAddress\nOpening hours\nPhone Number\nEmail address\nAddress\nPhone Number\nMy team are available to review your situation and see what I can do to assist your matter."
}