{
  "https_joshfentonglynn_co_uk_/https_joshfentonglynn_co_uk_privacy-policy/content_2.html": "Privacy Policy\nOur contact details\nName:\nAddress:\nPhone Number:\nE-mail:\nThe type of personal information we collect\nWe currently collect and process the following information:\n- Personal identifiers, contacts and characteristics (for example, name and contact details) when the contact form is filled in\nHow we get the personal information and why we have it\nMost of the personal information we process is provided to us directly by you for one of the following reasons:\n- You filled in and submitted the contact form.\nWe also receive personal information indirectly, from the following sources in the following scenarios:\n- If you’ve given us your contact details over the phone, via email or via post.\nWe use the information that you have given us in order to keep in touch with you or send you materials pertaining to a project we might be working on in collaboration.\nUnder the UK General Data Protection Regulation (UK GDPR), the lawful bases we rely on for processing this information are:\n- Your consent. You are able to remove your consent at any time. You can do this by contacting us.\n- We have a contractual obligation.\n- We have a legal obligation.\n- We have a vital interest.\n- We need it to perform a public task.\n- We have a legitimate interest.\nHow we store your personal information\nYour information is securely stored.\nYour data protection rights\nUnder data protection law, you have rights including:\nYour right of access – You have the right to ask us for copies of your personal information.\nYour right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure – You have the right to ask us to erase your personal information in certain circumstances.\nYour right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights. If you make a request, we have one month to respond to you.\nPlease contact us at the address above if you wish to make a request.\nHow to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at the address above.\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk",
  "https_joshfentonglynn_co_uk_/https_joshfentonglynn_co_uk/content_1.html": "Together, we can win Calder Valley and make it safe for Labour\nI am standing to be Labour's candidate for Calder Valley in the next General Election ‐ and I need your support.\nI am a Calderdale councillor, cabinet member and I have lived at both ends of our constituency.\nI've been campaigning with Labour across all areas of Calder Valley for years, speaking with thousands of residents and working to address their concerns. I've built a reputation as a grafter who can make a difference.\nI have worked with others to make change, as a trade unionist, as an activist and in my professional life and I want to take that work ethic to Westminster to make our community better for everyone.\nIf you are a Labour party member, please support me in the selection to become your candidate and our next Labour MP.\nPledge your support\nIf you'd like to support my candidacy to be the next Labour prospective parliamentary candidate, then please let me know:\nMy achievements\n- As an activist, leading the campaign that forced the government to abandon plans to close Halifax A&E.\n- As a local councillor, raising £25,000 for businesses hit by a fire and working with the community to rebuild and recover after floods.\n- As a trade unionist, running a campaign with the Public and Commercial Services Union that stopped the government closing coastguard stations.\n- In my work with the End Hunger campaign I worked with MPs and successfully increased holiday hunger provision for children on free school meals.\n- As a cabinet member I made Calderdale the first West Yorkshire local authority to back a real living wage for all care staff.\nMy pledges to you\nRunning an inclusive campaign: I will work to earn the trust of all our members, whether you have been a member, or in Calderdale, for a month or 50 years. All voices are welcome in our movement.\nMaking Calder Valley safe for Labour: in 2016 I won my council seat from the Lib Dems and I was re-elected in 2021 with over 65% of the vote. I am a grafter who cares about our communities, and I will bring the same commitment and work ethic to making Calder Valley a safe Labour seat.\nBeing a full time MP for the whole constituency: I want to be an MP you are proud of and will devote myself to improving all our communities. I would have a visible high street office and a presence throughout Calder Valley."
}