{
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_accessibility/content_6.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk/content_1.html": "My latest tweets Contact me [email protected] Writing and media commentary How we can make banking better Here is a version of a recent speech that I gave to a group of Conservatives… Why the UK must avoid the pitfalls of the EU's sustainability regulations: my comments in Financial News I was quoted substantially in a recent Financial News article about the UK's… Finance is moving closer to price regulation and state intervention Here is a piece that I published in the International Financial Law Review. It…\nHow we can make banking better Here is a version of a recent speech that I gave to a group of Conservatives…\nWhy the UK must avoid the pitfalls of the EU's sustainability regulations: my comments in Financial News I was quoted substantially in a recent Financial News article about the UK's…\nFinance is moving closer to price regulation and state intervention Here is a piece that I published in the International Financial Law Review. It…",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_news/content_7.html": "How we can make banking better Wednesday, 2 August, 2023 Here is a version of a recent speech that I gave to a group of Conservatives about how we can ensure that banks better serve British society. Banks are back on the front page news. Having spent a decade and a half in the City, I'm going to talk about how we can make banking better. When most of us think about banks, we think about something esoteric: wealthy men in towers, wearing corporate... Speeches\nWhy the UK must avoid the pitfalls of the EU's sustainability regulations: my comments in Financial News 20th July 2023 I was quoted substantially in a recent Financial News article about the UK's sustainable investment regulations. You can read the full piece here. “The costs... Articles\nFinance is moving closer to price regulation and state intervention 10th July 2023 Here is a piece that I published in the International Financial Law Review. It discusses the creation of a 'consolidated tape', a technological solution to... Opinions\nBetter regulation after Brexit: my comments in CityAM 5th July 2023 Who will regulate the regulators? There are concerns that we have not yet taken advantage of Brexit: regulation remains too cautious and too burdensome, rather... Articles\nThe new UK/EU agreement on financial services is not a 'mini Remain' 27th June 2023 I was interviewed by the Financial Times Adviser about a new agreement between the UK and the EU to cooperate on financial services. This has caused excitement... Articles\nBothered about Britcoin? 21st June 2023 'Britcoin' (or the digital pound to give its official name) is a proposal by the Bank of England for a new type of money. It seems likely to happen with over... Opinions\nA benefit of Brexit: regulatory competition 11th April 2023 Here in full is an article that I wrote for FT Adviser about the prospects for financial cooperation between the UK and the EU. Since Brexit took effect at the... Opinions",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_cookies/content_9.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_me-brief/content_2.html": "- Born and raised in the South East to an English mother and a Sri Lankan father.\n- Aspiration: the first of my family to graduate with a BSc from University College London, followed by an MA and Graduate Diploma in Law; I have volunteered to help talented young people do well as a mentor and school governor among other things.\n- I know how Government works: having worked at HM Treasury on the banking interventions during the financial crisis.\n- Financial and regulatory expertise: formerly an Executive Director at JPMorgan; now at the City law firm Macfarlanes advising financial services and investment companies.\n- Media spokesman: frequently quoted in and write for the press on economic and environmental matters; you can see some of my commentary in the FT, Investment Week, Net Zero Investor and elsewhere on my news page.\n- Experienced leading campaigns as a candidate: I came second in Lewisham Deptford in the 2019 General Election and have stood for council both in and outside London.\n- Family: most important to me are Eliza, my wife, and Teddy, my son.\nMy politics derives from my life and the values of aspiration, patriotism and family.\nI aim to combine real expertise with empathy, based on my background and experience with people of all types.\nYou can find more about me on the site, or via my LinkedIn or X pages. If you want to connect, campaign or discuss, get in touch.",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_news_why-uk-must-avoid-pitfalls-eus-sustainability-regulations-my-comments-financial-news/content_8.html": "I was quoted substantially in a recent Financial News article about the UK's sustainable investment regulations. You can read the full piece here.\n“The costs will vary dramatically and it is hard to price at this stage,” said Gavin Haran, head of policy for asset management at Macfarlanes.\n“At minimum, firms will need to prepare disclosures and amend their marketing materials to be compliant. Others might need to restructure their investments to meet the qualifying criteria for a label.”\nHaran said the degree of change needed to achieve a label could vary drastically across asset classes, funds, and specific types of investment.\nHaran points out that many funds, that are currently labelled in the market as ‘impact funds’, might find it difficult to demonstrate an investor contribution, one of the requirements for securing the FCA’s proposed sustainable impact label.\n“While the fund invests in good solutions that achieve the enterprise contribution (e.g., a climate change solution), it isn’t necessarily the case that the fund’s investment will demonstrably make the outcomes 'more green' (the investment contribution),” he said.\n“Conversely, real estate funds might find it easier to demonstrate investor contribution through ‘green retro-fitting’ of existing buildings, but find it more difficult to demonstrate the enterprise contribution.”\nDespite the delays, Haran said UK asset managers seem willing to give the FCA a bit of leeway.\n“There isn’t a sense across the market that fundraising has significantly slowed or slowed due to the SDR delay,” he said.\n“Managers hope that the FCA will get it largely right first time to avoid some of the problems and revisions that the EU’s SFDR has unleashed.”",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_news_benefit-brexit-regulatory-competition/content_10.html": "Here in full is an article that I wrote for FT Adviser about the prospects for financial cooperation between the UK and the EU. Since Brexit took effect at the turn of 2021, the UK's and EU's legal systems have diverged through a natural process of \"drift\". An increasingly noticeable benefit of this divergence is regulatory competition: UK and EU authorities competing to have better rules and a better financial system (and often learning from each another's successes and mistakes). A similar process of competition between states fuelled the historical rise of Europe.\nWhat are the prospects for UK/EU financial regulatory cooperation?\nThe Brexit agreement between the EU and the UK controversially did not include any commitments on financial services, although the then prime minister Boris Johnson said it would be preferable if it had done so.\nHowever, the trade agreement was accompanied by a (political rather than legal) joint declaration committing the two sides to agree a memorandum of understanding on financial services regulatory cooperation by March 2021.\nThe MoU was duly agreed but has since existed in limbo, having not been formally signed off by the EU’s institutions.\nThe European commissioner for financial services, Mairead McGuinness, admitted that the EU is in no rush to approve the accord, evidently considering access to the EU’s single market to be a greater benefit to the UK than vice versa, given the strength of the UK’s financial services.\nThe suspicion is that market access is also a bargaining chip that the EU might trade for other priorities, not least over the trade border with Northern Ireland.\nFollowing the Windsor framework agreed between the UK and the EU on February 27, some have hoped for a thawing of relations between two jurisdictions and, perhaps, agreements on market access for financial services and products.\nNow is a good time to assess the prospects for regulatory cooperation, divergence, and the outlook for firms.\nAgreeing to disagree\nAt the time of writing, parliament is scrutinising the Windsor framework, and the government’s proposal faces some opposition.\nExperience suggests it is not wise to predict the political outcomes of Brexit, but having reached an agreement, it is fair to assume that relations between the UK and EU could improve.\nConsequently, the EU could be willing to approve the MoU on financial services – although there are two good reasons to believe that an agreed MoU will not change the course of regulatory divergence.\nFirst, the content of the MoU. A leaked draft suggests the EU/UK model for financial services cooperation is based on the EU/US model: a regularly scheduled forum for discussion.\nTalking shops can be helpful for the airing of issues, as the joint EU-US forum has proven in respect of thorny areas such as the EU’s research unbundling provisions that conflict with US rules.\nBut neither the US or UK forum have \"teeth\": the arrangements do not compel the parties to agree on shared rules or market access, but only to the exchange of views and transparency over common issues and equivalence decisions.\nIn this respect, the MoU compares unfavourably with the Comprehensive and Progressive Agreement for a Trans-Pacific Partnership (CPTPP), which the UK has announced that it will join. The CPTPP is a liberalising agreement.\nIts financial services chapter does not require signatories to adopt specific rules, but rather requires them to remove barriers that prevent CPTPP members from accessing their markets on fair and equivalent terms compared with domestic financial services. So, the CPTPP does not require the UK to become a rule-taker and it plays to the UK’s strengths in financial services, but unlike the MoU, the CPTPP does bind the parties to ensuring market access.\nSecond, the degree of regulatory drift since Brexit means the two jurisdictions have different regulations – for example, the packaged retail and insurance-based investment products regulation mandates disclosures to retail investors.\nBut there are differences in the form and content of the prescribed key information document in the EU and the UK, meaning cross-border firms must comply with two sets of rules and bear the additional costs imposed by divergence. Moreover, both sides intend to further diverge in their regulations.\nDrifting to divergence\nThe gradual emergence of differing regulations since Brexit was due to separate EU and UK institutional processes.\nThe UK has adapted inherited EU rules to suit its own needs (such as changes to Mifid II best execution reporting), and the EU has continued its process of scheduled legislative reviews (such as Mifid II and AIFMD) that are not replicated in the UK.\nIn addition, policymakers have sought to keep apace of market developments, such as in environmental, social and governance-based investing, and digital assets.\nHowever, more recently, there has been a recognition of differing policy objectives and an explicit intention to diverge from the other.\nOn the EU side, this has taken the form of protecting the EU’s markets from UK competition or, as EU policymakers would see it, third-country firms seeking to access the EU while undercutting its rules.\nThe focus has been on the delegation of portfolio management from the EU to the UK within the AIFMD and UCITS legislation, and the marketing arrangements permitted under Mifid II, such as offshore firms using tied agents and secondments to sell their products in the EU.\nIn both instances, the EU has settled on more transparency about firms’ arrangements rather than hard limits.\nInterestingly, these negotiations have unveiled conflicts between EU member states – such as France, which wishes to grow its financial services status – and international hubs such as Luxembourg and Ireland.\nMeanwhile, the UK has a political imperative to demonstrate \"Brexit dividends\" and an acceptance that EU passporting rights are unlikely to be granted.\nThe Edinburgh reforms announced in December 2022 address various regulations; some, but not all, derived from the EU, such as short-selling and securitisation rules.\nThe government has clearly sought to tip the balance towards economic growth and away from the regulators’ customary risk aversion.\nThis too has provoked internal conflicts between the government and regulators over Solvency II reforms and the Financial Conduct Authority’s upcoming consumer duty.\nThe financial services and markets bill, which will soon be finalised, will scrap all on-shored EU financial services legislation and will require the FCA and Prudential Regulation Authority to copy, amend, or scrap each rule.\nThe FCA has responded with a review of its asset management regime, contemplating changes to AIFMD and Ucits rules. Expect more conflict between the government and regulators over the direction of policy, particularly considering recent bank failures and market instability.\nWhere does this leave us?\nThe first big test of the \"new\" relationship between the EU and UK will be the overseas funds regime, which is due to begin this year, granting permanent access to EU Ucits funds that pass the UK’s tests.\nThe Treasury will decide whether Ucits are equivalent in regulatory terms (which seems likely), although the FCA might decide to impose additional conditions.\nWe are already seeing the FCA impose these additional requirements on overseas managers seeking permission to market their funds in the UK; for instance, demands to comply with UK value assessment and ESG expectations.\nA toothless and still-to-be-finalised MoU and an increasing level of regulatory divergence means firms should not expect comprehensive agreements to align rules or grant passporting rights.\nCosts will increase for cross-border firms because of the need to comply with two sets of rules, although the UK’s efficiency drive might ease burdens on onshore firms.\nRegulatory competition is the new order. This could lead to better rulemaking as each jurisdiction seeks to improve on the other (we already see this in the UK's learning from the EU’s challenges in the Sustainable Finance Disclosure Regulation and the EU looking at the UK’s experience with value assessments and an inducement ban).\nBut firms will navigate an increasingly complex and costly regulatory environment.",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_news_how-we-can-make-banking-better/content_4.html": "Here is a version of a recent speech that I gave to a group of Conservatives about how we can ensure that banks better serve British society.\nBanks are back on the front page news. Having spent a decade and a half in the City, I'm going to talk about how we can make banking better.\nWhen most of us think about banks, we think about something esoteric: wealthy men in towers, wearing corporate costume, doing a mysterious kind of magic.\nThe stereotype is not entirely misplaced. The City of London is on our doorstep but few of us know what it really does.\nIn reality, finance is our lifeblood.\nWhen my wife and I wanted a home with our one year old, we had to borrow the money for a mortgage.\nWhen most people start a business, they must borrow the money from somewhere to do so.\nWhen we save and hope to retire one day, we do so through the mechanism of finance.\nThe City pays enough tax to fund the NHS.\nBut things have gone wrong.\nThe price of two loaves of bread today would've bought you three loaves just over a year ago.\nOn average, we haven't had a wage increase for going on two decades.\nEconomic growth - new business - is close to zero.\nWe have to look behind the magician's curtain to see what's happened.\nThe big secret is that banks conjure money out of nothing. The original bankers, the goldsmiths, realised 500 years ago that they could create credit through IOUs, loans.\nBut where does the money go today?\nMostly to old business, to existing assets, to inflate prices, the stock market, and a lot of it trickles around the financial system like a closed pipe. It is safe but not very beneficial to society.\nWe must ensure that banks lend to new business, to new assets and growing businesses. That is how we get growth going, wages up and inflation down.\nThis means more banks, not fewer, and more competition. We need a genuine free market in money and credit.\nSo there you have it: the magic. What banks do, what went wrong, and how we can make banking beneficial for everyone.",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_cdn-cgi_l_email-protection/content_3.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_gavinharan_uk_/https_www_gavinharan_uk_news_finance-moving-closer-price-regulation-and-state-intervention/content_5.html": "Here is a piece that I published in the International Financial Law Review. It discusses the creation of a 'consolidated tape', a technological solution to improve trading, that is underway in the EU and in the UK Government's plans. I outline some of the challenges and the consequences: regulators taking more powers to intervene in prices and the state taking a larger role in private markets.\nThe Consolidated Tape is a turning point for financial regulation\nThe consolidated tape is the ghost that has haunted European capital markets since pan-European regulations were conceived.\nThe United States introduced its consolidated tape (the Trade Reporting and Compliance Engine or TRACE) for corporate bonds in 2002. European policymakers have long envied TRACE with a weight of symbolism: a proper Single Market should be capable of creating a pan-jurisdictional trading system with a single source of price discovery and trade reporting.\nIn 2007, the original MiFID took steps to creating a single capital market regime, but at the same time, the regulations embedded the status of national exchanges, and with it, the fragmentation of market data. MiFID II sought to address some of these issues in 2014, making it possible for regulators to approve a consolidated tape provider (CTP). However, several practical and commercial barriers mean that a pan-EU consolidated tape has not yet become a reality. Although that looks set to change.\nThe EU is close to reaching a final agreement on the reforms to MiFID II that will seek to make the creation of a consolidated tape likely. The big question is whether the agreement will achieve the hopes of many in the market, exorcising the fears of fragmentation once and for all, or whether the regulations will fall flat.\nRegardless, reaching a political agreement on this long-standing issue signals a broader shift in financial regulation – a shift closer towards price regulation – and broader trends in macro-economics, away from public versus private sector and towards more public-private cooperation.\nIs a consolidated tape needed?\nA consolidated tape is an electronic ticker tape, a system for near real-time data about trades conducted on public exchanges, and the information is disclosed to market participants. Increased transparency about the price and volume of trades means that participants are better able to analyse the market and seek out the best trades. In turn, this means reduced liquidity risk and settlement risk for market participants, and an improvement in the allocation of capital to the class of assets covered by the consolidated tape.\nIn the EU, a consolidated tape could also help overcome the previously mentioned problem of fragmentation by facilitating higher levels of cross-border trading.\nThe benefits will be broadly commensurate with how comprehensive, standardised, and consistent the consolidated tape is and how close to real-time the data that market participants receive is. As we will see, both criteria are crucial to evaluating whether the EU and the separate UK policies will achieve their aims.\nA consolidated tape could be created for equities, fixed income, derivatives, or any or all these asset classes. Some studies suggest, based on the evidence from the US, that the economic benefits would be greatest for fixed income. This is because trading in debt is more opaque than trading in shares, with a greater proportion of trades occurring OTC and not on public exchanges.\nThe creation of a consolidated tape has several broad requirements: technical, governance, and most importantly, the commercial incentives. Regulation can clarify these requirements and provide an incentive for market participants to create a consolidated tape – but for good reasons, governments themselves are not willing to create and administer a consolidated tape as a public utility.\nWhile there are economy-wide benefits in more efficient trading, cross-border trade and economic growth, the creation of a consolidated tape is disruptive to the current market. There are costs for some businesses, not least the large national exchanges, and regulators must find a way to address and allocate those costs.\nThe end stage: economic trade-offs\nAt the time of writing, the EU’s institutions are hammering out a compromise text that would become law.\nThe EU’s proposals address issues relating to the administration of CTPs, their organisation and reporting requirements, such as data collection and harmonised reporting by entities such as trading venues and investment firms to the CTPs. The reforms have run into challenges in commercial incentives.\nAsset managers and institutional investors have, unsurprisingly, been enthusiastic supporters of the consolidated tape. Investors are currently hampered by the high costs of accessing market data, partly due to opacity and a lack of competition in the provision of market data. The provision of data in a standardised format to a CTP should resolve some of these issues, making market data cheaper and more accessible to investors. However, trading venues make money from market data. Under the new regulations, these exchanges would be required to hand over their data to a CTP.\nThe regulations envisage revenue sharing models, but it is not clear how these models would work and how the interests of the various participants should be remunerated. The asset managers insist that market participants would access the consolidated tape on a fair commercial basis, thereby ensuring that the exchanges are paid. But the trading venues are understandably cautious about losing a non-trivial revenue stream. The challenges around pricing and remuneration reflect broader issues around governance of the consolidated tape; namely, balancing the rights and responsibilities of the different parties involved.\nAs we reach the end stage, the Member States in the European Council are backing their national exchanges. A proposed solution is for a delayed tape, encompassing only post-trade data. This would preserve value for the exchanges, but critics say that moving away from real-time reporting would undermine the value and purpose of a consolidated tape.\nNonetheless, a consolidated tape for equities is likely with several groups of exchanges preparing to bid for the CTP license. The question is whether its form will be closer to the demands of investors or of the trade venues.\nBroader trends\nThe creation of a consolidated tape illustrates several more general points:\n- Price regulation edges closer. While regulators have traditionally avoided the perception of being price regulators, the consolidated tape has forced them to wade into commercial incentives and fee models. Elsewhere, we are seeing the concept of “undue costs” being introduced into fund regulation, while the cost of living and economic conditions tighten.\n- Regulatory competition is a reality in Europe. While EU policymakers look to the US consolidated tape, the UK Government has committed to its own version “by 2024” and is seeking to learn from the EU’s policy dilemmas. UK policymakers are said to favour allowing multiple CTPs, promoting competition within each asset class, but critics argue that this would lose the benefits of a single source for data. Elsewhere, we have seen the EU propose its own version of the UK’s product value assessment and an inducements ban, while the UK is designing its own take on the EU’s sustainable finance regulations.\n- Macro-economic shifts are underway, more than a decade after the global financial crisis. In economic theory, classical fundamentals like the efficient market hypothesis are increasingly under attack. In practice, governments are becoming more willing to intervene in markets and co-operate with private businesses (e.g., the large subsidies in the US Inflation Reduction Act or the smaller co-investment proposals in the UK’s Long-term Investment for Technology and Science). However, a significant intervention in markets such as creating a CTP – effectively a monopoly – provokes a trade-off for policymakers, whether to favour current incumbents or to open up the prospects for broader, longer-term economic growth."
}