{
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_joe-lynch-selected-to-stand-in-piccadilly-ward/content_37.html": "Joe Lynch selected to stand in Piccadilly Ward\nJoe Lynch is proud to have been selected again as the Liberal Democrat candidate for the Piccadilly Ward.\nJoe joined the Liberal Democrats in 2017 after Jeremy Corbyn supported Theresa May in whipping the vote to enact Article 50 without a clearly defined strategy in place, a process which has been disastrous.\n\"For years I've had friends and family tell me that I should enter politics and that `I'd vote for you`, but I'd always dismissed that encouragement because I don't want to be in the public eye and I'd assumed that the people in charge nationally and locally ultimately had more experience and sense even if their public image suggested otherwise. Now though it's clear that, despite some notable exceptions, that just isn't the case.\n\"My job as an IT systems administrator requires me to juggle resolving problems that have come up, and making structural changes to systems where there is an underlying root cause to repeat issues, all whilst keeping in mind that `everything is connected` and that a change in one place might trigger something problematic somewhere else. I also have to translate requests for things people say that they want in to something that's actually deliverable, often by trying to rephrase the request in to finding out what it is that they're trying to achieve and then using my expertise and the expertise of other people who know better than me to design, test and implement a system that works. It's exactly the sort of approach that I think is needed in politics.\n\"I want to bring fresh thinking to a council dominated by a Labour party quick to close ranks in the face of any criticism and dismissive of any suggestion that this city could be run better. I want to make sure that the voices of the people who live in the city centre and who run small businesses here are heard and taken seriously, instead of only listening to property developers at industry junkets over drinks in Cannes. I want to see the city deliver 20% affordable housing in every development, and not celebrate 5% in one tower after years of delivering nothing as a success. I want to stand with Greater Manchester Housing Action and Liberty in opposing the Public Space Protection Order for part of the ward; we need to do something but granting sweeping powers that are ripe for misuse is not the way, and the current boundary would just shift the focus of the problems from Piccadilly Gardens and Chinatown in to Angel Meadow.\n\"Most of all though, I want to prove to those councillors who believe that bullying and intimidation is acceptable that there's a better way to get things done. I give everyone my word that I'll do everything that I can to work constructively with the other ward councillors and anyone in the Labour group to advance policies that are good for Piccadilly and for Manchester as a whole, but that I won't be afraid to stand up and offer constructive criticism of plans that could be improved or to solidly oppose anything that I think is wrong.\n\"I live in the city centre and so I've got skin in the game. This isn't a stepping stone for me on my career path to Westminster, I just want to do my part to make the city I've adopted as my home a better place for all of us. I hope that you'll give me your vote on 2nd May. If you want to contact me to ask me anything or to support my election campaign you can reach me via Twitter @joeykins82 or email me joe (at) piccadillylibdems (dot) org (dot) uk [top IT tip - you should avoid putting your email address directly on a website because it's a surefire way of opening yourself up to spam].\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_liberal-democrats-will-build-a-brighter-future-for-young-people-in-manchester-and-salford/content_22.html": "Liberal Democrats will build a brighter future for young people in Manchester and Salford\nLiberal Democrat candiate for Blackley and Broughton, Iain Donaldson, has welcomed proposals to more than double spending on youth services in Manchester and Salford from £ 4,800,000 to £ 10,583,442 to help tackle rising levels of crime/knife crime.\nThis would form part of a total ring-fenced fund of over £ 64 million for Local Authorities across England to spend on youth services, providing young people with positive, safe and healthy alternatives to gangs.\nUnder the Conservatives, council spending on youth services has been cut by £300 million - or 40 per cent - since 2015 across England, whilst knife crime has risen by 80% over the same period, with a record high of 47,500 offences recorded in the year to June 2019. Research by the All-Party Parliamentary Group on Knife Crime has found the areas with the biggest cuts to youth services have seen some of the biggest increases in knife crime.\nKnife crime has risen by 80% and homicides by 26% between 2015 and 2018. Police recorded over 47,500 offences involving knives or sharp instruments in England and Wales in the year to June 2019. The Liberal Democrats would take a public health approach to tackling youth violence, modelled on the successful approach taken by Scotland's Violence Reduction Unit. This would involve identifying risk factors and treating them early on, with youth workers, police, teachers, health professionals and social services all working closely together to prevent young people falling into gangs and violence.\nThe Strathclyde Police established Scotland's Violence Reduction Unit in 2005. The unit works with health, education and social work agencies to bring about long-term societal change and provide those involved with gang crime a positive alternative. Violent crime in Scotland has halved over the past decade while in Glasgow, while the number of hospital admissions for stabbings has fallen by 62%.\nIain Donaldson stated that \"Too many people in Manchester and Salford feel unsafe walking down their own streets, but for years, Conservative and Labour Governments have been competing to seem tough on crime, without doing enough to actually prevent it. With a Liberal Democrat government, young people will have the support and opportunities they deserve, our local communities will be stronger and people here will feel safer.\"\nFor more information visit:\nwww.preventknifecrime.co.uk/news/\ncivilservice.blog.gov.uk/2018/05/24/tackling-knife-crime-in-scotland-10-years-on/",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_frack-off/content_21.html": "FRACK OFF!\nManchester Liberal Democrats environment spokesperson, Dr Jackie Pearcey, has welcomed moves today led by Liberal Democrats MP Wera Hobhouse calling for an end to fracking because of its adverse impact on the environment and its incompatibility with tackling the climate crisis.\nAfter gaining her PhD Jackie Pearcey took part in a project to work out what would happen with long-term nuclear waste repositories under various points in the North of England and told us that \"The problem was that the ground water would always get in and would always get up to the surface. Fracking will contaminate the groundwater and this will get to the surface.\"\n\"Not only does fracking damage our environment and bring with it the potential threat of earthquakes, water pollution and green spaces being transformed into industrial landscapes, it also damages important geology that could be used for generating clean renewable energy using heat synch technology.\"\nThe debate comes hot on the heels of the #FridaysForFuture movement which saw Swedish student Greta Thunberg inspire hundreds of thousands of school pupils across the world to strike in aid of tackling climate change, including in the UK.\nSpeaking ahead of the debate, Liberal Democrat Climate Change Spokesperson Wera Hobhouse said: \"Since the Conservative Government's proposals on shale gas were announced, 300,000 people have signed petitions against their plans and forty councils have passed motions to reject them. They rightly demand better and it would be criminal to ignore them.\"\nJackie added \"The Liberal Democrats have a long history of opposing fracking, and here in the North Liberal Democrat scientists have helped fight the cause of local communities in the courts against fracking. We are categorically against fracking, and the damage it would inflict on our environment.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_manchester-labour-rejects-lib-dem-call-to-end-two-child-benefit-cap/content_7.html": "Manchester Labour Rejects Lib Dem Call to End Two-Child Benefit Cap\nManchester Liberal Democrats are dismayed that Manchester Labour will not join them in calling for an end to the cruel Tory policy of the two-child limit on Universal Credit and Child Tax Credit, which affects approximately 1.4 million children across the UK (CPAG), at a meeting of Manchester City Council's full council on Wednesday 10 July 2024.\nCouncillor Alan Good said: \"I'm disappointed that Manchester's local Labour councillors have refused to back calls for this simple change that would make a huge difference to child poverty in Manchester. One in five children in Manchester live in a household affected by this cruel policy.\n\"Now, more than ever, families need support in the cost of living crisis. The Prime Minister must not delay support and lift the cap.\n\"Recent evidence indicates that removal of the two-child benefit cap could lift 250,000 children in the UK out of poverty with immediate effect.\"The Liberal Democrats condemn the continuation of this cruel Tory policy.\"\n### ENDS ###\nNotes to editors:\n-\nNumber of Affected Households: Approximately 1.1 million households in the UK are affected by the two-child limit policy on Universal Credit and Child Tax Credit (Child Poverty Action Group (CPAG), April 2022 report).\n-\nChildren Affected: Around 1.4 million children live in households impacted by the two-child limit policy (Child Poverty Action Group (CPAG), April 2022 report).\n-\nPoverty Reduction: Research by the Child Poverty Action Group (CPAG) indicates that removing the two-child limit could lift around 250,000 children out of poverty (Child Poverty Action Group (CPAG) and Policy in Practice, analysis report).\n-\nFinancial Impact per Family: Families affected by the two-child limit lose up to £2,935 per year for each child beyond the first two (Child Poverty Action Group (CPAG), April 2022 report).\n-\nRegional Impact: In Manchester, approximately 20% (one in five) of children live in households affected by the two-child limit policy (Greater Manchester Poverty Action, report on local impacts).\n-\nCost of Living Crisis: The ongoing cost of living crisis has exacerbated financial pressures on families, making the support provided by benefits more crucial (Source: Office for National Statistics (ONS), 2023 report on inflation and cost of living).\nSubmitted motion to 10 July 2024 Council\nNotice of Motion - Tell Kier Starmer to Scrap the 2 child benefit cap\nThe two-child limit on Universal Credit and Child Tax Credit was introduced in April 2017 by the Conservative government and prevents families in need from claiming targeted financial support for more than two children.\nAs of 2024, families receive £3,455 a year for their second child under the child element of Universal Credit, and families subject to the cap lose out on this amount per year for each subsequent child. The policy has been widely regarded as a principal driver of child poverty.\nThis Council notes that:\n- Manchester has one of the highest poverty rates of any local authority in the UK.\n- Children who grow up in poverty are more likely to experience mental health issues, poorer educational attainment, and worse job opportunities later in life.\n- A new report by the Commons Education Select Committee warns mental health problems and cost-of-living pressures on families are among the complex reasons for increased absenteeism at school.\n- As of 2022, 20% of all children in Manchester are living in a family affected by the two-child limit, with over 7,100 households affected.\n- Manchester Council has a duty to advocate for these families in need, and a duty to pressure the government of the day to pursue welfare policies that alleviate poverty and the causes of poverty.\n- 250,000 children would be immediately lifted out of poverty upon removal of the policy, according to the Child Poverty Action Group.\nThis Council also notes that:\n- The Institute for Fiscal Studies has reported that in the next year, 250,000 extra children are likely to be affected by the policy, and by the end of the next Parliament, an extra 670,000 children will likely be affected.\n- The upfront cost of removing the two-child limit will be approximately £3.4 billion a year in the financial year 2024/25 according to the IFS, which amounts to roughly 3% of the total working-age benefit budget.\n- The impact of the two-child limit policy has disproportionately impacted Muslim and Jewish communities more than any other faith group.\n- The then-Labour MP for Manchester Gorton, Afzal Khan, highlighted the impact of the two-child limit on Manchester’s Muslim community at a recent House of Commons debate.\nThis Council supports:\n- Further research into potential savings on the long-term costs of removing the two-child limit, which the Institute for Fiscal Studies suggests may reduce as overall life outcomes improve.\n- Wider work in the community to alleviate poverty, for example, improving access to jobs with good wages and reducing the levels of unclaimed benefit when there is entitlement.\nThis Council therefore resolves to:\n- Oppose the two-child limit on Working Tax Credit and Universal Credit.\n- Ask the Leader of the Council to write to the Prime Minister to highlight the impact the two-child benefit cap has had in Manchester, and request the policy be scrapped.\nProposed by Councillor Good (Lib Dem), seconded by Councillor Leech (Lib Dem) and supported by Councillors Abdullatif (Independant), Johnson (Green), Kilpatrick (Lib Dem), Northwood (Lib Dem), Nunney (Green) and Wiest (Green).",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_campaigns_give-pep-guardiola-freedom-of-the-city/content_17.html": "Pep Guardiola should be given Freedom of the City\nTonight's Champions League victory is historic. With both English treble winning teams coming from Manchester, Manchester Liberal Democrats are calling on Pep Guardiola to be join Sir Alex Ferguson to given Freedom of the City of Manchester. Will you join us?",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_liberal-democrats-demand-better-public-transport/content_34.html": "Liberal Democrats demand better public transport\nManchester is losing out thanks to Labour's poor management of our transport systems and the failure of successive Conservative and Labour Governments to invest in Northern Transport systems.\nHybrid busses should now be running on all our bus routes, we should have an integrated bus tram and rail ticketing system and our public transport network should be properly integrated.\nIf the North had had our fair share of funding for the last 5 years we would be half way to the total electrification of our rail network.\nJackie Pearcey stated \"Manchester deserves a first class transport network, not the second rate system being delivered by Labour.\"\n\"Labour will of course blame Government cuts for the problems in our transport network, and in part they are right, the North gets much less investment per capita in transport than London, but surely the routes we do have could be better managed and planned.\"\nLiberal Democrats are committed to providing smart and strategic investment in our transport system. Using funds that are available to the Council we will build a transport network that meets the city's needs.\nJackie added \"Some of the £50 million Manchester Airport dividends could be used to establish a SmartTransport Development Fund dedicated to offsetting heavy carbon transport.\"\nWe will invest in dedicated cycle highways giving riders somewhere safe to use, making routes clearer and more direct across the city - not just in and out of the centre.\nWe believe the Airport Dividend should be used to make Manchester the greenest city in the UK, putting the return on the investment back into fighting air pollution in our city.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_the-liberal-democrat-priority-would-be-to-tackle-homelessness-not-failing-fountains/content_64.html": "The Liberal Democrat priority would be to tackle homelessness, not failing fountains!\n£ 1.2 million spent on restoring failing fountains whilst people are living on our streets.\nWhen more people than ever are sleeping rough on our city's streets we need a Councillor who will fight against Labour spending millions of pounds on pet projects such as fancy fountains and arts centres whilst people starve on our streets.\nManchester's Labour Bosses, backed by Gorton and Abbey Hey's Labour Councillors have spent £ 1.2 Million fixing failing fountains.\nHad that same amount been spent on Liberal Democrat priorities we could have housed every single person sleeping rough in Manchester for an entire year.\nWe could also have given them a hot meal, a warm shower and access to a support worker.\nThat's not cuts, it's incompetence.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_mcr-lib-dems-secure-best-local-elections-result-in-10-years/content_30.html": "MEN: 'Mancs accept me for who I am - just look at Corrie's Hayley', says city's first trans councillor\nThe M.E.N.'s Ethan Davies sits down with new councillor Chris Northwood on how she came to be a history-maker.\nManchester Liberal Democrats celebrate a fantastic set of local election results this year, securing two more councillors and doubling our representation on Manchester City Council. This achievement was made possible thanks to the dedication and hard work of our candidates and campaign teams, members and supporters, and residents who put their trust in us to deliver.\nWe would like to express our gratitude to all of our candidates and teams for their incredible work and congratulate Councillor Richard Kilpatrick, who rejoins Councillor John Leech for Didsbury West after a two-year absence, and Councillor Chris Northwood, who secured a 355 vote majority to join Councillor Alan Good in Ancoats & Beswick, an incredible result after narrowly losing by 98 votes in 2022.In his victory speech, Cllr Kilpatrick thanked Lib Dem colleagues for their support during the election campaign. He said:\n\"For me, this is a local victory. This is a victory for someone who comes from the community, who works hard for the community and even after we lost this seat and I lost my seat back in 2021, I don't give up – the Liberal Democrats do not give up.\n\"We will continue to fight hard across Manchester. We've made two incredible gains today and we will be an opposition party here in Manchester.\n\"I want to thank all the voters in Didsbury West who consistently believe that this city is desperate for opposition, that this city and Didsbury itself deserves local representation and a hard working local team.\"\nCllr Kilpatrick\nSpeaking to Manchester Evening News after her win, Cllr Northwood expressed feeling 'overwhelmed' and 'honoured'. She praised the communities of Ancoats & Beswick, describing them as 'loving' and 'caring', and seeking representatives who care about their locality. She said:\n\"Manchester's a very metropolitan and diverse city. I think at the moment given the wider trans discourse can be quite hostile towards us, it's great that I'm able to stand up and say here I'm a whole person, I'm not just a trans woman.\"\n\"I care about my community and everything like that. That's something I'm able to do, but also reflect who I am as well as a new and more diverse voice on the council.\"\nCllr Northwood\nNationally, the Liberal Democrats also achieved gains from the Tories primarily in many areas across the country, indicating that people are starting to recognize the party's positive message. This is a proud moment for Liberal Democrats everywhere, and everyone who campaigned and supported us should be proud of what they have achieved.\nManchester Liberal Democrats would like to thank everyone who supported and placed their trust in our candidates and the local party to deliver a better and fair deal for residents across Manchester.\nThe final make up of Manchester council after the 2023 local elections is:\nLabour: 88 (-3)\nGreens: 4 (+1)\nLib Dems: 4 (+2)\nElection results - Manchester City Council local elections 2023",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-4/content_19.html": "Fighting to breathe\nHyde Road is already one of the most polluted roads in Manchester, yet the Council is trying to create even more traffic along Hyde Road with the widening scheme.\nHyde Road is already one of the most polluted roads in Manchester, yet the Council is trying to create even more traffic along Hyde Road with the widening scheme.\nJackie Pearcey has hit out at the traffic chaos which is likely to be caused in Gorton for months due to the Hyde Road widening scheme.\nAs well as campaigning over those 31 years to get potholes and pavements fixed and dogshit removed, Jackie has also campaigned:\nLast year the Council received £100 million for road improvements from the Government, but under spent by a quarter despite our roads being in the worst condition for decades. That isn't cuts, it's incompetence.\nThis council is directly responsible for the lack of affordable housing in Manchester. Liberal Democrats demand affordable homes and an end to homelessness in Manchester.\nManchester is losing out thanks to Labour's poor management of our transport systems and the failure of successive Conservative and Labour Governments to invest in Northern Transport systems.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_search/content_11.html": "Manchester Liberal Democrats Annual Dinner 2025 📅 Date: 4th April 2025 ⏱️ Time: 6:30pm for 7pm 📍 Location: Denton Golf Club, Manchester Road, Denton, Manchester, M34 2GG. There will be an…\nCllr Chris Northwood speaks to The Mill's Mollie Simpson about her journey as Manchester’s first openly trans councillor. She reflects on representing the trans community, tackling local politics,…\nWhat do you think of the Ancoats safer streets scheme? 3192 You can also get in contact with Alan and Chris to share detailed thoughts by email to agood@mcrlibdems.uk and…\nLast weekend, all four of our city councillors and fellow members from across the city travelled down to Brighton for this year’s annual Autumn Conference. On the back of great local elections across…",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_labour-s-latest-sacred-cow-under-attack-from-the-arts-world/content_62.html": "Labour's latest sacred cow under attack from the arts world\nManchester's Labour bosses stand accused of paying lip-service to making buildings disabled accessible as they fail to include suitable wheelchair access in the planning conditions for their latest sacred cow, a £ 112 million arts centre, to be called \"The Factory\" on the site of the former Granada Studios.\nThe board overseeing the new development have drawn criticism after failing to feature a single qualified architect and as a result the project has already been hit by a number of push-backs including a £1.65m overspend on redesigning the theatre to rectify acoustics problems before a single brick was laid.\nIn a letter from the Theatres Trust, consulted in its capacity as the national advisory body for theatres, which said revised designs raised serious concerns over the standard of wheelchair access.\nConcerns were raised over the separation of wheelchair users from ambulant user when entering and leaving the theatre, and how wheelchair users and people who need assistance would be evacuated in an emergency. The plans also reveal that there is only one wheelchair-accessible toilet within the entire theatre.\nIn its letter to the council the Theatres Trust emphasised that \"We would expect access provision within a new build theatre of such high profile to reflect current best practice.\"\n\"We would also expect a new theatre to provide inclusive access for wheelchair users allowing them the same journey from entrance to seat as ambulant members of the audience, but this is not reflected within current plans.\"\nWhen the revised planning application went to Committee, Manchester's Labour bosses did not permit the Liberal Democrat opposition to ask questions.\nThe new centre which is being built to host the Manchester International Festival once every two years has already come under criticism for the substantial financial burden it will add to the budget of a City which is unable to house it's homeless or provide decent services for it youth. There are also serious concerns amongst community arts groups that the centre will suck in all the arts funding that comes to the city, leading to them being underfunded and facing closure.\nLiberal Democrat Lead Campaigner for Deansgate Ward, John Bridges, observed that \"These are not minor details - these are serious design flaws that developers must be held to account on.\"\n\"This is the second time that the design has been wrong, and each time it is costing millions of pounds of council tax payers money to put it right. Not allowing Liberal Democrats to question developers on these critical issues is really worrying as it politicises the planning committee and brings the whole decision-making process into disrepute.\"\nThe proposed opening of the centre, to be called \"The Factory\" has already been delayed by a year until September 2020.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_update-from-autumn-conference-2024/content_25.html": "Update from Autumn Conference 2024\nLast weekend, all four of our city councillors and fellow members from across the city travelled down to Brighton for this year’s annual Autumn Conference. On the back of great local elections across England, and the historic general election victory - which saw the 72 Liberal Democrat MPS elected, the largest ever in the party’s history - we have officially reasserted ourselves as the third largest party in the House of Commons.\nAhead of the conference, the City Centre Team came together to review the proposed motions, consider amendments, and also decide on submitting an emergency motion for debate. We submitted five amendments to motions, four of which were selected, along with an emergency motion on Winter Fuel Allowance. Although our emergency motion wasn’t selected, it gained substantial support. You can read the full motion here and view all motions here.\nLike many conferences we saw lots of new speakers, including Councillors Alan Good, Luke Allan, and Chris Northwood, delivering their maiden conference speeches.\nF16: National Nature Parks\nLuke Allan and Councillor Chris Northwood presented our amendment to F16, which focused on protecting public Rights of Way to ensure national parks remain accessible to everyone. Luke highlighted the alarming decline in the UK’s natural environment, noting that woodland coverage is less than half the European average. He stressed the importance of safeguarding access to green spaces such as the Yorkshire Dales.\nChris further emphasised the need to protect these areas, not just for leisure, but for the well-being of all, particularly for those living in urban settings. The amendment passed with near-unanimous support, gaining endorsements from MPs Tim Farron and Jess Brown-Fuller.\nA special thank you to Charles and Maria Turner for drafting the amendment, which saw such dedicated support.\nF18: Topical issue discussion\nThis session focused on Labour’s Economic Policy and the Foundations for Long-Term Prosperity.\nCouncillor Richard Kilpatrick delivered a passionate critique of Labour's economic policies, accusing them of maintaining austerity measures despite previous promises to end them. He highlighted policy failures, including the refusal to scrap the two-child tax credit cap and cuts to the winter fuel allowance.\nRichard argued that Labour’s approach closely mirrors Tory austerity, with \"fiscal prudence\" masking regressive actions. His speech resonated with widespread dissatisfaction to Labour’s economic strategy.\nF33: Tackling the Prisons Crisis\nJohn Bridges led our amendment to F33, advocating for the expansion of restorative justice schemes as a meaningful alternative to short-term custodial sentences. He underscored how crime disproportionately impacts disadvantaged communities and called for greater victim involvement in the justice process.\nJohn highlighted the Liberal Democrats' long-standing support for restorative justice, calling for more resources to be allocated to these schemes. The amendment was passed with strong support, including from the motion's mover, Josh Babarinde MP.\nF39: The Clean Water Authority\nCouncillor Alan Good addressed water pollution, condemning water companies for discharging sewage into our rivers and canals. He pushed to strengthen the motion by proposing measures to tackle pollution at its source and hold companies accountable. Alan also raised concerns about industrial chemical spills and air pollution, calling for stronger protections for water quality.\nHis amendments ensured the motion covered pollution from multiple sources, and it passed with solid backing.\nInterested in drafting policy and amendments for future conferences?\nKeep an eye out for upcoming events. As a party, we have two key opportunities each year: Spring Conference and Autumn Conference. Additionally, each region holds its own conferences where motions are also passed.\nFederal\nFind out more about our federal conferences\nRead our policy motions\nRegional\nLearn more about our North West Regional Conference\nRead our North West Region policy motions",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_give-the-people-the-final-say-on-brexit-1/content_72.html": "Give the people the final say on Brexit.\nNational campaign group Best for Britain and Manchester's Opposition Liberal Democrats, are calling on the City Council to pass an official policy motion in support of a the final say on the Brexit deal.\nIn the referendum in 2016 Manchester voted by a large majority to remain in the European Union, and with thousands of jobs in the City under threat, and EU Grants that have helped rebuild the city no longer available, Manchester will be much worse off out under any Brexit deal.\nIn an email from Best for Britain, their Regional Campaign Coordinator, Charles Gibson said: \"It is now more important than ever that we keep up the pressure on Councillors in Manchester and let them know that we want them to stand up for a people's vote.\"\nOxford and Liverpool councils have already approved motions supporting a people's vote and Leicester Council will do so next month. Liberal Democrat group leader on Manchester City Council, John Leech said: \"I have always supported a people's vote and in the next council meeting I will ask Manchester Council to pass a motion of support.\"\nLiberal Democrat Lead Campaigner for Deansgate Ward, John Bridges added that \"Manchester is an open, tolerant, outward-looking, proud and patriotic city that voted to remain with its European neighbours. Manchester's Labour bosses need to recognise this and start standing up for local people by supporting a referendum on the Brexit deal which has been Lib Dem policy for over two years now.\"\nWhen Britain voted marginally to leave, there was no opportunity to vote for a destination and Liberal Democrats will not stand by and watch Manchester suffer for something we didn't vote for.\nIn the local elections in May 2018 UKIP received just 1% of the popular vote, officially Manchester the most anti-Brexit area for the anti-EU party anywhere in the country.\nJohn Bridges added that \"It is high time that Manchester's Labour councillors stood up to their Labour Leader and told him how this City feels about Brexit. In the mean time the Liberal Democrats will continue to campaign to give the people the final say on the deal.\"\nPlease complete our survey on Britain's place in Europe HERE!",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_liberal-democrats-select-iain-donaldson-to-fight-blackley-and-broughton/content_35.html": "Liberal Democrats select Iain Donaldson to fight Blackley and Broughton\nManchester University Research Administrator and Former City Councillor for 19 years, Iain Donaldson has been selected by the Liberal Democrats as their Candidate for the Blackley and Broughton Constituency to challenge the Labour Party's arch-brexiteer and climate change denying MP.\nIain has lived in Manchester all his life and is concerned about the damage that Brexit will do to our city, which is dependent on being in the EU for many jobs, for our world leading sciences and for our commerce, trade and toursim, and also the loss of influence that the UK will have when it comes to tackling climate change, an issue where Labour speaks fine words and passes some credible policy, but takes absolutely no action.\n\"It is over thirty years since I got involved in local politics, fighting to stop Labour and North West Water destroying open green space to build a business park. Today air-pollution in our City is a major problem, and yet Labour are building car-parks in our city centre rather than building a traffic network to enable us to leave the car at home and travel by public transport. As a public transport user I see daily how crowded our trams are, how slowly the traffic moves in and out of our city, and how long it takes to get anywhere. We need to get our public transport moving, and particularly we need to work on creating safe routes for cyclists so we can get out of vehicles alltogether.\"\n\"It is good to see so many people heeding Greta Thunburg these days, but it is over 20 years now since I persuaded Labour to make it policy in Manchester to stop selling water in plastic bottles from council premises, we are still waiting for Labour to implement this policy. We need action to save our planet and the Liberal Democrats are committed to taking the action needed to reduce plastic waste and increase renewable energy, but we also need to tackle heat loss in our homes with a massive national funding for home insulation.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_stop-brexit-to-save-our-nhs/content_59.html": "STOP BREXIT TO SAVE OUR NHS\nThe prospect of opening up the NHS to American business practice is just another reason to fight to remain in the EU!\nAmerican President, Donald Trump, has stated at a news conference with the Prime Minister today that in any post Brexit trade negotiations everything, including the NHS 'will be on the table.\nLiberal Democrat Parliamentary Spokesperson for Manchester Blackley stated \"This is exactly what we were promised would not happen if Britain leaves the EU and yet here we are with the American President making clear that access to providing services under the NHS must be included in an trade deal with the United States of America.\"\nThe EU spent years in negotiation with the US to prevent this sort of privatisation of public servcies, and yet here we are with Britain still in the EU, and the American President already prospecting for one of our greatest national assets.\nIain added that \"The suggestion of selling off access to our NHS in return for the opportunity for Donald Trump to fill our shelves with chlorinated chicken will sicken many people to the core, and yet these are the trade deals that Britain will be left with if we leave the EU.\"\nBlackley and Broughton MP, Graham Stringer, has supported Brexit all the way, despite warning after warning about the harm it will do to our NHS not only through the loss of European Doctors, Nurses and Carers and the loss of access to vital drugs and radiation treatments for cancer, but also because of the back door sale of our our NHS to the private sector.\"\nIain Donaldson added \"This is just one of the many reasons that the Liberal Democrats will continue to fight for the People to get the final say on Brexit. Leading campaigners for Brexit are happy to sacrifice our NHS in order to leave the EU, Liberal Democrats continue to campaign for Britain to remain in the EU so that we can protect the NHS.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_uk_page-3/content_27.html": "Free To Be Who You Are\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_policing-in-crisis/content_56.html": "Policing in Crisis\nPolicing in Greater Manchester in in crisis; the office of Mayor is politically impotent and now taking the blame for the Conservative government's cuts.\nLiberal Democrat spokesperson on Crime and Disorder, Jackie Pearcey, told Focus \"City Mayors were introduced to allay calls for regional devolution, but what they are turning out to be is the Aunt Sallies of modern Britain taking all the criticism when things go wrong but with no power to raise funds or change laws.\"\n\"This Conservative government continues to cut police funding, they are soft on crime, soft on the causes of crime\" Jackie added.\nJackie's remarks followed an observation by Greater Manchester's Chief Constable, Ian Hopkins, that when it comes to crimes such as car break ins and bicycle theft \"We haven't got enough officers to deal with that.\"\nGMP has lost 2,000 officers since the Conservative cuts started to bite and, according to the Chief Constable, crime is now having to be so severely prioritised that many people would be surprised by the ruthlessness employed in that process. This is despite Greater Manchester's Labour Mayor adding a substantial precept to the Council Tax bills of every citizen in the metropolis.\nJackie added that \"The simple truth is that we need real power, and that includes tax raising powers and legislative powers, transferred from Westminster to the North of England if we are ever to start tackling the policing needs of our communities.\"\nOnly the Liberal Democrats are committed to take back power from Westminster to the North, and only the Liberal Democrats will deliver the real devolution the North needs in order to tackle crime and disorder.\nPlease complete our crime and disorder survey HERE!",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_jackie-pearcy-is-campaigning-to-protect-our-recreational-spaces/content_61.html": "Jackie Pearcy is campaigning to protect our recreational spaces\nWhen former Liberal MP and businessman Richard Peacock donated the Red Rec at Taylor Street for local people to play on for 100 years, little did he know that within days of that covenant ending Manchester's Labour bosses would be looking to sell this valuable open space for yet more housing.\nJackie Pearcey helped get equipment on the area to provide a breakout space for local youths on the Hampden Estate.\nJackie told us \"This area is designated by this council as being a local park, it is not as if there is no other land in Gorton and Abbey Hey to build on, but once again Labour are going for the easy hit selling off valuable open public space.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_values/content_5.html": "What we stand for\nThe Liberal Democrats exist to build and safeguard a fair, free and open society, in which we seek to balance the fundamental values of liberty, equality and community, and in which no-one shall be enslaved by poverty, ignorance or conformity.\nPreamble to the Liberal Democrat Constitution\nThe Liberal Democrats stand firm on seven core values: liberty, equality, democracy, community, human rights, internationalism, and environmentalism. Each of these underpin the party's specific policy proposals.\nLiberty\nWe believe in the right of individuals to make their own decisions about how they live their lives, as long as they do not cause harm to others.\nOur aim is to empower and support individuals to pursue their dreams, to make the most of their talents and to live their lives as they wish.\nEquality\nWe stand by the idea that without equality, true liberty cannot be realised.\nThis requires an active state to: ensure that no one is held back by poverty, poor health, or discrimination, including on the basis of personal characteristics or beliefs; provide access to education or training, and other public services, including a welfare safety net; and guarantee that everyone enjoys equality before the law.\nDemocracy\nWe understand that through democracy, every citizen is empowered to make their voice heard, without being dominated by entrenched interests or the power of money; checks and balances, so that those in power cannot abuse their positions for personal gain or political advantage; and a plurality of views, where no individual or organisation is deterred from speaking truth to power.\nCommunity\nWe believe it is important to provide support for a diverse range of organisations that enable individuals to join together in the pursuit of common goals or activities; and the decentralisation of political and economic power to local government and the nations and regions of the UK.\nHuman Rights\nProviding, defending and promoting equal legal rights for everyone to pursue their lives according to their abilities, wishes and means, with no discrimination on the basis of religion or belief, gender, sexuality, age, ethnicity, disability, or minority status in their country of birth or permanent residency is highly important to us.\nInternationalism\nWe support a fairer and more equal, tolerant and connected world and collaboration with the UK's neighbours - including, ultimately, rejoining the EU - in guaranteeing peace and security, tackling the climate and nature emergencies, standing up to corporate power and spreading prosperity around the world.\nEnvironmentalism\nWe value the importance of acting at home and internationally to promote environmentally sustainable means of production and consumption and living in harmony with nature.\nOur policies\nLearn more about the influence these values have on Liberal Democrat policy",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_preserve-community-banking/content_50.html": "Preserve community banking\nLocal residents in Gorton are reeling from the announcement that they are to lose their last remaining High Street bank as the Royal Bank of Scotland closes its branch in Gorton District Centre this November.\nWhilst basic banking services such as paying in cheques and other money or cash withdrawals will still be possible at WH Smiths' Post Office on Wellington Street, anything that requires being face to face with a banker will now require a trip into the city centre, which by bus equates to an £8 charge for every visit.\nWhilst it is possible for many people to bank online, not everyone has the equipment, or indeed the ability to bank online.\nLiberal Democrat parliamentary spokesperson for Manchester Gorton, Dr Jackie Pearcey, stated that \"Gorton has a lot of elderly residents who struggle with online banking, and a lot of poorer residents who can not afford the equipment needed to bank online.\"\n\"It is not so long ago that the British Taxpayers bailed out the RBS after some very dodgy dealing, and we still own a majority of the shares in the Bank, and yet when we attempted to petition parliament over these closures we were told that this is a private company and not something that parliament has any say over.\"\n\"Once again MP's are abrogating their responsibility, we need politicians who will fight for local services, rather than infighting in their own party.\"\nThe Liberal Democrats are calling on Royal Bank Of Scotland to stop the closure of our last high street bank, and to work with other financial institutions to secure a long term high street presence in Gorton for financial services. Please sign our petition here!",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-1/content_32.html": "The Mill: Catching up with Manchester’s first openly trans councillor\nCllr Chris Northwood speaks to The Mill's Mollie Simpson about her journey as Manchester’s first openly trans councillor. She reflects on representing the trans community, tackling local politics, and whether the Lib Dems can shape a better future...",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_campaigns_save-didsbury-village-post-office/content_52.html": "Save Didsbury Village Post Office\nIt has been announced the Didsbury Village Post Office is at risk of closure as one of the branches wholly owned by the Post Office as part of a cost saving shake up. We cannot let this happen. The Post Office is a key pillar of the local community and provides key services to local residents and businesses. We must make sure that there are Post Office services available in Didsbury Village.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_jackie-pearcey-is-campaigning-to-protect-our-open-spaces/content_23.html": "Jackie Pearcey is campaigning to protect our open spaces\nOver 20 years ago the Labour council wanted to build houses on Godfrey Ermen playing fields.\nJackie Pearcey and the local Liberal Democrats stopped them. Recently Labour have again threatened to build on this open space. The protection which Liberal Democrats secured at a public inquiry into the Council's development strategy helped stop that development, and now Jackie Pearcey and the local Liberal Democrats support resident's calls for Godfrey Ermen to be declared a Village Green.\nIn 1988 Tameside's Labour bosses together with United Utilities proposed to turn Denton and Fairfield Golf Courses and the Gorton Reservoirs into a business park. Jackie Pearcey was one of the leading campaigners who fought against those proposals for over 10 years to protect our open spaces, and won. There is plenty of brownfield land in Manchester that could be used for developing the housing we need, without destroying our open spaces and green lungs.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local/content_10.html": "The Mill: Catching up with Manchester’s first openly trans councillor\nCllr Chris Northwood speaks to The Mill's Mollie Simpson about her journey as Manchester’s first openly trans councillor. She reflects on representing the trans community, tackling local politics, and whether the Lib Dems can shape a better future...",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_the-lib-dem-2019-local-election-candidate-for-gorton-and-abbey-hey-is-jackie-pearcey/content_68.html": "The Lib Dem 2019 Local Election Candidate for Gorton and Abbey Hey is Jackie Pearcey\nLocal Campaigner Jackie Pearcey has been selected as the Liberal Democrat candidate for Gorotn and Abbey Hey for the 2019 Local Elections.\nJackie Pearcey was a foun der members of the Gorton and Abbey Hey Liberal Democrats in 1988, and has worked tirelessly for our community for over the past 31 years both as a citizen of Manchester and as a Manchester City Councillor representing the area for 21 years.\nJackie Pearcey has a strong record of campaigning hard on issues that affect our community, and has helped thousands of local residents with individual casework over the years.\nAs we are visiting residents from door to door this year we are hearing the same message again and again, \"Since Jackie Pearcey was voted out Gorton and Abbey Hey have gotten a lot worse. We need a our hard working local Liberal Democrat councillor back in the town hall fighting for our community.\"\nIt is often said locally in Gorton and Abbey Hey that \"everybody knows somebody who has been helped by Jackie Pearcey.\"\nWith 93 out of 96 Councillors in Manchester representing the Labour Party. What Gorton and Abbey Hey needs is a councillor who will represent our community in the Town Hall.\nIn Gorton and Abbey Hey it's a clear choice between another Labour Councillor telling our community what to expect from the Council or Liberal Democrat Jackie Pearcey telling the Council what our community expects.\nAt a time when Greater Manchester needs 135,000 more affordable homes we need a Councillor who will fight for high quality affordable homes without destroying our valuable open spaces.\nJackie Pearcey is a strong advocate for quality local housing to meet local needs without destroying valuable open spaces like the Red Rec on Taylor Street and Godfrey Ermen. What Gorton and Abbey Hey needs is more pensioner bungalows so that people needing to downsize can stay in the community where their families have grown up and they have built friendships.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_lib-dems-triumph-john-leech-tops-ballot-as-he-celebrates-25-years-in-public-service/content_60.html": "Lib Dems triumph: John Leech tops ballot as he celebrates 25 years in public service\nThe Liberal Democrats are celebrating a triumphant result in Manchester as John Leech was re-elected, marking 25 years of public service to the city.\nDespite Labour flooding the seat with hundreds of activists, including the council leader, Mayor Andy Burnham, several local MPs and surrounding councillors, John Leech has romped home to victory, increasing his majority to 892 and scooping 54% of the vote.\nThe leader of the Liberal Democrats, Ed Davey MP, commended John Leech and congratulated him on \"an unparalleled 25 years in public service.\"\nJohn Leech, who celebrates 25 years in public service, said:\n“Serving the people of Manchester is a commitment, honour and privilege that I take seriously. I am delighted to be re-elected, and I continue to be humbled by the trust and confidence placed in me.\n\"I will continue to work with all my heart and with as much energy as when I was first elected nearly 25 years ago today.\n\"I want to thank everyone who supported our campaign this year – it has been a mammoth team effort.\"\nLeader of the Liberal Democrats, Ed Davey MP, personally commended John Leech:\n\"I have known John for many years, and I am always struck by his ability to translate the concerns of everyday people into concrete action that makes their lives better. But what is unique is that John does this for one reason and one reason only: It’s just who he is.\n\"He is a true liberal with a passion for public service and a passion for his community, putting them over and above himself every time. And today, they have thanked him for that dedication.\n“Congratulations, John, on celebrating an unparalleled 25 years in public service. Your extraordinary dedication to Manchester and its residents is exactly what the Liberal Democrats stand for and I am delighted you have been resoundingly re-elected today.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_open-letter-to-mayor-andy-burnham-on-spiking/content_12.html": "Open letter to Mayor Andy Burnham on Spiking\nDear Mayor Andy Burnham,\nI would prefer not to be writing this letter. But a combined failure of both the NHS and Greater Manchester Police has left me angry and made too real an issue that has affected too many women in our area. As our Greater Manchester mayor, with devolved powers over policing and healthcare, I want to ask you to do more to keep women.\nOn Friday 28th July, my friends and I went out into Manchester city centre to celebrate a friend’s birthday. Although I left at 1am, my friends stayed out dancing into the night, enjoying what Manchester has to offer. Sadly, this quickly soured when a man bought one of my friends a drink in a bar, which she then drank. A short while later, my friends saw the man who bought this drink being ejected by bouncers. My friend, who was staying on my sofa, was brought home safely with friends, but things quickly took a turn for the worse. I was woken by her hyper-ventilating, hallucinations, with her on the phone to 111 with concern for her health.\nShe believed the drink she’d been bought had been spiked.\nMy partner (who’d stayed sober) drove us to A&E at the Manchester Royal Infirmary, where my friend was immediately triaged, but told there was no need to take any bloods. She would just need to stay in the waiting room for monitoring. Police were also present in the A&E department, and my friend spoke to the officers who were there asking them for advice on how to handle this potential drink spiking incident. She was told that phoning 101 once we’d returned home would be the best next step.\nAfter around 2 hours waiting in A&E, the hallucinations and hyper-ventilations had stopped and my friend wished to be discharged. We spoke to a member of staff, were discharged, and returned home to sleep the remainder off.\nMy friend contacted 101 the next day to report the incident and was told the police would visit her at her address a few days later. On the day of the booked visit, she received a phone call and was told a visit would not be possible – the operator did not realise that Warrington was not in Greater Manchester when booking the visit, so no officers could visit her. Further, because no bloods were taken at the time, there were no active lines of inquiry and the case closed. As far as we were aware, the venue which threw out the alleged perpetrator has not been contacted.\nShe feels failed by the system. I can’t say I blame her.\nI want to believe you when you say you’re serious about tackling gender-based violence. But this case demonstrates a basic failure of the system, and has potentially left someone free to try again, with women at risk if he succeeds. Action on women and girl’s safety must translate from press releases to the systematic change needed that means front-line staff can respond to these threats.\nI know I write to you with just one example. But I fear that this is the norm for too many women on nights out in Manchester. Where too many near misses are leaving predatory men free until it escalates beyond a near miss, and someone is left in serious harm.\nI ask you to reflect on this case, and to how you can provide reassurance both to myself and women across Greater Manchester that these situations are to become a thing of the past. Basic failures such as the one my friend received must not happen.\nYou have the power to be able to influence the system which responds to drink spiking and gender-based violence. Please use it.\nYours sincerely,\nCouncillor Chris Northwood\nDeputy Leader, Manchester Liberal Democrats\nMember for Ancoats and Beswick ward",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_liberal-democrats-will-build-a-brighter-future-in-the-eu-for-people-in-manchester-and-salford/content_78.html": "Liberal Democrats will build a brighter future in the EU for people in Manchester and Salford\nThe Liberal Democrats are Britain's third largest party, with as many members as the Conservatives and fielding or supporting candiates in every seat (except that of the Speaker) in the General Election on 12th December.\nAs the biggest Remain Party in the UK the Liberal Democrats are leading the campaign to make this the election that delivers an Exit from Brexit.\nIn the General Election on 12th December the Liberal Democrats are fielding candidates in 611 of the 650 UK parliamentary seats. We do not field candidates in Northern Ireland (18) or in the seat of the Speaker of the House (1), leaving 631 seats where we would normally field candidates. In seventeen of these seats we have stepped aside for the Green Party or Plaid Cymru. We have also stepped aside in the seats of three independent Remainers.\nThe Labour Party were invited to join the Remain Alliance, but declined as their policy remains to negotiate a Brexit deal.\nThe Labour Candidate in Blackley and Broughton has voted to leave the EU at every oppotunity, and campaigned for Brexit in the Referendum. He was one of the handful of Labour MP's who voted for Theresa May's deal and therefore voting Labour in Blackley and Broughton will not stop Boris Johnson's Brexit.\nLiberal Democrat Candidate, Iain Donaldson, stated that \"The Liberal Democrats, Plaid Cymru and the Green Party have formed an electoral pact, agreeing not to stand against each other in dozens of seats. From the outset the Labour Party refused to joing that alliance, they are not a Remain Party and neither their leader nor the former MP for Blackley and Broughton are Remainers.\"\nIn Blackley and Broughton the Unite Union funds Labour campaigning, and the leader of the Unite Union, Len McCluskey has stated absolutely clearly that Labour are not a Remain Party.\nIain added, \"The Labour Party is split on Brexit, as are the Trades Union movement. I am a member of Unison which represents public sector workers. We are campaigning to Remain in the EU because we know the damage that Brexit will do to our public services, and especially to the NHS.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_gortonmarket/content_14.html": "Demand the council help the Gorton Market traders!\nOver so many years, Gorton market and the dedicated people within have provided our community with brilliant service, value and goods. The current cost of living crisis is harming our great market and is leading our traders to make difficult decisions- including the devastating decision to close down. We believe that our much-loved market and its traders are very much worth fighting for. We the undersigned call on Manchester City Council not to pass on fuel increases to the tenants of Gorton Market for a year to ensure that our market survives the current cost of living crisis and is there for generations to come.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-3/content_31.html": "Joe Lynch is working hard for Piccadilly\nThree separate litter campaigns were launched in our city in the last 12 months alone.\nThree separate litter campaigns were launched in our city in the last 12 months alone.\nA GREENER MANCHESTER\nJoe Lynch is proud to have been selected again as the Liberal Democrat candidate for the Piccadilly Ward.\nLocal resident Claude Nsumbu is the Liberal Democrat candidate in the upcoming Clayton & Openshaw by-election.\nIn 2019 Jackie closed the gap on Labour in Gorton and Abbey Hey by 473 votes, putting her in a clear second place in a seat that Labour has started to take for granted again.\nJackie is pictured with more rubbish that she has reported from around Gorton. Fly tipping is rife in the area and the charges for collection mean that rubbish is being dumped anywhere, any time.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_18th-century-stringer-should-go/content_70.html": "18th Century Stringer should go!\nLiberal Democrat Parliamentary Spokesperson for Manchester Blackley, Iain Donaldson, has called on the Labour Party to stop vilifying veteran Labour MP Graham Stringer for his views on climate change and Britain's place in Europe, stating \"That's my job!\"\nMr Stringer, contrary to what his views suggest, is Labour MP for Blackley and Broughton Constituency, which straddles the cities of Manchester and Salford.\nIn September, 2017 Mr Stringer was one of seven Labour MPs to vote with Prime Minister Theresa May's Conservative Government in favour of the EU Withdrawal Bill which removes powers from Parliament and vests them with Ministers, and in the same month he was appointed to the Commons Science and Technology Committee, meant to ensure government decisions are based on sound scientific evidence, just two years after joining Tory climate science denier Nigel Lawson's organisation the Global Warming Policy Foundation, Britain's leading climate sceptic group which lobbies to prevent pro-climate legislation.\nIain Donaldson added that \"I welcome the support that these Labour members are giving to my Liberal Democrat campaign to replace flat-earther Mr Stringer with a modern politician, However they need to understand that many of their councillors are not much better, and that what this city really needs is Liberal Democrat representation.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_blame-for-rising-violent-crime-falls-squarely-on-the-pm-s-shoulders/content_73.html": "Blame for rising violent crime falls squarely on the PM's shoulders\nCommenting on the National Audit Office report into the sustainability of police forces in England and Wales Liberal Democrat Parliamentary Spokesperson for Manchester Gorton, Jackie Pearcey, told Focus \"The fact the NAO is now reporting constables are finding it difficult to deliver an effective service is yet another shocking indictment of the government's failure to support our police.\"\nJackie Pearcey continued saying that \"With the number of arrests dropping and violent crimes rising it is the most vulnerable in our communities who need the support and protection of the police.\"\n\"The blame for this mess falls squarely on the shoulders of Theresa May, as Home Secretary she was responsible for slashing police budgets and now she appears to be resisting calls for extra spending on police.\"\nLiberal Democrats are demainding that the government immediately increases spending on community police to keep our communities safe.\nHowever, as always we would like to know your views. Please complete our Crime and Disorder survey HERE!",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_annualdinner/content_47.html": "Manchester Liberal Democrats Annual Dinner 2025\nYou are cordially invited to the Manchester Liberal Democrats’ Annual Dinner with guest speaker Lord Mark Pack, President of the Liberal Democrats.\n📅 Date: 4th April 2025\n⏱️ Time: 6:30pm for 7pm\n📍 Location: Denton Golf Club, Manchester Road, Denton, Manchester, M34 2GG.\nThere will be an excellent three-course dinner with tea, coffee, and desserts (all dietary requirements catered for). There’s music, games, and dancing too.\nOur guest speaker is Lord Mark Pack, President of the Liberal Democrats since 2020, including a period as joint acting leader of the party in 2020. Under his presidency, the party has secured its best ever general election result, becoming the largest third party in a century. Mark was appointed to the House of Lords in December 2025.\nThe ticket price is £45 per person, including entry into the special envelope draw. Extra draw tickets are available at £5 for two.\nThis event is aid of raising funds to support the Manchester Liberal Democrats local election campaigns. We have key seats to win on the Council in 2026 and need to campaign throughout 2025, a year in which there are no local council elections. We need your support.\nThe dinner promises to be a fantastic night and it would great to see you there.\nTo book, please contact pjones@mcrlibdems.uk to order tickets for the event and if you have any queries or dietary requirements.\nMeal options\nStarters\nVegetable Soup (vegan option available)\nDuck Spring Rolls\nClassic Prawn Cocktail\nMains\nRoast Beef Dinner\nOlive and Herb Salmon Fillet\nVegetable Lasagne (vegan option available)\nDessert\nApple Crumble with Custard\nChocolate Trillionaires Tart (suitable for Vegans)\nStrawberries and Cream Cheese Cake",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_liberal-democrats-will-create-a-5bn-flood-prevention-and-adaptation-fund/content_44.html": "Liberal Democrats will create a £5bn flood prevention and adaptation fund.\nLiberal Democrat Candidate for Blackley and Broughton, Iain Donaldson, has welcomed an announcement by the Liberal Democrats that they plan to create a £5bn flood prevention and adaptation fund.\nIain stated that \"Manchester and Salford have seen serious flooding in the Cities in recent years, and as climate change takes hold this is set to get worse year on year. Whilst the Tories are turning their backs on communities most at risk by failing to provide adequate flood defences Labour's MP sits on the board of of an organisation that denies that human activities are impacting on climate change.\n.\nThe Tories' Brexit agenda, backed by Labour's MP, risks the UK losing access to vital EU funds for improving flood defences and flood relief. This would starve local communities of a key revenue stream to tackle flooding and build resilience for the future whereas by staying in the EU, the UK will retain access to vital EU funds to deal with flooding.\nOver the lifetime of the next parliament, a Liberal Democrat government will create a £5bn flood prevention and adaptation fund which will help the UK build resilience against future flooding, and ensure all communities can access the funds they need during periods of crisis.\nIain added that \"Scientific evidence for mans impact on climate change is overwhelming. We need to switch to renewable energy sources, to protect our planet but in the immediate future we also need to build defences against the flooding we are seeing year on year.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_what-joe-lynch-is-fighting-for-in-piccadilly-ward/content_54.html": "Oops, an error occurred! Code: 20250503172044ca75a339\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_uk/content_4.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_jackie-is-the-clear-challenger-to-labour/content_46.html": "Jackie is the clear challenger to Labour!\nID\n3 Feb 2020\nIn 2019 Jackie closed the gap on Labour in Gorton and Abbey Hey by 473 votes, putting her in a clear second place in a seat that Labour has started to take for granted again.\nGorton and Abbey Hey is ignored by a council where one more Labour voice added to a chorus of 92 Labour councillors makes no difference at all.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_campaigns_ancoats-safer-streets-survey/content_18.html": "What do you think of the Ancoats safer streets scheme?\nWhat are your thoughts on the Ancoats safer streets scheme?\nYour local Liberal Democrat councillors are committed to listening to you and representing your views back to the council\nYou can also get in contact with Alan and Chris to share detailed thoughts by email to agood@mcrlibdems.uk and cnorthwood@mcrlibdems.uk, as well as pass feedback directly to the project team at ancoats@manchester.gov.uk and on the council website.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_local-resident-claude-nsumbu-chosen-by-the-liberal-democrats-to-fight-the-clayton-and-openshaw-by-election/content_63.html": "Local resident Claude Nsumbu chosen by the Liberal Democrats to fight the Clayton and Openshaw By-Election\nLocal resident Claude Nsumbu is the Liberal Democrat candidate in the upcoming Clayton & Openshaw by-election.\nClaude lives in the ward with his wife and two daughters. Claude works as a translator for the NHS and other public services, and is about to start a Masters in Health & Social Care. He has been a member of the Lib Dems for over a decade, and is also a pastor at his local church.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_over-300-million-spent-on-town-hall-whilst-front-line-services-are-cut/content_45.html": "Over £ 300 Million spent on Town Hall whilst front line services are cut!\nID\n16 Apr 2019\nManchester's Labour bosses continue to cry poverty and blame all their woes on Conservative Government cuts whilst spending:\n● £ 300 million on Town Hall renovations\n● £ 112 million on a new performing arts centre;\n● £ 2 million a year to pay for the Urbis Centre\nIt's time to end Labour's monopoly on in the town hall.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_manchester-housing-crisis-for-people-leaving-prison/content_71.html": "Manchester Housing Crisis - for people leaving prison!\nHave you wondered why there are so many people begging in Manchester's City Centre?\nWell one of the answers is the total lack of support given to people leaving the City's prisons to return to society.\nOne third of people released from Manchester's prisons between 2015 and 2017 left for \"unsettled\" or \"unknown\" accommodation because of a lack of social and affordable homes in the city.\nNearly 400 people released from Manchester's prisons were completely abandoned last year alone, with many going on to sleeping rough. Manchester's homeless crisis is being perpetuated by a lack of support for people released from the city's prisons.\nNearly 400 people released from Manchester's prisons were completely abandoned last year alone.\nPeople who leave prison released to \"unsettled accommodation\" (mostly rough sleeping and other forms of homelessness) are unsurprisingly more likely to reoffend than host who have stable housing on release. Figures show that in Manchester 212 people (10%) were released to \"unsettled accommodation\" between April 2015 and March 2017.\nHundreds of prisoners released each year are at serious risk of ending up on the streets.\nA further 550 (26%) were released to unknown accommodation, making it much harder for them to receive services to support rehabilitation.\nLiberal Democrat Lead Campaigner for Deansgate, John Bridges, stated that \"Prison is supposed to be a place of rehabilitation, but what point is there in rehabilitating someone to then abandon them to the streets the moment they leave the prison gates?\"\n\"It is hard enough for former prisoners to get a job or access to education and healthcare, but that becomes near impossible if they are homeless and living on the streets.\"\nManchester's Labour bosses are providing development opportunities to overseas millionaires, approving luxury developments that are unaffordable to most people in our city, and at the same time they are failing to provide basic accommodation and affordable homes for some of the most vulnerable people in our society.\nLiberal Democrats are calling for Manchester's planning and housing policies to be re-focussed away from benefitting rich developers and towards tackling the City's ever-growing housing crisis.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_joe-lynch-is-working-hard-for-piccadilly/content_55.html": "Joe Lynch is working hard for Piccadilly\nThree separate litter campaigns were launched in our city in the last 12 months alone.\nLooking around at our filthy streets, you would be right to ask: \"what's changed?\"\nWe also need to encourage more people to give up driving in to the city centre, but we won't succeed as long as our poorly maintained pavements squirt jets of dirty water for days after it has rained. Labour did not spend all of the money from the highways budget last year, we say there should have been investment in city centre cycling infrastructure and to make our streets fit for walking on yearround.\nA vote for Joe would be a vote for a committed, concerted, year-long crusade to make the streets where we live fit for a proud city.\nJoe lives in the city centre and doesn't own a car, so he shares your issues,",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_the-renter-charter/content_57.html": "The Renter Charter\nIain Donaldson was asked:\nI'm writing to you as a voter in Blackley and Broughton to urge you to commit to reforming the private rented sector if elected, and to support the Renter Manifesto.\nAs I'm sure you're aware, the private rented sector is in urgent need of reform, both in Blackley and Broughton and nationally.\n- One in five people in the UK rent privately, yet renters are often overlooked by policymakers in favour of homeowners or first-time buyers.\n- Renting is unaffordable, with renters paying around 40 of their income on rents.\n- In return for high rents, private renters suffer poor conditions and have very little security.\n- One in seven privately rented homes are unsafe, and tenants can be evicted by their landlords with just two months notice, even if they have done nothing wrong.\nI'm a supporter of Generation Rent, one of the campaign groups which developed the Renter Manifesto. The manifesto sets out policies that the next Government must implement to improve the lives of renters. The reforms are categorised in six key themes - Security, Affordability, Justice, Conditions, Discrimination, and Housing for People Not Profit. We want the next Government to commit to ending unfair Section 21 Evictions, invest in a massive housebuilding programme, and outlaw discrimination against tenants on housing benefit.\nI hope that, if elected, you will take steps to ensure that private renters have access to safe, secure and affordable homes.\nPlease do let me know if you will support the manifesto.\nIain Donaldson responded:\nThank you very much for your email in which you rightly highlight the plight of the thousands of people living in private rented accommodation both locally in Blackley and Broughton and across the country.\nThe three things we need around us for a stable life are good health, good friends and family and a good roof over our head and that is why it is so important that the next government tackles and starts to resolve Britain's housing crisis.\nFor those who are renting in the private sector it is important that they can secure tenure, and to this ends a Liberal Democrat Government would reform Section 21, ending the ability for landlords to evict tenants via \"no fault evictions.\" We would also promote longer tenancies of three years or more with an inflation-linked annual rent increase built in, to give tenants security and limit rent hikes, ensuring that rent cannot be hiked excessively will mean landlords cannot increase rent as a method of evicting a tenant.\nWhilst there are many good landlords in the private sector, it is important that the bad landlords are tackled and so we would improve protections against rogue landlords through mandatory licensing.\nAffordability of housing is a major issue, and there are many ways in which we can improve this, not least of which is by building 100,000 homes specifically for social rent each year and giving local authorities the first right to purchase public land for social housing. We would also reform legislation such as the Land Compensation Act to ensure they pay a fair price for land.\nIn order to finance the large increase building social homes and encourage local authorities to use their new powers to borrow we will introduce a British Housing and Infrastructure Development Bank.\nYoung people are facing difficulties with around 37% of people aged 25-34 now privately rent their homes, which is up from 12% in the mid-1990s. We would help young people into the rental market by establishing a new Help to Rent scheme to provide government-backed tenancy deposit loans for all first-time renters under 30 and we would also help people who cannot afford a deposit by introducing a new Rent to Own model for social housing where rent payments give tenants an increasing stake in the property, owning it outright after 30 years.\nThe highest levels of fuel poverty are in the private rented sector and so we would ensure all new houses are built to zero-carbon standards by 2021, drastically cutting energy bills and undertake a ten-year emergency programme to upgrade existing housing stock, targeting fuel poor homes first.\nThere is a great deal more that needs to be done to tackle the housing crisis, and I have stuck to just some of the things we are committed to specifically to help those living in the private rented and broader rented sector, we are facing today and one of the things that a Liberal Democrat government will always do it talk to the experts and the service users about how we can bring forward new ideas to help tackle the crisis but for private renters particularly this would be a starting point.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_poster/content_2.html": "Request a poster\nRequest a poster\nIf you're willing to display a poster to show your support for the Liberal Democrats in your area, please fill in your details and we'll get one to you.\nIf you're willing to display a poster to show your support for the Liberal Democrats in your area, please fill in your details and we'll get one to you.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_lib-dems-at-manchester-pride/content_81.html": "Lib Dems at Manchester Pride\nThe Liberal Democrats would like to thank everyone who gave us such a fantastic receiption at Manchester Pride 2018.\nOur campaign in support of reforming the Gender Recognition Act to allow members of the Trans community to formally change the gender on their birth certificates was extremely well received. The proposed changes will remove the anomally of having the wrong sex recorded on a person's birth certificate, and is something that should have happened a long time ago.\nSir Vince Cable, the leader of the Liberal Democrats, said at a recent meeting that\nThere has been a lot of nonsense spoken about these changes, but for the record, we have yet to find a single case in which a woman has been asked to show her birth certificate before being allowed to go to the toilet.\nIn case you are unaware, the background to the banner is the Trans flag.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_jackie-pearcey-protecting-our-heritage/content_28.html": "Jackie Pearcey - protecting our heritage\nGorton has a rich history and some fine architecture and Jackie Pearcey has worked hard alongside her Liberal Democrat Colleagues and local residents to protect and enhance that heritage over the years.\nWhen the former schoolhouse at Brookfield Church was threatened with demolition it was the Liberal Democrats who campaigned to get it turned into the pensioner flats that are there today.\nWhen Labour were encouraging the development of Gorton Monastery into flats it was Jackie Pearcey and the Liberal Democrats who called for a more imaginative future for the building, and when the statues of the saints were on Liverpool dockside facing export to America it was Jackie Pearcey and the Liberal Democrats who fought to secure their return to Gorton.\nWhen Labour's proposals for redeveloping the Gorton District Centre were announced it was the Liberal Democrats who insisted that they be consulted on in full before any proposals were brought forward, and when it was realised that the Plough was to be bulldozed as a part of the proposals it was the Liberal Democrats who led the campaign to save this historic pub.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_potholes-pavements-and-a-council-failing-to-sort-them-out/content_38.html": "Potholes, pavements and a council failing to sort them out\nLast year the Council received £100 million for road improvements from the Government, but under spent by a quarter despite our roads being in the worst condition for decades. That isn't cuts, it's incompetence.\nJackie Pearcey confirmed \"Liberal Democrats will follow up on all resurfacing works and make sure that you are informed throughout the process. We will not let the Council get away with delaying work or under spending budgets, and we won't rest until our roads are safe for all commuters and pedestrians alike.\"\nThe Liberal Democrats are also proposing that the Council should introduce:\n- Spot inspection of resurfaced roads;\n- A published repair and renewal programme for all roads in the City; and\n- A publication of all reported potholes, the programmed repair date and the actual repair date.\nJackie added that \"Taxpayers should be able to expect quality work, not sticking-plaster solutions. Liberal Democrats demand better quality roads and road repairs in our city.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_freedom-of-the-city-for-pep-guardiola/content_24.html": "Manchester Liberal Democrats Seek Freedom of the City for Pep Guardiola After Historic Champions League Victory\nManchester Liberal Democrats are calling for Pep Guardiola to be awarded Freedom of the City following Manchester City’s historic Champions League win on Saturday night.\nLiberal Democrat Councillor Chris Northwood, who represents the area which includes City’s home ground at the Etihad Stadium said: “Winning the treble is a moment to be celebrated, and Pep Guardiola’s record over the years at Manchester City deserves formal recognition. Manchester City’s investment in our local community goes beyond football and deserves to be celebrated.“ She added, “With the only other English club to have achieved this being Manchester United, our city should be incredibly proud of our football heritage. No matter your team’s allegiance, or none, this is a moment all football fans across the city recognise as a great moment”.\nLeader of the Manchester Liberal Democrats John Leech added: “From the days of Maine Road I’ve been a lifelong City fan. What Pep has done for City is incredible, he’s built a team of great players with a world-class playing style. The results of his management have inspired young people across our city. It’s time the Council recognise him for his achievements and award him Freedom of the City”.\nThe Manchester Liberal Democrats will be bringing forward a motion to the council. Such a motion will need cross-party support to pass. The Manchester Liberal Democrats are calling on the ruling Labour group to back their motion and recognise Guardiola through granting him Freedom of the City.\nSIGN THE PETITION!\nPep Guardiola should be given Freedom of the City\nTonight's Champions League victory is historic. With both English treble winning teams coming from Manchester, Manchester Liberal Democrats are calling on Pep Guardiola to be join Sir Alex Ferguson to given Freedom of the City of Manchester. Will you join us?\nArticle image: © Manchester City FC",
  "https_mcrlibdems_uk/https_mcrlibdems_uk/content_1.html": "The Mill: Catching up with Manchester’s first openly trans councillor\nCllr Chris Northwood speaks to The Mill's Mollie Simpson about her journey as Manchester’s first openly trans councillor. She reflects on representing the trans community, tackling local politics, and whether the Lib Dems can shape a better future...",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-10/content_33.html": "Pride in the Gay Village!\nShock news that 2018 may be the last year that Manchester's Gay Village will host the main stage of Manchester's world-famous Pride festival has been greeted with anger by the City's LGBT+ communities. Unfortunately, such a devastating move has been inevitable since Manchester Labour Councillors voted through the Portland Street Planning Framework and gave permission to build hotels and towers on the space used by Pride and other Village events.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_the-air-that-we-breathe/content_40.html": "The air that we breathe\nTHE TREES ARE SHOWING US THE PROBLEM!\nTree lichens thrive under certain conditions; for this yellow lichen the best conditions are the noxious fumes emitted by diesel engines, nitrogen dioxide (NO2).\nStudies indicate that long-term exposure to NO2 levels currently observed in Europe may decrease lung function and increase the risk of respiratory symptoms such as acute bronchitis and cough and phlegm, particularly in children.\nThe World Health Organisation (WHO) states: \"In general, individuals with asthma are expected to be more responsive to short-term exposure to inhaled agents, when compared to individuals without asthma.\"\nJackie Pearcey told Focus, \"We need action on Diesel now to protect children from the chronic illnesses that breathing in this poisonous atmosphere can cause. It is time for action on the environment!\"\nThe monitoring the council is supposed to do!\nSmaller particulates in the air have an impact on our health in other ways, the Council's city centre atmospheric monitoring system Robin Grayson is pointing at monitors 2.5 micron particulates in the atmosphere (as required by law). However it does not measure 1 micron particulates which which impact on human mental capacity and health whereas the monitor held by Jackie Pearcey does.\nJackie told Focus \"The Labour council is doing the minimum it can to meet it's legal requirements in monitoring air pollution in Manchester. I am installing this monitor in Gorton, the first in Manchester to measure the minute particulates that can slow recovery from strokes, reduce the performance of athletes and damage the education of children and students.\"\nTo find our more about the monitor and how to look at the atmospheric pollution in Gorton and around the world visit https://www.purpleair.com/ and click on the maps link.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_uk_page-4/content_6.html": "Britain must lead on defence and aid\nThe UK needs to strengthen both our Armed Forces and our soft power.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_lib-dems-demand-more-affordable-housing/content_69.html": "Lib Dems demand more affordable housing\nThis council is directly responsible for the lack of affordable housing in Manchester. Liberal Democrats demand affordable homes and an end to homelessness in Manchester.\nWe will rewrite Manchester's housing policy from the bottom up.\nManchester's Labour bosses have failed to enforce the building of affordable homes in the city for years. Instead many new build houses are sold for private landlords to rent.\nLocal recreational land such as the red rec and Godfrey Ermen is constantly under threat of development for new housing unsuitable for local needs.\nLiberal Democrats demand that every housing development provides at least 20% affordable homes, and that affordable accommodation is available for young people to help the transition to adulthood so that they know that their council is looking out for them.\nScrap Labour's Homelessness Tax!\nManchester's Labour bosses have introduced a nasty policy that fines homeless people taking shelter in archways, doorways and tents up to £100.\nWorse still, if they do not pay then Manchester's Labour bosses take them to court where they face a £1,000 fine.\nJackie Pearcey told us that \"The Homelessness Tax is arguably the worst policy ever enforced by Manchester's Labour bosses.\"\nLiberal Democrats want to scrap Labour's Homeless Tax and instead introduce a clear and compassionate plan to get Manchester's street homeless off the streets and and into homes.\n- Manchester's Labour bosses waste over £ 300 million on Town Hall renovations whilst rough sleepers bed down in the archways underneath.\n- Manchester's Labour Bosses can find over £ 112 million for a new performing arts centre whilst slashing community budgets.\n- Manchester's Labour bosses can afford to repair the city's failing fountains at a cost of over £ 1.2 million whilst people live homeless and hungry on the streets of our City.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_it-really-is-rubbish/content_39.html": "It really is rubbish!\nJackie is pictured with more rubbish that she has reported from around Gorton. Fly tipping is rife in the area and the charges for collection mean that rubbish is being dumped anywhere, any time.\nJackie told Focus \"This Labour Council spends millions on vanity projects like tarting up the town hall and building performing arts centres, but it just isn't getting the basics right.\nThis Labour Council's refuse management is rubbish!",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_lib-dems-launch-manifesto-with-pledge-to-end-labour-s-back-room-decisions-and-reverse-pay-rises-for-top-bosses/content_43.html": "Lib Dems launch manifesto with pledge to end Labour's back-room decisions and reverse pay rises for top bosses\nJohn Leech has launched the Liberal Democrat manifesto for the 2018 local elections in Manchester. Called 'Manchester Together', it features key policies such as tackling homelessness, housing 50 at-risk Syrian refugee families and reversing the recent pay rises for senior staff in the town hall.\nFor the full Manifesto click here: Manchester Together\nKey Pledges:\n-\nON REFUGEES AND OUR MORAL DUTY:\n- Immediately develop plans to house 50 at-risk families from refugee camps. In the long-term, we will also investigate how best to house as many orphaned child refugees as possible.\n-\nON EU CITIZENS:\n- Demand the Brexit secretary guarantee the rights of EU citizens and maintain our stance on a referendum on the Brexit deal.\n-\nON TRANSPORT AND ROADS:\n- Use some of the estimated £50million Manchester Airport dividend to establish a SmartTransport Development Fund dedicated to offsetting heavy carbon transport.\n- Introduce for a young commuter's price cap, so they never pay more than half the hourly living wage rate to commute to work.\n- Crackdown on lazy road re-surfacing.\n-\nON HOUSING:\n- Demand all developments over 15 dwellings meet the 20% affordable quota, and where not economically viable, force the developer to contribute financially to the benefit of the local community.\n- Guarantee safe, affordable housing for young people transitioning from foster care to adulthood.\n-\nON HOMELESSNESS:\n- Launch an investigation into all emergency housing applications to make sure that no one slips through the net.\n- Use council-owned premises to house every rough sleeper in Manchester before approving any further city centre developments.\n- Provide an administration address to every homeless person so that they can take the first step in getting their life back on track - this means they can begin applying for jobs.\n-\nON PLANNING AND DEVELOPMENT:\n- Crackdown on the destruction of historical buildings important to the heritage of Manchester.\n- Safeguard Manchester's Gay Village as a site of cultural importance.\n-\nON SAFETY:\n- Reinstate community police officers.\n- Offer business rate discounts to bars, clubs and restaurants that successfully adopt the 'Ask for Angela' procedure and attend training.\n- Increase council tax for the wealthiest to fund police resource increases; providing an extra £40.4million of funding for GMP, £30.2million more than the current Labour proposals - this would fund an extra 200 police officers in Greater Manchester.\n-\nON HEALTH:\n- Ensure every mental health patient had a bed if they require it.\n- Introduce Sexual Health Hubs across Manchester allowing people to book appointments outside of work hours.\n- Launch an education programme, working with local professional architectural colleges to assess our high streets and neighbourhoods to create fully inclusive access points for disabled people across our city.\n-\nON EDUCATION:\n- Protect and increase the SEN budgets available to every school in Manchester.\n- Highlight schools without cooking facilities and look to private-public partnerships for a solution to ensure every child gets a healthy lunch.\n- Increase adult vocational studies to retain the diverse skill set of Manchester's workforce.\n-\nON THE ENVIRONMENT:\n- Invest in cycle highways by using government investment to build cycle only roads to service commuters.\n- Review cycle storage units in all social housing blocks and make safe storage units a requirement in all apartment planning applications.\n- Guarantee a plastic-free Manchester starting with a zero-tolerance policy on throwaway plastics.\n- Begin requiring all pubs, clubs and cafés to remove plastic straws from display and provide environmentally friendly alternatives for those who request them. We recognise that current options, such as biodegradable, wheat, glass and stainless steel straws, are unsuitable for some disabled people, so we would not impose a blanket ban until a suitable alternative is in place.\n- Ensure full and comprehensive enforcement of all breaches of environmental law restrictions.\n-\nON JOBS:\n- Create a dedicated business start-up support service for entrepreneurs.\n- Provide business rate discounts for locally owned, independent businesses.\n- Provide a three-year business rate relief for any creative and new media company setting up or relocating to Manchester.\n- Lobby for the relocation of the Department of Culture, Media and Sport to Manchester.\n- Work alongside the tourism and hospitality industries to deliver a coordinated package to visitors that will boost visitors to the city.\n- STEM subject support will be provided through workshops with sixth forms and schools to introduce young people to the industry requirements and innovation within science, technology, engineering and mathematics\n-\nON EQUALITY:\n- Stamp out the rise of homophobic bullying in Manchester's schools after a report from Cllr. John Leech showed an alarming rise.\n- Continue our campaign with football teams to kick homophobic chanting out of the game for good.\n- Work for a grown-up, evidence-based policy on sex work in our city.\nOffer free sexual health check-ups for sex workers and support unionisation to ensure the same scrutiny and accountability you would find in any other line of work. - Install gender-neutral toilets at all public toilet locations in the city.\n- Campaign for the inclusion of 16 and 17-year-olds in local and national elections, and referendums.\n- Campaign for women-only swimming and gym sessions in council-owned premises and nonbinary changing room facilities.\n-\nON LABOUR'S RECORD:\n- A Robin Hood reversal of the recent top pay rises of up to 60% for council bosses and give it back to our city's lesser-paid workers.\n- Reject any unnecessary spends such as council-paid concerts, £350million on town hall refurbishments and 60% pay rises for top bosses.\n- Force every elected councillor and senior council officer to declare all interests before taking office.\n- Demand the publication of all tax receipts of elected councillors.\n- Demand the publication of all political donations.\n- Hold councillors to account - too many councillors are getting away with unacceptable behaviour. We should expect more from our town hall.\n- An end to back-room decision making - the public need to know what's going on in the town hall.\nCommenting on the manifesto, Cllr. John Leech said: \"Our campaign is about everyone and everything that makes Manchester the great city it is today; a strong local community, a celebration of diversity and non-conformity.\n\"Liberal Democrats care passionately about our local communities because it's where we live and it's what we believe in. We will always put local people first and it's about time our council did too.\n\"On the 3rd May, we have a chance to elect a council that leads from the front; that cities around the world look up to; where we celebrate diversity, house the homeless, welcome the desperate and build a future for our children. But only a vote for the Liberal Democrats can break this one-party state and build that vision.\"\nIn 2016, John Leech stormed his way back on to Manchester Council in a shock victory that signified the first gain for any party other than Labour for the first time in six years in Manchester and provided an opposition for the first time in two years.\nManchester faces all-up elections this year meaning all 96 seats are up for grabs. Labour currently holds 95/96 seats with John Leech as the only Liberal Democrat.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_volunteer/content_8.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-2/content_15.html": "Manchester Liberal Democrats Seek Freedom of the City for Pep Guardiola After Historic Champions League Victory\nManchester Lib Dems are calling for Pep Guardiola to be awarded Freedom of the City following Manchester City’s historic Champions League win on Saturday night.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_cavendish-park-drainage/content_29.html": "Cavendish Park Drainage\nMuch-loved Cavendish Park is facing a huge bill of £175,000 to fix its drainage problems — all because United Utilities (UU) has refused to let the Council connect to the local drainage network. After requests from the Didsbury Liberal Democrats, and a site visit led by Councillors Richard Kilpatrick and John Leech, the Council created a report exploring ways to fix the park. The report suggests three possible — but expensive — solutions. These include a Garden Rainwater Retention System, French drains or soakaways, or creating a swale or ponding area to help manage the water. Each option would cost between £150,000 and £175,000. The reason these costly alternatives are being suggested is because, as the report says, “United Utilities has a policy not to accept land drainage from open land.” This is despite United Utilities regularly releasing millions of litres of raw sewage into rivers and lakes — including the River Mersey. Sign our petition to get UU to change their mind!",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_manchester-roads-crisis/content_48.html": "Manchester Roads Crisis\nWhen you ask your Labour councillors in Manchester if potholes can be fixed they will tell you that they don't have the money because of government cuts, and yet £18 million of money set aside to repair our roads went unspent last year. That's not cuts, it's incompetence.\nManchester Council today announced the next phase of Manchester's highways investment but completely failed to admit that their mismanagement of our city means nearly £18m has been wiped from this year's spending.\nBoasting about next year's investment in our roads Manchester's Labour bosses claims they will spend £4m repairing more than 14,000 potholes on roads and pavements in the city, but their failure to keep contractors in line has meant that last year's work in now being delivered behind schedule and with the budget revised accordingly means £17.6 million of road repairs will not happen.\nLiberal Democrat Lead Campaigner for Gorton and Abbey Hey, Jackie Pearcey, stated that \"Our councillors can scream at the tops of their voices about cuts, but when they cannot spend properly the money they have got it isn't cuts it's incompetence.\"\n\"Again, this year, the lack of transparency and oversight from Manchester's Labour bosses has meant that local people will suffer as our roads don't get the investment they need.\"\nWith countless people complaining about damage to their cars and cycles from the potholes in our streets everybody knows somebody who has been let down by Labour failing to manage the city's roads budget.\nJackie added that \"This constant lack of scrutiny on private contractors is unacceptable and another reason why a Liberal Democrat opposition on this council is so vital.\"\nIf you know of any potholes or other street environment issues needing attention, please fill in our street environment survey HERE!",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_fighting-to-breathe/content_53.html": "Fighting to breathe\nHyde Road is already one of the most polluted roads in Manchester, yet the Council is trying to create even more traffic along Hyde Road with the widening scheme.\nLocal Campaigner Jackie Pearcey explained \"last year, I monitored the pollution levels outside my home, about 100 yards from Hyde Road. Most days, the pollution levels were far higher than safe levels. Nearer to Hyde Road, the air is even worse. We need green barriers to make the air that we are breathing safe.\"\nHyde Road's pollution levels are dangerous, yet the Council agreed to building houses right up against the road, endangering the residents' health.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_hyde-road-chaos/content_66.html": "Hyde Road Chaos\nJackie Pearcey has hit out at the traffic chaos which is likely to be caused in Gorton for months due to the Hyde Road widening scheme.\nJackie said \"This will cause months of misery for people using Hyde Road. The Council doesn't seem to have any sort of plan for events such as football matches at the Etihad Stadium. Gorton will be gridlocked.\"\n\"The pinch-point at the former Railway Bridge needs to be dealt with, but the Council's schedule seems to be designed to maximise the delays.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_eu-support-growing/content_76.html": "EU support growing.\nA robust poll conducted by the Guardian Newspaper shows that Manchester voters would reject Brexit in even greater numbers today than when the referendum took place in 2016.\nThe poll shows that the remain vote:\n- In Manchester Withington support for remain has increased from 73.7% to 77.4%, the strongest in the North West.\n- In Manchester Central support for remain has increased from 63.3% to 68.4%;\n- in Manchester Gorton support for remain has increased from 62.1% to 68%;\n- In Wythenshawe and Sale East support for remain has increased from 50.1% to 58.1%; and, most significantly,\n- In Blackley and Broughton which narrowly voted leave at the referendum, support for remain has increased from 48.7% to 59% Remain.\nLiberal Democrat parliamentary spokesperson for Blackley and Broughton, Iain Donaldson, stated \"This poll shows that people are no longer being fooled by the cavalier lies of the Brexiteers.\"\n\"In Blackley and Broughton people who have supported Labour for years have seen their MP follow Mrs May through the voting lobby to support empowering Conservative ministers to overule Parliament, and to stop MP's having the final say over Brexit.\"\nWith Labour and the Conservatives now both formally backing similar Brexit proposals, the Liberal Democrats continue to work with others in all parties and none to deliver a referendum on the deal which would enable the people of Britain to reject a Brexit deal that is bad for Britain, or worst still a no deal with no guarantees and no trade, or travel agreements.\nPlease complete our survey on Britain's place in Europe: here!",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-9/content_41.html": "Manchester's Labour bosses stand accused of paying lip-service to making buildings disabled accessible as they fail to include suitable wheelchair access in the planning conditions for their latest sacred cow, a £ 112 million arts centre, to be called \"The Factory\" on the site of the former Granada Studios. The board overseeing the new development have drawn criticism after failing to feature a single qualified architect and as a result the project has already been hit by a number of push-backs including a £1.65m overspend on redesigning the theatre to rectify acoustics problems before a single brick was laid.\nNational campaign group Best for Britain and Manchester's Opposition Liberal Democrats, are calling on the City Council to pass an official policy motion in support of a the final say on the Brexit deal. In the referendum in 2016 Manchester voted by a large majority to remain in the European Union, and with thousands of jobs in the City under threat, and EU Grants that have helped rebuild the city no longer available, Manchester will be much worse off out under any Brexit deal.\nWhen you ask your Labour councillors in Manchester if potholes can be fixed they will tell you that they don't have the money because of government cuts, and yet £18 million of money set aside to repair our roads went unspent last year. That's not cuts, it's incompetence. Manchester Council today announced the next phase of Manchester's highways investment but completely failed to admit that their mismanagement of our city means nearly £18m has been wiped from this year's spending.\nHave you wondered why there are so many people begging in Manchester's City Centre? Well one of the answers is the total lack of support given to people leaving the City's prisons to return to society.\nLocal residents in Gorton are reeling from the announcement that they are to lose their last remaining High Street bank as the Royal Bank of Scotland closes its branch in Gorton District Centre this November. Whilst basic banking services such as paying in cheques and other money or cash withdrawals will still be possible at WH Smiths' Post Office on Wellington Street, anything that requires being face to face with a banker will now require a trip into the city centre, which by bus equates to an £8 charge for every visit.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_corbyn-called-out-on-his-hypocrisy-over-syrian-refugees/content_79.html": "Corbyn called out on his hypocrisy over Syrian refugees!\nManchester Opposition Leader John Leech has slammed Jeremy Corbyn's claims that he will tackle the Syrian refugee crisis as Labour's flagship council continues to reject them.\nIn his keynote speech, Jeremy Corbyn said: \"We will also make a far more determined effort to help bring the terrible war in Syria to an end, a war that has led to millions of refugees.\"\nBut Manchester's Opposition Leader John Leech has slammed Corbyn's flagship council for turning their backs instead of following their leader.\nHe said: \"Jeremy Corbyn is saying all the right words but he must look a little closer to home and start with Manchester Council, which has been rejecting Syrian refugees since the crisis began.\n\"I have demanded, begged and pleaded with them to show some compassion but Manchester Labour has closed the door and turned their backs on the biggest refugee crisis we have ever faced, including desperate lone children.\n\"If Jeremy Corbyn is serious about his promise to tackle the Syrian conflict, he must start by forcing his flagship council in line and agree to my demands of housing 50 of the most at-risk and vulnerable Syrian families.\"\nIn 2014, Labour held every one of the 96 seats on Manchester Council. The Liberal Democrats have since made a comeback with the return of former MP John Leech, but that hasn't stopped Labour bulldozing over demands to house refugees.\nIn 2016, John Leech worked alongside Rethink Rebuild Society (RRS), a community organisation that works to improving the lives of Syrians and helping them become positively established within British society.\nTogether, they demanded that Manchester Council house 50 of the most vulnerable Syrian families and as many as possible unaccompanied children, but the council refused, simply responding that \"Manchester was prepared to play their part.\"\nDr. Haytham Alhamwi, Managing Director of RRS, said: \"We are asking Manchester City Council to accept at least 50 Syrian families through the Syrian Vulnerable Persons Resettlement Scheme that was announced in 2015.\n\"We also ask Manchester City Council to accept as many unaccompanied Syrian children as possible, who are in urgent need for all kinds of support\".\n- Unaccompanied asylum-seeking children from around the world housed in Manchester:\n2013: 2\n2014: 1\n2015: 3\n2016: 3",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_protecting-our-nhs/content_58.html": "Protecting our NHS\nIain Donaldson has for the last 17 years worked in health research at the University of Manchester on a collaboration of the three Manchester hospitals and the Greater Manchester Mental Health Trust.\nIain knows the hard work that all the teams at our hospitals and working in our communities do to keep us healthy and to ensure that when things go wrong we have the support we need. \"I am particularly grateful to the team at North Manchester General who for me and thousands like me living with sleep apnoea provide life changing equipment and help. Sleep apnoea is much more common than we realis and can be a debilitating and dangerous condition if not treated. It is, like many, an unseen disability that would not receive such good treatment without out NHS.\"\nWhen the last Labour government privatised our hospital buildings under their PFI schemes Iain and the Liberal Democrats opposed the privatisation because the money we are now paying in interest to private financiers could instead be being invested in our health services. We have lost so much provision, particularly with the closure of mental health services in Central Manchester and the impact that has had here in the North, in order to fund the PFI.\nIain added \"The project I work on deals with mental health, and I know how important it is that we get funding and provision for mental health services on a proper footing in this country, which is why I welcome the Liberal Democrats committment to spend a large chunk of the money saved by not exiting the EU in our mental health services.\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_jackie-pearcey-s-record-of-action-over-31-years/content_42.html": "Jackie Pearcey's record of action over 31 years.\nAs well as campaigning over those 31 years to get potholes and pavements fixed and dogshit removed, Jackie has also campaigned:\n- Against the Tameside Labour Party's proposals to build a business park around Debdale Reservoirs\n- To Save Gorton Monastery from demolition and to bring the stolen statues of the Saints back from Liverpool Docks where they were destined for export to the U.S.A.\n- To secure the right of War Pensioners to their full pension entitlements;\n- To secure play equipment in Debdale Park, the King George Playing Fields, Gorton Park and on Taylor Street Recreation Ground (the former Red Rec);\n- For pedestrian crossings on Hyde Road at Tesco and at Debdale Park;\n- For the redevelopment of the old Gorton Market;\n- For the traffic calming on and around Chapman Street;\n- To stop the building of housing on Godfrey Ermen;\n- For the rebuilding of the Gorton Medical Centre; and\n- On many other issues over those 31 years.\nAs well as being a local councillor for the area Jackie has stood form Parliament four times, including in the by-election that never was in 2015.\nJackie continues to campaign for our area, and you can get information about her campaigns either from this website or by joining Jackie's mailing list:\nJoin Jackie's Mailing List",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_jackie-knows-the-importance-of-a-good-education/content_75.html": "Jackie knows the importance of a good Education\nJackie Pearcey knows the importance of a good education.\nAs a child Jackie Pearcey's first home had a tin bath and an outdoor loo. She earned a place at a good school and was one of the first in her family to go to University. Now she has a PhD in nuclear physics.\nJackie Pearcey has served as a Governor at Oasis Academy Aspinal in Gorton for over 20 Years, and is proud of the fact that children at the Academy receive an outstanding start to their education.\nJackie told us that \"One of the most important things the Liberal Democrats have done in recent years was the introduction of the pupil premium which gives children from working class backgrounds like mine a better chance in the world\"\nJackie Pearcey is committed to ensuring children get the best start in life.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_spd/content_13.html": "Save the Single Persons Discount\nThere are strong rumours that the Labour government will remove the Single Persons Discount for on Council Tax, leading to tax going up by over 33%, or £517 on a Band D property, annually. Stopping this is just plain wrong – and we are determined to fight it. This will apply to all households with just one adult that pays Council Tax. That could be a young person who has just been able to secure their first flat on their own. It could be single parent with children, or a widow(er) in the home that they shared for many years with their partner. We all know that the Conservatives wrecked the economy. But it is not right that Labour are expecting vulnerable older people to pay the price to fix it. Back our campaign today to get a fairer deal for single people.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_blackley-s-mp-backs-tory-government-again-in-crucial/content_80.html": "Blackley’s MP backs Tory Government again in crucial\nGraham Stringer last night voted with Theresa May's government to prevent parliament from taking steps to prevent a no-deal Brexit by extending the article 50 negotiating period in order to agree an alternative deal with the EU. The former Manchester City Council Leaser joined with other veteran Eurosceptics Kate Hoey, and Dennis Skinner and 11 other Labour MP's in voting down Yvette Cooper's amendment by 321 votes to 298.\nTheir votes helped cancel out those of 17 Conservative rebels who voted for Cooper's amendment, which Labour's frontbench had decided it would support earlier in the day to \"reduce the threat of the chaos of a no deal\". The aim of the motion was to ensure that parliament had the right to vote on whether to extend article 50 if time ran out.\nIain Donaldson, Liberal Democrat Parliamentary Spokesperson for Blackley and Broughton told Focus \"Graham Stringer voting with the Tories against the Labour whip is nothing new. On Brexit, as on climate change, Mr Stringer is on the wrong side of the argument. By allowing Mrs May these victories he is damaging our city and putting jobs at risk.\"\nMr Stringer also voted with the Conservatives Sir Graham Brady's amendment to scrap the Northern Irish backstop, which is designed to ensure borderless trade and passage between Northern Ireland and Eire.\nIain Donaldson added \"In siding with Arlene Foster's Unionists in calling for the backstop to be removed, Mr Stringer is playing a very dangerous game. There are many of us here in Manchester, from Irish backgrounds or not,who know full well what the consequences of re-establishing an Irish Border will be.\"\nDowning Street is expected to concentrate attention on Mr Stringer and the group of Labour MPs, because they may be needed to help May get any final Brexit deal approved.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_the-most-rubbish-refuse-collection-service-ever/content_26.html": "The most rubbish refuse collection service ever.\nWith the bins lottery that has been created by Manchester's Labour bosses in which one item in the wrong bin can result in rubbish not being collected, the communal bins are always overflowing and the small bins are simply not able to cope with household waste we need a Councillor who will call out Labour's incompetent refuse service.\nLabour claim that they are tackling fly-tipping in the area, but the simple truth is that their mismanagement of our refuse collection is the cause of the problem, not the solution to it.\nIf Labour are tackling the problem of fly tipping in Gorton, why then is Jackie Pearcey having to report so much of it?\nWe need a local councilor who will challenge the ongoing failure of Manchester's Labour bosses to tackle the refuse collection sytem, not another Labour Councillor making vague promisies and achieving nothing.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-7/content_20.html": "Liberal Democrats will create a £5bn flood prevention and adaptation fund.\nLiberal Democrat Candidate for Blackley and Broughton, Iain Donaldson, has welcomed an announcement by the Liberal Democrats that they plan to create a £5bn flood prevention and adaptation fund.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_flooding-newsletter/content_36.html": "John and Richard's Flooding Newsletter\nJohn and Richard's flooding newsletter\nAs and when we receive updates about flooding and flooding relief, you will be the first to know. (This newsletter is not a substitute for guidance from authorities, especially in an acute flooding situation).",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_uk_page-1/content_9.html": "Overtaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-8/content_67.html": "Liberal Democrat Parliamentary Spokesperson for Manchester Blackley, Iain Donaldson, has called on the Labour Party to stop vilifying veteran Labour MP Graham Stringer for his views on climate change and Britain's place in Europe, stating \"That's my job!\" Mr Stringer, contrary to what his views suggest, is Labour MP for Blackley and Broughton Constituency, which straddles the cities of Manchester and Salford. In September, 2017 Mr Stringer was one of seven Labour MPs to vote with Prime Minister Theresa May's Conservative Government in favour of the EU Withdrawal Bill which removes powers from Parliament and vests them with Ministers, and in the same month he was appointed to the Commons Science and Technology Committee, meant to ensure government decisions are based on sound scientific evidence, just two years after joining Tory climate science denier Nigel Lawson's organisation the Global Warming Policy Foundation, Britain's leading climate sceptic group which lobbies to prevent pro-climate legislation.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_manchester-labour-mp-backs-mrs-may-s-disastrous-brexit-plans/content_74.html": "Manchester Labour MP backs Mrs May's disastrous Brexit Plans\nLiberal Democrrat Parliamentary Spokesperson for Blackley and Broughton, Iain Donaldson, has again slated the Constituency's Labour MP for once more backing Theresa's May's worst option deal on Brexit.\nIain told Manchester FOCUS that \"Despite oppinion polls showing that remain has substantially overtaken Brexit in Blackley and Broughton, Mr Stringer still clings to his belief that Brexit is good for Britain.\"\nThe reality is that Brexit will cost jobs and adversely affect services here in Blackley and Broughton, as now demonstrate by the Government's own figures.\nIain added that \"Labour members failed to unseat MR Stringer last year over a similar voting pattern. He is clearly out of touch with his own members and with the needs and views of the people of Blackley and Broughton. It is time for him to go,\"",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-5/content_16.html": "The air that we breathe\nTHE TREES ARE SHOWING US THE PROBLEM!\nTHE TREES ARE SHOWING US THE PROBLEM!\nManchester's Labour bosses continue to cry poverty and blame all their woes on Conservative Government cuts whilst spending:\nWith the bins lottery that has been created by Manchester's Labour bosses in which one item in the wrong bin can result in rubbish not being collected, the communal bins are always overflowing and the small bins are simply not able to cope with household waste we need a Councillor who will call out Labour's incompetent refuse service.\nGorton has a rich history and some fine architecture and Jackie Pearcey has worked hard alongside her Liberal Democrat Colleagues and local residents to protect and enhance that heritage over the years.\nWhen former Liberal MP and businessman Richard Peacock donated the Red Rec at Taylor Street for local people to play on for 100 years, little did he know that within days of that covenant ending Manchester's Labour bosses would be looking to sell this valuable open space for yet more housing.\nOver 20 years ago the Labour council wanted to build houses on Godfrey Ermen playing fields.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_local_page-6/content_51.html": "Jackie knows the importance of a good Education\nJackie Pearcey knows the importance of a good education.\nJackie Pearcey knows the importance of a good education.\n£ 1.2 million spent on restoring failing fountains whilst people are living on our streets.\nLocal Campaigner Jackie Pearcey has been selected as the Liberal Democrat candidate for Gorotn and Abbey Hey for the 2019 Local Elections.\nIain Donaldson was asked:\nIain Donaldson was asked:\nThe Liberal Democrats are Britain's third largest party, with as many members as the Conservatives and fielding or supporting candiates in every seat (except that of the Speaker) in the General Election on 12th December.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_donate/content_3.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowDonate today to help the Manchester Lib Dems fight Labour's one party state\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_uk_page-2/content_49.html": "Taking on Trump & Farage – and fixing church roofs\nLeader's Speech to Spring Conference 2025\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_pride-in-the-gay-village/content_65.html": "Pride in the Gay Village!\nShock news that 2018 may be the last year that Manchester's Gay Village will host the main stage of Manchester's world-famous Pride festival has been greeted with anger by the City's LGBT+ communities.\nUnfortunately, such a devastating move has been inevitable since Manchester Labour Councillors voted through the Portland Street Planning Framework and gave permission to build hotels and towers on the space used by Pride and other Village events.\nWhen Joe Lynch raised Lib Dem objections about this inevitable move during the planning committee in June, Councillors just laughed. Joe tells us that \"We objected, we opposed, newly elected Labour councillors sat on their hands.\"\nThe latest move by the City's Labour Bosses in what has become a planning frenzy in which communities and history are being swept aside in favour of big business and international speculators has left village businesses, charities and patrons alike reeling as proposals will result in there being no room in the village for the main stage of what many consider to be Britain's premier Pride event.\nJoe added that \"We take the LGBT+ community seriously, we will fight to keep Pride in Place. Consultations and decisions surrounding pride must consider the concerns of the LGBT+ community. Unfortunately, Manchester Council's lust for new 20 storey towers has forced the Organisers' hands. Manchester City Council would rather see another multi-storey car park than ensuring a Pride event that we can be proud of.\"\nLiberal Democrat Parliamentary Spokesperson for Manchester Central, John Bridges, stated that \"The Liberal Democrats have a long history of supporting LGBT+ rights, and of supporting Manchester Pride.\"\n\"This is not the first time that Labour have attempted to move Pride out of the village, but every time they have done so it has resulted in the near collapse of the event and devastating impact on the charities that Pride supports.\"\n\"Liberal Democrats want to see Manchester continue to grow as a vibrant international city, welcoming to all communities, but we believe that this decision will damage the City's reputation, and jeopardise the future of Manchester Pride.\"\nThe City Centre Liberal Democrats are extremely dissapointed that the Main Stage at Manchester Pride is being forced out of the Gay Village.\nJoe added that \"We love Pride for being a celebration of LGBT+ culture and history in Manchester, it is first and foremost community event. That should not change. Moving Pride events to locations on the edge of the city, (or in the suburbs) would change the entire dynamic of that celebration and detract from aim of supporting the Gay Village community.\"\nThe Liberal Democrats would like to hear your views about Manchester's Gay Village and Manchester Pride. Please complete our survey here.\nJoin our campaign mailing list here.",
  "https_mcrlibdems_uk/https_mcrlibdems_uk_news_article_the-royal-college-of-nursing-s-manifesto/content_77.html": "The Royal College of Nursing's manifesto\nIain Donaldson was asked:\nThis election has come at a critical time for nursing staff, patients and their families. There are mounting pressures in the NHS and our social care services across the UK; shifts are chronically understaffed and the resources needed to provide safe and effective care aren't always available.\nCan I count on you and your party to support the Royal College of Nursing's manifesto, and:\n- address workforce shortages by bringing forward legislation for safe staffing\n- invest in health and care services, including restoring the loss of EU funding across the UK\n- invest in nursing education and professional development for all nursing staff\n- improve working conditions and pay for all nursing staff\n- design the immigration system so that it benefits nursing and enables us to share knowledge and skills across the globe.\nYou can demonstrate to your constituents your commitment to nursing by becoming an RCN Nursing Champion. This is your opportunity to give nursing staff in your constituency a voice in parliament.\nIain Donaldson responded:\nThank you for your email and for the questions you have raised, and I will try to keep my response succinct.\nMy day job is in Medical Research at the University of Manchester, working alongside the staff in the three emergency departments in Manchester and so I fully appreciate how important it is to support and fund not only our nursing staff but our health and social care teams as a whole.\nYou have asked about restoring the loss of EU funding across the UK, and rightly so. According to the Institute for Fiscal Studies Brexit has already cost the economy more than £1 billion a week which is funding that could have gone into the NHS. The Royal College of Nursing say £1 billion would train 24,000 nurses. In addition to the Government's recent spending announcement, we would raise a further penny in the pound from income tax (around £6billion a year) and use this to meet immediate priorities in social care, reverse cuts to public health, and boost spending on mental health beyond the government's current plans.\nWe will target extra help for nursing students, starting with bursaries for specialties where shortages are most acute such as mental health, linked to clinical placements in geographies that are under-staffed. We will fund an EU recruitment campaign and end the Government's inflexible £30,000 earnings threshold for overseas workers, which rules out many care workers.\nFunding is not the only concern though when it comes to staffing in our NHS, The NHS relies on 10,000 EU doctors, 20,000 EU nurses and 14,000 clinical support staff. We've lost almost 5,000 net EU-trained nurses & midwives from the NHS in the last 2 years with many of those identifying Brexit as the trigger, whist there are currently 41,000 nursing vacancies in England. Only if we stop Brexit can we begin to reverse this trend.\nWe need to ensure that we have good staffing levels into the future and so the Liberal Democrats would produce a national workforce strategy, ensuring that we never again experience a shortage in the numbers of doctors, nurses and other professionals that the NHS needs. The Liberal Democrats will also put a penny in the pound on Income Tax to invest in the NHS and social care.\nWhen it comes to immigration, we will scrap the Conservatives' Hostile Environment, replacing their fishing-net approach with targeted, intelligence-led immigration enforcement. We will take immigration powers away from the Home Office so that visa and asylum decisions are made quickly and fairly. We will restore dignity and common sense by ending indefinite detention and allowing asylum seekers to work while their cases are decided. And we will stop Brexit and save free movement.\nAs to the question of being a Nursing Champion, I would have thought it the role of an MP to champion all constituents and those who serve them. It goes without saying that if I am elected, I would champion nursing, nurses and all our excellent NHS staff.\nIf I have missed anything or you have any further questions, then please let me know."
}