{
  "https_sarahsackman_com_/https_sarahsackman_com_2025_03_31_response-to-residents-on-potholes-and-pavements/content_15.html": "This week, I sent out surveys to all Finchley and Golders Green residents to understand what you love, and more importantly, what you want changed about your community. It was wonderful to see so many of you highlighting our green spaces as your favourite thing about the area – it’s something I love about Finchley and Golders Green too. Protecting these spaces is essential.\nOn what needs to be changed, I’ve heard your message loud and clear – road maintenance and street cleanliness are a main priority for residents. All residents deserve to feel safe travelling around their neighbourhood, whether that’s through fixing potholes, or reducing air pollution.\nIn the new year, it was confirmed that Barnet Council would receive an extra £1.2 million from the Government for road maintenance. This is the third highest figure across all London boroughs. On top of this, just this week, the Department for Transport announced an extra £500 million would be unlocked from April to fund further road maintenance alongside the Local Government Authority. This will support authorities to fix up to 7 million potholes around the country.\nGet updates on this and other similar local issues\nMore widely, it was great to see so many residents involved in Earthwatch’s ‘Tiny Forest’ initiative this week. Volunteers planted 1,800 new trees by the North Circular in Finchley to tackle air pollution in the area. Students from Brookland Infant and Nursery School, Kerem Primary School, Moss Hall Nursery, Brooklands Junior School and Henrietta Barnett School participated in the day. Allowing biodiversity to thrive in the city allows for greener, healthier spaces which we can all enjoy.\nI want residents to love their neighbourhoods, so your survey responses are important. Please do continue to send them through to my office, and I hope we can deliver on as many of your ideas as possible.",
  "https_sarahsackman_com_/https_sarahsackman_com_contact/content_10.html": "Casework Enquiry Form\nAs your local MP for Finchley and Golders Green, I am here to listen and help with any concerns or issues you may have. Please fill out this survey so that we can direct you to the best form of help. Please aware that appointments are limited so we will prioritise on a case-by-case basis. If we are unable to accommodate your request a member of my office will be in touch regardless.",
  "https_sarahsackman_com_/https_sarahsackman_com_cdn-cgi_l_email-protection/content_13.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_sarahsackman_com_/https_sarahsackman_com_privacy/content_3.html": "Privacy Policy – Sarah Sackman MP\nLast updated: 03/04/2025\n1. Who we are\nOur website address is: https://sarahsackman.com\nThis page explains how we collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data. This is separate to how the national Labour Party uses your personal data and you should refer to their privacy policy for further information about this: www.labour.org.uk/privacy-policy\nThe Office of Sarah Sackman MP is the data controller as defined under the General Data Protection Regulation (“GDPR”) and responsible for your personal data (referred to as “we”, “us” or “our” in this privacy policy).\n2. Our contact details\nName: Office of Sarah Sackman, Member of Parliament for Finchley and Golders Green\nAddress: House of Commons, London, SW1A 0AA\nEmail: [email protected]\n3. Purpose of this Privacy Policy\nThis privacy policy aims to give you information on how we collect and process your personal data through:\n- Your use of this website (including, but not limited to, any data you may provide through this website by, for example, signing up as a to receive communication’s on Sarah Sackman MP’s parliamentary and constituency activities.\n- Engaging with us on third party websites and platforms (including, but not limited to Facebook, Instagram and X).\n- Casework.\nThis website is not intended for children and we do not knowingly collect data relating to children.\nIt is important that you read this privacy policy, together with any other privacy policy or fair processing policy we may provide on specific occasions when we are collecting or processing personal data about you. We want you to be fully aware of how and why we are using your data.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\n4. The type of personal information we collect\nThe office of Sarah Sackman MP will only collect and use personal information for the specific purpose for which it has been obtained.\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data), or data related to deceased individuals.\nWhen submitting sign up forms on this website, you may be asked for personal information. In each case, we will ask for your consent to use your information, and we will only use it for the purposes for which you provide it.\nWe currently collect and process the following information:\n- Names and email addresses of individuals who submit this information in the ‘Stay up to date with Sarah’ form [https://sarahsackman.com] to receive emails from Sarah Sackman MP to receive news and updates about her Parliamentary and constituency work.\n- Postcodes, as part of form submissions on our website.\nHow we use postcode information\nPostcode data is used for the following specific purposes:\n-\nTo identify your location within the Finchley and Golders Green constituency. This allows us to understand local issues, prioritise communications relevant to your area, and provide targeted updates on local events, campaigns, and surgeries.\n-\nTo support segmentation in our email campaigns so can receive updates relevant to your part of the constituency (e.g. neighbourhood-level casework, petitions, and meetings).\n-\nTo comply with data compliance and campaign regulations, including verifying eligibility for campaign-related actions.\n-\nPostcode validation is in place to ensure accurate information and to help us avoid incorrect tagging in our systems.\n- To ensure that we do not take on casework for non-constituents.\nThis postcode information is securely handled and never used for commercial profiling or sold to third parties. It is stored securely in our systems and only accessed by authorised members of the team for constituent engagement and communication purposes.\n5. How we obtained your personal information and why we hold it\nMost of the personal information we process is provided to us directly by you for one of the following reasons\nProvided by you – directly\n- Because you have submitted information through the ‘Stay up to date with Sarah’ form to receive emails from Sarah Sackman MP to receive news and updates about her Parliamentary and constituency work;\n- Because you have corresponded with the Office of Sarah Sackman MP via post or via email to make an inquiry or request help with issues including, but not limited to, casework, policy queries, campaigns, surgeries, meetings, access to the Houses of Parliament (including tours and tickets to the public gallery).\nProvided by you – indirectly\n- Your name and address is legally taken from the electoral register, in order for us to participate in the democratic process;\n- As you interact with our website, we will automatically collect technical data about your equipment, browsing actions and patterns – where this is strictly necessary to enable the delivery of the website to you, then these cookies will be downloaded automatically. We collect this personal data by using cookies and other similar technologies. We may also receive technical data about you if you visit other websites employing our cookies. Please see our cookie notice further down in this Privacy Policy for further information. You will have the option of declining cookies which are not strictly necessary for the delivery of the website if you do not wish to provide this kind of data to us.\n6. Donating to the Labour Party\nThe information we ask for is used to process your donation and, if you donate more than £500, to check that you are on the electoral register which is a legal requirement under the Political Parties, Elections and Referendums Act 2000. If you donate more than £2,230 to a Labour Party accounting unit (eg. Constituency Labour Party) or more than £11,180 to the Labour Party nationally in the course of a calendar year, your name and the amount of your donation will be reported to the Electoral Commission for publication on their public register of donations to the Labour Party. Donation information will be stored in our membership database and used to keep you informed of Labour news, campaign and other opportunities to support the Party.\n7. Legal basis to process personal data\nUnder the General Data Protection Regulation (GDPR), the lawful bases we rely on for processing this information are:\n- Your consent. You are able to remove your consent at any time. You can do this by contacting [email protected].\n- Legal entitlement. MPs have a legal entitlement to your name and address from the electoral register, even where you have asked not to be contacted.\n- Public task. This may be used where we process personal data in the public interest (which has a clear basis in law).\n- Legitimate interests. We may contact you by post using this lawful basis, but we always ensure we balance your rights and freedoms against our proposed legitimate interest.\n- Contract. If you are a member of the Labour Party, we may rely on this lawful basis to contact you, where it is defined within the Party’s Rule Book.\n8. How we store and retain your personal information\nYour information is securely stored at the Office of Sarah Sackman MP, House of Commons, London, SW1A 0AA.\nInformation submitted on the ‘Stay up to date with Sarah’ form on [https://sarahsackman.com] are securely stored on https://mailchimp.com/.\nWe will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. We will delete all other personal data we no longer need in line with our internal retention policy of four years.\nWe will regularly review the personal information we hold to ensure that its use is necessary and proportionate.\nWe will then securely and permanently dispose of your information by permanently deleting electronic records and destroying physical records through a secure data disposal service.\n9. Cookies and Analytics\n9.1 What are cookies?\nCookies are small text files that web servers give to browsers to store on users’ machines (computers, tablets or mobile devices). They enable the website to recognise requests as coming from the same browser. Cookies are designed to allow the website to recognise its users on subsequent visits, or to authorise other designated websites to recognise these users for a particular purpose. Cookies can be essential for the operation of an application or to improve the user experience. They can also be used to track user behaviour.\nInformation collected by cookies is classed as personal data.\nFor more information on cookies, their use and how to block them, you may want to visit www.aboutcookies.org.\n9.2 Managing cookies\nYou can set your browser to not accept cookies, but this may limit your ability to use the Services. You can also opt out of receiving interest-based ads from certain ad networks here (or if located in the European Union, here).\nIn your web browser (for example, Google Chrome, Microsoft Internet Explorer, Mozilla Firefox or Apple Safari), you can control which types of cookies you allow. Most browsers accept cookies automatically, but you can alter the settings of your browser to erase cookies or prevent automatic acceptance if you prefer. You can turn cookies on or off using your browser’s settings and you can also delete cookies and clear your browser’s cache (also known as your internet viewing history). Visit the ‘Options’ or ‘Preferences’ menu on your browser to change settings, and check the following links for more browser-specific information:\n- Google Chrome: https://support.google.com/chrome/answer/95647?hl=en\n- Microsoft Internet Explorer: https://support.microsoft.com/en-us/help/17442/windows-internet-explorer-delete-manage-cookies\n- Mozilla Firefox: https://support.mozilla.org/en-US/kb/cookies-information-websites-store-on-your-computer?redirectlocale=en-US&redirectslug=Cookies\nThe Information Commissioner has also provided guidance here: https://ico.org.uk/your-data-matters/online/cookies/\n- Third Party Links\nThis website may contain links to other websites, or embedded content from other websites. We are not responsible for the content or privacy practices of these websites.\nThis website may include links to third party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\n- Information rights\nUnder data protection laws, you have rights including:\nYour right of access – You have the right to ask us for copies of your personal information.\nYour right to rectification – You have the right to ask us to rectify personal information you think is inaccurate. You also have the right to ask us to complete information you think is incomplete.\nYour right to erasure – You have the right to ask us to erase your personal information in certain circumstances.\nYour right to restriction of processing – You have the right to ask us to restrict the processing of your personal information in certain circumstances.\nYour right to object to processing – You have the the right to object to the processing of your personal information in certain circumstances.\nYour right to data portability – You have the right to ask that we transfer the personal information you gave us to another organisation, or to you, in certain circumstances.\nYou are not required to pay any charge for exercising your rights, though we may apply a basic administration fee where your information right is determined as being either “manifestly unfounded” or “manifestly excessive”. If you make a request, we have one month to respond to you, though an additional two months may be applied subject to the application of an exemption available to data controllers.\nSarah Sackman MP\n[email protected]\nHouse of Commons\nLondon\nSW1A 0AA\n- How to complain\nIf you have any concerns about our use of your personal information, you can make a complaint to us at:\nSarah Sackman MP\n[email protected]\nHouse of Commons\nLondon\nSW1A 0AA\nYou can also complain to the ICO if you are unhappy with how we have used your data.\nThe ICO’s address:\nInformation Commissioner’s Office\nWycliffe House\nWater Lane\nWilmslow\nCheshire\nSK9 5AF\nHelpline number: 0303 123 1113\nICO website: https://www.ico.org.uk\n- Changes to the Privacy Policy\nWe keep our privacy policy under regular review (at least on an annual basis) and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website and we encourage you to regularly check back for any updates about how your data is used",
  "https_sarahsackman_com_/https_sarahsackman_com_'https:_sarahsackman_com_2025_04_14_my-first-community-newsletter-april-2025_'/content_11.html": "“As your local MP, I am passionate about building community and bringing people of different backgrounds together to spread opportunity”\nDear Resident,\nWelcome to my first Community Newsletter as your MP in Finchley & Golders Green.\nAs your local MP, I am passionate about building community and bringing people of different backgrounds together to spread opportunity. Finchley and Golders Green is an amazing place. I am proud to have been born and raised here and now it is my privilege to serve our area. I feel excitement and a big responsibility to work to make this a greater place for the next generation to grow up in.\nSo, I will be using these updates to share news about my work as your MP but also to create a space to spotlight local issues, groups and events who are doing brilliant things. In that vein, please do sharethis linkin your local neighbourhood WhatsApp groups so that together we can grow this Community Blog into a vehicle for real change.\nOur pocket of North London\nOver the last month, hundreds of you have written to me and I’ve met many residents in surgeries and at events. In the last month, my team has completed casework for 246 people. As an example, we’ve helped local people:\n- stand up to neglectful landlords to enforce their housing rights.\n- with their Blue Badge application\n- obtain ECHP assessments and better provision for children with Special Educational Needs\n- report fly-tipping and littering to the Council.\nWhere I have noticed wider, and worrying, trends with casework I have taken action to bring people together to find a solution. After residents raised concerns about a development in East Finchley affecting a local nursery, I relayed their views to the council and made clear that they needed to provide a suitable alternative site during construction. I know that the council has been working hard to find a solution and hope to be able to update the families who use it soon.\nI have also been working alongside residents on Granville Estate who have faced a lack of water supply for weeks. I have launched a petition to ensure that they are compensated fairly for their losses. You can read about the petition and sign it here: Petition for Harpenmead Point Compensation – Sarah Sackman MP.\nAs always, I have enjoyed visiting some of the local community groups around the constituency which make our area so special. From Oak Lodge, a school for children with special needs, to the brilliant St Patrick’s Day celebration at Cherry Tree Cafe – I have had the pleasure of meeting so many amazing residents. I look forward to my packed schedule next month!\nThe view from the River (Thames)\nLast week, I hosted an event in Parliament to recognise the individual sacrifices and generosity shown by Ukrainian residents and host families in Finchley and Golders Green – however it became so much more than that. It was an evening of music, dancing and laughter, where young Ukrainian residents could form lasting bonds. Amidst the dark and chaotic geopolitical landscape, it was heart-warming to see people coming together in a show of strength and hope.\nFurthermore, against such a tumultuous global picture, the Labour Government has been getting to work delivering on its Plan for Change. I’ve been proud to vote on legislation that will have a real impact on the lives of people in Finchley and Golders Green.\nKickstarting economic growth is vital. It’s how we’ll spread opportunity in our communities and rebuild our ailing public services. Building the homes and infrastructure we need – from railways to data centres – is key to growth. That’s why I am backing the Planning and Infrastructure Bill which will enable our ambitious home delivery programme. The Government will invest in social and affordable housing shows that we are gripping the housing crisis.\nWe are also working hard to improve the experience of those in the private rental sector. The Renters’ Rights Bill will make no-fault evictions a thing of the past and the Commonhold White Paper will end the feudal leasehold system in this country. We are delivering a comprehensive plan that will ensure that people in Finchley and Golders Green can feel secure in their homes.\nIn addition, I was pleased to hear the Home Secretary announce new measures in the Crime and Policing Bill which will give the police more powers to stop protests outside places of worship like synagogues, mosques and churches. One of the best things about Finchley and Golders Green is its diversity – people are entitled to feel safe attending their place of worship. Labour will ensure that our area continues to be the brilliantly diverse, tolerant and cohesive community that makes it so special.\nPutting the ‘justice’ in social justice…\nAs Minister of State for Courts and Legal Services I am determined to tackle the crisis in our courts. So, I announced an increase in court sitting days to record levels. We need to deliver swifter justice for victims – this is just the start of delivering the radical change we need in our court system.\nI was also delighted to announce £6 million of funding for legal aid services and centres such as the Citizens Advice Bureau. This will ensure that everyone has access to the justice system, no matter their ability to pay.\nI have also been using my role to advocate for Britain’s legal services as part of our mission for growth. I was thrilled to announce £1.5 million in investment for start-ups in Law tech – an industry where the UK is world leading. We have also passed the Arbitration Act which will make Britain the jurisdiction of choice for legal and arbitration services.\nLast month I also wrapped up my time on the committee as the Minister on the Terminally Ill Adults (End of Life) Bill. The debate around this Bill has been sensitive, with strong feelings on both sides. That is why I am pleased that the parliamentary process has been conducted with respect and care. This helps lawmakers refine and improve legislation, making sure we provide the strongest safeguards possible in the composition of this bill. It really was the parliamentary system working at its best.\nThe fun bit…\nPhoto of the month by my Head of Office, Rachel\nWishing you a happy Easter, Chag Pesach Sameach or wonderful spring!\nBest wishes,\nSarah Sackman\nMember of Parliament for Finchley and Golders Green\nUp and coming …\nFinchley Symphony Orchestra Concert on the 17th of May book online at\nhttps://www.finchleysymphony.org/",
  "https_sarahsackman_com_/https_sarahsackman_com_2025_04_14_my-first-community-newsletter-april-2025/content_12.html": "“As your local MP, I am passionate about building community and bringing people of different backgrounds together to spread opportunity”\nDear Resident,\nWelcome to my first Community Newsletter as your MP in Finchley & Golders Green.\nAs your local MP, I am passionate about building community and bringing people of different backgrounds together to spread opportunity. Finchley and Golders Green is an amazing place. I am proud to have been born and raised here and now it is my privilege to serve our area. I feel excitement and a big responsibility to work to make this a greater place for the next generation to grow up in.\nSo, I will be using these updates to share news about my work as your MP but also to create a space to spotlight local issues, groups and events who are doing brilliant things. In that vein, please do sharethis linkin your local neighbourhood WhatsApp groups so that together we can grow this Community Blog into a vehicle for real change.\nOur pocket of North London\nOver the last month, hundreds of you have written to me and I’ve met many residents in surgeries and at events. In the last month, my team has completed casework for 246 people. As an example, we’ve helped local people:\n- stand up to neglectful landlords to enforce their housing rights.\n- with their Blue Badge application\n- obtain ECHP assessments and better provision for children with Special Educational Needs\n- report fly-tipping and littering to the Council.\nWhere I have noticed wider, and worrying, trends with casework I have taken action to bring people together to find a solution. After residents raised concerns about a development in East Finchley affecting a local nursery, I relayed their views to the council and made clear that they needed to provide a suitable alternative site during construction. I know that the council has been working hard to find a solution and hope to be able to update the families who use it soon.\nI have also been working alongside residents on Granville Estate who have faced a lack of water supply for weeks. I have launched a petition to ensure that they are compensated fairly for their losses. You can read about the petition and sign it here: Petition for Harpenmead Point Compensation – Sarah Sackman MP.\nAs always, I have enjoyed visiting some of the local community groups around the constituency which make our area so special. From Oak Lodge, a school for children with special needs, to the brilliant St Patrick’s Day celebration at Cherry Tree Cafe – I have had the pleasure of meeting so many amazing residents. I look forward to my packed schedule next month!\nThe view from the River (Thames)\nLast week, I hosted an event in Parliament to recognise the individual sacrifices and generosity shown by Ukrainian residents and host families in Finchley and Golders Green – however it became so much more than that. It was an evening of music, dancing and laughter, where young Ukrainian residents could form lasting bonds. Amidst the dark and chaotic geopolitical landscape, it was heart-warming to see people coming together in a show of strength and hope.\nFurthermore, against such a tumultuous global picture, the Labour Government has been getting to work delivering on its Plan for Change. I’ve been proud to vote on legislation that will have a real impact on the lives of people in Finchley and Golders Green.\nKickstarting economic growth is vital. It’s how we’ll spread opportunity in our communities and rebuild our ailing public services. Building the homes and infrastructure we need – from railways to data centres – is key to growth. That’s why I am backing the Planning and Infrastructure Bill which will enable our ambitious home delivery programme. The Government will invest in social and affordable housing shows that we are gripping the housing crisis.\nWe are also working hard to improve the experience of those in the private rental sector. The Renters’ Rights Bill will make no-fault evictions a thing of the past and the Commonhold White Paper will end the feudal leasehold system in this country. We are delivering a comprehensive plan that will ensure that people in Finchley and Golders Green can feel secure in their homes.\nIn addition, I was pleased to hear the Home Secretary announce new measures in the Crime and Policing Bill which will give the police more powers to stop protests outside places of worship like synagogues, mosques and churches. One of the best things about Finchley and Golders Green is its diversity – people are entitled to feel safe attending their place of worship. Labour will ensure that our area continues to be the brilliantly diverse, tolerant and cohesive community that makes it so special.\nPutting the ‘justice’ in social justice…\nAs Minister of State for Courts and Legal Services I am determined to tackle the crisis in our courts. So, I announced an increase in court sitting days to record levels. We need to deliver swifter justice for victims – this is just the start of delivering the radical change we need in our court system.\nI was also delighted to announce £6 million of funding for legal aid services and centres such as the Citizens Advice Bureau. This will ensure that everyone has access to the justice system, no matter their ability to pay.\nI have also been using my role to advocate for Britain’s legal services as part of our mission for growth. I was thrilled to announce £1.5 million in investment for start-ups in Law tech – an industry where the UK is world leading. We have also passed the Arbitration Act which will make Britain the jurisdiction of choice for legal and arbitration services.\nLast month I also wrapped up my time on the committee as the Minister on the Terminally Ill Adults (End of Life) Bill. The debate around this Bill has been sensitive, with strong feelings on both sides. That is why I am pleased that the parliamentary process has been conducted with respect and care. This helps lawmakers refine and improve legislation, making sure we provide the strongest safeguards possible in the composition of this bill. It really was the parliamentary system working at its best.\nThe fun bit…\nPhoto of the month by my Head of Office, Rachel\nWishing you a happy Easter, Chag Pesach Sameach or wonderful spring!\nBest wishes,\nSarah Sackman\nMember of Parliament for Finchley and Golders Green\nUp and coming …\nFinchley Symphony Orchestra Concert on the 17th of May book online at\nhttps://www.finchleysymphony.org/",
  "https_sarahsackman_com_/https_sarahsackman_com_2025_04_24_yvette-cooper-visits-the-first-free-breakfast-club-in-finchley/content_7.html": "Toast, Cornflakes and a visit from the Home Secretary\nSarah Sackman MP and Home Secretary Yvette Cooper visit the first free breakfast club at Tudor Primary School.\nThis week I had the pleasure of visiting Tudor Primary School in West Finchley with the Home Secretary, Yvette Cooper, for the opening of their first free breakfast club. Alongside Claremont Primary School in Cricklewood, this school has been chosen as one of 750 primary schools nationwide to be part of this Government’s free breakfast club roll out scheme. Under Labour, no child will start their school day on an empty tummy.\nThe scheme also means that parents can receive at least 30 minutes free childcare every morning. This will have an enormous impact on parents, especially mothers, in their efforts to get back to work and pursue a career. Free childcare coupled with savings to the tune of £450 per year means that parents can expect to see the policy put more money back in their pockets.\nThe children and staff at Tudor Primary school gave me a spring in my step as I headed back to work after the Easter holidays. The Executive Headteacher, Andy Griffiths, was rightly proud to be able to show a Cabinet Minister the community he, along with the other brilliant staff, had built in the school.\nIndeed, the children I met were brilliantly inquisitive, polite and insightful. I had a great discussion over a bowl of cornflakes with a girl in Year 6 about her future career in business and then a heated debate with a boy in Year 1 about the probable outcome of the upcoming Arsenal v PSG match. They really were a testament to the school. I am so pleased that this Labour Government will nurture their learning and development by providing a free breakfast club everyday before school. I look forward to seeing this rolled out across Finchley and Golders Green.",
  "https_sarahsackman_com_/https_sarahsackman_com_'https:_sarahsackman_com_2025_04_17_finchleys-own-cladding-scandal_'/content_17.html": "“We cannot lose sight of the families and individuals behind the statistics of our national housing crisis.”\nIt has been discovered that a block of flats in North Finchley had its ESW1 forms forged. ESW1 forms were established after the tragedy at Grenfell Tower in 2017. Ensuring that external wall systems are properly assessed for fire safety, it beggars’ belief that North Finchley has found itself amid its very own cladding scandal.\nResidents have been in touch about this forgery. Understandably, people feel unsafe in their own homes suffering from severe mental health issues as a result.\nMany now wish to sell their homes due to the distress caused. Yet, residents were told that in order to tell their properties the ESW1 forms needed to be recommissioned. This, alongside poor communication and a lack of clarity on the matter have culminated in serious anger and frustration.\nUpon hearing resident’s stories, I met with the Chief Executive of Peabody, the housing association in charge of the flats. I wanted to relay residents’ concerns, get their guarantee of improved communication going forward and most importantly ensure that the building was safe for people to live in.\nPeabody have now set in place a 108-week programme for remediation works to the roof and cladding with a projected completion date of June 2027, with work commencing on 14th April. They have also advised that an EWS1 is not required to progress sales or support finance applications for leaseholders in the building. I am committed to holding Peabody to account to their time frames to ensure that residents of always feel heard, respected and safe in their homes.\nThis case is a stark reminder to us, as politicians, that we cannot lose sight of the families and individuals behind the statistics of our national housing crisis. As the MP for Finchley and Golders Green I am committed to advocating for residents whose homes and lives are entangled with the scandal and complacency of housing providers and associations. But, solving these issues using a case-by-case approach is not enough. We need systematic change – not just sticking plasters.\nThis Government has an ambitious plan to deliver 1.5 million new homes over the next five years through the Planning and Infrastructure Bill. This is backed up with £2 billion investment into social and affordable homes. We are also introducing new laws to improve the quality of existing homes. The Renters’ Rights Bill will end no-fault evictions and ensure that landlords can no longer delay repairs and replacements. From fixing the current mess in our housing system, to making it future proof – this Government is taking the steps that will set us on the right course.\nWatch to find out more.\nThis Labour Government has an ambitious agenda to transform housing in this country. Watch this video to find out more.",
  "https_sarahsackman_com_/https_sarahsackman_com_category_newsletter/content_14.html": "Newsletter My first Community Newsletter – April 2025 14.04.2025 Welcome to my first Community Newsletter as your MP in Finchley & Golders Green. Read more",
  "https_sarahsackman_com_/https_sarahsackman_com/content_1.html": "Welcome!\nFinchley and Golders Green is where I was born and raised, playing with my sisters in Golders Hill Park or going on trips to the Phoenix Cinema – where I now take my two daughters. It is an honour to represent a place so close to my heart.\nBut, I know that in recent years our community is feeling worse off. From action to bring down the cost of living, rebuild our public services, and tackle crime and anti-social behaviour on our streets – I will be campaigning by your side to deliver what you deserve.\nStay up to date\nI am here to deliver for you. I have spent the last decade standing up for our community as a barrister and community campaigner – and I am delighted to be continuing that work in Parliament.\nMy team and I are working hard—holding surgeries, actioning casework, and attending residents’ meetings to hear your concerns. Residents tell me they are already seeing the results that having a Labour MP makes. But there is always more to do.\nI want to hear from you. If you have any casework we can help with, from housing to health, please Get in Touch. Or, if you want to stay up to date or get involved with our local community campaigns, please sign up to my community blog.\nTogether, we can deliver for Finchley & Golders Green.",
  "https_sarahsackman_com_/https_sarahsackman_com_2025_03_31_local-school-girl-meets-the-prime-minister-at-no10/content_19.html": "For International Women’s Day (8th of March) I was delighted to nominate one of our constituents to the Prime Minister’s Downing Street reception. Kaitlynn Eldrett, a 15-year-old from Childs Hill, was recognised for her inspirational work setting up the first girls football team at Whitefield School.\nWhen Kaitlynn started secondary school, she went to a football session aimed at getting more girls involved in the sport only to find she was one of only two girls who showed up. Not to be deterred, she undertook leadership training the following year and at the end of Year 9, created ‘She Can Play’, to encourage girls to get involved in sports. It has been a resounding success.\nThe Prime Minister mentioned Kaitlynn in his reception speech, which paid tribute to the efforts of all the women in attendance who have ‘planted the seeds to transform the future’. Kaitlynn’s success is a testament to both the support of a strong, nurturing community of women and her own drive and brilliance.\nAfter the event, Kaitlynn’s mum Kayleigh said that ‘as a single mum, to see [her] daughter recognised for all her hard work by the Prime Minister was a once in a lifetime opportunity.’\nKaitlynn and the Prime Minister chatted about their mutual love of football, though it appears they had to agree to disagree on the best team – Kaitlynn is a big Chelsea fan, whilst the Prime Minister is a known Arsenal lover. Had I been there, I would, of course, have rounded off the North-West London checklist by advocating for Spurs.\nKaitlynn is now playing for Camden Town Women’s League and has also earned her Hertfordshire FA Coaching Award. She is one of many exceptional women in Finchley and Golders Green who continue to inspire our community. I can’t wait to see what the future holds for her.",
  "https_sarahsackman_com_/https_sarahsackman_com_category_community_blog/content_8.html": "Yvette Cooper visits the first free breakfast club in Finchley!\nToast, Cornflakes and the Home Secretary. Back to school after the Easter break.\nRead moreToast, Cornflakes and the Home Secretary. Back to school after the Easter break.\nRead moreA block of flats in North Finchley had its ESW1 forms forged. ESW1 forms were established after the tragedy at Grenfell Tower in 2017.\nRead moreThis week, I sent out surveys to all Finchley and Golders Green residents to understand what you love, and more importantly, what you want changed about your community.\nRead moreFor International Women’s Day (8th of March) I was delighted to nominate one of our constituents to the Prime Minister’s Downing Street reception.\nRead moreThis summer, when I first was elected to office, I received a staggering number of emails regarding anti-social behaviour, theft and other forms of crime in our area\nRead more",
  "https_sarahsackman_com_/https_sarahsackman_com_blog/content_4.html": "Yvette Cooper visits the first free breakfast club in Finchley!\nToast, Cornflakes and the Home Secretary. Back to school after the Easter break.\nRead moreToast, Cornflakes and the Home Secretary. Back to school after the Easter break.\nRead moreA block of flats in North Finchley had its ESW1 forms forged. ESW1 forms were established after the tragedy at Grenfell Tower in 2017.\nRead moreWelcome to my first Community Newsletter as your MP in Finchley & Golders Green.\nRead moreThis week, I sent out surveys to all Finchley and Golders Green residents to understand what you love, and more importantly, what you want changed about your community.\nRead moreFor International Women’s Day (8th of March) I was delighted to nominate one of our constituents to the Prime Minister’s Downing Street reception.\nRead moreThis summer, when I first was elected to office, I received a staggering number of emails regarding anti-social behaviour, theft and other forms of crime in our area\nRead more",
  "https_sarahsackman_com_/https_sarahsackman_com_'https:_sarahsackman_com_2024_11_27_resident_safety_'/content_18.html": "“Residents deserve to feel safe going about their daily lives. I am determined to grip the crime problem in our local area.”\nThis summer, when I first was elected to office, I received a staggering number of emails regarding anti-social behaviour, theft and other forms of crime in our area. Residents in Finchley and Golders Green tell me that they no longer feel safe.\nWhen I was growing up, I enjoyed peace of mind when doing daily tasks. Going shopping with my mum, walking to my friends house, leaving my bicycle outside. Now, from North Finchley to Hampstead Garden Suburb, Cricklewood to East Finchley, residents from across the constituency tell me that they no longer feel safe.\nSo, after conducting a survey of local residents, I arranged multiple meetings at all levels of the Met Police. During these meetings I relayed the concerns of residents and the futility they feel when reporting to the police.\nHere were the key outcomes of these meetings:\n1. Residents should continue to report incidents to the police. Although it sometimes feels futile, resources can only be allocated to the appropriate locations with report figures as evidence.\n2. Residents should avoid walking around with your phone out in public to stop the blight of phone-snatching. The local hotspots are East and North Finchley High Road as well as other main roads.\n3. Please get in touch with my office – at [email protected] – with your crime number if you would like us to ask the police for an update on your case.\nSince these meetings, more residents have been in touch about the need to stop local theft in the area. If you belong to a group of residents who have recently been impacted by burglary or vehicle theft, please feel free to arrange a meeting with myself or a member of our team so we can relay your concerns to the local police.\nThis Government, is determined to tackle crime and its causes. We will fund more local police officers so that every area can get more bobbies on the beat. We will also create Youth Hubs and boost life chances for young people to tackle crime at its root cause.\nAs ever, if you are concerned or want to reach out to my office please email me at [email protected].",
  "https_sarahsackman_com_/https_sarahsackman_com_2024_11_27_resident_safety/content_6.html": "“Residents deserve to feel safe going about their daily lives. I am determined to grip the crime problem in our local area.”\nThis summer, when I first was elected to office, I received a staggering number of emails regarding anti-social behaviour, theft and other forms of crime in our area. Residents in Finchley and Golders Green tell me that they no longer feel safe.\nWhen I was growing up, I enjoyed peace of mind when doing daily tasks. Going shopping with my mum, walking to my friends house, leaving my bicycle outside. Now, from North Finchley to Hampstead Garden Suburb, Cricklewood to East Finchley, residents from across the constituency tell me that they no longer feel safe.\nSo, after conducting a survey of local residents, I arranged multiple meetings at all levels of the Met Police. During these meetings I relayed the concerns of residents and the futility they feel when reporting to the police.\nHere were the key outcomes of these meetings:\n1. Residents should continue to report incidents to the police. Although it sometimes feels futile, resources can only be allocated to the appropriate locations with report figures as evidence.\n2. Residents should avoid walking around with your phone out in public to stop the blight of phone-snatching. The local hotspots are East and North Finchley High Road as well as other main roads.\n3. Please get in touch with my office – at [email protected] – with your crime number if you would like us to ask the police for an update on your case.\nSince these meetings, more residents have been in touch about the need to stop local theft in the area. If you belong to a group of residents who have recently been impacted by burglary or vehicle theft, please feel free to arrange a meeting with myself or a member of our team so we can relay your concerns to the local police.\nThis Government, is determined to tackle crime and its causes. We will fund more local police officers so that every area can get more bobbies on the beat. We will also create Youth Hubs and boost life chances for young people to tackle crime at its root cause.\nAs ever, if you are concerned or want to reach out to my office please email me at [email protected].",
  "https_sarahsackman_com_/https_sarahsackman_com_about/content_2.html": "My name is Sarah Sackman and I am proud to represent our community in Parliament\nI was born and raised here, playing with my sisters in Golders Hill Park and taking trips to the Phoenix Cinema. My childhood taught me my values – fairness, taking responsibility, looking out for your neighbour. I now share those values with my two daughters.\nGrowing up, I learned what a community can be at its best. But after 14 years of Conservative rule, it is clear that our community and our country wants change.\nI started my career as a lawyer volunteering at Toynbee Hall Advice Centre. The housing cases I worked on at my time there inspired me to build a career fighting for communities. I then practiced for 15 years as a barrister in public law serving individuals, businesses and public bodies. I have been a school governor, a charity trustee and campaigned to restore services for disabled children in our area, I have had a career in public service, and I am delighted to continue that as your MP.\nAfter my election as your MP, I was asked by the Prime Minister to also serve as Solicitor General and now as a Minister of State for Justice. I am determined to restore confidence to our failing justice system. The previous Government left our prisons at breaking point and our courts and tribunals overwhelmed – letting down victims, children, employers, employees and business. People in Finchley and Golders Green deserve a justice system that will serve them in their hour of need.",
  "https_sarahsackman_com_/https_sarahsackman_com_petition-for-harpenmead-point-compensation/content_21.html": "Add Your Signature\nSince January 2025, residents of the Granville Road estate have suffered protracted issues with their water supply. Residents were informed that work to fix a burst water would take place on 28th and 29th January. Nothing happened. Without any communication, works began on 30th January and a catalogue of errors meant many residents were left without water until 14th February. The water that then came through their taps was contaminated and a drinkable water supply wasn’t restored until 25th February. The contractor responsible for the works, Mulalley, failed to communicate regularly and accurately with residents, failing to show up to a residents’ meeting to discuss the situation and not providing adequate updates on the situation as it developed.\nWe, the undersigned, want to see the affected residents of Harpenmead Point adequately compensated for the lack of water supply and the way they have treated by Mulalley. We are calling on Mulalley to provide financial compensation for the financial, practical and emotional impact that their failings. Residents have had to pay from their own pockets for bottled water and laundry costs, as well as missing days at work because of the extent of the issues. This must be remedied.\nWe are also seeking assurances from Mulalley on how they will ensure that no resident is ever treated like this again. An apology is not enough.",
  "https_sarahsackman_com_/https_sarahsackman_com_'https:_sarahsackman_com_2025_03_31_response-to-residents-on-potholes-and-pavements_'/content_16.html": "This week, I sent out surveys to all Finchley and Golders Green residents to understand what you love, and more importantly, what you want changed about your community. It was wonderful to see so many of you highlighting our green spaces as your favourite thing about the area – it’s something I love about Finchley and Golders Green too. Protecting these spaces is essential.\nOn what needs to be changed, I’ve heard your message loud and clear – road maintenance and street cleanliness are a main priority for residents. All residents deserve to feel safe travelling around their neighbourhood, whether that’s through fixing potholes, or reducing air pollution.\nIn the new year, it was confirmed that Barnet Council would receive an extra £1.2 million from the Government for road maintenance. This is the third highest figure across all London boroughs. On top of this, just this week, the Department for Transport announced an extra £500 million would be unlocked from April to fund further road maintenance alongside the Local Government Authority. This will support authorities to fix up to 7 million potholes around the country.\nGet updates on this and other similar local issues\nMore widely, it was great to see so many residents involved in Earthwatch’s ‘Tiny Forest’ initiative this week. Volunteers planted 1,800 new trees by the North Circular in Finchley to tackle air pollution in the area. Students from Brookland Infant and Nursery School, Kerem Primary School, Moss Hall Nursery, Brooklands Junior School and Henrietta Barnett School participated in the day. Allowing biodiversity to thrive in the city allows for greener, healthier spaces which we can all enjoy.\nI want residents to love their neighbourhoods, so your survey responses are important. Please do continue to send them through to my office, and I hope we can deliver on as many of your ideas as possible.",
  "https_sarahsackman_com_/https_sarahsackman_com_2025_04_17_finchleys-own-cladding-scandal/content_5.html": "“We cannot lose sight of the families and individuals behind the statistics of our national housing crisis.”\nIt has been discovered that a block of flats in North Finchley had its ESW1 forms forged. ESW1 forms were established after the tragedy at Grenfell Tower in 2017. Ensuring that external wall systems are properly assessed for fire safety, it beggars’ belief that North Finchley has found itself amid its very own cladding scandal.\nResidents have been in touch about this forgery. Understandably, people feel unsafe in their own homes suffering from severe mental health issues as a result.\nMany now wish to sell their homes due to the distress caused. Yet, residents were told that in order to tell their properties the ESW1 forms needed to be recommissioned. This, alongside poor communication and a lack of clarity on the matter have culminated in serious anger and frustration.\nUpon hearing resident’s stories, I met with the Chief Executive of Peabody, the housing association in charge of the flats. I wanted to relay residents’ concerns, get their guarantee of improved communication going forward and most importantly ensure that the building was safe for people to live in.\nPeabody have now set in place a 108-week programme for remediation works to the roof and cladding with a projected completion date of June 2027, with work commencing on 14th April. They have also advised that an EWS1 is not required to progress sales or support finance applications for leaseholders in the building. I am committed to holding Peabody to account to their time frames to ensure that residents of always feel heard, respected and safe in their homes.\nThis case is a stark reminder to us, as politicians, that we cannot lose sight of the families and individuals behind the statistics of our national housing crisis. As the MP for Finchley and Golders Green I am committed to advocating for residents whose homes and lives are entangled with the scandal and complacency of housing providers and associations. But, solving these issues using a case-by-case approach is not enough. We need systematic change – not just sticking plasters.\nThis Government has an ambitious plan to deliver 1.5 million new homes over the next five years through the Planning and Infrastructure Bill. This is backed up with £2 billion investment into social and affordable homes. We are also introducing new laws to improve the quality of existing homes. The Renters’ Rights Bill will end no-fault evictions and ensure that landlords can no longer delay repairs and replacements. From fixing the current mess in our housing system, to making it future proof – this Government is taking the steps that will set us on the right course.\nWatch to find out more.\nThis Labour Government has an ambitious agenda to transform housing in this country. Watch this video to find out more.",
  "https_sarahsackman_com_/https_sarahsackman_com_'https:_sarahsackman_com_2025_04_24_yvette-cooper-visits-the-first-free-breakfast-club-in-finchley_'/content_9.html": "Toast, Cornflakes and a visit from the Home Secretary\nSarah Sackman MP and Home Secretary Yvette Cooper visit the first free breakfast club at Tudor Primary School.\nThis week I had the pleasure of visiting Tudor Primary School in West Finchley with the Home Secretary, Yvette Cooper, for the opening of their first free breakfast club. Alongside Claremont Primary School in Cricklewood, this school has been chosen as one of 750 primary schools nationwide to be part of this Government’s free breakfast club roll out scheme. Under Labour, no child will start their school day on an empty tummy.\nThe scheme also means that parents can receive at least 30 minutes free childcare every morning. This will have an enormous impact on parents, especially mothers, in their efforts to get back to work and pursue a career. Free childcare coupled with savings to the tune of £450 per year means that parents can expect to see the policy put more money back in their pockets.\nThe children and staff at Tudor Primary school gave me a spring in my step as I headed back to work after the Easter holidays. The Executive Headteacher, Andy Griffiths, was rightly proud to be able to show a Cabinet Minister the community he, along with the other brilliant staff, had built in the school.\nIndeed, the children I met were brilliantly inquisitive, polite and insightful. I had a great discussion over a bowl of cornflakes with a girl in Year 6 about her future career in business and then a heated debate with a boy in Year 1 about the probable outcome of the upcoming Arsenal v PSG match. They really were a testament to the school. I am so pleased that this Labour Government will nurture their learning and development by providing a free breakfast club everyday before school. I look forward to seeing this rolled out across Finchley and Golders Green.",
  "https_sarahsackman_com_/https_sarahsackman_com_'https:_sarahsackman_com_2025_03_31_local-school-girl-meets-the-prime-minister-at-no10_'/content_20.html": "For International Women’s Day (8th of March) I was delighted to nominate one of our constituents to the Prime Minister’s Downing Street reception. Kaitlynn Eldrett, a 15-year-old from Childs Hill, was recognised for her inspirational work setting up the first girls football team at Whitefield School.\nWhen Kaitlynn started secondary school, she went to a football session aimed at getting more girls involved in the sport only to find she was one of only two girls who showed up. Not to be deterred, she undertook leadership training the following year and at the end of Year 9, created ‘She Can Play’, to encourage girls to get involved in sports. It has been a resounding success.\nThe Prime Minister mentioned Kaitlynn in his reception speech, which paid tribute to the efforts of all the women in attendance who have ‘planted the seeds to transform the future’. Kaitlynn’s success is a testament to both the support of a strong, nurturing community of women and her own drive and brilliance.\nAfter the event, Kaitlynn’s mum Kayleigh said that ‘as a single mum, to see [her] daughter recognised for all her hard work by the Prime Minister was a once in a lifetime opportunity.’\nKaitlynn and the Prime Minister chatted about their mutual love of football, though it appears they had to agree to disagree on the best team – Kaitlynn is a big Chelsea fan, whilst the Prime Minister is a known Arsenal lover. Had I been there, I would, of course, have rounded off the North-West London checklist by advocating for Spurs.\nKaitlynn is now playing for Camden Town Women’s League and has also earned her Hertfordshire FA Coaching Award. She is one of many exceptional women in Finchley and Golders Green who continue to inspire our community. I can’t wait to see what the future holds for her."
}