{
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_2024_08_04_news/content_8.html": "Thirteen trees have been marked for felling.\nAt the end of July fire broke out in the Millbrook Old Cemetery where the fire brigade attended and thankfully extinguished the blaze in one corner of the site.\nAlready there are 13 pink fluorescent paint markings on trees, indicating they need to be felled. It appears a few more mature firs are being left in the hope they survive the ordeal.\nThe Leyland cypress trees were planted to border the area and make the area more scenic. They grow quickly and can easily be replaced, but should they?\nAsh trees around Hampshire and indeed in the city have been infected with ash dieback however there are trees that have resistance and the old cemetery might be one spot where ash trees could thrive and help the flora and fauna around the graves.\nAs the site is maintained by Southampton City Council, they have a duty to make the area safe and will make the decision how to replant the area.\nAlso, whatever trees are planted they may need maintaining during the first couple of years as our city can experience considerably dry summer months.\nEnd.\nNotes:\n1/ Southampton Green Party are actively campaigning for the city to take more precautions whilst weather patterns are causing hotter summers.",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_people/content_10.html": "Your Local Team\nCllr. Katherine Barbour, Portswood Ward. Southampton\nKatherine is Southampton City Council’s first Green Councillor, She strongly believes that Southampton residents deserve excellent healthcare, great homes and safe, clean water.\nCLLR. MATT RENYARD, COXFORD WARD, SOUTHAMPTON\nMatt was first elected as a councillor for Coxford ward in 2019. Matt will continue to represent the Coxford residents as he always has. He will still be holding his regular Saturday morning surgeries at Lordshill Library.\nLISA FRICKER, CO-ORDINATOR AND NOMINATING OFFICER, Southampton\nLisa has been involved in local politics for many years in Southampton. She is currently the co-ordinator and one of the nominating officers for Southampton & District Green Party.\nYour Local Officers\nNEIL KELLY, TRADE UNION LIAISON OFFICER, SOUTHAMPTON\nNeil is a local artist with a studio at the Arches complex in town. He has stood for the Green Party in both local and National elections, polling a respectable 7% + in each. He lives in Woolston and is keen to strengthen ourpresence there. Neil is the Trade Union Liaison Officer\nJOANNE CLEMENTS, MEMBERSHIP OFFICER, SOUTHAMPTON\nJoanne lives in Shirley and has been a member of the Green Party since 2011. She is particularly interested in healthy environments plus health and wellbeing in general\nJAMES DALZIEL, SOCIAL FUNCTIONS OFFICER, SOUTHAMPTON\nJames has lived in Southampton for more than 10 years, and works as a geoscientist in natural hazard research. He is passionate about renewable energy, combating the climate emergency, and creating a fair and equitable society through people-powered movement.\nGEOFF SKINNER, NOMINATIONS OFFICER, SOUTHAMPTON\nGeoff has lived in and around Southampton for more than 40 years, and worked in IT all his life, but is now retired. He is passionate about the future of the planet and the impact it will have on our children and grandchildren and then mess we are leaving them.\nJOE COX, DIGITAL OFFICER, SOUTHAMPTION\nJoe continues to volunteer for the Green Party having undertaken over a couple of decades of support in various roles. Currently he is contributing with social media and contributing to backroom digital tasks.",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_2025_04_14_bus-gate-update/content_9.html": "MESSAGE FROM COUNCILLOR BARBOUR\nMy inbox has been flooded with residents contacting me regarding concerns about the Portswood Bus Gate. I am now doing regular updates to people who have contacted me, as the council informs me of progress. If you would like to receive these updates,please email me, councillor.k.barbour@southampton.gov.uk, and I will add you to the distribution list.\nMany people assume I am in favour of the Bus Gate as I am a Green Councillor, and of course the Green Party favours active travel and a reduction in car use. So the idea of the Bus Gate is excellent. Unfortunately, we have an administration who did not listen to the concerns that local people put forward before the trial started.\nAs a result, local streets have become rat runs and there has been an increase in dangerous driving along Belmont Road and Brookvale Roads. I called on Cllr Keogh,cabinet lead for transport, to halt the trial to get these issues sorted, but he hasrefused. So all the negatives of this project are landing on our streets and none of the potential benefits have been realised. Some local traders have told me that their overall business is down by between 15% and 70%. I have to wonder, how this figure would be if the scheme had tackled residents’ issues and concerns.\nThankfully, the chicane on Brookvale Road has been removed following pressure from all the residents who contacted me about this and local people giving examples of the dangers here. Well done to everyone involved.",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_2025_04_14_around-the-city-spring-summer-2025/content_5.html": "GREENS MAKING A DIFFERENCE – CHECK OUT WHAT WE’VE BEEN UP TO\nLOVE WHERE YOU LIVE\nFollowing the excellent work being done in St Denys each month to do litter picks, local residents in Portswood Park have joined together to do the same thing in Belmont Road, Spring Crescent, Thackeray Road and Woodside Road. If you live in this area and would like to get involved do message or email Katherine and she will let you know the details . Future dates will be advertised\non Facebook.\nPLAY AREA REOPENED\nThe play area outside Sainsbury’s has reopened following a 3 month closure for landscaping and health and safety audits. Katherine put continuous pressure on the shop to get it reopened, and this has now been done. One of the conditions of Sainsbury’s getting planning permission for this store was the provision of a play area so this must be maintained and the Green Teamwill ensure that this vital area that is much used by our local children, is not forgotten.\nJUSTICE TALKS\nRecently, Katherine was invited to meet with members of Amnesty International at the Write for Rights Event. She spoke in support of Environmental Lawyer Dang Digh Bach, who has been arrested in Vietnam after dedicating his life to protecting the country’s people from the harmful effects of pollution. Amnesty International highlighted his plight – “Bach was charged with ‘tax evasion’ and later sentenced to five years in prison following a trial that that UNexperts considered unfair.” If you want to find out more, please visit – www.amnesty.org",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_author_joe/content_6.html": "1 December 2024 / 26 March 2025 by Joseph Cox\nLast Wednesday saw two members of Southampton and District Green Party deliver a deputation to Southampton City Council. As part of full council meeting, Professor Barrie Margetts and Lori Foster delivered a deputation questioning what exactly would be involved in the new transition plans for adult and child social care, following a £42m savings announcement […]\nRead more »\nThe fire at Millbrook Old Cemetery reported by us early August meant the ten trees pictured above had to be felled. Now there is a bleak almost dystopic scene left in one corner of the cemetery where the area probably is being used to hoard grass cuttings away from the trees, meaning fire risks in […]\n13 September 2024 / 26 March 2025 by Joseph Cox\nDue to the resignation of a Councillor in Shirley ward a by-election has been called for the 10th October. Barrie Margetts (pictured), has been selected to stand for the Green Party and has an excellent work record in Southampton as a previous Councillor and as a Professor at University of Southampton. Barrie has lived in […]\n4 August 2024 / 26 March 2025 by Joseph Cox\nThirteen trees have been marked for felling. At the end of July fire broke out in the Millbrook Old Cemetery where the fire brigade attended and thankfully extinguished the blaze in one corner of the site. Already there are 13 pink fluorescent paint markings on trees, indicating they need to be felled. It appears a […]",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_2024_12_01_millbrook-old-cemetery-trees-now-felled/content_11.html": "The fire at Millbrook Old Cemetery reported by us early August meant the ten trees pictured above had to be felled.\nNow there is a bleak almost dystopic scene left in one corner of the cemetery where the area probably is being used to hoard grass cuttings away from the trees, meaning fire risks in hot weather might not be quite so worrying.",
  "http_southampton_greenparty_org_uk_/http_southampton_greenparty_org_uk/content_1.html": "WORKING FOR A FAIRER GREENER CITY\nGreens in Southampton have a councillor elected in two of the City’s wards. Matt Renyard in Coxford and Katherine Barbour in Portswood.\nThe city has elections in 2026 where we hope to increase representation on the council.\nNews\nFind out what we’ve been up to, about issues in your area, and see the work we’ve done in the past.\n- Around the City – Spring/Summer 2025\n- Bus Gate Update\n- Latest defection to Green Party sees local leading Councillor leave Labour Party “broken-hearted”\n- Green Party Challenge Council plans for children\n- Millbrook old cemetery trees now felled\n- Barrie Margetts is Standing in Shirley.\nUpcoming Events\nCouncillor Surgeries\nCouncillor Renyard, most Saturdays at Lordshill Library at 10am. Please confirm an appointment by email.\nCouncillor Barbour, 4th Saturday of each month from 2pm – 3pm at St. Denys Church Centre, Dundee Road, SO17 2ND.\nGREEN PARTY SOCIAL EVENTS\nDetails of May event to follow.\nGet involved to help get Greens elected. A Green Councillor can make a world of difference to your local area.",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_2024_09_13_barrie-margetts-is-standing-in-shirley/content_15.html": "Due to the resignation of a Councillor in Shirley ward a by-election has been called for the 10th October.\nBarrie Margetts (pictured), has been selected to stand for the Green Party and has an excellent work record in Southampton as a previous Councillor and as a Professor at University of Southampton.\nBarrie has lived in the ward for 33 years and is a retired (Emeritus) Professor in the Faculty of Medicine at the University of Southampton where he worked in Public Health Nutrition and was actively involved for over twenty years in supporting the Southampton City Council’s efforts to improve public health in the city.\nHaving been elected as a Labour Ward councillor for Coxford in 2019 he put forward successful motions to full council on supporting the City becoming a Right to Food City (including free school meals for all) and to end holiday hunger. He also chaired the Health Overview Scrutiny Panel and was a member of the childhood obesity review.\nOther campaigns included:improvement of local bus services; keeping community centres, improved play areas for children; and safer streets.\nBarrie tells us,\n“I led campaigns to protect native forests and green spaces, campaigned against the expansion of the Southampton Airport runway, volunteered on the garden team at St James’s Park, and set up a gardening project to help residents. In 2020, I established Southampton Social Aid Group, a Food Club to provide food and other provisions for local people.’\n“I support the Green Party policies for a fairer, greener city.”",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_2025_03_26_latest-defection-to-green-party-sees-local-leading-councillor-leave-labour-party-broken-hearted/content_3.html": "This announcement regarding Cllr Matt Renyard, sitting Councillor for Coxford Ward, having served the Labour Party as:\n- Campaigning Member for 15 yrs\n- Chair of Southampton Test CLP for 4 yrs\n- Southampton representative on the Hampshire Police and Crime Panel for 3 yrs\n- Cabinet Member for Safer City for 2 yrs\nCouncillor Renyard will today be informing his Labour Colleagues and other elected members of Southampton City Council at today’s Full Council that he is resigning from the Labour Party, after being a Labour Councillor for the past six years, and now intends to serve with the Green Party.\nCouncillor Katherine Barbour welcomes Matt to the Green Party and says, “the Green Party is now becoming the only party that represents everyone in the city whether working or not – recent Labour policies will disadvantage huge swathes of the population and bring misery to families and people with ill health issues.”\nHe wants to reassure the residents of Coxford Ward that he will continue to strongly represent them in the same way he always has, through his regular Saturday morning surgeries at Lordshill Library, his Councillor email (councillor.m.renyard@southampton.gov.uk) and his strong presence on social media.\nHe indicates that it is becoming increasingly difficult to speak honestly within both the local and national Labour Party, highlighting that the Leader of the Southampton Labour Group, and therefore Southampton City Council, Cllr. Fielker, was not voted for by the elected members of the Labour Group as would normally be the case, and that controlling behaviour now seems to be the norm within the Party at every level.\nCouncillor Renyard says “Labour have broken my heart. They used to be the party that represented every day, ordinary people- fighting for the poor; the vulnerable; and both the working and middle classes. Following the first nine months of this newly elected Labour Government, it is clear that Labour has lost its way. It does not have a vision for fixing our broken economy with a new economic model that is fit for the 21st Century. The Green Party is putting together a clear vision for a future that works for the people, the planet, and future generations. Labour are simply carrying out the same old austerity.”",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk/content_17.html": "WORKING FOR A FAIRER GREENER CITY\nGreens in Southampton have a councillor elected in two of the City’s wards. Matt Renyard in Coxford and Katherine Barbour in Portswood.\nThe city has elections in 2026 where we hope to increase representation on the council.\nNews\nFind out what we’ve been up to, about issues in your area, and see the work we’ve done in the past.\n- Around the City – Spring/Summer 2025\n- Bus Gate Update\n- Latest defection to Green Party sees local leading Councillor leave Labour Party “broken-hearted”\n- Green Party Challenge Council plans for children\n- Millbrook old cemetery trees now felled\n- Barrie Margetts is Standing in Shirley.\nUpcoming Events\nCouncillor Surgeries\nCouncillor Renyard, most Saturdays at Lordshill Library at 10am. Please confirm an appointment by email.\nCouncillor Barbour, 4th Saturday of each month from 2pm – 3pm at St. Denys Church Centre, Dundee Road, SO17 2ND.\nGREEN PARTY SOCIAL EVENTS\nDetails of May event to follow.\nGet involved to help get Greens elected. A Green Councillor can make a world of difference to your local area.",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_donate/content_12.html": "We’re powered by people, not big business\nYour donation will help us get Greens elected.\nThe Green Party is funded through donations by individuals like you. We don’t take donations from businesses that are trying to sway our politics. Politics is about people, and delivering a society that puts them first. Can you donate to help us get Greens elected?",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_news/content_14.html": "Many people assume I am in favour of the Bus Gate as I am a Green Councillor, and of course the Green Party favours active travel and a reduction in car use. So the idea of the Bus Gate is excellent. Unfortunately, we have an administration who did not listen to the concerns that local people put forward before the trial started.\nLatest defection to Green Party sees local leading Councillor leave Labour Party “broken-hearted”\nCouncillor Renyard will today be informing his Labour Colleagues and other elected members of Southampton City Council at today’s Full Council that he is resigning from the Labour Party, after being a Labour Councillor for the past six years, and now intends to serve with the Green Party. Read more.\nAround the City – Spring/Summer 2025\nGreens making a difference – Check out what we’ve been up to\n- Love where you live\n- Play area reopened\n- Justice talks\nGreen Party Challenge Council plans for children\nLast Wednesday saw two members of Southampton and District Green Party deliver a deputation to Southampton City Council. As part of full council meeting, Professor Barrie Margetts and Lori Foster delivered a deputation questioning what exactly would be involved in the new transition plans for adult and child social care, following a £42m savings announcement via Newton Europe consultancy (itself costing the tax payer £9m). Read more .\nThe fire at Millbrook Old Cemetery reported by us early August meant the ten trees pictured in the linked article had to be felled.\nNow there is a bleak almost dystopic scene left in one corner of the cemetery where the area probably is being used to hoard grass cuttings away from the trees, meaning fire risks in hot weather might not be quite so worrying. Read more.\nBarrie Margetts is standing in Shirley\nDue to the resignation of a Councillor in Shirley ward a by-election has been called for the 10th October.\nBarrie Margetts (pictured), has been selected to stand for the Green Party and has an excellent work record in Southampton as a previous Councillor and as a Professor at University of Southampton. Read more.\nSouthampton members join Unity Rally.\nMembers of the Southampton Green Party attended the Unity Rally at Southampton Bargate on Saturday in solidarity. Standing to say “No more” to those who push racist, Islamophobic, anti-refugee, anti-semitic and xenophobic views. Read More.\nAftermath of fire at Old Millbrook cemetery\nAt the end of July fire broke out in the Millbrook Old Cemetery where the fire brigade attended and thankfully extinguished the blaze in one corner of the site. Read More",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_author_geoff-skinner/content_13.html": "14 April 2025 / 14 April 2025 by Geoff Skinner\nGREENS MAKING A DIFFERENCE – CHECK OUT WHAT WE’VE BEEN UP TO LOVE WHERE YOU LIVE Following the excellent work being done in St Denys each month to do litter picks, local residents in Portswood Park have joined together to do the same thing in Belmont Road, Spring Crescent, Thackeray Road and Woodside Road. If […]\nRead more »\nMESSAGE FROM COUNCILLOR BARBOUR My inbox has been flooded with residents contacting me regarding concerns about the Portswood Bus Gate. I am now doing regular updates to people who have contacted me, as the council informs me of progress. If you would like to receive these updates,please email me, councillor.k.barbour@southampton.gov.uk, and I will add you […]\n26 March 2025 / 26 March 2025 by Geoff Skinner\nThis announcement regarding Cllr Matt Renyard, sitting Councillor for Coxford Ward, having served the Labour Party as: Councillor Renyard will today be informing his Labour Colleagues and other elected members of Southampton City Council at today’s Full Council that he is resigning from the Labour Party, after being a Labour Councillor for the past six […]",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_2024_12_01_green-party/content_4.html": "Last Wednesday saw two members of Southampton and District Green Party deliver a deputation to Southampton City Council. As part of full council meeting, Professor Barrie Margetts and Lori Foster delivered a deputation questioning what exactly would be involved in the new transition plans for adult and child social care, following a £42m savings announcement via Newton Europe consultancy (itself costing the tax payer £9m).\nFocusing on the already faltering child social care system, Lori and Barrie asked whether outsourcing child care and continuing to use private companies for care was the plan. They shared personal stories of how cuts in other councils resulted in poor outcomes for looked after children and their families. They also asked for reassurances that efficiencies didn’t mean wholesale job cuts and reduced early intervention for struggling families.\nResponses were provided by Cllr Anne Marie Finn and Cllr Alexander Winning, offers of in depth transition explanation were given, and Professor Margetts and Lori Foster will follow this up to find out more. However, there were no direct answers about the possibility of job cuts and service reduction.\nNotwithstanding, Cllr. Winning did make a commitment to keeping and increasing looked after children’s placements within the city and cited the building of new children’s homes.\nSouthampton Green Party are dedicated to ensuring that already struggling families are not unduly impacted by money saving schemes and will do their utmost to hold the council and Newton Europe to account.",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_category_local-news/content_7.html": "14 April 2025 / 14 April 2025 by Geoff Skinner\nGREENS MAKING A DIFFERENCE – CHECK OUT WHAT WE’VE BEEN UP TO LOVE WHERE YOU LIVE Following the excellent work being done in St Denys each month to do litter picks, local residents in Portswood Park have joined together to do the same thing in Belmont Road, Spring Crescent, Thackeray Road and Woodside Road. If […]\nRead more »\nMESSAGE FROM COUNCILLOR BARBOUR My inbox has been flooded with residents contacting me regarding concerns about the Portswood Bus Gate. I am now doing regular updates to people who have contacted me, as the council informs me of progress. If you would like to receive these updates,please email me, councillor.k.barbour@southampton.gov.uk, and I will add you […]\n26 March 2025 / 26 March 2025 by Geoff Skinner\nThis announcement regarding Cllr Matt Renyard, sitting Councillor for Coxford Ward, having served the Labour Party as: Councillor Renyard will today be informing his Labour Colleagues and other elected members of Southampton City Council at today’s Full Council that he is resigning from the Labour Party, after being a Labour Councillor for the past six […]\n1 December 2024 / 26 March 2025 by Joseph Cox\nLast Wednesday saw two members of Southampton and District Green Party deliver a deputation to Southampton City Council. As part of full council meeting, Professor Barrie Margetts and Lori Foster delivered a deputation questioning what exactly would be involved in the new transition plans for adult and child social care, following a £42m savings announcement […]\nThe fire at Millbrook Old Cemetery reported by us early August meant the ten trees pictured above had to be felled. Now there is a bleak almost dystopic scene left in one corner of the cemetery where the area probably is being used to hoard grass cuttings away from the trees, meaning fire risks in […]\n13 September 2024 / 26 March 2025 by Joseph Cox\nDue to the resignation of a Councillor in Shirley ward a by-election has been called for the 10th October. Barrie Margetts (pictured), has been selected to stand for the Green Party and has an excellent work record in Southampton as a previous Councillor and as a Professor at University of Southampton. Barrie has lived in […]\n12 August 2024 / 26 March 2025 by lorifoster\nMembers of the Southampton Green Party attended the Unity Rally at Southampton Bargate on Saturday in solidarity. Standing to say “No more” to those who push racist, Islamophobic, anti-refugee, anti-semitic and xenophobic views. We stood with the people of Southampton, including members of Stand Up to Racism, Southampton Climate Action, Greenpeace, Unite, Southampton Muslim Council […]\n4 August 2024 / 26 March 2025 by Joseph Cox\nThirteen trees have been marked for felling. At the end of July fire broke out in the Millbrook Old Cemetery where the fire brigade attended and thankfully extinguished the blaze in one corner of the site. Already there are 13 pink fluorescent paint markings on trees, indicating they need to be felled. It appears a […]",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_contact/content_2.html": "Skip to content\nSkip to footer\nSouthampton\nMenu\nNEWS\nPeople\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nContact\nHome\nContact\nContact Us\nYour name\nYour email\nSubject\nYour message (optional)\nTo top",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_2024_08_12_southampton-members-join-unity-rally/content_16.html": "Members of the Southampton Green Party attended the Unity Rally at Southampton Bargate on Saturday in solidarity. Standing to say “No more” to those who push racist, Islamophobic, anti-refugee, anti-semitic and xenophobic views.\nWe stood with the people of Southampton, including members of Stand Up to Racism, Southampton Climate Action, Greenpeace, Unite, Southampton Muslim Council and members of Southampton city council. Southampton is a city of peace for those who need a safe home – as refugees from political, climate and man made disasters come to our city, the Green Party Southampton welcomes each person and stands with them.\nNotes:-",
  "http_southampton_greenparty_org_uk_/https_southampton_greenparty_org_uk_author_lorifoster/content_18.html": "12 August 2024 / 26 March 2025 by lorifoster\nMembers of the Southampton Green Party attended the Unity Rally at Southampton Bargate on Saturday in solidarity. Standing to say “No more” to those who push racist, Islamophobic, anti-refugee, anti-semitic and xenophobic views. We stood with the people of Southampton, including members of Stand Up to Racism, Southampton Climate Action, Greenpeace, Unite, Southampton Muslim Council […]\nRead more »"
}