{
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_communities/content_17.html": "KEEPING BASINGSTOKE BLUE\nThanks to the Conservative-led council, the priorities we want to achieve for our residents, businesses and our borough over the next four years are:\n- a place where people can live happily\n- a borough where the environment can flourish\n- a council that provides good quality services for our residents.\nStaying In Touch With You\nBasingstoke Conservatives are active on behalf of Basingstoke residents all year round, not just at election time. We live in a democracy, so not every ward has a Conservative representative in local government, but we do our best to provide a Conservative candidate in every ward at every local election so that those who support Conservative values have the choice of voting Conservative.\nWe would like to do more to keep in touch with the voters right across the town, but it's not always easy to find sufficient people to deliver leaflets in every ward. If you haven't seen a Conservative InTouch for a while, it's probably because we need your help to get our messages out. Please use the Contact button if you would like to help us or know someone else who might.\nFind your ward information from the left-hand column of this page.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_dissolution-parliament/content_28.html": "Tweet Wednesday, 3 May, 2017 Articles Much of the content on this website was established while Maria was a Member of Parliament. As Parliament has been dissolved, there are no MPs until after the General Election on Thursday 8th June 2017.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_mp-visits-another-good-basingstoke-school-chiltern-primary-school/content_15.html": "Local MP Maria Miller met Head Teacher Nathan Gazzard, staff and members of the School Council when she visited Chiltern Primary School, rated 'Good' by Ofsted. Maria wants every school in Basingstoke to be 'Good' or Outstanding'.\nMaria said, \"Chiltern is yet another Basingstoke school already rated 'Good' or 'Outstanding' by OFSTED, along with 85% of all schools in our community, something other communities can only dream of but I want to be even more ambitious to make sure every child has the opportunity to reach their full potential. Basingstoke's schools have worked hard to achieve higher OFSTED ratings and higher examination results, giving more children the opportunity to get the best results.\"\nMaria said, \"The Leadership and teaching at Chiltern means children and families are getting the support they need to succeed.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_maria-hears-about-work-hospitals-sexual-health-clinic/content_34.html": "Local MP Maria Miller recently visited the Sexual Health (Genito-Urinary Medicine) Clinic at Basingstoke and North Hampshire Hospital, to hear about their work. Maria was shown around the Clinic by the Practice Manager, Steve Day, and also met members of the Clinic’s staff, as well as representatives from BRASACC (Basingstoke Rape and Sexual Abuse Crisis Centre. The Mayor of Basingstoke and Deane, Cllr David Leeks, was also visiting the Clinic.\nMaria said: “The Clinic plays an important role in helping people with sexual health problems, including sexually transmitted infections and HIV/AIDS. They also work with people of all ages to provide information and advice.”\nShe added: “I was particularly interested to hear about the Clinic’s absolute commitment to total confidentiality for its clients. I would urge anyone who is concerned about their sexual health to visit the Clinic, knowing that they will receive a confidential and caring service.”\nInformation about the Clinic’s opening hours and contact details can be found on the Basingstoke and North Hampshire Hospital website - http://www.northhampshire.nhs.uk/our-services/a-z-clinical-services/sexual-health-genito-urinary-medicine-gum/",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_Join/content_30.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_people_arun/content_1.html": "Arun, having made Basingstoke his home for the past 15 years with his wife and two daughters has gained a deep understanding of the needs of this town.\nAn alumna of University of Winchester, his professional role as an Information Security Expert is one of the important business sectors here in Basingstoke.\nHe is an award-winning community champion and leader featured on BBC whose ability to bring people together and drive change is truly remarkable and exemplary.\nHe is passionate about supporting Basingstoke's diverse communities in fostering a better borough for all. He's proven to be a team player and a leader who can engage and pursue agendas to fruition.\nWhy you should VOTE FOR ARUN MUMMALA NENI?\nDO YOU HAVE A POSTAL VOTE?\nThe deadline to apply for a postal vote in England for the elections on 6th May 2021 is 5pm on Tuesday 20th April 2021. You must also be registered to vote by midnight on Monday 19th April 2021.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_hatchwarren-and-beggarwood/content_18.html": "Your Conservative team in Hatch Warren and Beggarwood\nBorough Cllrs Rebecca Bean, Samir Kotecha and Dan Putty continue to work for you as well as County Councillor Stephen Reid.\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Hatch Warren and Beggarwood. If you have any issues or concerns you’d like us to look into, please get in touch.\nYou will find more details about us on the Borough website.\nAs your Conservative team, we bring together parishes, the borough, the county and, with Maria Miller MP, parliamentary experience and resources to make things happen locally.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_basingstoke-south-west/content_25.html": "Basingstoke South West\nStephen Reid\nYou can find his details at Hampshire County Council.\nStephen Reid is one of the most experienced Councillors in Basingstoke. He is a Cabinet Member at Hampshire County Council, holding the vitally important finance and performance portfolio. He is committed to reducing the County's climate change footprint and has introduced a policy to make all the pool cars at Hampshire electric instead of diesel. He drives an electric car himself.\nA past Leader of Basingstoke and Deane Borough Council, Stephen's achievements include building the Anvil and the Leisure Park, and starting festival Place - making Basingstoke a regional centre for arts, leisure and shopping.\nStephen has lived in Basingstoke all his life. He was educated at the local state schools from where he gained a place at Cambridge University and read Economics. He is married and has four grown-up children.\nCommunicating With You\nYour local Conservative Team communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver InTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_kemi-launches-our-2025-local-elections-campaign/content_22.html": "Tweet Wednesday, 26 March, 2025 National News At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_mp-meets-volunteers-basingstoke-foodbank-event-chineham-tesco/content_21.html": "“Basingstoke Foodbank held a Big Collection event on the first weekend of December and it was a pleasure to meet the volunteers, Jane Stubbs the new Chineham Tesco Community Champion and store manager Rosalie Chammas .\nThe Foodbank Volunteers managed to collect nearly 3000 KG of donations that filled 298 crates from Tesco shoppers during the Big Collection Event for the Foodbank’s Christmas Hamper Project.\nShoppers were given a shopping list of items for the Christmas Hamper Project including Christmas Cake, Yule Long, Sponge Puddings, Christmas Crackers, Seasonal Stuffing and Tinned Meats.\nI would like to thank all of those involved in running and supporting the community hubs and Foodbank for their extraordinary efforts in ensuring that those in need of help have been supported. The Foodbank is only made possible because of the time and expertise given by those who run it and the generous donations of residents and businesses. Demonstrating what a strong and resilient community we have here in Basingstoke.”",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_category_Articles/content_14.html": "Dissolution Of Parliament 3rd May 2017 Much of the content on this website was established while Maria was a Member of Parliament. As Parliament has been dissolved, there are no MPs until after the... Articles\nLOCAL BREWERY GOING FROM STRENGTH TO STRENGTH 29th September 2011 Local MP Maria Miller performed the official opening of the new Andwell Brewing Company brewery on 23 September. Andwell’s has recently relocated from North... Articles\nMARIA VISITS LOCAL FIRM NOMINATED FOR “MADE IN BRITAIN” AWARD 29th September 2011 Maria Miller, MP for Basingstoke and also Minister for Disabled People in the Department for Work and Pensions, recently visited the Basingstoke firm Chas A... Articles\nMARIA VISITS TRELOAR’S COLLEGE 26th September 2011 Maria Miller, MP for Basingstoke and also Minister for Disabled People, visited Treloar’s College in Alton this week. Damian Hinds, MP for East Hampshire... Articles\nMARIA MEETS BASINGSTOKE’S SMALL BUSINESSES AT BREAKFAST EVENT 22nd September 2011 Maria Miller, MP for Basingstoke, was the guest speaker at a breakfast meeting of the North Hampshire Branch of the Federation of Small Businesses, held at the... Articles\nMARIA RESPONDS TO TEACHERS’ CONCERNS ABOUT PENSION CHANGES 22nd September 2011 Maria Miller, MP for Basingstoke, met a group of some thirty teachers at Queen Mary College on Friday 16 September, to listen to and respond to their concerns... Articles\nMARIA SHOWS SUPPORT FOR M3 JOB CLUB 19th September 2011 Basingstoke MP Maria Miller dropped into the M3 Job Club recently, for an update on the current events and activities at the Job Club from Richard Thayer, who... Articles\nMARIA BRIEFED ON VODAFONE SECURITY UPGRADES 19th September 2011 Local MP Maria Miller has visited the Vodafone facility in Basingstoke, the location of the criminal attack earlier this year which resulted in widespread loss... Articles\nMARIA HEARS ABOUT WORK OF HOSPITAL’S SEXUAL HEALTH CLINIC 19th September 2011 Local MP Maria Miller recently visited the Sexual Health (Genito-Urinary Medicine) Clinic at Basingstoke and North Hampshire Hospital, to hear about their work. Articles",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_people_type_Council-candidates/content_2.html": "Skip to main content\nBasingstoke\nConservatives\nMain navigation\nAbout Us\nNews\nEvents\nMaria Miller\nCommunities\nSlow It Down\nJoin\nContact\nBasingstoke\nConservatives\nCouncil candidates\nArun Mummala Neni\nCouncil candidates",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_maria-visits-local-firm-nominated-made-britain-award/content_31.html": "Maria was welcomed by Stephen Blatchford, owner and CEO, and heard from him about the company’s product manufacture and distribution, and also about its commitment to research and development. Blatchfords has been located in Basingstoke since 1962, and currently employs some 150 staff, with plans to increase this to around 180.\nMaria recetly nominated Blatchfords for the Made by Britain project, which aims to showcase the UK’s manufacturing sector.\nMaria said: “I am very pleased to visit another successful manufacturing company in Basingstoke. From what I have heard today, the workforce at Blatchfords is highly skilled and it is good to see that they have largely been able to recruit locally for these skilled roles.”\nMaria added: “As the Minister for Disabled People, I was particularly interested in the unique support Blatchfords offers to those who have lost a limb. Mobility is a vital part of independence to all of us; by providing prostheses and related services to the people who need them, Blatchfords is helping to improve the quality of many people’s lives.”",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_maria-meets-basingstokes-small-businesses-breakfast-event/content_32.html": "Following a welcome from Branch Chairman Tim Colman, Maria spoke about the economic situation and gave an overview of the measures the Government is taking to help small and medium enterprises. She also responded to questions on a range of issues.\nMaria said: “We are taking a whole range of actions to help smaller businesses to continue to prosper during these difficult times. These include the “Red Tape Challenge” to try to reduce burden of regulation on business, and new ways in which businesses can access finance and other support.”\nMaria added: “The Government’s biggest economic priority is to reduce the deficit and restore stability. Because of the overhang of debt, we have always warned that recovery would be choppy.”\nMaria also highlighted the important role that the M3 Local Enterprise Partnership has to play in the growth of local businesses, and applauded them for securing £210,000 from the Government’s Start Up Fund.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_cdn-cgi_l_email-protection/content_27.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_membership/content_4.html": "Being a member of Basingstoke Conservative Association means that you have joined the most open and democratic political party in Britain.\nAfter the first three months of your membership, you will be entitled to a vote in Party ballots - including the opportunity to vote for the Leader of the Conservative Party. You will also have a chance to influence Party policy by letting us know your views.\nAny person living in the United Kingdom is eligible to join the Conservative Party. Applicants are not required to be registered voters or UK nationals. There is no upper or lower age limit on membership, although children under the age of 15 cannot be enrolled as full voting members.\nPlease use one of the Join on-line buttons on this website.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_maria-visits-treloars-college/content_16.html": "Maria was welcomed by Tony Reid (Chief Executive), Amanda Quincey (Principal) and Michael del Mar (Chair of Governors) and heard from them about the education, care and therapy that Treloar’s provides for young people with severe and complex disabilities. She also heard about the forthcoming co-location of the College and the School, following the re-development of the Holybourne campus.\nMaria was shown around the new buildings, and also visited the Trailblazer unit, which is the UK’s first mobile service that assesses the needs of disabled young people at mainstream and special schools.\nMaria said: “I was very pleased to visit the new Treloar campus and hear about the fantastic work Treloar’s is doing to help disabled young people reach their potential.”\nMaria added: “I was also really interested to hear about the work placements that the students undertake, the independent living skills programme and the contact between Treloar’s and the local community. All of this is so important in helping the young people to plan for the future.”",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_local-mp-welcomes-legislation-creating-robust-building-regulations-and-safer-homes/content_12.html": "MP for Basingstoke Maria Miller spoke in the second reading of the Building Safety Bill on Wednesday. The Building Safety Bill seeks to give residents power to hold developers to account and seek compensation for substandard work. The Bill will also make it easier for homeowners to seek compensation for poor building construction, and will also create a new Building Safety Regulator to ensure the highest safety standards are met for high-rise buildings from design to occupation.\nThe Bill also creates a new homes ombudsman, which was called for in 2016 by the All-Party Parliamentary Group for Excellence in the Built Environment, in a report that Maria co-chaired after constituents told her of their problems with build quality.\nMaria Miller said,\n“I welcome the Bill, which requires a fundamental overhaul of our building industry’s attitude towards the quality of new homes. For too long, the biggest five builders have squeezed out smaller local home builders, whose reputation for quality is central to their business. The Bill makes build quality central to everyone’s business. First and foremost, however, we need to speak up for those who have been impacted by the building industry’s current fire safety regulatory failure. Those directly affected by the tragedy at Grenfell are always in our minds, but so are the people who own homes in high-rise flats. They continue to shoulder the worry resulting from construction work that has failed fire safety tests.”\n“The Government have acted rapidly, and by putting in place a £5 billion fund to cover remedial works, the Government are clear that they do not want the costs to fall on the shoulders of leaseholders. Building operators have also been able to get in-principle agreements for significant fire safety remedial works, but the worry for residents remains because some building owners might be cautious about starting remedial works without clear sight of what happens if additional problems are discovered. It’s important that the Government give additional assurances so freeholders aren’t able to passing on the cost of remedial works to leaseholders.”\nThe Building Safety Bill also includes in it provisions from Maria’s 2018 Private Members’ Bill (Fire Safety Information Bill), which required residents of high-rise buildings to be provided with far more fire safety information.\nMaria also raised concerns from Basingstoke constituents at debate, including about the complexity of building ownership structures, and the need for personal evacuation plan evaluations that work disabled and vulnerable people in the event of a fire.\nTo watch Maria’s full contribution, click here: https://parliamentlive.tv/event/index/9a26f78c-9111-4757-8db8-29c04e4e8586?in=18:02:32&out=18:05:40",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_category_National-News/content_29.html": "The Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News\nKemi gives a speech at the Alliance for Responsible Citizenship Conference 18th February 2025 On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values National News\nRebuilding Trust with our new Immigration Policy 10th February 2025 Kemi’s new plan for immigration shows the Party is back in the service of the British people National News\nKemi’’s First Speech of 2025: Rebuilding Trust 27th January 2025 Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party National News",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_contact/content_23.html": "This contact form puts you In Touch with Basingstoke Conservative Association, the Conservative Party in Basingstoke constituency.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_events/content_26.html": "Skip to main content\nBasingstoke\nConservatives\nMain navigation\nAbout Us\nNews\nEvents\nMaria Miller\nCommunities\nSlow It Down\nJoin\nContact\nBasingstoke\nConservatives\nFuture Events\nSorry, we haven't got any upcoming events.\nPlease check back soon to see future events.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_basingstoke-uk-home-one-biggest-global-coffee-brands/content_6.html": "Lavazza is one of the biggest coffee companies in the world and their UK business to business home is Basingstoke. A family run business with a 3 billion Euro turnover, Lavazza in Basingstoke markets and sells coffee vending machines for the workplaces and offices.\nMaria said, \"Lavazza's business to business operation is one of Basingstoke's big employers with around 300 employees. Basingstoke’s vibrant local economy is so strong because of the diverse mix of global and local companies to provide high quality jobs for local residents.”\nLavazza has a particular focus on workplace diversity and tackling Modern Slavery in its supply chain. Partnering with ActionAid, Taylors of Harrogate and the Ethical Tea Partnership, Lavazza works with tea farming communities in places across the world to provide the support needed to smallholder tea farmers and workers to have improved living conditions, a positive working environment and work towards freedom from violence and child labour.\nBasingstoke has a vibrant economy and is the most productive place in Hampshire and home to around 7,950 businesses on 9,200 different sites, with a diverse range of industry sectors providing jobs at a range of pay scales and skill levels.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_maria-briefed-vodafone-security-upgrades/content_33.html": "Local MP Maria Miller has visited the Vodafone facility in Basingstoke, the location of the criminal attack earlier this year which resulted in widespread loss of mobile network coverage for many hours. During her visit she met Vodafone’s Head of Government Affairs, Paul Morris, and the Head of Security, Mark Hughes, who had travelled from their Newbury headquarters.\nVodafone briefed Maria on the incident in February and the measures they have taken since them to improve both physical security and network resilience.\nMaria said: “Vodafone told me that there is nothing more important for the company than keeping the mobile networks up and running for its customers, and that they have taken taken urgent steps to seek to improve their resilience.”\nMaria added: “I was pleased to hear that new security measures had been put in place to try to avoid these types of outages in future. This is important not just for individual mobile users, but also for the businesses and services that rely on constant mobile connectivity.”",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk/content_5.html": "Local News\nNational News\nJoin or Renew\nBy joining the Conservative Party, you're doing your bit to help change Britain.\nYour support is vital to our campaign to build a better future.\nFreedom - Conservatives believe in less interference from the State - freedom for individuals, families, voluntary groups and businesses.\nEnterprise - Conservative want to keep taxes low and set businesses free from red tape to help Britain compete in the global economy.\nResponsibility - Conservatives stand for the rule of law and support for all members of our society. We recognise our duty to protect the environment for future generations.\nNation - Conservatives want to safeguard the Union of Great Britain and Northern Ireland, maintain strong defence and uphold our right to national self-government. We want to be in Europe but not run by Europe.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_map-locations/content_7.html": "Our map\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_maria-shows-support-m3-job-club/content_19.html": "Basingstoke MP Maria Miller dropped into the M3 Job Club recently, for an update on the current events and activities at the Job Club from Richard Thayer, who set up the Club earlier this year. The Club meets every Friday at the Innovation Centre on Basing View.\nMaria heard that there were now 100 members on the Club’s database, and ten of the members had found a new job since Maria’s last visit to the Club in late June.\nMaria said: “It was good to hear that the M3 Job Club is going from strength to strength, in continuing to offer support to those who are out of work in the management and professional sectors. The group, run entirely by volunteers, is helping people get back to work, and also provides support to those thinking about starting up their own business.”\nMaria added: “The Club has a really packed programme, including activities to provide members with information, knowledge and advice from professional coaches and business volunteers. They work with a number of businesses in the area, both smaller enterprises and also blue chip companies such as Nokia.”",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_join/content_3.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_south-ham/content_24.html": "Your Conservative team in South Ham\nWhether you voted for us or not, we’re here to work for and represent you, the residents of Eastrop and Grove. If you have any issues or concerns you’d like us to look into, please get in touch.\nAs your Conservative team, we continue to support the Conservative team across parishes, the borough, the county and Maria Miller MP, to make things happen locally.\nCommunicating With You\nYour local Conservative Team in South Ham communicates regularly with residents through inTouch and is often out knocking on doors to hear residents' views. If you would be able to deliver inTouch on your road, please contact us via details on the left sidebar.\nGet Social With Us\nThe local Conservatives also hold regular drinks, dinners and other events all year round. If you would like to come along to an event - even simply out of curiosity - do get in touch as described above.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_category_Speeches-in-Parliament/content_8.html": "Local MP welcomes legislation creating robust building regulations and safer homes 27th July 2021 MP for Basingstoke Maria Miller spoke in the second reading of the Building Safety Bill on Wednesday. The Building Safety Bill seeks to give residents power to... Speeches in Parliament",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_arenas-brand-new-business-centre-says-basingstoke-open-business/content_10.html": "Maria said, \"Last week I visited Arena's newest, state of the art serviced offices ahead of their official opening for business. It was great to see how Arena have invested in our town with the transformation of Grosvenor House in Basing View, which can provide serviced offices for small start-ups or even a whole floor if required\".\nFran Williamson from Arena said, “This £12m investment in Basingstoke provides office facilities that any company would be proud to call home, and creates the capacity for businesses to grow, expand and work as flexibly as they need to. Arena’s second centre in Basing View, The Grosvenor complements The Square with gym, coffee shop, terrace, meeting rooms and collaboration space”.\nThe backbone of Basingstoke's vibrant local economy are small-medium enterprises with over 90% of Basingstoke businesses employing 10 people or fewer. Serviced offices like these are a flexible way of allowing businesses to gradually expand creating more jobs, fostering innovation, and contributing to the unique vibrant character of our town.",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_category_Local-News/content_9.html": "Basingstoke: UK home to one of the biggest global coffee brands 18th December 2023 Lavazza is one of the biggest coffee companies in the world and their UK business to business home is Basingstoke. A family run business with a 3 billion Euro... Local News\nLocal MP Maria Miller catches up with Oakley Stitchers to find out what drives the charity. Inbox 18th December 2023 So Much More than Stitching! Local MP Maria Miller catches up with Oakley Stitchers to find out what drives the charity. Maria said, “I met Caroline Worley, one... Local News\nMP backs Hampshire Police and Crime Commissioner call for zero tolerance on shoplifting 15th December 2023 Donna Jones, the Police & Crime Commissioner (PCC), for Hampshire and the IOW joined local MP Maria Miller, Basingstoke retailers and local business to discuss... Local News\nArena’s brand-new Business Centre says Basingstoke is open for business 15th December 2023 Maria said, \"Last week I visited Arena's newest, state of the art serviced offices ahead of their official opening for business. It was great to see how Arena... Local News\nMP meets Volunteers at Basingstoke Foodbank event in Chineham Tesco 14th December 2023 “Basingstoke Foodbank held a Big Collection event on the first weekend of December and it was a pleasure to meet the volunteers, Jane Stubbs the new Chineham... Local News\nEngineering still a Basingstoke strength: Robotic innovation at LG Motion 14th December 2023 Local MP Maria Miller dropped into Basingstoke engineering business LG Motion in Telford Road to see their work in robotics. Maria opened the businesses'... Local News\nMP visits another ‘Good’ Basingstoke school - Chiltern Primary school 13th December 2023 Local MP Maria Miller met Head Teacher Nathan Gazzard, staff and members of the School Council when she visited Chiltern Primary School, rated 'Good' by Ofsted... Local News\nSupporting the Basingstoke and Deane Disability Forum Xmas Party 13th December 2023 Maria said, “As a patron of the Basingstoke & District Disability Forum it was an honour to attend their annual Christmas Party held at Popley Fields Community... Local News\nLocal entrepreneur shares her story with MP Maria 28th November 2023 Maria Miller MP for Basingstoke met local entrepreneur Natalie Chapple who founded Glisten Cosmetics based in Crockford Lane in Chineham. The company... Local News",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_supporting-basingstoke-and-deane-disability-forum-xmas-party/content_11.html": "Maria said, “As a patron of the Basingstoke & District Disability Forum it was an honour to attend their annual Christmas Party held at Popley Fields Community Centre. A great opportunity to meet so many old friends and to support the important work of the BDDF.”\nBDDF Members, volunteers, and carers got into the festive spirit along with special guests the Mayor of Basingstoke & Deane Cllr David Leeks and Mayoress Amanda Leeks.\nThe BDDF are the disability champions of Basingstoke and offer important support for anyone young or old who are affected by disability in the local community. They aim to promote both visible and non-visible disabilities providing information and awareness by bringing people together. Members are able to access free activities such as yoga to help aid mobility.\nIt is free to become a member, for more information click here",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_news_conservative-response-labours-emergency-budget/content_13.html": "Tweet Wednesday, 26 March, 2025 National News Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray\nThe Conservative Party's final Party Election Broadcast Tuesday, 29 April, 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are",
  "https_www_basingstokeconservatives_org_uk_people_arun/https_www_basingstokeconservatives_org_uk_about-us/content_20.html": "Basingstoke Conservatives is a voluntary organisation of friends, members and elected representatives, from all walks of life, who work hard for the people of Basingstoke all year round - not just at election time. We have fun together at events, raising money for campaigning, delivering leaflets, talking to residents on the doorstep and getting involved in campaigns. We represent and include people with a diverse range of backgrounds, interests and concerns. We are a broad church, which encourages open debate and accepts differences of opinion.What unites us are the core Conservative values:\nFreedom\nConservatives believe in less interference from the State - freedom for individuals, families, voluntary groups and businesses.\nEnterprise\nConservative want to keep taxes low and set businesses free from red tape to help Britain compete in the global economy.\nResponsibility\nConservatives stand for the rule of law and support for all members of our society. We recognise our duty to protect the environment for future generations.\nNation\nConservatives want to safeguard the Union of Great Britain and Northern Ireland, maintain strong defence and uphold our right to national self-government. We want to be in Europe but not run by Europe.\nJoin us! Whatever your interests and spare time, your involvement is completely up to you. We’d love to hear from you – why not join us today! Click the Join on-line button on the left."
}