{
  "https_www_rheakeehn4ashfield_com_/https_www_rheakeehn4ashfield_com_blank-1/content_6.html": "Get to know Rhea\nI live in Sutton-in-Ashfield and am standing to become the Labour MP for Ashfield.\nI'm not someone who grew up always thinking I would be a politician: in fact I find politics frustrating at times. But I've been a community campaigner for as long as I've had a political voice. I have realised one of the ways to change things for the better is to do something about it myself. And so, outside of my day job, I have campaigned for change at various levels for over 20 years. I want our government to truly represent its people. I want our public money to be invested in our society. I want everyone to have the opportunity to succeed.\nBy day I work in legal and compliance for a major car manufacturer and over the years I've worked for a planning and regeneration company, a recruitment agency and an events company. My first ever job was working at Debenhams every Saturday.\nI studied at the University of Birmingham and went on to be elected leader of the union, representing the needs of 34,000 people as President of the Guild of Students at Birmingham University. I joined Labour students and after leaving University got heavily involved in my local party, and I’ve been a community activist ever since!\nUntil I joined the Labour Party, I never considered my actions political; I was just speaking up for my community and fixing the things that needed fixing - it all just seemed like common sense to me.\nSince then, I've successfully fought many battles: I unionised my workplace; took industrial action against central government and won. I've worked with local Labour members to lead the #SaveOurRumbles campaign and organised a GMB rally outside Ashfield District Council's offices in protest of their threat to evict Rumbles Café in Sutton-in-Ashfield. I've campaigned to protect community green spaces and our community centres in Ashfield too.\nI have been a school governor at a primary school and a governor of the University of Birmingham and continue to be Student Mentor.\nI am a Co-op Party member, GMB member and member of Unite and in my spare time I volunteer at a local charity and FoodCycle in Sutton-in-Ashfield. When I am not campaigning you can find me hiking in the peak district or spending time with my family.\nThis government has deeply failed us.\nWe face so many challenges right now, from the crippling cost of living, to the underfunding of our local schools and community organisations and growing crime rates in our towns and villages.\nMy pledge is to do better for Ashfield and represent the voices of this wonderful community of people.",
  "https_www_rheakeehn4ashfield_com_/https_www_rheakeehn4ashfield_com_gallery/content_3.html": "top of page\nHome\nAbout\nPriorities\nContact\nCampaigns\nLabours Missions\nGallery\nMore\nUse tab to navigate through the menu items.\nCampaign Gallery\nbottom of page",
  "https_www_rheakeehn4ashfield_com_/https_www_rheakeehn4ashfield_com_contact-8/content_4.html": "top of page\nContact Rhea\nFor all case work, media enquiries or to get involved in my campaign, feel free to contact me via:\nSocial Media (direct messages)\nbottom of page\nContact Rhea\nFor all case work, media enquiries or to get involved in my campaign, feel free to contact me via:\nSocial Media (direct messages)",
  "https_www_rheakeehn4ashfield_com_/https_www_rheakeehn4ashfield_com/content_1.html": "How I will deliver for Ashfield\nThis government has deeply failed us. From dodgy PPE deals to dumping sewage in our rivers. Our current crop of MPs seem more interested in benefiting themselves, than fighting for the real needs of local people.\nI pledge to speak up for residents, to act with integrity and secure a brighter future for Ashfield\nMeet Rhea\nI'm not afraid to speak up and take action where it is needed.\nFrom standing up to save a community cafe, to fighting the closure of vital community centres in Ashfield, to unionising my workplace and taking industrial action, to representing 34,000 members as President of the Guild of Students at Birmingham University, I don't shy away from tough challenges.\nChampioning Ashfield\nWe have so much to be proud of here in Ashfield. Our community is filled with enterprising, hard-working and generous people who make a positive contribution to our community, everyday.\nLike you, I want to see Ashfield's special green spaces protected, and our towns bustling and thriving once more.\nI am determined to see Ashfield's residents recognised for the spirit and talent they demonstrate every day.",
  "https_www_rheakeehn4ashfield_com_/https_www_rheakeehn4ashfield_com_about-3/content_2.html": "If elected to be your MP it will be my only job. I will work on a number of issues to secure a brighter future for Ashfield such as these topics below....\nHealth and Social Care\nMaking the care system more affordable and fair. Families are paying over £1000 a week so their relative can live in a care home, and many carers themselves aren't being paid fairly for the work they do.\nI'll work on Labour's plans to make this system work better. Locally we also have issues with accessing the dentist, and chronic problems with referral times for a variety of medical treatments.\nThe root cause of these issues are complex, however part of my role as MP is to unblock the challenges and guide our government and local health leaders to implement the right solution.\nTransport\nPot holes! Whilst not directly a central government responsibility we do have the power to fund the Councils who are responsible, or take a central government approach to resurfacing the roads. Secondly, I will work with the East Midlands Mayor and Transport Secretary to improve our transport links, and advocate the need for all improvements to be truly disability friendly. I also want to tackle a smaller, but incredibly frustrating issue: unfair parking charges! Private parking companies charge obscene sums if you appeal and threaten legal action even when they themselves are in the wrong. I will clamp down on this.\nEducation\nAs a former Primary School Governor and Governor of the University of Birmingham I understand there are multiple challenges that need addressing.\nIn Ashfield, we have schools that simply cannot recruit teachers. As a result, the welfare and development of existing teachers suffers as does the educational experience of the pupils. I will work with teachers and the education community to help address these problems and lobby for increased funding for our schools.\nSustainable Energy\nWith Labour's sustainable energy plans I believe Ashfield is in the prime location to once again provide energy to the nation. We have the right infrastructure already to support the developments in sustainable energy. Labour's incentives for businesses will help encourage energy companies and start ups to invest in our area. With the right investment and leadership we can make sure we have the local skills in place to fill the jobs that Labour's energy plans bring, and in turn this will help boost our local economy. With a collaborative approach we can seize the economic opportunities that Labour's energy plans bring.\nBe a Constituency MP\nIt's important that residents have access to their MP. That is why I will ensure we have an office and appointments that are accessible. I will regularly speak to businesses, schools, community groups and residents so I can effectively represent them.\nUsing social media and other methods I will regularly share updates with residents so everyone is informed about how their interests are being represented in Parliament.\nAnd no - I won't take a second job!!!",
  "https_www_rheakeehn4ashfield_com_/https_www_rheakeehn4ashfield_com_portfolio/content_5.html": "top of page\nCampaigns\n#Protect The Rec\non Hardwick Lane\nObjections have been submitted. We await the response from Ashfield District Council\nLabour's New Deal\nfor\nWorking People\nWe are ambitious for our country's future; built on decent and secure jobs. Read more here\nbottom of page"
}