{
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_about/content_11.html": "On this page:\nCouncillors, achievements and policies\nCouncillors\nSimon Grover\nSimon is the Green group leader on St Albans District Council. He was first elected in St Peter’s ward in 2011 and has been re-elected 5 times in a row. He is also our MP candidate, gaining over 3,000 votes in 2024.\nJuliet Voisey\nJuliet was elected to represent St Peter’s ward in 2023, and re-elected in 2024. She runs the local Greenpeace group and volunteers with countless local organisations in the St Albans area.\nMatt Fisher\nMatt is a district councillor for Clarence ward and the county councillor for St Albans Central. He is a Keep Britain Tidy ambassador. He runs his own photography business and formerly served in the police and the navy.\nAchievements\nSt Albans District Green councillors and campaigners have achieved a lot, working with the community and the Council, campaigning for change and bringing in new ideas that are making St Albans and district a better place.\nWe are part of the largest opposition group on St Albans Council, and we hold the Lib Dem administration to account, standing up for fairness and transparency.\nOur achievements include:\n- Got Council to develop to a ‘right to grow’ policy for unloved patches of land\n- Won a reprieve for market street traders threatened with huge fee increases\n- Campaigned vigorously for the Local Plan to avoid building on the green belt\n- Helped to save local sports club from Council cuts\n- Co-founded Wilder St Albans – a district-wide biodiversity project\n- Campaigned to save hundreds of trees from being felled\n- Launched huge petition to reduce abstraction from River Ver\n- Initiated Council’s programme to support Syrian refugees\n- 4 new disabled parking bays at St Albans station\n- Motion passed at Council to back a 20mph district-wide speed limit\n- Public meetings on climate change and other issues\n- Monitored air pollution levels\n- Got Council to back more action for cyclists and walkers\n- Got electric taxi scheme going\n- Switched Council planting to more perrenials, saving cash\n- Got hundreds of solar panels put on leisure centres\n- Helped residents oppose oversized developments\n- Got Council to switch to renewable energy\n- And much much more!\nPolicies\nWould you like:\n- A society that puts people first and works for the common good\n- A planet protected from climate change now and in the future\n- An economy that gives everyone their fair share\n- A publicly funded, publicly provided NHS free at the point of use\n- Affordable and secure homes for all\n- A public transport system that puts passengers first\n- Sustainable local communities\n- Open and accountable decision-making\nGreens have the right policies\nWe have affordable practical ideas for all areas of policy.\nGreens are a serious part of political life\nWe campaign widely and mean what we say. Our support and membership has soared and we are involved in decision-making at hundreds of councils across the country.\nGreens are electable\nWe’ve had elected district councillors in St Albans since 2011. The Green Party has 4 MPs, Scottish MPs, London Assembly Members, Members of the Lords and over 800 principal authority councillors.\nIf you share our vision, vote for what you believe in\nGo to Green policies for Hertfordshire local elections\nLocal policies for St Albans District\nLocal economy\nWe will:\n- Promote local buying and food projects\n- Support local businesses\n- Promote adoption of the Living Wage\n- Encourage ethical business practices\nAffordable housing\nWe will:\n- Demand that 50% of new housing is affordable\n- Insulate all homes that needs it\n- Cut the number of unoccupied homes\n- Work to ensure all homes are of acceptable standard\nSustainable travel\nWe will:\n- Develop a joined-up travel strategy\n- Make walking and cycling safer and more attractive\n- Promote affordable and integrated public transport\n- Adopt a 20mph limit in all residential streets by default\n- Install on-street electric vehicle charging points\nClimate change\nWe will:\n- Combat air pollution\n- Promote renewable energy and energy efficiency\n- Produce a district energy plan\n- Fund an Energy Reduction Officer\n- Aggressively pursue local net zero targets\nWaste and recycling\nWe will:\n- Support, promote and enable recycling\n- Promote a ‘reduce, re-use, repair and recycle’ programme\n- Develop a district-wide zero waste policy\n- Work with local retailers to cut down on packaging\n- Tackle urban and rural dumped waste and pursue offenders\nPlanning\nWe will:\n- Protect communities from harmful development\n- Preserve our city’s historic character\n- Do everything we can to protect the Green Belt and open spaces\n- Make it simpler for people to install renewable energy\n- Encourage low-carbon building, retrofit and redevelopment\nGreen spaces\nWe will:\n- Improve local green spaces and promote biodiversity\n- Protect and plant trees\n- Promote local gardening and food growing\n- Discourage loss of front gardens\n- Provide more allotment spaces where there is demand\nDemocratic decision-making\nWe will:\n- Make council language clearer and more understandable\n- Be open and accountable\n- Make sure consultations are genuine and easier to understand\n- Give local people a direct say in certain spending decisions\nChildren and young people\nWe will:\n- Help children to attend nearby schools\n- Open youth clubs and advice centres\n- Work to make services accessible for children with specific needs\nHealth and social care\nWe will:\n- Improve facilities for people in vulnerable circumstances\n- Develop a strategy to make neighbourhoods inclusive and accessible\n- Improve help for carers",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_donate/content_8.html": "We’re powered by people, not big business\nHelp St Albans Greens campaign and get elected\nSt Albans District Green Party is funded through donations by individuals like you. We don’t take donations from businesses that are trying to sway our politics. Politics is about people, and delivering a society that puts them first. Can you donate to help us campaign and get more Greens elected in St Albans District?",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_help/content_2.html": "We rely entirely on our members and supporters for everything we do. But helping out is fun and rewarding for you too. Here are some of the things you could do to get involved.\n1. Vote Green!\n2. Join in with our social media\n3. Put up a poster\nContact us at election time and we’ll bring you one.\n4. Deliver newsletters\nHelp to spread the word by delivering our newsletters, any time that suits you.\n5. Get monthly updates\nGet monthly news and interesting links by subscribing to our e-mail list.\n6. Become a supporter or member\nRegister as a supporter and we’ll contact you about how you can help.\nTo join the national Green Party, which includes local membership.\n7. Make a donation\nWe rely on donations. Make a donation.\n8. Shop online\nHelp us raise funds while you shop online, at no cost. Register at Easyfundraising.\nMost major retailers are in the scheme, including Argos, M&S, Amazon, Boden, John Lewis.\n9. Come to a meeting or social\nWe meet every month, on the second Tuesday.\nYou’re welcome to come along to a meeting. Give us a ring before you come along, to check when and where it’s happening.\nWe also have social events, which we publicise by email.\n10. Switch to Ecotricity\nThis green energy supplier will donate £40-£60 when you sign up to get your energy from them.\nIt’s very simple. Call 08000 302 302 and quote St Albans District Green Party.",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_tag_flooding/content_7.html": "Greens oppose local plan 29 October 2024 by adminsg Green and Independent councillors have voted against the draft Local Plan at a meeting of St Albans Council. The overall result of the vote was that it was passed, due to the large majority of Lib Dem councillors. St Albans urgently needs a local plan. A robust and bold one that secures sustainable, well-built housing […] Read more » council flooding local plan river ver",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_author_adminsg/content_4.html": "3 May 2025 / 3 May 2025 by adminsg\nIn a nailbiting finish, including two recounts, St Albans Central candidate Matt Fisher got 1,801 votes, winning by just 6 votes ahead of the Lib Dems. The other parties trailed far behind. The seat had previously been held by the Lib Dem Council leader, and was one of their safest seats. Matt becomes the first […]\nRead more »\n25 March 2025 / 25 March 2025 by adminsg\nCouncillor Simon Grover, leader of the Green & Independent group on the Council, has spoken out against the proposed reorganisation of local government, that would see powers centralised and local representation abolished. Simon told a Council committee: “St Albans Council should be bold about opposing the proposed abolition of our local government structures. I have […]\n19 March 2025 / 19 March 2025 by adminsg\nSt Albans councillor Matt Fisher has launched a new campaign to push for cross-pavement electric vehicle (EV) charging for residents who rely on on-street parking. Cllr Fisher is inviting residents to sign an open letter to Hertfordshire County Council, highlighting the urgent need for accessible, sustainable, and convenient charging solutions to support the increasing number […]\n9 March 2025 / 9 March 2025 by adminsg\nCouncillor Simon Grover, leader of the Green & Independent group on St Albans District Council, has highlighted serious concerns about the Council’s commitment to tackling the climate emergency in a speech delivered at the budget-setting meeting of the Council. While acknowledging some positive changes resulting from committee scrutiny, Cllr Grover expressed alarm over several issues, […]\n11 February 2025 / 11 February 2025 by adminsg\nGreen Party Councillor Matt Fisher has officially launched his campaign for the upcoming Hertfordshire County Council elections, pledging to champion sustainability and community-led initiatives during a crucial period of local government transformation. Speaking at his campaign launch event, Cllr Fisher emphasized the significance of the election amid the planned transition to a unitary authority, describing […]\n1 February 2025 / 1 February 2025 by adminsg\nSt Albans Green councillors have responded to the Council’s latest Air Quality Action Plan with a host of areas for improvement and comments on where the plan falls short of best practice. The Council issued the draft plan in 2024 and consulted residents. The updated plan has been further circulated for comment from councillors. The […]\n3 January 2025 / 3 January 2025 by adminsg\nSt Albans Green councillors Juliet Voisey, Matt Fisher and Simon Grover are planning a range of initiatives for 2025, which focus on both wildlife protection and waste reduction across St Albans district. We are actively working to strengthen Biodiversity Net Gain implementation at council level, ensuring proper guidelines and monitoring procedures are in place to […]\n31 December 2024 / 31 December 2024 by adminsg\nIf you’re thinking of trying Veganuary, or if a member of your family has decided to try plant-based and you don’t know where to start, we’ve got you covered with tips, recipes, and support. Just follow @stalbansgreens on Instagram, Facebook and Bluesky to see our daily updates to help you along the way. And there […]\n20 December 2024 / 20 December 2024 by adminsg\nNew planning rules reduce local control The government’s new National Planning Policy Framework (NPPF) represents a step backwards for local democracy and sustainable development. By allowing planning officers to approve developments without councillors’ input, it sidelines local communities and prioritises profit-driven developers over genuine need. In St Albans, this approach risks creating more high-cost, car-dependent […]\n29 October 2024 by adminsg\nGreen and Independent councillors have voted against the draft Local Plan at a meeting of St Albans Council. The overall result of the vote was that it was passed, due to the large majority of Lib Dem councillors. St Albans urgently needs a local plan. A robust and bold one that secures sustainable, well-built housing […]",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_2024_10_29_greens-oppose-local-plan/content_9.html": "Green and Independent councillors have voted against the draft Local Plan at a meeting of St Albans Council. The overall result of the vote was that it was passed, due to the large majority of Lib Dem councillors.\nSt Albans urgently needs a local plan. A robust and bold one that secures sustainable, well-built housing for future generations and those waiting on housing lists.\nDoes the current plan deliver that? There’s plenty of talk about sustainability and biodiversity, but will it stand up to the changes from climate change? If we must build on greenbelt land, we have to get it right. Greenbelt land provides carbon sequestration, flood mitigation, wildlife habitats, and food crops.\nWe need to build fully sustainable, gas-free homes to protect people from energy price spikes. Let’s give people homes of the future – warm, cheap to run, powered by renewable technologies – that won’t need retrofitting later because we didn’t commit to the best we can build.\nWe also need better commitment and service from public transport companies. Car usage here is higher than average, and the local plan does little to address it. Walking and cycling are promoted, but we need reliable, frequent buses to get around. Redbourn has no rail access, poor bus service, and yet is earmarked for major development. Air quality is already an issue, with rising asthma rates, especially in children.\nThe Environment Agency’s report on the plan raises concerns about our water quality and efficiency – we use more water per capita than the national average. The sewage plant that serves St Albans is at capacity and regularly discharges into the River Ver – a river we’re trying to revitalise. Thames Water has had little input, and the plan leaves it to developers to liaise with them. How will the sewage plant cope with all the sites listed in the plan?\nThe plan includes flood-risk sites and says the risk will be mitigated. Given our current rainfall levels, careful planning is essential. It also includes a meadow with rare, protected species and an ancient monument. The number of houses on this site has already been reduced because it’s so restrictive, and the Greenbelt Review suggests there are too many complications to include it. How can houses be built here when we can’t plant trees in Verulamium Park because of ancient monuments?\nThe local plan should commit to a sustainable future for St Albans.",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk/content_1.html": "News\n- Matt Fisher elected to county councilIn a nailbiting finish, including two recounts, St Albans Central candidate Matt Fisher got 1,801 votes, winning by just 6 votes ahead of the Lib Dems. The other parties trailed far behind.… Read more: Matt Fisher elected to county council\n- Simon urges council to oppose reorganisationCouncillor Simon Grover, leader of the Green & Independent group on the Council, has spoken out against the proposed reorganisation of local government, that would see powers centralised and local representation abolished.… Read more: Simon urges council to oppose reorganisation\n- Matt fisher campaigns on ev chargingSt Albans councillor Matt Fisher has launched a new campaign to push for cross-pavement electric vehicle (EV) charging for residents who rely on on-street parking. Cllr Fisher is inviting residents to sign… Read more: Matt fisher campaigns on ev charging\n- Greens raise alarm on lack of climate action at councilCouncillor Simon Grover, leader of the Green & Independent group on St Albans District Council, has highlighted serious concerns about the Council’s commitment to tackling the climate emergency in a speech delivered… Read more: Greens raise alarm on lack of climate action at council\n- Matt Fisher launches county election bidGreen Party Councillor Matt Fisher has officially launched his campaign for the upcoming Hertfordshire County Council elections, pledging to champion sustainability and community-led initiatives during a crucial period of local government transformation.… Read more: Matt Fisher launches county election bid\nWorking hard for you\n🚮\nRegular litter-picking sessions\nReporting fly-tipping\nHelp with missed collections\n📃\n4 councillors speaking up for you\nHolding the Council to account\nRegular newsletters and surveys\n🌳\nProtecting local trees\nCreating nature-rich spaces\nCampaigning for clean air\nUpcoming Events\nWe’re a sociable bunch – get involved!\nPub Quiz Fundraiser on 26 November https://actionnetwork.org/ticketed_events/pub-quiz-26-november-the-goat\nChristmas social: 7pm 10th December at The Crown pub on Hatfield Road, St Albans.\nOur regular business meetings are on the 2nd Tuesday of the month. Contact us for details.",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_news_page_2/content_15.html": "St Albans Greens triple their vote on huge night for party 6 July 2024 / 10 August 2024 by adminsg In the St Albans constituency, Simon Grover got our highest ever vote here at 3,272, tripling the number compared to 2019, and comfortably over the percentage needed to save our deposit. See St Albans results. In the new Harpenden & Berkhamsted seat we were tightly squeezed by the other parties, but Paul de Hoest managed a […] Read more »\nVoting Green will not let the Tories in here 6 June 2024 / 10 August 2024 by adminsg When we talk to people in St Albans about the General Election, many of them say they are thinking of voting Lib Dem “to keep the Tories out”. But in St Albans, there is absolutely no need to do that. Britain Elects projects a huge 53% majority for Lib Dem Daisy Cooper, with the Conservative […] Read more »\nSt Albans Greens a whisper away from 5 councillors 4 May 2024 / 10 August 2024 by adminsg In the local elections on 2 May 2024, Juliet Voisey retained her seat in St Peters, while Lucy Swift and Damian Gaskin came within touching distance of a win in Clarence and Batchwood respectively. Juliet got over 900 votes, and gets 4 more years as a councillor. Lucy got over 1200 votes which would normally be […] Read more »",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_tag_council/content_5.html": "Greens oppose local plan 29 October 2024 by adminsg Green and Independent councillors have voted against the draft Local Plan at a meeting of St Albans Council. The overall result of the vote was that it was passed, due to the large majority of Lib Dem councillors. St Albans urgently needs a local plan. A robust and bold one that secures sustainable, well-built housing […] Read more » council flooding local plan river ver",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_2024_06_06_voting-green-will-not-let-the-tories-in-here/content_14.html": "When we talk to people in St Albans about the General Election, many of them say they are thinking of voting Lib Dem “to keep the Tories out”.\nBut in St Albans, there is absolutely no need to do that.\nBritain Elects projects a huge 53% majority for Lib Dem Daisy Cooper, with the Conservative vote crashing to 22%. So you do not need to vote tactically. There is plenty of room for you to vote Green.\nThere are many reasons to vote Green in St Albans, even if we don’t win here.\nFirst, we really need Green MPs to push back against a cautious Labour Government that’s sticking with Tory budget cuts and watering down their environmental plans. The Greens are eyeing four seats and could very well make gains. The more support they get nationally, the stronger their voice in challenging Labour.\nSecondly, media attention is driven by national vote percentages. If the Green vote is low, their viewpoints on key issues like the environment, the cost of living, and public services, won’t get the airtime they deserve.\nThird, even if Green candidates don’t win, a strong showing can sway MPs of all stripes to pay more attention to Green priorities, since MPs do keep tabs on how the other parties are doing and often adjust their stance based on voter sentiment. Look at what happened with Ukip.\nFourth, there’s also money on the line. Opposition parties get funds based on their vote share, which they use to support their parliamentary work. For the Greens, who don’t have big corporate or union backers and rely on small donations, every vote that bumps up their percentage can mean a big boost in resources.\nThe Green vote has been kept down for too long, and it’s shown in slow government responses to environmental crises. If you think it’s time for a stronger Green influence in politics, voting Green this election is the way to go.",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_2025_03_19_matt-fisher-campaigns-on-ev-charging/content_3.html": "St Albans councillor Matt Fisher has launched a new campaign to push for cross-pavement electric vehicle (EV) charging for residents who rely on on-street parking.\nCllr Fisher is inviting residents to sign an open letter to Hertfordshire County Council, highlighting the urgent need for accessible, sustainable, and convenient charging solutions to support the increasing number of EV owners in our community. Many people want to switch to electric vehicles, but without off-street parking, they have no easy way to charge. The council must act to remove this barrier.\nThe case for cross-pavement EV charging:\n- Better access – Thousands of residents depend on street parking. Without a way to charge at home, many are locked out of the EV transition. The Council could identify safe cross-pavement charging that would provide a practical fix.\n- Environmental benefits – A lack of charging options forces people to keep using petrol and diesel cars. Supporting home charging will accelerate the shift to cleaner transport and cut emissions.\n- Economic boost – Encouraging EV adoption will create demand for charging infrastructure, leading to local job creation and investment in green technology.\n- Community support – Residents, environmental groups, and industry experts back this idea, recognising the need for sustainable transport solutions.\nCllr Matt Fisher commented:\n“Introducing cross-pavement EV charging is a crucial step in making electric vehicles accessible to more residents. This initiative not only supports our environmental goals but also enhances the well-being of our community. We strongly urge Hertfordshire County Council to consider this proposal and take meaningful steps toward a greener, more sustainable future.”\nThe Green Party encourages all residents with on-street parking to sign the open letter and support the call for safe, viable options for cross-pavement EV charging. Together, we can make a lasting impact on our environment and pave the way for a cleaner, greener future.",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_news/content_12.html": "Matt Fisher elected to county council 3 May 2025 / 3 May 2025 by adminsg In a nailbiting finish, including two recounts, St Albans Central candidate Matt Fisher got 1,801 votes, winning by just 6 votes ahead of the Lib Dems. The other parties trailed far behind. The seat had previously been held by the Lib Dem Council leader, and was one of their safest seats. Matt becomes the first […] Read more »\nSimon urges council to oppose reorganisation 25 March 2025 / 25 March 2025 by adminsg Councillor Simon Grover, leader of the Green & Independent group on the Council, has spoken out against the proposed reorganisation of local government, that would see powers centralised and local representation abolished. Simon told a Council committee: “St Albans Council should be bold about opposing the proposed abolition of our local government structures. I have […] Read more »\nMatt fisher campaigns on ev charging 19 March 2025 / 19 March 2025 by adminsg St Albans councillor Matt Fisher has launched a new campaign to push for cross-pavement electric vehicle (EV) charging for residents who rely on on-street parking. Cllr Fisher is inviting residents to sign an open letter to Hertfordshire County Council, highlighting the urgent need for accessible, sustainable, and convenient charging solutions to support the increasing number […] Read more »\nGreens raise alarm on lack of climate action at council 9 March 2025 / 9 March 2025 by adminsg Councillor Simon Grover, leader of the Green & Independent group on St Albans District Council, has highlighted serious concerns about the Council’s commitment to tackling the climate emergency in a speech delivered at the budget-setting meeting of the Council. While acknowledging some positive changes resulting from committee scrutiny, Cllr Grover expressed alarm over several issues, […] Read more »\nMatt Fisher launches county election bid 11 February 2025 / 11 February 2025 by adminsg Green Party Councillor Matt Fisher has officially launched his campaign for the upcoming Hertfordshire County Council elections, pledging to champion sustainability and community-led initiatives during a crucial period of local government transformation. Speaking at his campaign launch event, Cllr Fisher emphasized the significance of the election amid the planned transition to a unitary authority, describing […] Read more »\nMajor green response to air quality plan 1 February 2025 / 1 February 2025 by adminsg St Albans Green councillors have responded to the Council’s latest Air Quality Action Plan with a host of areas for improvement and comments on where the plan falls short of best practice. The Council issued the draft plan in 2024 and consulted residents. The updated plan has been further circulated for comment from councillors. The […] Read more »\nGreen councillors plan for new year 3 January 2025 / 3 January 2025 by adminsg St Albans Green councillors Juliet Voisey, Matt Fisher and Simon Grover are planning a range of initiatives for 2025, which focus on both wildlife protection and waste reduction across St Albans district. We are actively working to strengthen Biodiversity Net Gain implementation at council level, ensuring proper guidelines and monitoring procedures are in place to […] Read more »\nTips for trying veganuary 31 December 2024 / 31 December 2024 by adminsg If you’re thinking of trying Veganuary, or if a member of your family has decided to try plant-based and you don’t know where to start, we’ve got you covered with tips, recipes, and support. Just follow @stalbansgreens on Instagram, Facebook and Bluesky to see our daily updates to help you along the way. And there […] Read more »\nGreens respond to govt planning changes 20 December 2024 / 20 December 2024 by adminsg New planning rules reduce local control The government’s new National Planning Policy Framework (NPPF) represents a step backwards for local democracy and sustainable development. By allowing planning officers to approve developments without councillors’ input, it sidelines local communities and prioritises profit-driven developers over genuine need. In St Albans, this approach risks creating more high-cost, car-dependent […] Read more »\nGreens oppose local plan 29 October 2024 by adminsg Green and Independent councillors have voted against the draft Local Plan at a meeting of St Albans Council. The overall result of the vote was that it was passed, due to the large majority of Lib Dem councillors. St Albans urgently needs a local plan. A robust and bold one that secures sustainable, well-built housing […] Read more » council flooding local plan river ver",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_2024_12_31_tips-for-trying-veganuary/content_6.html": "If you’re thinking of trying Veganuary, or if a member of your family has decided to try plant-based and you don’t know where to start, we’ve got you covered with tips, recipes, and support.\nJust follow @stalbansgreens on Instagram, Facebook and Bluesky to see our daily updates to help you along the way.\nAnd there are lots more resources, menus etc at the official veganuary site",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_author_adminsg_page_2/content_10.html": "6 July 2024 / 10 August 2024 by adminsg\nIn the St Albans constituency, Simon Grover got our highest ever vote here at 3,272, tripling the number compared to 2019, and comfortably over the percentage needed to save our deposit. See St Albans results. In the new Harpenden & Berkhamsted seat we were tightly squeezed by the other parties, but Paul de Hoest managed a […]\nRead more »\n6 June 2024 / 10 August 2024 by adminsg\nWhen we talk to people in St Albans about the General Election, many of them say they are thinking of voting Lib Dem “to keep the Tories out”. But in St Albans, there is absolutely no need to do that. Britain Elects projects a huge 53% majority for Lib Dem Daisy Cooper, with the Conservative […]\n4 May 2024 / 10 August 2024 by adminsg\nIn the local elections on 2 May 2024, Juliet Voisey retained her seat in St Peters, while Lucy Swift and Damian Gaskin came within touching distance of a win in Clarence and Batchwood respectively. Juliet got over 900 votes, and gets 4 more years as a councillor. Lucy got over 1200 votes which would normally be […]",
  "https_stalbans_greenparty_org_uk_/https_stalbans_greenparty_org_uk_tag_local-plan/content_13.html": "Greens oppose local plan 29 October 2024 by adminsg Green and Independent councillors have voted against the draft Local Plan at a meeting of St Albans Council. The overall result of the vote was that it was passed, due to the large majority of Lib Dem councillors. St Albans urgently needs a local plan. A robust and bold one that secures sustainable, well-built housing […] Read more » council flooding local plan river ver"
}