{
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2024_07_06_st-albans-greens-triple-their-vote-on-huge-night-for-party/content_14.html": "In the St Albans constituency, Simon Grover got our highest ever vote here at 3,272, tripling the number compared to 2019, and comfortably over the percentage needed to save our deposit. See St Albans results.\nIn the new Harpenden & Berkhamsted seat we were tightly squeezed by the other parties, but Paul de Hoest managed a very respectable 1,951 votes. See Harpenden & Berkhamsted results.\nWe are of course also celebrating the Greens’ incredible national performance, with 2 million votes and 4 brand new Green MPs.",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_contact/content_7.html": "Email us or phone Simon on 07951 290732.\nOr fill out the form below and we’ll get back to you.\nYour name\nYour email\nSubject\nYour message (optional)",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_elections/content_3.html": "The next local elections for St Albans District are on 7 May 2026, for St Albans District Council.\nOn this page:\n- Green Manifesto for Hertfordshire\n- Local government reorganisation in Hertfordshire\n- Previous local election results\nGreen manifesto for hertfordshire\nBuilding a Better Hertfordshire – For Everyone\nHertfordshire needs local representatives who understand our everyday challenges and our future needs. Your Green Party councillors will:\nTackle the Cost of Living Crisis\n- Support local businesses and green jobs, through stronger collaboration with Local Enterprise Partnerships.\n- Demand genuinely affordable housing from developers, by enforcing stricter Community Infrastructure Levy collection.\n- Partner with business in a skills programme to meet local shortages and help residents to access better-paying jobs.\nProtect Community Services\n- Oppose cuts to libraries and community centres, working with community groups.\n- Campaign for improved mental health support, through joint funding bids with the NHS.\n- Advocate for better facilities for young people in our communities, by engaging with youth organisations.\nTransform Local Transport\n- Push for better road maintenance by challenging wasteful consultant spending.\n- Facilitate improved bus services through partnership with neighbouring councils.\n- Create safe cycling routes to schools, using developer contributions and government grants.\nDefend Our Environment\n- Demand protection for our green spaces and chalk streams, advocate for council-backed home insulation schemes to cut energy bills, and strongly oppose unsustainable development in the Green Belt.\n- Promote local renewable energy projects that generate income for our communities, through Community Municipal Bonds.\n- Safeguard our precious natural environment including protecting and planting trees.\nCampaign for Fairer Democracy\n- Campaign for a fairer Proportional Representation electoral system in local elections, whether they be for District, County, Unitary Authority Councils, or Mayoral.\nVote Green for councillors who’ll be a strong voice for your community and protect our environment for you and future generations. We will work to bring about a County Council that responds effectively to residents’ queries and values their experience; that makes the most of Council budgets and invests in core services; and that shares information transparently with early and meaningful consultations on new projects.\nLocal government reorganisation in Hertfordshire\nLate in 2024, the UK Government announced its intention to reorganise local government, including in Hertfordshire, potentially replacing the current ten district councils and the county council, with one or more unitary authorities. This is part of a wider plan to streamline local governance. The Government also wants unitary authorities to be headed by a strategic mayor (similar to London).\nProponents argue that larger councils could deliver services more efficiently and reduce costs, and powers could be devolved from Westminster to mayors. However, critics, including the Green Party, warn that the changes could undermine local democracy by concentrating power in fewer hands and reducing representation for smaller communities. Whilst devolution is to be applauded in principle, the Government’s plans look more like centralisation. The crucial connection between residents and local community councillors could be broken if councillors are overseeing much larger areas.\nHertfordshire’s district councils, including the Green-run East Herts Council, have raised concerns about the loss of accountability and community focus. They argue that a single unitary council may not adequately represent diverse local needs. The Greens have strongly opposed the plans, emphasising that smaller councils play a crucial role in addressing local issues and ensuring residents’ voices are heard. Discussions are ongoing, and no final decisions have been made.\nThe new unitary arrangement is due to be set up in 2027 and take over from the district and county councils in 2028..\nPrevious local election results\nThe Green Party has seen growing success in St Albans District in recent years. Simon Grover became their first district councillor in 2011, representing St Peter’s ward on St Albans City & District Council. He has since been re-elected five times, establishing a strong Green presence in the area.\nIn 2023, the party gained a second seat on the district council when Matt Fisher won in Clarence ward. Later that year, Juliet Voisey secured a third Green seat by winning a by-election in St Peter’s ward. Juliet was re-elected in 2024.\nIn parliamentary elections, Simon Grover ran as the Green candidate for St Albans in 2024, achieving 6.3% of the vote – an increase from previous results. These wins reflect a steady rise in Green support in St Albans, with their councillors leading projects on sustainability, waste reduction, and wildlife-friendly policies.\nIn 2025, Matt Fisher was also elected to Herts County Council, joining a group of 5 Greens there.",
  "http_stalbans_greenparty_org_uk/http_stalbans_greenparty_org_uk/content_1.html": "News\n- Matt Fisher elected to county councilIn a nailbiting finish, including two recounts, St Albans Central candidate Matt Fisher got 1,801 votes, winning by just 6 votes ahead of the Lib Dems. The other parties trailed far behind.… Read more: Matt Fisher elected to county council\n- Simon urges council to oppose reorganisationCouncillor Simon Grover, leader of the Green & Independent group on the Council, has spoken out against the proposed reorganisation of local government, that would see powers centralised and local representation abolished.… Read more: Simon urges council to oppose reorganisation\n- Matt fisher campaigns on ev chargingSt Albans councillor Matt Fisher has launched a new campaign to push for cross-pavement electric vehicle (EV) charging for residents who rely on on-street parking. Cllr Fisher is inviting residents to sign… Read more: Matt fisher campaigns on ev charging\n- Greens raise alarm on lack of climate action at councilCouncillor Simon Grover, leader of the Green & Independent group on St Albans District Council, has highlighted serious concerns about the Council’s commitment to tackling the climate emergency in a speech delivered… Read more: Greens raise alarm on lack of climate action at council\n- Matt Fisher launches county election bidGreen Party Councillor Matt Fisher has officially launched his campaign for the upcoming Hertfordshire County Council elections, pledging to champion sustainability and community-led initiatives during a crucial period of local government transformation.… Read more: Matt Fisher launches county election bid\nWorking hard for you\n🚮\nRegular litter-picking sessions\nReporting fly-tipping\nHelp with missed collections\n📃\n4 councillors speaking up for you\nHolding the Council to account\nRegular newsletters and surveys\n🌳\nProtecting local trees\nCreating nature-rich spaces\nCampaigning for clean air\nUpcoming Events\nWe’re a sociable bunch – get involved!\nPub Quiz Fundraiser on 26 November https://actionnetwork.org/ticketed_events/pub-quiz-26-november-the-goat\nChristmas social: 7pm 10th December at The Crown pub on Hatfield Road, St Albans.\nOur regular business meetings are on the 2nd Tuesday of the month. Contact us for details.",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2025_02_11_matt-fisher-launches-county-election-bid/content_5.html": "Green Party Councillor Matt Fisher has officially launched his campaign for the upcoming Hertfordshire County Council elections, pledging to champion sustainability and community-led initiatives during a crucial period of local government transformation.\nSpeaking at his campaign launch event, Cllr Fisher emphasized the significance of the election amid the planned transition to a unitary authority, describing it as “the biggest shake-up to local democracy in decades.”\n“This campaign isn’t just about filling a seat – it’s about shaping the future of local government,” Fisher told supporters. “With the upcoming transition to a unitary authority, decisions that impact our lives – on transport, housing, social care, and the environment – will now be made within a new structure.”\nMatt brings considerable experience to his campaign. As well as being a serving councillor for Clarence Ward, he stood as the Green Party’s first-ever Police and Crime Commissioner candidate in Hertfordshire, where he secured over 26,000 votes across the county. His campaign builds on recent Green Party momentum in the area, following strong performances in recent district council and general election contests.\nThe candidate outlined his vision for the Central Division, focusing on practical environmental action and community improvement. “We need to stop making excuses, stop kicking problems down the road, and start making real progress – right here, right now,” he stated.\nKey priorities in Matt’s campaign include:\n- Implementing sustainable transport solutions and improved infrastructure for walking and cycling\n- Protecting and enhancing local services\n- Ensuring environmental considerations are at the forefront of decision-making in the new unitary authority\nThe campaign will run for 80 days, with Matt and his team planning an extensive program of community engagement. “Campaigns aren’t won in council chambers,” Fisher noted. “They’re won on doorsteps, in conversations, and in communities.”\nResidents interested in learning more about the campaign or getting involved can contact the St Albans Green Party for further information.",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2025_03_09_greens-raise-alarm-on-lack-of-climate-action-at-council/content_2.html": "Councillor Simon Grover, leader of the Green & Independent group on St Albans District Council, has highlighted serious concerns about the Council’s commitment to tackling the climate emergency in a speech delivered at the budget-setting meeting of the Council.\nWhile acknowledging some positive changes resulting from committee scrutiny, Cllr Grover expressed alarm over several issues, including growing budget gaps for future years, low reserves, service reductions (including public toilet closures and cuts to community grants), and insensitive implementation of increased charges that fail to consider vulnerable residents.\nCllr Grover particularly emphasized the disappointing progress on what was previously described as the administration’s “top priority” – fighting the climate emergency.\nCiting a timely report from the Climate Change Committee published on February 26th, Cllr Grover noted that local government climate action remains “inconsistent and hindered by a lack of clarity on responsibilities, limited resources, and short-term funding” – a description that aptly characterizes St Albans’ situation.\nKey Areas of Concern\nDespite St Albans District Council pledging to reach net zero by 2030, critical areas of emissions reduction remain neglected:\n- Transport: As the district’s largest source of emissions (36% of the total carbon footprint), road transport emissions have barely decreased in over a decade. The Climate Emergency UK scorecard gave St Albans a concerning 3% rating for transport actions, reflecting a continued prioritization of road traffic over sustainable transport, failure to implement comprehensive cycling infrastructure, and unreliable public transport.\n- Home Energy Efficiency: Over half of St Albans homes remain rated EPC D or lower, with 11,500 homes lacking adequate loft insulation and 12,400 needing cavity wall insulation. At the current pace, retrofitting the district’s housing stock will take decades, despite Friends of the Earth advising that at least 4,000 homes per year need insulation upgrades to meet targets.\n- Heating: Progress on decarbonizing heating systems is particularly poor, with only around 240 heat pumps installed district-wide. The councillor called for investment in mass heat pump rollout and district heating schemes instead of continuing reliance on outdated, polluting gas systems.\n- Planning Policy: The district’s planning framework received just 9% in the Climate Emergency UK rating for planning and land use, reflecting years without serious policies to mandate energy-efficient new builds, support renewables, or integrate low-carbon transport into development plans.\nNot on Track for 2030 Target\nSimon emphasized that St Albans is not on track to meet its Net Zero 2030 pledge, which required a 64% reduction in emissions by 2024/25. After five years, the council is already two years behind on aims to reduce corporate greenhouse gas emissions.\nThe current sustainability and climate crisis strategy was criticized for lacking urgency and measurable objectives, with emissions reductions so far largely coming from national energy grid decarbonization rather than bold local policies.\nGreens have urged immediate prioritization of transport reform, home retrofitting, clean heating, and climate-conscious planning, warning that further delays will result in failure to meet the net zero commitment.",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2025_05_03_matt-fisher-elected-to-county-council/content_11.html": "In a nailbiting finish, including two recounts, St Albans Central candidate Matt Fisher got 1,801 votes, winning by just 6 votes ahead of the Lib Dems. The other parties trailed far behind. The seat had previously been held by the Lib Dem Council leader, and was one of their safest seats.\nMatt becomes the first ever Green County Councillor in St Albans.\nMatt joins a team of 5 Green councillors at Herts County Council, who look likely to form part of the administration there alongside the Lib Dems and Labour.\nIt was another record-breaking set of local elections for the Green Party across the country. For 8 straight years, Greens have increased their councillor numbers – the only party to do so. There are now 859 Green councillors on 181 councils.\nWhy not join the Greens today?",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2025_01_03_green-councillors-plan-for-new-year/content_9.html": "St Albans Green councillors Juliet Voisey, Matt Fisher and Simon Grover are planning a range of initiatives for 2025, which focus on both wildlife protection and waste reduction across St Albans district.\nWe are actively working to strengthen Biodiversity Net Gain implementation at council level, ensuring proper guidelines and monitoring procedures are in place to protect local wildlife. Biodiversity Net Gain is a planning requirement that requires all new developments to deliver a measurable increase of at least 10% in natural habitats compared to what was there before, helping to protect and enhance local wildlife and ecosystems. This work complements our ongoing collaboration with the local swift group, where we support installation days throughout St Albans to protect these important birds.\nWaste reduction features prominently in our agenda: we’re looking at opportunities to improve facilities at the local recycling centre, including improvements to the existing shop and expanded recycling options for items such as coffee pods and ink cartridges. We are also addressing littering and fly-tipping issues in our community.\nOur team is progressing with several other environmental projects, including a tree warden scheme and exploring improved cycling infrastructure in the district. We are also preparing to bring forward a motion on the Plant Based Treaty, demonstrating our commitment to addressing climate change through multiple approaches.\nWe’re working on practical initiatives that will make a real difference to our local environment, from supporting wildlife to reducing waste. Our focus is on delivering tangible improvements for St Albans residents while protecting our natural heritage.",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_category_local-news/content_6.html": "3 May 2025 / 3 May 2025 by adminsg\nIn a nailbiting finish, including two recounts, St Albans Central candidate Matt Fisher got 1,801 votes, winning by just 6 votes ahead of the Lib Dems. The other parties trailed far behind. The seat had previously been held by the Lib Dem Council leader, and was one of their safest seats. Matt becomes the first […]\nRead more »\n25 March 2025 / 25 March 2025 by adminsg\nCouncillor Simon Grover, leader of the Green & Independent group on the Council, has spoken out against the proposed reorganisation of local government, that would see powers centralised and local representation abolished. Simon told a Council committee: “St Albans Council should be bold about opposing the proposed abolition of our local government structures. I have […]\n19 March 2025 / 19 March 2025 by adminsg\nSt Albans councillor Matt Fisher has launched a new campaign to push for cross-pavement electric vehicle (EV) charging for residents who rely on on-street parking. Cllr Fisher is inviting residents to sign an open letter to Hertfordshire County Council, highlighting the urgent need for accessible, sustainable, and convenient charging solutions to support the increasing number […]\n9 March 2025 / 9 March 2025 by adminsg\nCouncillor Simon Grover, leader of the Green & Independent group on St Albans District Council, has highlighted serious concerns about the Council’s commitment to tackling the climate emergency in a speech delivered at the budget-setting meeting of the Council. While acknowledging some positive changes resulting from committee scrutiny, Cllr Grover expressed alarm over several issues, […]\n11 February 2025 / 11 February 2025 by adminsg\nGreen Party Councillor Matt Fisher has officially launched his campaign for the upcoming Hertfordshire County Council elections, pledging to champion sustainability and community-led initiatives during a crucial period of local government transformation. Speaking at his campaign launch event, Cllr Fisher emphasized the significance of the election amid the planned transition to a unitary authority, describing […]\n1 February 2025 / 1 February 2025 by adminsg\nSt Albans Green councillors have responded to the Council’s latest Air Quality Action Plan with a host of areas for improvement and comments on where the plan falls short of best practice. The Council issued the draft plan in 2024 and consulted residents. The updated plan has been further circulated for comment from councillors. The […]\n3 January 2025 / 3 January 2025 by adminsg\nSt Albans Green councillors Juliet Voisey, Matt Fisher and Simon Grover are planning a range of initiatives for 2025, which focus on both wildlife protection and waste reduction across St Albans district. We are actively working to strengthen Biodiversity Net Gain implementation at council level, ensuring proper guidelines and monitoring procedures are in place to […]\n31 December 2024 / 31 December 2024 by adminsg\nIf you’re thinking of trying Veganuary, or if a member of your family has decided to try plant-based and you don’t know where to start, we’ve got you covered with tips, recipes, and support. Just follow @stalbansgreens on Instagram, Facebook and Bluesky to see our daily updates to help you along the way. And there […]\n20 December 2024 / 20 December 2024 by adminsg\nNew planning rules reduce local control The government’s new National Planning Policy Framework (NPPF) represents a step backwards for local democracy and sustainable development. By allowing planning officers to approve developments without councillors’ input, it sidelines local communities and prioritises profit-driven developers over genuine need. In St Albans, this approach risks creating more high-cost, car-dependent […]\n29 October 2024 by adminsg\nGreen and Independent councillors have voted against the draft Local Plan at a meeting of St Albans Council. The overall result of the vote was that it was passed, due to the large majority of Lib Dem councillors. St Albans urgently needs a local plan. A robust and bold one that secures sustainable, well-built housing […]",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2024_05_04_st-albans-greens-a-whisper-away-from-5-councillors/content_15.html": "In the local elections on 2 May 2024, Juliet Voisey retained her seat in St Peters, while Lucy Swift and Damian Gaskin came within touching distance of a win in Clarence and Batchwood respectively.\nJuliet got over 900 votes, and gets 4 more years as a councillor. Lucy got over 1200 votes which would normally be enough for a win, but was pipped by just 100 or so votes. Damian was just 42 votes short in a nail-biting contest.\nMeanwhile Labour gained two and the Conservatives lost one. As a result, the Green & Independent group of 4 is now the second largest on the Council.\nFull results are on the Council website.\nIn the Hertfordshire Police & Crime Commissioner election on the same day, the Greens’ Matt Fisher won a very respectable 10% of the vote.\nAcross the country, Greens had another great night of results. There are now over 800 Green councillors. Hundreds of new members have joined the party.",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2024_12_20_greens-respond-to-govt-planning-changes/content_12.html": "New planning rules reduce local control\nThe government’s new National Planning Policy Framework (NPPF) represents a step backwards for local democracy and sustainable development. By allowing planning officers to approve developments without councillors’ input, it sidelines local communities and prioritises profit-driven developers over genuine need. In St Albans, this approach risks creating more high-cost, car-dependent homes that fail to address our affordability crisis.\nGrey belt is not a solution\nThe so-called “grey belt” offers no real solution to land shortages in St Albans. Sites such as quarries, car parks and golf courses are limited and often unsuitable for housing. This definition doesn’t magically create viable land – it simply opens the door to inappropriate and environmentally damaging developments. In a district already under pressure, this could lead to conflict between competing priorities like green space preservation, food security, and nature recovery.\nChanges make planning harder\nRather than working to the Council’s advantage, these changes will make things harder. By bypassing local decision-making, they risk imposing poorly planned developments that fail to meet community needs.\nThousands of approved homes remain unbuilt\nThere are already thousands of unbuilt homes nationwide with planning permission, yet the government ignores this bottleneck, blaming councils instead. The new targets will impose inappropriate developments on our green spaces while neglecting vital infrastructure like GP surgeries, schools, and public transport.\nWe need homes that meet local needs\nSt Albans needs the right homes in the right places – high-quality, affordable social housing that meets local needs and adheres to strict environmental standards. Developers must be held accountable for delivering these homes while contributing to essential services, not just profits.\nThe government’s framing of this as a battle between “builders and blockers” is an insult to residents who understand the need for balance – protecting nature and ensuring food security alongside meeting housing demand. Green councillors in St Albans will continue to fight for truly affordable, sustainable housing while opposing damaging developments that threaten our environment and community wellbeing.\nLocal democracy must not be bulldozed.",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2025_02_01_major-green-response-to-air-quality-plan/content_10.html": "St Albans Green councillors have responded to the Council’s latest Air Quality Action Plan with a host of areas for improvement and comments on where the plan falls short of best practice.\nThe Council issued the draft plan in 2024 and consulted residents. The updated plan has been further circulated for comment from councillors. The Council has not announced when the final plan will be published.\nOur response to St Albans’ draft Air Quality Action Plan (AQAP) has called for significant improvements, highlighting several key areas that need strengthening. Our consultation feedback identifies gaps in public health integration, recommending closer collaboration with public health teams and clearer links between air quality actions and local health priorities.\nOur response emphasizes the need for greater focus on PM2.5 pollution, particularly from domestic wood burning, which contributes 27% of these harmful emissions. We call for expanded smoke control areas and better enforcement of solid fuel regulations.\nTransparency and communication emerge as crucial areas for development, with our suggestions for a dedicated air quality website and real-time alert system for poor air quality days. We also highlight the importance of establishing clear timelines and measurable outcomes for initiatives such as the Local Cycling and Walking Infrastructure Plan and High Street closure considerations.\nOur submission includes practical recommendations such as implementing Clean Air Zones, restricting resident permits for diesel cars, and creating zero-emission loading bays and taxi ranks. We also suggest better monitoring of air pollution around schools and rail freight sites, alongside improvements to cycling infrastructure through secure storage and a bike hire scheme.\nWe emphasize that without specific timescales and quantifiable targets, many of these initiatives may fail to deliver meaningful improvements to local air quality.",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_category_local-news_page_2/content_13.html": "6 July 2024 / 10 August 2024 by adminsg\nIn the St Albans constituency, Simon Grover got our highest ever vote here at 3,272, tripling the number compared to 2019, and comfortably over the percentage needed to save our deposit. See St Albans results. In the new Harpenden & Berkhamsted seat we were tightly squeezed by the other parties, but Paul de Hoest managed a […]\nRead more »\n6 June 2024 / 10 August 2024 by adminsg\nWhen we talk to people in St Albans about the General Election, many of them say they are thinking of voting Lib Dem “to keep the Tories out”. But in St Albans, there is absolutely no need to do that. Britain Elects projects a huge 53% majority for Lib Dem Daisy Cooper, with the Conservative […]\n4 May 2024 / 10 August 2024 by adminsg\nIn the local elections on 2 May 2024, Juliet Voisey retained her seat in St Peters, while Lucy Swift and Damian Gaskin came within touching distance of a win in Clarence and Batchwood respectively. Juliet got over 900 votes, and gets 4 more years as a councillor. Lucy got over 1200 votes which would normally be […]",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_tag_river-ver/content_8.html": "Greens oppose local plan 29 October 2024 by adminsg Green and Independent councillors have voted against the draft Local Plan at a meeting of St Albans Council. The overall result of the vote was that it was passed, due to the large majority of Lib Dem councillors. St Albans urgently needs a local plan. A robust and bold one that secures sustainable, well-built housing […] Read more » council flooding local plan river ver",
  "http_stalbans_greenparty_org_uk/https_stalbans_greenparty_org_uk_2025_03_25_simon-urges-council-to-oppose-reorganisation/content_4.html": "Councillor Simon Grover, leader of the Green & Independent group on the Council, has spoken out against the proposed reorganisation of local government, that would see powers centralised and local representation abolished.\nSimon told a Council committee: “St Albans Council should be bold about opposing the proposed abolition of our local government structures. I have heard other councillors say they don’t like it, yet we are not telling the government that. We should be clear that we are not convinced that any benefits that have been proposed by the government outweigh the huge disadvantages.\n“Those disadvantages are numerous. First, there’s the whole question of whether the reorganisation will save any money at all. Nobody really knows. Second, we know that residents will be against this. Any polling that’s been done has shown that residents are against bigger councils, because they understand the value of local representation. Undoubtedly, it reduces democracy, that’s just an objective fact\n“Third, there will be huge transition costs for both local government and national government at a time when there is no money in the pot. Yet suddenly we can supposedly afford a multi-billion pound pointless transformation for local government. Then there is the massive amount of work involved for our officers and the civil service, which means they can’t be doing other things, which should be higher priority.\n“We’ve seen that other councils around the country are coming out and explicitly saying that they oppose this proposal. Doing so is not radical – it’s a perfectly reasonable response to a white paper that affects us as a council.\n“We need to stand up and be counted and have our voice heard on this. We need to say to the minister that this council is opposed to these proposals, at the very least in their current form.”"
}