{
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_great-british-railways/content_25.html": "- 19/05/2023\n- Posted by: Jon Pearce MP\n- Category: News\nThe watering down or scrapping of Great British Railways will hit jobs and the local economy.\nAnother broken promise. Just like the promise High Peak would be a priority for levelling up funding only to see the money go south.\nThe reform of our failing railways is being personally blocked by Rishi Sunak because he does not think they are a priority…\nHopefully he will be forced to back down. He could not be more out of touch with working people who rely on the trains for our work and our leisure.\nWe will never get our local economy growing again without a reliable, integrated and affordable public transport system.\nLabour will bring the train operators back into public ownership and I’ll work with the metro mayors and local councils to better connect us into the major regional economies.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_tackling-serious-and-organised-crime-in-buxton/content_55.html": "- 25/07/2023\n- Posted by: Jon Pearce MP\n- Category: News\nDerbyshire Police have launched a long-term campaign of action to target serious and organised crime in Buxton.\nThis is a vital initiative and the police have my total support. This is why, having spoken with the police, I have been calling on the Government to scrap its plans to set up an asylum dispersal centre in Buxton until these issues with organised crime and drugs have been eliminated.\nThe Home Office know about this police campaign. I am therefore baffled why they are trying to place vulnerable asylum seekers into this area. It is clear that the Home Office’s right hand doesn’t know what its left hand is doing.\nI once again call on the Government to listen to the local police, local council and local community and scrap its plans to convert High Peak Halls.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_high-peak-dental-care-survey/content_53.html": "High Peak Dental Care Survey\nHave you lost your NHS dentist? Are you struggling to find an NHS dentist in High Peak for you or your children? If so, please let me know.\nNHS dentists are as rare as hens’ teeth in High Peak. So many people have contacted me about losing their NHS dentist and being forced to go private or travel for miles to see one.\nI’m especially worried about the impact this is having on children. Children are ending up in hospital to have teeth removed and tooth decay is the most common reason for children the same age as my mine to be admitted to hospital. This is shameful in modern Britain.\nI believe High Peak is one of the areas most in need. By completing the survey below you will be helping to me to make our case that we should be a priority.\nThank you for sharing your experience.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_high-peak-residents-survey/content_18.html": "HIGH PEAK RESIDENTS SURVEY\nI want to hear from residents in High Peak about the issues that are the most important to you.\nWeek in and week out I am talking to people on the doorstep and in town centres across High Peak about the issues that matter most to them.\nI hear worries about how people are going to make ends meet with their energy bills and mortgages sky rocketing; despair at being stuck on NHS waiting lists or not being able to see an NHS dentist; frustration about cuts to bus services or trains never running on time; and concerns about drugs and anti-social behaviour in their local communities.\nIf I have not had chance to speak to you yet, please do let me know what matters most to you and what you think my priorities should be for High Peak.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_an-object-lesson-in-bad-government/content_40.html": "- 21/09/2023\n- Posted by: Jon Pearce MP\n- Category: News\nYesterday was another object lesson in bad government. A divided party, leaking and briefing against each other, emergency cabinet meetings and desperate policy announcements on the hoof.\nBusinesses need stability and confidence in order to invest. So it is no surprise that they are up in arms after Rishi Sunak weakened and kicked the can down the road on his Government’s own targets to reduce the UK’s harmful greenhouse gas emissions.\nIt’s not very often I agree with Boris Johnson but he was right yesterday when he said that businesses “must have certainty about our Net Zero commitments”\nRepresentatives of UK manufacturing said this “sends exactly the wrong message… we aren’t looking forward, we’re going backwards.”\nFord motors pleaded: ‘Our business needs three things from the UK govt: ambition, commitment & consistency. A relaxation of 2030 would undermine all three.’\nIndeed, Rishi Sunak himself only a matter of weeks ago said he had no intention of ditching the 2030 target date, with number 10 arguing the target has been critical in securing investment in EV manufacturing and supply chains.\nWas he wrong then or is he wrong now?\nIt is no wonder businesses feel betrayed.\nThis is bad for business, bad for jobs, bad for household energy costs and bad for our environment.\nNobody (not even his own party) voted for Rishi Sunak and he has no mandate for the ditching of these commitments. He should do the right thing and call a general election.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_category_news_page_2/content_29.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_nhs-survey-your-experiences-with-local-nhs-services/content_21.html": "- 23/01/2023\n- Posted by: Jon Pearce MP\n- Category: News\nOur NHS is in Crisis. So many people across High Peak have contacted me about their experiences with our local NHS services. A young family stuck in A & E for hours, a child distraught at having their operation cancelled at the last minute due to staff shortages, a lady diagnosed with cancer feeling she had choice but to pay huge private fees rather than face the anxiety of waiting for NHS treatments.\nThere are hundreds of people dying each week unnecessarily across our NHS because of the mismanagement and underfunding by this government.\nNHS Dentists are becoming as rare as hen’s teeth across our towns – with most recently dentists in New Mills and Glossop ceasing to provide NHS services forcing their patients to pay for private care. Costing families hundreds of pounds of additional costs, which many simply cannot afford during the worst crisis in living costs in living memory.\nThe NHS is part of my DNA. My Mum was a nurse like her parents before her. My wife, nephew, and niece all work for the NHS today. As a lawyer I advise in the health and social care sector. I hear first-hand the pressure the NHS is under.\nThere are not enough staff. There are not enough beds. And there is not enough social care, which results in many patients being stuck in hospital who do not need to be there.\nI want the NHS to survive and thrive. I believe in the NHS’s founding principle that it should be free at the point of access for all. The Conservatives are starting to talk about charging people to see their GP and receive care at A & E.\nI want to make the case for better healthcare services for the people of High Peak. Please help me by completing my quick survey and telling me about your experiences.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_your-experiences-to-get-an-nhs-dentist/content_59.html": "- 13/01/2024\n- Posted by: Jon Pearce MP\n- Category: News\n🦷Have you not been able to get an NHS dentist?\n🦷Have you been forced to go private?\n🦷Have you got to the point where you are thinking of pulling your own teeth out?\nTell me about your experiences here 👇\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_under-the-tories/content_47.html": "This week we have witnessed yet more instability with this Government:\n- the Conservative Party Chair had to be sacked for breaching the ministerial code over his tax affairs;\n- Liz Truss attempted a comeback but failed to say sorry for crashing the economy; and\n- Rishi Sunak was forced into a desperate reshuffle after only 100 days in Downing Street as his approval ratings sank even further.\nAnd it is families in High Peak that are bearing the brunt of this chaos and incompetence.\nAnalysis shows that further rate rises to try to get inflation under control will mean that households with mortgages in High Peak are predicted to be £2190 worse of this year.\nIt follows the Bank of England warning in December that around half of households with a mortgage, will be exposed to rate rises this year, and Bloomberg reporting that around 800,000 will see their mortgage rates double.\nThis week also saw the IMF chief economist single out higher mortgage rates as a reason for Britain’s poor economic performance after the country’s growth was downgraded, leaving it as the only major economy expected to shrink in 2023.\nHouseholds in High Peak literally cannot afford another 18 months of this government.\nIt doesn’t have to be this way. By stabilising the economy, making it stronger and getting it growing, Labour will stop us lurching from crisis to crisis, and make Britain thrive again.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n- likes love haha sad 29\n- Comments: 21\n- Shares: 1\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_privacy-policy/content_7.html": "PRIVACY POLICY\nThis “Privacy Policy” sets out information relating to how I use personal information relating to constituents and visitors to this website.\nPRIVACY NOTICE FOR WEBSITE VISITORS\nWHAT’S INCLUDED IN THIS PRIVACY NOTICE?\nJON PEARCE MP\nThis document (“privacy notice”) sets out information relating to how I will use personal information relating to website visitors. It also sets out information about what rights individuals have in relation to their personal information and various other matters required under data protection law.\nIn particular, this privacy notice provides information to website visitors about how they can object to my use of their personal information, how they can withdraw any permissions they have given to enable me to process their personal information, and how they can make a complaint.\nWHO DOES THIS PRIVACY NOTICE APPLY TO?\nThis privacy notice applies to website visitors\nWHAT’S MY APPROACH TO PRIVACY?\nI take your privacy extremely seriously and want you to feel confident that your personal information is safe in my hands.\nI will only use your personal information in accordance with the data protection law applicable to England and Wales from time to time.\nUnder data protection law, when I use your personal information, I will be acting as a data controller. Essentially, this means that I will be making decisions about how to use your personal information and why.\nBelow, I summarise the main rules that apply to me as a data controller under data protection law when I use your personal information:\n- I must be upfront about how I intend to use your personal information and must use your personal information fairly. Providing privacy information to individuals (such as in this privacy notice) is one aspect of using personal information fairly.\n- I must only use your personal information if I have a legal basis to do so under data protection law. These legal bases include:\n- That you have consented to my use of your personal information;\n- That my use of your personal information is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in me.\n- I must only use certain types of sensitive personal information, also referred to as special category personal information (such as information relating to your health, racial or ethnic origin, political opinions, or criminal convictions) if I can also satisfy one of the conditions for processing this type of information set out in data protection law. These conditions include:\n- That you have given me your explicit consent to use the information; and\n- That the processing is necessary for reasons of substantial public interest.\n- I am only permitted to share your personal information with others in certain circumstances and if I take steps to ensure that your personal information will be secure.\n- Generally speaking, I must only use your personal information for the specific purposes I have told you about. If I want to use your personal information for other purposes, I need to contact you again to tell you about this.\n- I must not hold more personal information than I need for the purposes I have told you about and must not retain your personal information for longer than is necessary for those purposes (this is known as the “retention period”). I must also dispose of any information that I no longer need securely.\n- I must ensure that appropriate security measures are in place to protect your personal information.\n- I must act in accordance with your rights under data protection law.\n- I must not transfer your personal information outside the European Economic Area (“EEA”) unless certain safeguards are in place. One such safeguard is that the personal data is only transferred to a country that has been approved by the European Commission as having an acceptable level of data protection law.\nHOW WILL I USE YOUR PERSONAL INFORMATION?\nHow I will use your personal information, the legal bases I will rely upon, how long I will keep your personal information and other details are set out below.\nWhat personal information I will use\n- Your name;\n- Your address;\n- Your contact details (email address, telephone number etc.);\n- Information provided about you when raising an issue or a concern with me. This information may include special category personal information such as your:\n- racial or ethnic origins\n- political opinions\n- religious or philosophical beliefs\n- membership of a trade union\n- physical or mental health (including details of any disability)\n- sexual orientation\n- details of any known disability\n- commission or alleged commission of any offence\nHow I will obtain the personal information\n- Provided by you when you contact me with an enquiry or concern or by a third party where the enquiry or concern is raised on your behalf.\nWhat purposes I will use the personal information for\n- I will use your name, address and other contact details to communicate with you about the issue or concern raised and to provide you with updates on my campaign related activities;\n- I will use your personal information to progress your issue or concern and to take steps to address the matter.\nThe legal bases for processing I rely upon\n- My use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in me. This is generally because the processing of your personal data by me will be in the performance of casework activities which by their nature support or promote democratic engagement;\n- Where your issue or concern is one which involves the processing of special category data, my use of your special category personal data will be necessary for reasons of substantial public interest. This is because the processing is carried out by me in my capacity as an elected representative, in connection with the discharge of my functions and is in response to a request by you to take action or a request on your behalf.\nHow long I retain the personal information and why\n- I will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help. If you have consented to receive information about my work, I will only retain your personal information until you ask not to be contacted further. I will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nSURVEYS\nWhat personal information I will use\n- Your name;\n- Your address;\n- Your contact details (email address, telephone number etc);\n- Your opinions or other personal information provided by you in the survey.\nHow I will obtain the personal information\n- Provided by you when you complete the survey\nThe legal grounds I rely upon\n- My use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in me. This is generally because the processing of your personal data by me will be in performance of activities which by their nature supports or promotes democratic engagement.\nHow long I retain the personal information and why\n-\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. I will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nWHEN WILL I USE YOUR PERSONAL INFORMATON FOR DIRECT MARKETING?\nIn addition to data protection law, if I use your personal information for direct marketing purposes, I may also be subject to additional rules that regulate direct marketing. The term “direct marketing” essentially means directing marketing material or political campaign communications at a particular individual.\nTo ensure compliance with both data protection laws and the specific rules relating to direct marketing, I will only use your personal information to provide you with political campaign information, , whether by telephone, email, text, social media or other forms of electronic communication or by post if you have given me your specific consent to do so.\nMy legal basis for such processing under data protection law will therefore be that you have given your consent to process your personal data for direct marketing purposes.\nI will retain your personal information unless and until you inform me that you no longer wish to receive direct marketing information from me. You can ask me to stop sending direct marketing to you at any time by contacting me using the details set out in the section below titled –\n“How can you get in touch with me?”\nIP ADDRESSES AND COOKIES\nWhen visiting and interacting with most websites and services delivered via the internet, when you visit my website, the technology used on my website, and via the hosting provider(s) I use, gathers certain information and stores it in log files.\nThis information includes Internet Protocol (IP) addresses, operating system, browser version, cookie details, the content you viewed on my Website, system and configuration information, and locale and language preferences. This information gathered will only be used to monitor and ensure the security of my website and the data kept on it and/or to make website improvements for the benefit of visitors to my website. I collect and use Log Data to operate, maintain and improve upon the information For example, Log Data can help to detect new security threats on my website, identify malicious third parties, and provide more robust security protection for all users that visit and communicate with me via my website.\nMy website may use cookies and other information gathering technologies for a variety of purposes, such as providing me with information about how visitors interact with the content on my website and to allow me to improve upon the services and/or information on my website for the benefit of all users. You can control how websites use cookies by configuring your browser’s privacy settings (please refer to your browser’s help section to learn more about cookie controls). If you choose to disable cookies entirely, the services and/or information provided on my website may not function properly.\nNEWSLETTERS\nWhat personal information I will use\n- Your name;\n- Your contact details (postal address, email address, telephone number etc.);\nHow I will obtain the personal information\n- Provided by you.\nWhat purposes I will use the personal information for\n- To provide you with information about the work I undertake.\nThe legal grounds I rely upon\n- You have given your consent\nOR - My use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in me. This is because the processing of your personal data by me will be to provide you, by post, with communications about my work, an activity which I consider promotes democratic engagement\nHow long I retain the personal information and why\nUntil you tell me that you no longer wish to receive newsletters and updates from me. You can ask me to stop sending direct marketing to you at any time by contacting me using the details set out in the section below titled – “How can you get in touch with me?”\nWHEN WILL I SHARE YOUR PERSONAL INFORMATION WITH OTHERS?\nSometimes, I will need to share your personal information with others. This section sets out details of who I will share your personal information with and why. It also tells you about my legal basis for doing so under data protection law and steps I will take to protect your personal information.\nORGANISATIONS WHO CAN ASSIST WITH YOUR CASE\nWho are these Organisations?\n- I will share such of your personal information as is necessary with organisations who can assist with your case. Often these will be organisations such as local authorities and health boards which will, from time to time, depending on the nature of your query or concern, be able to assist with your case or will have information relevant to your case.\nWhy I need to share your personal information with them\n- To assist with your case or to obtain information relevant to your case.\nThe legal bases I rely upon when sharing your personal information\n- Sharing of personal data with such organisations will be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in me.\nWhat precautions do I take?\n- I will only share personal data as is necessary and will take steps to determine that the organisations are aware of the importance of protecting personal data.\nPROVIDERS OF INFORMATION TECHNOLOGY SERVICES\nWho will we be sharing your personal information with?\n- Suppliers of information technology products and services such as:\n- I work with other companies to help run my website. These companies provide services to help me to maintain my website, deliver support to my constituents, provide communications support and maintain administrative and security support on my behalf. These Service Providers may only process personal information pursuant to instruction and in compliance with my Privacy Policy and other applicable confidentiality, security measures and regulations. I do not permit any Service Providers to use any personal information I share with them for their own marketing purposes or for any other purpose than in connection with the services they provide to me.\nWhy I need to share your personal information with such providers\n- I use suppliers of information technology products and services in connection with the supply, maintenance and/or improvement of my IT network, to manage casework effectively through appropriate software provision, and the creation, development hosting and maintenance of my website.\nThe legal bases I rely upon when sharing your personal information\n- I rely upon my legitimate interests in ensuring that my work as [position] is managed efficiently and my IT system can function properly and efficiently and that my IT network is secure.\nWhat precautions do we take?\n- I enter into contracts with my IT providers which require them to put appropriate security measures in place and which restrict their use of your personal information.\nOTHER THIRD PARTIES\nI may also need to share your personal information with others in the following circumstances:\nLegal or regulatory requirements\nOn occasion, I may be required to disclose your personal information to organisations such as the courts or the police to comply with legal obligations we are subject to and/or to prevent fraud or crime.\nSafeguarding\nOn occasion, I may need to disclose your personal information to other organisations such as the local authority or the police for safeguarding purposes in the substantial public interest.\nProfessional advice and legal action\nI may need to disclose your personal information to my professional advisers (for example, lawyers and accountants) in connection with the provision by them of professional advice and/or the establishment or defence of legal claims.\nPolitical Campaign Purposes\nI may disclose your personal information with the Labour Party and staff for campaign and other purposes. Sharing of the data is intended to help promote my campaign activities and the Labour Party by serving you advertisements and content online about politicians, campaigns and policies we think you might be interested in. The privacy policies of the Labour Party can be found at: https://labour.org.uk/general-electorate-and-donors-privacy-policy/.\nWHAT RIGHTS DO YOU HAVE UNDER DATA PROTECTION LAW?\nUnder data protection law, you have a number of different rights relating to the use of your personal information. The table below contains a summary of those rights and my obligations. More information about your rights and my obligations can be found on the ICO website https://ico.org.uk/.\nYour rights – What this involves – What our obligations are\nA right of access\nThis is a right to obtain access to your personal data and various supplementary information.\n- I must provide you with a copy of your personal information and the other supplementary information without undue delay and in any event within 1 month of receipt of your request;\n- I cannot charge you for doing so save in specific circumstances (such as where you request further copies of your personal information).\nA right to have personal data rectified\nThis is a right to have your personal information rectified if it is inaccurate or incomplete.\n- I must rectify any inaccurate or incomplete information without undue delay and in any event within 1 month of receipt of your request;\n- If I have disclosed your personal information to others, I must (subject to certain exceptions) contact the recipients to inform them, that your personal information requires rectification.\nA right to erasure\nThis is a right to have your personal information deleted or removed. This right only applies in certain circumstances (such as where I no longer need the personal information for the purposes for which it was collected). I have the right to refuse to delete or remove your personal data in certain circumstances.\n- If this right applies, I must delete or remove your personal information without undue delay and in any event within 1 month of receipt of your request;\n- If I have disclosed your personal information to others, we must (subject to certain exceptions) contact then recipients to inform them that your personal information must be erased.\nA right to object\nThis is a right to object to the use of your personal information. The right applies in certain specific circumstances only. You can use this right to challenge my use of your personal information based on my legitimate interests or where the processing is necessary for the performance of a task in the public interest or in the exercise of official authority vested in me. You can also use this right to object to use of your personal information for direct marketing\n- If you object to me using your personal information for direct marketing, I must stop using your personal information in this way as soon as I receive your request.\n- If you object to other uses of your personal information, whether I have to stop using your personal information will depend on the particular circumstances.\nA right to restrict processing\nThis is a right to ‘block’ or suppress processing of your personal information. This right applies in various circumstances, including where you contest the accuracy of your information).\n- If I I am required to restrict my processing of your personal information I will be able to store it but not otherwise use it.\n- I may only retain enough information about you to ensure that the restriction is respected in future.\n- If I have disclosed your personal information to others, I must (subject to certain exceptions) contact them to tell them about the restriction on use.\nIf you wish to exercise any of your rights, you can make a request by contacting me using the details set out in the section below titled –\n“How can you get in touch with me?”\nIf you request the exercise of any of your rights I am entitled to ask you to provide me with any information that may be necessary to confirm your identity.\nYOUR RIGHT TO WITHDRAW CONSENT\nIf you have given me your consent to use any of your personal information, you can withdraw your consent at any time. To do so, please contact me using the details set out in the section below titled – “How can you get in touch with me?”\nHOW CAN YOU GET IN TOUCH WITH ME?\nYou can get in touch with me in the following ways:\nEmail address: [email protected]\nI am the person overseeing compliance with data protection law and this privacy notice. If you have any questions about this privacy notice, how your personal information is handled or if you wish to make a complaint, please contact me.\nRIGHT TO COMPLAIN TO THE INFORMATION COMMISSIONER’S OFFICER\nIf I am unable to deal with a complaint to your satisfaction or if you are unhappy with the way I am using your personal data, you also have the right to make a complaint at any time to the UK’s supervisory authority for data protection issues, the Information Commissioner’s Office.\nCHANGES TO THIS PRIVACY NOTICE\nI may update this privacy notice from time to time. If I make any substantial updates, I will provide you with a new privacy notice. I may also notify you in other ways from time to time about the processing of your personal information.\nIn effect: 29/07/24\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_conservative-mp-petitions-himself-again/content_56.html": "- 10/05/2023\n- Posted by: Jon Pearce MP\n- Category: News\nA number of people have raised with me the fact that local Conservative MP and Government Whip, Robert Largan, appears to have started a petition against himself and his Government.\nThe cervical cancer screening clinic in Buxton is being forced to close as the NHS in Derbyshire has been unable to recruit a replacement for a retiring consultant.\nApparently Mr Largan has started a petition to bring the service back. You have to admire his chutzpah when he and his Government are responsible for the NHS workforce crisis that has caused this cut in local services.\nThe NHS in Derbyshire has made it clear that they wanted to recruit a replacement, they just have not been able to find one yet. If they do manage to recruit, it will be nothing to do with Mr Largan’s petition. If he actually wanted to do something about the problem he would get his Government to address the causes they have created.\nThis isn’t the first time Mr Largan has petitioned himself. He started a petition along with one of his Conservative County Councillors for the return of the 185/186 bus in Harpur Hill. What he failed to mention was that the Conservative Council was responsible for the bus service cuts and they were the only ones that had the power to reinstate it.\nThey are taking us for fools.\nThe fact is our NHS is in a crisis created in Downing Street with people waiting hours for ambulances, weeks to see a GP and months for treatments and operations.\nThis government is responsible for the largest waiting lists in the history of the NHS. There are now more people on NHS waiting lists than the population of New Zealand.\nMany of these issues arise due workforce shortages. The NHS currently has 9,000 vacancies for doctors, with a record 133,000 vacancies in total. Despite these shortages, last summer Mr Largan’s Government actually cut the number of medical school places – turning away straight ‘A’ students desperate for a career in the NHS.\nThis continued shortfall in doctors means this Government is wasting billions of taxpayers’ money on agency staff to fill gaps in rotas.\nWe are also seeing a complete breakdown in trust between our doctors and nurses and this Government with unprecedented strikes. This Government has gone from clapping nurses to taking them to court. Its abject failure to negotiate a resolution is hurting patients.\nIn 1997 the last Labour government inherited an NHS on its knees. The next Labour Government will inherit an NHS flat on its face. But like the last Labour Government, we can once again make the NHS the envy of the world.\nAnd we will start with one of the biggest expansions in the NHS workforce in history, including doubling the number of medical school places to 15,000 and creating an additional 10,000 nursing and midwifery placements every year so we have the doctors and nurses we need in our NHS.\nThat’s what the NHS needs not MPs petitioning themselves to do better.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_purchase-of-the-springs-shopping-centre/content_45.html": "- 02/02/2023\n- Posted by: Jon Pearce MP\n- Category: News\nI am hugely excited by the news that Labour Councillors on High Peak Borough Council have secured the purchase of The Springs shopping centre.\nWe have witnessed the slow death of high streets across the country over the last decade. Which is why it is so exciting to see our Labour councillors having the vision and the courage to take on this challenge.\nThe purchase of the Springs will kick-start the redevelopment of the town centre and start to unlock the town’s enormous potential.\nLabour understands that local communities – not Westminster – are best placed to deliver the real change their areas need.\nThe next Labour government will give local leaders the tools to develop long term growth plans and devolve new powers over employment support, transport, climate change, housing and childcare.\nThese powers will empower people in the towns across High Peak to deliver real change for their local economies.\n#highpeak #BuildABetterBuxton\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_visit-to-buxton-community-school/content_27.html": "- 13/05/2024\n- Posted by: Jon Pearce MP\n- Category: News\nI had a great time visiting Buxton Community School last week.\nThe Q & A with sixth formers was fun with loads of very well informed and challenging questions on everything from buses, to the closure of children’s centres, and stopping the pollution of our rivers.\nMuch better than BBC Question Time.\nThey even let me win at darts…\nThank you so much to all the staff and pupils for welcoming me!\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_take-back-control-bill/content_34.html": "Two leaders’ speeches in two days and the contrasts could not be starker.\nSunak delivered more sticking plasters. Even if he delivers on his very limited pledges, we will all still be worse off, our economy weaker and our public services still failing as result of years of mismanagement and underfunding.\nIn contrast Keir Starmer set out Labour’s mission for national renewal and for the hope that things can get better – which for so many people is hard to imagine whilst they struggle day-to-day trying to make ends meet.\nLabour understands that people feel helpless at the moment – let down by an out of touch government that does not understand their community’s needs.\nLabour will spread control out of Westminster by devolving new powers over employment support, transport, climate change, housing and childcare.\nThese powers will give people in the towns across High Peak the tools they need to deliver real change for their local economies.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n- likes love haha sad 29\n- Comments: 21\n- Shares: 1\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_useful-links/content_3.html": "USEFUL LINKS\nUse the links below to read helpful information from public service providers.\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_new_contact/content_23.html": "PAGE NOT FOUND\nWe couldn’t find the page you’re looking for. The link you clicked may be broken or the page may have been removed.\nVisit the Homepage or Contact Us page about the problem.\nDAILY UPDATES\nLatest News\nKeep updated on the latest news, campaigns and my work on behalf of voters in High Peak.\n-\nLocal Government Reorganisation\nI am interested to know what your priorities are in terms of how local government should be restructured locally and regionally to best meet our economic and public service needs.\n20/12/2024Read More -\nChristmas Card Competition\nEarlier in the year I wrote to all of High Peak’s primary school to let them know that I am running a Christmas card competition this year. It is open to all primary school children in the High Peak The theme is “Where I live” and I would like students to draw or paint whatever\n31/10/2024Read More -\nFully costed first steps for change\nKeir Starmer has set out Labour’s five national missions to get Britain’s future back. The missions are long term, fully funded aims that will guide a Labour government’s decisions to deliver a decade of national renewal.\n16/05/2024Read More\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_our-gang-glossop-autistic-neurodivergent-youth-group/content_58.html": "- 30/06/2023\n- Posted by: Jon Pearce MP\n- Category: News\nIt was great to join Connect and Our Gang: Glossop Autistic & Neurodivergent Youth Group last week. They both provide such valuable support to local to autistic/ADHD & neurodivergent young people and parents & carers.\nLooking forward to going back to see them all again soon.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_petition-support-high-peak-students-to-get-fairer-fares/content_20.html": "Petition: Support High Peak Students to Get Fairer Fares\nPlease sign our petition to support our campaign to ensure all students within the High Peak get the same travel opportunities as their fellow students in Greater Manchester. Our students deserve equality and the same opportunities.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_localgovchanges/content_8.html": "Local Government Reorganisation\nI am interested to know what your priorities are in terms of how local government should be restructured locally and regionally to best meet our economic and public service needs. Let me know below.\nSubmit your views on how local government should be restructured\nThe Government is proposing changes to how local government is organised in order save costs, streamline accountability and improve public services. They would see smaller district councils, like High Peak Borough Council, and large county councils, like Derbyshire County Council, disappear with new larger single authorities created to replace them.\nDerbyshire Conservatives are proposing a mega council covering all of Derbyshire run from Matlock. I don’t think that best serves the best interest of us here in High Peak.\nI am interested to know what your priorities are in terms of how local government should be restructured locally and regionally to best meet our economic and public service needs. Let me know in the form on this page.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_our-pass-campaign/content_52.html": "- 30/09/2023\n- Posted by: Jon Pearce MP\n- Category: News\nGreat meeting today. Vickie and the other families are doing such a brilliant job. We are now getting regional media attention.\nOur young people are long overdue getting their fair share. I’ll do everything I can to support them.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_save-castletons-visitor-centre-museum/content_39.html": "Save Castleton’s visitor centre and museum\nJoin and support the campaign to save Castleton’s visitor centre and museum at the petition link below.\nLast weekend I signed the petition and joined in with the Castleton Historical Society’s campaign to save Castleton’s visitor’s centre and museum.\nVisitor centres are the public face of the National Park. They play are vital role in providing information and advice to thousands of visitors each year. They help to make the Park accessible for all and to ensure it is enjoyed in a sustainable way.\nThe visitor centre and the museum are inextricably linked. The museum is a brilliant resource exploring the area’s rich history. They provide a focal point for the village and would be a huge loss to the local community as well as the many schools that visit each year.\nI know our National Parks are under severe financial strain but we must save these precious resources. Our National Parks, including the Peak District, receive most of their money from the Government. The Tories have cut the money for our National Parks by about 40% in real terms over the last decade.\nThe Government recently announced a one off pay out for our National Parks. This will not be enough to guarantee the future of Castleton’s visitor’s centre and museum. This is yet more sticking plaster politics from the Government. Our National Parks need a sustainable long term future not one off handouts to try to avoid a crisis.\nPlease sign the petition because once they’re gone we may never get them back.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_christmas-card-competition/content_4.html": "- 31/10/2024\n- Posted by: Jon Pearce MP\n- Categories: Competition, News\nEarlier in the year I wrote to all of High Peak’s primary school to let them know that I am running a Christmas card competition this year. It is open to all primary school children in the High Peak\nThe theme is “Where I live” and I would like students to draw or paint whatever it is that makes them proud about living in the High Peak. This can be anything from local landmarks, parks, animals or even just friends and family. They may use whatever materials they want, but please note glitter can make it difficult to scan! I want this competition to showcase the brilliant talent and creativity we possess in the High Peak.\nA winner will be chosen from each year group, and I will be enlisting some select local businesses and charities to help me choose our favourite designs. The winning entries will be used as my official Christmas Card, sent via e-card.\nSchools can either scan and email designs to me at [email protected], or post them to:\nJon Pearce MP\nHouse of Commons\nLondon,\nSW1A 0AA\nThe deadline for entries is Monday 11th November.\nGood luck to all students and may the best designs win!",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_petition-save-high-peaks-ticket-offices/content_24.html": "Petition: Save High Peak’s ticket offices\nPlease sign this petition if you oppose the closure of High Peak’s ticket offices.\nSign our petition to the Secretary of State for Transport, Mark Harper MP, below.\nDear Mark Harper MP,\nWe strongly oppose the proposed closure of the High Peak ticket offices in Buxton, Dinting, Hadfield, New Mills Central, New Mills Newtown and Whaley Bridge. The closure of these High ticket offices would impact the ability to buy tickets, plan future journeys, receive advice and assistance and navigate the station.\nWe oppose the closure of High Peak Station’s ticket office due to:\n- Availability of staff and assistance – Having staff at a central identified ticket office provides passengers with confidence to know where to go to access assistance, information and advice. If staffing levels were reduced or existing ticket staff redeployed to ‘multifunctional roles’, this crucial point of contact would be lost. ‘Multifunctional staff’ may be beyond the ticket barrier; therefore, passengers would need to buy a ticket to access the service they require.\n- Accessibility – Closing these ticket offices in High Peak will force passengers to purchase tickets through online booking or at Ticket Vending Machines (TVMs), many passengers will find this detrimental to their needs, including those who are elderly, disabled or have visual impairments.\n- Safety and security – Visible staff at these High Peak ticket offices are critical to passengers’ safety and security, providing a point of contact which could offer immediate help during an emergency.\nWe are calling on you to save the High Peak ticket offices at Buxton, Dinting, Hadfield, New Mills Central, New Mills Newtown and Whaley Bridge.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_videos/content_9.html": "VIDEO PLAYLISTS\nI aim to make democracy accessible to everybody. On my website you’ll find videos from my campaign and across High Peak.\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_derbyshire-county-council-is-facing-bankruptcy/content_48.html": "- 15/09/2023\n- Posted by: Jon Pearce MP\n- Category: News\nThe Tories have taken Derbyshire County Council to the brink of bankruptcy (read more here).\nThis is really worrying news. Our local services are already cut to the bone. We will be seeking urgent clarification on what more cuts the Tories are proposing and, together with trade unions the GMB Midlands and UNISON East Midlands, reassurances that there will not be any impact on staff.\nWe will keep you updated.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_category_news_page_6/content_19.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_petition-stop-dumping-of-raw-sewage-into-rivers-and-waters/content_46.html": "petition to stop the dumping of raw sewage into our rivers and waters\nWe need to act now to save our precious rivers and waters from further harm. Please sign our petition below.\nRaw sewage was dumped into High Peak’s rivers and waters 1653 times last year, which equates to a new sewage spill every 5 hours. This is a damning indictment of the Government’s failure to protect the High Peak’s precious environment and our communities.\nThe damage isn’t just in our community, it’s a national scandal. Every year, millions of tonnes of raw sewage is dumped across Britain’s natural environment.\nTo make matters worse, not only have the Government given the green light for water companies to dump sewage and neglect our vital water infrastructure, but they have also rewarded them for it by allowing shareholders to walk away with billions of pounds in dividends and bumper bonuses for negligent water bosses.\nWe need to act now to save our precious rivers and waters from further harm. Please sign our petition on this page.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_contact/content_16.html": "CONTACT\nWould you like to learn more about my work in Parliament and campaigns? Please use the contact form below to get in touch.\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n01298 918189\n-\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_armed-forces-day/content_44.html": "- 24/06/2023\n- Posted by: Jon Pearce MP\n- Category: News\nOn #ArmedForcesDay, I want to say thank you to all our Armed Forces for all they do to keep Britain safe.\nTheir’s is the ultimate public service and we need to have their back in return.\nThe next Labour Government will stand by our troops, veterans and their families. We will boost mental health support, ensure our heroes have good homes to live in and fully incorporate the Armed Forces Covenant into law.\n#highpeak #glossop\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_category_news_page_3/content_33.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_category_news_page_5/content_31.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com/content_1.html": "Do you need help on local issues? Get in touch today.\nDAILY UPDATES\nLatest News\nKeep updated on the latest news, campaigns and my work on behalf of voters in High Peak.\n-\nLocal Government Reorganisation\nI am interested to know what your priorities are in terms of how local government should be restructured locally and regionally to best meet our economic and public service needs.\n20/12/2024Read More -\nChristmas Card Competition\nEarlier in the year I wrote to all of High Peak’s primary school to let them know that I am running a Christmas card competition this year. It is open to all primary school children in the High Peak The theme is “Where I live” and I would like students to draw or paint whatever\n31/10/2024Read More -\nFully costed first steps for change\nKeir Starmer has set out Labour’s five national missions to get Britain’s future back. The missions are long term, fully funded aims that will guide a Labour government’s decisions to deliver a decade of national renewal.\n16/05/2024Read More\nLatest Videos\nI aim to make democracy accessible to everybody. On my website you’ll find videos from my campaign and across High Peak.\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm. ... See MoreSee Less\n21 CommentsComment on Facebook\nHaving a well-earned break from a really positive canvassing session with the brilliant Cllr Jo Taylor for Whaley Bridge & Blackbrook. Fish and chips at Frydays Cod & Cake in Whaley Bridge is always a treat! ... See MoreSee Less\n21 CommentsComment on Facebook\nOnly Labour can beat the Tories here in High Peak.\nA vote for Greens, Lib Dems or Independent will lead to a Tory-run Derbyshire County Council.\nVote Labour 🌹 ... See MoreSee Less\n31 CommentsComment on Facebook\nTODAY IS ELECTION DAY.\n⏰ Polling stations open until 10pm.\n🪪 Remember to take ID with you.\nVote Labour TODAY🌹 ... See MoreSee Less\n9 CommentsComment on Facebook\nAmid a packed schedule, I managed to grab a quick bite at Pug and Pudding in Chapel-en-le-Frith — and it didn’t disappoint! 🍔\nAlways a pleasure to support a fantastic local business serving up quality food with heart. If you’re nearby, pop in! 👌🏼 ... See MoreSee Less\n8 CommentsComment on Facebook\n𝐍𝐞𝐚𝐫𝐥𝐲 𝐚 𝐜𝐞𝐧𝐭𝐮𝐫𝐲 𝐨𝐧 𝐭𝐡𝐞 𝐦𝐚𝐬𝐬 𝐭𝐫𝐞𝐬𝐩𝐚𝐬𝐬 𝐢𝐬 𝐬𝐭𝐢𝐥𝐥 𝐢𝐦𝐩𝐚𝐜𝐭𝐢𝐧𝐠 𝐩𝐨𝐥𝐢𝐜𝐲 𝐭𝐨𝐝𝐚𝐲\nLast weekend, I had the privilege of addressing the crowd at the 93rd Kinder Mass Trespass event. This event is held annually to commemorate the most successful piece of direct action that our country has seen. A rare moment in our history where a straight line can be drawn between the actions of Benny Rothman and his fellow ramblers to the access to nature that people in High Peak and across Britain love and cherish today.\nThe Labour government, elected after the Second World War and led by Clement Attlee, recognised the need to protect nature and preserve our countryside for the people. They passed the legislation to create the first National Parks, ensuring access to places like the Peak District, which dominate our landscape.\nSince then, it has fallen to Labour governments throughout our history to step up to protect our natural environment. In 1968, Harold Wilson’s government passed the Countryside Act, which mandated every government minister and public body across the country to have due regard to conserving the natural beauty and amenity of the countryside.\nIn 2000, it was Tony Blair’s government which passed the Countryside and Rights of Way Act, finally giving walkers the right to roam on more areas of the Peak District and other national parks.\nI’m immensely proud to say that Labour has led the way in protecting our environment, from ensuring access to nature, to signing international agreements like the Kyoto Protocol and passing laws that will reverse the impact that climate change will have on areas like the Peak District.\nLast week, in the House of Commons, I spoke about the disastrous sale of our water industry into private hands and how before the election, we saw a sewage spill in High Peak every five hours. Labour’s Water (Special Measures) Act will ban the bonuses of the bosses who have failed us and ensure that polluters, not taxpayers, foot the bill on the costs of enforcement.\nIn December, the Government updated the planning framework to ensure that that planning policies and decisions should contribute to and enhance the natural and local environment. Too often we have seen nature recovery stall, but we’re now heading in the right direction to deliver gains for nature and biodiversity.\nWhilst Reform and the Conservatives compete over which party cares less about our environment and our planet, I am determined that this Government will continue in the proud history of previous Labour Governments in extending access to nature and protecting our precious environment. ... See MoreSee Less\n7 CommentsComment on Facebook\n🗳️ I'm backing Councillor Stewart Gardner's plan for the former Glossopdale School site. Vote Labour on Thursday, 1 May 🌹 ... See MoreSee Less\n5 CommentsComment on Facebook\n𝐇𝐚𝐩𝐩𝐲 𝐒𝐭 𝐆𝐞𝐨𝐫𝐠𝐞’𝐬 𝐃𝐚𝐲 𝟐.𝟎\nThe Church of England changed this year’s date from the customary 23 April as no saints days are celebrated during the Easter weeks. So for those that mark the day via the church's calendar - happy St George's Day. 🏴 ... See MoreSee Less\n0 CommentsComment on Facebook\n📺 𝐖𝐀𝐓𝐂𝐇: 𝐖𝐞'𝐫𝐞 𝐬𝐭𝐨𝐩𝐩𝐢𝐧𝐠 𝐭𝐡𝐞 𝐬𝐞𝐰𝐚𝐠𝐞.\nAfter years of ideology being put before the national interest, our rivers, and our wildlife, we're taking action — fixing our water system and putting people and nature first. ... See MoreSee Less\n11 CommentsComment on Facebook",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_labour-is-the-party-of-law-and-order/content_42.html": "Everyone has a right to feel safe and secure in their homes and in their community.\nI’ve listened on the doorstep to households concerned about anti-social behaviour, parents worried about their children being exposed to drugs and recently we’ve seen Buxton market targeted by vandals.\nThe Conservative record on law and order is criminal.\nThe Conservatives talk tough on crime but the reality is, after 13 years, they are missing in action in the fight against crime.\nCommunities feel under threat, while police have disappeared from our streets. Trials are delayed for years because of the biggest courts backlog on record, with a record number of criminals getting off scot-free.\nLocally, we have seen our police stations close including in New Mills and Chapel. In New Mills the hope of a Safer Neighbourhoods Team base has also been thwarted due to funding issues. This means across the length of High Peak, we only have two police stations and no custody suites.\nThere were 2074 police officers in Derbyshire under the last Labour government. By 2017 the Conservatives had cut 364 of those police officers.\nAs the next general election approaches the Conservatives have suddenly realised that their cuts to police forces are unpopular and unsafe.\nDespite this, as of September 2022, there were still 73 less police officers protecting the towns and villages in High Peak than when the Conservatives came to power.\nAnd they have cut the number of PCSOs by 15% in Derbyshire since 2010.\nThe local Conservative MP should be ashamed of his Party’s record on law and order.\nThe next Labour government will prioritise preventing crime by putting 13,000 extra neighbourhood police and PCSOs on our streets.\nWe will punish anti-social behaviour with tougher sentences for offenders and we will protect our communities with more police, more action to stop young people being drawn into crime, more prosecutions and by standing up for victims.\nA Labour government means safer homes, safer streets and safer communities.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n- likes love haha sad 29\n- Comments: 21\n- Shares: 1\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_tag_christmas/content_10.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_about-jon/content_5.html": "ABOUT\nFind out more about my work in Parliament and campaigns to help make our local area better for everyone.\nABOUT ME\nI am hugely proud to have been elected as the Labour MP for High Peak in the 2024 general election.\nI was born and bred in Derbyshire and I live here with my family in the Hope Valley.\nI was the first person in my family to go to university.\nI earnt my way from an early age and funded myself through my studies. I have worked stacking shelves in a supermarket, as a crew member for McDonalds, as a waiter in a pub, in sales selling computers, as a shop assistant in an off-licence, boxing chocolates in Thornton’s factory in Belper and as a car park attendant.\nI have worked for a charity helping vulnerable people live in warmer homes, as well as helping to implement the then Labour government’s strategy to lift people out of fuel poverty.\nBefore becoming an MP in July 2024, I was an employment lawyer and a specialist in equality and discrimination law.\nPublic service is in my DNA. My Mum was a nurse like her parents before her. My wife, brother, sister, nephew, and niece all work for the NHS today. So I heard first hand the difficulties the NHS was facing under the Conservative Government.\nI am a dad to two amazing girls and two harum-scarum puppies. My wife and I certainly have our hands full, but we wouldn’t change it for the world!\nI have been a Derby County supporter (please don’t hold it against me) since my Dad took me to my first game at the old Baseball Ground as a kid. I have followed them home and away over the years. I am a long-standing member of the Rams Trust, which is a football supporters’ cooperative that aims to increase fan engagement and to secure the long-term sustainability of the club.\nMY PLEDGES\nFor too long we have been overlooked. We pay our taxes. We deserve our fair share of investment and opportunities. As your local MP I pledge to:\nBy delivering cleaner power to permanently bring down household bills and working in partnership with local businesses to deliver more secure, better paid jobs.\nWith a local GP or dentist when you need one. More teachers in our schools and taking back control of our buses and trains.\nI will fight tooth and nail to protect it from the sewage in our rivers and the impact of the climate change.\nWith a fairer deal for shopkeepers by replacing business rates and tackling anti-social behaviour with more community police on the beat.\nAfter Partygate and fake newspapers locally, people have lost faith in politics. I’m not a career politician and will work hard to win your trust.\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_campaigns/content_15.html": "Local Government Reorganisation\nsurvey\nI am interested to know what your priorities are in terms of how local government should be restructured locally and regionally to best meet our economic and public service needs.\nDetails\nAssisted Dying Bill\nSURVEY\nI want to ask you a question about an important issue that is coming before the House of Commons on 29th November.\nDetails\nHIGH PEAK DENTAL CARE SURVEY\nSURVEY\nAre you struggling to find an NHS dentist in High Peak for you or your children? If so, please let me know.\nDetails\nTRAFFIC CALMING MEASURES\nPETITION\nIf you want something done about the speeding on Park Road and Hadfield Road, please support my campaign.\nDetails\nNHS SURVEY\nSURVEY\nI want to hear about your experiences with our local NHS services . Please fill in the survey below.\nDetails\nResidents Survey\nSURVEY\nI want to hear from residents in High Peak about the issues that are the most important to you.\nDetails\nSTOP THE DUMPING OF SEWAGE\nPETITION\nWe need to act now to save our precious rivers and waters from further harm. Please sign our petition at the link below.\nDetails\nSave High Peak’s ticket offices\nPETITION\nPlease sign this petition if you oppose the closure of High Peak’s ticket offices.\nDetails\nsave visitor centre\nSURVEY\nJoin and support our campaign to save Castleton’s visitor centre and museum by signing the petition at the link below.\nDetails\nSupport High Peak Students\nPETITION\nSupport our campaign to ensure students within the High Peak get the same travel opportunities as their fellow students in Greater Manchester.\nDetails\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_visit-to-cemex-uk-dove-holes-quarry/content_43.html": "- 04/09/2023\n- Posted by: Jon Pearce MP\n- Category: News\nReally great to visit CEMEX UK Dove Holes Quarry last week.\nCemex is such an important local employer and they have exciting plans to invest in the site and their rail freight infrastructure.\nIt was also brilliant to learn about the work they do on biodiversity, including working in partnership with RSPB to try to protect a population of Twites, a rare songbird that, without help, may disappear completely from England.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_news/content_13.html": "LATEST NEWS\nKeep updated on the latest news, campaigns and my work on behalf of voters in High Peak.\nLocal Government Reorganisation\nI am interested to know what your priorities are in terms of how local government\nChristmas Card Competition\nEarlier in the year I wrote to all of High Peak’s primary school to let\nFully costed first steps for change\nKeir Starmer has set out Labour’s five national missions to get Britain’s future back. The missions are long term, fully funded aims that will guide a Labour government’s decisions to deliver a decade of national renewal.\nVisit to Buxton Community School\nThe Q & A with sixth formers was fun with loads of very well informed and challenging questions on everything from buses, to the closure of children’s centres, and stopping the pollution of our rivers.\nCongratulations to Claire Ward & Nicolle Ndiweni\nMassive congratulations to Claire Ward for East Midlands Mayor on being elected as the first ever East Midlands Mayor and Nicolle Ndiweni as Derbyshire’s new Police and Crime Commissioner.\nHelp save our children’s centres\nDerbyshire County Council are planning to close a further ten children’s centres across the county, including Hadfield and Gamesley.\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n- likes love haha sad 29\n- Comments: 21\n- Shares: 1\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_tag_competition/content_30.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_tag_school/content_6.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_tory-government-reject-bid-to-deliver-investment-in-glossop/content_35.html": "- 19/01/2023\n- Posted by: Jon Pearce MP\n- Category: News\nI have just heard that the Tory government has rejected a bid to deliver much needed investment in Glossop. It is a hammer blow to the town and surrounding communities.\nIt lays bare the truth that, despite all the rhetoric about “levelling up”, northern towns like ours in High Peak will never be a priority for the Tories.The local Tory MP has failed to deliver on his promises for High Peak. He promised that following his lobbying efforts:\n“High Peak has been made one of the top priority areas for the Levelling Up Fund in the whole country.”\nToday we can see, despite being a government whip, he has no influence in his own party and his government has no interest in High Peak.\nThe £20 million bid would have delivered a new leisure centre and wellbeing hub on the Old Glossopdale School site on Talbot Road as well as upgrades to Victoria Hall. The proposals could have been the catalyst for further high street regeneration.\nHad the Tory government supported the bid, it would have provided a massive boost for the local economy at a time when we are facing the largest fall in living standards on record and the stagnation of our economy.\nThe wellbeing hub would also have increased access to healthcare services. This is desperately needed with so many people contacting me about the perilous state of the NHS locally.\nThe Tories have deliberately created a system of winners and losers – today Glossop and the surrounding communities are the losers.\nIt doesn’t have to be this way. The next Labour government will give local leaders the powers to drive growth and prosperity in all our towns and communities. Meaning greater prosperity for all not just the chosen few.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_category_news_page_7/content_17.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_congratulations-to-claire-ward-nicolle-ndiweni/content_26.html": "- 03/05/2024\n- Posted by: Jon Pearce MP\n- Category: News\nMassive congratulations to Claire Ward for East Midlands Mayor on being elected as the first ever East Midlands Mayor and Nicolle Ndiweni as Derbyshire’s new Police and Crime Commissioner.\nThey were both the overwhelming first choice of voters in High Peak – receiving nearly twice as many votes as the next candidates.\nI look forward to working with them both to make High Peak an even better place to live.\nHave a great bank holiday weekend all!\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_save-gamesley-community-sport-centre-update/content_41.html": "There is some good news and some bad news.\n👎 The bad news – there is still no response from Derbyshire County Council. This is utterly unacceptable. No public body should behave in this way.\nNo information. No explanation. If they would just engage with the community we might be able to find a solution. But if they keep ignoring us, time will run out and the chance to save the Community Centre will be lost.\n👍 The good news – the campaign to save the Community Centre is getting massive support. The petition has over 1,500 signatures and the crowdfunder has over £14,000 of donations.\nYou can sign the petition here: http://tinyurl.com/4whhc3yf\nAnd donate here: http://tinyurl.com/4v239vjx\nPlease do share these links.\nAnd keep supporting the campaign. Together we can do this.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n- likes love haha sad 29\n- Comments: 21\n- Shares: 1\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_holocaust-memorial-day/content_61.html": "Today we remember the 6 million Jews murdered during the Holocaust, alongside the millions of other people killed under Nazi persecution and during more recent genocides.\nEarlier I marked the day by attending a ceremonial flag raising in Glossop and tonight by lighting a candle as others are across High Peak, the UK and the world.\nOrdinary people were involved in every aspect of the holocaust – perpetrators, bystanders, rescuers, witnesses – and the victims.\nOrdinary people can stop it happening again by playing our part in challenging prejudice today.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n- likes love haha sad 29\n- Comments: 21\n- Shares: 1\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_stop-the-dumping-of-sewage/content_37.html": "- 10/01/2024\n- Posted by: Jon Pearce MP\n- Category: News\nSupport our campaign to stop the dumping of sewage in High Peak’s rivers and waters ⬇️\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_holocaust-memorial-day-2024/content_49.html": "- 26/01/2024\n- Posted by: Jon Pearce MP\n- Category: News\nI joined the ceremony in Buxton this morning to mark Holocaust Memorial Day 2024, which is tomorrow 27 January.\nHolocaust Memorial Day remembers the 6 million Jews murdered during the Holocaust, alongside the millions of people murdered under Nazi persecution of other groups and during more recent genocides in Cambodia, Rwanda, Bosnia and Darfur.\nFor generations we have promised it can never happen again. With the rise in antisemitism in the UK and globally, our generations must stand firm on that promise.\nTomorrow at 8pm I encourage everyone to light a candle and safely put it in your window to remember those who were murdered for who they were and to stand against prejudice today.\nYou can find out more here.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_assisted-dying-bill/content_54.html": "Assisted Dying Bill: I want to hear your views\nI want to ask you a question about an important issue that is coming before the House of Commons on 29th November.\nSubmit your views on Assisted Dying\nI want to ask you a question about an important issue that is coming before the House of Commons on 29th November.\nA Private Members’ Bill has been proposed to legalise Assisted Dying in certain specific cases. I know Assisted Dying is something that many people feel strongly about, on both sides of the debate. This vote won’t be whipped, so I won’t be told whether to vote for or against the Bill. It’s a conscience vote. So, I want to hear your views. Let me know your thoughts by filling in the form here.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_scrapping-of-hs2/content_38.html": "- 04/10/2023\n- Posted by: Jon Pearce MP\n- Category: News\nAny remaining pretence that Rishi and his government are interested in the North and levelling up ended today.\nDon’t take my word for it. Boris Johnson, David Cameron and even his own chancellor agree.\nThe scrapping of HS2 north of Birmingham is a colossal failure of leadership. It will leave the North with a Victorian railway for generations to come.\n£71 billion pounds wasted. People’s homes, lives and communities disrupted for nothing. This is unforgivable.\nRishi blames delays and spiralling costs. Wait until he finds out who was supposed to be overseeing those costs. First as chief secretary to the treasury, then as chancellor and now as prime minister. This failure is his failure.\nHS2 would have doubled the capacity on our rail network. That would have been a huge opportunity for our regional and local economy in High Peak. Our quarries for example desperately need more rail freight capacity, as I learnt on recent visits. Scrapping HS2 means less productivity and no reduction in the congestion on our roads.\nAnd the Tories needn’t think they can hoodwink us that they will deliver other infrastructure projects instead. No one will ever trust them again.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_petition-to-introduce-traffic-calming-measures-on-park-road-and-hadfield-road/content_28.html": "Petition to introduce traffic calming measures on Park Road and Hadfield Road\nIf you want something done about the speeding on Park Road and Hadfield Road, please support my campaign by signing my petition.\nWhen I was out on the doorstep in Hadfield recently, one issue that kept coming up again and again was the speeding on Park Road and Hadfield Road.\nI know there have been a number of crashes on the road. As recently as a few weeks ago a number of parked cars were damaged in a serious accident.\nMany residents told me they had raised concerns, but Conservative-run Derbyshire County Council had taken no action. I know many of you are worried that someone is going to get seriously injured or even killed if something isn’t done about it.\nIf you agree and want something done about the speeding on Park Road and Hadfield Road, please support my campaign by signing my petition calling on Derbyshire County Council to introduce traffic calming measures on Park Road and Hadfield Road as a matter of urgency before there is any further damage to property or someone is seriously injured.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_nhs-survey/content_32.html": "NHS SURVEY\nI want to hear about your experiences with our local NHS services . Please fill in the survey below.\nOur NHS is in crisis. So many people across High Peak have contacted me about their experiences with our local NHS services. A young family stuck in A & E for hours, a child distraught at having their operation cancelled at the last minute due to staff shortages, a lady diagnosed with cancer feeling she had choice but to pay huge private fees rather than face the anxiety of waiting for NHS treatments.\nThere are hundreds of people dying each week unnecessarily across our NHS because of the mismanagement and underfunding by this government.\nNHS Dentists are becoming as rare as hen’s teeth across our towns – with most recently dentists in New Mills and Glossop ceasing to provide NHS services forcing their patients to pay for private care. Costing families hundreds of pounds of additional costs, which many simply cannot afford during the worst crisis in living costs in living memory.\nThe NHS is part of my DNA. My Mum was a nurse like her parents before her. My wife, nephew, and niece all work for the NHS today. As a lawyer I advise in the health and social care sector. I hear first-hand the pressure the NHS is under.\nThere are not enough staff. There are not enough beds. And there is not enough social care, which results in many patients being stuck in hospital who do not need to be there.\nI want the NHS to survive and thrive. I believe in the NHS’s founding principle that it should be free at the point of access for all. The Conservatives are starting to talk about charging people to see their GP and receive care at A & E.\nI want to make the case for better healthcare services for the people of High Peak. Please help me by completing my quick survey and telling me about your experiences.\nSHARE ON SOCIAL MEDIA\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_petition-against-governments-plans-to-close-train-station-ticket-offices/content_57.html": "- 02/09/2023\n- Posted by: Jon Pearce MP\n- Category: News\nThank you to everyone who signed our petition against the Government’s plans to close the train station ticket offices in High Peak, including in Buxton, Dinting, Hadfield, New Mills and Whaley Bridge and reduced opening hours in Glossop.\nTicket office closures will affect all passengers but the elderly and disabled passengers most of all.\nPassengers and rail staff deserve better than this.\nI’ve responded to the consultation to raise my concerns on behalf of the people of High Peak and written to the Transport Secretary urging the Government to rethink. 👇\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_national-pothole-day/content_62.html": "- 15/01/2024\n- Posted by: Jon Pearce MP\n- Category: News\nThanks to 14 years of cuts to council funding by this Conservative Government and 6 years of local Conservative Councillors being asleep at the wheel, the RAC has found that Derbyshire is the worst place in the country for potholes.\nAnd don’t we know! Two burst tyres later – repairing pothole damage to my car feels like yet another cost of living increase under the Conservatives.\nI’ve reported this pothole/crater that I have to avoid on the nursery run each morning.\nYou can report any potholes in your area here:\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_kept-animals-bill/content_50.html": "- 21/06/2023\n- Posted by: Jon Pearce MP\n- Category: News\nAs many of you that have met me on your doorstep will know, I’m an animal lover, especially dogs.\nI’m passionate about animal protection and that is why I have co-signed a letter today calling on the Government to pass the Kept Animals Bill.\nThis is a vital law that would crack down on puppy smuggling, puppy farming, pet theft and live animal exports.\nFor me it is a no-brainer and I just don’t understand why the Government have scrapped it having promised it at the last election.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_category_competition/content_14.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_rishis-raw-deal/content_36.html": "The Tories have told all councils to increase your council tax by the maximum 5% – that will add £100 onto the average bill.\nRishi thinks we’re all fools – giving with one hand and taking with the other.\nEven his own East Midlands Conservative mayoral candidate, MP for Mansfield, and Leader of Nottinghamshire County Council says so\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n- likes love haha sad 29\n- Comments: 21\n- Shares: 1\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_kept-animals-bill-update/content_60.html": "- 21/06/2023\n- Posted by: Jon Pearce MP\n- Category: News\n‼️Update: the Conservatives have just voted to block the Kept Animals Bill, ditching their own law and breaking their promise to protect animals.\nThey’ve given the green light to puppy smuggling, puppy farming and pet theft.\nIf I get elected to represent High Peak at the next General Election I promise to make sure a Labour Government delivers on animal welfare.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_tag_primary/content_12.html": "Subscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe here to keep up-to-date on my local work and campaigns as your MP for High Peak.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.\nContact Details\nPrivacy Policy\nAccept\nWe use cookies to improve your overall site experience. This includes personalising content, analysing site usage, and to assist in our marketing efforts. By continuing to use our site, you accept our use of cookies and Privacy Policy.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_category_news/content_11.html": "-\nLocal Government Reorganisation\n20/12/2024 -\nChristmas Card Competition\n31/10/2024 -\nFully costed first steps for change\n16/05/2024 -\nVisit to Buxton Community School\n13/05/2024 -\nCongratulations to Claire Ward & Nicolle Ndiweni\n03/05/2024",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_bus-services-in-high-peak/content_51.html": "- 25/09/2023\n- Posted by: Jon Pearce MP\n- Category: News\nThis is the difference Labour in power can make. Greater Manchester taking control of its bus network. Bus services are going to get better and cheaper and will be accountable to local people.\nCompare and contrast this to the poor and fragmented bus service we get in High Peak. Thanks to the Tories – who have taken Derbyshire County Council to the brink of bankruptcy.\nThe next Labour government will end the Tories broken bus system.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_fully-costed-first-steps-for-change/content_2.html": "The country needs change and Labour has a plan to deliver it.\nKeir Starmer has set out Labour’s five national missions to get Britain’s future back. The missions are long term, fully funded aims that will guide a Labour government’s decisions to deliver a decade of national renewal.\nThese first steps build towards the missions by setting out how Labour would make an immediate impact to people’s lives and kickstart a real process of lasting change.\nYou can find out more here.\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\n☀️ The hottest polling day in many a year.\n🗳️ Still plenty of time to vote - polling stations are open until 10pm.\n... See MoreSee Less\n- likes love haha sad 29\n- Comments: 21\n- Shares: 1\n21 CommentsComment on Facebook\nKEEP UPDATED\nGET IN TOUCH\nI can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nI would love to hear from you about what you think my priorities should be as your MP for High Peak and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.",
  "https_www_jon4highpeak_com/https_www_jon4highpeak_com_category_news_page_4/content_22.html": "-\nAn object lesson in bad government\n21/09/2023 -\nDerbyshire County Council is facing bankruptcy\n15/09/2023 -\nVisit to CEMEX UK Dove Holes Quarry\n04/09/2023 -\nPetition Against Government’s Plans to Close Train Station Ticket Offices\n02/09/2023 -\nTackling serious and organised crime in Buxton\n25/07/2023"
}