{
  "http_michaelpayne_org_uk_/http_michaelpayne_org_uk/content_1.html": "It’s an honour to represent the community that I was born and brought up in. Together, Gedling’s community has supported one another through the toughest of times but the truth is we are being let down by Tom Randall and the Tories.\nThe only thing that Tom Randall has going for him is that he is from Gedling. But it’s not just about living here in Gedling, it is about delivering here in Gedling.\nI’ve protected over 4,500 working families in Gedling from paying any council tax, worked to set up St Mary’s Community Kitchen in Arnold to support children and families throughout the pandemic and forced Conservative-run Nottinghamshire to make tackling food poverty and child poverty a top priority.\nI am proud to be from Gedling, I will always be on the side of Gedling, and I will work hard to become your local Labour MP for Gedling.\n(St. Mary's) on Gedling Borough Council\nRe-elected as Councillor for Redhill Ward on Gedling Borough Council and secured second term of office for Labour at Gedling Borough Council\nRe-elected as Councillor for Redhill Ward on Gedling Borough Council and secured third term of office for Labour at Gedling Borough Council\nI've protected over 4,500 working families in Gedling from paying any council tax, to mitigate the Tory Cost of Living Crisis. See how much you are worse off under the tories by clicking the link.\nThe Tories want to privatise Channel 4 to shield themselves from accountability. We must stop them in their tracks. That’s why I’m supporting the Co-operative Party’s campaign to stop the privatisation of Channel 4.\nIn April 2021 I led Gedling Borough to call on the Conservative government to give our NHS heroes a pay rise that reflects their service & sacrifice. It’s time Tom Randall and the Conservatives put NHS pay right.\nI called on Gedling Council to declare a climate emergency and set a goal of becoming carbon neutral by 2030. Firefighters are on the frontline of tackling the climate emergency, that’s why I’m back the FBU’s campaign to ensure they’re at the heart of decision-making on tackling this global crisis.\nI want to see fox hunting consigned to the history books. We need to see legal loopholes closed and put a stop to fox hunting meets happening on public land. This Conservative government must ban all trail hunting now.\nConversion therapy is abhorrent and should be banned. That ban should protect trans people, just as it should protect other LGBT+ people. Boris Johnson and the Conservatives must keep their promise and ban conversion therapy in all its forms.\nAsk me a question, offer your support, and keep up to date with my campaign to be your Labour MP for Gedling."
}