{
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_saras-coach-trip-westminster/content_8.html": "I am planning to organise a coach trip to Westminster for Hyndburn & Haslingden constituents, following the success of similar trips from some of my colleagues. You will find a survey below which I ask you to complete so that I can gather information on demand.\nIt would be a round trip in one day on a coach, which would leave Hyndburn & Haslingden at 6am-7am and then depart Westminster at around 6pm.\nA very loose map of the day, which is subject to change, would look like:\n- Depart Hyndburn & Haslingden (coach pick up location tbc)\n- Stop at a service station\n- Arrive in Westminster\n- Free time (Options include a walk down Whitehall, Westminster Abbey, Parliament's cafe, watch parliamentary proceedings if they are still ongoing, from a viewing gallery)\n- Tour of Houses of Parliament begins\n- half way through, I would host a Q&A in one of Parliament's Committee Rooms, where constituents can ask me anything about my role\n- Tour continues, including on the floor of the House of Commons and viewing of the House of Lords\n- Tour ends\n- Coach back to Hyndburn & Haslingden, with a stop at a service station\n*this is subject to change depending on parliamentary business and timings\nThe tour that me and my team provide will be completely free of charge. Most of my team will be on the coach with you, and I will be on the coach back. The only cost is that of covering the price of coach hire to Westminster and back. In the survey below, I have asked for views on price, but please note this will ultimately be set by the price of coach hire, what I have included below is an estimate of the range I think the price will fall under per person.\nFinally, I am aiming to hold this tour in late June or early-mid July 2023. If all goes to plan, I will hold further trips.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_cdn-cgi_l_email-protection/content_34.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_pm-another-accrington-visit/content_20.html": "Prime Minister Rishi Sunak visited Accrington again on Monday, spending time with business leaders at Accrington Stanley's Wham Stadium, while also witnessing the work the club does in the community first hand.\nThe Prime Minister gave an assurance that nearly £20 billion, initially intended for the northern leg of HS2, will remain for the benefit of the North. This strategic shift represents a pledge to prioritise regional infrastructure, something Hyndburn MP Sara Britcliffe has long been pushing.\nRegarding the pivotal transport projects in Lancashire, such as the potential reestablishment of the Colne to Skipton railway line and the extension of the M65, the Prime Minister set out that Lancashire County Council was working on its settlement funding from the HS2 dividend and would then decide which plans to take forward.\nGiven the location of the event, the Prime Minister also assured Accrington Stanley's owner that the fan-led review of football would be implemented and the government will be creating a new independent regulator for football, supporting community clubs up and down the country.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_category_Articles/content_13.html": "WHAT MORE UK WORK WITH MPs TO GAIN A POSITIVE AMENDMENT TO NEW TAX PROPOSALS 2nd August 2021 In the UK it is estimated that five million tonnes of plastic is used every year, nearly half of which is packaging. The UK Government brought in measures to... Articles\nMP’s plans for new business champion to be taken on by council 30th July 2021 MP’s plans for new business champion to be taken on by council Businesses across Hyndburn are to get a boost thanks to local MP Sara Britcliffe. After the... Articles\nSecondary schools in Hyndburn and Haslingden to benefit from Conservative Government’s £200 million summer school programme 29th July 2021 Press Release (01254 230441) Date: 29/07/2021 • Schools in Hyndburn and Haslingden are among the 2,820 secondary schools across England that will receive... Articles",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_category_Local-News/content_11.html": "Sara Britcliffe set to abseil to raise money for local church 24th June 2024 Sara Britcliffe will be scaling new heights to raise much-needed funds for repair work at a Hyndburn church. She will be joined by the Dean of Blackburn Very... Local News\nA personal statement from Sara Britcliffe 22nd May 2024 The Prime Minister has called a General Election and it will be held on July 4, This vote is about who you want to represent our home in Parliament, and what is... Local News\n£500k funding for high street praised by Sara Britcliffe 13th May 2024 Sara Britcliffe has welcomed news of £500k worth of funding to transform a high street in Hyndburn. Blackburn Road and Church Street in Great Harwood will be... Local News\nSara Britcliffe welcomes visit of minister for health and social care Helen Whately to Royal Blackburn Hospital 10th May 2024 Sara Britcliffe and other East Lancashire MPs welcomed the minister for health and social care Helen Whately on a visit to the Royal Blackburn Hospital... Local News\nSara Britcliffe welcomes news of speed camera on dangerous road 29th April 2024 Sara Britcliffe and local Hyndburn councillors are celebrating that their campaign for a speed camera at Blackburn Road has been successful. The Hyndburn and... Local News\nSara wants your views on crime & anti-social behaviour 5th March 2024 Since the inception of Operation Centurion last year, Hyndburn has seen an extra 1,600 policing hours. That means more police on the street deterring anti... Local News\nSara Britcliffe MP Welcomes£494 Million Investment for Lancashire 26th February 2024 In a significant development for Lancashire's infrastructure, Sara Britcliffe, MP for Hyndburn and Haslingden, has expressed her support for the £494million... Local News\nPM in another Accrington visit 8th January 2024 Prime Minister Rishi Sunak visited Accrington again on Monday, spending time with business leaders at Accrington Stanley's Wham Stadium, while also witnessing... Local News\nTwo Hyndburn railway stations on longlist for investment 14th December 2023 Sara Britcliffe, Member of Parliament for Hyndburn and Haslingden, secured confirmation today that Church & Oswaldtwistle and Rishton Railway Station are both... Local News",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news/content_3.html": "Sara Britcliffe set to abseil to raise money for local church Monday, 24 June, 2024 Sara Britcliffe will be scaling new heights to raise much-needed funds for repair work at a Hyndburn church. She will be joined by the Dean of Blackburn Very Rev Peter Howell-Jones and 18 other brave people to abseil down Rishton Tower. The sponsored event is taking place on Sunday, June 30, at St Peter and St Pauls Church in Hyndburn at 12.30pm. Sara said: “This church is a landmark building in... Local News\nA personal statement from Sara Britcliffe 22nd May 2024 The Prime Minister has called a General Election and it will be held on July 4, This vote is about who you want to represent our home in Parliament, and what is... Local News\n£500k funding for high street praised by Sara Britcliffe 13th May 2024 Sara Britcliffe has welcomed news of £500k worth of funding to transform a high street in Hyndburn. Blackburn Road and Church Street in Great Harwood will be... Local News\nSara Britcliffe welcomes visit of minister for health and social care Helen Whately to Royal Blackburn Hospital 10th May 2024 Sara Britcliffe and other East Lancashire MPs welcomed the minister for health and social care Helen Whately on a visit to the Royal Blackburn Hospital... Local News\nSara Britcliffe delighted at new football regulator plan 29th April 2024 Sara Britcliffe is delighted a new regulator will be introduced as part of a ‘Football Governance Bill’, which has now had its second reading in Parliament. The... Speeches in Parliament\nSara Britcliffe welcomes news of speed camera on dangerous road 29th April 2024 Sara Britcliffe and local Hyndburn councillors are celebrating that their campaign for a speed camera at Blackburn Road has been successful. The Hyndburn and... Local News\nSara wants your views on crime & anti-social behaviour 5th March 2024 Since the inception of Operation Centurion last year, Hyndburn has seen an extra 1,600 policing hours. That means more police on the street deterring anti... Local News\nSara Britcliffe MP Welcomes£494 Million Investment for Lancashire 26th February 2024 In a significant development for Lancashire's infrastructure, Sara Britcliffe, MP for Hyndburn and Haslingden, has expressed her support for the £494million... Local News\nHyndburn MP speaks out on the Loan Charge 18th January 2024 Hyndburn and Haslingden MP Sara Britcliffe, in a recent address in the House of Commons, highlighted significant concerns regarding the handling of the Loan... Speeches in Parliament\nAction on hyperemesis gravidarum 17th January 2024 On Wednesday 17 January, the Secretary of State for Health and Social Care, Victoria Atkins, announced wholesale changes to the care of women during pregnancy... Westminster News",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_parliament/content_29.html": "Tweet Here, you can read Sara's latest speeches and appearances in Parliament (provided by theyworkforyou):\nBusiness of the House | Commons debates I, too, pay tribute to you, Madam Deputy Speaker; I am sure that you will be missed by many in this House.\nBusiness of the House | Commons debates I, too, pay tribute to you, Madam Deputy Speaker; I am sure that you will be missed by many in this House.\nWomen’s State Pension Age: Ombudsman Report | Commons debates On that point, will my hon. Friend give way?\nWomen’s State Pension Age: Ombudsman Report | Commons debates The report acknowledges that the DWP is now modernising its system so that people are informed, but does he agree that moving to a modernise\nWomen’s State Pension Age: Ombudsman Report | Commons debates On that point, will my hon. Friend give way?\nWomen’s State Pension Age: Ombudsman Report | Commons debates The report acknowledges that the DWP is now modernising its system so that people are informed, but does he agree that moving to a modernise\nWomen’s State Pension Age: Ombudsman Report | Commons debates The report acknowledges that the DWP is now modernising its system so that people are informed, but does he agree that moving to a modernise\nWomen’s State Pension Age: Ombudsman Report | Commons debates On that point, will my hon. Friend give way?\nTransport Connectivity: North-west | Transport | Commons debates We welcome the £494 million in Lancashire, as you will in Chorley, Mr Speaker.\nTransport Connectivity: North-west | Transport | Commons debates We welcome the £494 million in Lancashire, as you will in Chorley, Mr Speaker.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_ps500k-funding-high-street-praised-sara-britcliffe/content_10.html": "Sara Britcliffe has welcomed news of £500k worth of funding to transform a high street in Hyndburn.\nBlackburn Road and Church Street in Great Harwood will be getting a makeover as part of the ‘High Street Accelerator – Green Spaces’ funding from the Government.\nAmong the improvements include the removal of dilapidated planting and street furniture, the creation of new seating areas with planting and trees at several locations.\nIt is hoped the works will help to ‘design out’ anti-social behaviour and create new, pleasant, and aesthetically pleasing areas for residents to enjoy and socialise while shopping.\nSara said: “This is great news for the town, and I have always been pushing for improvements to be made in my constituency.\n“Great Harwood has already had £237,000 and this latest grant is thanks to the Great Harwood Town Panel help bid for the new £500k funding.\n“We know there have been some antisocial behaviour issues in the area and I will be excited to see the designs when they are done.\n“Hopefully this will make the high street a place where people want to come and shop.”\nLevelling Up minister Jacob Young, said: “I want to congratulate Hyndburn on getting this extra cash to support their high street in Great Harwood, alongside the £20m, we are investing into Hyndburn through the Levelling Up Fund and the wider support we are giving Great Harwood as a High Street Accelerator Pilot.\n“I know how hard Sara Britcliffe MP has working in conjunction with the council, to see Hyndburn town centres revitalised and I hope this extra funding goes some way to supporting their ambitions of Levelling Up in Lancashire.”\nThere will be landscaping improvements in front of the community building.\nAlso, there will be work with the community to introduce hanging baskets and window boxes on the high street and try to liven up the streetscape.\nArchitects will be creating sketch drawings for the works.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_what-more-uk-work-mps-gain-positive-amendment-new-tax-proposals/content_21.html": "In the UK it is estimated that five million tonnes of plastic is used every year, nearly half of which is packaging. The UK Government brought in measures to address wastage and benefit the environment, including the complete ban on 1 October 2020 of single-use plastic straws, cotton buds, and drink stirrers in England, except for exempt uses.\nWhat More UK, which is already a zero to landfill company, was prompted to develop its Upcycled range as a response to the growing amount of plastics ending up in landfill or worse, in the ocean. Wham Upcycled is an award winning range of housewares, which features all their most popular lines, as an eco-friendly range manufactured from 100% recycled & recyclable plastic.\nThe UK Government additionally plan to introduce a new Plastic Packaging Tax, on packaging containing less than 30% recycled plastic, to be paid for by the manufacturer, and starting from April 2022. Last November the draft list of products affected was released, and What More were concerned to see items on there that were very much multi use - including buckets, plastic bowls, loft storage and food storage containers.\nThe Treasury position is that the cost of £200 per tonne will apply to any ‘tax liable' plastic packaging, where 30% recycled content cannot be demonstrated. The proposed millions extra in annual taxes would have hampered What More's future investment plans, affected the livelihoods of 350 colleagues, and caused them to be less competitive both in the UK market, and their large export market which covers 75 countries.\nLocal MPs for What More's manufacturing site locations, Antony Higginbotham and Sara Britcliffe, agreed that the HMRC proposals did not match the Government objectives on reducing unnecessary single-use plastic. They sent letters of support and attended meetings and consultations with HMRC, along with fellow North West MPs, Mark Menzies, Chris Green and Mark Logan.\nThanks to these consultations and work with the trade association BHETA (British Home Enhancement Trade Association), HMRC have announced today that the draft legislation has been updated, to clarify that a number of items are outside the scope of the new tax - including toolboxes, plastic cups, shop fittings and many others. 3 categories of products from the meaning of a ‘plastic packaging component' have been removed. HMRC agreed such products do not typically contribute to plastic pollution.\nCompany Director Tony Grimshaw OBE, commented: \"What More have a focus on recycling and reusing materials and we are proud of our credentials. 10,000 tonnes of plastic used in our manufacturing processes is fully recycled already. I'm very grateful to the five MPs and our trade association BHETA for understanding our position and working hard to ensure that HMRC appreciate that our industry is part of the solution, and not the cause.\nNone of What More's products will now be subject to this tax. I'm delighted with the amendments to the draft legislation, and this means we can continue to invest in our colleagues and expansion plans.\"\nWhat More UK manufactures storage boxes and housewares of all kinds including bakeware, around-the-sink items, products for the home laundry, utility room, and items for the garden such as planters and troughs. What More's products are all made in East Lancashire and are sold in 76 countries around the world. More can be seen on their website here: www.whatmoreuk.com\nYou can read more about the proposed Plastic Packaging Tax here:https://www.gov.uk/government/publications/introduction-of-plastic-packaging-tax-from-april-2022",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk/content_1.html": "About Sara News archive Sara Britcliffe set to abseil to raise money for local church Sara Britcliffe will be scaling new heights to raise much-needed funds for… A personal statement from Sara Britcliffe The Prime Minister has called a General Election and it will be held on… £500k funding for high street praised by Sara Britcliffe Sara Britcliffe has welcomed news of £500k worth of funding to transform a high… My map\nSara Britcliffe set to abseil to raise money for local church Sara Britcliffe will be scaling new heights to raise much-needed funds for…\nA personal statement from Sara Britcliffe The Prime Minister has called a General Election and it will be held on…\n£500k funding for high street praised by Sara Britcliffe Sara Britcliffe has welcomed news of £500k worth of funding to transform a high…",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-backs-tough-plan-stop-sewage-overflows/content_27.html": "Sara Britcliffe MP has this week backed the next stage of the government’s plan to tackle sewage pollution by further strengthening legal requirements.\nIn August 2022 the government set out its plan which requires the largest infrastructure programme in water company history to tackle sewage overflows. The 60 page plan prioritises investments in priority sites including protected habitats and bathing waters. Since then £1.6 billion investment has been brought forward to speed up vital water infrastructure projects, cutting thousands of overflow spills each year.\nJust last month, United Utilities, who cover the North West, announced their largest ever environmental improvement programme, bringing forward over £900m of investment to reduce the impact of storm overflows and improve river water quality.\nMinisters also reconfirmed that they will be unleashing unlimited penalties so that polluters pay for their impact on the environment, with funds now being reinvested into rivers and water bodies. This weeks' next step will place the target in the Sewage Overflow Reduction Plan on a statutory footing.\nSecretary of State Therese Coffey MP said:\nIt was a Conservative government that introduced 100 per cent monitoring of storm overflows. We’ve brought forward stronger regulations, tougher enforcement, and the largest water infrastructure programme in history – an expected £56 billion investment – and we will make fines unlimited so that the polluter always pays.\nThe Environment Secretary has written to water companies requiring a plan on every overflow on her desk by the end of June. This builds on work to introduce mandatory monitoring, which is up from just 7% in 2010 to 100% by the end of this year. Thanks to this monitoring, regulators are undertaking the largest investigation into water companies in their history related to illegal sewage dumping, building on record fines of £141m secured since 2015.\nSara Britcliffe MP said:\nHyndburn residents are rightly disgusted by sewage in our rivers, and so am I. I’ve been clear – I will always hold water companies to account where they fall foul of expectations.\nMeanwhile the Labour Party voted against the measures, and then abstained on their own motion.\nSara Britcliffe MP said:\nThis is yet another political gimmick from the Labour Party. We deal in action; they shout from the side lines.\nI voted for the Government to set a target, in law, for the reduction of sewage discharges, to provide for financial penalties in relation to sewage discharges and breaches of monitoring requirements, and to carry out an impact assessment of sewage discharges.\nThe measures will now be brought forward in a deliverable and cost effective way for taxpayers.\nSadly Labour voted against, instead proposing a measure that would have seen your water bills triple over the next decade.\nI'll always hold water companies to account, and ensure the polluter pays, not the hardworking people of Hyndburn & Haslingden.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-wants-your-views-crime-anti-social-behaviour/content_6.html": "Since the inception of Operation Centurion last year, Hyndburn has seen an extra 1,600 policing hours. That means more police on the street deterring anti-social behaviour. There have also been an extra 400 arrests due to Op Centurion, ensuring that criminals are off our streets. The new initiative is making our home safer.\nHyndburn MP Sara Britcliffe has been working with Lancashire Police and Crime Commissioner, Andrew Snowden, to ensure local shops and bars have radios to communicate with the police about illegal and anti-social behaviour. The MP has also been working with local organisations to ensure they are better protected against those who seek to inflict needless damage on property, which impacts both individuals and community groups.\nThe MP wants to see residents views about crime, so that they can feed into work going on locally. There is a survey below.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-britcliffe-mp-welcomesps494-million-investment-lancashire/content_31.html": "In a significant development for Lancashire's infrastructure, Sara Britcliffe, MP for Hyndburn and Haslingden, has expressed her support for the £494million investment allocated to Lancashire announced today. This funding, part of the government's comprehensive plan to enhance regional connectivity and transport, marks a pivotal moment for local projects, including the much-anticipated options engineering/feasibility study at the Hare and Hounds Junction.\nThe investment underscores the government's commitment to \"Levelling Up\" the North and provides a solid foundation for addressing key infrastructure challenges in Lancashire. For the Hare and Hounds Junction, Ms Britcliffe is now seeking financial backing towards initiating a study aimed at identifying potential solutions to congestion problems.\nThe MP has written to Lancashire County Council and central government in recent months seeking support for the project, which she first officially raised with the council back in August 2022.\nA survey below allows constituents to share their views on the project.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_map-locations/content_5.html": "Skip to main content\nSara\nBritcliffe\nMain navigation\nAbout Sara\nNews\nIn Parliament\nContact\nSara\nBritcliffe\nMy map",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-urges-bbc-reconsider-scrapping-radio-football-results/content_18.html": "Sara Britcliffe MP has written to the chairman of the BBC, urging them to reconsider the decision to scrap the reading of classified football results.\nThe BBC are scrapping their Saturday Radio 5 classified results segment to make way for Premier League coverage. Many fans will still listen, or have fond memories of listening to this over the years on their way back from games.\nSara has written to the BBC to remind them that not all fans are Premier League fans, that the classified football results are a cherished tradition, and that it is wrong to assume everyone can check the results on a smartphone.\nThe results have been scrapped so the BBC can cover the 5:30pm Premier League fixture, and Sara, representing an area made up primarily of English Football League fans covering Accrington Stanley, Blackburn Rovers and Burnley FC, reminds the BBC that they are a public service broadcaster.\nFull details can be found on the Lancashire Telegraph here.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_personal-statement-sara-britcliffe/content_4.html": "The Prime Minister has called a General Election and it will be held on July 4,\nThis vote is about who you want to represent our home in Parliament, and what is best for Hyndburn & Haslingden.\nI am so proud of how, by working with you, we are seeing positive changes across the constituency and I am proud of my team for all the work they have done to help people across our home.\nOver the next few weeks, I hope to meet as many of you as possible on the doorstep and at events around the constituency.\nMore information will follow on arrangements for my office and anyone with outstanding casework shortly.\nI want to say thank you. Thank you for firstly putting your faith in me in 2019 to represent you, and for the support you have shown me over the past four years.\nChange doesn't happen overnight but we are making progress.\nI can only hope that I have proven to you all my absolute dedication over the past four years.\nTruly, thank you\nSara Britcliffe\nParliamentary Candidate for Hyndburn and Haslingden",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_privacy/content_16.html": "This document outlines how Sara Britcliffe processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Sara Britcliffe\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Sara Britcliffe.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Sara Britcliffe, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Sara Britcliffe via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-britcliffe-welcomes-visit-minister-health-and-social-care-helen-whately-royal-blackburn/content_12.html": "Sara Britcliffe and other East Lancashire MPs welcomed the minister for health and social care Helen Whately on a visit to the Royal Blackburn Hospital yesterday.\nHelen Whately spent more than an hour walking around the A&E ward and other departments chatting with hospital officials and staff.\nShe also met with the Hyndburn and Haslingden MP Sara Britcliffe, Burnley MP Antony Higginbotham and Blackburn MP Kate Hollern to talk about issues at the hospital.\nSara, said: “We know, from speaking to residents, there have been some issues at Royal Blackburn Hospital.\n“I have been working with fellow colleagues such as Antony Higginbotham trying to address our constituents’ concerns both locally and nationally.\n“Today, we got to see the brilliant staff here at the hospital and the work they do on a day-to-day basis to help our residents.\n“We will continue to lobby for action and work together to reduce waiting times and get better care for our constituents.”\nAntony added: “Today’s visit coming on the back of a letter from me, Sara Britcliffe, and other East Lancashire MPs, was an important opportunity to show the minister the good work being done at the Royal Blackburn Hospital, but also to talk through some of the challenges and solutions.\n“Pressure in the emergency department is still too high and finding solutions to that must include greater use of both Burnley General and Accrington Victoria Hospitals.\n“We’ll be following the visit up with a roundtable including the NHS, Government, MPs, and others to keep up the momentum and see the improvements needed.”\nHelen Whately, said: “It was really helpful to see the hospital and also see the hard work going on in the Emergency departments but also the way the hospital works with other parts of the health service to help patients cleared through the system.”",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_leadership-election/content_28.html": "Next week there will be a leadership election for the next Leader of the Conservative Party and next Prime Minister. As each candidate must get 100 votes to be on the ballot, there can only be three candidates. I have included the three candidates most discussed in the survey.\nPlease let me know your views.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-comments-we-must-reduce-illegal-immigration/content_22.html": "When out in Hyndburn and Haslingden, I often hear concerns about illegal immigration, specifically the high number of people entering the UK across the Channel. This is not an issue of hostility but a legitimate worry about the volume of migration, especially through unsafe and illegal routes. In the year ending June 2023, 85% of those arriving by irregular routes did so via small boats - that is unsustainable.\nThe government's response, encapsulated in the Safety of Rwanda (Asylum and Immigration) Bill last week, aims to deter and prevent unlawful migration. The Bill, seeks to expedite the removal of illegal migrants to Rwanda. This is part of the UK-Rwanda Migration and Economic Development Partnership (MEDP), a treaty that ensures relocated individuals will be granted asylum or permanent residence in Rwanda. The UK Government has committed to funding the processing of these cases and providing a five-year integration package for those granted asylum.\nDespite challenges, the government is proceeding with the policy. We need to do more as a country in deterring dangerous and illegal journeys to the UK and disrupting the business model of people smugglers. The new treaty commits Rwanda to process individual asylum cases in line with international standards, including the 1951 Refugee Convention and international human rights law.\nIn summary, the government is taking firm steps to address the immigration issue by focusing on ensuring the UK remains a welcoming place while maintaining sustainable immigration levels.\nThis Bill will be coming back to Parliament in January/February, and I would be grateful for the views of my constituents, who can fill out a survey below.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_cookies/content_26.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_accessibility/content_2.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_category_Westminster-News/content_17.html": "Action on hyperemesis gravidarum 17th January 2024 On Wednesday 17 January, the Secretary of State for Health and Social Care, Victoria Atkins, announced wholesale changes to the care of women during pregnancy... Westminster News\nSara comments: We must reduce illegal immigration 18th December 2023 When out in Hyndburn and Haslingden, I often hear concerns about illegal immigration, specifically the high number of people entering the UK across the Channel... Westminster News\nReal Lancashire Cry sounds in Westminster 27th November 2023 To mark Lancashire Day, 27 November 2023, Great Harwood Town Crier Rawden Kerr was invited to a reception, celebrating Lancashire, in the Speakers House at the... Westminster News\nSara welcomes 40 constituents to Parliament 10th July 2023 Sara Britcliffe, Member of Parliament for Hyndburn and Haslingden, welcomed 40 of her Hyndburn & Haslingden constituents to parliament on Friday 7 July for a... Westminster News\nSara votes to protect free access to cash 27th June 2023 Last night, Sara Britcliffe, Member of Parliament for Hyndburn and Haslingden, voted for the Government’s plans to ensure free access to cash for millions of... Westminster News\nSara backs tough plan to stop sewage overflows 25th April 2023 Sara Britcliffe MP has this week backed the next stage of the government’s plan to tackle sewage pollution by further strengthening legal requirements. In... Westminster News\nSara Britcliffe MP secures confirmation on Church & Oswaldtwistle and Rishton Railway Stations 20th April 2023 On Thursday 20 March, Sara Britcliffe, the Member of Parliament for Hyndburn and Haslingden, spoke in Department for Transport questions and raised the need for... Westminster News\nSara campaigns for confirmation of Levelling Up bids 9th January 2023 On Parliament’s first day back after Christmas recess Sara Britcliffe, Member of Parliament for Hyndburn and Haslingden, pushed the Government on announcing... Westminster News\nLeadership Election 21st October 2022 Next week there will be a leadership election for the next Leader of the Conservative Party and next Prime Minister. As each candidate must get 100 votes to be... Westminster News",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-britcliffe-delighted-new-football-regulator-plan/content_9.html": "Sara Britcliffe is delighted a new regulator will be introduced as part of a ‘Football Governance Bill’, which has now had its second reading in Parliament.\nThe Hyndburn and Haslingden MP has been campaigning for more than two years about the ‘financial disparities’ in the football pyramid over the decades.\nSara spoke in Parliament last week, at the second reading of the bill, and talked about how she had been working with officials from Accrington Stanley about issues they face.\nSpeaking after it was given the green light in Parliament, she said: “Football clubs are part of our heritage and play a big part in our lives offering a release of so many emotions for people up and down the country.\n“I am lucky to represent a great club in my constituency – Accrington Stanley. It is run by local people and is at the heart of the community.\n“Stanley was one of the 12 founding members of the football league but in 1962 they had to resign from the Football League and went into liquidation in 1966.\n“It was not common back then, but we are seeing it happen with many of our clubs going into administration such as Bury FC and we don’t want to lose all those prized home grounds, memories, and great times.\n“Since I was elected, I have been chatting to Andy Holt and other officials from Accrington Stanley and I want to thank them for supporting me on this.\n“Andy has said that we need to protect clubs lower down the leagues.\n“We need not only to give them a level playing field but to provide them with the space to invest in their communities, whether through investment in facilities or working with children and young people.\n“We have to be proud of football in England but we have seen issues such as poor governance, lacklustre industry self-regulation and poor incentives leaving some clubs in danger of financial failure.\n“Hopefully, this regulator will go some way to improving things.”\nThe new football regulator will implement a new licensing system to give fans a greater say in the administration of clubs.\nSara believes establishing an independent regulator is ‘long overdue’ as EFL clubs operate on massive losses collectively losing £471m during the 2022-23 season alone.\nShe added: “We must also address the need for fair distribution of revenues.\n“As it stands, the financial gulf between the Premier League and the EFL has become a chasm.\n“Reforms in revenue sharing and financial regulations are necessary to prevent smaller clubs from financial catastrophe when they fall from the Premier League or attempt to compete without adequate support.”",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_category_Speeches/content_15.html": "Sara Britcliffe MP raises telecoms installations in Hyndburn & Haslingden 16th March 2023 Yesterday, Hyndburn & Haslingden MP Sara Britcliffe spoke in Parliament about the need to combat the practice of telecommunications companies installing... Speeches",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_about-rss/content_32.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-welcomes-40-constituents-parliament/content_23.html": "Sara Britcliffe, Member of Parliament for Hyndburn and Haslingden, welcomed 40 of her Hyndburn & Haslingden constituents to parliament on Friday 7 July for a tour and a question & answer session.\nIt was an early start at Accrington Stanley’s Wham Stadium for Hyndburn MPs constituents, with the coach departing at 6:30am for Westminster. Due to some heavy traffic on route they arrived in London just before 1pm, from when constituents were able to enjoy two hours of free time, taking in attractions like St James’ Park, 10 Downing Street, Buckingham Palace and Westminster Abbey.\nThe tour started at 3pm, when the 40 constituents were split into groups and appraised of the history of Parliament’s Central Lobby, St Stephen’s Hall and Westminster Hall. Ms Britcliffe then held a one-hour Q&A in parliament’s Grand Committee Room, with guests sitting in the seats of MPs of years gone by.\nAfter the Q&A guests returned to their groups so that they could be taken onto the floor of both the House of Commons and House of Lords, as well as the Commons Member’s Lobby and No Lobby and the Lords Prince’s Chamber, Royal Gallery and King’s Robing Room.\nBefore departing at 6:30pm, there was plenty of time for photos on Parliament’s terrace and in Westminster Hall.\nIn a show of community spirit, Accrington Stanley allowed guests to park for free while the coach was provided by Oswaldtwistle company Moving People, who provided two drivers as well as free water, tea, coffee, and biscuits.\nThe trip was £37 per person and covered the cost of the coach only, with the tour being free.\nSara Britcliffe MP said:\nIt was fantastic to bring so many people from Hyndburn and Haslingden down to Westminster for a memorable day and show them how our democracy operates and tell the story of its history.\nIt was a real team effort, and all constituents were fantastic. It took a lot of organisation but it was worth it and I will be looking to do it again.\nSpecial thanks must go to Moving People, a Hyndburn company who provided us two brilliant drivers alongside refreshments for everyone, and also Accrington Stanley who allowed 40 constituents to use their car park for free.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_next-prime-minister/content_30.html": "Tweet Friday, 8 July, 2022 Opinions Please find my survey below and let me know your thoughts on who the next Prime Minister should be. The Next Prime Minister Current The Next Prime Minister Making this survey representative Your details Leave this field blank Who do you think should be the next Prime Minister? Thinking about your chosen candidate, why do you think they should be Prime Minister?\nSara Britcliffe set to abseil to raise money for local church Monday, 24 June, 2024 Sara Britcliffe will be scaling new heights to raise much-needed funds for repair work at a Hyndburn church. She will be joined by the Dean of Blackburn Very Rev Peter Howell-Jones and 18 other brave people to abseil down Rishton Tower.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_contact/content_25.html": "Skip to main content\nSara\nBritcliffe\nMain navigation\nAbout Sara\nNews\nIn Parliament\nContact\nSara\nBritcliffe\nContact\nLeave this field blank\n[email protected]\nSara on Facebook\nSara on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by Sara Britcliffe on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_hyndburn-mp-speaks-out-loan-charge/content_19.html": "Hyndburn and Haslingden MP Sara Britcliffe, in a recent address in the House of Commons, highlighted significant concerns regarding the handling of the Loan Charge by HMRC. The MP's speech drew attention to the plight of constituents and others across the country, adversely affected by the retrospective tax measures implemented by HMRC through the Loan Charge.\nThe MP stressed that tax laws should be transparent and accessible, citing cases where individuals were unaware of the implications of their payment arrangements due to the lack of clarity in the law. Concerns were also raised about HMRC’s approach to dispute resolution and customer service, with examples of constituents facing sudden and significant financial demands.\nThe MP called for a shift in focus, urging HMRC to pursue those who profited from promoting and operating these schemes, rather than targeting individual taxpayers. Highlighting the importance of fairness and transparency, the MP emphasised the need to protect ordinary workers from abuses of power and to ensure public trust in the tax system.\nThe MP concluded by advocating for a fair resolution to this issue, upholding the rule of law and constraining excesses of power that impact the lives of individuals.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_sara-britcliffe-set-abseil-raise-money-local-church/content_24.html": "Sara Britcliffe will be scaling new heights to raise much-needed funds for repair work at a Hyndburn church.\nShe will be joined by the Dean of Blackburn Very Rev Peter Howell-Jones and 18 other brave people to abseil down Rishton Tower.\nThe sponsored event is taking place on Sunday, June 30, at St Peter and St Pauls Church in Hyndburn at 12.30pm.\nSara said: “This church is a landmark building in the history of the area.\n“The tower is badly in need of repointing to stop water getting into the building.\n“The water has already caused significant damage to the stones and rotted through the wooden floors.\n“It is a real shame to see this damage to a wonderful building which has been part of the community.\n“It will be great to have comfort in numbers with a group of people climbing down the church to raise money for such a good cause.\n“I wanted to try to help save a part of our past.”\nCurrently the appeal has raised £1,006 of the £7,500 target.\nOn their Crowdfunder, it states that the money is for the tower, which is 'badly in need of repointing to stop water getting in to the building'.\n\"All money raised will help pay for the repairs to the tower to secure it for generations to come. Please sponsor them!\"\nCurrently, the page has raised £135 out of their £7,500 target from 10 supporters, with 45 days left.\nIf you would like to donate to the cause, click here",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_next-prime-minister-0/content_14.html": "The list of potential candidates for the next Prime Minister has been whittled down to a final five. I want to know who people in Hyndburn & Haslingden think should be the next leader of the country.\nPlease answer my survey below.\nThe list of potential candidates for the next Prime Minister has been whittled down to a final five. I want to know who people in Hyndburn & Haslingden think should be the next leader of the country.\nPlease answer my survey below.",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_category_Opinions/content_7.html": "Sara's coach trip to Westminster 11th May 2023 I am planning to organise a coach trip to Westminster for Hyndburn & Haslingden constituents, following the success of similar trips from some of my colleagues... Opinions\nSara urges BBC to reconsider scrapping of radio football results 9th August 2022 Sara Britcliffe MP has written to the chairman of the BBC, urging them to reconsider the decision to scrap the reading of classified football results. The BBC... Opinions\nThe Next Prime Minister 16th July 2022 The list of potential candidates for the next Prime Minister has been whittled down to a final five. I want to know who people in Hyndburn & Haslingden think... Opinions\nThe Next Prime Minister 8th July 2022 Please find my survey below and let me know your thoughts on who the next Prime Minister should be. Opinions",
  "https_www_sarabritcliffe_org_uk_/https_www_sarabritcliffe_org_uk_news_two-hyndburn-railway-stations-longlist-investment/content_33.html": "Sara Britcliffe, Member of Parliament for Hyndburn and Haslingden, secured confirmation today that Church & Oswaldtwistle and Rishton Railway Station are both on the longlist for investment through the Government's Access for All Scheme.\nThe scheme improves the accessibility of railway stations, meaning there is an alternative to stair access. Accrington Railway Station has already received this investment."
}