{
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_news_category_Local-News/content_8.html": "Sidcup Banking Hub opens in temporary home 14th March 2025 Old Bexley and Sidcup MP Louie French welcomed the opening of the Sidcup Banking Hub today. It will temporarily be housed in the parish rooms and offices at St... Local News\nLouie French MP objects to building energy facilities on green belt 21st February 2025 Old Bexley and Sidcup MP Louie French has today warned that plans for two energy storage facilities in Bexley Village and North Cray were \"unsafe, inappropriate... Local News\nLouie French MP on ITV London's Late Debate 13th February 2025 Old Bexley and Sidcup MP Louie French on ITV London's Late Debate on Thursday, 13 February 2024. He spoke about why the Labour's Schools Bill threatens... Local News\nLouie French MP opens Beths Grammar School's new sixth form building 12th February 2025 Old Bexley and Sidcup MP Louie French today opened Beths Grammar School's new sixth-form building, cutting the ribbon at a ceremony with teachers, parents... Local News\nLouie French MP urges Sadiq Khan to take car theft seriously 11th February 2025 Old Bexley and Sidcup MP Louie French has urged the London mayor to prioritise tackling vehicle theft after new figures revealed that criminals were caught in... Local News\nLouie French MP: Investigate unfair fines during A20 road works 28th January 2025 Old Bexley and Sidcup MP Louie French today demanded that the Mayor of London and Transport for London address the wrongful fines handed to hundreds of drivers... Local News\nLouie French MP fights Labour's unfair Blackwall Tunnel toll 10th January 2025 Louie French MP warned some Londoners would face driving charges of up to £40 a day after Sadiq Khan announced he would impose a toll on the Blackwall Tunnel on... Local News\nLouie French MP welcomes return of Southeastern loop service 14th December 2024 Old Bexley and Sidcup MP Louie French has today welcomed the return of Southeastern's loop services at peak times, connecting the Sidcup and Woolwich lines... Local News\nLatest column: Winter Fuel Payments 27th November 2024 Louie French MP's latest column in the News Shopper. As we near the end of November, people's minds are fast turning toward Christmas, and festive cheer is... Local News",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_campaigns_small-business-survey/content_2.html": "Old Bexley, Sidcup, and Welling are home to more than 3,600 small businesses and traders, employing thousands of people locally. However, they face significant challenges, from soaring shoplifting to rising employers' national insurance costs, which threaten our local economy.\nLouie French MP has launched a survey of small businesses and traders to understand their priorities and challenges. The survey results will inform his work in Parliament and local campaigns, including tackling neighbourhood crime, supporting our high streets and fighting Labour's taxes on businesses.\nIf you are a trader or own a small business employing fewer than 50 people, complete the survey today and have your say on the national policies and local issues impacting you.",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_newsletter/content_11.html": "Skip to main content\nMain navigation\nHome\nAbout Louie French\nNews\nMy Plan\nCampaigns\nContact\nNewsletter\nNewsletter\nTweet\nSign up to Louie French's Newsletter",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_accessibility/content_5.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_cdn-cgi_l_email-protection/content_12.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_news_latest-column-protecting-face-face-banking-locally/content_4.html": "Louie French MP's latest column in the News Shopper.\nCash is king, as the old saying goes. But it rings hollow today. Banking mostly happens online or through mobile apps. Card transactions and contactless payment have replaced cash and coins for younger generations. While some find this convenient and feel greater control over their finances, a significant group does not. That's why, as your local MP, I've led a local campaign to 'back our cash' for a few years.\nThe move away from cash is a national trend. Some businesses now refuse cash, whilst banks are closing local branches because many people no longer use them. Online help portals and technology are also increasingly replacing customer support services provided by human beings. But while some people find this more convenient, it's locking others out of the services they rely on.\nMany older and vulnerable people locally find it increasingly difficult to access cash, make payments, control their finances, and get advice. Small businesses can't easily access change-giving services, and even if you are confident online and digitally savvy, everyone has that moment of frustration when the computer says no and we desperately want to talk to a real person.\nThat's why I am delighted that the Sidcup Banking Hub opened in its temporary home last week in the parish offices and rooms at St. John's Church. This new service will secure the future of face-to-face banking in the town centre. Residents and businesses can make withdrawals and deposits, access change-giving services, and privately speak to a community banker. It's open from 9 am to 5 pm, Monday to Friday, for everyone, regardless of which high street bank you use.\nIn recent years, Sidcup has lost NatWest, Halifax, HSBC, and Barclays. While local Santander and Lloyds branches hang on, uncertainty hangs over them. Welling lost its last two banks after Barclays and Santander closed their high street branches before its banking hub opened almost two years ago. While rolling back the national trend against cash is near-impossible, these two banking hubs will protect local banking services in Bexley's second and third largest town centres.\nThank you to everyone who joined my campaign to open the Sidcup Banking Hub. We learned from our local campaign to secure one of the country's first banking hubs in Welling, and I'm delighted that we managed to secure a second in Sidcup. It was a real community campaign and wouldn't have been possible without the support of Sidcup Partners, local businesses, residents, and councillors. I would also like to thank St John's Church for providing its temporary home until the permanent Sidcup Banking Hub is ready to open on the high street.\nI look forward to working with Cash Access UK to secure the Sidcup Banking Hub's permanent home as soon as possible. Until then, I encourage all residents and businesses to pop by, learn more about the hub and use the new service in its temporary location at St John's Church.",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_campaigns_bexley-village-superloop-campaign/content_7.html": "Louie French MP, Thomas Turrell AM and St. Mary's and St. James Ward councillors Kurtis Christoforides and Cameron Smith have launched a petition calling for the Superloop to stop at Bexley Village War Memorial.\nThe SL3 express bus service between Thamesmead and Bromley currently stops at Chislehurst, Queen Mary's Hospital, Sidcup, Bexleyheath, and the Elizabeth Line at Abbey Wood. But despite passing by Bexley Village, it doesn't stop.\nTransport for London's preferred route is along Penhill Road, adding traffic to the already heavily congested road and delaying the bus service. However, due to an issue at the Arbuthnot Lane junction near the Anchor, it currently travels southbound via Bexley Village.\nWe believe the route should change to permanently travel via Bexley Village with a stop at the War Memorial, bringing the Superloop to the Village and avoiding the congestion at Penhill Road - without delaying the service.\nChanging the route would make it easier for people living in Bexley Village to access Queen Mary's Hospital, the Elizabeth Line, and nearby town centres by bus. It could also bring more visitors to the area and support our fantastic local independent shops, cafes, and pubs.\nWe have already raised the proposal with Transport for London but are launching this petition to prove to TFL there is demand for a Superloop stop in Bexley Village in the next step of our campaign.\nIf you live, visit or work in Bexley Village and would use the Superloop, please sign our petition below.\nThank you!",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_contact/content_6.html": "Skip to main content\nMain navigation\nHome\nAbout Louie French\nNews\nMy Plan\nCampaigns\nContact\nNewsletter\nContact\nLeave this field blank\nLouie French\n19 Station Road, Sidcup, DA15 7EB\n020 7219 5446\n[email protected]\nLouie French on Facebook\nLouie French on Twitter\nLouie French on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by Louie French on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_news_latest-column-labour-tax-hikes-hurting-bexley-charities/content_9.html": "Louie French MP's latest column in the News Shopper.\nBexley's local charities are bearing the brunt of the Labour government's £25 billion national insurance tax hike.\nStarting this month, every employer - whether a small or large firm, for-profit or charity - will have to pay £800 on average more in tax for every person they employ.\nBusinesses have been bracing for impact. Some tell me they'll make redundancies. More will limit staff pay raises and cut other costs. Others will increase prices. A few have delayed growth plans. Most say it'll be a mixture of all of these levers. But it's even harder for charities. Costs are increasing, and more and more vulnerable people are seeking help.\nSome charities locally receive most of their money from contracts with public bodies, like Bexley Council or the NHS. However, renegotiating these contracts is challenging, and the government hasn't given local authorities or health bodies the funds to pay out more.\nFor example, Bexley Council received a one-off £1.6 million to cover the national insurance increase of the staff it directly employs, but not its contractors. The total cost of Labour's Jobs Tax to Bexley Council could be up to £5 million, not a figure any local authority can easily find.\nOther charities rely on donations. Shockingly, 45p will go on tax for every pound donated thanks to Labour's hike. But with less than a year's notice, it's near-impossible for a charity to raise a few hundred thousand pounds more to pay Labour's tax bill. And yes, for some charities, the cost is as high as that. It's simply eye-watering.\nCharities are left with a dilemma. Fundraise and renegotiate contracts not to provide more or better services but to pay tax. Make cuts and redundancies when more and more people need charitable thanks to Labour's heartless decision to axe winter fuel payments for millions.\nThat's why I voted to exempt charities from Labour's tax raid. But shamefully, Labour MPs voted down our proposal despite the impact it will have on every charity, from those providing mental health support to children's hospices. It's cruel and short-sighted.\nAs the Member of Parliament for Old Bexley and Sidcup, I regularly meet, listen and support local charities that do much for our community. In my role as the Conservative Shadow Minister for Sports, Gambling and Civil Society, much of my time at Westminster is devoted to working with national charities to hold the Labour government to account.\nSo, I know the damage Labour's Job Tax is doing nationwide, but more importantly, here in Bexley. Recently, I attended a meeting organised by the Bexley Voluntary Sector Forum with many of the charities operating locally. Charity after charity warned winter fuel payment and welfare cuts mean more vulnerable people are asking for support right when Labour's tax rises start to bite charities.\nThe Labour government needs to start listening to them. I'll do everything I can in Parliament to oppose Labour's tax rises and urge ministers to think again. But, in the meantime, Bexley needs to back its local charities, whether by donating or community fundraising — and we can all play our part in that effort.",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk/content_1.html": "Latest column: Labour tax hikes hurting Bexley charities 16th April 2025 Read full article Campaigns Small Business Survey Old Bexley, Sidcup, and Welling are home to more than 3,600 small businesses… Bexley Village Superloop Campaign Louie French MP, Thomas Turrell AM and St. Mary's and St. James Ward… Securing great healthcare for all residents My promise to deliver more services for our local hospital has remained my… Latest column: Protecting face-to-face banking locally 19th March 2025 Read full article Find me on Twitter Sidcup Banking Hub opens in temporary home 14th March 2025 Read full article Am I your MP? Enter your postcode Postcode\nBexley Village Superloop Campaign Louie French MP, Thomas Turrell AM and St. Mary's and St. James Ward…\nSecuring great healthcare for all residents My promise to deliver more services for our local hospital has remained my…",
  "https_www_louiefrench_org_uk_/https_www_louiefrench_org_uk_about-louie-french/content_10.html": "Louie French, the local champion for Old Bexley and Sidcup.\nIt is the greatest honour of my life to have been elected as the first \"homegrown\" MP for our wonderful area and re-elected in July 2024 to deliver even more for local residents.\nI was educated and raised in Welling and Sidcup before becoming the first person in my family to study at university. I am proud to serve and give back to my local area, but I am not a career politician. My professional background is in financial services, working in the City of London, where I previously specialised in sustainable investment and research. I promised to stand down from my City career if elected, and I did so straight away.\nI have a track record of working tirelessly on issues that impact our local area. These include campaigning for better public transport and against cuts to local services, lobbying for step-free access at local train stations, supporting the police, volunteering in the community, and opposing overdevelopment issues linked to Sadiq Khan’s London Plan.\nMy major achievements in recent years include the regeneration of The Green in Falconwood; supporting local businesses, pubs and sports clubs across Bexley during Covid by launching a special grant scheme; helping Bexley become the number one borough for apprenticeships; delivering a new library and cinema for Sidcup; protecting our greenbelt from overdevelopment.\nOutside of politics, I enjoy cycling and walking around our local green spaces. I have also supported several local charities in recent years, including Demelza, Crossroads Care, and the Greenwich and Bexley Hospice. I volunteer in the community most weeks and previously served as a school governor in Welling."
}