{
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_about-us/content_4.html": "ABOUT\nFind out more about my work, campaigns and how to help make our local area better for everyone.\nABOUT ME\nI delivered my Maiden Speech in Parliament in September 2024 as the new MP for Bexleyheath and Crayford.\nIt was only right to start by paying tribute to my predecessor Sir David Evennett, who served as the MP since 2005, and before that as MP for Erith and Crayford 1983-1997.\nI’m proud to have spent my whole life living in our borough. I’ve devoted 20 years to local public service as a councillor representing Belvedere. I’ve held many roles in my time on the council including four years as Leader of the Opposition. I served as Cabinet Member for Transport under the last Labour administration from 2003-06 where I worked with trade unions to save direct Bexleyheath to Victoria train services, delivered road safety improvements, and ensured the Elizabeth Line came south of the river to Abbey Wood.\nI joined the Labour Party thirty years ago committed to building investment in public services and an economy that delivers for working people. I saw the difference the last Labour Government made to our public services and have watched in despair at how the Conservatives have crashed the economy and decimated our public services.\nIt is a privilege to have been elected as the Labour MP for Bexleyheath and Crayford in July 2024 as part of the new Labour Government. It’s an opportunity for change and about giving the people of Bexleyheath and Crayford their future park.\nMy wife is a teacher in the borough and we have two primary aged children – one of which has cerebral palsy and requires full time care support. I work closely with local parent groups supporting and campaigning on behalf of children with disabilities and their families both across the borough and nationally with SCOPE and the Changing Places campaign.\nWhile the Conservatives don’t seem to appreciate how tough things are for local families, I understand the struggles faced across the constituency. As a family, we know how difficult the cost of living crisis and the sharp rise in mortgage and rents after the Conservatives crashed the economy has made things.\nWith Keir Starmer at the helm, Labour is back in the service of working people. We will put an end to 14 years of Tory chaos and decline with a plan for national renewal, built on a bedrock of economic stability.\nOur Labour Government is delivering the change we need to take back our streets, get the NHS back on its feet, break down barriers to opportunity and get Britain building again.\nMY PRIORITIES\nI have lived in this area my whole life. I know the challenges our area and our community faces. I will always be a strong local voice in Parliament, championing local issues and fighting on your behalf.\nAs your MP, I work tirelessly all year round to make sure that I can effectively represent you. I host regular drop-in surgeries to support constituents.\nI know I won’t please everyone all of the time. But as your local representative, I always do what I think best represents the views of our area and make it clear why I have come to a particular position.\nI believe that housing is a universal human right. As a local councillor for 20 years, I saw first hand how badly we need to improve the standard of housing and provide more affordable housing.\nWorking with housing associations in the constituency, I am working to improve decent home standards and find ways to maximise the provision of affordable housing on new development sites.\nThe growth of street homelessness in the constituency is a disgrace and I continue to support our Labour Government to assist those impacted and to reduce those living on our streets.\nSince the previous Conservative Government decided to directly run the Southeastern railway franchise, we have seen a reduction in the number of trains and the destinations they serve. I believe we should have a publicly owned service that delivers for residents by increasing the number of Crayford loop to Abbey Wood services and increases the number of trains from Barnehurst, Bexleyheath and Slade Green stations. As the parent of a wheelchair user, I know the access issues that too many residents face and I am continually working to ensure access improvements to our stations.\nI know what it takes to campaign for bus improvements given my record as Cabinet Member for Transport at Bexley Council. As your MP I will continue to advocate for better and new public transport links across the constituency including to Abbey Wood Station and to our health services.\nI know how vital the NHS is to families across the constituency. One of our children has cerebral palsy, my wife has epilepsy and the amazing support given to her with her chemotherapy during the pandemic will never be forgotten by our family. However, with record waiting lists, too many of us are seeing our NHS creaking.\nAs your MP, I believe it is essential that a new modern Neighbourhood Health Centre at Erith Hospital is delivered. That would provide patient services not just at conventional times but offer services in the evenings and at weekends; so that everyone can access good quality healthcare.\nAs a Labour Government we are working to give the NHS the staff and technology it needs to cut waiting times; improve mental health provision and increase cancer survival rates.\nAs the parent of a child who requires full time care support, I know how crucial it is that we improve social care for all in our community and I will continue to work tirelessly to improve this.\nBetween 2010-2024, the Conservatives cut police numbers across the country and the last Conservative Mayor of London closed two of the three police stations in our borough. I believe we need to increase the number of police and PCSOs on our streets, and I am supporting the Mayor of London and Labour’s national mission to make Britain’s streets safe.\nI was a shopworker for 11 years and know how important it is to reduce abuse, threats and violence against shopworkers as well as those working in hospitality, public services and other front line services. I will always support measures to make our high streets and communities safer for all workers.\nThe Labour Government has set out a range of crucial measures to reduce violence against women and girls, preventing youth crime and to rebuild our criminal justice system which I will always support in Parliament.\nLabour Governments have always transformed opportunities for children. I will always fight to ensure that all children receive the education and support they deserve.\nI will continue to support our new Labour Government to create a modern childcare system that is high quality and affordable; with breakfast clubs in every primary school to give children the best start; and more teachers, paid for by ending tax breaks for private schools.\nA child’s background should not be a barrier to opportunity, and Labour’s Early Years Plan and measures to reduce child poverty will help empower children and their parents.\nI know first hand the issues faced by families of children with special educational needs and disabilities. I will continue to work with parent representative groups in our community to support families and ensure they receive the support they deserve.\nI know the value of work which was instilled in me by my parents and grandparents. For far too many families in today’s Britain, the cost of living crisis has meant that despite working hard, the weekly wage doesn’t cover the bills.\nI worked for Marks and Spencer for eleven years. While I worked at a number of stores, my working life started here at the Bexleyheath store. Since then I have been self-employed and understand the challenges of working for yourself.\nI will continue to support our Labour Government’s plans to make work pay. Within Parliament and the constituency, I will always support measures to close the gender pay gap; end low pay; grow apprenticeship opportunities; tackle job insecurity; end in-work poverty; and implement an employment rights bill.\nI am a strong supporter of breaking down barriers for disabled people and will continue to work to implement the social model of disability.\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_labours-plan-for-a-stronger-more-secure-economy/content_12.html": "Home » Education Group welcomes new Bexley MP to its schools and college\nEducation Group welcomes new Bexley MP to its schools and college\nShare on Social Media\nThe MP for Bexleyheath and Crayford, Daniel Francis, has made a series of visits to several of London & South East Education’s Group’s schools and college campuses this week.\nThe visits to Woodside Academy, London South East Colleges’ Bexley Campus and Belmont Academy provided the recently elected MP with the opportunity to meet staff and students. He was given a tour of the sites, to see the facilities and the diverse provision on offer.\nMr Francis was also keen to discuss some of the challenges that leaders and staff are facing in education – including funding issues, increased complexity of pupils’ needs and the impact of wider social problems on educators, such as poverty and mental health issues.\nVisit 1: Woodside Academy with SeeAbility\nThe MP’s first visit was to Woodside Academy on Monday 30 September, in collaboration with SeeAbility. This charity ensures people with learning disabilities can access sight tests and eye care. Mr Francis talked to staff from the charity to understand the unique challenges faced by children with special needs in terms of eye care – and observed several eye tests being carried out on pupils.\nHeadteacher Kathryn Freame provided the MP with a tour of the school and spoke in detail about the high-quality specialist provision offered at Woodside for children with SEND.\nVisit 2: LSEC’s Bexley Campus Visit\nThe following day (Tuesday October 2) Mr Francis visited London South East Colleges’ (LSEC) Bexley Campus in Erith. He met with students and staff in several departments, including art, computing and the college’s SEND provision, Nido Volans. The MP was also interviewed by some L3 media students in the College’s broadcast studio ‘The Platform’. He was asked questions about why he chose to go into politics and any advice he had for young people wanting to pursue a similar path.\nThe MP then met with Group Principal and CEO, Dr Sam Parrett, and Executive Principal, Asfa Sohail. They spoke about the many successes at the college, as well as raising some of the challenges facing both LSEC and the wider education sector – including SEND, funding and teacher recruitment.\nVisit 3: Meeting Belmont Academy’s newly elected Parliament\nMr Francis then spent the morning of Wednesday 2 October at Belmont Academy. He visited every year group and heard about the school’s inclusive approach to SEND, including its Visual Impairment and Medical Resource Provision. After touring the school with Headteacher Lucy Childs and Deputy Head Thomas Lynch, the MP met with the school’s newly elected student parliament. The eight pupils, from Years 3-6, each put a question to Mr Francis and discussed issues that are important to them – which ranged from the SATs to road safety. The pupils also asked the MP why he became a Politician and how often he went to the Houses of Parliament (the answer to which was four days a week!).\nHaving engaged in detailed discussions with students and staff at each visit throughout the week, Mr Francis gained insight into the inclusive practices across the Education Group’s diverse provision.\nReflecting on his visits, Daniel Francis MP said:\n“It has been an inspiring few days, seeing first-hand the amazing work being done at Woodside Academy, London South East Colleges’ Bexley Campus and Belmont Academy.\n“From supporting children and young people with disabilities right through to adulthood – to engaging primary school pupils in politics and leadership, it’s clear that the education being delivered in these fantastic settings, across Bexley, is thriving.\n“It is important for me to hear from the people who are working on the front line of education delivery, about the challenges they face. My ambition is to help improve things for our communities in many different ways, and education is a central part of this mission.\n“As a local MP, I am committed to working closely with education leaders, families and other stakeholders, to advocate for the services that constituents need and are entitled to – and I look forward to doing more of this as we move forward. I’ve very much enjoyed my visits this week and would like to thank the staff and students for making me so welcome.”\nCEO of London & South East Education Group, Dr Sam Parrett, added:\n“We are extremely grateful to Daniel for making the time to visit two of our schools and one of our college campuses this week. His commitment to education in the region is clear and we look forward to working with him to achieve our many shared goals and ambitions for our communities.”\nFor more information about London South East Colleges visit: www.LSEC.ac.uk\nFor more information about London South East Academies Trust visit: www.LSEAT.ac.uk\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\nKEEP UPDATED\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_news/content_6.html": "LATEST NEWS\nKeep updated on the latest news, campaigns and our work on behalf of voters in Bexleyheath and Crayford.\nNo more ‘sticking plasters’ – we must fix the foundations\nTake a look at my lates column in the Bexley News Shopper on how to fix the foundations of our country.\nMP Daniel Francis Introduces Aviation Accessibility Bill to Transform Air Travel for Disabled Passengers\nToday, Daniel Francis MP, introduced the Aviation Accessibility Bill, designed to improve air travel accessibility for disabled passengers.\nDaniel Francis MP for Bexleyheath and Crayford launches surgeries, delivering on election promise\nDaniel Francis MP has announced that he will be holding seven Drop In events in every council ward of Bexleyheath and Crayford constituency this November.\n‘UK is worst place to be a dad in Europe – I worked 3 days after my twins’ birth’\nAn MP who had no choice but to return to work days after the premature birth of his twin daughters says the UK’s paternity leave is one of the worst in Europe and urgently needs to improve.\nEducation Group welcomes new Bexley MP to its schools and college\nThe MP for Bexleyheath and Crayford, Daniel Francis, has made a series of visits to several of London & South East Education’s Group’s schools and college campuses this week.\nFOLLOW ON SOCIAL MEDIA\nKEEP UPDATED\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_contact_visiting-parliament/content_11.html": "VISITING PARLIAMENT\nIf you would like me to try to arrange a tour on your behalf please contact me via the email below.\nBOOK TOUR\nMembers of the public and school groups are encouraged to visit the Houses of the Parliament and Palaces of Westminister. Paid tours can be arranged through the Houses of Parliament but free tours are available to UK Residents booking through their MP.\nThese tours (called Democratic Access Tours) , are only available on certain days and at certain times, depending on whether Parliament is in session or in recess. They usually last approximately one hour and at present, tours are only available on Monday, Tuesday and Wednesday mornings. Friday tours are available all day if the Commons are not sitting and in the late afternoon if they are.\nThe Central Tours Office issue MPs with a limited number of special permits each day, and once these have all been allocated no more will be issued. Where possible I will try to arrange for me, or one of my team, to meet you on your tour, but this is not always possible.\nIf you would like me to try to arrange a tour on your behalf please contact me via the email below. Applications should be made as far in advance as possible and as it is difficult to arrange for everyone to take a tour on their preferred date, it would be helpful it could have some alternative dates on hand.\nWATCH DEBATES\nMembers of the public can see the House of Commons in action by sitting in the Public Gallery. It is located on a level above the floor of the Commons and looks down onto it. The Public Gallery is open to the public when the House is sitting, and is closed to the public when the House is in recess.\nTickets to the Public Gallery are also available through your MP but members only have a small allocation of tickets (two tickets, about once a fortnight) so requests should be made as far in advance as possible. The Wednesday afternoon sitting including Prime Ministers Question Time is particularly popular.\nAs an alternative to making ticket arrangements, visitors may join the public queue outside St. Stephen’s Entrance. A wait of 1 or 2 hours or more is usually common during the afternoons. Generally speaking, after ticket holders have left the Gallery and the afternoon queue has subsided, there is not normally too much pressure on places in the Gallery, except during controversial debates. Visitors who wish to minimise waiting times are therefore advised to arrive at about 13.00 or later.\nBooking a visit\nIf you are interested, please send an email to [email protected].\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_privacy-policy/content_8.html": "PRIVACY POLICY\nThis “Privacy Policy” sets out information relating to how we use personal information relating to constituents and visitors to this website.\nWHAT’S INCLUDED IN THIS PRIVACY NOTICE?\nDANIEL FRANCIS MP\nThis document (“privacy notice”) sets out information relating to how we will use personal information relating to visitors to this website. It also sets out information about what rights individuals have in relation to their personal information and various other matters required under data protection law.\nIn particular, this privacy notice provides information about how you can object to our use of your personal information, how you can withdraw any permissions you have given to enable us to process your personal information, and how you can make a complaint.\nWHO DOES THIS PRIVACY NOTICE APPLY TO?\nThis privacy notice applies to visitors to this website.\nOne of our key roles as campaigners is to raise issues on behalf of people. As such we will often collect and use personal information as part of our role. From time to time we will also contact people to ask them to complete surveys to gather information and opinions on matters..\nIn the sections below, when referring to visitors to this website we will use the terms “you” or “your”.\nWHAT’S OUR APPROACH TO PRIVACY?\nWe take your privacy extremely seriously and want you to feel confident that your personal information is safe in our hands.\nWe will only use your personal information in accordance with the data protection law applicable to England and Wales from time to time.\nUnder data protection law, when we use your personal information, we will be acting as a data controller. Essentially, this means that we will be making decisions about how to use your personal information and why.\nBelow, we summarise the main rules that apply to us as a data controller under data protection law when we use your personal information:\n- We must be upfront about how we intend to use your personal information and must use your personal information fairly. Providing privacy information to individuals (such as in this privacy notice) is one aspect of using personal information fairly.\n- We must only use your personal information if we have a legal basis to do so under data protection law. These legal bases include:\n- That you have consented to our use of your personal information;\n- That our use of your personal information is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\n- We must only use certain types of sensitive personal information, also referred to as special category personal information (such as information relating to your health, racial or ethnic origin, political opinions, or criminal convictions) if we can also satisfy one of the conditions for processing this type of information set out in data protection law. These conditions include:\n- That you have given us your explicit consent to use the information; and\n- That the processing is necessary for reasons of substantial public interest.\n- We are only permitted to share your personal information with others in certain circumstances and if we take steps to ensure that your personal information will be secure.\n- Generally speaking, we must only use your personal information for the specific purposes we have told you about. If we want to use your personal information for other purposes, we need to contact you again to tell you about this.\n- We must not hold more personal information than we need for the purposes we have told you about and must not retain your personal information for longer than is necessary for those purposes (this is known as the “retention period”). We must also dispose of any information that we no longer need securely.\n- We must ensure that appropriate security measures are in place to protect your personal information.\n- We must act in accordance with your rights under data protection law.\n- We must not transfer your personal information outside the European Economic Area (“EEA”) unless certain safeguards are in place. One such safeguard is that the personal data is only transferred to a country that has been approved by the European Commission as having an acceptable level of data protection law.\nHOW WILL WE USE YOUR PERSONAL INFORMATION?\nHow we will use your personal information, the legal bases we will rely upon, how long we will keep your personal information and other details are set out below.\nSURVEYS\nWhat personal information we will use\n- Your name;\n- Your address;\n- Your contact details (email address, telephone number etc);\n- Your opinions or other personal information provided by you in the survey.\nHow we will obtain the personal information\n- Provided by you when you complete the survey.\nWhat purposes we will use the personal information for\n- To obtain information relevant to inform;\nThe legal grounds we rely upon\n- Our use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\nHow long we retain the personal information and why\n- We will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. If you have consented to receive information about our work, we will only retain your personal information so long as you ask not to be contacted further. We will regularly review the personal information we hold to ensure that its use is necessary and proportionate.\nWHEN WILL W EUSE YOUR PERSONAL INFORMATON FOR DIRECT MARKETING?\nIn addition to data protection law, if we use your personal information for direct marketing purposes, we may also be subject to additional rules that regulate direct marketing. The term “direct marketing” essentially means directing marketing material or political campaign communications at a particular individual.\nTo ensure compliance with both data protection laws and the specific rules relating to direct marketing, we will only use your personal information to provide you with political campaign information, whether by telephone, email, text or other forms of electronic communication [or by post] if you have given us your specific consent to do so.\nOur legal basis for such processing under data protection law will therefore be that you have given your consent to process your personal data for direct marketing purposes.\nWe will retain your personal information unless and until you inform us that you no longer wish to receive direct marketing information from us. You can ask us to stop sending direct marketing to you at any time by contacting us using the details set out in the section below titled –\n“How can you get in touch with us?”\nIP ADDRESSES AND COOKIES\nWhen visiting and interacting with most websites and services delivered via the internet, when you visit our website, the technology used on our website, and via the hosting provider(s) we use, gathers certain information and stores it in log files.\nThis information includes Internet Protocol (IP) addresses, operating system, browser version, cookie details, the content you viewed on our website, system and configuration information, and locale and language preferences. This information gathered will only be used to monitor and ensure the security of our website and the data kept on it and/or to make website improvements for the benefit of visitors to our website. We collect and use Log Data to operate, maintain and improve upon the information we provide to visitors to our website. For example, Log Data can help to detect new security threats on our website, identify malicious third parties, and provide more robust security protection for all users that visit and communicate with us via our website.\nOur website may use cookies and other information gathering technologies for a variety of purposes, such as providing us with information about how visitors interact with the content on our website and to allow us to improve upon the services and/or information on our website for the benefit of all users. You can control how websites use cookies by configuring your browser’s privacy settings (please refer to your browser’s help section to learn more about cookie controls). If you choose to disable cookies entirely, the services and/or information provided on our website may not function properly.\nNEWSLETTERS\nWhat personal information we will use\n- Your name;\n- Your contact details (postal address, email address, telephone number etc.);\nHow we will obtain the personal information\n- Provided by you.\nWhat purposes we will use the personal information for\n- To provide you with newsletters about the work we undertake.\nThe legal grounds we rely upon\n- You have given your consent\nOR - Our use of your personal information in connection with the purposes set out above is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us. This is because the processing of your personal data by us will be to provide you, by post, with communications about our work, an activity which we consider promotes democratic engagement\nHow long we retain the personal information and why\nUntil you tell us that you no longer wish to receive newsletters and updates from us. You can ask us to stop sending direct marketing to you at any time by contacting us using the details set out in the section below titled – “How can you get in touch with us?”\nWHEN WILL WE SHARE YOUR PERSONAL INFORMATION WITH OTHERS?\nSometimes, we will need to share your personal information with others. This section sets out details of who we will share your personal information with and why. It also tells you about our legal basis for doing so under data protection law and steps we will take to protect your personal information.\nORGANISATIONS WHO CAN ASSIST WITH YOUR CASE\nWho are these Organisations?\n- We will share such of your personal information as is necessary with organisations who can assist with your enquiry.\nWhy we need to share your personal information with them\n- To assist with your enquiry or to obtain information relevant to your enquiry.\nThe legal bases we rely upon when sharing your personal information\n- Sharing of personal data with such organisations will be necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in us.\nWhat precautions do we take?\n- We will only share personal data as is necessary and will take steps to determine that the organisations are aware of the importance of protecting personal data.\nPROVIDERS OF INFORMATION TECHNOLOGY SERVICES\nWho will we be sharing your personal information with?\n- Suppliers of information technology products and services such as:\n- We work with other companies to help run our website. These companies provide services to help us to maintain our website, deliver support to our constituents, provide communications support and maintain administrative and security support on our behalf. These Service Providers may only process personal information pursuant to instruction and in compliance with our Privacy Policy and other applicable confidentiality, security measures and regulations. We do not permit any Service Providers to use any personal information we share with them for their own marketing purposes or for any other purpose than in connection with the services they provide to us.\nWhy we need to share your personal information with such providers\n- We use suppliers of information technology products and services in connection with the supply, maintenance and/or improvement of our IT network, and the creation, development hosting and maintenance of our website.\nThe legal bases we rely upon when sharing your personal information\n- We rely upon our legitimate interests in ensuring that our work is managed efficiently and our IT system can function properly and efficiently and that our IT network is secure.\nWhat precautions do we take?\n- We enter into contracts with our IT providers which require them to put appropriate security measures in place and which restrict their use of your personal information.\nOTHER THIRD PARTIES\nWe may also need to share your personal information with others in the following circumstances:\nLegal or regulatory requirements\nOn occasion, we may be required to disclose your personal information to organisations such as the courts or the police to comply with legal obligations we are subject to and/or to prevent fraud or crime.\nSafeguarding\nOn occasion, we may need to disclose your personal information to other organisations such as the local authority or the police for safeguarding purposes in the substantial public interest.\nProfessional advice and legal action\nWe may need to disclose your personal information to our professional advisers (for example, lawyers and accountants) in connection with the provision by them of professional advice and/or the establishment or defence of legal claims.\nWHAT RIGHTS DO YOU HAVE UNDER DATA PROTECTION LAW?\nUnder data protection law, you have a number of different rights relating to the use of your personal information. The information below contains a summary of those rights and our obligations. More information about your rights and our obligations can be found on the ICO website https://ico.org.uk/.\nYour rights – What this involves – What our obligations are\nA right of access\nThis is a right to obtain access to your personal data and various supplementary information.\n- We must provide you with a copy of your personal information and the other supplementary information without undue delay and in any event within 1 month of receipt of your request;\n- We cannot charge you for doing so save in specific circumstances (such as where you request further copies of your personal information).\nA right to have personal data rectified\nThis is a right to have your personal information rectified if it is inaccurate or incomplete.\n- We must rectify any inaccurate or incomplete information without undue delay and in any event within 1 month of receipt of your request;\n- If we have disclosed your personal information to others, we must (subject to certain exceptions) contact the recipients to inform them, that your personal information requires rectification.\nA right to erasure\nThis is a right to have your personal information deleted or removed. This right only applies in certain circumstances (such as where we no longer need the personal information for the purposes for which it was collected). We have the right to refuse to delete or remove your personal data in certain circumstances.\n- If this right applies, we must delete or remove your personal information without undue delay and in any event within 1 month of receipt of your request;\n- If we have disclosed your personal information to others, we must (subject to certain exceptions) contact then recipients to inform them that your personal information must be erased.\nA right to object\nThis is a right to object to the use of your personal information. The right applies in certain specific circumstances only. You can use this right to challenge our use of your personal information based on our legitimate interests or where the processing is necessary for the performance of a task in the public interest or in the exercise of official authority vested in us. You can also use this right to object to use of your personal information for direct marketing\n- If you object to us using your personal information for direct marketing, We must stop using your personal information in this way as soon as we receive your request.\n- If you object to other uses of your personal information, whether we have to stop using your personal information will depend on the particular circumstances.\nA right to restrict processing\nThis is a right to ‘block’ or suppress processing of your personal information. This right applies in various circumstances, including where you contest the accuracy of your information).\n- If we are required to restrict our processing of your personal information we will be able to store it but not otherwise use it.\n- We may only retain enough information about you to ensure that the restriction is respected in future.\n- We have disclosed your personal information to others, we must (subject to certain exceptions) contact them to tell them about the restriction on use.\nIf you wish to exercise any of your rights, you can make a request by contacting us using the details set out in the section below titled –\n“How can you get in touch with us?”\nIf you request the exercise of any of your rights we are entitled to ask you to provide us with any information that may be necessary to confirm your identity.\nYOUR RIGHT TO WITHDRAW CONSENT\nIf you have given us your consent to use any of your personal information, you can withdraw your consent at any time. To do so, please contact us using the details set out in the section below titled – “How can you get in touch with us?”\nHOW CAN YOU GET IN TOUCH WITH US?\nYou can get in touch with us in the following ways:\nEmail address: [email protected]\nWe are the persons overseeing compliance with data protection law an this privacy notice. If you have any questions about this privacy notice, how your personal information is handled or if you wish to make a complaint, please contact us.\nRIGHT TO COMPLAIN TO THE INFORMATION COMMISSIONER’S OFFICER\nIf we are unable to deal with a complaint to your satisfaction or if you are unhappy with the way we are using your personal data, you also have the right to make a complaint at any time to the UK’s supervisory authority for data protection issues, the Information Commissioner’s Office.\nCHANGES TO THIS PRIVACY NOTICE\nWe may update this privacy notice from time to time. If we make any substantial updates, We will provide you with a new privacy notice. We may also notify you in other ways from time to time about the processing of your personal information.\nIn effect: 12/12/24\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_useful-links/content_7.html": "USEFUL LINKS\nUse the links below to read helpful information from public service providers.\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_newsletters/content_13.html": "NEWSLETTERS\nAll editions of Daniel Francis MP’s free monthly E-Newsletters – Community Matters – can be found here.\nYou can find updates from Daniel in Parliament, the Constituency, and from the Assisted Dying Bill Committee.\nYou can also find details of local events for that month, including theatre productions, tours, fairs and more! Every edition lists the semi-professional clubs’ home fixtures each month including Belvedere FC, Crayford Arrows & more!\nIf you are looking for advice or support, we have contact details for many local charities and organisations.\nKEEP UPDATED\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_david-lammy-speech-foreign-policy-in-an-age-of-authoritarians/content_14.html": "Home » Daniel Francis MP for Bexleyheath and Crayford launches surgeries, delivering on election promise\nDaniel Francis MP for Bexleyheath and Crayford launches surgeries, delivering on election promise\n- 29/10/2024\n- Posted by: Daniel Francis MP\n- Category: News\nShare on Social Media\nDaniel Francis MP has announced that he will be holding seven Drop In events in every council ward of Bexleyheath and Crayford constituency this November. The announcement delivers on Daniel’s commitment during the election campaign to “host regular drop-in surgeries to support constituents with their issues” and is focused on constituents who need support for carers, the cost of living crisis, pension credit or energy efficiency measures.\nDaniel Francis the Member of Parliament for Bexleyheath and Crayford has revealed that he will be holding surgeries in November for all seven wards in the constituency. Daniel said “I am delighted that these seven Drop In events will be taking place in every ward in our constituency, and that I will be joined by local charities to provide their expertise. In the election campaign I promised to host regular drop-in surgeries to support constituents with their issues and I am proud to be delivering on this important pledge.”\n“I encourage anyone who needs support with pension credit, the cost-of-living, energy efficiency measures or carers’ support to get in touch – we will be joined by local charities who specialise in these areas at the surgeries. I will also be available for people to speak to directly where needed, I believe that it is important for me to be available to constituents, and will do my best to speak to as many constituents as possible across these surgeries.”\nIf you know someone who may need my help and want to attend one of these surgeries, please share these details below with them. If you would like to book an appointment please complete the form here: https://forms.gle/N8x6ShQWaFpGAu139 or email daniel.francis.mp@parliament@uk\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\nKEEP UPDATED\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_contact_event-request/content_10.html": "EVENT REQUEST\nAre you hosting an event locally or in Parliament? Invite me to attend or speak at the event by completing the form on this page.\nWelcome to the event inviation hub. In my role as your elected representive, I want to engage with voters, community groups and local organsiations to foster dialogue, promote community interests, and encourage representation on issues that matter to you.\nThis page lets you easily invite me to attend local events or gatherings at Parliament. Whether you’re organising a community meeting, charity event, or a local celebration, you can use the form here to invite me to the event and ensure your community’s voice is heard.\nSimply fill out the form with your event details and explain how my attendance would benefit your cause. Don’t forget to include details of the location, day and times and other useful information about your event.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_contact/content_9.html": "CONTACT\nWould you like to find out more about our campaigns? Please use the contact form below to get in touch.\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe to my email newsletter to keep updated on our news, campaigns and work in the local area.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe to my email newsletter to keep updated on our news, campaigns and work in the local area.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk/content_1.html": "Do you need help on local issues? Get in touch today.\nDAILY UPDATES\nLatest News\nKeep updated on the latest news, campaigns and our work on behalf of voters in Bexleyheath and Crayford.\n-\nNo more ‘sticking plasters’ – we must fix the foundations\nTake a look at my lates column in the Bexley News Shopper on how to fix the foundations of our country.\n05/03/2025Read More -\nMP Daniel Francis Introduces Aviation Accessibility Bill to Transform Air Travel for Disabled Passengers\nToday, Daniel Francis MP, introduced the Aviation Accessibility Bill, designed to improve air travel accessibility for disabled passengers.\n19/11/2024Read More -\nDaniel Francis MP for Bexleyheath and Crayford launches surgeries, delivering on election promise\nDaniel Francis MP has announced that he will be holding seven Drop In events in every council ward of Bexleyheath and Crayford constituency this November.\n29/10/2024Read More\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-\nNo more posts",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_no-more-sticking-plasters-we-must-fix-the-foundations/content_2.html": "Home » No more ‘sticking plasters’ – we must fix the foundations\nNo more ‘sticking plasters’ – we must fix the foundations\nFOLLOW ON SOCIAL MEDIA\nKEEP UPDATED\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe to my email newsletter to keep updated on our news, campaigns and work in the local area.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nSUBSCRIBE FOR EMAIL UPDATES\nKeep Updated\nSubscribe to my email newsletter to keep updated on our news, campaigns and work in the local area.\nSubscribe\nI agree to the Privacy Policy and to receive email updates.\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_keir-starmer-speech-unveiling-labours-mission-to-cut-bills-create-jobs-and-provide-energy-security-for-britain/content_5.html": "Home » MP Daniel Francis Introduces Aviation Accessibility Bill to Transform Air Travel for Disabled Passengers\nMP Daniel Francis Introduces Aviation Accessibility Bill to Transform Air Travel for Disabled Passengers\n- 19/11/2024\n- Posted by: Daniel Francis MP\n- Category: News\nShare on Social Media\nToday, Daniel Francis MP, introduced the Aviation Accessibility Bill, designed to improve air travel accessibility for disabled passengers. This Bill seeks to implement comprehensive regulations for airports and airlines, ensuring they can facilitate the smooth journey of disabled passengers, from entering the airport, navigating security, boarding the aircraft and having a safe journey before disembarking at their destination.\nThe Bill aims to grant the Civil Aviation Authority greater powers to fine airports and airlines for not complying with regulations to accommodate disabled passengers and to promote further accessibility in future development in the aviation industry.\nDaniel Francis MP acknowledged the vital contributions of Baroness Tanni Grey-Thompson, who has been appointed to chair the newly established Aviation Accessibility Task and Finish Group by the Secretary of State for Transport. The Group is tasked with examining existing legislation and identifying solutions to make air travel more accessible for disabled passengers, with a report due next summer.\nThe Bill also acknowledges the critical advocacy of campaigners such as Sophie Morgan, Christopher Wood, Roberto Castiglioni, Martyn Sibley, Josh Wintersgill, and Jet Gates, whose Rights on Flights campaign has pushed for greater accessibility and rights in air travel since its launch in 2023.\nDaniel Francis MP highlighted numerous issues faced by disabled passengers, from navigating airports and boarding planes to inadequate facilities onboard. Stories of wheelchair users being forced to crawl off aircraft due to a lack of equipment, space, and knowledgeable staff underscore the urgent need for reform.\nThe Aviation Accessibility Bill aims to break down barriers and foster a more inclusive air travel experience for all.\n“Accessibility in air travel is not just a matter of convenience—it is a fundamental issue of rights, dignity, and equality. All individuals, regardless of their mobility or physical condition, should have the freedom to travel for work, family, or leisure without facing undue barriers or discrimination.”\n“Current aircraft design often fails to accommodate the needs of disabled passengers, with limited or non-existent accessible bathrooms and narrow aisles. Our Bill calls for new aircraft to include features like wheelchair blocks, larger accessible bathrooms, and improved seating arrangements to cater to passengers with special needs.”\n“As a parent of a wheelchair user, I have personally witnessed the barriers faced by disabled travellers. No one should have to forgo air travel due to inadequate facilities or fear of damaged mobility equipment. This Bill seeks to ensure all individuals can access air travel safely and with dignity.”\nDaniel Francis, Member of Parliament for Bexleyheath and Crayford\nShare on Social Media\nFOLLOW ON SOCIAL MEDIA\nKEEP UPDATED\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-",
  "https_www_danielfrancis_uk/https_www_danielfrancis_uk_campaigns/content_3.html": "ECONOMIC GROWTH\nGET BRITAIN BUILDING AGAIN\nGood jobs and productivity growth in every part of the country making everyone, not just a few, better off.\nDetails\nCLEAN ENERGY\nGreat British Energy\nBritish people are facing challenges with higher bills. The only way to cut energy bills is to shift to clean, low carbon power.\nDetails\nNHS & HEALTH\nGet the NHS back on its feet\nThere when people need it; with fewer lives lost to the biggest killers; in a fairer Britain, where everyone lives well for longer.\nDetails\nSAFER STREETS\nTake back our streets\nLabour believes that feeling secure is the bedrock on which opportunities are built, and communities can thrive.\nDetails\nOPPORTUNITY\nbarriers to opportunity\nReform the childcare and education systems, raise standards everywhere, and prepare young people for work and life.\nDetails\nHELP US WIN\nVOLUNTEERING WITH LABOUR\nBe part of the team that delivers a Labour government. Over 50,000 people have already pledged.\nDetails\nGET IN TOUCH\nAs your local MP there are a number of different things I can help you with or offer advice on, such as; benefits, immigration, tax issues, problems with the NHS, child maintenance and education matters.\nI would love to hear from you about what you think my priorities should be as your MP for Bexleyheath and Crayford and what matters most to you.\nPlease use the contact form to get in touch with me. Please remember to provide as many details as possible, including your name, address and full details of your issue.\n-\n0207 219 5278\n-"
}