{
  "https_veronicaoakeshott_com/https_veronicaoakeshott_com/content_1.html": "For twenty years, I’ve been campaigning for a more healthy environment, a kinder society where people treat each other with respect and public services that won’t let us down.\nThrough my paid work, as a professional campaigner for charities like Save the Children and the End Violence Against Women Coalition, through roles as an elected representative and through volunteering in my local community, I love bringing people together to make change.\nI’ve lived in Africa and many places across the UK, but Oxfordshire is home. Its where I live with my family, where I got married and where I spent my summer holidays as a child. I was proud to stand as the Labour MP candidate, here where I live in the 2024 election. There’s so much to love about our area, as well as much to improve.\nWhen I was little my dad made all the big decisions in our house. That sowed a seed of interest in democracy in me. Since then, I’ve always been interested in how people can get involved in shaping their own futures, how they can be heard and have impact. You might call it campaigning.\nWelcome\nI am never happier than when I’m campaigning – whether its campaigning to make our roads safer or for a new law to stop banks profiting from global deforestation – I love working for change. And by building teams and thinking creatively, I’m happy to say I’ve had lots of wins. I led the team that changed the law on domestic abuse perpetrators, won changes to make off-shore business more transparent, and led the campaign that saved the 1966 world cup statue for its original host community. How I can help your campaign? Clikc here\nCampaigning\nI care deeply about our environment. The state of our rivers and sea concerns me and the changes in our biodiversity. I lead a team of campaigners at the environmental charity, Global Witness, to end the global deforestation crisis.\nMy work has helped encourage financiers to divest/freeze their investments in deforesting companies. For more about my environmental work click here.\nThe Environment\nPolitics has a bad reputation – and after recent years, perhaps that’s not surprising – but its so important because it touches everyone’s lives. I’ve lived in countries where democracy is fairly new, and I’ve seen what can go wrong when the links between politicians and people are weak and remote and people don’t feel they have the right to speak up. No one politician can have personal experience of every walk in life, so we need politicians who listen as well as ‘do’.\nFind out more about the political work I've been involved in here"
}