{
  "https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_home/https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_home/content_1.html": "\"Wakefield and Yorkshire as a whole are being left behind - it can't be allowed to continue.\"\nAs a local resident who lives in the community with my family, I have seen first-hand the effects London-centric politics have had on our area.\nWithout the strong voice that London and Scotland have, we are left to the crumbs from Whitehall's table.\nThis leads to Wakefield and Yorkshire as a whole having:\nPoorer transport links\nWeaker health service\nAiling schools and education providers\nAll leading to fewer jobs, lower wages and a weaker economy.\nI have a three point plan for building a stronger and more prosperous Wakefield.",
  "https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_home/https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_about-david/content_4.html": "Wakefield deserves better.\nFor years and years, it has been let down by the Tories nationally and Labour locally. Other areas of our country have had louder voices and been listened to first. Likewise, other areas of our District.\nThat has to change.\nOnly the Yorkshire Party has the policies to bring about that change. We need a properly-funded regional parliament, within the UK, to ‘levelup’ funding and to provide that strong voice.\nIt would ensure spending goes on what the people of Yorkshire want, such as tackling the housing crisis, the massive delays in the NHS and funding education and transport properly – things the London government has completely failed on.\nAs someone who lives here in the constituency, I know Wakefield, Horbury, Ossett and the surrounding villages well. They’re places that mean a lot to me and I would always put them – put you – first.\nPlease vote for me on June 23.",
  "https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_home/https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_who-are-we/content_3.html": "The Yorkshire Party is a political party demanding an end to Westminster-centred politics. Our region has been neglected by politicians in Westminster for years.\nWe are founded on the social democratic principles of subsidiarity, dignity, community and cooperation. We believe that by moving powers as close to people as possible, we can empower communities to be ambitious and allow individuals freedom for creativity and enterprise.\nWe believe service to humanity should be the foundation of government and that as members of society we share a responsibility to participate in building a region of fairness and opportunity.\nBoth Conservative and Labour incompetence has left Yorkshire lagging behind on almost every level. Only the Yorkshire Party is offering an ambitious vision to revive our democracy and invest in transport, health, jobs and our children’s futures.\nYorkshire has a larger population than Scotland, an economy twice that of Wales but the powers of neither. By calling for a devolved Yorkshire parliament we aim to build a stronger Yorkshire within a fairer United Kingdom.\nFind out more at YorkshireParty.org.uk",
  "https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_home/https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_support/content_5.html": "There are many ways you can support David's campaign.\nJoin the Yorkshire Party and help campaign for a better Yorkshire.\nDonate to Simon's campaign so the Yorkshire Party can reach out to as many people as possible.\nShow your support for the Yorkshire Party and David's campaign with a supporter's pack.\nYou can also subscribe to our newsletter to stay up to day with the campaign.",
  "https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_home/https_sites_google_com_yorkshireparty_org_uk_herdsonforwakefield_my-plan-for-wakefield/content_2.html": "A Yorkshire Regional Parliament\nWe don’t have the voice that London or Scotland has, and because of that we miss out on the money and influence they get but.\nWe want a better health service, we want a better education system, we want a better public transport system - but this needs fair funding and local control. That will only come when Yorkshire has the voice to demand its fair share and the power to exercise the decisions needed. Until we have a strong regional parliament for the county we are always going to be begging for scraps from Whitehall’s table.\nAddressing the Cost of Living Crisis\nThe government’s belated acknowledgement of the soaring energy cost is welcome but late, badly directed and unsustainable. Instead, it should scrap VAT on energy, and benefits and state pensions should be increased in line with the soaring inflation.\nThis should be paid for by closing loopholes that enable the rich to avoid their fair share, and by a windfall tax on the dividends of energy companies. Taxing only dividends, rather than the companies’ whole profits, means that they can – and must – use their windfall profit to invest in renewables and domestic production.\nMake Homes Financially Available for First-Time Buyers\nToo many people cannot afford to buy a home of their own. That has to change. This means we must build the houses people need, and amend taxes to favour home-owning instead of buy-to-let. Renters and leaseholders also need better protection from bad landlords. Owning your own property gives people both a sense of security and also a very real physical stake in their community; it is very much to be encouraged and the tax system should encourage it.\nA Local Candidate with Experience: A Party That Can Win\nI live within the constituency. I'm a former councillor and school governor, who also volunteered as a social housing trust director for around a decade. I left the Conservative Party in 2019 over its lurch to the right, the reckless and self-absorbed style of Boris Johnson’s leadership, and its refusal to seek a Brexit deal that works for the country.\nThe Yorkshire Party took 12% of the first-preference vote in the Wakefield district in last year’s West Yorkshire mayoral election and won an even higher share in this year’s South Yorkshire contest. It also finished third in the local elections in 2022 within the Wakefield constituency. In each case, the Yorkshire Party finished ahead of the Lib Dems and Greens – who are effectively out of the running.\nFor people who don’t trust Boris Johnson and are not convinced by Kier Starmer, they have a third option.\nThey should vote for Yorkshire Party; they should vote for David Herdson."
}