{
  "https_www_markfrancois_com_/https_www_markfrancois_com_campaigns_campaign-new-special-needs-school-south-essex/content_3.html": "In July 2023, in the House of Commons during Education Questions, Mark launched his campaign for a new Special Needs school in South Essex, in which he said the following to the Education Secretary, Gillian Keegan MP:\n“One particularly challenging area for teachers is Special needs education. There are many who want to work in that field, but in Essex, our special needs schools are unfortunately already full to bursting. That is why today I am launching a campaign for a new special needs school in South Essex. I have met the Schools Minister in advance who was very helpful.\nWill the Secretary of State and the Schools Minister work with myself and Essex County Council to try and get us the additional Special needs places that parents and special needs children so desperately need.”\nIn a positive response to Mark’s question, the Secretary of State replied:\n“I absolutely agree with my Rt Hon Friend, and this is something that we have already announced, we will invest £2.6 billion into more Special needs schools and many Honorable members are getting more special educational needs schools in their area.\nWe would of course be very happy to work with him and Essex County Council to make sure that they have the right provision in Essex for all those children who have additional needs. An Essex County Council Cabinet document dated the 20th of June 2023 emphasised the need for more Special needs places in the County.\nIt stated that “a consistently high number of pupils with SEND cannot have their needs met in Essex schools and are subsequently educated in independent schools at high cost to both the High Needs Block of the Essex Dedicated Schools Grant (DSG) and ECC budgets.”\nExplaining the background to the campaign, Mark said:\n“I am now being approached, as part of my constituency casework, by an increasing number of parents who simply cannot find a Special Needs school place for their children. For instance, I was told anecdotally, that at Glenwood special school a couple of months ago, they had 28 appeals for admittance outstanding.\nHaving now discussed this with the Schools Minister, Nick Gibb MP and the Cabinet Member for Education and lifelong learning at Essex County Council, Cllr Tony Ball, I have concluded that the time has come to launch a formal campaign to try and create a new Special school in Essex. I very much hope this campaign will enjoy the support of local people, particularly those who are affected by the Special Needs issue. I hope to have some more to say about this in the very near future.”\nSince this time, Mark is delighted that after months of hard work, Essex County Council (ECC) has announced the commencement of a formal consultation, on its plans to build a new special educational needs (SEN) school, for 100 plus pupils, at a site at Rawreth Lane, on the edge of Rayleigh.\nMark pictured with Councillor Andrew Sheldon and Councillor Tony Ball, Essex County Council, Mark Francois MP and William Wood, Associate Director of Planning, Vistry Major Projects, at the new proposed site.\nThe school will be a \"through-school\" (catering for pupils from the ages of 3 to 18 inclusive) and will be operated by an existing educational trust – subject to a competitive process. It is intended to start construction later this year or early in 2025. This schedule, which is subject to planning permission, is in order to allow the new school to open its doors for its first special needs pupils, during the 2025-26 academic year.\nAs part of this campaign, Mark has spoken multiple times in the Commons about the issue, whilst also meeting with the Minister for Children, Families and Wellbeing (including special needs) David Johnston MP. Alongside this, more locally, I have also been working closely with ECC’s Education Team, led by Cllr Tony Ball, the Cabinet Member for Education and Clare Kershaw, Director of Education at ECC to make this prospect a reality.\nI am therefore delighted that this project has now finally taken off the runway. This exciting new school should finally help expand the much-needed capacity of SEN education in South Essex, which I do hope will bring a real benefit for parents, and children with special needs, alike.\nFinally, the consultation exercise, designed to seek views and comments from local residents, potential users of the school and other interested parties, including on a name for the new institution, will now run until midnight on Friday 5th April. Anyone wishing to contribute to the consultation is strongly encouraged to make their views known, via:\nhttps://consultations.essex.gov.uk/school.../wolseypark/\nThe more opinions we receive, the merrier!",
  "https_www_markfrancois_com_/https_www_markfrancois_com/content_1.html": "Latest news\nMy Campaigns\nRayleigh and Wickford Constituency\nFind your MP\nEnter your postcode\nHere you can find information about the constituency of Rayleigh and Wickford and important local and national issues. If you are a constituent who needs my help, this website also contains details of how you can contact me and - if you require - make an appointment at one of my regular constituency surgeries.",
  "https_www_markfrancois_com_/https_www_markfrancois_com_news/content_8.html": "MARK FRANCOIS MP HOSTS HOLT FARM JUNIOR SCHOOL FOR A VISIT TO PARLIAMENT Thursday, 5 December, 2024 Mark Francois, MP for Rayleigh and Wickford, was delighted to welcome a group of students from Holt Farm Junior School to the Houses of Parliament earlier this week. The visit gave the children a unique opportunity to learn more about the workings of Parliament and the role of an MP. After a guided tour of the iconic building, which included visits to the historic Chambers of the House of Commons... Westminster News\nSHADOW ARMED FORCES MINISTER RAISES CONCERNS OVER CADET FUNDING CUTS 19th November 2024 In his first Oral Defence Questions as Shadow Armed Forces Minister, Rayleigh and Wickford MP, Mark Francois, voiced serious concerns about the Government’s... Westminster News\nMP VISITS SCHOOL AS PART OF UK PARLIAMENT WEEK 18th November 2024 A South Essex MP met with a local school council, to discuss how the House of Commons works, as part of UK Parliament Week. Rayleigh and Wickford MP, Mark... Local News\nSHADOW ARMED FORCES MINISTER PAYS TRIBUTE TO THE FALLEN OVER REMEMBRANCE WEEKEND 10th November 2024 Shadow Armed Forces Minister and Rayleigh and Wickford MP, Mark Francois, paid his respects to the fallen over Remembrance Weekend by attending several... Local News\nSHADOW DEFENCE SECRETARY AND SHADOW ARMED FORCES MINISTER RALLY BEHIND ROYAL BRITISH LEGION “POPPY RIDE” 7th November 2024 Shadow Defence Secretary, James Cartlidge MP & Shadow Armed Forces Minister and Rayleigh and Wickford MP, Mark Francois, recently joined forces in Westminster... Westminster News\nMARK FRANCOIS APPOINTED AS SHADOW ARMED FORCES MINISTER 7th November 2024 Rayleigh and Wickford MP, Mark Francois, has been appointed as the Shadow Armed Forces Minister, as part of the formation of the new Conservative Opposition... Westminster News\nTWO ESSEX MPS WELCOME ESSEX POLICE’S ADOPTION OF NEW PROTOCOL TO PROTECT VETERANS 6th November 2024 Rayleigh and Wickford MP, Mark Francois, alongside Southend East and Rochford MP Bayo Alaba, welcomed Essex Polices' announcement of their plans to implement... Local News\nMARK FRANCOIS MP REVIVES BILL TO HELP “CAN THE CONES” 5th November 2024 Yesterday, Rayleigh and Wickford MP Mark Francois, reintroduced his Roadworks (Regulation) Bill in the House of Commons. Previously, Mark had put forward a... Local News\nMARK FRANCOIS MEETS ESSEX-BASED EMPLOYMENT CHARITY AT HIS LOCAL SURGERY 29th October 2024 A South Essex MP recently met with members of a charity, Employability, dedicated to seeking job opportunities for Essex residents with additional needs. The... Local News\nMARK FRANCOIS SUPPORTS NEW “BIONIC” PEER AS HE JOINS THE HOUSE OF LORDS 28th October 2024 Rayleigh and Wickford MP Mark Francois was present to witness his long-time friend, the “bionic peer” Craig Mackinlay, when he was formally introduced as a... Westminster News",
  "https_www_markfrancois_com_/https_www_markfrancois_com_campaigns/content_7.html": "Campaign for a new Special Needs School in South Essex In July 2023, in the House of Commons during Education Questions, Mark launched his campaign for a new Special Needs school in South Essex, in which he said the...\nThe Roadworks (Regulation) Bill- 'Let's Can the Cones!' At the end of November 2023, Mark published his Roadworks (Regulation) Bill, the essence of which was aimed at trying to bolster the regulation of roadworks and...\nHealthcare Mark takes the issue of healthcare for his constituents very seriously and he continues to meet and work closely with NHS leaders at both Basildon, Southend...\nBrexit Mark made his maiden speech in the House of Commons on the 4th July 2001 against the Nice Treaty. Throughout his time in Parliament, Mark has had concerns about...\nDefence Mark's father, Reginald Francois, served in a minesweeper on D-Day, HMS Bressay, which swept the approaches to the landing beaches very early in the morning of...\nEducation The Rayleigh and Wickford constituency has six good quality secondary schools. They are FitzWimarc and Sweyne Park in Rayleigh, Greensward Academy in Hockley...\nPolicing Mark’s elder brother Brian Francois served for over thirty years in the Metropolitan Police and since his time as an MP, has contintued to take a strong...\nTransport Many of Mark’s constituents commute into the City of London on the Greater Anglia (Abellio) Liverpool Street Line. Therefore, Mark has met numerous times with...",
  "https_www_markfrancois_com_/https_www_markfrancois_com_contact/content_5.html": "If you are a constituent and need to contact Mark regarding an issue of concern, you may write to him at:\nHouse of Commons London SW1A 0AA\nLondon\nSW1A 0AA\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_markfrancois_com_/https_www_markfrancois_com_constituency/content_2.html": "Mark lives in the town of Rayleigh within his constituency and is involved with a number of local charities and voluntary organisations. Mark is the Patron of the Rayleigh Branch of the Royal British Legion and was very supportive of the campaign to establish the refurbished War Memorial on the edge of Wickford Memorial Park. Mark is also an Associate Member of the Rayleigh Branch of the Royal Naval Association (by virtue of his father’s service in the Royal Navy in the Second World War).\nMark also serves as the President of various local organisations and charities, including:\n- The Friends of Holy Trinity (which raises money for the upkeep of Rayleigh’s 14th century church at the top of the High Street).\n- SCAFT (Supporting Carers and Families Together, who help support young children across the Rochford District who act as carers for their families).\n- Wyvern Community Transport (who help to provide transport for senior citizens and disabled people who lack private transport of their own).\n- Rayleigh Conservative Club on London Hill.\n- Rayleigh Town Museum.\n- The Essex Folk Association.\nMark regularly attends events across his constituency, as well as paying visits to local senior and junior schools in the course of the year, many of which have been on trips to visit the Houses of Parliament. Mark holds regular constituency surgeries which usually take place twice a month at his constituency office, in Bellingham Lane (just off the High Street). For more information on how to book a surgery appointment with Mark please refer to the surgery page on this website.\nMark also serves as a Patron of the national charity, Cruse Bereavement Care, which helps to aid and support those people who have suffered a bereavement and which has local branch organisations across the country.",
  "https_www_markfrancois_com_/https_www_markfrancois_com_map-locations/content_4.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_markfrancois_com_/https_www_markfrancois_com_campaigns_roadworks-regulation-bill-lets-can-cones/content_6.html": "At the end of November 2023, Mark published his Roadworks (Regulation) Bill, the essence of which was aimed at trying to bolster the regulation of roadworks and thus curtail the seemingly endless increase of roadworks in England and help ‘Can the Cones!’\nMark published the Bill as one of the great frustrations of modern life is queueing for ages in a line of traffic, inching forwards to get through a set of contra-flow traffic lights at a set of roadworks, so that you can crawl past a large hole in the ground, heavily coned-off, with absolutely no-one working on the site as you finally drive past it. This is an issue that has been brought to my attention repeatedly by numerous concerned constituents of mine.\nSometimes it is utility companies carrying out repairs or maintenance, sometimes broadband providers laying new fibre, or property developers connecting up new estates to the power grid. In many cases, however, the common factor is a lack of any palpable sense of urgency to get the job done, regardless of the inconvenience which is caused to the travelling public.\nThe Bill essentially has three key aims:\nFirstly, it would give local highways authorities much stronger powers to control the granting of permits to anyone who wanted to dig up the highway network. Under the 2004 traffic management scheme, permit arrangements were enabled, allowing utility companies to “book occupation of the street for specified periods for a specified purpose.”\nHowever, currently highways authorities can only really refuse to grant a permit on safety grounds and, if those applying for one deem the work to be an emergency, the ability of the authority to refuse is even weaker still. The Bill would allow refusal on the grounds of causing unacceptable disruption and would materially strengthen the hand of councils to negotiate much tighter conditions, including stricter deadlines, when granting permits, so that companies would hopefully be prevented from over-running in the first place.\nSecondly, the Bill would mandate highway authorities to take all practicable steps to “deconflict” roadworks in their areas, to prevent multiple works in the same neighbourhood from leading to near gridlock, especially during peak periods. Under section 59 of the New Roads and Street Works Act 1991, local authorities are required to co-ordinate roadworks to minimise disruption to road users. It states that “local authorities shall use their best endeavours to coordinate the execution of works of all kinds.”\nBut the truth on the ground—what really goes on in practice, rather than just in abstract policy—is that some local highways authorities are clearly not following those requirements. For instance, a few years ago we had near chaos in my home-town of Rayleigh, when several sets of roadworks, on the main arteries in and out of the town, were allowed to proceed at almost exactly the same time. When we subsequently looked into why, it turned out that the official at County Hall who handed out permits to developers did not communicate with the one who gave them to utility companies. One constituent put it to me at the time that “there seems to be no forethought or planning and no coordination—it’s ludicrous.”\nThe Bill would seek to rectify that by trying to ensure a much more joined-up approach, by imposing much stricter procedures on highways authorities that give out the permits, and it would also seek to prevent the same stretch of road from being dug up multiple times, in short succession, by different companies.\nThirdly, the Bill would materially increase the fines for roadworks that overrun. At present, under section 74 of the 1991 Act, local highways authorities have the power to fine utility companies for “unreasonably prolonged” occupation of the highway. The fine tariff is set out in the Street Works (Charges for Unreasonably Prolonged Occupation of the Highway) (England) (Amendment) Regulations 2012, which provide for a maximum charge for “traffic-sensitive” streets of £5,000 a day for the first three days of overrun and £10,000 a day thereafter.\nSince its publication, Mark met the then Roads Minister, Richard Holden MP, to discuss the Bill’s main objectives and how this might be achieved, either by the Government adopting the Bill, or strengthened Government guidance on roadworks.\nMark meeting the previous Roads Minister, Richard Holden MP, with fellow MPs Anna Firth and Vicky Ford, to promote his Bill to help “Can the Cones.”\nAlongside, the endorsement from the previous Roads Minister, Richard Holden MP, the Bill has the “full support” of the AA, who stated that \"they fully support the objectives of the Bill.\"\nMark continues to push for the Department for Transport to adopt the legislation, or at the very least, strengthen government guidance, so that we can finally ‘Can the Cones!\nThe ‘Can the Cones’ logo."
}