{
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-campaigns_improvements-to-surbiton-station/content_19.html": "Ed Davey MP and Kingston Lib Dems have been working hard for improvements to be made at local train stations, including an additional staircase to platforms 3 & 4 of Surbiton station, and step-free access for Chessington South station.\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_south-of-the-borough_king-georges-sunray/content_52.html": "Our team in King George's & Sunray\nElected in May 2022, councillors Mark Beynon and Helen Grocott represent King George's & Sunray on the Council. You can find their contact details below:\nCllr Mark Beynon\nBy phone: 07480 515 353\nBy email: Mark.Beynon@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Helen Grocott\nBy email: Helen.Grocott@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_volunteer_join-our-volunteer-mailing-list/content_28.html": "Subscribe to our volunteer e-newsletter\nPlease fill in your details below to join our volunteer mailing list, and keep up to date with Kingston Lib Dem events.\nPlease fill in your details below to join our volunteer mailing list, and keep up to date with Kingston Lib Dem events.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_volunteer/content_2.html": "Volunteer for Kingston Liberal Democrats\nHelp us make a difference in your community\nThere are lots of ways you can help Liberal Democrats win in the Royal Borough of Kingston upon Thames. Will you volunteer?\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_20221222-ed-daveys-christmas-card-competition/content_21.html": "Ed Davey's Christmas card competition\n🎅🎄Ed Davey MP was pleased to award the winners of his Christmas card competition, which had the theme of \"a Royal Christmas\". Ed and his team were blown away by the talent of all the young people taking part. You can see some of the cards displayed at Surbiton station.💌🎅\nEd said:\n\" There were so many brilliant entries to my Christmas card competition this year. Thank you to all the young people across Kingston and Surbiton who took part. It was a huge pleasure to award the winners today\"\nThe overall winner was Anna from St Matthews Primary School. The winner of the 4-6 category was Imogen from Ellingham Primary School. The winner of the 11-16 category was Anthonia, from Tolworth Girls School, and Safwaan was the winner of the SEN category.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_eddavey-mp/content_1.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_fair-share-for-kingston/content_9.html": "Fair share for Kingston!\nUnder the Conservatives, Kingston receives just £180,000 for local services, down from £66 million it used to receive. Meanwhile neighbouring boroughs like Wandsworth get millions. The result is that local council taxpayers have to pay more for less. Back the campaign to give Kingston it's fair share, and tell the government to properly fund our services",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_new-old-malden_new-malden-village/content_71.html": "Our team in New Malden Village\nElected in June 2022, councillors Mark Durrant, Lesley Heap and Robert (Dongsung) Kim represent New Malden Village on the Council. You can find their contact details below:\nCllr Mark Durrant\nBy phone: 07880 796 142\nBy email: Mark.Durrant@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Lesley Heap\nBy phone: 020 8949 0403\nBy email: Lesley.Heap@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Robert (Dongsung) Kim\nBy phone: 07379 762 151\nBy email: Robert.Kim@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_statement-on-her-majesty-queen-elizabeth-ii/content_38.html": "Statement on Her Majesty Queen Elizabeth II\nWith the sad passing of Her Majesty Queen Elizabeth II, Kingston Liberal Democrats join residents across the Royal Borough of Kingston upon Thames in this time of mourning, and our thoughts are with the Royal Family at this time.\nEd Davey, MP for Kingston & Surbiton and Leader of the Liberal Democrats, said, \"We mourn the loss of a great monarch who served our country faithfully all her life. The Queen was an ever-fixed mark in our lives. She represented duty and courage, warmth and compassion. My thoughts and prayers are with the Royal Family, and everyone whose life she touched. As the world changed around us and politicians came and went, The Queen was our nation’s constant. She was a living reminder of our collective past, of the greatest generation and their sacrifices for our freedom. Today our family of nations is in mourning, as we also remember the steadfastness, resolve and love Queen Elizabeth brought to the world.\"\nSarah Olney, MP for Richmond Park, added, \"The passing of Her Majesty The Queen has been deeply saddening to us all. Her Majesty has been a source of stability and strength for our nation for 70 years and her presence will be sorely missed by everyone in Richmond Park and beyond.\"\nCllr Andreas Kirsch, Leader of Kingston Council, commented, \"I am profoundly saddened by the news of Her Majesty's passing. She has led a life of devotion to the public and she has been a role-model to all of us. She will forever remain in our hearts.\"\nCllr Yogan Yoganathan, Mayor of the Royal Borough of Kingston upon Thames, said, \"As a Royal Borough, Kingston upon Thames has always had a strong connection to the Queen and the Royal Family, and we feel her loss deeply. On behalf of both the local authority and the people of Kingston upon Thames, I express great sadness at her passing and offer our sincere condolences to the royal family for their loss.\"\nIn light of this sad news, and with immediate effect, Liberal Democrats in the Royal Borough of Kingston upon Thames join Liberal Democrats throughout England, Scotland and Wales in suspending all campaigning.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_kingston-north-kingston_kingston-town/content_69.html": "Our team in Kingston Town\nElected in May 2022, councillors Roger Hayes, Nicola Nardelli and John Sweeney represent Kingston Town on the Council. You can find their contact details below:\nCllr Roger Hayes\nBy phone: 07971 809 426\nBy email: Roger.Hayes@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Nicola Nardelli\nBy phone: 020 8547 5141\nBy email: Nicola.Nardelli@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr John Sweeney\nBy phone: 07702 300 167\nBy email: John.Sweeney@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_south-of-the-borough_hook-chessington-north/content_70.html": "Our team in Hook & Chessington North\nElected in May 2022, councillors Afy Afilaka and Sue Ansari; and elected in the By-election held in July 2024, Lorraine Dunstone currently represent Hook & Chessington North on the Council. You can find their contact details below:\nCllr Afy Afilaka\nBy phone: 07886 735 043\nBy email: Afy.Afilaka@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Sue Ansari\nBy phone: 07960 712 152\nBy email: Sue.Ansari@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Lorraine Dunstone\nBy phone: 07931 733 470\nBy email: lorraine.dunstone@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_lib-dems-on-kingston-council-call-for-proportional-representation/content_44.html": "Lib Dems on Kingston Council call for Proportional Representation\nLiberal Democrats in Kingston passed a motion at last night's Full Council meeting calling for the Government to implement Proportional Representation (PR) for Local Elections in England.\nNationally, the Lib Dems believe that voters deserve a fairer voting system, and dspite winning a majority under First Past The Post (FPTP) earlier this year, all Lib Dem Councillors backed the motion to bring a fairer voting system to our Borough in both local and national elections.\nThe motion, proposed by Cllr Liz Green and seconded by Cllr Andreas Kirsch, was based on the ‘Councils for PR’ motion, calling for PR in Parliamentary Elections, but added that we also need it for Local Elections in England, as they already have in Scotland, Northern Ireland and an option to adopt in Wales.\nLib Dem Leader of Kingston Council, Cllr Andreas Kirsch, said, “Earlier this year, Lib Dems won 44 out of the 48 Council seats here in Kingston, or 92%. Whilst we are delighted that so many residents voted for our positive messages at the election, we also remember that many voted for other parties and they deserve representation on the council too. We have no Labour or Green Party Councillors, despite around a fifth of residents voting for their candidates.”\nCllr Liz Green, who proposed this motion, added, “Frequently, Lib Dems are accused of only wanting PR as they cannot win under First Past The Post. So we want to be clear that even here in Kingston, where we win under the current system, we still believe in fairer voting and a more representative democracy.”\nThe motion also calls for a meeting to be set up so that all political parties that stand in Kingston council election can have a say on where we take this next and how we lobby the Government.\nTo see the full text of the motion click here.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_page-2/content_41.html": "Building a new leisure centre for Kingston\nLiberal Democrat councillors have successfully ringfenced £44 million for building our new leisure centre. Although construction prices have...\nLiberal Democrat councillors have successfully ringfenced £44 million for building our new leisure centre. Although construction prices have...\n🎅🎄Ed Davey MP was pleased to award the winners of his Christmas card competition, which had the theme of \"a Royal Christmas\". Ed and his team were...\nGreen Lane & St James ward by-election (10 Nov 2022) Sadly, our brilliant candidate, Mahmood Rafiq, was not elected this time. Full results 855...\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_new-old-malden_green-lane-st-james/content_63.html": "Our team in Green Lane & St James\nUnfortunately, there are currently no Liberal Democrat councillors representing in Green Lane & St James ward, with both seats held by Kingston Independent Residents Group. However, hard-working, local Lib Dem Ed Davey MP can still help with anything you need. You can find his contact details by clicking here.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_surbiton_st-marks-seething-wells/content_62.html": "Our team in St Mark's & Seething Wells\nElected in May 2022, councillors Liz Green, Diane White and Yogan Yoganathan represent St Mark's & Seething Wells on the Council. You can find their contact details below:\nCllr Liz Green\n(Mayor of the Royal Borough of Kingston upon Thames)\nBy phone: 020 8309 0318\nBy email: Liz.Green@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Diane White\nBy phone: 020 8339 9178\nBy email: Diane.White@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Yogan Yoganathan\nBy phone: 020 8390 5630\nBy email: Yogan.Yoganathan@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_kingston-north-kingston_coombe-hill/content_65.html": "Our team in Coombe Hill\nUnfortunately, no Liberal Democrat councillors were elected in May 2022, with two Conservatives representing Coombe Hill ward. However, hard-working, local Lib Dem Sarah Olney MP can still help with anything you need. You can find her contact details by clicking here.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_roadworks/content_3.html": "Sort out the roadworks!\nEd Davey and Gareth Roberts are campaigning for action from London's Mayor and national government for faster and fewer roadworks by utility companies and Transport for London (like the recent Tolworth roundabout works). They are calling for much better co-ordination - and higher fines for utility firms whose roadworks over-run. Back the campaign to increase how much utility companies can be fined for over-running works (currently capped at just £80 a day!)",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_surbiton_surbiton-hill/content_55.html": "Our team in Surbiton Hill\nElected in May 2022, councillors Alison Holt, Amir Ali Khan and Tom Reeve represent Surbiton Hill on the Council. You can find their contact details below:\nCllr Alison Holt (Deputy Leader of the Council)\nBy phone: 020 8399 4375\nBy email: Alison.Holt@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Amir Khan\nBy phone: 07512 665 463\nBy email: Amir.Khan@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Tom Reeve\nBy email: Tom.Reeve@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_kingston-north-kingston_canbury-gardens/content_64.html": "Our team in Canbury Gardens\nElected in May 2022, councillors Noel Hadjimichael and James Manthel represent Canbury Gardens on the Council. You can find their contact details below:\nCllr Noel Hadjimichael\nBy phone: 07599 890 134\nBy email: Noel.Hadjimichael@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr James Manthell\nBy phone: 020 8547 5141\nBy email: James.Manthel@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-campaigns_ulez-survey/content_23.html": "Ed Davey wants to hear your views on how ULEZ and how it has impacted you. Please fill in his survey by clicking the button below\nEd Davey wants to hear your views on how ULEZ and how it has impacted you. Please fill in his survey by clicking the button below",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_stopNIrise/content_24.html": null,
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_eddavey-mp_contact/content_36.html": "Constituency Surgeries\nBecause of the current high demand to meet Ed, appointments will need to be booked in advance. Please phone or email to make an appointment.\nConstituents are requested to provide their full name, address and contact details on all communications.\nKingston & Surbiton Office\nAddress: 21 Berrylands Road, Surbiton, KT5 8QX (visitors by appointment only)\nEmail: edward.davey.mp@parliament.uk\nPhone: 020 8288 2736\nPlease include your full name, address and contact details as this will help speed up a response.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_gp/content_47.html": "GP\nEd Davey and the Chessington Liberal Democrats are campaigning for investment in local GP premises- such as at the Orchard Practice. Back their campaign by filling in your details below…\nEd Davey and the Chessington Liberal Democrats are campaigning for investment in local GP premises- such as at the Orchard Practice. Back their campaign by filling in your details below…",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_surbiton_alexandra/content_53.html": "Our team in Alexandra\nElected in May 2022, councillors Peter Herlinger and Ian Manders represent Alexandra on the Council. You can find their contact details below:\nCllr Peter Herlinger\nBy phone: 020 8786 2154\nBy email: Peter.Herlinger@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Ian Manders\nBy phone: 07880 871 491\nBy email: Ian.Manders@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_surbiton_tolworth/content_67.html": "Our team in Tolworth\nElected in May 2022, councillors Mariana Goncalves, Thay Thayalan and Andrew Wooldridge represent Tolworth on the Council. You can find their contact details below:\nCllr Mariana Goncalves\nBy phone: 07826 807 385\nBy email: Mariana.Goncalves@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Thay Thayalan\nBy phone: 07741 283 136\nBy email: Thay.Thayalan@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Andrew Wooldridge\nBy email: Andrew.Wooldridge@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_breaking-cllr-cobbett-resigns-as-ward-councillor-for-green-lane-st-james/content_45.html": "Breaking: Cllr Cobbett resigns as ward councillor for Green Lane & St James\nLib Dem councillor, Tim Cobbett, has handed in his resignation to Kingston Council after working hard for local residents in New Malden since being first elected 2018.\nThe resignation comes after Cllr Cobbett took the difficult decision to take up a new role which will see him relocate away from New Malden and therefore be unable to serve local residents.\nKingston Council will now set out plans for a by-election to be held in Green Lane & St James, with an expected polling day in November. Kingston Liberal Democrats are due to announce their candidate to stand in this by-election in the near future.\nCllr Tim Cobbett said: \"Since having the honour of being re-elected in May, I’ve been working hard for local residents. Whether that’s helping to tackle fly-tipping along the Georgia Road underpass, working to secure new trees for Green Lane Rec or holding meetings with local community police to find a way to deter motorbikes being driven on cycle paths.\n\"I am so grateful to residents for supporting me in this work, and I am proud of being able to support local people as an active ward councillor, especially when helping residents through the difficult times we’ve all faced recently.\n\"I have built my career around helping people, and that included working as your local councillor, along with a number of paid part-time positions. Until recently this was fine, but I now find myself in a situation where my income isn’t high enough to continue living in New Malden, and therefore have had to look for other roles away from our area. It’s for this reason that I have taken the difficult decision to stand down as a local councillor.\"\nLiberal Democrat Leader of Kingston Council, Cllr Andreas Kirsch, added: \"Cllr Cobbett has been a true asset during his time being a councillor and will be sadly missed by us all. Whether working hard on behalf of local residents as their ward councillor, or being involved in the Lib Dem Group’s eadership team as Deputy Leader, Cllr Cobbett leave big shoes to fill. We wish him success in all his future endeavours.\n\"As many face a frightening rise in the cost of living thanks in large part to the actions of this Conservative Government, it’s important now more than ever for Liberal Democrats to represent and stand up for our community. I ask local residents to again put their trust in the Lib Dems in this upcoming by-election and help us send a message to the Prime Minister that she is out of touch with ordinary people here in New Malden.\"",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_eddavey-mp_annual-reports/content_10.html": "Annual Reports\nEd's report back to his constituents\nLatest Report\nBelow are links to the annual reports that Ed Davey sent to each house in the constituency during his time in office from 1997 to present.\n| Annual Report 2022 (pdf) | Annual Report 2021 (pdf) | Annual Report 2020 (pdf) |\n| Annual Report 2019 (pdf) | Annual Report 2018 (pdf) | Annual Report 2014 (pdf) |\n| Annual Report 2013 (pdf) | Annual Report 2012 (pdf) | Annual Report 2011 (pdf) |\n| Annual Report 2010 (pdf) | Annual Report 2009 (pdf) | Annual Report 2008 (pdf) |\n| Annual Report 2007 (pdf) | Annual Report 2006 (pdf) | Annual Report 2005 (pdf) |\n| Annual Report 2004 (pdf) | Annual Report 2003 (pdf) | Annual Report 2002 (pdf) |\n| Annual Report 2001 (pdf) | Annual Report 2000 (pdf) | Annual Report 1999 (pdf) |\n| Annual Report 1998 (pdf) |",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_20230308-new-leisure-centre-for-kingston/content_50.html": "Building a new leisure centre for Kingston\nLiberal Democrat councillors have successfully ringfenced £44 million for building our new leisure centre. Although construction prices have skyrocketed,labour shortages have grown worse, and council finances have faced a difficult blow following the Conservative government’s “mini budget”- the project is continuing, with sensible precautions taken to ensure value for money and protect local taxpayers.\nThe old leisure centre had reached its life end and seen repair costs rise sharply in its final years.\nLeader of Lib Dem councillors at Kingston, Andreas Kirsch said:\n“At the last election we promised a new leisure centre in Kingston. We are committed to delivering this for all residents- but we will not undermine Kingston’s finances in the process.\n“The surge in costs has caused delays- and means we need to continue to look at options for the new leisure centre. However, the money allocated for the leisure centre will continue to be ringfenced for that purpose, and I look forward to building work starting once we have found the right proposal.”",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_south-of-the-borough_chessington-south-malden-rushett/content_57.html": "Our team in Chessington South & Malden Rushett\nElected in May 2022, councillors Andreas Kirsch, Griseldis Kirsch and Sharukh Mirza represent Chessington South & Malden Rushett on the Council. You can find their contact details below:\nCllr Andreas Kirsch (Leader of the Council)\nBy phone: 07497 627 454\nBy email: Andreas.Kirsch@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Griseldis Kirsch\nBy phone: 07890 540 849\nBy email: Griseldis.Kirsch@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Sharukh Mirza\nBy phone: 020 3380 9504\nBy email: Sharukh.Mirza@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-campaigns/content_6.html": "What we're campaigning on\nLib Dems in Kingston are campaigning hard for local residents. Take a look at our current campaigns below and click find out more.\nLib Dems in Kingston are campaigning hard for local residents. Take a look at our current campaigns below and click find out more.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_at-city-hall/content_33.html": "Lib Dems on the London Assembly\nWe have two Assembly Members on the London Assembly, Hina Bokhari and Gareth Roberts, based at City Hall in the Docklands. They work hard to hold the Mayor of London to account on behalf of people across London.\nWe have two Assembly Members on the London Assembly, Hina Bokhari and Gareth Roberts, based at City Hall in the Docklands. They work hard to hold the Mayor of London to account on behalf of people across London.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_cctv/content_27.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news/content_16.html": "Hook & Chessington North By-election result\nCongratulations Lorraine Dunstone!\nCongratulations Lorraine Dunstone!\nEd is re-elected!\nLorraine Dunstone - your Lib Dem candidate\nLiberal Democrat councillors have successfully ringfenced £44 million for building our new leisure centre. Although construction prices have...\n🎅🎄Ed Davey MP was pleased to award the winners of his Christmas card competition, which had the theme of \"a Royal Christmas\". Ed and his team were...\nGreen Lane & St James ward by-election (10 Nov 2022) Sadly, our brilliant candidate, Mahmood Rafiq, was not elected this time. Full results 855...\nSt Marks and Seething Wells Liberal Democrat Councillors working with Kingston Council are forcing the owners of Seething Wells Filter Beds to clean...\nLocal residents and community champion, Mahmood Rafiq, has been selected by Liberal Democrats in New Malden to be their candidate in the upcoming by-election\nLib Dem councillor, Tim Cobbett, has handed in his resignation to Kingston Council after working hard for local residents in New Malden since being first elected 2018.\nWith the sad passing of Her Majesty Queen Elizabeth II, Kingston Liberal Democrats join residents across the Royal Borough of Kingston upon Thames in this time of mourning, and our thoughts are with the Royal Family at this time.\nLiberal Democrats in Kingston passed a motion at last night's Full Council meeting calling for the Government to implement Proportional Representation (PR) for Local Elections in England.\nLiberal Democrats in New Malden Village have thanked local residents after they backed the team of Mark Durrant, Lesley Heap and Robert Kim in the delayed election.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_in-parliament/content_46.html": "Lib Dems in the House of Commons\nWe're proud that both Parliamentary constituencies within the Royal Borough of Kingston upon Thames are represented by hard-working, Liberal Democrat MPs, Ed and Sarah and Paul.\nWe're proud that both Parliamentary constituencies within the Royal Borough of Kingston upon Thames are represented by hard-working, Liberal Democrat MPs, Ed and Sarah and Paul.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_new-old-malden_coombe-vale/content_61.html": "Our team in Coombe Vale\nElected in May 2022, councillors Andrew Bolton and Andy Sillett represent Coombe Vale on the Council. You can find their contact details below:\nCllr Andrew Bolton\nBy phone: 07856 049 370\nBy email: Andrew.Bolton@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Andy Sillett\nBy email: Andrew.Sillett@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_202405-hook-chessington-north-by-election/content_14.html": "Hook & Chessington North By-election\nSteph Archer has resigned as a councillor in Hook & Chessington North ward, having moved away with her family.\nWe thank Steph for serving the community with passion and dedication, and we wish her and the family well in their new home.\nHer departure means there will be a Ward by-election on the same day as the General Election, 4th July 2024.\nWe are delighted that Lorraine Dunstone has been selected as the Lib Dem candidate.\nLorraine lives locally with her family and has a strong track record of serving our community.\nAs a councillor in the previously named Tolworth and Hook Rise Ward, Lorraine:\n✅ organised commuity clean ups of flytipping and litter;\n✅ secured extra parking for residents;\n✅ took on TfL when they were ignoring local people;\n✅ during the Covid pandemic, set up “street foodbanks” which were taken up borough wide.\nShe is now Chair of a Local Police Panel and helps young people as head chaperone of a local dance school.\nIn her professional life, Lorraine is a team leader and office manager for a business.\nLorraine said “I love this community - my home. As your councillor I will fight for a new direct regular bus service from Chessington to Epsom Hospital and investment in local GP surgeries (like Orchard Practice, where I was once the practice manager) and for more regular patrols by PCSOs. I’m also working to make the area safer - such as by getting a barrier to protect pedestrians on North Parade.”\n“If you’d like to raise an issue or concern - or would like my help please do email me on lorrainedunstone1@gmail.com, and I will work hard to get it sorted.”\nFor a real local champion, vote for Lorraine on 4th July!",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council/content_49.html": "Lib Dems on Kingston Council\nWe are proud that we continue to control Kingston Council after the 2022 Local Elections, with 42 Lib Dem Councillors elected (out of 48). Your Liberal Democrat Councillors are working hard all year round for Royal Borough of Kingston upon Thames. If you have any local issues, please get in touch with them.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_lib-dems-win-in-delayed-new-malden-village-election/content_31.html": "Lib Dems Win in Delayed New Malden Village Election\nLiberal Democrats in New Malden Village have thanked local residents after they backed the team of Mark Durrant, Lesley Heap and Robert Kim in the delayed election.\nThe final poll in this year's round of local elections was delayed until June after an independent candidate in New Malden Village sadly passed away during the campaign.\nControl of Kingston Council is firmly with the Liberal Democrats after they won a total of 44 out of 48 councillors in this year's round of local elections, with residents in all but one ward represented by at least one Lib Dem.\nTo find out more about all our elected representatives and campaigners in your area, please click here.\nCllr Andreas Kirsch, Lib Dem Leader of Kingston Council, said, \"Thanks to residents in New Malden Village backing our strong, local team of Mark, Lesley and Robert, Liberal Democrats in Kingston have had our best ever results. We've already started working hard to deliver our vision of a fairer, greener, safer Borough.\"\nThe full breakdown of results from Thursday, 5 May is available on Kingston Council's website here, with New Malden Villages' results from Thursday 21 June avaiable here.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_page-3/content_15.html": "Success as owners of Seething Wells Filter Beds are forced to repair the railings\nSt Marks and Seething Wells Liberal Democrat Councillors working with Kingston Council are forcing the owners of Seething Wells Filter Beds to clean...\nSt Marks and Seething Wells Liberal Democrat Councillors working with Kingston Council are forcing the owners of Seething Wells Filter Beds to clean...\nLocal residents and community champion, Mahmood Rafiq, has been selected by Liberal Democrats in New Malden to be their candidate in the upcoming by-election\nLib Dem councillor, Tim Cobbett, has handed in his resignation to Kingston Council after working hard for local residents in New Malden since being first elected 2018.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_surbiton_berrylands/content_66.html": "Our team in Berrylands\nElected in May 2022, councillors Jackie Davies and Anita Schaper represent Berrylands on the Council. You can find their contact details below:\nCllr Jackie Davies\nBy email: Jackie.Davies@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Anita Schaper\nBy phone: 07719 605 604\nBy email: Anita.Schaper@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_20221110gls-byelection-results/content_18.html": "By-election in Green Lane & St James ward - Results\nGreen Lane & St James ward by-election (10 Nov 2022)\nSadly, our brilliant candidate, Mahmood Rafiq, was not elected this time.\nFull results\n855 KIRG\n647 Mahmood Rafiq (Liberal Democrats)\n265 Labour\n78 Conservatives\n40% Turnout\nWe would like to thank Mahmood for his hard work throughout this campaign. A huge thank you to our voters, and everyone who campaigned for Green Lane & St James ward over the past few weeks to help Lib Dems.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_page-1/content_42.html": "Hook & Chessington North By-election result\nCongratulations Lorraine Dunstone!\nCongratulations Lorraine Dunstone!\nEd is re-elected!\nLorraine Dunstone - your Lib Dem candidate\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_schoolmeals/content_29.html": "Ed Davey's free school meal campaign\nUnder the Conservatives’ cost of living crisis, many school children are going hungry. Ed Davey is campaigning to expand free school meals to all primary school children across England, properly funded. Back his campaign below",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_kingston-north-kingston_norbiton/content_60.html": "Our team in Norbiton\nElected in May 2022, councillors Emily Davey, Susan Skipwith and Olly Wehring represent Norbiton on the Council. You can find their contact details below:\nCllr Emily Davey\nBy phone: 07810 477 086\nBy email: Emily.Davey@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Susan Skipwith\nBy phone: 07521 648 305\nBy email: Susan.Skipwith@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Olly Wehring\nBy phone: 07919 620 567\nBy email: Olly.Wehring@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_hook-chessington-north-by-election-result/content_11.html": "Hook & Chessington North By-election result\nKLD\n5 Jul 2024\nLORRAINE DUNSTONE (Liberal Democrats): 2278 --- Elected\nGIA BORG-DARCY (Conservative): 1293\nKEZIA ELIZABETH COLEMAN (Labour): 773\nLUCY HOWARD (Green): 434\nLORRAINE DUNSTONE (Liberal Democrats): 2278 --- Elected\nGIA BORG-DARCY (Conservative): 1293\nKEZIA ELIZABETH COLEMAN (Labour): 773\nLUCY HOWARD (Green): 434",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team/content_37.html": "Our Team\nWe're so proud to represent residents on Kingston Council, in the House of Commons and on the London Assembly, thanks to the support of local people across our Borough. Click below to find out more about our team, as well as how to contact them.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_eddavey-mp_campaigns/content_17.html": "What we're campaigning on\nLib Dems in Kingston are campaigning hard for local residents. Take a look at our current campaigns below and click find out more.\nLib Dems in Kingston are campaigning hard for local residents. Take a look at our current campaigns below and click find out more.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_search/content_26.html": "Lib Dems in the House of Commons We're proud that both Parliamentary constituencies within the Royal Borough of Kingston upon Thames are represented by hard-working, Liberal Democrat MPs, Ed and…\nLOCAL CHAMPION ED DAVEY Kingston, Surbiton, New Malden, Norbiton, Hook, Chessington, Berrylands and Tolworth. Ed improves our local NHS As our MP, Ed won investment in Kingston Hospital's A&E…\nEd Davey MP First elected in 1997, with a majority of just 56 votes, Ed has worked hard to stand up for residents in the Kingston & Surbiton constituency for over 25 years. In 2015, he lost…\nConstituency Surgeries Because of the current high demand to meet Ed, appointments will need to be booked in advance. Please phone or email to make an appointment. Constituents are requested…",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_kingston-victory-fund/content_25.html": "Join the Kingston Victory Fund and help us win!\nBy signing up to a regular donation of £10, £20 or £50 a month, you can help us beat the Conservatives at the next election and win for our community.\nHelp us Win",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_ednewsletter-1/content_34.html": "Ed Davey's newsletter\nSign up to Ed's regular newsletter for updates about his work and local news. You'll also receive occasional news from your local councillors.\nSign up to Ed's regular newsletter for updates about his work and local news. You'll also receive occasional news from your local councillors.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_page-4/content_32.html": "Statement on Her Majesty Queen Elizabeth II\nWith the sad passing of Her Majesty Queen Elizabeth II, Kingston Liberal Democrats join residents across the Royal Borough of Kingston upon Thames in this time of mourning, and our thoughts are with the Royal Family at this time.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_new-old-malden_old-malden/content_56.html": "Our team in Old Malden\nElected in May 2022, councillors Mike Massimi and Elizabeth Park represent Old Malden on the Council. You can find their contact details below:\nCllr Mike Massimi\nBy email: Mike.Massimi@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Elizabeth Park (Deputy Mayor of the Royal Borough of Kingston upon Thames)\nBy phone: 07500 801 113\nBy email: Elizabeth.Park@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_eddavey-mp_about/content_30.html": "Ed Davey MP\nLiberal Democrat MP for Kingston & Surbiton\nFirst elected in 1997, with a majority of just 56 votes, Ed has worked hard to stand up for residents in the Kingston & Surbiton constituency for over 25 years.\nIn 2015, he lost his seat in the Commons, but in 2017, he won it back from the Conservatives. And in the most recent General Election (2019) he secured his second highest majority.\nIn 2020, he became Leader of the Liberal Democrats and more recently, he has overseen the party's three Parliamentary by-election victories: Chesham & Amersham; North Shropshire, and; Tiverton & Honiton.\nIn addition to Kingston and Surbiton, the constituency also covers: Berrylands, Chessington, Hook, Malden Rushett, New Malden, Norbiton, Old Malden and Tolworth.\nRead Ed's full biography here.\nEd as Leader of the Liberal Democrats.\nContact Ed\nLib Dem Member of Parliament for Kingston & Surbiton\nBy phone: 020 8288 2736\nBy email: edward.davey.mp@parliament.uk\nBy post: Ed Davey MP, 21 Berrylands Road, Surbiton KT5 8QX\nTwitter: @EdwardJDavey\nFacebook: fb.com/edwardjdavey",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-campaigns_save-seething-wells-filter-beds/content_40.html": "Save Seething Wells Filter Beds\nWorking hard to save Seething Wells Filter Beds\nOver the past 20 years, we've been campaigning hard to protect Seething Wells Filter Beds from habitat distraction, and find new ways for the space to be used for the benefit of local people.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_kingston-north-kingston_tudor/content_54.html": "Our team in Tudor\nElected in May 2022, councillor Patrick Hall represents Tudor ward on the Council, along with an Independent councillor (originally elected as a Conservative).\nCllr Patrick Hall\nBy phone: 07534 242 681\nBy email: Patrick.Hall@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_eddavey-mp_local-champion-ed-davey/content_20.html": "LOCAL CHAMPION ED DAVEY\nTHE CAMPAIGNER WHO GETS RESULTS FOR…\nKingston, Surbiton, New Malden, Norbiton, Hook, Chessington, Berrylands and Tolworth.\nEd improves our local NHS\nAs our MP, Ed won investment in Kingston Hospital's A&E and maternity unit, and campaigned for the current rebuild of Tolworth Hospital.\nHe helped start a new service to support family carers at Kingston Hospital, and has been a strong national champion for carers.\nEd's led campaigns for more investment in local NHS dentists and GPs - from the proposed new surgery in Norbiton to GP-led health centres built in Surbiton and Chessington.\nEd wins investment in our borough\nEd has championed our local economy - from helping establish Kingston First 20 years ago - one of the country's first Business Improvement Districts - to backing Unilever building their new Global HQ here.\nHis campaigns for better CCTV and more police have helped tackle crime, and his campaigns have seen disabled access installed in stations from Surbiton to Chessington South, New Malden to Kingston.\nEd fights for us in and out of Parliament\nEd works hard all year round for us - holding two advice surgeries a week and helping thousands of people locally with their issues.\nIn Parliament he’s raised our concerns - such as challenging the Prime Minister over the shortage of NHS dentists.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-campaigns_cost-of-living-crisis/content_35.html": "Calling for more support for people during the cost of living crisis\nWe know that this winter, residents are likely to face the biggest cost of living crisis in a generation. That's why we're calling on the Conservative Government to extend support for residents and businesses in Kingston Borough.\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_kingston-north-kingston_kingston-gate/content_68.html": "Our team in Kingston Gate\nElected in May 2022, councillors Sabah Hamed, Anne Owen and Farshid Sadr-Hashemi represent Kingston Gate on the Council. You can find their contact details below:\nCllr Sabah Hamed\nBy phone: 07768 160 023\nBy email: Sabah.Hamed@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Anne Owen\nBy email: Anne.Owen@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Farshid Sadr-Hashemi\nBy phone: 07308 918 815\nBy email: Farshid.Sadr-Hashemi@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_20221100success/content_51.html": "Success as owners of Seething Wells Filter Beds are forced to repair the railings\nSt Marks and Seething Wells Liberal Democrat Councillors working with Kingston Council are forcing the owners of Seething Wells Filter Beds to clean up the site and repair the railings.\nLast year, Kingston Council issued a section 215 notice requiring Cascina, which owns the site, to generally tidy the site and fully repair the railings along Portsmouth Road. Cascina appealed to the magistrates court.\nKingston Council officers defended the need for these improvements, and Cllr Liz Green gave written evidence of the public's opinion as part of the action taken by the council.\nThe magistrates not only agreed that the tidying up and repairing the railings must be done, but also ordered that Cascina pay £12,000 towards the Council's costs.\nThe magistrates did modify the notice slightly, particularly the timescale for action. Cascina now has 6 months to do the majority of the work, with the reminder within the year.\n“Whilst we recognise that there is much more to be done to get this site to be the wildlife haven that we and most residents want, it is a step in the right direction,” says Cllr Liz Green. “We will keep working, doing everything in our power, to stop their destruction of the site.”\n“I'm delighted that the magistrates have found in favour of the Council's action in issuing the section 215 notice,” adds Cllr Diane White, local resident in the river roads. “This is the entrance to our borough, and their neglect of the railings gives a poor show of our Royal Borough.”\n“I look forward to seeing the repaired and repainted railings,” added Cllr Yogan Yoganathan.\nFor full details of the amended notice, please see Kingston council website here.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk/content_7.html": "Hook & Chessington North By-election result\nCongratulations Lorraine Dunstone!\nCongratulations Lorraine Dunstone!\nEd is re-elected!\nLorraine Dunstone - your Lib Dem candidate\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_yourpriorities/content_48.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_general-election-2024-results/content_12.html": "General Election 2024 Results\nKingston and Surbiton Constituency Parliamentary Election Result\nEd Davey (Liberal Democrats): 25,870 --- Elected\nHelen Edward (Conservative): 8,635\nEunice O'Dame (Labour): 6,561\nMark David Fox (Reform UK): 4,787\nDebojyoti Das (Green): 3,009\nYvonne Tracey (Kingston Independent Residents): 1,177\nAli Abdulla (Workers Party): 395\nJason Chinnery (The Official Monster Raving Loony Party): 230\nFor more details, go to Kingston Council's website.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_epsom-bus/content_5.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.\nWe will include your name and address/postcode when submitting and sharing the petition with TfL, Surrey county council.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_station-access/content_8.html": "Better disabled access for Tolworth and Berrylands\nEd Davey and the Lib Dems have campaigned successfully for funds to provide disabled access at the rear of Surbiton station - and are pressing for work to start as soon as possible. Building on this success, they are pressing Ministers and rail bosses for disabled access at Tolworth and Berrylands stations. Back the campaign below",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_bankbranches/content_39.html": "New Malden Bank Branches\nDespite a growing population and thousands of visitors, New Malden has lost bank branches. We call on Nationwide to rule out any closure or reduction in hours for their New Malden branch, and urge other retail banks to look at opening branches locally to improve provision for people here.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_our-team_on-kingston-council_new-old-malden_motspur-park-old-malden-east/content_59.html": "Our team in Motspur Park & Old Malden East\nElected in May 2022, councillors Lynn Henderson and Richard Thorpe represent Motspur Park & Old Malden East on the Council. You can find their contact details below:\nCllr Lynn Henderson\nBy phone: 020 8241 9320\nBy email: Lynn.Henderson@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU\nCllr Richard Thorpe\nBy phone: 020 8241 9320\nBy email: Richard.Thorpe@kingston.gov.uk\nBy post: Liberal Democrat Group Office, Guildhall, High Street, Kingston upon Thames KT1 1EU",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_save-our-213/content_4.html": "Reverse cuts to the 213 bus service!\nThe Mayor of London has cut a total of 26 buses a day from the 213 bus service. The popular route, which connects Old Malden, New Malden, Worcester Park and Sutton to Kingston, is used by 15,000 local people every day. Sadiq Khan has broken his promise to expand bus routes in outer London – he is doing the exact opposite here in Kingston. Sign the petition below to reverse the 213 bus cuts:",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_news_article_mahmood-rafiq-selected-as-candidate-in-upcoming-by-election/content_58.html": "Mahmood Rafiq selected as candidate in upcoming by-election\nLocal residents and community champion, Mahmood Rafiq, has been selected by Liberal Democrats in New Malden to be their candidate in the upcoming Green Lane & St James by-election.\nThe by-election was called after Lib Dem councillor Tim Cobbett resigned after he took the difficult decision to take up a new role which will see him relocate away from New Malden and therefore be unable to serve local residents.\nMahmood Rafiq has lived on Bodley Road for twelve years with his wife, raising their family in New Malden. His children attended Burlington School and Malden Manor School, and Mahmood is a local school governor as well.\nMahmood Rafiq said, \"Our family has called New Malden home for over 12 years. It’s where my wife and I have raised our family, and where our children grew up and went to schools. We are so fortunate to live in this area and I am proud to be an active part of our community.\n\"But there are issues local people continue to face, and challenges we need to overcome together, to make our part of New Malden even better: Investing in and building new schools, tackling catalytic converter and car theft and calling for more local GP appointments.\n\"That’s why I am excited to be standing for the Liberal Democrats in the upcoming by-election to continue the hard work of former ward councillors Tim Cobbett and Simon Edwards.\"\nResidents will head to the polls on Thursday, 10 November, with postal votes expected to start landing on Saturday, 22 October. More information is available on Kingston Council's dedicated webpage for the by-election.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_donate/content_13.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_nhsplan/content_22.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_kingstonlibdems_org_uk_eddavey-mp/https_www_kingstonlibdems_org_uk_contact-us/content_43.html": "Contact your local team\nOur team of Councillors and candidates across Kingston are working hard for you all year round. Find out how to contact them using the details below.\nKingston Lib Dems\nBy email: hello@kingstonlibdems.org.uk\nBy post: Kingston Liberal Democrats, 21 Berrylands Road, Surbiton KT5 8QX\nWant to email your local Council team? Click here to find out who represents you.\nWill you volunteer for Kingston Liberal Democrats? Sign up here today."
}