{
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_about-us_esther-sutton/content_59.html": "Esther Sutton – Green Party Councillor in Fairfield\nEsther Sutton is Croydon born and bred. She has raised two children here while running her own business. As Landlady of The Oval Tavern, chair of Croydon Pubwatch, and a director of Made In Croydon, Esther has a well-deserved reputation for supporting local performers, local businesses, and community events.\nEsther is a founder member of Croydon Pride and has helped deliver both the Pride event and the Croydon Mela – bringing thousands of people together to celebrate the wonderful diversity of the borough.\nEsther has been campaigning on Green issues for over thirty years and knows that we need to act urgently to tackle the Climate Emergency and loss of biodiversity. She will work to achieve positive changes to ensure we address this crisis at a local and national level.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_streatham-and-croydon-north/content_27.html": "Scott Ainslie is our General Election candidate for Streatham & Croydon North 14 March 2024 / 16 June 2024 by The Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North. Read more » announcement candidate croydon general election lambeth streatham and croydon north",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2025_04_15_peter-underwood-for-mayor-of-croydon-2/content_56.html": "Croydon Green Party is delighted to announce that Peter Underwood has been selected as our candidate for Mayor of Croydon.\nThe Green Party is the clear challenger to the failing Conservative and Labour parties.\nAt the general election last year, the Green Party got the third most votes in Croydon. Our vote went up more than any other party while votes for both Conservatives and Labour went down. You know you deserve better than more misery under Labour or Conservatives and that’s why you need to vote Green at the next election.\nPeter was chosen as our candidate for Mayor as he has a long track record of working as part of the community to make Croydon a better place to live. His professional experience also means Peter can get on with tackling the dysfunctional Council and get it back on the road to serving the public.\nThe Green Party campaigned against have a Mayoral system because we don’t think all that power should be put in one person’s hands. The last four years have provided plenty of evidence of why this dictatorship style of leader is not what we want.Voting Green is also the first step to getting rid of the wasteful Mayor system and moving to the committee system used in better performing Councils. Peter’s commitment to work with residents and community groups mean that voting Green is the best way to truly put power back in the hands of the people of Croydon.\nPeter’s key aims as Mayor\nI know people in Croydon have had enough of the Conservative and Labour parties who have worked together to ruin our borough.\nWe desperately need a change for the better and that’s what the Greens are offering.\nI believe that the only way we are going to make Croydon better is by working together. I stand against those politicians who stir up division and hatred. I stand against those politicians who only want to help some people and make life worse for others. I want to bring our communities together to make life better for all of us.\nI also believe we need to bring honesty back into politics, you deserve politicians you can trust. We all know the dreadful state Croydon is in and so I’m not going to make the sort of fake promises and false claims we’ve all heard before from other candidates.\nI will make clear promises that you can rely on:\n- I will fight for fair funding for Croydon and work with other Councils to put pressure on the Government to provide the money we need to keep the Council running\n- I will change the way Croydon Council is run to cut the amount of money wasted on consultants, too many senior staff, and senior Councillor allowances, and put that money back into employing front line staff and delivering the services we actually need\n- I won’t just claim to be listening to residents, I will be actively involving residents in the decision-making process. I will be inviting community representatives and people who have the experience of using Council services to help develop new ideas, help make decisions, and become part of the whole process of improving the way the Council works.\nI don’t believe that one person has all the answers and so I will be working with our brilliant Councillors Ria Patel and Esther Sutton, and the other fantastic Green candidates who will be standing for election all over Croydon to truly make this a people’s campaign. I intend to be a Mayor who truly works with the people of Croydon and for the people of Croydon.\nWe have suffered for too long under the Conservatives and Labour. If you vote for those same old parties, you will just get the same old politics.\nYou know you deserve better and that’s why this time you need to vote Green.\nAbout Peter\nPeter has lived in Croydon for over twenty years and is very active in his local community. He is on the committee of his Residents’ Association and his local woodland Friends group. He is a former chair of Croydon Friends of the Earth and was also a member of the Croydon Climate Crisis Commission.\nPeter was brought up in the midlands of England, the son and grandson of coal miners and car factory workers. Peter went to his local comprehensive school and, despite becoming homeless when he was 17 years old, successfully gained a place at Oxford University where he studied Philosophy and Psychology. Peter also has a Master’s degree in Business Administration.\nPeter spent the first half of his career working in the civil service. He started off offering benefits advice in Croydon and over the years moved through many different government roles and promotions to end up leading the team that wrote the UK’s renewable energy strategy. He has worked in both the UK Parliament and the European Parliament.\nFor the last ten years Peter worked for environment conservation charities, working to support volunteers looking after our local parks and woodlands as well as working on large rewilding projects in Scotland. People is also currently a trustee of a charity that aims to improve planning rules and our living environments across London.\nPeter has been active in the Green Party for over ten years and spent over four years as a member of the Green Party governing body. Peter has also represented the Green Party of England and Wales at European conferences.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_category_announcements_page_2/content_60.html": "Skip to content\nSkip to footer\nSutton & Croydon\nMenu\nAbout\nOur Councillors\nGet Involved\nNews\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nAnnouncements\nAnnouncements\nOur 2022 Manifesto for Croydon\n8 November 2021\n/\n16 June 2024\nby\nnicholasburmanvince\nRead more »\nannouncement\ncroydon\nTo top",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_11_14_elaine-denise-garrod-is-our-general-election-candidate-for-croydon-south/content_36.html": "Croydon and Sutton Green Party are delighted to announce that Elaine Denise Garrod has been selected as our General Election candidate for the seat of Croydon South.\nElaine said:\n“I am really pleased to be selected to stand for the Green Party in Croydon South, to offer people realistic hope for the future.\nOver recent years we’ve seen our country run into the ground – bills rising, businesses failing, and underfunded public services falling apart when we need them most.\nAs the COVID enquiry progresses we can see how the Conservative Government failed us when we needed them to be dealing with the pandemic. Sadly they are also completely failing us as we face the climate and ecological emergency that threatens the future of humanity.\nBut just getting the Conservatives out isn’t enough. The other parties are only offering tinkering around the edges, not real solutions to the problems we face.\nThat’s why I’m so proud of our Green New Deal policies. We are putting forward plans that not only tackle the climate emergency, they support small businesses, bring public services back into public hands, put money back into the local economy and back into people’s pockets. Our Green New Deal would make us a world leader in delivering a sustainable economy, an example to others and a country to be proud of.\nWe deserve better than the Government we have had, and we deserve better than the no-change options offered by the other opposition parties. If you want better, it’s time to vote for it. This time, vote Green.”\nAbout Elaine\nElaine was brought up in in Croydon and has lived here most of her life.\nElaine has worked in both public and private sector during her career and she has run her own business. She currently works for an advisory and financial services firm that is focussed on helping business and capital accelerate the transition to net zero.\nElaine has taken part in a variety of voluntary community work including helping long-term unemployed people with their CVs and job interview techniques; helping women new to this country to learn English; and working with a national charity tutoring disadvantaged GSCE pupils.\nIn Croydon Elaine has been involved in a number of projects to improve our environment. She led work setting up the ‘Bee World’ garden at Heathfield House and recently helped fundraise for the Trees4Croydon scheme to get more trees planted in our streets and green spaces.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_category_newsletters/content_62.html": "30 April 2023 / 16 June 2024 by\nRead all about what Fairfield's Green councillors have been up to in the Spring Update newsletter.\nRead more »",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2024_04_08_nicholas-burman-vince-is-our-by-election-candidate-for-woodside/content_26.html": "Croydon Green Party are delighted to announce that Nicholas Burman-Vince will be our candidate for the Woodside by-election for Croydon Council on 2nd May.\nNicholas said:\n“Sometimes it feels overwhelming when I look at politicians who ignore those who they’re supposed to support, who demonise minorities, and who simply ignore the dramatic changes in our environment.\nUnder the two parties who have run the Council, we’ve seen disappearing bus stops, major failings in financial management at Croydon Town Hall, squandered opportunities to support local arts groups during the Year of Culture and all we hear is, “It’s the other one’s fault”.\nI joined the Green Party in September 2020 as I wanted to work locally to tackle the issues facing us, as I believe locally is where lasting change happens. I’d also realised that just shouting at the TV wasn’t helping anyone.\nThere are solutions to the problems we face, from insulating our homes, allowing small groups and schools to generate electricity from solar panels – to sell to the grid – and more public transport to help clean our air. All the solutions will boost wealth and health.\nWe need Councillors who will listen to residents and work wholeheartedly to hold the Mayor of Croydon to account and that’s what I want to do. But it isn’t just about criticizing the other parties, I also believe in dialogue to work out the best solution for local people.\nVoting for the Green Party means a vote for equality, sensible solutions, and our environment.”\nAbout Nicholas\nNicholas has lived with his husband in Woodside for 17 years.\nHe is an actor, author and film maker. As an actor he’s best known for his role as the Chatterer Cenobite in Clive Barker’s Hellraiser. In 2023, his autobiographical drama documentary about the creation of that role and an examination of the monstrous, I Am Monsters!, premiered at the Empire Leicester Square. He’s written numerous short stories and is currently completing a third volume and planning his first novel.\nHis other career (undertaken when acting and writing didn’t pay the bills) was in computers, working as a database manager – involved in database design and support – for sixteen years at a major address and financial data management company. He learned there how technology can be used properly to make work easier for users and more efficient. He also saw how money can be wasted on poorly planned and implemented systems.\nHe has served as the Secretary and data manager for Sutton and Croydon Green Party since January 2021. You may also learn more about him on his website: https://www.nicholasvince.com",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_sutton-cheam/content_34.html": "Aasha Anam is our General Election candidate for Sutton & Cheam 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Aasha Anam has been selected as our General Election candidate for the constituency of Sutton and Cheam. Aasha said: “We all know that politics is broken and we deserve far better. So I joined the Green Party to ‘be the change I want to see’. […] Read more » announcement candidate general election sutton sutton & cheam",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_sutton/content_51.html": "Aasha Anam is our General Election candidate for Sutton & Cheam 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Aasha Anam has been selected as our General Election candidate for the constituency of Sutton and Cheam. Aasha said: “We all know that politics is broken and we deserve far better. So I joined the Green Party to ‘be the change I want to see’. […] Read more » announcement candidate general election sutton sutton & cheam\nTracey Hague is our General Election candidate for Carshalton & Wallington 5 June 2024 / 16 June 2024 by Sutton & Croydon Green Party are delighted to announce that Tracey Hague has been selected as our General Election candidate for the seat of Carshalton and Wallington. Tracey said: “I am pleased to have been selected again to stand for the Green Party in Carshalton and Wallington. I know people in this area have really […] Read more » announcement candidate Carshalton & Wallington general election sutton",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_croydon-east/content_54.html": "Peter Underwood is our General Election candidate for Croydon East 24 October 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Peter Underwood has been selected as our General Election candidate for the new seat of Croydon East. Peter said: “I am so pleased to be selected as the candidate for the area where I live. I’m proud to be standing for the Green Party to […] Read more » announcement candidate croydon croydon east general election",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2024_03_14_scott-ainslie-is-our-general-election-candidate-for-streatham-and-croydon-north/content_25.html": "The Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North. Recent polling by the Daily Mirror showed the Green Party in second place to Labour in this constituency.\nScott said:\n“It is a great honour to be selected as the candidate for Streatham and Croydon North where I live and have brought up my children.\nI have been a Lambeth councillor since 2014, being re-elected twice in 2018 and in 2022, where the Green Party secured 22% of the vote across the borough. For the past two years I have been co-leader of the Lambeth Green Group of councillors.\nAs a councillor over the past ten years, I have fought tooth and nail for local residents, often putting myself between those who need protecting and the authorities. For example, I occupied vulnerable people’s homes to prevent bailiffs evicting residents; I have led from the front in organising campaigns to stop demolition of council estates; I was one of the founders of Hands Off Our Common, which prevented a private takeover of public land. I have been a constant ally of the survivors of child abuse in Lambeth’s Children’s Homes. I have also successfully worked cross-party to pass the landmark motion on colonial enslavement. This led to The Green Party being the first British political party to commit to reparatory justice and helped lead to the establishment of the first ever all-party parliamentary group on Afrikan Reparations.\nIn May 2019, I was overjoyed to be elected as London’s Green Member of the European Parliament, where I was able to stand up vociferously for social and environmental justice at an international level and defend democracy and persecuted peoples across the world. (Full details: https://scottainslie.green/index_old.html)\nAll the other parties have had their chances and failed to end child poverty, to insulate people’s homes so they do not have to choose between heating and eating, to protect and invest in our public services, to protect our food crops and planet. It’s time they moved over and gave the Green Party a chance. We understand, at our core, that economic, racial, social, gender and climate justice are intersectional and structurally entangled, and that there must be equity and justice for all.\nMy mum brought up my sister and me in a council tower block. The lived experience of this has never left us. It is this humblest of starts in life that drives my quest for social, environmental, racial, and economic justice and what makes me a formidable advocate for all.”\nAbout Scott\nScott has lived in Streatham for over twenty-seven years and he was one of the founding members of Sustainable Streatham, Hands Off Our Common and whist serving on the Streatham Action committee, he helped establish the Streatham Action Transport Group.\nOriginally from Edinburgh, where he stayed until he completed his degree in Business Studies at Edinburgh Napier University, Scott came to London to pursue his passion for acting. He won a scholarship to study drama at the Mountview Academy of Theatre Arts and became a professional actor in 1994.\nHe has two grown up daughters, and his concern for their future has helped to fuel his fight to take serious action on climate and ecological breakdown.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_10_24_peter-underwood-is-our-general-election-candidate-for-croydon-east/content_35.html": "Croydon and Sutton Green Party are delighted to announce that Peter Underwood has been selected as our General Election candidate for the new seat of Croydon East.\nPeter said:\n“I am so pleased to be selected as the candidate for the area where I live. I’m proud to be standing for the Green Party to bring some honesty, decency, and humanity back into politics.\nWe are facing a cost of living crisis, a climate crisis, and a crisis of politics that has become swamped in lies and corruption. The Green Party is the only party with solutions to all of those – caring about people, caring about our environment, and caring about trust.\nWe have suffered for too long under the current Government and the polling shows that the Conservatives are certainly not going to win this time.\nIn Croydon we have also suffered under Labour. They’ve become a party that cares more about success for itself than improving the lives of people they are supposed to serve.\nIf you keep voting for those same old parties, you’ll just get the same old politics.\nWe deserve better and if you want better you have to vote for it. That’s why I’m telling everyone that this time you need to vote Green.”\nAbout Peter\nPeter has lived in Croydon for over twenty years and is very active in his local community. He is on the committee of his Residents’ Association and his local woodland Friends group. He is a former chair of Croydon Friends of the Earth and was also a member of the Croydon Climate Crisis Commission.\nPeter was brought up in the midlands of England, the son and grandson of coal miners and car factory workers. Peter went to his local comprehensive school and, despite becoming homeless when he was 17 years old, successfully gained a place at Oxford University where he studied Philosophy and Psychology. Peter also has a Master’s degree in Business Administration.\nPeter spent the first half of his career working in the civil service. He started off offering benefits advice in Croydon and over the years moved through many different government roles and promotions to end up leading the team that wrote the UK’s renewable energy strategy. He has worked in both the UK Parliament and the European Parliament.\nFor the last ten years Peter has worked for environment conservation charities, working to support volunteers looking after our local parks and woodlands as well as working on large rewilding projects in Scotland.\nPeter has been active in the Green Party for over ten years and has held roles at local and national level in the party, as well as representing the Green Party of England and Wales at the European level.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_park-hill-and-whitgift/content_9.html": "James Cork is our by-election candidate for Park Hill and Whitgift 18 April 2024 / 18 April 2024 by Croydon Green Party are delighted to announce that James Cork will be our candidate for the Park Hill and Whitgift Ward by-election for Croydon Council on 2nd May. Read more » announcement croydon park hill and whitgift",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2021_11_15_peter-underwood-for-mayor-of-croydon/content_58.html": "Peter Underwood\nYour Green Party candidate for Mayor of Croydon\nWe are delighted to announce that Peter Underwood has been selected as the Green Party candidate for Mayor of Croydon. Peter would make a fantastic Mayor, sort out the problems at Croydon Council and put a smile back on people’s faces.\nCroydon has suffered for too long under the old two-party system and we all deserve better. It’s time for change. It’s time for a fresh Green start. It’s time to elect Peter Underwood as Mayor of Croydon.\nYou can help our campaign by donating here: https://www.crowdfunder.co.uk/peter-underwood-mayor-of-croydon\nPeter’s key aims as Mayor\n1) Give power back to people\nThe Green Party is committed to democracy. That doesn’t mean just pretending to listen to people at election time, it means really listening to people all of the time. And, most importantly, then acting on what people say.\nPeople are telling us that they are fed up with being ignored. Whether that is bad planning decisions, pointless consultation exercises, or having one party rule over the Council just for the benefit of their own supporters.\nPeter wants this to end. He will bring in citizens assemblies and genuine consultations at the start of decision processes so people have a real say in what happens. He will insist on a more transparent system at the Council so people can see what progress is being made and if something can’t be done people can see the full explanation why. Peter will also offer to work across political parties so that everyone in Croydon knows their representatives can be involved in running the Council.\nPeter said:\n“I was against changing to a directly elected Mayor because I think it’s wrong to give all that power to just one person. That’s why I am standing to be your Mayor so I can put that power back in your hands.\nI also want to end the political bickering that has done no one any good. If people are willing to put their differences aside and work for the good of everyone in Croydon then I will gladly work with them as part of my team.”\n2) Get Croydon Council Working for You\nAfter ten years of funding cuts from central government and financial mismanagement on the council, Croydon is in a dreadful state. Vital services are being cut or stopped altogether, and we are all suffering. Instead of tackling the problems we just get given endless excuses. There have been failures by officials employed at the Council and failures by politicians of both parties who just nodded along instead of doing their job.\nWe still don’t know all the details of how bad Council finances are because of the culture of secrecy and people trying to hide their failings. But Peter’s academic background and years working in the public, private, and charity sectors mean he has the skills and experience to begin the mammoth task of getting Croydon back on track.\nPeter said:\n“For too long it has felt like Croydon Council only works for the benefit of overpaid executives and incompetent politicians. It’s time it worked for you.\nWe know that Croydon has been left with no money and I’m not going to promise you miracles. But I can promise you I will review the way the council works from the bottom right to the top to make sure everyone is focused on doing the best they can for you.”\n3) Make Croydon happier\nPolitics shouldn’t just be about budgets and regulations. It should be about making your life better.\nWe want people to enjoy living in Croydon. We want places for children to play and well maintained parks. We want clean streets and public spaces. We want people to feel safe, whether they are enjoying a night out in town or just walking to school or work. We want people to feel they have the chance to express themselves, whether that is through their job, the arts, or just enjoying the vibrant cultural diversity of shows and events in Croydon. We want people to feel actively involved in how their area is run; generating new ideas and improving their area.\nPeter said:\n“My reason for being active in politics has always been to make people’s lives better.\nWe all know it will take time to clear up the mess we’ve been left with in Croydon and I’m not going to claim I will sort everything out straight away. But I spend all of my time as Mayor trying to make things better.\nMy number one aim as your new Mayor is to make Croydon happier.”\nAbout Peter\nPeter has lived in Croydon for twenty years and is a respected and trusted member of our community. He has challenged the establishment parties as a Green Party candidate at previous elections, standing up for people and planet. He has also worked with local campaigns on a range of issues such as tackling racism, banning toxic weed killers from our parks, and supporting the campaign for justice for the residents of Regina Road. During the recent pandemic Peter was also one of the many Croydon volunteers delivering medicines and food to residents who were isolating.\nPeter was born in the midlands of England. After leaving home at 17 he spent a period being homeless and then in temporary accommodation while he completed his A Levels and gained a place to study at Oxford University. Peter completed his degree in Philosophy and Psychology and then moved to London where he joined the civil service. Peter worked in a wide variety of roles including front line delivery in a benefit office, policy development work, corporate management, and working with Government Ministers in Parliament. During his civil service career Peter also completed a Master’s degree in Business Administration.\nTen years ago Peter left the civil service so that he could campaign for changes from outside Government. Peter currently works for The Conservation Volunteers, a national charity that supports people in looking after our parks, woodlands, and green spaces. He is also a conservation week guide with the rewilding charity Trees for Life in the Highlands of Scotland. Just prior to Brexit, Peter also spent a couple of months working with the Green Party group of MEPs in the European Parliament.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk/content_1.html": "Your local Green Parties for the Sutton and Croydon boroughs\nLatest News\n- Peter Underwood for Mayor of CroydonCroydon Green Party is delighted to announce that Peter Underwood has been selected as our candidate for Mayor of Croydon. The Green Party is the clear challenger to the failing Conservative and Labour parties. At the general election last year, the Green Party got the third most votes in Croydon. Our vote went up more… Read more: Peter Underwood for Mayor of Croydon\n- Peter Friel is our by-election candidate for Sutton CentralSutton Green Party are pleased to announce that Peter Friel is standing as our candidate for the upcoming Council by-election in Sutton Central Ward on 10 April. Peter lives in the ward and has lived in Sutton all of his life. Peter works in the financial sector and has organised numerous fundraising events for cancer… Read more: Peter Friel is our by-election candidate for Sutton Central\n- Our Fairfield Councillor Roundup for AugustHere’s what your Green Party Croydon councillors Ria Patel and Esther Sutton got up to in August 2024.\nCampaigns\n-\nOpposing Live Facial Recognition in Croydon\nCroydon Green Party stands together with groups including Big Brother Watch and Liberty to call for a halt to Live Facial Recognition operations nationwide. In March 2025 the Metropolitan Police announced…",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_category_announcements/content_46.html": "15 April 2025 / 15 April 2025 by peterunderwood\nCroydon Green Party is delighted to announce that Peter Underwood has been selected as our candidate for Mayor of Croydon. The Green Party is the clear challenger to the failing Conservative and Labour parties. At the general election last year, the Green Party got the third most votes in Croydon. Our vote went up more […]\nRead more »\n27 March 2025 / 27 March 2025 by peterunderwood\nSutton Green Party are pleased to announce that Peter Friel is standing as our candidate for the upcoming Council by-election in Sutton Central Ward on 10 April. Peter lives in the ward and has lived in Sutton all of his life. Peter works in the financial sector and has organised numerous fundraising events for cancer […]\n5 June 2024 / 16 June 2024 by\nCroydon and Sutton Green Party are delighted to announce that Aasha Anam has been selected as our General Election candidate for the constituency of Sutton and Cheam. Aasha said: “We all know that politics is broken and we deserve far better. So I joined the Green Party to ‘be the change I want to see’. […]\nSutton & Croydon Green Party are delighted to announce that Tracey Hague has been selected as our General Election candidate for the seat of Carshalton and Wallington. Tracey said: “I am pleased to have been selected again to stand for the Green Party in Carshalton and Wallington. I know people in this area have really […]\nCroydon and Sutton Green Party are delighted to announce that Ria Patel has been selected as our General Election candidate for the new seat of Croydon West. Ria said “I am proud to be selected to stand for the Green Party in the area where I already work as a local Councillor. I’m standing to […]\n18 April 2024 / 18 April 2024 by\nCroydon Green Party are delighted to announce that James Cork will be our candidate for the Park Hill and Whitgift Ward by-election for Croydon Council on 2nd May.\n8 April 2024 / 8 April 2024 by\nCroydon Green Party are delighted to announce that Nicholas Burman-Vince will be our candidate for the Woodside by-election for Croydon Council on 2nd May.\n14 March 2024 / 16 June 2024 by\nThe Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North.\n14 November 2023 / 16 June 2024 by\nCroydon and Sutton Green Party are delighted to announce that Elaine Denise Garrod has been selected as our General Election candidate for the seat of Croydon South. Elaine said: “I am really pleased to be selected to stand for the Green Party in Croydon South, to offer people realistic hope for the future. Over recent […]\n24 October 2023 / 16 June 2024 by\nCroydon and Sutton Green Party are delighted to announce that Peter Underwood has been selected as our General Election candidate for the new seat of Croydon East. Peter said: “I am so pleased to be selected as the candidate for the area where I live. I’m proud to be standing for the Green Party to […]",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2021_06_29_election-gains/content_49.html": "Detailed results from the recent London elections in May confirm that the Green Party is now the main challenger to the two old parties in Croydon.\nMay’s election saw the Green Party gain an extra seat on the London Assembly and achieve record votes across London. Here in Fairfield Ward we saw one of the biggest rises and if this trend continues then we should see Green Party Councillors elected here next year.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_announcement/content_50.html": "Aasha Anam is our General Election candidate for Sutton & Cheam 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Aasha Anam has been selected as our General Election candidate for the constituency of Sutton and Cheam. Aasha said: “We all know that politics is broken and we deserve far better. So I joined the Green Party to ‘be the change I want to see’. […] Read more » announcement candidate general election sutton sutton & cheam\nTracey Hague is our General Election candidate for Carshalton & Wallington 5 June 2024 / 16 June 2024 by Sutton & Croydon Green Party are delighted to announce that Tracey Hague has been selected as our General Election candidate for the seat of Carshalton and Wallington. Tracey said: “I am pleased to have been selected again to stand for the Green Party in Carshalton and Wallington. I know people in this area have really […] Read more » announcement candidate Carshalton & Wallington general election sutton\nRia Patel is our General Election candidate for Croydon West 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Ria Patel has been selected as our General Election candidate for the new seat of Croydon West. Ria said “I am proud to be selected to stand for the Green Party in the area where I already work as a local Councillor. I’m standing to […] Read more » announcement candidate croydon croydon west general election\nJames Cork is our by-election candidate for Park Hill and Whitgift 18 April 2024 / 18 April 2024 by Croydon Green Party are delighted to announce that James Cork will be our candidate for the Park Hill and Whitgift Ward by-election for Croydon Council on 2nd May. Read more » announcement croydon park hill and whitgift\nNicholas Burman-Vince is our by-election candidate for Woodside 8 April 2024 / 8 April 2024 by Croydon Green Party are delighted to announce that Nicholas Burman-Vince will be our candidate for the Woodside by-election for Croydon Council on 2nd May. Read more » announcement croydon woodside\nScott Ainslie is our General Election candidate for Streatham & Croydon North 14 March 2024 / 16 June 2024 by The Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North. Read more » announcement candidate croydon general election lambeth streatham and croydon north\nElaine Denise Garrod is our General Election candidate for Croydon South 14 November 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Elaine Denise Garrod has been selected as our General Election candidate for the seat of Croydon South. Elaine said: “I am really pleased to be selected to stand for the Green Party in Croydon South, to offer people realistic hope for the future. Over recent […] Read more » announcement candidate croydon croydon south general election\nPeter Underwood is our General Election candidate for Croydon East 24 October 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Peter Underwood has been selected as our General Election candidate for the new seat of Croydon East. Peter said: “I am so pleased to be selected as the candidate for the area where I live. I’m proud to be standing for the Green Party to […] Read more » announcement candidate croydon croydon east general election\nOur 2022 Manifesto for Croydon 8 November 2021 / 16 June 2024 by nicholasburmanvince Read more » announcement croydon",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_roundup/content_47.html": "Our Fairfield Councillor Roundup for August 31 August 2024 / 2 October 2024 by Ian Bridgeman Here’s what your Green Party Croydon councillors Ria Patel and Esther Sutton got up to in August 2024. Read more » councillors croydon roundup\nOur Fairfield Councillor Roundup for December 31 December 2023 / 16 June 2024 by Your Green Councillors were really busy throughout 2023! Here are some of the actions Ria Patel and Esther Sutton were taking in December. Read more » councillors croydon fairfield roundup\nOur Fairfield Councillor Roundup for November 30 November 2023 / 16 June 2024 by When Green Councillors are elected, they really work hard for you, and it really makes a difference! Here are just some of the things Ria and Esther Sutton have been doing in November. Read more » councillors croydon fairfield roundup\nOur Fairfield Councillor Roundup for October 31 October 2023 / 16 June 2024 by Greens don't just turn up at election time - Greens work hard for you all the time! Here are just some of the things Ria Patel and Esther Sutton were doing in October. Read more » councillors croydon fairfield roundup",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_11_30_november-2023-fairfield-councillor-roundup/content_40.html": "When Green Councillors are elected, they really work hard for you, and it really makes a difference! Here are just some of the things Ria and Esther Sutton have been doing in November:\n- Esther and Ria joined the Croydon and London protests calling for a ceasefire in Israel and Palestine, a release of all hostages and people imprisoned arbitrarily, and humanitarian aid for all who need it.\n- Ria spoke at the Parliamentary launch of the ‘Catering for Everyone’ report about promoting plant-based food in councils.\n- Ria spoke at the ‘Be a Councillor’ event aimed at encouraging more disabled people to become local Councillors.\n- Esther attended a meeting of the Tamworth Resident’s Association to support them in their work.\n- Ria chaired a Streets and Environment Scrutiny meeting discussing the air quality action plan, clean streets, and the local plan.\n- Ria successfully called for Trans flag to be raised outside Croydon Town Hall for Trans Day of Remembrance. It was disappointing that there wasn’t a flag raising ceremony as there would be for other events and we will continue pushing for that next year.\n- Ria visited Lighthouse Educational Society for their cookery club, attended One Croydon’s Local Community Partnerships Showcase Event, Croydon BME Forum’s Wellbeing Matters Pop-up event and London Council’s event on London’s Jewish community.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_03_04_croydon-green-councillors-write-open-letter-to-michael-gove/content_30.html": "Croydon Green Councillors Ria Patel and Esther Sutton have written this open letter to Michael Gove concerning Mayor Perry’s plan to raise Council Tax by 15% and cut Council services\nGreen Councillor Group,\nCroydon Town Hall\nKatharine Street\nCroydon\nCR0 1NX\n03 March 2023\nOpen Letter from Croydon Green Councillors to the Secretary of State for Levelling Up, Housing and Communities\nDear Mr Gove,\nWe are writing to ask you to reconsider your decision to allow Mayor Perry to raise Council Tax in Croydon by 15% and for you to fund Croydon fairly to protect our vital council services and protect those people suffering the most during this cost of living crisis.\nCroydon has been blighted by over a decade of bad decisions, dodgy deals, and secret contracts made by Councillors and enabled by senior officers. These were done without the knowledge or approval of Croydon residents.\nWe are now being told that another deal is being done between your Department and Mayor Perry that is forcing Croydon Residents to pay for the mess made by Councillors’ bad decisions, while cutting services even more, and without residents having any opportunity to say whether they agree. This is neither fair nor democratic.\nWe note that many local authorities are facing the worst funding crisis in their history caused by massive funding shortfalls. Attempts to address these shortfalls by allowing increased council tax will fail to raise anywhere near the sums needed.\nCroydon has also suffered due to the funding formula that means Croydon receives far less central Government funding per resident than other London Boroughs even though Croydon faces the same issues as those other Boroughs.\nIt makes no economic, social or environmental sense to leave Croydon Council in a position where it will continue to struggle and fail to deliver the basic services that people rightly expect and deserve. This is particularly true at the moment when your Government’s decision to allow energy companies to raise prices far beyond any reasonable level has left so many people struggling to meet their needs.\nFor Croydon Council to serve local people in the way they deserve and give them hope for the future we need proper funding to invest in a fairer, greener, and healthier future.\nIn order to do this effectively, we request that you:\n- Restore central Government funding to the levels required for Croydon Council to provide necessary services on a sustainable footing.\n- Guarantee that funding will increase at least in line with inflation in coming years to ensure that the Council can pay its staff fairly and effectively plan for future service delivery.\n- Review the funding formula that currently provides far less funding to Croydon than other equivalent London Boroughs\n- At a minimum provide the extra funding needed to reduce this year’s Council Tax rise to below the 5% threshold set for other Councils\n- Ensure any settlement with Mayor Perry includes sufficient money for an effective hardship fund to protect those unable to meet the extra costs of a Council Tax rise.\nAt the time of writing over 25,000 have already signed the petition opposing Mayor Perry’s 15% Council Tax rise and we know from our conversations with local residents how angry they are at the plan to make them pay for other’s mistakes.\nWe urge you to listen to the residents of Croydon and act so that you can support us in striving to protect the most vulnerable people and build Croydon into a thriving social and economic success as we recover from this crisis.\nYours sincerely,\nRia Patel and Esther Sutton\nCouncillors for Fairfield Ward, Croydon Council",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_06_26_1086/content_41.html": "Ria Patel, Zoë Garbett, and Peter Underwood\nThe Croydon & Sutton Green Party are pleased to announce that Peter Underwood has been selected to stand as our candidate at next May’s London elections.[i]\nPeter has lived in both boroughs and is well known for his honest and caring approach to politics, and his work with local charities and community groups.\nPeter studied Philosophy and Psychology at Oxford University and also has a Master’s degree in Business Administration. Peter spent many years working in the civil service and has worked in both the Westminster Parliament and the European Parliament. Peter currently works for national environment conservation charity as the business development manager for London and the South of England.\nVoters at next May’s London elections will have three ballot papers and one vote on each:\n1) The first ballot will be for Mayor of London and Zoë Garbett has already been selected as the Green Party candidate to challenge Sadiq Khan\n2) The second ballot will be to elect a London Assembly member to cover Croydon & Sutton and Peter Underwood has now been selected as the Green Party candidate for our area\n3) The third ballot paper is where voters chose which party they prefer and these votes all count to elect candidates from a London-wide list for each Party. The Green Party got three London Assembly members elected from their list last time and Croydon Councillor Ria Patel is on this London-wide list for 2024.\nPeter said “it is an honour to be selected as the Green Party candidate for Croydon & Sutton at next year’s London elections. I would like to thank Marley King for also standing to be the candidate and bringing a different perspective and new ideas to the discussions. I know she will continue to make a great contribution during the campaign and I hope to see her elected in the future.”\n“The Green Party has shown that is now the real alternative to the old parties. Our fresh Green policies to look after people and planet are winning over more and more people. At the Council elections earlier this year Greens won all over the country – beating the Conservatives, Labour, and the Liberal Democrats. We aim to continue that progress next year in London.”\n“If you vote for the same old parties, you will just get the same old politics. If you really want better then you have to vote for better. If you want a bright Green future then at next year’s elections vote for Zoe Garbett for Mayor of London, Peter Underwood as your local London Assembly member, and vote for the Green Party on the London wide ballot paper.”\n——————————————————————————————————————\n[i] Two people put themselves forward to be the Green Party candidate, Peter Underwood and Marley King. Party members were balloted and Peter was chosen to be the candidate with 69% of the votes.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_author_riap/content_39.html": "9 May 2023 / 16 June 2024 by Ria Patel\nWe are concerned to hear from residents regarding fox culling at Beddington Farmlands. The timing of this cull is a particular worry as fox cubs are born in Spring and are dependent on their mother vixens for food and to survive. We have contacted representatives of Valencia Waste Management, who manage Beddington Farmlands, and Sutton […]\nRead more »\n29 June 2021 / 16 June 2024 by Ria Patel\nDetailed results from the recent London elections in May confirm that the Green Party is now the main challenger to the two old parties in Croydon. May’s election saw the Green Party gain an extra seat on the London Assembly and achieve record votes across London. Here in Fairfield Ward we saw one of the […]",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_author_peterunderwood/content_3.html": "15 April 2025 / 15 April 2025 by peterunderwood\nCroydon Green Party is delighted to announce that Peter Underwood has been selected as our candidate for Mayor of Croydon. The Green Party is the clear challenger to the failing Conservative and Labour parties. At the general election last year, the Green Party got the third most votes in Croydon. Our vote went up more […]\nRead more »\n27 March 2025 / 27 March 2025 by peterunderwood\nSutton Green Party are pleased to announce that Peter Friel is standing as our candidate for the upcoming Council by-election in Sutton Central Ward on 10 April. Peter lives in the ward and has lived in Sutton all of his life. Peter works in the financial sector and has organised numerous fundraising events for cancer […]",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_croydon/content_8.html": "Our Fairfield Councillor Roundup for August 31 August 2024 / 2 October 2024 by Ian Bridgeman Here’s what your Green Party Croydon councillors Ria Patel and Esther Sutton got up to in August 2024. Read more » councillors croydon roundup\nRia Patel is our General Election candidate for Croydon West 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Ria Patel has been selected as our General Election candidate for the new seat of Croydon West. Ria said “I am proud to be selected to stand for the Green Party in the area where I already work as a local Councillor. I’m standing to […] Read more » announcement candidate croydon croydon west general election\nJames Cork is our by-election candidate for Park Hill and Whitgift 18 April 2024 / 18 April 2024 by Croydon Green Party are delighted to announce that James Cork will be our candidate for the Park Hill and Whitgift Ward by-election for Croydon Council on 2nd May. Read more » announcement croydon park hill and whitgift\nNicholas Burman-Vince is our by-election candidate for Woodside 8 April 2024 / 8 April 2024 by Croydon Green Party are delighted to announce that Nicholas Burman-Vince will be our candidate for the Woodside by-election for Croydon Council on 2nd May. Read more » announcement croydon woodside\nScott Ainslie is our General Election candidate for Streatham & Croydon North 14 March 2024 / 16 June 2024 by The Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North. Read more » announcement candidate croydon general election lambeth streatham and croydon north\nOur Fairfield Councillor Roundup for December 31 December 2023 / 16 June 2024 by Your Green Councillors were really busy throughout 2023! Here are some of the actions Ria Patel and Esther Sutton were taking in December. Read more » councillors croydon fairfield roundup\nOur Fairfield Councillor Roundup for November 30 November 2023 / 16 June 2024 by When Green Councillors are elected, they really work hard for you, and it really makes a difference! Here are just some of the things Ria and Esther Sutton have been doing in November. Read more » councillors croydon fairfield roundup\nElaine Denise Garrod is our General Election candidate for Croydon South 14 November 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Elaine Denise Garrod has been selected as our General Election candidate for the seat of Croydon South. Elaine said: “I am really pleased to be selected to stand for the Green Party in Croydon South, to offer people realistic hope for the future. Over recent […] Read more » announcement candidate croydon croydon south general election\nOur Fairfield Councillor Roundup for October 31 October 2023 / 16 June 2024 by Greens don't just turn up at election time - Greens work hard for you all the time! Here are just some of the things Ria Patel and Esther Sutton were doing in October. Read more » councillors croydon fairfield roundup\nPeter Underwood is our General Election candidate for Croydon East 24 October 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Peter Underwood has been selected as our General Election candidate for the new seat of Croydon East. Peter said: “I am so pleased to be selected as the candidate for the area where I live. I’m proud to be standing for the Green Party to […] Read more » announcement candidate croydon croydon east general election",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2024_08_31_august-2024-fairfield-councillor-roundup/content_7.html": "It was a busy August! Here’s what your Green Party councillors Ria Patel and Esther Sutton got up to…\n- Ria and Esther organised a community litter pick at The Queen’s Gardens. There was a great turnout of local residents, gathering a dozen bags of rubbish!\n- Ria and Esther spoke to residents from Woburn and Bedford Court about the proposed demolition of their estate, hosting a public meeting, and supporting residents to get their views heard.\n- Together with Croydon Green Party members, Ria and Esther also spoke to town centre residents on their doorstops, listening to their concerns and helping to solve local issues.\n- They attended many meetings with officers at Bernard Weatherill House (the council offices) raising residents’ issues.\n- Ria campaigned against the regular live facial recognition operations in the town centre. Croydon has had the most live facial recognition operations in London so far in 2024.\n- Both Ria and Esther supported residents on Tamworth Estate before the launch of the brand new Tamworth Estate Community Hub.\n- Ria also joined the rest of the Sutton & Croydon Green Party at the yearly Carshalton Eco Fair, talking to local residents, and just as importantly, helping to get the tea and cake from our vegan café to eco fair visitors!\nKeep an eye out for us as we get things done in Croydon, and we’ll be back here next month for a slightly more Autumnal update.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_04_30_fairfield-spring-newsletter-2023/content_55.html": "Skip to content\nSkip to footer\nSutton & Croydon\nMenu\nAbout\nOur Councillors\nGet Involved\nNews\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nFairfield Spring Newsletter\nHome\nNewsletters\nFairfield Spring Newsletter\n30 April 2023\n/\n16 June 2024\nby\nTo top",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_opposing-facial-recognition/content_4.html": "Croydon Green Party stands together with groups including Big Brother Watch and Liberty to call for a halt to Live Facial Recognition operations nationwide.\nIn March 2025 the Metropolitan Police announced that by the summer, Croydon would see one of the UK’s first permanent installations of a live facial recognition camera system on North End, part of Croydon’s high street.\nThere are no laws regarding live facial recognition, which means there are no safeguards to its use by law enforcement. To Croydon residents, live facial recognition represents a gross invasion of privacy, to which we’ve had no formal opportunity to object.\nWhether you’re a Croydon resident or not, please join us in taking action against this erosion of our rights.\n1. Sign the petition\nThe civil rights group Liberty needs your signature for a petition that calls for basic safeguards.\n2. Email your MP\nYou can write to your MP and let them know you oppose live facial recognition. The easiest way to contact your MP is with writetothem.com. It’s quick and totally free.\nThe UK civil rights group Big Brother Watch has a pre-written message, which you can personalise.\nSee the pre-written message\nAs your constituent, I am writing to you to express my concerns about the police’s growing use of live facial recognition in the UK. I would appreciate if you could raise the concerns I have about the use of this technology and its impact on human rights and civil liberties with the Home Secretary and DSIT Secretary respectively.\nLive facial recognition works by creating a ‘faceprint’ of everyone who passes in front of the camera — processing biometric data as sensitive as a fingerprint. This form of surveillance is deeply intrusive, often subjecting many thousands of innocent people to biometric identity checks without justification. Seven police forces around the UK are currently using this technology despite there being no specific law which governs its use, with forces such as Essex Police, the Metropolitan Police and South Wales Police continuing to use LFR on a regular basis in a way that affects millions of us as we live and travel around the UK.\nUses of live facial recognition have resulted in privacy and data breaches, misidentifications, racial discrimination, and a significant chilling effect on freedom of expression and assembly. In 2020, South Wales Police was found to have deployed live facial recognition surveillance unlawfully (Bridges v SWP) and the Metropolitan Police is also facing a judicial review brought by a Black victim of live facial recognition misidentification which took place earlier this year. Other victims of live facial recognition harassment and errors are initiating legal action in the retail context.\nIn recent years, parliamentarians across parties in Westminster, members of the Senedd, rights and equalities groups and technology experts across the globe have called for a stop to the use of this technology. The only detailed inquiry into the use of live facial recognition by a parliamentary committee called for a stop to its use. The Equality and Human Rights Commission (EHRC) called for the UK Government to suspend live facial recognition in 2020.\nGovernments across the democratic world are legislating to ban and significantly restrict the use of live facial recognition surveillance, for both law enforcement and private companies – but successive governments have left the UK behind. The EU’s AI Act will introduce an almost total ban on the use of live facial recognition, with law enforcement exceptions for only the most serious crimes and on the condition of prior judicial approval for each deployment. In the US, multiple states have banned law enforcement from using the technology entirely. The UK risks becoming an outlier in the democratic world, instead following the approach of countries like Russia and China, which have heavily invested in this technology to the detriment of their citizens’ rights and freedoms.\nThe legal vacuum when it comes to the police’s use of live facial recognition technology cannot continue. The UK must follow the example set by European states and introduce stringent restrictions on the use of this surveillance technology akin to the EU’s AI Act. For more information, please contact Big Brother Watch at info@bigbrotherwatch.org.uk\nAs my constituency’s MP, I would appreciate if you could raise the concerns I have about the use of this technology and its impact on human rights and civil liberties with the Home Secretary and DSIT Secretary respectively.\nI look forward to hearing from you.\nKind regards,\n3. Donate to the legal challenge\nCivil Liberties campaign group is currently crowdfunding for a legal challenge to stop live facial recognition operations in the UK.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_news-2_page_2/content_28.html": "Our Fairfield Councillor Roundup for November 30 November 2023 / 16 June 2024 by When Green Councillors are elected, they really work hard for you, and it really makes a difference! Here are just some of the things Ria and Esther Sutton have been doing in November. Read more » councillors croydon fairfield roundup\nElaine Denise Garrod is our General Election candidate for Croydon South 14 November 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Elaine Denise Garrod has been selected as our General Election candidate for the seat of Croydon South. Elaine said: “I am really pleased to be selected to stand for the Green Party in Croydon South, to offer people realistic hope for the future. Over recent […] Read more » announcement candidate croydon croydon south general election\nOur Fairfield Councillor Roundup for October 31 October 2023 / 16 June 2024 by Greens don't just turn up at election time - Greens work hard for you all the time! Here are just some of the things Ria Patel and Esther Sutton were doing in October. Read more » councillors croydon fairfield roundup\nPeter Underwood is our General Election candidate for Croydon East 24 October 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Peter Underwood has been selected as our General Election candidate for the new seat of Croydon East. Peter said: “I am so pleased to be selected as the candidate for the area where I live. I’m proud to be standing for the Green Party to […] Read more » announcement candidate croydon croydon east general election\nPeter Underwood chosen as London Assembly candidate for Croydon & Sutton 26 June 2023 / 16 June 2024 by nicholasburmanvince Ria Patel, Zoë Garbett, and Peter Underwood The Croydon & Sutton Green Party are pleased to announce that Peter Underwood has been selected to stand as our candidate at next May’s London elections.[i] Peter has lived in both boroughs and is well known for his honest and caring approach to politics, and his work with […] Read more »\nFox Culling at Beddington Farmlands 9 May 2023 / 16 June 2024 by Ria Patel We are concerned to hear from residents regarding fox culling at Beddington Farmlands. The timing of this cull is a particular worry as fox cubs are born in Spring and are dependent on their mother vixens for food and to survive. We have contacted representatives of Valencia Waste Management, who manage Beddington Farmlands, and Sutton […] Read more »\nFairfield Spring Newsletter 30 April 2023 / 16 June 2024 by Read all about what Fairfield's Green councillors have been up to in the Spring Update newsletter. Read more » councillors croydon fairfield newsletter\nOpen Letter in Support of Trans and Non-Binary People 31 March 2023 / 16 June 2024 by The members of the Sutton and Croydon Green Party agreed at their Annual General Meeting to publish a letter highlighting our disappointment with the level of transphobia and so-called ‘gender critical’ ideology being allowed to continue within the Party and publicly express our intent as a local party to find ways to change this. We […] Read more »\nCroydon Green Councillors write open letter to Michael Gove 4 March 2023 / 4 March 2023 by nicholasburmanvince Croydon Green Councillors Ria Patel and Esther Sutton have written this open letter to Michael Gove concerning Mayor Perry’s plan to raise Council Tax by 15% and cut Council services Green Councillor Group, Croydon Town Hall Katharine StreetCroydonCR0 1NX 03 March 2023 Open Letter from Croydon Green Councillors to the Secretary of State for Levelling […] Read more »\nPeter Underwood for Mayor of Croydon 15 November 2021 / 16 June 2024 by nicholasburmanvince Peter Underwood Your Green Party candidate for Mayor of Croydon We are delighted to announce that Peter Underwood has been selected as the Green Party candidate for Mayor of Croydon. Peter would make a fantastic Mayor, sort out the problems at Croydon Council and put a smile back on people’s faces. Croydon has suffered for […] Read more »",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2024_04_18_james-cork-is-our-by-election-candidate-for-park-hill-and-whitgift/content_21.html": "Croydon Green Party are delighted to announce that James Cork will be our candidate for the Park Hill and Whitgift by-election for Croydon Council on 2nd May.\nJames said:\n“I’ve lived in Croydon for over fifteen years and in Parkhill for most of that time and I believe that our community needs someone on the Council who will work hard for our area, not just do whatever their party tells them to do. I am involved in many parts of our community and care for everyone.\nI moved to the area from East Croydon with my wife so we could look after my aunt who had Alzheimer’s. During my time here I also helped look after several elderly neighbours. We have 4 children, our eldest son went to Archbishop Tenison and is now at Croydon College and our daughters are in Park Hill Infant and Juniors. I am also a Scout Leader at the 7th/12th Croydon and look after Beaver and cubs Scouts.\nThe Green Party has shown that we will stand up for local people and offer a different option for our community, that is beyond party politics. For example, our London Assembly candidate, Peter Underwood, recently led the campaign to stop Shirley Heath and Addington Hills from being given away to a golf club.\nIf you elect me as your Councillor, you know you will have someone on the Council who will be fighting for our area and doing the best for our families and our community.”\nAbout James\nJames has family roots in Croydon going back over a century. James spent most of his childhood in Switzerland, but came back to Croydon in 2009 and has lived in Park Hill since 2015.\nJames is a sole trading handyman and is also an actor and producer. He has worked as a supporting cast member in a wide variety of productions, from Eastenders on television to the film about Freddy Mercury’s life, Bohemian Rhapsody: https://www.imdb.com/name/nm3210681/\nJames is a founding member of the Friends of Lloyd Park and he has also worked on projects with the Park Hill Resident’s Association and attends the local Safer Neighbourhood Team meetings with the police and local organisations.\nJames led the campaign and gathered signatures on the petition to add a pedestrian crossing for the safety of residents and children between Brownlow Road and Stanhope Road. This crossing has now been approved, pending finance, and James will continue pressing to make sure it is delivered.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_lambeth/content_19.html": "Scott Ainslie is our General Election candidate for Streatham & Croydon North 14 March 2024 / 16 June 2024 by The Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North. Read more » announcement candidate croydon general election lambeth streatham and croydon north",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2024_06_05_tracey-hague-is-our-general-election-candidate-for-carshalton-and-wallington/content_20.html": "Sutton & Croydon Green Party are delighted to announce that Tracey Hague has been selected as our General Election candidate for the seat of Carshalton and Wallington.\nTracey said:\n“I am pleased to have been selected again to stand for the Green Party in Carshalton and Wallington. I know people in this area have really suffered under the current Government and I am standing to offer people real change and real hope for the future.\nAs an energy advisor I’ve met lots of people who are struggling with paying their bills, and this leads to sleepless nights and worsening health. On top of this rents and mortgages are going up and wages have gone down.\nThe Green Party realises that the solutions to these problems are linked. Just as one example, a mass insulation programme will not only reduce bills, it will improve the quality of housing, reduce ill health, and tackle help tackle the climate crisis. It will create jobs and put more money back into people’s pockets and local small businesses.\nJust getting the Conservatives out isn’t enough. The other parties aren’t offering meaningful change or real solutions to the problems we face. The Green Party is the only one promising to take our public services back into public hands; introduce a Universal Basic Income to lift people out of poverty; and reform our voting and political systems so that they are fair and work for everyone, not just those at the top.\nYou deserve better than just the same old politics from the same old parties. But if you want better, then you have to vote for better. It’s time to vote Green.”\nAbout Tracey\nMany local people will also know Tracey from the Green Party’s tea and cake stall at the Carshalton Eco Fair where Tracey ensures there is a range of delicious plant-based and allergy-sensitive cakes available.\nTracey was born and brought up in Croydon, has lived there almost her entire life and has chosen to bring her family up there.\nTracey has worked in the public, private, and the voluntary and community sectors. She currently works for a local charity supporting people from ethnic minorities in tackling fuel poverty and health inequalities.\nTracey has undertaken a range of voluntary work including at a food bank, teaching skills for life to young people (Scouting), fundraising for school resources (parents association), giving advice and support on vegan cooking and nutrition (Sustainable Thornton Heath).\nTracey is a founder member of her local park Friends group, has sat on the Scrutiny sub-committee as the patients’ representative and been a trustee of a local ecology centre and a local voluntary organisation.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_about-us/content_43.html": "The Green Party is growing fast. We have elected members at national, regional, and local levels and have a larger and larger influence on political debates.\nThe number of Green Party Councillors elected has grown rapidly in recent years and in May 2022, we elected our first two Green Party Councillors for Fairfield, Croydon: Ria Patel and Esther Sutton!\nWe believe that communities should be involved in the decisions that affect them and so our members are actively involved with community groups working on local issues; to improve the lives of everyone and to improve our environment.\nThat’s why we need more Green Party members elected: so that your ideas are heard in political discussions, your questions are asked in parliament and council chambers, and your problems are not ignored.\nWe rely on people power rather than corporate finance in all that we do. Get involved with us so that we can make that happen.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_category_news/content_57.html": "15 April 2025 / 15 April 2025 by peterunderwood\nCroydon Green Party is delighted to announce that Peter Underwood has been selected as our candidate for Mayor of Croydon. The Green Party is the clear challenger to the failing Conservative and Labour parties. At the general election last year, the Green Party got the third most votes in Croydon. Our vote went up more […]\nRead more »\n26 June 2023 / 16 June 2024 by nicholasburmanvince\nRia Patel, Zoë Garbett, and Peter Underwood The Croydon & Sutton Green Party are pleased to announce that Peter Underwood has been selected to stand as our candidate at next May’s London elections.[i] Peter has lived in both boroughs and is well known for his honest and caring approach to politics, and his work with […]\n9 May 2023 / 16 June 2024 by Ria Patel\nWe are concerned to hear from residents regarding fox culling at Beddington Farmlands. The timing of this cull is a particular worry as fox cubs are born in Spring and are dependent on their mother vixens for food and to survive. We have contacted representatives of Valencia Waste Management, who manage Beddington Farmlands, and Sutton […]\n31 March 2023 / 16 June 2024 by\nThe members of the Sutton and Croydon Green Party agreed at their Annual General Meeting to publish a letter highlighting our disappointment with the level of transphobia and so-called ‘gender critical’ ideology being allowed to continue within the Party and publicly express our intent as a local party to find ways to change this. We […]\n4 March 2023 / 4 March 2023 by nicholasburmanvince\nCroydon Green Councillors Ria Patel and Esther Sutton have written this open letter to Michael Gove concerning Mayor Perry’s plan to raise Council Tax by 15% and cut Council services Green Councillor Group, Croydon Town Hall Katharine StreetCroydonCR0 1NX 03 March 2023 Open Letter from Croydon Green Councillors to the Secretary of State for Levelling […]\n15 November 2021 / 16 June 2024 by nicholasburmanvince\nPeter Underwood Your Green Party candidate for Mayor of Croydon We are delighted to announce that Peter Underwood has been selected as the Green Party candidate for Mayor of Croydon. Peter would make a fantastic Mayor, sort out the problems at Croydon Council and put a smile back on people’s faces. Croydon has suffered for […]\n29 June 2021 / 16 June 2024 by Ria Patel\nDetailed results from the recent London elections in May confirm that the Green Party is now the main challenger to the two old parties in Croydon. May’s election saw the Green Party gain an extra seat on the London Assembly and achieve record votes across London. Here in Fairfield Ward we saw one of the […]",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_news-2_page_3/content_12.html": "Our 2022 Manifesto for Croydon 8 November 2021 / 16 June 2024 by nicholasburmanvince Read more » announcement croydon\nOn the Rise in Croydon 29 June 2021 / 16 June 2024 by Ria Patel Detailed results from the recent London elections in May confirm that the Green Party is now the main challenger to the two old parties in Croydon. May’s election saw the Green Party gain an extra seat on the London Assembly and achieve record votes across London. Here in Fairfield Ward we saw one of the […] Read more »",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_croydon-west/content_48.html": "Ria Patel is our General Election candidate for Croydon West 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Ria Patel has been selected as our General Election candidate for the new seat of Croydon West. Ria said “I am proud to be selected to stand for the Green Party in the area where I already work as a local Councillor. I’m standing to […] Read more » announcement candidate croydon croydon west general election",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_donate/content_17.html": "Skip to content\nSkip to footer\nSutton & Croydon\nMenu\nAbout\nOur Councillors\nGet Involved\nNews\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nDonate\nDonate\nTo top",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_author_nicholasburmanvince/content_15.html": "26 June 2023 / 16 June 2024 by nicholasburmanvince\nRia Patel, Zoë Garbett, and Peter Underwood The Croydon & Sutton Green Party are pleased to announce that Peter Underwood has been selected to stand as our candidate at next May’s London elections.[i] Peter has lived in both boroughs and is well known for his honest and caring approach to politics, and his work with […]\nRead more »\n4 March 2023 / 4 March 2023 by nicholasburmanvince\nCroydon Green Councillors Ria Patel and Esther Sutton have written this open letter to Michael Gove concerning Mayor Perry’s plan to raise Council Tax by 15% and cut Council services Green Councillor Group, Croydon Town Hall Katharine StreetCroydonCR0 1NX 03 March 2023 Open Letter from Croydon Green Councillors to the Secretary of State for Levelling […]\n15 November 2021 / 16 June 2024 by nicholasburmanvince\nPeter Underwood Your Green Party candidate for Mayor of Croydon We are delighted to announce that Peter Underwood has been selected as the Green Party candidate for Mayor of Croydon. Peter would make a fantastic Mayor, sort out the problems at Croydon Council and put a smile back on people’s faces. Croydon has suffered for […]\n8 November 2021 / 16 June 2024 by nicholasburmanvince",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_category_councillor-roundups/content_37.html": "31 August 2024 / 2 October 2024 by Ian Bridgeman\nHere’s what your Green Party Croydon councillors Ria Patel and Esther Sutton got up to in August 2024.\nRead more »\n31 December 2023 / 16 June 2024 by\nYour Green Councillors were really busy throughout 2023! Here are some of the actions Ria Patel and Esther Sutton were taking in December.\n30 November 2023 / 16 June 2024 by\nWhen Green Councillors are elected, they really work hard for you, and it really makes a difference! Here are just some of the things Ria and Esther Sutton have been doing in November.\n31 October 2023 / 16 June 2024 by\nGreens don't just turn up at election time - Greens work hard for you all the time! Here are just some of the things Ria Patel and Esther Sutton were doing in October.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_10_31_october-2023-fairfield-councillor-roundup/content_44.html": "Greens don’t just turn up at election time – Greens work hard for you all the time! Here are just some of the things Ria Patel and Esther Sutton were doing in October:\n- Ria and Esther attended the vigil for Elianne Andam. They joined residents at the Safer Croydon Community Partnership meeting and met with police at the quarterly panel meeting. Esther also joined the police for discussions in College Square and Ria attended an event organised by the Violence Reduction Unit to tackle violence against women and girls.\n- Esther questioned the Mayor on the failure to improve our town centre and both Ria and Esther met with representatives of the Croydon Business Improvement District to discuss their work.\n- They pushed Council officers for action on the Council’s estates in Fairfield: The Elms and Arthur Court. Ria met with organisations in the Church Street area to discuss community cohesion and asset building.\n- Ria contributed to a community meeting on poor hotel conditions for asylum seekers and supported the Abolish Reporting campaign outside Lunar House.\n- Ria and Esther attended the relaunch of Croydon Drop In’s Talk Bus, a mobile information centre and support service for young people.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_03_31_open-letter-in-support-of-trans-and-non-binary-people-in-the-green-party/content_33.html": "The members of the Sutton and Croydon Green Party agreed at their Annual General Meeting to publish a letter highlighting our disappointment with the level of transphobia and so-called ‘gender critical’ ideology being allowed to continue within the Party and publicly express our intent as a local party to find ways to change this.\nWe wish to express our wholehearted support for the Green Party policy which “recognises that trans men are men, trans women are women, and that non-binary identities exist and are valid. We shall respect transgender and non-binary people’s identities as real. The Green Party shall include, and push for further acceptance of, transgender and non-binary people within all areas of society.”\nWe also wholeheartedly believe in the Green Party core value that states “A healthy society is based on voluntary co-operation between empowered individuals in a democratic society, free from discrimination whether based on race, colour, gender, sexual orientation, religion, social origin or any other prejudice.”\nThose people who disagree with our policy recognising the rights of trans and non-binary people are not just expressing a difference of opinion; they are disagreeing with the fundamental principles of Green politics. We should not tolerate views in the Party that go against the core values of the Green Party.\nWe wish to commend the work of LGBTIQA+ Greens in helping to educate members and overcome genuine misunderstandings about gender identity, particularly through their inclusion workshops. Despite these efforts we are disappointed that some members are still actively campaigning against equal rights for trans and non-binary people.\nThe activities of these anti-equality campaigners are bringing great harm and distress to Green Party members and bringing the Party into disrepute. Members who repeatedly or unapologetically break our code of conduct by attacking and discriminating against other members on the grounds of their gender identity should be suspended or expelled from the Party.\nWe are also in danger of bringing the Party into disrepute if it is not ensured that the Party’s disciplinary processes act in line with the Party’s own policies. We note that the Scottish Green Party has recently voted to formally sever its ties with the Green Party of England and Wales over the failure to tackle transphobia within the Party.\nWe also note the Party’s policy on hate crime that states “In a just society everyone should be protected from crimes motivated by hatred and discrimination based on ethnicity, colour, gender, trans, sexual orientation, religion, social origin, age, disability including learning difficulties or any other prejudice. A comprehensive strategy will be adopted to tackle, significantly reduce and ultimately end hate crime.”\nAs members of the Green Party we believe that we cannot be an example for others if we are not living up to our own policies within the Party.\nM. King\nP. Underwood\nR. Patel\nM. Post\nT. Hague\nE. Garrod\nM. Vodden\nP. Ainscough",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_author_ian-bridgeman/content_24.html": "31 August 2024 / 2 October 2024 by Ian Bridgeman\nHere’s what your Green Party Croydon councillors Ria Patel and Esther Sutton got up to in August 2024.\nRead more »",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_news-2/content_6.html": "Peter Underwood for Mayor of Croydon 15 April 2025 / 15 April 2025 by peterunderwood Croydon Green Party is delighted to announce that Peter Underwood has been selected as our candidate for Mayor of Croydon. The Green Party is the clear challenger to the failing Conservative and Labour parties. At the general election last year, the Green Party got the third most votes in Croydon. Our vote went up more […] Read more »\nPeter Friel is our by-election candidate for Sutton Central 27 March 2025 / 27 March 2025 by peterunderwood Sutton Green Party are pleased to announce that Peter Friel is standing as our candidate for the upcoming Council by-election in Sutton Central Ward on 10 April. Peter lives in the ward and has lived in Sutton all of his life. Peter works in the financial sector and has organised numerous fundraising events for cancer […] Read more »\nOur Fairfield Councillor Roundup for August 31 August 2024 / 2 October 2024 by Ian Bridgeman Here’s what your Green Party Croydon councillors Ria Patel and Esther Sutton got up to in August 2024. Read more » councillors croydon roundup\nAasha Anam is our General Election candidate for Sutton & Cheam 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Aasha Anam has been selected as our General Election candidate for the constituency of Sutton and Cheam. Aasha said: “We all know that politics is broken and we deserve far better. So I joined the Green Party to ‘be the change I want to see’. […] Read more » announcement candidate general election sutton sutton & cheam\nTracey Hague is our General Election candidate for Carshalton & Wallington 5 June 2024 / 16 June 2024 by Sutton & Croydon Green Party are delighted to announce that Tracey Hague has been selected as our General Election candidate for the seat of Carshalton and Wallington. Tracey said: “I am pleased to have been selected again to stand for the Green Party in Carshalton and Wallington. I know people in this area have really […] Read more » announcement candidate Carshalton & Wallington general election sutton\nRia Patel is our General Election candidate for Croydon West 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Ria Patel has been selected as our General Election candidate for the new seat of Croydon West. Ria said “I am proud to be selected to stand for the Green Party in the area where I already work as a local Councillor. I’m standing to […] Read more » announcement candidate croydon croydon west general election\nJames Cork is our by-election candidate for Park Hill and Whitgift 18 April 2024 / 18 April 2024 by Croydon Green Party are delighted to announce that James Cork will be our candidate for the Park Hill and Whitgift Ward by-election for Croydon Council on 2nd May. Read more » announcement croydon park hill and whitgift\nNicholas Burman-Vince is our by-election candidate for Woodside 8 April 2024 / 8 April 2024 by Croydon Green Party are delighted to announce that Nicholas Burman-Vince will be our candidate for the Woodside by-election for Croydon Council on 2nd May. Read more » announcement croydon woodside\nScott Ainslie is our General Election candidate for Streatham & Croydon North 14 March 2024 / 16 June 2024 by The Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North. Read more » announcement candidate croydon general election lambeth streatham and croydon north\nOur Fairfield Councillor Roundup for December 31 December 2023 / 16 June 2024 by Your Green Councillors were really busy throughout 2023! Here are some of the actions Ria Patel and Esther Sutton were taking in December. Read more » councillors croydon fairfield roundup",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_about-us_ria-patel/content_61.html": "Ria Patel – Green Party Councillor in Fairfield\nRia was born and raised in Croydon and is Croydon’s youngest and first non-binary councillor. They are a councillor for Fairfield, Croydon’s town centre and are the Chair of the Streets and Environment Scrutiny Sub-Committee, as well sitting on the Licensing Committee too. Within the Green Party of England and Wales, they are the Equalities & Diversity spokesperson and a committee member of the Green Party’s Campaign’s Committee.\nHere in Croydon, Ria is a trustee and director of Croydon Pride and the Fuel Poverty Director for Croydon Community Energy, organising their energy advice sessions. She also volunteers at Croydon Urban Mushroom Farm, which is in Fairfield and a part of Croydon Circular Economy.\nBefore being elected Ria studied Psychology at university and was involved in various Green Party liberation groups, as well as campaigns for migrant justice, LGBTIQA+ rights and climate action.\nThey would like to re-envision Croydon as a town made for the people and the environment: a place where people have access to affordable housing, where local businesses are supported, where all public services are properly funded and where the environment is cared for, without exploitation.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_05_09_fox-culling-at-beddington-farmlands/content_52.html": "We are concerned to hear from residents regarding fox culling at Beddington Farmlands.\nThe timing of this cull is a particular worry as fox cubs are born in Spring and are dependent on their mother vixens for food and to survive.\nWe have contacted representatives of Valencia Waste Management, who manage Beddington Farmlands, and Sutton Council, asking further questions, and await a response. We will update further as we have more information.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_newsletter/content_53.html": "Fairfield Spring Newsletter 30 April 2023 / 16 June 2024 by Read all about what Fairfield's Green councillors have been up to in the Spring Update newsletter. Read more » councillors croydon fairfield newsletter",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_croydon_page_2/content_11.html": "Fairfield Spring Newsletter 30 April 2023 / 16 June 2024 by Read all about what Fairfield's Green councillors have been up to in the Spring Update newsletter. Read more » councillors croydon fairfield newsletter\nOur 2022 Manifesto for Croydon 8 November 2021 / 16 June 2024 by nicholasburmanvince Read more » announcement croydon",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_fairfield/content_16.html": "Our Fairfield Councillor Roundup for December 31 December 2023 / 16 June 2024 by Your Green Councillors were really busy throughout 2023! Here are some of the actions Ria Patel and Esther Sutton were taking in December. Read more » councillors croydon fairfield roundup\nOur Fairfield Councillor Roundup for November 30 November 2023 / 16 June 2024 by When Green Councillors are elected, they really work hard for you, and it really makes a difference! Here are just some of the things Ria and Esther Sutton have been doing in November. Read more » councillors croydon fairfield roundup\nOur Fairfield Councillor Roundup for October 31 October 2023 / 16 June 2024 by Greens don't just turn up at election time - Greens work hard for you all the time! Here are just some of the things Ria Patel and Esther Sutton were doing in October. Read more » councillors croydon fairfield roundup\nFairfield Spring Newsletter 30 April 2023 / 16 June 2024 by Read all about what Fairfield's Green councillors have been up to in the Spring Update newsletter. Read more » councillors croydon fairfield newsletter",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2021_11_08_our-2022-manifesto-for-croydon/content_18.html": "Skip to content\nSkip to footer\nSutton & Croydon\nMenu\nAbout\nOur Councillors\nGet Involved\nNews\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nAnnouncements\nOur 2022 Manifesto for Croydon\nOur 2022 Manifesto for Croydon\n8 November 2021\n/\n16 June 2024\nby\nnicholasburmanvince\nTo top",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2024_06_05_aasha-anam-is-our-general-election-candidate-for-sutton-and-cheam/content_29.html": "Croydon and Sutton Green Party are delighted to announce that Aasha Anam has been selected as our General Election candidate for the constituency of Sutton and Cheam.\nAasha said:\n“We all know that politics is broken and we deserve far better. So I joined the Green Party to ‘be the change I want to see’. I want to bring integrity, transparency and ethics back into politics and I promise to be a representative that you can trust.\nAs a renter for 20+ years I have seen the unbelievable rise in rents accompanied by falling standards from landlords. Our commitment to affordable, secure and healthy accommodation as a basic human right will lead to affordable rents and a rental market that is fair for everyone.\nIn my professional life I have seen that training levels are far lower in the UK than in other similar countries. This not only holds back the UK economy and our transition to a sustainable future but also impacts the life chances for people who want to build a successful career. The Green Party’s re-skilling strategy will help us achieve real change and build the sustainable economy that will benefit us all.\nThe recent situation in Gaza highlighted for me the problem with too many of our politicians. I was pleased to see that right from the outset the Green Party took a stand for justice, human rights, and working for a peaceful solution, while other parties and politicans dithered and some actually supported violations of international law. We need politicians who we can trust to stick to their principles.\nWe deserve better than the other parties are offering and if you want better you have to vote for it. That’s why I’m telling everyone that this time you need to vote Green”\nAbout Aasha\nAasha works for an International Recruitment Agency focussed in creating careers to power a sustainable future. She specialises in finding and matching people to jobs internationally and in the last few years has focussed heavily in the Retraining/Upskilling and Early Careers sectors.\nAasha lives locally but has spent time living and working in other countries. She brings this wealth of experience into her professional and political life.\nAway from work, Aasha enjoys spending time outdoors and walking her dog.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_contact/content_23.html": "Skip to content\nSkip to footer\nSutton & Croydon\nMenu\nAbout\nOur Councillors\nGet Involved\nNews\nContact\nJoin\nDonate\nJoin\nDonate\nMenu\nHome\nContact\nContact\nGet in touch\nYour name\nYour email\nSubject\nYour message (optional)\nFollow Us On Social Media\nCroydon\nFacebook\nInstagram\nTwitter/X\nSutton\nFacebook\nTwitter/X\nTo top",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2025_03_27_peter-friel-is-our-by-election-candidate-for-sutton-central/content_2.html": "Sutton Green Party are pleased to announce that Peter Friel is standing as our candidate for the upcoming Council by-election in Sutton Central Ward on 10 April.\nPeter lives in the ward and has lived in Sutton all of his life. Peter works in the financial sector and has organised numerous fundraising events for cancer charities.\nPeter said:\n“I am standing for election because we need a resident’s voice on the Council. It feels like the Council is just petty squabbles between the political parties and we need someone to stand up for people who live here.\nI believe in better public services; I care about protecting our precious green spaces; and I believe that our Council should treat everyone fairly and decently – that’s why I’m standing as the Green Party candidate.\nMy wife and I have brought up our daughter here and so we know what it’s really like to live here, to use local schools, our NHS, and suffer the declining services from Sutton Council. If you want someone who you know will really fight for the local area to make things better for us living here, then please vote for me to be your new Councillor on April 10th.”",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_candidate/content_45.html": "Aasha Anam is our General Election candidate for Sutton & Cheam 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Aasha Anam has been selected as our General Election candidate for the constituency of Sutton and Cheam. Aasha said: “We all know that politics is broken and we deserve far better. So I joined the Green Party to ‘be the change I want to see’. […] Read more » announcement candidate general election sutton sutton & cheam\nTracey Hague is our General Election candidate for Carshalton & Wallington 5 June 2024 / 16 June 2024 by Sutton & Croydon Green Party are delighted to announce that Tracey Hague has been selected as our General Election candidate for the seat of Carshalton and Wallington. Tracey said: “I am pleased to have been selected again to stand for the Green Party in Carshalton and Wallington. I know people in this area have really […] Read more » announcement candidate Carshalton & Wallington general election sutton\nRia Patel is our General Election candidate for Croydon West 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Ria Patel has been selected as our General Election candidate for the new seat of Croydon West. Ria said “I am proud to be selected to stand for the Green Party in the area where I already work as a local Councillor. I’m standing to […] Read more » announcement candidate croydon croydon west general election\nScott Ainslie is our General Election candidate for Streatham & Croydon North 14 March 2024 / 16 June 2024 by The Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North. Read more » announcement candidate croydon general election lambeth streatham and croydon north\nElaine Denise Garrod is our General Election candidate for Croydon South 14 November 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Elaine Denise Garrod has been selected as our General Election candidate for the seat of Croydon South. Elaine said: “I am really pleased to be selected to stand for the Green Party in Croydon South, to offer people realistic hope for the future. Over recent […] Read more » announcement candidate croydon croydon south general election\nPeter Underwood is our General Election candidate for Croydon East 24 October 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Peter Underwood has been selected as our General Election candidate for the new seat of Croydon East. Peter said: “I am so pleased to be selected as the candidate for the area where I live. I’m proud to be standing for the Green Party to […] Read more » announcement candidate croydon croydon east general election",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_carshalton-wallington/content_38.html": "Tracey Hague is our General Election candidate for Carshalton & Wallington 5 June 2024 / 16 June 2024 by Sutton & Croydon Green Party are delighted to announce that Tracey Hague has been selected as our General Election candidate for the seat of Carshalton and Wallington. Tracey said: “I am pleased to have been selected again to stand for the Green Party in Carshalton and Wallington. I know people in this area have really […] Read more » announcement candidate Carshalton & Wallington general election sutton",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_croydon-south/content_10.html": "Elaine Denise Garrod is our General Election candidate for Croydon South 14 November 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Elaine Denise Garrod has been selected as our General Election candidate for the seat of Croydon South. Elaine said: “I am really pleased to be selected to stand for the Green Party in Croydon South, to offer people realistic hope for the future. Over recent […] Read more » announcement candidate croydon croydon south general election",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_get-involved/content_22.html": "We have a real opportunity to create a more sustainable and socially equitable Sutton and Croydon.\nThe number of elected Green Party councillors has grown rapidly in recent years and in May 2022, we elected our first Green Party councillors for Fairfield, Croydon: Ria Patel and Esther Sutton.\nWe have a variety of tasks to get involved with, from leafleting to data entry, all of which are important.\nIf you’re interested in getting involved with Sutton & Croydon Green Party, fill out the form below, telling us what you’re interested in and the skills you’ll bring to our team. We’ll be in touch!\nYou can also join the Green Party. You don’t have to be a Green Party member to volunteer with us, but it’s the best way to stay connected with what’s happening nationwide, supporting our movement for real hope, and real change.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2023_12_31_deceber-2023-fairfield-councillor-roundup/content_31.html": "Your Green Councillors were really busy throughout 2023! Here are some of the actions Ria Patel and Esther Sutton were taking in December:\n- Ria spoke at the council meeting to highlight the problems with the mayor’s housing strategy and also attended a meeting on community-led housing.\n- Esther met with local business owners to discuss planning applications and Ria visited the new Kurdish community café at West Croydon – Share Café.\n- Esther and Ria helped organised the vigil outside the Home Office to remember Leonard Farruku who died on the Bibby Stockholm and to protest the hostile immigration system.\nRia also raised the lack of housing for refugees in the council meeting. - Ria and Esther took part in the Christmas big give at Our Space organised by Percy’s Homeless Hub.\n- Ria spoke at a number of protests calling for a ceasefire in Palestine and Israel.\n- Ria attended the new Advisory Forum on Active, Sustainable and Accessible Transport in Croydon – a forum we have been calling for for over a year.\nWe wish you all a happy new year and looking forward to getting even more hardworking Greens elected in 2024!",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_2024_06_05_ria-patel-is-our-general-election-candidate-for-croydon-west/content_14.html": "Croydon and Sutton Green Party are delighted to announce that Ria Patel has been selected as our General Election candidate for the new seat of Croydon West.\nRia said\n“I am proud to be selected to stand for the Green Party in the area where I already work as a local Councillor. I’m standing to be your MP because we need real change, and the other parties just aren’t offering that.\nWe need significant change to restore our public services, especially our NHS. We need to end the failed privatisation experiment and return the focus to providing a public service, not making a private profit.\nWe also need significant change on the protection of human rights, in the UK and across the world. We need politicians who will stand up for what’s right, not breaking the law. And when we see other countries breaking international law we should be part of the prosecution not making pathetic excuses to defend them.\nI am also standing to be your MP because I want to be a voice for local people and fight to improve our area, particularly our beautiful green spaces. MPs from other Parties are told what do and what to say by their Party bosses. Greens aren’t like that and I will be free to speak up for you.\nThe Greens have already overtaken the Conservatives in much of area and we are the real rivals to Labour. I have shown as a local Councillor that I will stand up for local people and I will do so as your MP.”\nAbout Ria\nRia was born and raised in Croydon and is Croydon’s youngest and first non-binary councillor. They are a councillor for Fairfield, Croydon’s town centre and are the Chair of the Streets and Environment Scrutiny Sub-Committee, as well sitting on the Licensing Committee too. Within the Green Party of England and Wales, they are the Equalities & Diversity spokesperson and a committee member of the Green Party’s Campaign’s Committee.\nHere in Croydon, Ria is a trustee and director of Croydon Pride and the Fuel Poverty Director for Croydon Community Energy, organising their energy advice sessions. She also volunteers at Croydon Urban Mushroom Farm, which is in Fairfield and a part of Croydon Circular Economy.\nBefore being elected Ria studied Psychology at university and was involved in various Green Party liberation groups, as well as campaigns for migrant justice, LGBTIQA+ rights and climate action.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_councillor-updates/content_5.html": "You can sign up for updates from our Green councillors direct to your inbox via the button here or you can see the latest roundups and newsletters from them below!\nNews from your Green Councillors\n- Our Fairfield Councillor Roundup for AugustHere’s what your Green Party Croydon councillors Ria Patel and Esther Sutton got up to in August 2024.\n- Our Fairfield Councillor Roundup for DecemberYour Green Councillors were really busy throughout 2023! Here are some of the actions Ria Patel and Esther Sutton were taking in December.\n- Our Fairfield Councillor Roundup for NovemberWhen Green Councillors are elected, they really work hard for you, and it really makes a difference! Here are just some of the things Ria and Esther Sutton have been doing in November.\n- Our Fairfield Councillor Roundup for OctoberGreens don’t just turn up at election time – Greens work hard for you all the time! Here are just some of the things Ria Patel and Esther Sutton were doing in October.",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_woodside/content_32.html": "Nicholas Burman-Vince is our by-election candidate for Woodside 8 April 2024 / 8 April 2024 by Croydon Green Party are delighted to announce that Nicholas Burman-Vince will be our candidate for the Woodside by-election for Croydon Council on 2nd May. Read more » announcement croydon woodside",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_councillors/content_42.html": "Our Fairfield Councillor Roundup for August 31 August 2024 / 2 October 2024 by Ian Bridgeman Here’s what your Green Party Croydon councillors Ria Patel and Esther Sutton got up to in August 2024. Read more » councillors croydon roundup\nOur Fairfield Councillor Roundup for December 31 December 2023 / 16 June 2024 by Your Green Councillors were really busy throughout 2023! Here are some of the actions Ria Patel and Esther Sutton were taking in December. Read more » councillors croydon fairfield roundup\nOur Fairfield Councillor Roundup for November 30 November 2023 / 16 June 2024 by When Green Councillors are elected, they really work hard for you, and it really makes a difference! Here are just some of the things Ria and Esther Sutton have been doing in November. Read more » councillors croydon fairfield roundup\nOur Fairfield Councillor Roundup for October 31 October 2023 / 16 June 2024 by Greens don't just turn up at election time - Greens work hard for you all the time! Here are just some of the things Ria Patel and Esther Sutton were doing in October. Read more » councillors croydon fairfield roundup\nFairfield Spring Newsletter 30 April 2023 / 16 June 2024 by Read all about what Fairfield's Green councillors have been up to in the Spring Update newsletter. Read more » councillors croydon fairfield newsletter",
  "https_suttonandcroydon_greenparty_org_uk_/https_suttonandcroydon_greenparty_org_uk_tag_general-election/content_13.html": "Aasha Anam is our General Election candidate for Sutton & Cheam 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Aasha Anam has been selected as our General Election candidate for the constituency of Sutton and Cheam. Aasha said: “We all know that politics is broken and we deserve far better. So I joined the Green Party to ‘be the change I want to see’. […] Read more » announcement candidate general election sutton sutton & cheam\nTracey Hague is our General Election candidate for Carshalton & Wallington 5 June 2024 / 16 June 2024 by Sutton & Croydon Green Party are delighted to announce that Tracey Hague has been selected as our General Election candidate for the seat of Carshalton and Wallington. Tracey said: “I am pleased to have been selected again to stand for the Green Party in Carshalton and Wallington. I know people in this area have really […] Read more » announcement candidate Carshalton & Wallington general election sutton\nRia Patel is our General Election candidate for Croydon West 5 June 2024 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Ria Patel has been selected as our General Election candidate for the new seat of Croydon West. Ria said “I am proud to be selected to stand for the Green Party in the area where I already work as a local Councillor. I’m standing to […] Read more » announcement candidate croydon croydon west general election\nScott Ainslie is our General Election candidate for Streatham & Croydon North 14 March 2024 / 16 June 2024 by The Green Party are delighted to announce that Scott Ainslie has been selected as our General Election candidate for the new seat of Streatham and Croydon North. Read more » announcement candidate croydon general election lambeth streatham and croydon north\nElaine Denise Garrod is our General Election candidate for Croydon South 14 November 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Elaine Denise Garrod has been selected as our General Election candidate for the seat of Croydon South. Elaine said: “I am really pleased to be selected to stand for the Green Party in Croydon South, to offer people realistic hope for the future. Over recent […] Read more » announcement candidate croydon croydon south general election\nPeter Underwood is our General Election candidate for Croydon East 24 October 2023 / 16 June 2024 by Croydon and Sutton Green Party are delighted to announce that Peter Underwood has been selected as our General Election candidate for the new seat of Croydon East. Peter said: “I am so pleased to be selected as the candidate for the area where I live. I’m proud to be standing for the Green Party to […] Read more » announcement candidate croydon croydon east general election"
}