{
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_page-7/content_11.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_our-campaigns_mural-sheendale-pedestrian-bridge/content_25.html": "Petition for Mural at Sheendale Rd Pedestrian Bridge\nWe, the undersigned, feel that the pedestrian bridge linking Sheendale Rd and St Mary’s Grove has suffered from years of neglect. Whilst we are grateful for the lighting which was added in the past 2 years, we feel it would really benefit from a mural celebrating our local area – much like the one recently unveiled at Barnes Station. Please accept these signatures as an expression of our support for the project and the request for funding required to make it happen.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_our-campaigns_richmond-parks-police/content_18.html": "Save the Royal Parks Police\nWe are concerned at the recent announcement that due to police cuts policing units within the Royal Parks will be disbanded. Richmond Park and Bushy Park have remained comparatively safe with low levels of anti-social behaviour because of the work and specialist knowledge of the Parks Police stationed there. We call on the Home Office to adequately fund the MET police so this action doesn't become needed - please sign our petition below.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_our-team/content_13.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_page-2/content_29.html": "Richmond Lib Dems slam Government withdrawal of £1Million Air Quality grant\nLiberal Democrat Councillors leading the London Borough of Richmond upon Thames, have expressed grave concern that a crucial £1million grant awarded from the Department of Environment, Food and Rural Affairs (Defra) has been suddenly withdrawn.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_obituary-adrian-slade-cbe/content_31.html": "Obituary: Adrian Slade, CBE (1936–2025)\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nAdrian was elected to the Greater London Authority (GLA) in 1981 as the member for Richmond (in an upset win from the Conservatives, by just 115 votes) and remained on the Authority (as Leader of the SDP–Liberal Alliance) until its abolition by Mrs Thatcher’s Government in 1986.\nHe was the Liberal Party’s last elected President (1987-88) and part of the negotiating team that saw the Party and SDP merge in 1987 to form the Liberal Democrats. He was Vice-President of the Liberal Democrats from 1988-89, serving with Ian Wrigglesworth, the first President of the Liberal Democrats.\nAdrian was a parliamentary candidate himself in the 1960s (joining the party in 1963, under Jo Grimmond) and 70s, contesting Putney in 1966, 1970 and twice in 1974; he stood as the SDP–Liberal Alliance candidate in Wimbledon in 1987, helping beat Labour into second place. Adrian was also Head of Communications for successive Liberal Leaders: Jo Grimond, Jeremy Thorpe and David Steel, helping to write the party’s manifesto in 1966.\nHe lived in Mortlake for many years (with his wife Sue, who survives him in the residential home they both eventually moved to in Kingston Hill) and was an indefatigable campaigner, playing a huge role in seeing Jenny Tonge, Susan Kramer and Sarah Olney elected to Parliament.\nAdrian also had a great hinterland. Those of us who have ever attended the Glee Club at a Party Conference have Adrian to thank for having started the tradition; he was a leading light and star attraction of the Glee Club and shared his talents as a pianist and singer with his brother, Julian Slade (of Salad Days fame). He was one of the great Ad men when that profession was at its height (founding his own ad agency), including producing some of the great political ads of the time. So much more could be listed.\nHis son, Rupert, remembers him as “a father and friend who lived a full life: cabaret performer, adman, politician, Director of Charities, activist Chelsea fan, test cricket enthusiast, photographer, pianist and song writer. He was a passionate man with many passions.”.\nHis family have held a private funeral service this week, but with a memorial event for Adrian to follow in March or April – we will post an update here when the details of the memorial service are known.\nPiers Allen\nChair, TRLD\n7 February 2025\nMy thanks for input from Nick Carthew, Rupert Slade and Ian Wrigglesworth.\nA tribute to Adrian (and a link to donate to the family’s chosen charity, Dementia UK) is available here",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk/content_1.html": "Obituary: Adrian Slade, CBE (1936–2025)\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nSerge Lourie dedicated much of his life to public service and bettering the lives of those around him.\nTwickenham & Richmond Liberal Democrats kick off their General Election Campaign.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_affordable-homes/content_21.html": "Affordable Homes\nWe all know there is a housing crisis and there are many families in our Borough living in temporary accommodation with little security or stability.\nWe are committed to increasing the supply of affordable housing. One of the latest applications for the former Greggs Bakery site has 50% genuinely affordable housing, which will make a real difference providing homes for more than 50 low-income families.\nCllr Alan Juriansz says:\n“We are very pleased to see an application come forward for this site with this level of social housing but we still have to ensure any detrimental effects on the neighbouring community are minimised and benefits are maximised.”\n“We are scrutinising the plans and hope that conditions are applied to ensure the development is welcomed by everyone.”\nResidents can view and comment on the Planning Applications at https://www.richmond.gov.uk/",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_our-team_councillors/content_16.html": "Our Councillors\nFor the Liberal Democrats, local government is key – localism, community politics, and a real commitment to devolved power are all hallmarks of the Liberal Democrat approach. We pride ourselves on working hard “all year round, not just at election time”.\nThe Liberal Democrats have 49 of 54 Councillors on Richmond Council, please find their contact details below.\nThe Greens have five councillors and the Conservatives one Councillor, every ward has at least one Liberal Democrat representative\nBarnes\nCouncillor Andy Hale - cllr.a.hale@richmond.gov.uk\nCouncillor Marjory Millum - cllr.m.millum@richmond.gov.uk\nCouncillor Fiona Sacks - cllr.f.sacks@richmond.gov.uk\nEast Sheen\nCouncillor Julia Cambridge - Cllr.J.Cambridge@Richmond.gov.uk\nCouncillor Margaret Dane - cllr.m.dane@richmond.gov.uk\nCouncillor Zoe McLeod - cllr.z.mcleod@richmond.gov.uk\nFullwell and Hampton HIll\nCouncillor Jonathan Cardy - Cllr.J.Cardy@richmond.gov.uk\nCouncillor Matthew Hull - cllr.m.hull@richmond.gov.uk\nHam, Petersham and Richmond Riverside\nCouncillor Penelope Frost - Cllr.P.Frost@richmond.gov.uk\nCouncillor Gareth Richards - cllr.g.richards@richmond.gov.uk\nHampton\nCouncillor Gareth Roberts - Cllr.G.Roberts@richmond.gov.uk\nCouncillor Sam Dalton - Cllr.S.Dalton@richmond.gov.uk\nCouncillor Suzette Nicholson - Cllr.S.Nicholson@richmond.gov.uk\nHampton North\nCouncillor Carey Bishop - cllr.c.bishop@richmond.gov.uk\nCouncillor Jeremy Davis - cllr.j.davis@richmond.gov.uk\nCouncillor Elizabeth Gant - cllr.e.gant@richmond.gov.uk\nHampton Wick and South Teddington\nCouncillor Robin Brown - cllr.r.brown@richmond.gov.uk\nCouncillor Petra Fleming - Cllr.Petra.Fleming@richmond.gov.uk\nCouncillor Jim Millard - cllr.j.millard@richmond.gov.uk\nHeathfield\nCouncillor John Coombs - Cllr.j.Coombs@richmond.gov.uk\nCouncillor Lesley Pollesche - cllr.l.pollesche@richmond.gov.uk\nCouncillor Michael Wilson - cllr.m.wilson@richmond.gov.uk\nKew\nCouncillor Alice Bridges-Westcott - cllr.a.bridges-westcott@richmond.gov.uk\nCouncillor Ian Craigie - cllr.i.craigie@richmond.gov.uk\nCouncillor Clare Vollum - cllr.c.vollum@richmond.gov.uk\nMortlake and Barnes Common\nCouncillor Anton McNulty-Howard - cllr.a.mcnulty-howard@richmond.gov.uk\nCouncillor Tony Paterson - cllr.t.paterson@richmond.gov.uk\nNorth Richmond\nCouncillor Nancy Baldwin - cllr.n.baldwin@richmond.gov.uk\nCouncillor Richard Pyne - cllr.r.pyne@richmond.gov.uk\nCouncillor Richard Warren - cllr.r.warren@richmond.gov.uk\nSouth Richmond\nCouncillor Chris Varley - cllr.c.varley@richmond.gov.uk\nCouncillor Paulina Vassileva - cllr.p.vassileva@richmond.gov.uk\nSouth Twickenham\nCouncillor Michael Butlin - cllr.m.butlin@richmond.gov.uk\nCouncillor Rhi Lee - cllr.r.lee@richmond.gov.uk\nSt Margarets and North Twickenham\nCouncillor Alexander Ehmann - Cllr.A.Ehmann@richmond.gov.uk\nCouncillor Ben Khosa - Cllr.B.Khosa@richmond.gov.uk\nCouncillor Katie Mansfield - cllr.k.mansfield@richmond.gov.uk\nTeddington\nCouncillor Richard Baker - Cllr.R.Baker@richmond.gov.uk\nCouncillor Charlie Engel - Cllr.C.Engel@richmond.gov.uk\nCouncillor Phil Giesler - cllr.p.giesler@richmond.gov.uk\nTwickenham Riverside\nCouncillor James Chard - cllr.j.chard@richmond.gov.uk\nCouncillor Julia Neden-Watts - cllr.j.neden-watts@richmond.gov.uk\nCouncillor Stephen O'Shea - cllr.s.oshea@richmond.gov.uk\nWest Twickenham\nCouncillor Piers Allen - Cllr.P.Allen@richmond.gov.uk\nCouncillor Alan Juriansz - cllr.a.juriansz@richmond.gov.uk\nCouncillor Laura O'Brien - cllr.l.obrien@richmond.gov.uk\nWhitton\nCouncillor Jo Humphreys - cllr.j.humphreys@richmond.gov.uk\nCouncillor Rob O`Carroll - cllr.r.ocarroll@richmond.gov.uk\nCouncillor Kuldev Sehra - cllr.k.sehra@richmond.gov.uk",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_donate_saraholney/content_50.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowDonate to support Sarah's re-election campaign. All contributions will go to ensuring that we keep Richmond Park gold.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_sarah_event-followup/content_41.html": "Register your interest\nThank you for joining Baroness Kramer and me at this breakfast. If you would like to support my work, please fill in the form below and/or donate with the button at the end.\nThank you for joining Baroness Kramer and me at this breakfast. If you would like to support my work, please fill in the form below and/or donate with the button at the end.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_donate/content_37.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_tangiergreen/content_5.html": "Lighting For Tangier Green In The Winter\nWe, the undersigned, respectfully request that Richmond Council please provide sufficient lighting on the playground at Tangier Green so that the young children for whom it is intended (the under 10’s) can safely use it after school during the winter months when it becomes dark very early. We understand the sensitivities around light pollution and its effect on people and wildlife alike, but we feel that this must be weighed against the health and well-being benefits of outdoor play for young children.\nChildhood obesity is a rising problem. Outdoor play is a key way to deal with the problem. Mental ill-health among our children is a difficult challenge with few resources to combat it. Surely prevention is better than cure? Finally, after school clubs and activities cost money. With the Cost of Living crisis still very much present for many of our neighbours, keeping families from fully utilising a free recreation amenity misses the opportunity to support the well-being of our community.\nWith the support of our local North Richmond councillors, we present this petition to you with respect and faith that you will look at our request with sympathy and compassion.\nPetition for Lighting at Tangier Green to 7pm in Winter Months\nI support the Council adding lighting to Tangier Green during the winter months.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_no3rdrunway/content_22.html": "Stop Heathrow's Third Runway Expansion Plans\nThe Labour Government has given the green light to Tory expansion plans for Heathrow Airport. The Lib Dems are the only main party to consistently oppose a third runway because of the noise and pollution impact on residents and the damage it will do to our climate. We want a better Heathrow, not a bigger one. We call on the Government to reconsider and oppose the expansion of Heathrow - please sign our petition.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-lib-dem-council-gets-tough-on-fly-tipping-with-increased-fines-of-up-to-pound1000/content_20.html": "Richmond Lib Dem Council Gets Tough on Fly Tipping With Increased Fines of up to £1,000\nThis change to local policy increases the Fixed Penalty Notice charge for those caught fly-tipping from £400 to £1000, following a change in government legislation.\nThe Lib Dem’s environment lead, Julia Neden-Watts, said:\n\"We want the borough's streets to be kept clean, green and safe for everyone.\n\"There is no excuse for fly-tipping in Richmond upon Thames. We have re-use and recycling services at Townmead Road, as well as a bulky waste collection service for those who prefer larger items to be picked up from their property. We have regular domestic waste and recycling collections from households, and local recycling sites for those without a kerbside recycling collection service. We've also introduced a programme of mega skips across the borough to help residents dispose of unwanted items responsibly and conveniently.\n\"Fly-tipping is anti-social, harmful to wildlife, and an eyesore. It's especially offensive to those who live or work nearby and dispose of their waste responsibly.\n\"From now on, anyone who is found to have fly-tipped will face a fine of up to £1,000.\"\nThe penalty will be reduced to £500 if paid within ten days.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_sarah/content_38.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.\nSign up for email updates\nDonate!\nElections are expensive. Unlike the Conservatives and Labour, we don't have big businesses or trade unions supporting us. We rely on people like you. Donate to help us keep Richmond Park gold.\nHelp us Win",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_search/content_23.html": "Light Playground At Tangier Green To 7pm In Winter Months Lighting For Tangier Green In The Winter We, the undersigned, respectfully request that Richmond Council please provide sufficient lighting…\nMunira Wilson MP 383 382 MuniraWilson Elections are expensive. Unlike the Conservatives and Labour, we don't have big businesses or trade unions supporting us. We rely on people like you.…\nSarah Olney MP Subscribe to my weekly newsletter 383 382 saraholney Elections are expensive. Unlike the Conservatives and Labour, we don't have big businesses or trade unions supporting us.…",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_events/content_10.html": "Meet Calum Miller MP, Foreign Affairs Spokesperson\n-\n09 May 2025\n-\n11.00 am - 1.00 pm\n-\n62 Mount Ararat Road\nRichmond\nTW10 6PJ\nJoined by Sarah Olney MP, we will be welcoming Calum Miller MP, Lib Dem spokesperson for Foreign Affairs, for a formal(ish) Q&A and an informal lunch.\nThis is a great opportunity to ask your questions on the many international affairs that are impacting our national agenda, and potentially influence Lib Dem policy too.\nSpaces are limited, get your ticket before time runs out.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_contact-us/content_9.html": "Contact Us\nYou can contact the Twickenham and Richmond Liberal Democrats by email or by phone. If you have any local issues you would like to report to the Lib Dems we are happy to pass it onto your ward campaigners and Councillors.\nCall: 020 8819 4332\nEmail: campaigns@trlibdems.org.uk\nThe Lib Dems work hard all year round, so do get in touch if there is something which you would like to report.\nWho else can help?\n- Bin collections\n- City planning and growth\n- Housing\n- Benefits\n- Schools\n- Highways\n- Strategic planning matters",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_munira/content_32.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.\nSign up for email updates\nDonate!\nElections are expensive. Unlike the Conservatives and Labour, we don't have big businesses or trade unions supporting us. We rely on people like you. Donate to help us keep Twickenham gold.\nHelp us Win",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_lib-dem-council-supports-new-library-of-things-at-patch-twickenham/content_42.html": "Lib Dem Council supports new “Library of Things” at Patch Twickenham\nRichmond’s Lib Dem Council has joined forces with Library of Things and Twickenham co-working space Patch (42 York Street) to open the borough’s first branch of the “Library of Things” social enterprise. It helps people save money and reduce waste by sharing common items they use rarely, rather than buying new.\nLibrary of Things works like a library, but instead of books, residents can rent out over 30 useful household items like drills, carpet cleaners, hedge trimmers, sound systems and sewing machines for as little as a few pounds a day. It also encourages people to share DIY, upcycling and repair skills.\nResidents can reserve items online and collect from self-service lockers in Patch’s ground floor, which is a short walk from Twickenham Station and beside two bus stops with convenient routes across the borough.\nJulia Neden-Watts, Richmond’s Lib Dem environment lead, said:\n“We’re really pleased to bring the Library of Things to Richmond upon Thames, giving residents a convenient opportunity to hire things locally rather than buying new. This will help people save money and reduce emissions related to unnecessary transportation, packaging and waste of items that are purchased and used once.”",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-lib-dem-council-calls-on-housing-associations-invest-in-improving-existing-homes-as-well-as-new-development/content_44.html": "Richmond Lib Dem Council calls on housing associations: invest in improving existing homes as well as new development\nRichmond’s Liberal Democrat Council administration has launched a five-point Richmond Social\nHousing Improvement Plan calling on housing associations to address disrepair and invest in\nupgrades to existing social housing as a vital counterpart to continuing to work together on new\ndevelopment of genuinely affordable homes.\nDuring a meeting of the full Council, Deputy Leader Councillor Jim Millard, who is the\nadministration’s lead member for housing, voiced the Council’s commitment to ensuring the needs of existing social housing residents are met:\n“This council believes investing in the homes of existing social housing residents is just as important as creating new social housing. We will now only give Richmond housing grants for new\ndevelopments to housing associations who engage with our 5-point Richmond Social Housing\nImprovement Plan.”\nThe Lib Dem Plan sets the following five requirements for social housing providers as a condition of continued development partnership:\n1. Investing in existing homes – tackling disrepair, damp and mould\n2. Investing in improving repairs services\n3. Investing in strong communities – improving communal areas with a zero-tolerance\napproach to disrepair, tackling antisocial behaviour\n4. Putting residents’ voices at the heart of decision-making\n5. Investing in sustainability – retrofitting for environmental performance and tackling fuel\npoverty\nCllr Millard went on to say, “It’s absolutely vital we invest in creating new genuinely affordable\nhousing. At the same time it’s also vital that, as they watch these new homes being created,\nresidents in existing social housing know that they have not been forgotten. The condition of their\nhomes, the sustainability and affordability of their homes and the resilience and safety of their\ncommunities must be invested in. Their voices must be heard and that’s why we’re calling for\nresidents to be put at the heart of decision making.”\nThe Lib Dem council have brought in an unprecedented level of scrutiny for a local authority, with\nthe four main housing associations in the borough all now reporting to the Adult Social Care, Health and Housing committee annually following a standard report template developed to assist these housing associations on reporting their key performance metrics, service delivery and workstreams, including how they are maintaining their housing stock and their performance against the new Tenant Satisfaction Measures.\nCllr Millard said, “The committee will now add to their ongoing scrutiny their consideration of\nhousing associations’ performance in relation to the Richmond Social Housing Improvement Plan\nand that will inform committee decisions on whether to award development grant for future\nprojects, assuring residents that Richmond Council grant support for development of new genuinely affordable homes in the borough is directly connected to driving investment in existing homes. Both are absolutely vital for ensuring a brighter future for all the borough’s residents”",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news/content_26.html": "Obituary: Adrian Slade, CBE (1936–2025)\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nSerge Lourie dedicated much of his life to public service and bettering the lives of those around him.\nTwickenham & Richmond Liberal Democrats kick off their General Election Campaign.\nLiberal Democrat Councillors leading the London Borough of Richmond upon Thames, have expressed grave concern that a crucial £1million grant awarded from the Department of Environment, Food and Rural Affairs (Defra) has been suddenly withdrawn.\nRichmond’s Liberal Democrat administration is embarking on a campaign to drive improvements in standards of social housing for its residents.\nRichmond Borough’s Liberal Democrat led council has been rated the \"Best in London” in its Adult Social Care Performance Report - having outperformed the 30 other London councils taking part in the annual Adult Social Care Outcomes Framework.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_our-team_gareth-roberts-am/content_2.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-lib-dems-invest-record-amount-in-improving-roads-and-pavements/content_55.html": "Richmond Lib Dems Invest Record Amount in Improving Roads and Pavements\nRichmond’s Lib Dem Council is investing more than ever before to keep its roads and pavements in good condition and reverse years of Tory neglect.\nThis year alone, £5.17 million has been targeted at repairing potholes and resurfacing parts of the road network.\nCllr Alexander Ehmann, Liberal Democrat Chair of the Council’s Transport and Air Quality Committee, said:\n“Investing in our roads and pavements is a critical priority for us as a Liberal Democrat administration – it's an essential part of keeping our public highways and footways safe for all to use.\n“Our sound financial management of the Council finances has seen us able prioritise an additional £1.4million for our maintenance budget this year – increasing our budget by nearly 40%.\n“Our residents expect good quality public services. What better place to focus, than the pavements they walk on and the roads they drive on. That’s why Richmond Liberal Democrats have invested record sums at the same time as exploring how to get more for that money. That includes new technology and ways of working, such as our ground-breaking use of lower-cost, thermal repair equipment.”",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-liberal-democrats-celebrate-successfully-pressuring-jeremy-hunt-to-unfreeze-the-local-housing-allowance/content_28.html": "Richmond Liberal Democrats Celebrate Successfully Pressuring Jeremy Hunt To Unfreeze the Local Housing Allowance\nThe Richmond Liberal Democrats have been relentless in their lobbying of central government to end the freeze on Local Housing Allowance (LHA). It appears that Chancellor Jeremy Hunt has listened to them in his Autumn Statement and made this much-needed change.\nFollowing meetings between Richmond Spokesperson for Housing Cllr Jim Millard and government ministers, Richmond Council Leader Cllr Gareth Roberts and Cllr Millard recently wrote to the Chancellor urging the Government to take action to relieve the financial burden on councils and residents and properly address the rise of homelessness within London. They called on the Chancellor to unfreeze the Local Housing Allowance and raise it to at least 30% of local market rents.\nCommenting on the Chancellor’s decision to do just this, Cllr Jim Millard said:\n“While there is much that is disastrous and wrong in the Chancellor’s Autumn Statement, we are glad that he has at least listened to the Liberal Democrats’ concerns regarding LHA. 1 in 13 private renters in Richmond borough rely on the LHA to cover housing costs but just 0.9% of rental properties within our borough are within current LHA levels. Unfreezing the LHA increases the number of rental properties that fall within LHA levels and provides more support to Richmond residents in need. This is a vital step in tackling the rising levels of homelessness presentations we are seeing in Richmond Upon Thames.\n“All across London, homelessness is increasing and the Government finally unfreezing the LHA and raising it to 30% of local market rents was the bare minimum the Tories could have done. At the moment all that has been promised appears to be a one-year unfreezing, followed immediately by a further freeze from 2025. We call on the government to go further and guarantee LHA will not be frozen again, otherwise we risk a repeat of the exact same emergency we are seeing now.”\nThe Liberal Democrats have consistently urged the government to address the rise in homelessness. The Conservative government has a long way to go before it can claim to have successfully dealt with the issue, but at least they heeded the advice of the Liberal Democrats on Richmond Council in this instance, whilst the rest of the Autumn statement leaves people worse off than before.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_lib-dems-call-for-two-month-cancer-treatment-guarantee-to-support-patients-in-richmond-upon-thames/content_30.html": "Lib Dems call for two month cancer treatment guarantee to support patients in Richmond upon Thames\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral, as part of a plan to boost survival rates and improve treatment for those affected by the disease.\nThe latest NHS figures show that, in the last year, 441 cancer patients in the two main local hospital trusts serving Richmond residents waited more than 62 days to start treatment after being referred. This means only 77% of patients in the area were treated within two months, below the government target of 85%. (Kingston Hospital’s performance of 83.79% within 62 days was the second highest in South West London).\nLiberal Democrat Leader Ed Davey used his Autumn Conference speech to set out proposals to invest an extra £4 billion in NHS cancer treatment over the next five years.\nThe Liberal Democrat plan includes new radiotherapy machines, cutting the time for new medicines to reach patients, a new cancer research law, and better support for cancer patients and their families.\nThe new policy builds on existing proposals from the party on health such as introducing a right to see a GP within a week and expanding NHS dentistry so people aren’t forced to pay for private dental treatment.\nLiberal Democrat health and adult social care spokesperson for Richmond upon Thames, Cllr Piers Allen said:\n“Everyone knows someone whose life has been turned upside down by cancer.\n“Far too many people are still waiting far too long for a diagnosis, or to start treatment after being diagnosed. We must do right by them and get them the care and support they need when they need it.\n“The Liberal Democrats would give cancer patients a new legal right to treatment within two months of an urgent referral, to make sure they get the care they deserve.\n“This forms part of our ambitious plan to end unacceptable cancer delays and boost survival rates.”\nAdditional Information\nNHS statistics on cancer waiting times are available here.\nEd Davey’s keynote speech can be found here.\nThe Liberal Democrats’ five-year cancer plan includes:\n- A two-month cancer treatment guarantee. A new target for 100% of patients to start treatment for cancer within 62 days from urgent referral, with this right written into law. Currently this is only a government pledge, and 40% of patients wait longer than 62 days.\n- Boosting access to radiotherapy. Replace ageing radiotherapy machines and increase their number, as well as widening access so that no one has to travel too far for treatment.\n- Halving the time for new treatments to reach patients. It takes an average of 11 months for a new medicine or medical technology to be approved and available to patients in England, compared to just 4 months in Germany. We will expand the MHRA’s capacity to speed up that process.\n- Passing a Cancer Survival Research Act. New legislation modelled on the US law signed by President Obama in 2013. It would require the Government to coordinate and ensure funding for research into the cancers with the lowest survival rates, including lung, liver, brain and pancreatic cancer.\n- Saving the National Cancer Research Institute. The Government is presiding over the closure of the National Cancer Research Institute, which was established in 2001 and plays a vital role in coordinating cancer research, due to uncertainty over research funding. Its closure has been described by one oncology professor as like “turning off air traffic control and hoping the planes will be fine”.\n- Improving support for patients and their families. Recruit more cancer nurses so that every patient has a dedicated specialist supporting them throughout their treatment. Ensure patients and their families are given information about charities, patient support groups and financial support at every key stage.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-council-slams-tory-economic-incompetence/content_46.html": "Richmond Council slams Tory economic incompetence as it is forced to raise council tax\nHigh inflation and the government’s approach to local government funding are behind the rise in council tax announced by Richmond Council.\nInflation is running at over 10% and this is affecting council budgets as the costs to deliver vital services increase. The government has made it clear that it expects councils to raise council tax to cope with inflation and the increasing demand for social care. The government’s own ‘spending power’ calculations for councils assume a 2.99% increase in core council tax and a 2% adult social care precept on top, in line with Richmond’s increase.\nCllr Gareth Roberts, Leader of the Council, said:\n‘The Conservative party have demonstrated that they just can’t be trusted with the country’s finances. Our economy has been hit by Brexit, the pandemic and the war in Ukraine – and Liz Truss’ disastrous premiership made an already difficult position much worse. They have had to increase taxes and are now pushing an additional burden onto local residents. We can’t avoid an increase in council tax and even so will be making use of reserves to balance the budget.’\nThe Liberal Democrat administration has pledged not to cut services and to make sure that the most vulnerable and the worst off are supported.\nThe council announced earlier in the year an emergency £3m cost of living support fund to help local households, businesses and charities deal with the crisis. Hardship funding will ensure that free school meals during school holidays, grants for those in desperate need and increased fuel grants can all continue.\nIn a move that will help thousands of low-income households, the budget proposals also include taking a further £100 off the bills of those who receive support with their council tax.\nThe Lib Dems have also set aside funding to help those affected by the London Mayor’s ULEZ rollout with alternative travel options.\nCllr Robin Brown, Richmond Council Lead Member for Finance, said:\n‘We are doing everything we can to minimise council costs and had to put in place overnight a £5m efficiency plan to help close a £16m budget gap. We’ve run the council’s finances prudently over the past four years, in the face of persistent Tory calls to ‘freeze council tax’ which as we know would only lead to cuts in services and an unsustainable position. Unlike the previous Tory administration we have tackled the huge special needs funding black hole and controlled borrowing. We know that Richmond residents wouldn’t thank us for cutting services and they want us to support those with the greatest needs.‘\nThe budget was agreed at Richmond’s Council meeting will on Tuesday 7 March.\nCllr Brown added:\n'This Liberal Democrat administration has also made it clear that it is determined to deliver on the manifesto commitments it made at the time of the 2022 elections. We will continue to focus on reducing crime, delivering more affordable housing, pushing forward our climate emergency strategy, helping local businesses and high streets and supporting our children and young people.’\nThe plans for the coming year include:\n- Delivering an action plan to tackle crime and improve the safety of women and girls in the borough\n- Investing in the community safety team to tackle anti-social behaviour, as well as fly-tipping and noise nuisance\n- Delivering more affordable housing on council owned sites and ensuring private developers meet their commitments\n- Expanding tree planting, installing EV charging and bike hangars\n- Looking at flood resilience as part of the climate emergency strategy\n- Creating extra special needs school places\n- Significant extra funding for social care services\n- Becoming a Borough of Sanctuary for refugees and people seeking sanctuary\n- Supporting High Streets and local businesses\n- Investing in our tourism sector and advice programmes for local businesses\n- Transforming Twickenham Riverside\n- Looking after the borough’s roads and pavements\n- Refurbishing Teddington Lock Footbridge\n- Maintaining libraries, playgrounds, leisure centres and parks\n- Supporting the Coronation celebrations\nResidents who need help with Council Tax payments may be entitled to support. Find out more via the Council’s Cost of Living Hub, or by calling 020 8891 1411.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_page-3/content_47.html": "Richmond Liberal Democrats Commit £7m to New Youth and Community Facilities\nRichmond’s Liberal Democrat-run Council is investing nearly £7m to bring much-needed new youth and community facilities to Ham.\nRichmond’s Liberal Democrat-run Council is investing nearly £7m to bring much-needed new youth and community facilities to Ham.\nRichmond’s Lib Dem Council is investing more than ever before to keep its roads and pavements in good condition and reverse years of Tory neglect.\nRichmond’s Liberal Democrat Council has reaffirmed its commitment to supporting residents struggling with the Tory government’s cost of living crisis.\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral, as part of a plan to boost survival rates and improve treatment for those affected by the disease.\nRichmond’s Liberal Democrat Council administration has launched a five-point plan calling on housing associations to address disrepair and invest in upgrades to social housing.\nHigh inflation and the government’s approach to local government funding are behind the rise in council tax announced by Richmond Council.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_back-munira/content_49.html": "Munira Wilson fights for us\nElections in Twickenham are a close fight between the Liberal Democrats and Conservatives\nPeople feel let down and betrayed by this Conservative Government.\nLib Dem Munira Wilson is leading the fight to get a fair deal for our communities.\nIt's Lib Dem Munira vs the Conservatives here - Labour and the Green Party are out of the race.\nBack Munira to stop the Conservatives taking our area for granted.\nI'm backing Munira\nMore and more people are backing local Liberal Democrat Munira Wilson to win in Twickenham at the General Election.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-council-one-of-first-boroughs-to-sign-london-charter-to-end-rough-sleeping/content_17.html": "Richmond Council: One of First Boroughs to Sign London Charter to End Rough Sleeping\nRichmond’s Liberal Democrat Council has been one of the first councils in London to sign the London Charter to End Rough Sleeping. It is leading the call for all other London Boroughs to follow suit and sign up.\nLiberal Democrat Leader of Richmond Council, Cllr Gareth Roberts, signed the Charter along with Deputy Leader and Lead Member for Housing, Cllr Jim Millard, on the steps of the town hall, York House.\nCllr Millard said:\n“I’m delighted that Richmond is an ‘early adopter’ in signing this charter, and fervently encourage all other London boroughs to sign up too. This charter is the first of it’s kind and presents a vital opportunity to drive real change, bringing together local authorities, the voluntary sector and London’s businesses. If we grasp this opportunity, step up and work together we can start to change the story for thousands of people and end rough sleeping in London for good.”\nThe Lib Dem councillors were joined by Pam Orchard, CEO of rough sleeping charity Connection at St Martin’s, which is a founding member of the charter.\nThe Charter has been created by people working in homelessness to bring everyone together around a common goal to end rough sleeping. It communicates what rough sleeping really looks like in London and the best ways we can help.\nCllr Roberts said:\n“As Council leader and as Lib Dem GLA candidate for SW London, I’m calling on all London Boroughs to step up and support this important piece of work.\n“As the charter says, people sleeping rough may have problems but they aren’t problem people. Everyone who sleeps rough is unique and there should be meaningful options for all, regardless of immigration status. A fact the current GLA Conservative incumbent for South West London has done nothing to acknowledge, mutely supporting the performative cruelty of Conservative policy as it continues to do unnecessary harm to thousands of rough sleepers who have no recourse to public funds. It’s time for a change – South West London needs a representative who will support efforts to end rough sleeping. The council supporting this charter is a big step in the right direction, we need more councils, city hall and big business to come together to make sure unhoused people get the support they need. ”\nThe Lib Dems have repeatedly called on the government to do more to support efforts to end rough sleeping, as the cost-of-living crisis continues and local authorities are seeing steeply increasing homeless presentations. Cllr Jim Millard, who is the Liberal Democrat group lead for London Councils on the GLA’s Life off the Streets board, has a particular interest in the collective drive to end rough sleeping across London. He is arranging a briefing for Housing Cabinet Leads from all London local authority areas on the Charter in the new year to encourage more sign-ups in 2024.\nAnyone who supports efforts to end rough sleeping in London and the Charter principles can sign up to the London Charter to End Rough Sleeping here – https://www.connection-at-stmartins.org.uk/news-item/london-charter/#:~:text=The%20London%20Charter%20to%20End%20Rough%20Sleeping%20has%20been%20created,best%20ways%20we%20can%20help",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_page-1/content_36.html": "Obituary: Adrian Slade, CBE (1936–2025)\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nSerge Lourie dedicated much of his life to public service and bettering the lives of those around him.\nTwickenham & Richmond Liberal Democrats kick off their General Election Campaign.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_page-4/content_7.html": "Conservatives Ousted from Richmond Borough Council\nThe Liberal Democrats firmly established their political dominance in Richmond Borough, with two landslide victories in the Hampton North and Teddington by-elections.\nThe Liberal Democrats firmly established their political dominance in Richmond Borough, with two landslide victories in the Hampton North and Teddington by-elections.\nRichmond’s Liberal Democrat Council has been one of the first councils in London to sign the London Charter to End Rough Sleeping. It is leading the call for all other London Boroughs to follow suit and sign up.\nThe Richmond Liberal Democrats have been relentless in their lobbying of central government to end the freeze on Local Housing Allowance (LHA). It appears that Chancellor Jeremy Hunt has listened to them in his Autumn Statement.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_lib-dem-council-takes-action-on-behalf-of-social-housing-tenants/content_51.html": "Lib Dem Council takes action on behalf of social housing tenants\nRichmond’s Liberal Democrat administration is embarking on a campaign to drive improvements in standards of social housing for its residents.\nThe Lib Dems are introducing a Social Housing Improvement Plan (SHIP) for the borough, setting out commitments against which housing associations will make improvements to the existing homes they provide, tackling disrepair, improving services and creating well-insulated, sustainable homes that are affordable to heat.\nCentral to Richmond Lib Dems’ plan are a series of commitments setting out how the Council will work with housing associations to put the resident voice at the heart of decision making and invest in communal areas and projects to build safer, stronger, thriving communities.\nLib Dem councillor Jim Millard, Richmond Council’s Lead Member for Housing and Deputy Leader, said, “You’ll have heard me talk about the importance of delivering our pipeline of over 1,000 new, genuinely affordable homes, and rightly so, but at the same time I want residents to know that what’s equally important to us as a priority is driving improvements in existing social housing.”\nLib Dem councillor Paulina Vassileva, Richmond Council’s Tenants’ Champion, added, “As existing homes get older, it’s vitally important that our housing association partners invest in improving conditions to drive better health and wellbeing for tenants. We’ve listened to what residents in social housing tell us are the priorities and developed this plan together with our housing partners to take action.”\nThe commitments are:\n- Putting the resident voice at the heart of decision making\n- Improving repairs service\n- Tackling defects and disrepair\n- Investing in sustainable homes\n- Investing in safe and strong communities\nCouncillor Millard said, “Our goal is to create a borough where everybody feels secure and supported in their homes and communities. As a Council that doesn’t own social housing, our role is to bring our housing association partners who deliver social housing for our residents together to agree this plan, which goes above and beyond standard regulations and serves our local values and aspirations.\n“These housing associations will report to the Council on the steps they have taken to deliver on these commitments, including doing so publicly at committee every year. We’ll scrutinise and hold them to account and we’ll also support them to succeed, and invest together in building stronger communities. I’m grateful to our housing associations for their collaboration on this plan. I’m proud to present this agreed vision and road map for a brighter future, and I look forward to hearing our residents’ views.”\nRichmond’s Lib Dem-run Council has developed this plan with the following housing associations: RHP, PA Housing, MTVH and L&Q.\nSocial Housing residents are being asked to comment on their concerns and priorities to improve their experiences living in social housing. Feedback will inform a final version of the Social Housing Improvement Plan.\nTenants, leaseholders, voluntary sector organisations and other interested parties are encouraged to participate in the consultation process via an online survey via this link –\nhttps://haveyoursay.citizenspace.com/richmondhrd/ship24\nFor assistance or alternative formats, contact consultation@richmond.gov.uk or call 020 8891 1411",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_tribute-to-serge-lourie/content_6.html": "Tribute To Serge Lourie\nIt is with great sadness that we have learned of the death of Serge Lourie, long time member and former Leader of the Council. Serge was a dedicated public servant who served his community not only on the Council but also through his work with numerous local charities.\nSerge was an active member of the Twickenham & Richmond Liberal Democrats for years. To many of us in the local party he was a friend, mentor and energetic presence.\nWe are in contact with Serge's family and wish them well in this difficult time.\nSerge’s memorial page is https://sergelourie.muchloved.com/. Please consider donating to one of the charities that were important to Serge. Details of his funeral are also available on the memorial page.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_page-3/content_3.html": "Lib Dem Council supports new “Library of Things” at Patch Twickenham\nRichmond’s Lib Dem Council has joined forces with Library of Things and Twickenham co-working space Patch (42 York Street) to open the borough’s first branch of the “Library of Things” social enterprise.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_manorcircus/content_27.html": "Manor Circus Road Works Petition\nWe the undersigned call upon the Mayor of London to extend working hours at the Manor Circus roundabout works in Richmond to 24-hours per day and at Transport for London’s expense to ensure the current phase is completed in November. The disruption caused by these works, including the recent water main burst, is unacceptable and must be ended as soon as possible.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-council-tackles-conservative-homelessness-crisis/content_14.html": "Richmond Council Tackles Conservative Homelessness Crisis.\nCllr Jim Millard, Deputy Leader and Housing Lead, announced that Richmond Council would formally be applying to become a Registered Provider of Social Housing to enable them to expand their direct delivery of temporary accommodation for Richmond Residents to tackle the Conservative homelessness crisis.\nCllr Millard said, “The Cost of Living Crisis caused by the Conservatives' economic mismanagement, has driven has driven a big increase in Richmond residents finding themselves at risk of homelessness whilst at the same time the pool of appropriate properties in the private rented sector has evaporated. As a result, too often Richmond families faced with homelessness are having to be placed in temporary accommodation outside the borough, far from support networks and often with journeys of over 10 miles to school every day.\n“As Liberal Democrats we refuse to stand by and watch this happen. We’re taking action to become a Registered Provider, to enable us to step in and provide appropriate, good quality temporary accommodation within the borough. In the face of a temporary accommodation crisis which has been exacerbated by the soaring cost of living, we need to take swift action to alleviate the impact on Richmond borough residents in need.”\nSeeking Registered Provider status enables Richmond upon Thames Council to become a development partner with the Greater London Authority (GLA) and actively bid for funding to increase the stock of good quality temporary accommodation within the borough.\nAt the same time, the Liberal Democrats have been lobbying Government to unfreeze benefits that will help this crisis. Cllr Gareth Roberts, Leader of Richmond Council, this week wrote to the Chancellor, Jeremy Hunt, saying “The continued freeze on the Housing Benefit subsidy cap for temporary accommodation, which remains stagnant at the 2011 rate, is placing increasing financial stress on council budgets, which ultimately risks impacting the delivery of council services. Without significant government intervention, council taxpayers will have to meet ever-increasing costs as we work to tackle the homelessness crisis that has been exacerbated by the rising cost of living.\n“We urge the government to take urgent action and use the Spring Budget to unfreeze the subsidy cap for temporary accommodation placements from 2011 levels and help ensure the well-being of our residents.”\nCllr Roberts added, “If the Conservatives are serious about addressing this crisis, then ending this benefit freeze would be hugely effective. I am proud of the work that the council has done in stepping up to help the most vulnerable in society when the government has taken a back seat. Richmond Liberal Democrats will continue to do all we can to support residents, to ensure we address this crisis with creativity and ingenuity”.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmonds-lib-dem-council-tackles-conservative-cost-of-living-crisis-with-continued-pound3-million-support-for-residents-this-winter/content_43.html": "Richmond’s Lib Dem Council tackles Conservative cost-of- living crisis with continued £3 million support for residents this winter\nRichmond’s Liberal Democrat Council has reaffirmed its commitment to supporting residents struggling with the Tory government’s cost of living crisis.\nCllr Gareth Roberts, Leader of Richmond Council, said:\n\"The reality of the Tory cost of living crisis is like nothing most of us have experienced. As Liberal Democrats, we are committed to ensuring people can eat well and stay warm this winter.\n“By working with our partners, Richmond Council has already offered a huge amount of support to our communities, but we know that, as the Tories’ economic failure continues to hit our communities this winter, support is needed more than ever before. It is therefore a priority for the Council to continue our programme of support to help our residents and businesses weather the financial storm.”\nLast year the Lib Dem Council acted rapidly to allocate a £3 million fund to support people in the borough and deliver frontline support to those in need.\nTo date, £763k of grants have been administered to allow voluntary sector groups to bolster their offering during this difficult period and ensure critical help reaches all parts of Richmond’s communities. This winter, thanks to the Lib Dems, Richmond Council and its partners will continue to provide community spaces at local libraries, youth centres and other venues, offering hot drinks, activities and access to other services. Residents can visit the Community Spaces Directory to find their nearest location.\nTo help residents cope with rising energy bills the Council has funded Thinking Works and SW Leap to provide home visits and advice. This includes the distribution of 1,325 warm home packs to offer residents who need it most the support to keep their homes warm and more energy efficient this winter.\nLast year Richmond Lib Dems helped 861 households to offset their energy bills through the Fuel Grant Scheme. This year, applications will be open in December so this much needed support can be provided in the earliest part of the winter period.\nEarlier this year, Richmond Council helped 40 households claim a total of £141,048 in unclaimed Pension Credit they were owed. Pension Credit tops up a person’s income to a minimum of £201.05 per week for single pensioners and to £306.85 for couples or more if a person has a disability or caring responsibilities. It can also act as a gateway to additional support, such as housing benefit, a Council Tax discount, help with NHS dental treatment, glasses and transport costs, and a free TV licence for those aged 75 and over.\nTo ensure no one in Richmond upon Thames must choose between keeping warm or feeding their families this winter, the Council has handed out 1,900 food parcels at youth centres and supported a number of community-based food projects with their ongoing work.\nLocal businesses are also being hit by Tory failures and the Lib Dems are supporting them through the upcoming Energy and Sustainability Business Support Project, which provides direct support and advice to local small businesses and voluntary sector organisations on identifying cost savings and reducing their carbon footprint. Businesses will also have access to an Environmental Management System and certification to establish their environmental credentials.\nCllr Roberts added:\n“We are supporting our local independent businesses through site visits and advice\nto help organisations become more resource and energy efficient. Meanwhile the\nCouncil’s Shop Local campaign continues to support independent businesses\ntrading during the cost of living crisis by highlighting the many benefits of shopping\nlocally and shining a light on the high-quality and unique goods on our high streets.”",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_page-6/content_24.html": "Lib Dems call for two month cancer treatment guarantee to support patients in Richmond upon Thames\nThe Liberal Democrats have called for a new legal right for cancer patients to start treatment within 62 days of an urgent referral, as part of a plan to boost survival rates and improve treatment for those affected by the disease.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_upperrichmondroad/content_8.html": "Safety improvements to Sheen Lane/Upper Richmond West junction\nI/we the undersigned ask Transport for London (TFL) to urgently begin safety improvements to the Sheen Lane/Upper Richmond West junction and areas surrounding it to include clearer road markings, enhanced pedestrian crossings and traffic management schemes.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_volunteer_stakeboards/content_19.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_a316trafficlights/content_4.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.\nWe will include your name and address/postcode when submitting and sharing the petition with Transport for London and Twickenham & Richmond Liberal Democrats.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_sarah-olney-and-munira-wilson-launch-their-campaigns-in-richmond-park-and-twickenham/content_35.html": "Sarah Olney and Munira Wilson launch their campaigns in Richmond Park and Twickenham\nLast night, Sarah Olney and Munira Wilson, Liberal Democrat parliamentary candidates for Richmond Park and Twickenham constituencies, brought together more than a hundred campaigners at Duke Street Church, Richmond, to lay out their plans for the campaign.\nOn the night, Sarah urged activists not to forget the years of chaos and broken promises in No.10, while Munira emphasised the positive change that electing Lib Dem MPs makes.\nThe pair ere joined by Paul Kohler, candidate for Wimbledon, who in 2019 missed winning the seat by just 628 votes and is the bookies’ favourite to win on 4 July.\nEsher and Walton’s Lib Dem candidate, Monica Harding, who decreased the Conservative’s majority by almost 90% at the last election, also made a virtual appearance.\nSarah commented:\n“This Conservative Government has brought the country to the point of collapse. Our public services have been slashed to the bone, our rivers are being poisoned, and hardworking people’s budgets have been stretched beyond breaking point.\n“Their plan isn’t working. Families are struggling, local shops are closing, and residents tell me they no longer feel safe walking the streets at night.\n“I’m fighting for a return to community policing, more support for those worst affected by the cost of living crisis, and tighter controls on giants like Thames Water and Heathrow to stop them damaging our community.\n“On 4th July, we need to end the chaos and bring some sense back to Westminster.\nMunira commented:\n“The past ten years of Conservative Government have been mired in scandal, incompetence and chaos. The British people are crying out for change and across the Blue Wall, Liberal Democrat candidates are primed to deliver it.\n“By electing a Liberal Democrat MP, residents are electing a local champion. Someone who will listen to their concerns, and will fight for their interests in Parliament and beyond.\n“More than ever, this country needs strong liberal voices and over the next few weeks, we will be campaigning to ensure that lots more Liberal Democrat MPs take their place in Westminster.”",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_page-1/content_48.html": "Obituary: Adrian Slade, CBE (1936–2025)\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nWe are very sad to report that Adrian Slade, a stalwart member of the Local Party with a huge contribution to the National Party over several decades, passed away on Thursday 24 January, aged 88.\nSerge Lourie dedicated much of his life to public service and bettering the lives of those around him.\nTwickenham & Richmond Liberal Democrats kick off their General Election Campaign.\nLiberal Democrat Councillors leading the London Borough of Richmond upon Thames, have expressed grave concern that a crucial £1million grant awarded from the Department of Environment, Food and Rural Affairs (Defra) has been suddenly withdrawn.\nRichmond’s Liberal Democrat administration is embarking on a campaign to drive improvements in standards of social housing for its residents.\nRichmond Borough’s Liberal Democrat led council has been rated the \"Best in London” in its Adult Social Care Performance Report - having outperformed the 30 other London councils taking part in the annual Adult Social Care Outcomes Framework.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_our-campaigns/content_15.html": "Our Campaigns\nSave Richmond Park's Park Police\nWe are concerned at the recent announcement that due to police cuts, policing units within the Royal Parks will be disbanded. Richmond Park has remained comparatively safe with low anti-social behaviour because of the work and specialist knowledge of the Parks Police stationed there. We call on the Home Office to adequately fund the MET police so this action doesn't become needed.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_page-4/content_54.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_volunteer/content_34.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_page-2/content_40.html": "Lib Dem Council supports new “Library of Things” at Patch Twickenham\nRichmond’s Lib Dem Council has joined forces with Library of Things and Twickenham co-working space Patch (42 York Street) to open the borough’s first branch of the “Library of Things” social enterprise.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-is-again-top-london-borough-for-adult-social-care/content_53.html": "Richmond is again Top London Borough for Adult Social Care!\nCllr Piers Allen, Chair of the Adult Social Services, Health and Housing Committee, says: “As a national Party, the Liberal Democrats are absolutely determined to bring forward a proper solution to the crisis in Social Care. Ed Davey set this out movingly at the Lib Dem Conference in Spring 2023 - including the plan for free personal care, covering nursing care, help with personal hygiene, immobility problems and medication. More recently, Ed and the Lib Dems have led the call for on an agreement to reform Social Care after the general election.\n\"This performance report on our local aduly social services is fantastic news - we're very pleased to celebrate another year of high achievement forr our vulnerable adults. A user survey confirms that those receiving local care are happy with their support and overall quality of life. This is crucial, as the largest proportion of residents' Council Tax goes on Adult Social Care. It is imperative that as a Liberal Democrat led council, we deliver outstanding support and enhance the quality of life for residents we care for. My tremendous thanks goes out to everyone in our Care sector, working tirelessly to ensure Richmond upon Thames continues to be a great place for people to live\"\nThe Liberal Democrats take pride that Richmond Council continues to perform best in London for social care, quality of life and overall satisfaction. The Council has also been ranked top in London for the proportion of people receiving short-term services. Plus it remains the second highest in London for the proportion of service users supported by direct payment, enabling them to live independently in their own home.\nSome indicators show areas where all Councils are challenged in maintaining high performance, as a direct result of the Pandemic. This includes the number of elderly admissions into Care Homes. This benchmarking exercise however, confirms that despite being impacted the same as other councils, Richmond Borough’s overall performance remains very high!",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-lib-dems-slam-government-withdrawal-of-pound1million-air-quality-grant/content_33.html": "Richmond Lib Dems slam Government withdrawal of £1Million Air Quality grant\nLiberal Democrat Councillors leading the London Borough of Richmond upon Thames, have expressed grave concern that a crucial £1million grant awarded from the Department of Environment, Food and Rural Affairs (Defra) has been suddenly withdrawn. Having been accepted as a Council bid two months ago the Conservative Government has given no timescale as to when funding will become available again.\nIt simply states in a letter dated 10 April 2024: \"We’re writing to inform you that the Air Quality Minister has decided to exercise his discretion not to fund the Local Air Quality Grant scheme for the financial year 2023- 2024”.\nThe cancellation of the grant is seen as yet another classic case of Government reneging.\nCouncillors were therefore delighted that Liberal Democrat MP for Twickenham MP Munira Wilson, raised the issue with Defra Ministers in a House of Commons debate on Thursday 9 May 2024. She called out the decision to cut local air quality grants, pointing out how it breaks the Government’s commitment to \"expand resources available to Councils to improve air quality.”\nA forthcoming report from the LBRuT Transport and Air Quality Committee, highlights that although air quality monitoring shows encouraging reductions in many tested parts of the Borough, there remains stubborn areas where air quality is above acceptable levels. Crucially, these include Richmond and Twickenham Town Centres and a corridor around the A316, affecting both Richmond and Twickenham Primary Schools.\nChair of the Air Quality and Transport Committee, Alex Ehmann, said: \"We are delighted Munira Wilson MP conveyed to the House of Commons how the cancellation of this grant has impacted planned initiatives to improve air quality in important hot spots - particularly given the good progress the Lib Dem Council has made in tackling air quality in most other areas of the Borough. This Government u-turn has pulled the rug from under a project which would have seen real support offered to those with conditions most exposed to adverse air quality. This Tory Government seems more committed to hot air than actually improving air quality.”\nLead Member for Public Health, Piers Allen added: \"We know there is a strong link between poor air quality and health issues, particularly with respiratory problems in young people, so it is highly disappointing to hear of the Minister's cavalier response to our MP. The formerly agreed grant would have formed an important part of Richmond Council’s upcoming Air Quality Action Plan for 2024/25. Sadly, this is a clear illustration yet again of the Government's overall lack of commitment to fund Public Health and Prevention in local government and their cancellation of Public Health England in 2021 and the underfunding of the successor national agencies.”",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_conservatives-ousted-from-richmond-borough-council/content_12.html": "Conservatives Ousted from Richmond Borough Council\nThe big news of the evening was Carey Bishop’s gain for the Lib Dems in Hampton North - a previously held Conservative seat. This is a resounding endorsement for the Lib Dems and a firm message to the government, that a once Conservative strong-hold now has ZERO councillors!\nHampton North’s results were as follows:\n- Liberal Democrat Votes: 1177\n- Conservative Votes: 771\n- Labour Votes: 159\n- Green Votes: 106\nRichard Baker, the Lib Dems candidate for Teddington also swept the board with an outstanding majority. Richard will serve the remainder of Martin Elengorn’s term who passed away in November 2023. Martin was a longstanding Lib Dem councillor for Teddington who’s passion for the community will be deeply missed.\nTeddington’s results were as follows:\n- Liberal Democrat Votes: 1716\n- Conservative Votes: 561\n- Labour Votes: 163\n- Green Votes: 184\n- Independent Votes: 46\nIn 2018, the Liberal Democrats won control of the council, retaining that control in 2022.\nLeader of the Richmond Borough Council, Gareth Roberts says:\n“I’m delighted that these by-election victories signal a huge vote of confidence in our council, sending a clear message to Conservatives that the Liberal Democrats are in firm control in the Richmond Borough”.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_page-5/content_39.html": "Richmond Liberal Democrats Commit £7m to New Youth and Community Facilities\nRichmond’s Liberal Democrat-run Council is investing nearly £7m to bring much-needed new youth and community facilities to Ham.\nRichmond’s Liberal Democrat-run Council is investing nearly £7m to bring much-needed new youth and community facilities to Ham.\nRichmond’s Lib Dem Council is investing more than ever before to keep its roads and pavements in good condition and reverse years of Tory neglect.\nRichmond’s Liberal Democrat Council has reaffirmed its commitment to supporting residents struggling with the Tory government’s cost of living crisis.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_news_article_richmond-liberal-democrats-commit-pound7m-to-new-youth-and-community-facilities/content_52.html": "Richmond Liberal Democrats Commit £7m to New Youth and Community Facilities\nRichmond’s Liberal Democrat-run Council is investing nearly £7m to bring much-needed new youth and community facilities to Ham, as part of the Ham Close regeneration scheme. This is all part of the Richmond Liberal Democrats commitment to Richmond.\nCouncillor Gareth Roberts, Leader of Richmond Council, said:\n“The Liberal Democrats made a commitment to invest in strong communities and young peoples’ futures; that is what the redevelopment will accomplish. It’s not just about creating quality new homes for our residents, it’s also about building a strong, diverse and vibrant community in Ham. It was smart, strategic investment by the Richmond Liberal Democrats that made this possible.”\nThe new Community Centre will replace the existing Ham Youth Centre. Achieving for Children will manage the facility and will offer tuition and an alternative curriculum programme for school students who are struggling with mainstream education during the day and then youth club activities after 3pm.\nThe Liberal Democrats have always advocated for improving and expanding youth spaces designed to allow young residents to develop skills which will last them a lifetime.\nLiberal Democratic Cllr Penny Frost, Chair of the Council’s Childrens and Education Services Committee, commented:\n“When Cllr Gareth Richards and I are out listening to residents we hear numerous Ham residents talk about the need to bring services into the heart of our community. As Liberal Democrats, it’s incredibly important to us to invest in a strong community. This centre will improve outcomes for all young people in the area, it will make our community safer, and ensure Ham continues to thrive for generations.”\nThe Liberal Democrats have also ensured that the centre will be available for the wider community to enjoy as well through a planned programme. Residents will have the option to hire spaces and meeting rooms to be used for community events.",
  "https_www_garethroberts_uk_/https_www_garethroberts_uk_donate_MuniraWilson/content_45.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowDonate to support Munira's re-election campaign. All contributions will go to ensuring that we keep Twickenham gold.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy."
}