{
  "https_www_davidsimmonds_org_uk_/https_www_davidsimmonds_org_uk_cdn-cgi_l_email-protection/content_4.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_davidsimmonds_org_uk_/https_www_davidsimmonds_org_uk/content_1.html": "Campaigns Save Mount Vernon’s Urgent Care Unit Like many residents, I have been concerned by the information circulating about… Northwood and Pinner Cottage Hospital The Northwood and Pinner Cottage Hospital is a long-standing issue on which my… The New Hillingdon Hospital In 2019, I was elected on a manifesto that committed to a programme including… Latest News Urgent Care Service at Mount Vernon Hospital: Letter to Wes Streeting I have written to the Health Secretary, Wes Streeting, to share residents'… Celebrating the Outdoors in Ruislip, Northwood and Pinner The National Trust’s Blossom Watch is an annual celebration of blossom season… Urgent Care Nurse Practitioner Service at Mount Vernon Hospital: Update Residents have been in contact with my office to raise concerns about the… Ruislip, Northwood & Pinner David on Facebook David on Twitter Am I your MP? Enter your postcode Postcode Contact Constituency Office10 Village Way, Pinner HA5 5AF0203 545 2462[email protected]Westminster OfficeHouse of Commons, London, SW1A 0AA0207 219 6578[email protected]David on FacebookDavid on Twitter\nSave Mount Vernon’s Urgent Care Unit Like many residents, I have been concerned by the information circulating about…\nNorthwood and Pinner Cottage Hospital The Northwood and Pinner Cottage Hospital is a long-standing issue on which my…\nThe New Hillingdon Hospital In 2019, I was elected on a manifesto that committed to a programme including…\nUrgent Care Service at Mount Vernon Hospital: Letter to Wes Streeting I have written to the Health Secretary, Wes Streeting, to share residents'…\nCelebrating the Outdoors in Ruislip, Northwood and Pinner The National Trust’s Blossom Watch is an annual celebration of blossom season…\nUrgent Care Nurse Practitioner Service at Mount Vernon Hospital: Update Residents have been in contact with my office to raise concerns about the…",
  "https_www_davidsimmonds_org_uk_/https_www_davidsimmonds_org_uk_map-locations/content_3.html": "Skip to main content\nMain navigation\nAbout David\nNews\nCampaigns\nIn Parliament\nContact\nSmall Business Survey\nMy map",
  "https_www_davidsimmonds_org_uk_/https_www_davidsimmonds_org_uk_campaigns_new-hillingdon-hospital/content_2.html": "In 2019, I was elected on a manifesto that committed to a programme including renewing Hillingdon Hospital, which serves many of my constituents in Ruislip, Northwood and Pinner.\nResidents will be familiar with the long-standing care provided by Hillingdon, both for emergencies and for those with long-term conditions. However, the current infrastructure has presented challenges for being able to provide that care to the high standard that we know and expect of the hospital.\nOver the last four and a half years, I have campaigned on behalf of my constituents to ensure that we see shovels in the ground at the new Hillingdon Hospital site and, prior to the General Election, we saw that work getting underway.\nHowever, uncertainty has been cast over the future of the hospital rebuild under this Labour Government. A lot of work has gone into securing this project, and I will keep holding the new administration to account to ensure the work that is already underway can and will continue."
}