{
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_immediate-actions-on-climate-challenge-for-brentwood/content_6.html": "Following the Council’s declaration of a Climate Emergency, a specialist working group, chaired by Brentwood South Councillor Dr Tim Barrett, has identified early actions that will get Brentwood Borough Council more than halfway towards its 2030 Net Zero ambition.\nThe majority of these measures are either cost-neutral or revenue-generating for example adding solar panels and further insulating the Brentwood Centre indicating the wider benefits of a climate conscious approach. Plans have also progressed for energy-efficient social homes, which will be carbon-neutral in use, serving future Brentwood generations.\nCllr Dr Tim Barrett said: “Setting out with real purpose we can make an impact and demonstrate that being climate conscious also makes real economic sense and reduces the cost of living for future generations of our community.”\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_author_brentwoodandongarlabour/content_33.html": "Author: brentwoodandongarlabour\n-\nSusan Kortlandt stepping up for Hutton East\nSince retiring from her job as a teacher, Labour Party candidate for Hutton East Sue Kortlandt has been active in the local community, volunteering with Citizens Advice and most recently, starting as Covid struck, with Brentwood Mutual Aid. Now, though, after campaigning on issues such as mobile phone coverage and the climate emergency, she is…\n-\nDr Tim Barrett – our candidate for Brentwood South\nDr Tim Barrett is seeking re-election as a Labour Party councillor for Brentwood South, pledging to ensure that there is always an effective opposition on Brentwood Borough Council, challenging the administration and making the case for value for money from the Council. Dr Barrett, who has served as a Councillor for Brentwood South since 2019…\n-\nTom Acornley standing for Shelley on May 4th\nTom Acornley, the Labour Party’s candidate for Shelley ward on Epping Forest District Council, has a special reason to stand for election on May 4. “I’m disabled and use a wheelchair all the time. Since being in a wheelchair, I’ve realised I’m not listened to and don’t feel represented nationally or locally. I can’t be…\n-\nLabour to fight every council seat in Brentwood & Ongar\nThe Labour Party is to put up candidates in every seat on Brentwood Borough Council to be contested on May 4. It will also stand in the four wards on Epping Forest District Council that fall within the Brentwood and Ongar constituency and is also putting up two candidates for Ongar Town Council The party…",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_dr-gareth-barrett-its-time-for-a-change/content_28.html": "Gareth’s five missions:\n- Tackle the cost of living crisis\n- Bring investment to Brentwood & Ongar\n- A local doctor & dentist when you need it\n- Give children the best start in life\n- Create safer communities\nWith Labour finishing second in the constituency in the last two general elections and the latest polling in Brentwood & Ongar putting the gap between Labour and the Tories at less than 10%, change is possible!\nLabour’s Gareth Barrett can beat the Conservatives in Brentwood & Ongar.\nGareth writes:\n“Dear Residents,\nStanding to be Member of Parliament for my local community is a real privilege. Brentwood & Ongar is my home, it is where I grew up, went to school and made my life.\nOur community, with its unique mixture of towns, villages and countryside, gave me a fantastic start to life, providing a safe, healthy environment to learn, grow and live. I had a brilliant start at St. Peter’s South Weald and the Headley Walter High School before University, enabling me to have a fulfilling career and in turn, buy a home, in Brentwood.\nI want to secure the opportunities I was given growing up in Brentwood & Ongar for future generations, to end the chaos of the last 14 years and restore our home back to its best. This is your chance not only to vote for real change, but to be part of a journey towards a brighter future for Brentwood & Ongar.\nChange is possible and a better Brentwood & Ongar can be realised – let’s make it happen, together.\nGareth”\nContact Gareth by email at: gareth@brentwoodlabour.org.uk\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_an-audience-with-emily-thornberry/content_26.html": "Our fund-raising Christmas Social held in the Brentwood Theatre this year was a big hit, featuring our Women’s Officer, Liz Jerrard, in conversation with Labour cabinet member and shadow Attorney General, the Rt Hon Emily Thornberry MP, Labour MP for Islington South and Finsbury.\nTopics ranged from Emily’s own upbringing in some poverty, to her rise to becoming a cabinet member, encouraged by Harriet Harman and other female colleagues. Emily discussed her views on the current state of the Tory government and vitally, Labour’s offer to the country in advance of an election next year.\nLiz invited Emily to discuss issues relating to women’s equality and how to deal with violence against women, and in response, Emily showed her legal experience regarding the role of police, the Crime Prosecution Service and the courts, and how Labour would hold the system to account when in power.\nIn response to audience members’ questions, Emily made the case to move towards free school meals for all, based on her own life experience and the observation that overweight children may still be malnourished, explaining Labour’s policy to introduce breakfast clubs. She agreed with Liz that this tackles the systemic, long term problem of poor nutrition which can can affect their education.\nHer exasperation regarding suffering 13 long years under Tory austerity and incompetence was clear, and her advice was that we cannot afford factionalism, infighting, nor overpromising on spending if we are to end their disastrous rule. She declared that the economy had tanked under the Tories and that the first priority for Labour would be to make the economy strong again.\nAfter a vote of thanks to Emily, to Liz for chairing, and to Alison Wingfield for organising, we retired to the foyer for a bite of supper and the raffle. Many thanks to George Hipwell, who donated several raffle prizes in remembrance of his late partner and Labour activist Michelle Wigram. Thanks also to Mark Strathearn who brought a bottle of Scotch for the raffle on Unison’s behalf.\nFinally thanks to the Brentwood Theatre for their professionalism and willingness to make it all work.\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_dr-gareth-barrett-launches-labour-campaign-in-brentwood-ongar-and-north-weald/content_19.html": "Dr Gareth Barrett visited Brentwood High Street, Ongar High Street and North Weald airfield to meet with campaigners at the start of his bid to become Brentwood & Ongar’s next MP.\nLabour members in Brentwood turned out in numbers at the Chapel ruins outside the Baytree Centre to launch the campaign before Ongar members met with Gareth at the Library in Ongar High Street. Finally Gareth travelled to North Weald Bassett to meet with Kevin Hind, local Labour campaigner.\nRead all about Gareth’s five missions.\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_press-release-susan-kortlandt-stepping-up-for-hutton-east/content_17.html": "Since retiring from her job as a teacher, Labour Party candidate for Hutton East Sue Kortlandt has been active in the local community, volunteering with Citizens Advice and most recently, starting as Covid struck, with Brentwood Mutual Aid.\nNow, though, after campaigning on issues such as mobile phone coverage and the climate emergency, she is seeking to get closer to the centre of decision-making as a councillor.\n“I will aim to be a voice for local residents in raising any concerns they have, whether over inappropriate development, too little social or affordable housing, the loss of green spaces or historic buildings and putting pressure on Essex County Council over the woeful state of public transport. I believe that Brentwood Borough Council currently seems pre-occupied on bringing in income, rather than delivering value for money, which needs to change.”\n“I believe a councillor’s first priority is improving the life of local residents and delivering services that will make a difference. Therefore, as the council makes efforts to balance the books in the light of continued funding cuts, it should focus heavily on maintaining the services and activities that really matter to the people of Brentwood. This means identifying the best of what the council can do, rather than cutting services without consideration.”\nSue knows that, if elected on May 4, she will probably be in opposition.\n“But then that’s OK, because there needs to be an opposition in a democracy.”\nHutton resident Noor Hussain says:\n“Susan is passionate about making a difference for Hutton East. We need her representing us at the Council and helping to bring the change across Brentwood we all need.”\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_the-soul-of-man-under-socialism-oscar-wild/content_27.html": "Discussed November 2015, review by Toby Blunsten January 2016\nThe Soul of Man whilst certainly not one of Oscar Wilde’s best works it is, however, interesting. Essentially the book, if one could call it that, is an amalgamation of Oscar Wilde’s thoughts as to what the state of man’s soul could be if we as the human race were to adopt socialism. What is essentially an essay does go some way into being persuasive but the prevailing sense that Oscar Wilde is rambling remains.\nOne poignant revelation Wilde puts forward is the notion that charity, aside from being an exhibition of goodwill, is in actual fact a means through which the capitalist system remains all powerful. As it is pointed out that engaging in charity essentially allows social ills to be partially remedied, when in actual fact one should instead avoid charity so that all can see the failings of capitalism.\nAnother point Wilde highlights is the power of the press, proudly stating ‘in old days men had the rack. Now they have the rack’. What Oscar Wilde means by this is that at the time of writing, and most certainly applicable in todays society, the press had become all powerful. The press flings the private failings of individuals into the public sphere where the public awaits to ridicule.\nThe Soul of Man as a read is ultimately worthwhile and due to its short length is easily finished with little obligation. Both interesting and insightful, Wilde reveals to the reader the innermost workings of his mind whilst viciously providing his opinion in a no holds barred rant.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_author_rmillwood/content_3.html": "Author: Richard Millwood\n-\nGareth Barrett achieves a 20% swing from Conservatives to Labour\nAcross the country Labour has made huge gains, and although we haven’t won in Brentwood and Ongar, our result is big. We have made a huge impact on the Conservative vote and reduced the LibDems to half of the Labour vote, making it clear that we not they are the main challenge to the right…\n-\nOur chance for change\nLabour’s Gareth Barrett can beat the Conservatives in Brentwood & Ongar. This year in Brentwood & Ongar, all independent experts (e.g. Tactical Vote and Get voting) agree it’s going to be a straight choice between change with Labour, and the Conservatives. With Labour finishing second in the constituency in the last two general elections and…\n-\nDr Gareth Barrett launches Labour campaign in Brentwood, Ongar and North Weald\nDr Gareth Barrett visited Brentwood High Street, Ongar High Street and North Weald airfield to meet with campaigners at the start of his bid to become Brentwood & Ongar’s next MP. Labour members in Brentwood turned out in numbers at the Chapel ruins outside the Baytree Centre to launch the campaign before Ongar members met…\n-\nDr Gareth Barrett – it’s time for a change\nGareth’s five missions: With Labour finishing second in the constituency in the last two general elections and the latest polling in Brentwood & Ongar putting the gap between Labour and the Tories at less than 10%, change is possible! Labour’s Gareth Barrett can beat the Conservatives in Brentwood & Ongar. Gareth writes: “Dear Residents, Standing…\n-\nLabour success in district elections\nThe 2024 Brentwood Borough Council elections saw Labour make a clean sweep in Brentwood South ward, increasing its team there to three councillors and come a good second in Hutton North and Hutton South wards. In Ongar, we also came second in North Weald Bassett ward with an increased vote.\n-\n‘A Century of Labour’ with Jon Cruddas\nA “critical friend” of Keir Starmer, Jon Cruddas MP for Dagenham and Rainham, told an audience at the Brentwood Theatre that a future Labour government faces defeat if it neglects its historic purpose. Mr Cruddas warned: ”If the next Labour government pursues a technocratic centre-left line we may be overcome by the forces gathering.” Jon…\n-\nBrentwood & Ongar is between Labour and the Conservatives\nPolling of 14,000 voters by YouGov, reported today in the Daily Telegraph, shows the battle for Brentwood and Ongar is between Labour and the Conservatives. Tactical voters over the years, hoping to replace the Conservatives, have been led to believe that the Liberal Democrats hold second place, which in turn has lead to Brentwood Borough…\n-\nOn your side on planning\nAfter successfully working with residents to oppose the inappropiate development in Ewing House Car Park, King Edwards Road (pictured above), Brentwood Labour councillors continue to make sure that residents know about proposed developments in their area, and that their views are both heard and seriously considered when local planning applications are decided. Councillor Gareth Barrett:…\n-\nImmediate actions on climate challenge for Brentwood\nFollowing the Council’s declaration of a Climate Emergency, a specialist working group, chaired by Brentwood South Councillor Dr Tim Barrett, has identified early actions that will get Brentwood Borough Council more than halfway towards its 2030 Net Zero ambition. The majority of these measures are either cost-neutral or revenue-generating for example adding solar panels and…\n-\nAn Audience with Emily Thornberry\nOur fund-raising Christmas Social held in the Brentwood Theatre this year was a big hit, featuring our Women’s Officer, Liz Jerrard, in conversation with Labour cabinet member and shadow Attorney General, the Rt Hon Emily Thornberry MP, Labour MP for Islington South and Finsbury. Topics ranged from Emily’s own upbringing in some poverty, to her rise to…",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_ongar-campaign-2024/content_8.html": "Brentwood and Ongar Constituency covers all thirteen wards in Brentwood Borough Council and five wards as part of the Epping Forest District Council.\nElection results\nOngar\n| Mary Elaine | Dadd | Conservative Party | 911 | Elected |\n| Jaymey | McIvor | Conservative Party | 828 | Elected |\n| Paul Stefan | Keska | Conservative Party | 827 | Elected |\n| Alison Mary | Wingfield | Labour Party | 337 | |\n| Ronald Edward | Huish | Labour Party | 332 | |\n| Timothy | White | Labour Party | 296 | |\n| Monica Phyllis | Richardson | Liberal Democrats | 252 | |\nRural East\n| Ray | Balcombe | Conservative Party | 817 | Elected |\n| Richard | Morgan | Conservative Party | 774 | Elected |\n| Ian Douglas | Hadley | Conservative Party | 737 | Elected |\n| Lesley Vivienne | Paine | Liberal Democrats | 697 | |\n| Bijal | Pattani | Liberal Democrats | 465 | |\n| Ann Shirley | Huish | Labour Party | 405 | |\n| Peter John | Bell | Reform UK | 324 | |\n| Robin Charles William | Tilbrook | English Democrats | 227 | |\nChigwell with Lambourne\n| Craig James John | McCann | Conservative Party | 1164 | Elected |\n| Kaz | Rizvi | Conservative Party | 1018 | Elected |\n| Darshan | Singh Sunger | Conservative Party | 947 | Elected |\n| Shahzaad | Malik | Independent | 457 | |\n| Tony | Casaluci | Labour Party | 437 | |\nNorth Weald Bassett\n| Tom | Bromwich | Independent | 889 | Elected |\n| Nigel | Bedford | Conservative Party | 604 | Elected |\n| Les | Burrows | Conservative Party | 540 | Elected |\n| Les | Mills | Conservative Party | 472 | |\n| Kevin Ray Clifford | Hind | Labour Party | 392 | |\n| Paul | Stockton | Labour Party | 382 | |\nTheydon Bois with Passingford\n| Clive Ewart | Amos | Liberal Democrats | 949 | Elected |\n| Tippy | Cornish | Liberal Democrats | 882 | Elected |\n| Sue | Jones | Conservative Party | 698 | Elected |\n| Richard Michael | Griffiths | Liberal Democrats | 695 | |\n| Heather | Brady | Conservative Party | 647 | |\n| John Morrison | Philip | Conservative Party | 581 | |\n| Christine Janette | Burgess | Independent | 212 | |\n| Louis | Turchin | Independent | 211 | |\n| Christine Patricia | Mortimer | Labour Party | 157 | |",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_press-release-dr-tim-barrett-our-candidate-for-brentwood-south/content_30.html": "Dr Tim Barrett is seeking re-election as a Labour Party councillor for Brentwood South, pledging to ensure that there is always an effective opposition on Brentwood Borough Council, challenging the administration and making the case for value for money from the Council.\nDr Barrett, who has served as a Councillor for Brentwood South since 2019 and is the Leader of the Labour Group on the council, says that despite being in opposition, he has successfully delivered real change for local residents including setting the first Borough-wide target for achieving carbon net zero, making the Council deliver affordable and social housing in its developments, and new approaches to support the future of the Brentwood Centre.\nTim said:\n“I have supported residents on everything from housing issues to flytipping, anti-social behaviour to planning problems.\nThis has occasionally been challenging but always rewarding.\nI will continue to be a voice for local residents in raising the concerns they have over inappropriate development in Brentwood South.”\nDr Barrett says that the council currently seems focused on bringing in income, rather than delivering value for money.\nTim added:\n“This needs to change. I believe a councillor’s first priority is improving the life of local residents and delivering services that will make a difference. Therefore, as the council makes efforts to balance the books in light of continued funding cuts, it should focus heavily on maintaining the services and activities that really matter to the people of Brentwood. This means reflecting the best of what the council can do, rather than cutting services without consideration.”\nDr Barrett grew up in Brentwood, attending St Peter’s School in South Weald and what was then the Hedley Walter High School. At Imperial College London he completed an MSc and PhD in Organic and Medicinal Chemistry. He volunteers with the Scouts, and commutes daily, working in scientific research for the discovery and development of cancer treatments for a major pharmaceutical company.\nIngrave Road resident Richard Carter said:\n“Tim has been a great local councillor and always engaged in the issues that affect our community. With the challenges ahead for Brentwood, we need him back as our local Councillor.”\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_the-joy-of-tax-how-a-fair-tax-system-can-create-a-better-society-richard-murphy/content_37.html": "Discussed November 2016, review by June Simmons November 2016\nThe Joy of Tax – How a fair tax system can create a better society – Richard Murphy, Corgi edition, 2016\nRichard Murphy , a self-confessed tax expert, condemns the UK tax system as outdated, inequitable and not fit for purpose while our barely accountable HMIT Customs & Excise is understaffed, and led by big business bosses and large accountancy firms who perpetuate inefficiency and inequality. Suspend disbelief and imagine Richard Murphy is Chancellor delivering his maiden speech demolishing current practices and introducing the revolutionary underpinnings of a fairer society.\nThe ‘New Chancellor’ declares:\nIt is government’s duty in taxing to create conditions of equality and prosperity for all by managed spending. Most people would willingly submit to a fair tax system. Insistence that social investment is unaffordable on the altar of balancing the books is untrue nonsense. Designing a fairer system first requires reappraisal of currently accepted thinking.\nThe essential truth, recognised by the Bank of England, is that banks create money by Lending, in debiting a loan account and crediting a current account and not, as popularly peddled, vice versa. Government can, therefore create money the economy requires since we own the Bank of England. Banks make money by lending, and government creates cash by spending. Banks control loans through repayment, and governments reclaim money by taxing. Government spending precedes taxation, so spending is Not dependent on tax.\nIt is government’s job to create and manage money, avoiding inflation or deflation – a responsibility too big for other hands than government. Just as banks risk lending to make profit, governments must risk spending to initiate reclaimable taxes with responsibility to decide how to recoup its spending. HMIT Customs & Excise is relatively unaccountable, headed by representatives of vested interests – big accounts firms, solicitors and financial advisors whose aim is to minimize tax and corporation tax on profits, income, gifts, gains, speculation and corporation tax which results in a system hitting lower and average earners disproportionately. Consultation will be spread much wider to include all taxpayers interests. Vested interest will no longer shape tax laws and practices.\nAccountability for Tax will be ensured by a new Secretary of State for Taxation and a Department of Taxation with full structure and staffing to ensure tax owed is collected offshore or otherwise. Tax laws will be introduced or amended to reverse onus for Tax Collection to prove tax liability, but place onus on company directors, solicitors, accountants and advisors to prove if and why claimed tax concessions are valid, the default position will deem liability for full payment of tax. Unless proved otherwise, attempts to avoid or evade in any way, including shifting gains outside the UK of UK assets any individual, company or trust on behalf of anyone or any body attempting avoidance will themselves be liable to pay and risk assets in question being seized. Since land will be treated as taxable, owners, not occupying tenants, will also forfeit land ownership to the state for non-payment of tax. This should ensure building land or other land is used productively. All Land will be taxed based on land rental value on a progressive scale, above a modest threshold, and unused, vacant or undeclared ownership taken by the state. Unearned income which, astonishingly, bears a lower rate than earned income at present, will pay the same, progressive scale rate, simplifying the system. Wealth tax on properties and let property portfolios over £1M, other than a main residence, family farms or businesses. will counter house price inflation. As tax will be due on all income and wealth, stamp duty will be obsolete, so abolished. Tax relief on buy-to-let landlord mortgages which helped fuel increases in house prices, will also be abolished.\nDisputes will be judged according to the Intention of tax laws. An office for Tax Responsibility will audit gaps, effectiveness, reviews and proposals for change with powers to recommend laws, amendments and repeals. The Chancellor will have overall responsibility including funding and staffing to ensure collection of taxes.\nFull disclosure and accounts will oblige banks, businesses, companies and trusts to name all owners and directors on public record.\nNew domicile and residence laws, with country by country reporting, will ensure that income generated in the UK is paid in the UK with tax deducted at source from interests, dividends, royalties, management charges, insurance premiums, hedging expenses and profits when paid from the UK with reciprocity to other countries. A General Anti-Abuse Principle will replace General Anti Avoidance.\nBank of England loans to government will take the burden off taxation to meet infrastructure investment, including house building.\nA New Investment Bank will provide loans for high standard, environmentally sound homebuilding to Not-For-Profit landlords, organisations and associations. Infrastructure investment will also create jobs around the UK.\nREDISTRIBUTION of income with a Universal, Socially Just Personal Income Allowance at one base rate, at 60% of median earnings will require all reliefs to be phased out on savings (possibly excepting ISAs). NI will be phased out as regressive. Instead, a new tax on finance above a fixed sum (removing those on lower incomes) to be charged on bank transactions on personal and business accounts, and will also discourage excessive consumption fuelling global warming, as a Carbon Usage Tax.\nCompanies controlled by five or less people will no longer count as one entity, but each will now pay their share. Those distributing less that 50% of profits will pay double corporation tax but get full allowance on capital spending. Large companies will pay increased Corporation Tax to compensate for their toll on society and their privileged limited liability cushioning risk.\nA MINIMUM GUARANTEED INCOME after a minimum UK residency will be phase in to include old, young, and disabled people, will be phased in. Interim measures will temporarily reintroduce child credits and welfare benefits until the universal payments for all, working or not, are rolled out countrywide.\nIn the financial services, alongside a tax on cash moving around, in and out of bank accounts, a new Financial Transaction Tax will be brought in at differential rates for shares and securities trading, foreign exchange, derivatives, and other futures. Responding to high volume trading, variable rates will help even out market trading, dampen trading, preventing excessive trading fluctuations, as well as gathering tax.\nVAT will be retained as a Tax on Consumption but at a low level and compensated by Bank Transaction Tax on Consumption.\nSpecific measures:\nAir Transport Tax will be progressive according to use. Travel once a year will incur no tax, thereafter rising progressively with frequency. Data registered on passports will automatically charge tax collected on bookings.\nRenewable Energy Tax will be abolished.\nSummary:\nGovernment duty is to manage the economy, but balancing books is a false logic.\nGovernment borrowing will fund social housing, infrastructure and investments creating jobs, generating tax revenue. A budget and taxation will be used to create Fairness and Redistribution. Workers and those who cannot work will be treated with respect as valued members of society. Businesses, communities and UK partners will be treated as equals. By reducing taxation on work but instead taxing excess consumption, and fostering all people’s potential, we set out to create a more equal society.\n“This budget is about a common future and building it together. That is what I call the Joy of Tax.”",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_news/content_22.html": "- Gareth Barrett achieves a 20% swing from Conservatives to LabourAcross the country Labour has made huge gains, and although we haven’t won in Brentwood and Ongar, our result is big. We have made a huge impact on the Conservative… Read more: Gareth Barrett achieves a 20% swing from Conservatives to Labour\n- Our chance for changeLabour’s Gareth Barrett can beat the Conservatives in Brentwood & Ongar. This year in Brentwood & Ongar, all independent experts (e.g. Tactical Vote and Get voting) agree it’s going to… Read more: Our chance for change\n- Dr Gareth Barrett launches Labour campaign in Brentwood, Ongar and North WealdDr Gareth Barrett visited Brentwood High Street, Ongar High Street and North Weald airfield to meet with campaigners at the start of his bid to become Brentwood & Ongar’s next… Read more: Dr Gareth Barrett launches Labour campaign in Brentwood, Ongar and North Weald\n- Dr Gareth Barrett – it’s time for a changeGareth’s five missions: With Labour finishing second in the constituency in the last two general elections and the latest polling in Brentwood & Ongar putting the gap between Labour and… Read more: Dr Gareth Barrett – it’s time for a change\n- Labour success in district electionsThe 2024 Brentwood Borough Council elections saw Labour make a clean sweep in Brentwood South ward, increasing its team there to three councillors and come a good second in Hutton… Read more: Labour success in district elections\n- ‘A Century of Labour’ with Jon CruddasA “critical friend” of Keir Starmer, Jon Cruddas MP for Dagenham and Rainham, told an audience at the Brentwood Theatre that a future Labour government faces defeat if it neglects… Read more: ‘A Century of Labour’ with Jon Cruddas\n- Brentwood & Ongar is between Labour and the ConservativesPolling of 14,000 voters by YouGov, reported today in the Daily Telegraph, shows the battle for Brentwood and Ongar is between Labour and the Conservatives. Tactical voters over the years,… Read more: Brentwood & Ongar is between Labour and the Conservatives\n- On your side on planningAfter successfully working with residents to oppose the inappropiate development in Ewing House Car Park, King Edwards Road (pictured above), Brentwood Labour councillors continue to make sure that residents know… Read more: On your side on planning\n- Immediate actions on climate challenge for BrentwoodFollowing the Council’s declaration of a Climate Emergency, a specialist working group, chaired by Brentwood South Councillor Dr Tim Barrett, has identified early actions that will get Brentwood Borough Council… Read more: Immediate actions on climate challenge for Brentwood\n- An Audience with Emily ThornberryOur fund-raising Christmas Social held in the Brentwood Theatre this year was a big hit, featuring our Women’s Officer, Liz Jerrard, in conversation with Labour cabinet member and shadow Attorney… Read more: An Audience with Emily Thornberry\n- New Brentwood South team member: Elizabeth JerrardWith the redrawing of ward boundaries, Liz Jerrard has been chosen as the third member of the Brentwood South Labour team, alongside Gareth Barrett and Tim Barret. She knows the… Read more: New Brentwood South team member: Elizabeth Jerrard\n- Susan Kortlandt stepping up for Hutton EastSince retiring from her job as a teacher, Labour Party candidate for Hutton East Sue Kortlandt has been active in the local community, volunteering with Citizens Advice and most recently,… Read more: Susan Kortlandt stepping up for Hutton East\n- Dr Tim Barrett – our candidate for Brentwood SouthDr Tim Barrett is seeking re-election as a Labour Party councillor for Brentwood South, pledging to ensure that there is always an effective opposition on Brentwood Borough Council, challenging the… Read more: Dr Tim Barrett – our candidate for Brentwood South\n- Tom Acornley standing for Shelley on May 4thTom Acornley, the Labour Party’s candidate for Shelley ward on Epping Forest District Council, has a special reason to stand for election on May 4. “I’m disabled and use a… Read more: Tom Acornley standing for Shelley on May 4th\n- Labour to fight every council seat in Brentwood & OngarThe Labour Party is to put up candidates in every seat on Brentwood Borough Council to be contested on May 4. It will also stand in the four wards on… Read more: Labour to fight every council seat in Brentwood & Ongar",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_review-of-the-ragged-trousered-philanthropists-by-robert-tressell/content_36.html": "First published 1914 (1955 1st unabridged edition)\nDiscussed at the Socialist Book Club July 2016 , review by Andy McGeeney July 2016\n‘….he saw that the people who enjoyed abundance of the things that are made by work, were the people who did Nothing; and that the others, who lived in want or died of hunger, were the people who worked. And seeing all this he thought that it was wrong, that the system that produced such results was rotten and should be altered.’\np38 Wordsworth Edn.\nToday we talk of the 1%.\n‘Easton was still reading the Daily Obscurer: he was not able to understand exactly what the compiler of the figures was driving at – probably the later never intended that anyone should understand – but he was conscious of a growing feeling of indignation and hatred against foreigners of every description, who were ruining this country, and he began to think that is was about time someone did something to protect ourselves. Still, it was a difficult question: to tell the truth, he himself could not make head of tail of it.’\np41 ibid.\nToday we have anti-migrant outrage. 80% of newspaper readers read papers owned by four powerful billionaires who provide a continual stream of racism.\n‘Owen continued: A little while ago you made the remark that you never trouble yourself about what you call politics, and some of the rest agreed with you that to do so is not worth while. Well, since you never “worry” yourself about these things, it follows that you know nothings about them; yet you do not hesitate to express the most decided opinions concerning matters of which you admittedly know nothing. Presently, when there is an election, you will go and vote in favour of a policy of which you know nothing. I say that since you never take the trouble to find out which side is right or wrong you should not have the right to express any opinion. You are not fit to vote. You should not be allowed to vote…….. I say you have no right to vote for a policy which may bring suffering upon other people, without taking he trouble to find out whether you are helping to make things better or worse.’\np44 ibid.\nToday we have the same response. Most recently demonstrated in the shocked and confused reactions to Brexit.\nI am drawn to this book in many ways, but the central theme of the Ragged Trousered Philanthropist (RTP) is what compels me to return to it again and again. The main theme is poverty and the condition of the working class, who on the whole are unable to see the benefits of socialism for themselves. The main character Owen, a skilled decorator and sign writer like the author was, is repeatedly thwarted in the most frustrating ways in his attempts to explain to his fellow workers why they live such miserable lives. And that they alone have the power to bring about change. He also knows that this own fate it tied to the very system that condemns his fellow men.\nOwen sees clearly in his mind the causes of poverty in this country. He can also see a solution. What he is condemned to do, just like Sisyphus, is to repeat his frustrations every day with no end in sight. One of the central problems in abolishing capitalism is the resistance of working people to a call to action in the face of the destructive forces generated by the capitalist system. If tomorrow the population as a whole woke up and demanded democratic control of natural resources, the workplace and the money system we would be on our way to a socialist society. The fact that we know people won’t is, to me, the emotional core of this novel. The poor working people who tolerate capitalism are the ragged trousered philanthropists. Perhaps Tressell’s only compensation is the possibility that, as Marx suggested, the system will collapse of its own accord because of internal contradictions. In the meantime we have to keep plugging away to change things.\nThe economic absurdity of the system is repeatedly explained to Owen’s fellow workers. How they the workers convert the natural resources of the earth into goods with value. But because the workers do not own the means of production, the factories etc, they have no control of how the wealth is distributed. The capitalist bosses who control where the wealth goes make sure they get the lions share while those that actually do productive work get paid only enough to sustain themselves. Chapter 21 has probably the most famous scene in the book, where in five pages Owen explains the theory of surplus value and The Great Money Trick. The explanation is concise and beautifully clear, all the while set in the realistic and humorous context of a worker’s lunch break. Owen explains money is the cause of poverty. He does this by using slices of bread to represent natural resources, and then getting his fellow workers to represent the working class. He shows how the working class lose out even though they are the ones that do all the work. The scene is portrayed from different sides not only Owen’s. We see the frustration and antagonism of tory working class supporters and the reluctance and antipathy to self education from others. The characters are real and recognisable even while they are being portrayed in humorous way.\nThe RTP reminds me of many of Ken Loach’s films (eg Bread and Roses about the Spanish civil war and The Wind that Shakes the Barley about the liberation of Ireland). Loach creates a tension between groups seeking change. There are those that are willing to accept improvements in their lives from the elite (liberals), and those who don’t accept compromise and want to take control for the people as a whole (socialists).\nWhat is saddening, and Tony Benn refers to this in the introduction to my edition of the book, is how much in RTP is similar to today. The media are owned by Tories and Liberals antagonistic to Socialism. The capitalist system is driven by the need to make money at all costs. The rich and powerful are corrupt and only lookout for themselves. Charities give relief but do nothing to change the causes of distress.\nThere is the repeated experience on reading the book that Tressell is describing today not a hundred years ago. All the progress attained by the 1950s has been or is being eroded by the neoliberal consensus. For example in the book men were paid by the day, with the demise of union power, we have moved to the insecurity of zero hours contracts. Back to square one for job security.We decided in the book club that it would be good if a film could be made of RTP, but set in the 21st century. It would have more impact on people who would not be able to dismiss it as the bad old days.\nThere are some important differences or additions comparing then with now. Feminism and racism are part of the political narrative today in a way that is not evident in the book. The perspective in RTP is local or at the most British, whereas today we are more aware of events far and near. There was the empire in Edwardian times which has now been replaced by multinationals as the major global forces of capitalism. We are more aware of environmental issues, partly because we have greater access to global information but also because environmental destruction is on a much vaster scale than it was in 1910.\nI would like to have seen more exploration, in an empathic way of the workings of the right wing working class Tory mind. Tressell at one point explains that it is the system which is wrong not the individuals. He challenges the reader to see if they would act differently from any of the characters in the novel given the nexus of forces that hold them in place. In other words it is not the prime minister Theresa May who is the major problem as she drives through her neoliberal agenda (which is not to say she doesn’t have a moral responsibility) but it is the system as a whole which is wrong.\nSome of Owen’s frustration comes from an assumption that if only his workmates would listen and think about it he could persuade them by rational argument. We are much more aware today of the role of emotions in motivating people to act in ways that do not seem to be in their own interests. We know how politicians and the unscrupulous play on people’s fears and prejudices against the vulnerable and the outsider.\nIt is my belief that socialism will not be achieved through political and economic change alone. It is not enough to elect a socialist government however desirable that might be. At the micro level change also needs to occur. All of us need to learn to understand how our own minds betray us. We so often react to others on the basis of inappropriate emotions, principally fear. It is fear that destroys any possibility of a transpersonal perspective on life. If fear can be understood and put aside then it is possible that a person can be genuinely collaborative, empathic and free of violence.\nThe book is very modern in some ways. There is no happy ending, socialism isn’t achieved in the book. I actually think the end is a bit sentimental. The wealthy socialist spending his money on making kids happy at Christmas feels more like something out of Dickens. I think Tressell lost it there and was probably as as confused as we are about how to bring an account of the tragedy of capitalism to an end that seems credible.\nThere is a repetition of themes: how people get trapped in poverty, the cruelty of bosses,etc. But the effect of all the relentless and detailed descriptions of life in the working class Edwardian era is wearying on the reader. There is no escape for anyone. The effect is transferred to the reader in a powerful way.\nAlso the reader is led to feel – yes I know all this – and yet there is no resolution, no action to change things. Which is just what the author was feeling. Poverty is all consuming and relentless. Capitalism is all encompassing. One of the difficulties of arguing for socialism is the sense that there is no alternative imaginable. In fact there are many alternative examples and visions for the future, they just don’t get explored in mainstream society.\nI have wondered why Tressell didn’t portray a socialist society. Why didn’t he create a vision people could imagine? Perhaps he was wary of being utopian. In chapter 4 he makes some attempt to explain what will happen to the lazy and the drunk, who will do the really dirty work, and what will be the role of the clergy and the army. My hunch is he didn’t know the full answer and neither do we. He just know the present system was wrong and an alternative was possible. Maybe a socialist vision would require another book with a different tone.\nThere is no driving narrative which is what we are used to with most modern stories. No love angle or mystery to solve. I would have liked a stronger narrative. Dickens was a master at creating tension and of leading the reader to want more at the end of a chapter. The RTP is episodic. It seems as if Tressell sat down at intervals, between hours and days of hard work earning money, to capture a collection of stories from his own life. I imagine him putting down his pen and not returning to the manuscript for sometime. And in the intervening time he encountered further frustrations in trying to explain his ideas to his workmates, which he then had to record on paper. Maybe the novel worked as a form of therapy for Tressell. Journal writing is a respectable form of personal development. The issues a person is confronting in life are written about in an attempt to make sense of them and to explore the possibilities for change. The Appendix seems to confirm that Tressell just couldn’t let it go and had to add yet another incident on a theme he had already explored. Perhaps Tressell felt almost compelled to work out, through writing, his inability to rationally explain the solution to his fellow workers degrading lives. And of course he recognised that his own salvation could not be achieved without the collective actions of his colleagues.\nAlthough there are female characters the novel is primarily focused on the actions that takes place in the all male work environment of painters and decorators. Partly this is a reflection of the times when men went to work and women mostly stayed at home and did housework and home work. Tressell was a man writing from his own experience and that is one of its major strengths. However it is possible for a writer to talk to groups of people he does not belong to, in his case women, and find out what life is like. In this he was a victim of his times when women were far less acknowledged by men.\nHe was working class himself and experienced what he was writing about directly and this gives it tremendous realism and detailed accuracy. The book is a useful social history account written by an insider. It would be interesting to know from historians how typical RTP is of the Edwardian era.\nWe also have the biggest spoiler of all, history. We know that many of the characters would have died in the Great War. We know that socialism grew in Britain but was blocked within the Labour and Union movement repeatedly by those wanting to retain capitalism with a human face. To offer charity rather than change. We know of the betrayal of working people in Russia and its satellite countries. When the Poles, Hungarians and Czechs tried to democratise their countries the Russian state forces repressed them. Russia had the tacit support of the West that was seeking to both undermine the Soviet bloc and destroy democratic socialism in Africa, the Caribbean and South America.\nThe questions of how we can achieve socialism have only become more complex as we learn about the all embracing power that capitalism has over everyones lives. Was Tressell naïve in not seeing the difficulties? I don’t think we can place that in front of him. He was confronted with the world as it was at the start of the 20th century. The precursors of the modern Labour party was very new, there was no Welfare State. Today we have exported our extreme poverty through globalisation. Consumerism has become the driver of money flows and a major cause of poverty in seemingly wealthy countries. We also struggle with over population and the accelerating environmental problems created by capitalism. He could not have seen this coming.\nAn important message from Tressell is that its futile blaming the bosses for the state of things. They are just as trapped as the working class. The ruling class is cushioned from the economic effects of capitalism and live in relative comfort. The elite are not immune from the psychological and spiritual poverty that is a consequence of capitalism. I am pleased that Tressell makes this point very clearly in the book. The Spirit Level written by medical sociologists in our age displays detailed evidence of the relationship between inequality and a range of social problems including mental illness, ill health, crime, violence, and unhappiness. The greater the inequality the greater the social problems for a society. The evidence demonstrates that everyone suffers if there is great inequality, even those in the elite.\nThere are varied styes of writing in the book. The intention is to explain capitalism by describing real life situations. In some ways it fits the description of a docudrama. Tressell saw or heard of all the incidents he recounts. There are also extended passages where economics and political ideas are explained in the form of speeches by Owen, represented in the guise of mini lectures to fellow workers. There is also much humour in the book. The names of the characters remind me of Dickens. People with names like Slyme, Hunter, Crass and Phillpott have surnames related to their character. The dialogues are full of humorous banter and ironic turn of phrases.\nI cannot think of a better book written in English which describes the problems of working people and explains why things are the way they are. For anyone wishing to understand what British socialism is and why it is needed, the Ragged Trousered Philanthropists is a place to begin.\nA free to download audio version of the complete novel is available online from www.archive.org Beautifully read.\nRobert Tressell 18 April 1870 – 3 February 1911 pen name of Robert Croker who later changed his name to Robert Noonan (mothers surname). Born in Dublin/Liverpool/London? died in Liverpool, buried in a paupers grave. He worked as a sign painter in Hastings and was involved in local politics. The book was all based on true events he experienced or heard about while he was working. His daughter saved the manuscript and eventually got it published, but the full unabridged version only came out in 1955.\nRobert Tressell Society http://www.1066.net/tressell/\nHastings Museum http://www.hmag.org.uk/collections/tressell/\nLiverpool festival http://www.bobtressellfestival.org.uk/about-bob/4592183995\nFacebook: The Association of the Ragged Trousered\nThe book changed Ricky Tomlinson’s (the actor) life. See his account on Youtube.\nMany thanks to Richard, June, Susan and Toby for a fascinating evening of lively discussion.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_labour-women/content_4.html": "Women have been campaigning with the Labour Party for over 100 years before & since the Labour Women’s Network was established in 1987 by Barbara Follett.\nOur aims include:\n- To meet other women of like minds\n- To support Labour women to play a part in the Party\n- To encourage women to become active\n- To identify issues relating to women & families\n- To support the Local party\n- Fund raising\nWe organise a Red Rose Day every year on a Saturday close to International Women’s Day (March 8th), to celebrate being a woman in Brentwood and Ongar. This event has previously been supported by Harriet Harman and other prominent Labour MPs.\nGet in touch with us if you are interested in joining us.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_ongar-campaign-2023/content_15.html": "Brentwood and Ongar Constituency covers seven wards as part of the Epping Forest District Council and all fifteen wards in Brentwood Borough Council.\nThese are the seven Epping Forest District Council wards surrounding Ongar:\n- Chipping Ongar, Greensted and Marden Ash\n- High Ongar, Willingale and The Rodings\n- Lambourne\n- Moreton and Fyfield\n- North Weald Bassett\n- Passingford\n- Shelley\nThere are also parish and town councils in this area – Labour is represented in two Ongar town council wards where councillors were elected unopposed.\nResults May 2023\nLabour came second in all four wards in the Epping Forest District. Tom Acornley, from a standing start in March made excellent progress in Shelley ward. Boundaries change next year, but the strong showing in Chipping Ongar, Greensted and Marden Ash and in Shelley suggest good prospects for next year’s all-up election.\nChipping Ongar, Greensted and Marden Ash | ||||\n| Paul | Keska | Conservative Party | 520 | Elected |\n| Ron | Huish | Labour Party | 168 | |\n| Monica | Richardson | Liberal Democrats | 157 | |\n| Peter | Bell | Reform UK | 57 | |\nHigh Ongar, Willingale and The Rodings | ||||\n| No election | ||||\nLambourne | ||||\n| Craig | McCann | Conservative Party | 257 | Elected |\n| Alison | Wingfield | Labour Party | 62 | |\n| Naomi | Davies | Liberal Democrats | 50 | |\nMoreton and Fyfield | ||||\n| No election | ||||\nNorth Weald Bassett | ||||\n| Jaymey | McIvor | Conservative Party | 507 | Elected |\n| Kevin | Hind | Labour Party | 221 | |\n| Edward | Barnard | Liberal Democrats | 148 | |\nPassingford | ||||\n| No election | ||||\nShelley | ||||\n| Nigel | Bedford | Conservative Party | 162 | |\n| Tom | Acornley | Labour Party | 110 | |\n| Robin | Tilbrook | English Democrats | 34 | |\n| Peter | Sinfield | Liberal Democrats | 24 |\nLabour’s Strategy for Ongar\nKey objectives\n- Realistic housing in suitable and sustainable green environments\n- Further business and training opportunities\n- Improved roads, pavements and kerbs with reduced speed limits\n- Better facilities for young people including transport links\n- Health and Social Care services that work for all\nCandidates\nChipping Ongar, Greensted and Marden Ash\nRon Huish\nRon is a retired railway worker who was employed as a rolling stock technician and train first-aider for British Rail and the London Underground and lives in Ongar Town. He feels strongly that the current government is not delivering for local people and that the local council must be more effective, particularly in the context of the disruption caused by Ride London.\nHigh Ongar, Willingale and The Rodings\nno election in 2023\nLambourne\nAlison Wingfield\nAlison has lived in Ongar since 1995 and worked for London Boroughs finishing as Manager of a Day Centre with Hackney Council.\nShe is a former town councillor in Ongar and is very involved with community affairs regarding planning, housing, Open Spaces and the environment throughout Epping Forest District.\nMoreton and Fyfield\nno election in 2023\nNorth Weald Bassett\nKevin Hind\nKevin is a professional in the scientific publishing industry based in Cambridge. His experience as a local politician has shown him how he can contribute to an effective local government.\nPassingford no election in 2023\nPassingford\nno election in 2023\nShelley\nTom Acornley\nTom is a family man and a hard worker in his profession. He is disabled and uses a wheelchair all of the time. Since his accident Tom realised he was not listened to and didn’t feel anyone represents him nationally or locally. He is not from the upper classes or political classes, but a normal working class person who would love the chance to represent and help people from all backgrounds.\nOngar Town Council\nThere are fifteen seats in four wards:\nChipping Ongar (4 seats)\nGreensted (2 seats)\nDiana Roberts (elected unopposed in Greensted ward, April 5 2023)\nDiana is an experienced former Ongar Town Councillor and leader of the council. Returning to politics, she is keen to make the Ongar Town Council serve the interests of its residents more effectively.\nMarden Ash (4 seats)\nShelley (5 seats)\nTom Acornley (elected unopposed in Shelley ward, April 5 2023)\nTom is a family man and a hard worker in his profession. He is disabled and uses a wheelchair all of the time. Since his accident Tom realised he was not listened to and didn’t feel anyone represents him nationally or locally. He is not from the upper classes or political classes, but a normal working class person who would love the chance to represent and help people from all backgrounds.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_press-release-tom-acornley-standing-for-shelley-on-may-4th/content_12.html": "Tom Acornley, the Labour Party’s candidate for Shelley ward on Epping Forest District Council, has a special reason to stand for election on May 4.\n“I’m disabled and use a wheelchair all the time. Since being in a wheelchair, I’ve realised I’m not listened to and don’t feel represented nationally or locally. I can’t be the only person that feels this way, I’ve decided to stand and if elected I will hopefully be able to help people from all backgrounds.”\nAged 43, Tom and his partner live in Ongar, and have a six-year-old daughter\nTom, who works in the motor trade, said:\n“We need a change in direction, both nationally and particularly locally. Since I have been involved, I have heard about lots of issues around social housing which are heart-breaking. I feel passionately about green issues. I want to help local people and the issues which are important to them.”\nTom has been elected unopposed to become a councillor for Ongar Town Council representing its Shelley Ward alongside Labour colleague Diana Roberts representing Greensted ward.\nPlease see the following link, for information on all our candidates in the Epping Forest and Town Council wards in the Brentwood and Ongar Constituency.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_socialist-book-club/content_18.html": "The Socialist Book Club meets to consider a book or sometimes watch a film. Our discussions are enjoyable, allowing us to examine what we mean by socialism and to share the insights gained.\nNew members are welcome, and indeed you do not have to be a member – just come and join in the discussion, whether you have read the book or not.\nNEXT MEETING\nWe hope to next meet in early 2024 to see the film Hannah Arendt directed by Margarethe von Trotta and follow up by reading the new book ‘We Are Free to Change the World‘ by Lyndsey Stonebridge.\nThe club is committed to developing members’ knowledge of socialism, not just reading for pleasure, but recognises that ‘a good read’, followed by a lively discussion, would help.\nThe club first met on 25th October 2015 and talked about the books people had suggested, sharing reading interests and the purpose of the club.\nGet in touch us if you are interested in joining us.\nBooks we have already discussed and links to our reviews:\n- November 2015 – The Soul of Man Under Socialism by Oscar Wild\n- January 2016 – The Establishment: and How They Get Away with It by Owen Jones\n- July 2016 – The Ragged Trousered Philanthropists by Robert Tressell\n- October 2016 – This Changes Everything by Naomi Klein\n- November 2017 – The Joy of Tax by Richard Murphy\n- January 2017 – The Jungle by Upton Sinclair\n- April 2017 – Ghosts of Spain by Giles Tremlett\n- July 2017 – Break the Chains of Poverty Pay, Casual Labour and Exploitation by Richie Venton\n- August 2017 – Active Hope: How to face the mess we’re in without going crazy by Joanna Macy & Chris Johnstone\n- October 2017 – And the Weak Suffer What They Must by Yanis Varoufakis\n- December 2017 – Citizen Clem: A Biography of Attlee by John Bew\n- February 2018 – Prosperity Without Growth by Timothy Jackson\n- March 2018 – No is Not enough by Naomi Klein\n- May 2018 – Animal: The Autobiography of a Female Body by Sara Pascoe\n- July 2018 – Postcapitalism – A Guide to Our Future by Paul Mason\n- September 2018 – Animal Farm by George Orwell\n- December 2018 – Rules for Radicals by Saul D. Alinsky\n- February 2019 – The rise of the Right : English nationalism and the transformation of working-class politics by Simon Winlow\n- June 2019 – The New Working Class: How to win hearts, minds and votes by Claire Ainsley\n- May 2020 – Hard Times by Charles Dickens\n- November 2020 – Brit(ish): on Race, Identity and Belonging by Afua Hirsch\n- December 2020 – Capitalist Realism: Is There No Alternative?’ by Mark Fisher",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_postcapitalism-a-guide-to-uur-future-paul-mason/content_38.html": "Discussed July 2018, review by Sue Kortlandt September 2018\nA very dense book, closely argued, so it needed a fair bit of concentration. It starts from the premise that neoliberalism is broken and capitalism is failing, and that we have to transition to a postcapitalist project.\nThe first part of the book explains in detail the history of capitalism, from the earliest machines, workers moving from the land to factories, through to the information revolution. Mason’s historical perspective, descriptions and analysis are convincing and paint a very believable picture, not just of the past, but the reasons why capitalism in its current form may not be able to adapt to changes brought about by new technology and external shocks, especially climate change.\nIn part 2, he puts forward the possibility of a postcapitalist project, built around networking on a grand scale, the sharing economy and struggles against hierarchies. He calls this a transition, and there are the germs of an alternative, but it seems very open-ended – a work in progress.\nA thought-provoking book, not easy but worth reading.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_author_rmillwood_page_2/content_25.html": "Author: Richard Millwood\n-\nNew Brentwood South team member: Elizabeth Jerrard\nWith the redrawing of ward boundaries, Liz Jerrard has been chosen as the third member of the Brentwood South Labour team, alongside Gareth Barrett and Tim Barret. She knows the ward well having been part of the team that has seen Labour win the last two elections in Brentwood South, with substantial majorities over the…",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_labour-success-in-district-elections/content_7.html": "The 2024 Brentwood Borough Council elections saw Labour make a clean sweep in Brentwood South ward, increasing its team there to three councillors and come a good second in Hutton North and Hutton South wards.\nIn Ongar, we also came second in North Weald Bassett ward with an increased vote.\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_category_uncategorized/content_11.html": "Category: Uncategorized\n-\nDr Gareth Barrett launches Labour campaign in Brentwood, Ongar and North Weald\nDr Gareth Barrett visited Brentwood High Street, Ongar High Street and North Weald airfield to meet with campaigners at the start of his bid to become Brentwood & Ongar’s next MP. Labour members in Brentwood turned out in numbers at the Chapel ruins outside the Baytree Centre to launch the campaign before Ongar members met…\n-\nBrentwood & Ongar is between Labour and the Conservatives\nPolling of 14,000 voters by YouGov, reported today in the Daily Telegraph, shows the battle for Brentwood and Ongar is between Labour and the Conservatives. Tactical voters over the years, hoping to replace the Conservatives, have been led to believe that the Liberal Democrats hold second place, which in turn has lead to Brentwood Borough…\n-\nTom Acornley standing for Shelley on May 4th\nTom Acornley, the Labour Party’s candidate for Shelley ward on Epping Forest District Council, has a special reason to stand for election on May 4. “I’m disabled and use a wheelchair all the time. Since being in a wheelchair, I’ve realised I’m not listened to and don’t feel represented nationally or locally. I can’t be…",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_brentwood-campaign-2024/content_13.html": "Brentwood and Ongar Constituency covers all thirteen wards in Brentwood Borough Council and five wards as part of the Epping Forest District Council.\nElection results\nBlackmore & Doddinghurst\n| Roger John | McCheyne | The Conservative Party Candidate | 982 | Elected |\n| Keith | Parker | The Conservative Party Candidate | 960 | Elected |\n| Clifford Edward | Poppy | The Conservative Party Candidate | 947 | Elected |\n| Mary | Spiers | Liberal Democrats | 291 | |\n| Vanessa Penelope | Laplain | Liberal Democrats | 218 | |\n| Heather Margaret | Leathley | Liberal Democrats | 210 | |\n| Peter George | Dedman | Labour Party | 180 | |\n| Nicholas Spencer | Kelly | Green Party candidate | 180 | |\n| Thomas Alan | Acton | Labour Party | 179 | |\n| Wendy Jane | Marshall | Labour Party | 177 | |\nBrentwood North\n| Alison Elizabeth | Fulcher | Liberal Democrats | 879 | Elected |\n| Philip Christopher | Mynott | Liberal Democrats | 868 | Elected |\n| Stephen John | Mayo | Liberal Democrats | 840 | Elected |\n| Hannah Ines | Nelson | The Conservative Party Candidate | 326 | |\n| Carol | Allen | Labour Party | 279 | |\n| Benjamin Richard | Slade | The Conservative Party Candidate | 279 | |\n| Harrison Edward | Slade | The Conservative Party Candidate | 241 | |\n| Niels Jorgen | Andersen | Labour Party | 233 | |\n| Robert Allen Willett | Marshall | Labour Party | 229 | |\n| Paul Francis | Jeater | Green Party candidate | 181 | |\nBrentwood South\n| Gareth Paul | Barrett | Labour Party | 770 | Elected |\n| Tim Nicholas | Barrett | Labour Party | 758 | Elected |\n| Elizabeth Susan | Jerrard | Labour Party | 649 | Elected |\n| Nigel John | Clarke | Liberal Democrats | 573 | |\n| Arthur Harold | Leathley | Liberal Democrats | 526 | |\n| Toby John | Green | Liberal Democrats | 497 | |\n| Adrianus Cornelis | Coolbergen | The Conservative Party Candidate | 314 | |\n| Peter Mark Henderson | Jakobsson | The Conservative Party Candidate | 301 | |\n| John Anthony Michael | Parrish | The Conservative Party Candidate | 292 | |\nBrentwood West\n| Sarah Katherine | Cloke | Liberal Democrats | 713 | Elected |\n| David John | Kendall | Liberal Democrats | 702 | Elected |\n| Dominic Phillip | Naylor | Liberal Democrats | 660 | Elected |\n| Lucy Lee | Gelderbloem | The Conservative Party Candidate | 425 | |\n| Ethan Tony | Russell | The Conservative Party Candidate | 418 | |\n| Alexander Murray | Tanner | The Conservative Party Candidate | 376 | |\n| Kevin | Brailey | Labour Party | 252 | |\n| Joanna Margaret | Moncrieff | Labour Party | 211 | |\n| Richard | Millwood | Labour and Co-operative Party | 176 | |\n| Marc Anthony Alexander | Sardinha | Green Party candidate | 130 | |\nBrizes, Stondon Massey & South Weald\n| Christine | Gelderbloem | The Conservative Party Candidate | 730 | Elected |\n| William Joseph | Russell | The Conservative Party Candidate | 727 | Elected |\n| Soni Pavinder | Sunger | The Conservative Party Candidate | 604 | Elected |\n| Brenner Jack | Munden | Liberal Democrats | 566 | |\n| Brent McCowan | Smith | Liberal Democrats | 518 | |\n| Nicola Jose | Munden | Liberal Democrats | 512 | |\n| David | Jobbins | Labour Party | 179 | |\n| Pauline Anne | Watts | Labour Party | 114 | |\n| Eric James | Watts | Labour Party | 107 | |\nHerongate, Ingrave & West Horndon\n| Sheila Patricia | Murphy | The Conservative Party Candidate | 701 | Elected |\n| Adrian Charles | Baldock | The Conservative Party Candidate | 660 | Elected |\n| Fiona Elizabeth | Marsh | The Conservative Party Candidate | 639 | Elected |\n| Garfield Alexis | Maxius | Liberal Democrats | 246 | |\n| Anne Valerie | Long | Liberal Democrats | 233 | |\n| Benedicta Grace | Worsfold | Liberal Democrats | 196 | |\n| June Erica | Barrett | Labour Party | 131 | |\n| Paul William | Barrett | Labour Party | 121 | |\n| Gary | Earle | Labour Party | 114 | |\nHutton East\n| Adam Jack | Chinnery | The Conservative Party Candidate | 672 | Elected |\n| Benjamin | Rigby | Liberal Democrats | 636 | Elected |\n| Jason William | Gibson | The Conservative Party Candidate | 597 | Elected |\n| Sharon Rose | Ward | Liberal Democrats | 534 | |\n| Francis John | Caves | Liberal Democrats | 515 | |\n| Satyan | Lal | The Conservative Party Candidate | 510 | |\n| Paul Nicholas | Godfrey | Reform UK | 237 | |\n| Benjamin Frederick Charles | Booker | Labour Party | 154 | |\n| Malcolm Charles | Burgess | Labour Party | 145 | |\n| Jacqueline Ann | Nyiro | Labour Party | 133 | |\nHutton North\n| Keith Richard | Barber | The Conservative Party Candidate | 861 | Elected |\n| Janet Irene | Pound | The Conservative Party Candidate | 714 | Elected |\n| Janak | Patel | The Conservative Party Candidate | 674 | Elected |\n| Philip Paul | Holland | Labour Party | 444 | |\n| Noor | Hussain | Labour Party | 386 | |\n| Neil John | McAree | Labour Party | 383 | |\n| Henry Patrick | Macdonnell | Liberal Democrats | 278 | |\n| Florina Emilia | Constanda | Liberal Democrats | 209 | |\n| Michael James | Flood | Green Party candidate | 181 | |\n| Elise Joy Clothilde | Mayer | Liberal Democrats | 164 | |\nHutton South\n| Roger Charles | Hirst | The Conservative Party Candidate | 757 | Elected |\n| Mark Peter | Reed | The Conservative Party Candidate | 752 | Elected |\n| Mellissa Mary | Slade | The Conservative Party Candidate | 698 | Elected |\n| Jane Elizabeth | Winter | Labour Party | 464 | |\n| Jonathan Nicolas Roy | Saunders | Labour Party | 461 | |\n| Rowan | Sumner | Labour Party | 428 | |\n| Laura | Carey | Liberal Democrats | 263 | |\n| John Maynard | Chapple | Liberal Democrats | 260 | |\n| John Michael | Hamilton | Green Party candidate | 183 | |\n| Valdomiro | Lourenco | Liberal Democrats | 180 | |\nIngatestone, Fryerning & Mountnessing\n| Darryl Michael | Sankey | Liberal Democrats | 999 | Elected |\n| Hugh Maurice | Gorton | Liberal Democrats | 818 | Elected |\n| Lesley Anne | Wagland | The Conservative Party Candidate | 809 | Elected |\n| Susan Jane Margaret | Hyde | Liberal Democrats | 781 | |\n| Thomas John | Bridge | The Conservative Party Candidate | 743 | |\n| David John | Wylie | The Conservative Party Candidate | 607 | |\n| Patricia Mary | Dedman | Labour Party | 136 | |\n| Caroline Ann | Russell | Labour Party | 130 | |\n| Richard | Enever | Labour Party | 120 | |\nPilgrims Hatch\n| Barry Roy | Aspinell | Liberal Democrats | 1015 | Elected |\n| Victoria Frances | Davies | Liberal Democrats | 996 | Elected |\n| Mark Robert | Lewis | Liberal Democrats | 892 | Elected |\n| Gordon William Frank | Cowley | The Conservative Party Candidate | 223 | |\n| Gerardine Alice Mary | Jakobsson | The Conservative Party Candidate | 215 | |\n| Louise Caroline | Rowlands | The Conservative Party Candidate | 205 | |\n| Simon Peter | Ball | Labour Party | 162 | |\n| Katie | Hutton | Labour Party | 150 | |\n| Francisca Jose | Dapp | Labour Party | 133 | |\n| David Mark | Hale | Green Party candidate | 97 | |\nShenfield\n| David Howard | Worsfold | Liberal Democrats | 835 | Elected |\n| Nicola Mary | Cuthbert | Liberal Democrats | 801 | Elected |\n| Thomas Edward | Gordon | The Conservative Party Candidate | 692 | Elected |\n| John Gurparshad | Singh | Liberal Democrats | 676 | |\n| Thomas Alexander | Heard | The Conservative Party Candidate | 652 | |\n| Sangita | Brown | The Conservative Party Candidate | 621 | |\n| Richard Malcolm | Briggs | Reform UK | 227 | |\n| Julian Andrew David | Goode | Green Party candidate | 148 | |\n| Anna Justine | Cadzow | Labour Party | 141 | |\n| Dominic Piers | Maddock | Labour Party | 111 | |\n| Richard James | Carter | Labour Party | 110 | |\nWarley\n| Martin Leonard | Cuthbert | Liberal Democrats | 630 | Elected |\n| Mark Alexander | Haigh | Liberal Democrats | 617 | Elected |\n| Jason Joseph | Laplain | Liberal Democrats | 605 | Elected |\n| Jean Alma | McGinley | The Conservative Party Candidate | 243 | |\n| Paul James | Faragher | The Conservative Party Candidate | 241 | |\n| John Eric | Gibson | The Conservative Party Candidate | 239 | |\n| Michael Francis | Bernstein | Labour Party | 171 | |\n| Jackie Elizabeth | Gilbey | Labour Party | 167 | |\n| Susan Margaret | Kortlandt | Labour and Co-operative Party | 140 | |\n| Olivia Eve | Ritson | Green Party candidate | 140 | |",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_get-in-touch/content_9.html": "We believe we are a friendly party, so do please get in touch if you have any questions or suggestions by using the contact form below.\nRichard Millwood, Chair\nYou can also e-mail us at BrentwoodandOngarLabour@gmail.com.\nAcross the country Labour has made huge gains, and although we haven’t won in Brentwood and…\nWe believe we are a friendly party, so do please get in touch if you have any questions or suggestions by using the contact form below.\nRichard Millwood, Chair\nYou can also e-mail us at BrentwoodandOngarLabour@gmail.com.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_new-brentwood-south-team-member-elizabeth-jerrard/content_29.html": "With the redrawing of ward boundaries, Liz Jerrard has been chosen as the third member of the Brentwood South Labour team, alongside Gareth Barrett and Tim Barret. She knows the ward well having been part of the team that has seen Labour win the last two elections in Brentwood South, with substantial majorities over the Conservatives.\nLiz is a determined supporter of community facilities, being involved in campaigns to save our local libraries, and making sure that activities are available that engage all the generations of local residents. She has worked hard locally to preserve our local green spaces as important focal points in the community, and is a great supporter of our local businesses and High Streets.\nLiz has lived in Brentwood for over 20 years and commutes into London where she works as a software project manager with experience from different industries, including telecoms, entertainment, and financial services. You can often find Liz running the streets of Brentwood, or at the South Weald weekly Parkrun. She is also a keen cyclist and frequently seen on her bike going to and from the station.\nElizabeth Jerrard said:\n“I am excited to be given the opportunity to represent you, join the Brentwood South Labour team and help make a difference for our local community .”\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_british-on-race-identity-and-belonging-afua-hirsch/content_35.html": "Discussed and reviewed by Susan Kortlandt November 2020.\nWe all enjoyed reading this book, although some had not finished it. It is written from a very personal perspective, but also references many issues experienced by black people in general. Although there was a huge amount of detail, I found it easy to read.\nThe themes of the book relate to her awareness of being different, finding and accepting her own true identity and working out where she belongs. In doing so, she draws on the experiences of many other black people and highlights some of the injustices they have suffered, and continue to do.\nAfua was born and grew up in Wimbledon. Both parents were also born in Britain, but her mother is of Ghanaian heritage and her father Jewish. They met as students at university. The family are very comfortably off, Afua was sent to a private school, where she was the only non-white pupil in her class. Although she had friends, she felt all through her childhood and teenage years that she did not quite belong. She did not speak Twi – the mother tongue of her grandmother, and even found it hard to pronounce her Ghanaian name.\nShe compares her privileged background with that of her partner, Sam, who grew up in Tottenham, a black neighbourhood controlled by the “hoods”. She feels that, because he was surrounded by black culture, he is more comfortable in his skin than she is. Both, however, achieved academic success and met as young lawyers.\nAfua was very interested in Ghana, she visited with her mother and grandmother as a teenager and wanted to be African. After University, she worked in Senegal and Ghana, but found that she was not accepted there as a native and was thought to be a white woman. She eventually returned to make her home in Britain.\nThe book also explores some of the myths about black people, especially the idea that black men are sexually very powerful. She also comments on the notions that black women are ugly. In her youth, she hated her hair and spent a lot of effort “de-frizzing it”. She notes that black women in the public eye are expected to smooth their hair and that paler women have more success. There is huge social pressure to conform to the norms as seen by white people.\nThe Door of No Return is a reference to the history of slavery. People rounded up for the slave trade were imprisoned in a coastal fortress, where men and women were separated. The only access to the women’s cell was a ladder from the upstairs rooms of the prison governor, thus many girls and women were beaten and raped. They left this prison through the Door of No Return, a narrow space leading only to the sea and the slave ship. It is notable that, while most British children are taught about slavery, they learn nothing about the history and cultures of the various African countries from which they were taken.\nThe chapter on Class looks at the difficulties faced by black people, such as poverty and discrimination – even if unintentional – and the pretence of “colour blindness”. She talks about the idea of the Good Immigrant and the assumption that all black people are immigrants, therefore not entitled to the same benefits as white people.\nFinally, partly from her own experiences, and those of her daughter, she recognises herself as British.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_supporting-labour-locally/content_20.html": "The number of people joining the party lately has been huge and so there has never been a better time for you to join us campaigning too.\nOur team works across Brentwood and Ongar, from Abridge to Willingale, and it doesn’t matter what your experience, we have something which you can get involved with.\nIf you would like to help out, please complete our members form below or talk to Richard Millwood, our Chair through email richardmillwood@gmail.com or phone 07790 558 641.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_category_press-releases/content_10.html": "Category: Press releases\n-\nAn Audience with Emily Thornberry\nOur fund-raising Christmas Social held in the Brentwood Theatre this year was a big hit, featuring our Women’s Officer, Liz Jerrard, in conversation with Labour cabinet member and shadow Attorney General, the Rt Hon Emily Thornberry MP, Labour MP for Islington South and Finsbury. Topics ranged from Emily’s own upbringing in some poverty, to her rise to…\n-\nSusan Kortlandt stepping up for Hutton East\nSince retiring from her job as a teacher, Labour Party candidate for Hutton East Sue Kortlandt has been active in the local community, volunteering with Citizens Advice and most recently, starting as Covid struck, with Brentwood Mutual Aid. Now, though, after campaigning on issues such as mobile phone coverage and the climate emergency, she is…\n-\nDr Tim Barrett – our candidate for Brentwood South\nDr Tim Barrett is seeking re-election as a Labour Party councillor for Brentwood South, pledging to ensure that there is always an effective opposition on Brentwood Borough Council, challenging the administration and making the case for value for money from the Council. Dr Barrett, who has served as a Councillor for Brentwood South since 2019…\n-\nLabour to fight every council seat in Brentwood & Ongar\nThe Labour Party is to put up candidates in every seat on Brentwood Borough Council to be contested on May 4. It will also stand in the four wards on Epping Forest District Council that fall within the Brentwood and Ongar constituency and is also putting up two candidates for Ongar Town Council The party…",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_hard-times-charles-dickens/content_34.html": "Discussed May 2020, review by Richard Millwood June 2020\nCharles Dickens was a remarkable and prolific writer, and through his novels and journalism, told much about the human condition in the 19th century. His books often focus on the difficulties faced by the poor and working classes based on Dickens’ own life experiences.\nIndeed, Karl Marx said of Dickens, and others, that their:\n“graphic and eloquent pages have issued to the world more political and social truths than have been uttered by all the professional politicians, publicists and moralists put together”\nHard Times is no exception, and having not read Dickens for a few years, I was struck again by the rich and evocative language that Dickens uses to conjure contexts and people while telling a compelling story.\nSo, as an informative and entertaining experience it works well, telling us of the trials and tribulations faced by families, factory owners, professionals, downtrodden workers and the destitute in a fictional manufacturing town called ‘Coketown’, modelled on Preston, Lancashire.\nBut what struck me most, is the way he illustrates so clearly some of the theoretical concepts that Marx wrote about, particularly ‘alienation’.\nMarxist Alienation\n“The theoretical basis of alienation within the capitalist mode of production is that the worker invariably loses the ability to determine life and destiny when deprived of the right to think (conceive) of themselves as the director of their own actions; to determine the character of said actions; to define relationships with other people; and to own those items of value from goods and services, produced by their own labour.”\nAnd in relation to the act of production:\n“This means he cannot freely and spontaneously create according to his own directive as labor’s form and direction belong to someone else.”\nMarx quoted on Wikipedia\nOf course Dickens never mentions the term, nor does he mention Marx, although they were contemporaries. Dickens rarely theorises nor does he appeal to collective action. Indeed in Hard Times he mocks the union and parliament in equal measure. Nevertheless the ‘muddle’ experienced by Stephen Blackpool – a central character and factory worker – which Dickens so vividly relates, is the result of Stephen’s own experience of alienation in the factory and the chronic unhappiness in his personal life.\nStephen Blackpool confronts Bounderby, the factory owner to complain about the ‘muddle’ regarding the conflict between owner and worker, culminating in this paragraph about the treatment of workers:\n“Most o’ aw, rating ’em as so much Power, and reg’latin ’em as if they was figures in a soom, or machines: wi’out loves and likens, wi’out memories and inclinations, wi’out souls to weary and souls to hope—when aw goes quiet, draggin on wi’ ’em as if they’d nowt o’ th’ kind, and when aw goes onquiet, reproachin ’em for their want o’ sitch humanly feelins in their dealins wi’ yo—this will never do ’t, sir, till God’s work is onmade.”\nHard Times, Book the Second, Chapter V\nRomantic alienation\nThe book is famous amongst educators in its opening lines, for the extraordinary characterisation of Gradgrind, a superintendent who emphasises facts and argues there is no room for fancy or feeling amongst his students and indeed his family:\n“Now, what I want is, Facts. Teach these boys and girls nothing but Facts. Facts alone are wanted in life. Plant nothing else, and root out everything else. You can only form the minds of reasoning animals upon Facts: nothing else will ever be of any service to them. This is the principle on which I bring up my own children, and this is the principle on which I bring up these children. Stick to Facts, sir!”\nDickens, having erected this monster, uses most of the book to knock him down, and towards the end of the book writes:\n“Utilitarian economists, skeletons of schoolmasters, Commissioners of Fact, genteel and used-up infidels, gabblers of many little dog’s-eared creeds, the poor you will have always with you. Cultivate in them, while there is yet time, the utmost graces of the fancies and affections, to adorn their lives so much in need of ornament; or, in the day of your triumph, when romance is utterly driven out of their souls, and they and a bare existence stand face to face, Reality will take a wolfish turn, and make an end of you.”\nHard Times, Book Two, Chapter VI\nIn doing so, apart from an untypical warning to us of the potential power of the masses, he is outlining the kind of romantic alienation that Marx discusses – alienation from our human essence.\nMy feeling is the book complements Marxist theory, with rich exemplification and description of conditions in society few of us have experienced but which would have been known somewhat to Dickens’ contemporaries. Perhaps the moral force of Dickens’ novel helped feed the spirit which led to the foundation of the Labour Party only a few years later? Certainly early Labour MPs unanimously cited his work, amongst others, as influential, but only two claimed to have read Marx.\nIn our discussion of Hard Times, some claimed they preferred novels to theoretical texts, but my view is that both are essential and that they feed upon each other. The novel provides exemplification and motivation while entertaining us, but if you are attempting to take action:\n“there is nothing so practical as a good theory! “\nKurt Lewin, a founder of social psychology",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk/content_1.html": "Informal meetings\nIf you are interested in politics, why not come and meet us!\nWe get together informally to talk politics – if you’d like to find out who we are and what we are like, do get in touch .\nMonthly meetings\nWe also organise our activity through monthly meetings which are open to members and supporters alike, either online or in person.\nWe normally begin by making friends and catching up over a cup of tea or coffee. Our main focus is on campaigning, political debate and policy formation.\nThe next such meeting is on Wednesday 19 February 2024 at 7:30pm.\nDo get in touch if you’d like to attend or would like a lift to get there.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_the-establishment-and-how-they-get-away-with-it-owen-jones/content_32.html": "Discussed January 2016, this review by Sue Kortlandt May 2016\nOwen Jones defines the modern Establishment as a powerful but unaccountable network of people who wield massive power and use it to maintain their wealth and position. His starting point is ideas promulgated by right-wing economists, taken up by Margaret Thatcher and friends. This neo-liberal philosophy became the “norm” and moved the balance of public opinion to the right.\nThrough a series of interviews, Owen Jones charts the links between various groups – ideological, academic, personal – from the lobbies of Westminster to the newsrooms, boardrooms and trading rooms of Fleet Street and the City, and including the police, who were so essential to Thatcher’s project. Of particular interest to Labour Party members is the section on Blair and his ministers, some of whom did very nicely! Exposing the revolving doors that link these worlds, and the vested interests that bind them together, Jones shows how, in claiming to work on our behalf, the people at the top are doing precisely the opposite. In fact, they represent the biggest threat to our democracy today – and it is time they were challenged.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_category_local-news/content_5.html": "Category: Local news\n-\nGareth Barrett achieves a 20% swing from Conservatives to Labour\nAcross the country Labour has made huge gains, and although we haven’t won in Brentwood and Ongar, our result is big. We have made a huge impact on the Conservative vote and reduced the LibDems to half of the Labour vote, making it clear that we not they are the main challenge to the right…\n-\nOur chance for change\nLabour’s Gareth Barrett can beat the Conservatives in Brentwood & Ongar. This year in Brentwood & Ongar, all independent experts (e.g. Tactical Vote and Get voting) agree it’s going to be a straight choice between change with Labour, and the Conservatives. With Labour finishing second in the constituency in the last two general elections and…\n-\nDr Gareth Barrett – it’s time for a change\nGareth’s five missions: With Labour finishing second in the constituency in the last two general elections and the latest polling in Brentwood & Ongar putting the gap between Labour and the Tories at less than 10%, change is possible! Labour’s Gareth Barrett can beat the Conservatives in Brentwood & Ongar. Gareth writes: “Dear Residents, Standing…\n-\nLabour success in district elections\nThe 2024 Brentwood Borough Council elections saw Labour make a clean sweep in Brentwood South ward, increasing its team there to three councillors and come a good second in Hutton North and Hutton South wards. In Ongar, we also came second in North Weald Bassett ward with an increased vote.\n-\n‘A Century of Labour’ with Jon Cruddas\nA “critical friend” of Keir Starmer, Jon Cruddas MP for Dagenham and Rainham, told an audience at the Brentwood Theatre that a future Labour government faces defeat if it neglects its historic purpose. Mr Cruddas warned: ”If the next Labour government pursues a technocratic centre-left line we may be overcome by the forces gathering.” Jon…\n-\nBrentwood & Ongar is between Labour and the Conservatives\nPolling of 14,000 voters by YouGov, reported today in the Daily Telegraph, shows the battle for Brentwood and Ongar is between Labour and the Conservatives. Tactical voters over the years, hoping to replace the Conservatives, have been led to believe that the Liberal Democrats hold second place, which in turn has lead to Brentwood Borough…\n-\nOn your side on planning\nAfter successfully working with residents to oppose the inappropiate development in Ewing House Car Park, King Edwards Road (pictured above), Brentwood Labour councillors continue to make sure that residents know about proposed developments in their area, and that their views are both heard and seriously considered when local planning applications are decided. Councillor Gareth Barrett:…\n-\nImmediate actions on climate challenge for Brentwood\nFollowing the Council’s declaration of a Climate Emergency, a specialist working group, chaired by Brentwood South Councillor Dr Tim Barrett, has identified early actions that will get Brentwood Borough Council more than halfway towards its 2030 Net Zero ambition. The majority of these measures are either cost-neutral or revenue-generating for example adding solar panels and…\n-\nNew Brentwood South team member: Elizabeth Jerrard\nWith the redrawing of ward boundaries, Liz Jerrard has been chosen as the third member of the Brentwood South Labour team, alongside Gareth Barrett and Tim Barret. She knows the ward well having been part of the team that has seen Labour win the last two elections in Brentwood South, with substantial majorities over the…",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_brentwood-and-ongar-clp/content_21.html": "As a democratic, socialist party we welcome people to join the party from all walks of life, to have their say, elect candidates for election and debate and influence policy.\nFor newcomers, working out how everything fits together can seem a bit of a maze – but don’t let that put you off as there’s a common goal: ensuring the party remains open and democratic and helping maintain contact between the party, the people and the government.\nOur structure, and our open policy development process enables more people than ever before to have their say. The Labour party in Brentwood currently (December 2023) has around 400 members and many more affiliates and registered supporters. Locally we have more than all the other political parties put together.\nFurthermore, in recent elections since 2015, Labour has consistently been ahead of the Liberal Democrats in general elections, even in the difficult-for-Labour election of 2019, which should give you pause for thought before voting tactically!\nWhere you fit in\nNew ideas are vital if the party is to grow and develop – and your views, experience and help are welcome. Members are very different in their outlook, some preferring to pay their subs to support the party, others taking an active role in local politics and yet more enjoying the chance to debate national policy issues at meetings with a view to influencing the national party.\nIt is vital to understand that in spite of our differences we actively maintain friendship and respect to create effective teams from all those who can campaign, form policy or raise funds.\nThe Constituency – Brentwood and Ongar\nThe Brentwood and Ongar Constituency Labour Party (CLP) is based on the electoral area for the election of its MP (outlined in pink below). Via your CLP, you can choose members to represent us at annual conference and you can help select the parliamentary candidate.\nAt the district council level, The Local Government Boundary Commission for England has recently (2023) finalised new ward boundaries for both Epping Forest District Council (outlined in purple below) and Brentwood Borough Council (outlined in red below).\nThe constituency is now made up of eighteen district council wards, five wards to elect councillors to Epping Forest District Council and thirteen wards to elect to Brentwood Borough Council.\nFor Epping Forest there is some overlap between our CLP and Harlow and Epping Forest CLPs, so we collaborate on elections for these wards.\nAt the next level of local government, Ongar Town Council and the Parish Councils also have a significant role and a budget. These usually operate ‘apolitically’, but this is not the case for Ongar Town Council. Members are encouraged to take part in these as they often simply mean applying to join. Work done here can be of great value in supporting a campaign at district council level.\nAll Member and Supporter Meetings\nMeetings play an important role in debating key issues and agreeing the direction of campaigning locally. However, they can also become a matter of routine management, which can detract from the political interests members have.\nFor these reasons, locally we hold monthly meetings open to all members and supporters to debate issues and strategies, and we annually elect an Executive Committee to manage the party’s work and a Local Government Committee to organise active members to deal with local campaign issues.\nOngar Branch\nThe Constituency Labour Party has two branches – Brentwood and Ongar. Ongar branch meets and operates independently with respect to its parishes, Town Council and wards of Epping forest District council. Please get in touch if you live in Ongar or in the parishes to the north and would like to support the Ongar Branch.\nCLP Executive Committee\nThis committee is responsible for managing the party’s activities locally, organising the agenda for our meetings, booking meeting halls, handling the finances and acting on behalf of the CLP members when appropriate. It is elected by the CLP membership at our Annual General Meeting (AGM) held in June/July each year.\nThis is the current framework (2024) for Brentwood & Ongar Constituency Labour Party – half must be women.\nMembers are elected by the General Committee of all members present at the AGM. Functional officers may also be appointed by Executive Committee.\nContact Richard Millwood if you have any questions:\nchair@brentwoodandongarlabour.org.uk\n07790 558641\nExecutive Officers\nExecutive Officers | (able to vote) | |\n|---|---|---|\n| Position | Name | Tasks |\n| 1 Chair | Richard Millwood | 1. Maintain oversight that the CLP is compliant with its constitution 2. Chair meetings of the members 3. Chair meetings of the executive committee 4. Agree dates, venues and agenda items for meetings, , including informal meetings to encourage members to join in 5. Act as deputy treasurer 6. Produce a short annual report |\n| 2 Secretary | Jane Winter | 1. Minute meetings of members and executive committee 2. Arrange meeting venues 3. Produce a short annual report |\n| 3 Vice Chair (Campaigns & Membership) | Kevin Hind | 1. Step in for the chair when necessary 2. Oversees campaigns, chairing parliamentary campaign committee 3. Communicates with new and lapsing members |\n| 4 Treasurer | Dominic Maddock | 1. Maintain the CLP bank account(s) 2. Monitor expenditure and advise campaigns 3. Accept and make payments 4. Produce an annual statement and short report |\n| 5 Women’s Officer | Liz Jerrard | 1. Arrange and chair events to offer support and voice to women members 2. Arrange and chair events on their issues for all members 3.Produce a short annual report |\n| 6 Trade Union Liaison Officer | Cliff Roney | 1. Nurture contact with unions 2. Arrange speakers from unions 3. Produce a short annual report |\n| 7 BAME Officer (only electable if no other executive officer identifies as BAME) | 1. Arrange and chair events to offer support and voice to BAME members 2. Arrange and chair events on their issues for all members 3.Produce a short annual report | |\n| Functional Officers | (without vote) | |\n| 8 Policy | Tim Barrett | 1. Support local meetings and working groups in preparing policy 2. Communicate local outcomes to policy formation bodies in the national party |\n| 9 Fundraising | Alison Wingfield | 1. Plan a sequence of events such as quiz night, audience with speakers, debate night, Christmas social, garden party 2. Convene working groups to implement events 3. Publicise and promote to members (and supporters) |\n| 10 Information Systems | 1. Operate Labour’s national systems such as Organise and Contact Creator as local admin 2. Support Secretary and Vice Chair (Campaigns & Membership) with their functions 3. Support Campaign team with leafleting rounds, maps and management spreadsheets 4. Maintain local data about activists | |\n| 11 Youth | 1. Arrange and chair events to offer support and voice to youth members 2. Arrange and chair events on their issues for all members 3. Produce a short annual report | |\n| 12 Campaigns | Gareth Barrett | 1. Produce a plan for district and county campaigns 2. Calculate a budget to guide expenditure 3. Organise leafleters and leafleting rounds 4. Maintain a calendar of campaign events 5. Communicate with activists |\n| 13 LGBTQ+ | 1. Arrange and chair events to offer support and voice to LGBTQ+ members 2. Arrange and chair events on their issues for all members 3. Produce a short annual report | |\n| 14 Communications and Social Media | Jonathan Saunders and Joanna Saunders | 1. To inform the public of our activities and views 2. To encourage new members to join 3. To encourage existing members to become active 4. To campaign locally, regionally and nationally for issues that our members care about 5. To pursue the aims of campaigns for election both locally regionally and nationally 6. To provide fora online for members to meet and pursue the party’s aims |\n| 15 Disabilities | Philip Holland | 1. Arrange and chair events to offer support and voice to disabled members 2. Arrange and chair events on their issues for all members 3.Produce a short annual report |\n| 16 Political Education | 1. Seek speakers for our meetings to inform and educate local members on Labour issues 2. Facilitate a programme and arrange meetings for the Socialist book club and Socialist film club | |\n| 17 Auditor 1 (finances) | Joanna Moncrieff | On behalf of all members to audit the annual accounts produced by the treasurer |\n| 18 Auditor 2 (procedures | Neil McAree | On behalf of all members to audit the process and conduct of meetings |\nLocal Government Committee\nThe CLP has established a Brentwood Borough Council Local Government Committee responsible for overseeing local campaigning in the Brentwood Borough Council wards. It is chaired by Liz Jerrard and has representation from the CLP, the Labour group of councillors, affiliated parties and trade unions.\nA campaign group then manages leaflet writing, street stalls, leaflet delivery and canvassing throughout the year and reports back. The Local Government Committee will also manage the recruitment and selection of candidates for elections. Currently we have two councillors – Gareth Barrett and Tim Barrett representing Brentwood South ward.\nA second Local Government Committee is a collaboration with Epping Forest CLP to cover the wards which elect to Epping Forest District Council.\nRegional Forums\nFor Essex County Council elections there is an Essex Campaign Forum, which works to coordinate campaigning for county seats.\nPolicy Making\nAs a party member you may also be invited to attend local and regional policy discussions throughout the year. Informal, friendly gatherings, members in each discussion can make submissions to policy development. There is also an annual Eastern Region conference to which our CLP sends delegates.\nSubmissions to the Labour Party do not have to stem from events, nor our own meetings alone. Anybody can share their views and ideas throughout the year, and several members have nationally recognised expertise which may be consulted by the national party from time to time.\nNational Policy Forum (NPF)\nThe NPF meets several times a year to make sure that the direction of our national policy reflects the broad consensus in the party. Between meetings, the representatives that make up the body liaise with the members, the representatives that make up the body liaise with the members, supporters and public who make submissions. NPF representatives will respond to submissions, ask questions and engage in on-going debate about the issues that matter to you, feeding them back when the NPF meets to move our policy forward.\nThe NPF includes representatives of CLPs and regions, Labour Councillors, affiliated trade unions and socialist societies, the PLP, the EPLP and other stakeholder groups within the Party.\nNational Executive Committee (NEC)\nMade up of representatives from each section of the party – government, MPs, MEPs, councillors, trade unions and CLPs. Members vote for their CLP representatives in a ballot each year. The NEC sets the party’s objectives and oversees the running of the party nationally.\nAnnual Conference\nThe annual conference is the ultimate authority in the Party deciding the policy framework from which the next manifesto will be drawn and setting party rules. It considers the policy papers prepared by the policy commissions after consulting local parties. Members choose delegates within the CLP to represent them at conference – and those delegates could include you.\nFor further details, please get in touch.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_brentwood-ongar-is-between-labour-and-the-conservatives/content_24.html": "Polling of 14,000 voters by YouGov, reported today in the Daily Telegraph, shows the battle for Brentwood and Ongar is between Labour and the Conservatives.\nTactical voters over the years, hoping to replace the Conservatives, have been led to believe that the Liberal Democrats hold second place, which in turn has lead to Brentwood Borough Council being made up of 18 Conservatives, 17 Liberal Democrats and 2 Labour councillors.\nBut in truth, Labour has come ahead of the Liberal Democrats at the last three general elections as this poll confirms Labour’s popularity in Brentwood and Ongar.\nIf you add to that a competent and experienced slate of Labour candidates, such as Liz Jerrard, Mayor Dr Gareth Barrett and Councillor Dr Tim Barrett standing in Brentwood South ward, there is every reason to vote Labour to keep the Conservatives out at the local elections in May.\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_press-release-labour-to-fight-every-council-seat-in-brentwood-ongar/content_31.html": "The Labour Party is to put up candidates in every seat on Brentwood Borough Council to be contested on May 4.\nIt will also stand in the four wards on Epping Forest District Council that fall within the Brentwood and Ongar constituency and is also putting up two candidates for Ongar Town Council\nThe party has selected candidates for the 12 Brentwood wards where elections were due to be held – and for an unscheduled vacancy in South Weald following the sudden resignation of a sitting Conservative councillor.\nTwo of Brentwood’s candidates are aged under 20.\nRichard Millwood, chair of Brentwood and Ongar Constituency Labour Party, said:\n“It is important to us that every Labour member and supporter in every ward has the opportunity to cast their vote for the party of their choice and to help secure the changes that are so vitally needed after the years of stagnation under the Conservatives.\n“As the squeeze on living standards continues to cause real hardship for many residents and the Conservative administration shows no signs of providing proper leadership, the Labour Party, which was runner-up in the past two General Elections, is the only political force with developed alternative policies for the people of Brentwood and Ongar.”\nThis May’s election will be the first for which voter identification will be required.\n“If you do not have a driving licence, passport or senior bus pass with your photograph, or the new Voter Authority Certificate, you will be unable to vote,”\nMr Millwood said.\n“Eighteen-year-olds voting for the first time in these elections need to be aware of this new requirement.”\nApplications for the Voter Authority Certificate must be received by Brentwood Borough Council by April 27 – six working days before the election.\n“We would urge voters not to leave their application until the last minute, or to apply for a postal vote,”\nMr Millwood said.\nNotes to Editors:\n- The 12 Brentwood wards where elections were scheduled are: Brentwood North; Brentwood South; Brentwood West; Brizes and Doddinghurst; Herongate, Ingrave and West Horndon; Hutton East; Hutton North; Ingatestone, Fryerning and Mountnessing; Pilgrims Hatch; Shenfield; Tipps Cross; and Warley.\n- The four Epping Forest District Council wards are: Chipping Ongar, Greensted and Marden Ash; Lambourne; North Weald Bassett; and Shelley.\n- A list of candidates is attached.\n- Postal vote applications must be received 11 days before the election.",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_gareth-barrett-achieves-a-20-swing-from-conservatives-to-labour/content_2.html": "Across the country Labour has made huge gains, and although we haven’t won in Brentwood and Ongar, our result is big.\nWe have made a huge impact on the Conservative vote and reduced the LibDems to half of the Labour vote, making it clear that we not they are the main challenge to the right in Brentwood and Ongar.\nOur campaign consisted of two leaflets widely distributed by a dedicated team of leafleters across the whole constituency – Abridge in the south west to Willingale in the North East, two hustings and four street stalls.\nIn addition we helped elect Chris Vince in Harlow and were noted to be one of the most active supporting campaign teams in the Eastern Region, thanks to many members stepping up and well organised by Gareth Barrett.\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_our-chance-for-change/content_23.html": "Labour’s Gareth Barrett can beat the Conservatives in Brentwood & Ongar.\nThis year in Brentwood & Ongar, all independent experts (e.g. Tactical Vote and Get voting) agree it’s going to be a straight choice between change with Labour, and the Conservatives.\nWith Labour finishing second in the constituency in the last two general elections and the latest polling in Brentwood & Ongar putting the gap between Labour and the Tories at 2%, change is possible!\nChart source: Survation MRP Poll projection for Brentwood & Ongar, 3rd June 2024 based on a sample of 30,044 respondents\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_on-your-side-on-planning/content_14.html": "After successfully working with residents to oppose the inappropiate development in Ewing House Car Park, King Edwards Road (pictured above), Brentwood Labour councillors continue to make sure that residents know about proposed developments in their area, and that their views are both heard and seriously considered when local planning applications are decided.\nCouncillor Gareth Barrett:\n“Local residents’ views are of utmost importance to us when planning applications are considered.\nWe are pleased that recent applications for inappropriate development on Riseway, Cameron Close and Ewing House Car Park in King Edwards Rd were refused, with both residents’ and Labour Councillors’ objections respected.\nWe continue to monitor all applications across Brentwood and continue to keep residents informed.”\nLeave a Reply",
  "https_www_brentwoodandongarlabour_org_uk_/https_www_brentwoodandongarlabour_org_uk_a-century-of-labour-with-jon-cruddas/content_16.html": "A “critical friend” of Keir Starmer, Jon Cruddas MP for Dagenham and Rainham, told an audience at the Brentwood Theatre that a future Labour government faces defeat if it neglects its historic purpose.\nMr Cruddas warned:\n”If the next Labour government pursues a technocratic centre-left line we may be overcome by the forces gathering.”\nJon Cruddas gave an inspiring account of the conclusions of his book, A Century of Labour, published in January to mark 100 years since the formation of the first Labour government in 1924.\nThe book analyses the ethical and moral dimensions of successful historical Labour transformations. These he described in everyday language related to social justice – the right to housing, health, education and personal fulfilment.\nHis advice was that Labour must re-assert these perspectives to avoid the prospect of a continuation of austerity and breakdown of public services and perhaps the rise of authoritarian government, the seeds of which are seen in the current Conservative administration.\nRichard Millwood, Chair of the Brentwood and Ongar Labour Party said:\n“How heartening it was to be reminded of Labour’s success over a century of major civilising improvements and how much this matters to maintain the effort locally, where it is possible to overturn the Conservatives. The current joint administration running Brentwood Borough Council, that Labour is central to, is making great strides to address the basics of social housing and green action which belong in that tradition.”\nAround fifty audience members were invited by interviewer Liz Jerrard to hear from Jon and question him on his upbringing, political roots and his ideas for the Labour Party in the next century.\nAlthough organised by Brentwood and Ongar Constituency Labour Party, the event was aimed at everyone in the community keen to hear an alternative voice in the community.\nJon Cruddas is to stand down at the next General Election after more than 23 years as an MP, first in Dagenham and since 2010 for Dagenham and Rainham.\nA Century of Labour by Jon Cruddas is published by Polity Press, 281 pages, ISBN: 1509558349\nLeave a Reply"
}