{
  "https_www_maddiehenson_com_default_aspx/https_www_maddiehenson_com_Default_aspx/content_3.html": "My Campaign\nThere is no doubt about it, this seat would be a hard one to win but I believe it’s possible.\nIt is made up of 2 very different boroughs. Consequently the most important thing we need to win the seat is to have someone who understands those needs.\nThe council ward I was elected in had been Tory for 100 years before I took it achieving a 9% swing and have retained twice since. I believe this proves that I know to win marginals.\nThe Tories will be a running a very negative campaign so our focus should be on offering a positive reason to vote Labour.\nThis will mean having a strong local offer for both Sutton and Croydon. Whether helping people directly with the cost of living crisis, supporting the local hospitals or campaigning to redevelop Croydon Town centre - together we can win!",
  "https_www_maddiehenson_com_default_aspx/https_www_maddiehenson_com_Priorities_aspx/content_2.html": "TACKLING VIOLENCE AGAINST WOMEN AND GIRLS\nThis is a scourge on our society. As a woman, mum and a councillor I see all the time the effects of this. I want to support Sadiq in turning this around.\nCLIMATE CHANGE\nThere is a climate crisis. As part of the GLA I would support Sadiq in helping London transform into a low or zero carbon city. I want my children to grow up in a world where we aren't seeing climate disaster and where there is a brighter greener future. The national Labour Party's policy of GB Energy is something that we as a team should be helping to deliver. One of Croydon and Sutton's major problems is the incinerator. I have always been vocal in my opposition to it (which was agreed before I was a councillor), and if an opportunity presents itself I will support any greener alternatives.\nIMPROVING TRANSPORT LINKS\nThe Superloop was good news especially for Sutton, but there still remains gaps in our public transport service, whether this is campaigning for the tram to be extended to Sutton or making Croydon Zone 4, to name but a couple.\nPRESERVE AND IMPROVE OUR HOSPITALS\nCroydon benefits very strongly from having A&E services on our doorstep, something which I have had frqeuent cause to rely on. But this is not something we should be taking for granted, and Sutton deserves equally good A&E services. I will fight to stop the contraversial relocation of these services out of St. Helier Hospital.\nSUPPORTING ARTS & CULTURE\nThis is an area of particular passion for me, as I have strong links with the Edinburgh Festival Fringe and am involved with a local theatre company. My children also have a strong interest in being involved in the theatre. The Tories always fail when it comes to Arts and Culture, look at the mess they are making of the Croydon Borough of Culture. London has a proud history of Theatre, Music and Art, and keeping this at the centre of our lives is incredibly important to me.\nAbout Me",
  "https_www_maddiehenson_com_default_aspx/https_www_maddiehenson_com_default_aspx/content_1.html": "My Campaign\nThere is no doubt about it, this seat would be a hard one to win but I believe it’s possible.\nIt is made up of 2 very different boroughs. Consequently the most important thing we need to win the seat is to have someone who understands those needs.\nThe council ward I was elected in had been Tory for 100 years before I took it achieving a 9% swing and have retained twice since. I believe this proves that I know to win marginals.\nThe Tories will be a running a very negative campaign so our focus should be on offering a positive reason to vote Labour.\nThis will mean having a strong local offer for both Sutton and Croydon. Whether helping people directly with the cost of living crisis, supporting the local hospitals or campaigning to redevelop Croydon Town centre - together we can win!",
  "https_www_maddiehenson_com_default_aspx/https_www_maddiehenson_com_About_aspx/content_5.html": "The Labour Party is in my blood\nFrom the moment I joined I have given Labour my heart and soul. Starting from my first meeting, where I joined the fundraising team and immediately put on two fundraisers myself.\nDuring my gap year I worked for Anne McGuire MP, while she was Minister for Disabilities, and she continues to be a huge inspiration for me. Anne remains a good friend and mentor. It was working for her that I developed a real love for politics.\nShortly after obtaining my degree, I attended my first conference in 2010 when I was elected as Croydon Central’s delegate. While there I was chosen to propose the housing composite which was reported in Inside Housing.\nIn 2014 I was elected to Ashburton ward in Croydon. Whilst I obtained a majority of over 200, Labour's lowest place candidate in the ward only scraped in by 8 votes - showing just how marginal the ward really was. Following the boundary review in 2018 the subsequent very marginal iteration Addiscombe East was even closer, and both in 2018 and 2022 I was the only successful Labour candidate in a split ward, the last time winning by 30 votes despite huge local swings against Labour, winning mainly due to the personal vote I had built up within the ward.\nIn the wider Labour movement my happiest moment was helping Sarah Jones get elected as an MP. Sarah is my idol within the party and to be a key part in her election was a dream.\nDuring my time in the council I have been both Civic Mayor and Deputy Cabinet member for children. I was Civic Mayor during Covid, and despite these restrictions I was still able to do many events around my theme, which was early life. This included Reading Roadshows (during the July lifting of lockdowns), designed to promote reading in families, which were attended by over 500 people.\nMore recently I co-ordinated Val Shawcross’s Croydon Mayoral selection and election campaign. This involved planning the campaign, producing the literature and managing the phone bank for the selection, which she won with 70% of the vote. Whilst Val ultimately lost the election we came back from 10 points behind to only lose by about 500 votes.\nSince we lost the mayoralty in Croydon I have been free to throw myself at my ultimate passion – tackling child poverty. I now work for a Child Poverty charity.",
  "https_www_maddiehenson_com_default_aspx/https_www_maddiehenson_com_ICanHelp_aspx/content_4.html": "To improve Croydon and Sutton, we must harness all of our talents, ideas and creativity.\nIt means listening to the real experts of our two boroughs – the residents who live and work here.\nTherefore please email me with your ideas on me@maddiehenson.com\nor E-mail: me@maddiehenson.com\nThe information you provide will be stored and processed by us solely for the purposes of my GLA campaign and dealing appropriately with any message you send. We will not pass on your details to any 3rd party (unless you consent for us to do this as part of your enquiry)."
}