{
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_my-views/content_23.html": "Animal Welfare (Kept Animals) Bill\nBreed Specific Legislation\nEnd the Cage Age\nGene Editing\nLive Animal Exports\nPlastic Pollution\nPuppy Smuggling\nAsylum Seekers Right to Work\nDeportation Flights\nNationality and Borders Bill – Trafficked Children\nNationality and Borders Bill – UK Asylum System\nEnergy Charter Treaty\nEnergy Equity Commission Bill\nEnergy Price Rises/Windfall Tax\nFashion Industry (Garment Trade Adjudicator)\nFracking\nFuel Poverty\nNorth Sea Oil/Gas Developments\nSolar Power\nSupport for Pubs\nFire and Rescue Service Reform\nSupport for Firefighters\nRight to Strike\nPolice, Crime Sentencing and Courts Bill – the Right to Protest\nPublic Sexual Harassment\nNational Security Bill and Censorship of Journalists\nValerie’s Law\nFirework Regulations\nFreedom of Speech/Online Safety Bill\nGambling Laws\nRefused Entry for Guide Dog Owners\nMeat Mandates in Schools\nSATs, phonics and formal tests in primary school\nUniversity Strikes\nAlcohol Labelling\nCancer and the Cost of Living Crisis\nCannabis-Based Medicinal Products\nCap on Care Costs and the Health and Care Act\nChildhood Obesity\nDementia and the Social Care Workforce\nDiabetes Care and Prevention\nEnd of Life Care\nHigh Blood Pressure\nJoint Replacement Surgery\nKinship Care\nMonkeypox\nMotor Neurone Disease Carers\nNHS Eye Care\nNHS Staff Pay\nOvarian Cancer\nPancreatic Cancer – 10 Year Cancer Plan\nPeriod Poverty\nRadiotherapy\nReviving the NHS\nSave our NHS\nStudent Doctors – NHS Bursaries\nSupport for Unpaid Carers\nSupport for Visually Impaired Children\nSupport for Young Carers\nNo Fault Evictions\nUnfit Housing\nDetention of Jagtar Singh Josal\nFamine in East Africa\nFuture of the British Council\nGirls’ Rights\nGlobal Funding to fight AIDS, Tuberculosis and Malaria\nNational Security Bill\nPersecution of Christians\nRelief for Ukraine\nZambia Debt Relief\nVoter ID\nCost of Living and Social Security\nDisabled People and the Welfare System\nCost of Living for Young People on Benefits\nElectric Vehicle Charging\nE-Scooters (Scoot Aware)\nSmart Motorways\nVehicle Taxation",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_newham-will-receive-24-million-to-tackle-homelessness/content_15.html": "The Government has announced that London will receive £371 million as part of the homelessness prevention and rough sleeping prevention funding. This is £80 million more than last year under the Conservatives, a notable increase that will have a genuine impact on people facing homelessness.\nNewham has been allocated £24.4million of this money which is an £6.7 million increase in funding just for the borough. The number of people experiencing or facing homelessness is the highest it has ever been, and the rate is especially high in Newham. This is reflected in the higher amount of funding that Newham will receive, the largest of any council in the country. Currently, more than 123,000 households are living in temporary accommodation including nearly 160,000 children, the situation is untenable.\nJames Asser MP for West Ham and Beckton said\n“I’m happy that the Labour government has allocated £24.4million to Newham which is £6.7million more than last year.\nThis money is needed and will help those already experiencing homelessness or sleeping rough. It will also importantly help to prevent more people losing their homes and must form part of the wider commitment to tackle the housing crisis.\nIn October, I raised the issue of the temporary accommodation crisis in Newham with the Minister, calling for urgent financial support to address the immediate situation and find long-term solutions. This notable increase in funding is positive progress”.\nThis money is going where it is needed to help people in emergency and temporary accommodation, people facing eviction or the loss of their home and people forced to sleep rough.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_housing/content_9.html": "Newham Council has responsibility for the majority of housing issues including allocations, repairs and problems with landlords. If you are not satisfied with their response you may contact me, however please try to include Newham Council's response in your email.\nI cannot intervene with or change your position on a housing waiting list.\nI would encourage anyone in this position to continue to bid on available properties.\nI am able to contact housing providers and the council on your behalf but I cannot change given outcomes.\nIf you are living in a council property please contact your local councillor first.\nIf you are in a housing association property please contact your housing provider first.\nIf you are unsatisfied with the response from your landlord or housing provider please get in contact with my office where we can raise the issue on your behalf.\nThese organisations can help with a range of issues.\nNewham Council can provide support for housing issues, including homelessness, rent arrears, and tenancy support.\nPhone Number\nNewham Council can provide support for housing issues, including homelessness, rent arrears, and tenancy support.\nEmail address\nPartnership supporting rough sleepers across Newham and providing access to support services.\nNewham Council can provide support for housing issues, including homelessness, rent arrears, and tenancy support.\nPhone Number\nRough sleeping and homeless prevention and advice. This includes advice and support to keep your current home.\nEmail address\nPartnership supporting rough sleepers across Newham and providing access to support services.\nShelter is a national charity offering advice and support on housing issues such as eviction, homelessness, and rental disputes.\nPhone Number\nCrisis offers support for those facing homelessness, with services including housing advice, help finding a home, and emergency accommodation.\nPhone Number\nShelter is a national charity offering advice and support on housing issues such as eviction, homelessness, and rental disputes.\nPhone Number\nCrisis offers support for those facing homelessness, with services including housing advice, help finding a home, and emergency accommodation.\nPhone Number\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_about-me/content_2.html": "I am James Asser, I was elected in July 2024 as the Member of Parliament for the new constituency of West Ham and Beckton. I’ll continue to use my experience as a local resident, a campaigner and local councillor to be your champion in Parliament.\nI live here and spent six years as a local councillor, I am proud to continue to serve and represent everyone in West Ham and Beckton.\nI know how important it is that local people have someone to support them and to be their voice both locally and nationally. Since my election I have spoken in the House of Commons and Parliament on a range of issues across housing, education, poverty, and international policy. Issues that I know are important to my constituents. I have also used my position to support local campaigns such as the campaign to save the East London Gymnastics Centre and will continue to champion the causes at the heart of the community.\nStudent activist and campaigner, Vice-President Welfare of the National Union of Students.\nRole in Unionlearn (the TUC’s education and skills organisation).\nWorking with organisations and charities on a range of issues such as homelessness and LGBT+ Mental Health.\nCabinet Member for the Environment and Transport.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_education/content_5.html": "If your issue relates to an ongoing enquiry or complaint with an independent body, organisation or agency please note that I cannot intervene or help until all their complaints and appeals processes have been exhausted.\nI cannot intervene in local authority school placement decisions. However if you are not satisfied by the local authority response please contact my office and we may be able to enquire on your behalf.\nI cannot intervene to change the outcome of an EHC plan. Although if you believe that your child’s needs a not being met please contact my office. I may be able to liaise with the relevant authority to help your child gain access to the support they need.\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_survey_restore-the-5a-bus-route/content_12.html": "I am asking businesses in West Ham and Beckton to complete a short survey so that I can learn more about the issues that you are facing. I am particularly interested in the use of banking and cash services in West Ham and Beckton and whether the closure of high street banks has had an impact on your business.\nYou would also be welcome to email me ([email protected]), if there is a more complex issue that I may be able to help with or if you wish to provide more detail to your survey response.\nI’m lucky to have so many amazing small businesses in my constituency. However, I know that it is not always easy running a business especially after lockdowns and a cost-of-living crisis. This survey is my opportunity to learn more about your business and hopefully how I can help it.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_my-first-6-months-as-an-mp/content_6.html": "In January it was six months since my election as MP for West Ham and Beckton, which gave me an opportunity to reflect. I looked at everything that I have done so far with the support of my team such as the 11,500 emails we have responded to and the 3,500 cases that we have handled for constituents. Although seeing it in numbers helps to show the scale, each of those numbers represents a person or family in West Ham and Beckton and I have been lucky to meet many face-to-face.\nI have met young people from across East London and seeing their work, answering their questions, and listening to their ideas have been real highlights. I have met with primary pupils from several primary schools and answered their often-tricky questions! I also had the chance to judge a STEM in aviation event with nearly 400 secondary school pupils, who showed incredible innovation and creativity.\nI welcomed New City Primary and Ellen Wilkinson Primary back to Parliament for the International School Awards. Students from New City Primary stood in front of a packed room and presented on how they have learnt about other cultures through language. I was proud to introduce them as students from our community.\nIn my maiden speech in Parliament, I said that the people of West Ham and Beckton do not lack ambition, aspiration, or talent—they have it in inspirational quantities—but too often, they lack opportunity. In the last six months, I have been inspired by the young people in West Ham and Beckton’s talents and energy.\nI welcome improving opportunities for our young people. Changes such as ensuring that kids have breakfast so they can focus on learning and not hunger. Securing more funding and housing, so they don’t have to do their homework in cramped temporary accommodation.\nI have heard from young people about their dreams and plans, I have met aspiring engineers, actors, gymnasts, footballers, and leaders. I have also met with amazing teachers, parents, coaches, and members of our community who are providing such valuable support.\nA key focus of my time is on learning, education, and apprenticeships to ensure we’re creating the best opportunities for all our young people so they can fulfil their talents.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_about/content_3.html": "I am James Asser, I was elected in July 2024 as the Member of Parliament for the new constituency of West Ham and Beckton. I’ll continue to use my experience as a local resident, a campaigner and local councillor to be your champion in Parliament.\nI live here and spent six years as a local councillor, I am proud to continue to serve and represent everyone in West Ham and Beckton.\nI know how important it is that local people have someone to support them and to be their voice both locally and nationally. Since my election I have spoken in the House of Commons and Parliament on a range of issues across housing, education, poverty, and international policy. Issues that I know are important to my constituents. I have also used my position to support local campaigns such as the campaign to save the East London Gymnastics Centre and will continue to champion the causes at the heart of the community.\nStudent activist and campaigner, Vice-President Welfare of the National Union of Students.\nRole in Unionlearn (the TUC’s education and skills organisation).\nWorking with organisations and charities on a range of issues such as homelessness and LGBT+ Mental Health.\nCabinet Member for the Environment and Transport.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_benefits/content_4.html": "If your issue relates to an ongoing enquiry or complaint with an independent body, organisation or agency please note that I cannot intervene or help until all their complaints and appeals processes have been exhausted.\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_other-matters/content_19.html": "If your issue relates to an ongoing enquiry or complaint with an independent body, organisation or agency please note that I cannot intervene or help until all their complaints and appeals processes have been exhausted.\nThese organisations can help with a range of issues.\nAdvocate is a Charity that can help you find free legal assistance from volunteer barristers.\nLaw Works are a charity working in England and Wales to connect volunteer lawyers with people in need of legal advice who are not eligible for legal aid and who cannot afford to pay.\nA national organisation with a range of support and advice.\nPhone Number\nAdvocate is a Charity that can help you find free legal assistance from volunteer barristers.\nLaw Works are a charity working in England and Wales to connect volunteer lawyers with people in need of legal advice who are not eligible for legal aid and who cannot afford to pay.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_healthcare/content_16.html": "If your issue relates to an ongoing enquiry or complaint with an independent body, organisation or agency please note that I cannot intervene or help until all their complaints and appeals processes have been exhausted.\nThese organisations can help with a range of issues.\nNewham Talking Therapies offer free and confidential talking therapies and specialist support. It is possible to self refer.\nNewham Child and Adolescent Mental Health Service (CAMHS)\nNewham Talking Therapies offer free and confidential talking therapies and specialist support. It is possible to self refer.\nThe Mix can provide mental health support If you’re under 25.\nPhone Number\nOpening hours\nIf you’re under 35 and struggling with suicidal feelings, or concerned about a young person who might be struggling you can contact Papyrus.\nPhone Number\nOpening Hours\nEmail address\nThe Samaritans offer free, confidential, mental health support 24/7.\nNational Line\nThe Mix can provide mental health support If you’re under 25.\nPhone Number\nOpening Times\nIf you’re under 35 and struggling with suicidal feelings, or concerned about a young person who might be struggling you can contact Papyrus.\nPhone Number\nOpening Hours\nEmail address\nThe Samaritans offer free, confidential, mental health support 24/7.\nNational Line\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_newham-recorder-column/content_18.html": "In my second column I’m focusing on the heroes of West Ham and Beckton past, present, and future.\nThis month marked Remembrance Day with services and memorials across the country, in our local area, and Parliament. It was an honour to attend a service on Remembrance Sunday at Brick Lane Music Hall and lay a wreath at St Mark’s Memorial, Silvertown. Thank you again to councillors Rohit Dasgupta and John Gray who represented me and laid parliamentary wreaths at St. Luke’s Church in Canning Town and West Ham Church.\nI learnt of local men who served in the Photographic Reconnaissance Unit of the RAF during the Second World War: George Borrett, Ronald Kemp-Lewis, Alan McLaren, John Phypers, Arnold Rumsey, and Anthony Sams. These men bravely served in exceptional circumstances flying spitfires and mosquitos with limited protection. There is an ongoing campaign for a national memorial of their unit, and we would like to remember them locally. There is also a search for more information and possible descendants of these men.\nSince my last column I’ve joined Olympic champion Christine Ohoruogu in opening London’s first residential rooftop running track. The running track can be found on the rooftop of a new development in the Royal Docks, and further cements our legacy as an Olympic borough that Christine and others helped secure.\nWest Ham and Beckton has been a training site for other Olympic heroes and even one superhero! The East London Gymnastics Centre is a grassroots facility that has hosted elite gymnasts and Olympians like Nile Wilson and Max Whitlock and even Spider-Man Actor Tom Holland. However, the next generation of Olympians may not have the same opportunities, as the East London Gymnastics Centre is under threat of closure by the end of the year. The Gymnastics Centre is the only place in the borough of Newham that can provide the facilities for those training at an elite level.\nI have been overwhelmed with the level of support from the community to save the Gymnastics Centre and I’m determined to work with all those involved including local councillors and the Mayor of London. I have raised this issue in parliament and will continue to lobby ministers to support the campaign to #SaveTheELGC.\nI could not be prouder of the strength and resilience of our community here in West Ham & Beckton, and it is an honour, in my role as the local MP, to constantly see that community spirit in action, whether throughout our history, in the here and now, or looking to the years ahead.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_contact/content_17.html": "Please note that due to strict Parliamentary protocol, I am only able to make enquiries on behalf of my own constituents. To check if you live in my constituency, check your MP here\nAs your MP I can help with a variety of issues and concerns.\nKeeping the issue private,\nI can write to the relevant department, official, or Minister or make a personal appointment to discuss the issue. This can often go a long way to providing a solution to your issue.\nI can also help to make the issue public by raising it in the House of Commons, where it will be officially recorded, and could potentially come to the attention of the press and public.\nOutside Parliament, you can request that I speak at an event concerning your issue, pledge my support to a campaign or write to the local media on your behalf.\nI hold both virtual and physical advice surgeries every month. To make an appointment please send an email using the contact form below.\nEmail address\nAddress\nPhone Number\nI welcome the chance to visit local groups, organisations, businesses and schools in West Ham and Beckton.\nPlease consider inviting me to your meeting or event, but understand that it will not always be possible, due to my parliamentary and other commitments.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_james-asser-mp-backs-campaign-to-commemorate-local-heroes/content_14.html": "James Asser, MP for West Ham and Beckton, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War.\nThe PRU was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war. The purpose of the PRU was to provide up-to-date intelligence to strategically plan the Allied actions in the war. Flying Spitfires and Mosquitos, the intelligence it gathered was used by all the armed forces, giving same day intelligence on enemy activity.\nDue to the clandestine nature of their operations – they flew solo operations, unarmed and unarmoured – the death rate was nearly fifty percent. However, despite having one of the lowest survival rates of the war – life expectancy in the PRU was around two and a half months – there is no national memorial to the PRU.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London.\nThere were six among those who served, and died, in the PRU who were born in West Ham and Beckton:\nGeorge Borrett, Ronald Kemp-Lewis, Alan McLaren, John Phypers, Arnold Rumsey, and Anthony Sams.\nThe names and short biographies of these men have been included in the hope that more information and possibly descendants may be found. If there is anyone related to George Borrett, Ronald Kemp-Lewis, Alan McLaren, John Phypers, Arnold Rumsey, or Anthony Sams, or if anyone know someone who served in the PRU during the war, please go the Spitfire AA810 Project website (www.spitfireaa810.co.uk).\nGeorge Borrett\nFlying Officer George Leonard Borrett was born in West Ham on the 15th June 1920. He later moved to Redbridge, and by the outbreak of war he was a clerk in a shipping agents.\nHe joined up in 1939 but little is known of his wartime career other than he served with the wartime Photographic Reconnaissance Squadrons.\nHe survived the war and passed away in Epsom in August 2007.\nRonald Kemp-Lewis\nFlight Lieutenant Ronald Hugh Kemp-Lewis was born in West Ham but other than knowing that he served in the RAF Photographic Reconnaissance Squadrons, little is known of either his service or personal life.\nAlan McLaren\nFlight Sergeant Alan McLaren was born in West Ham, the son of Ernest and Lily McLaren.\nHe trained as a Spitfire pilot, serving with 683 Photographic Reconnaissance Squadron based in the Mediterranean.\nOn the 18th August 1944 he failed to return from a sortie to photograph Udine, Italy, 23-year-old Alan McLaren remains missing to this day.\nJohn Phypers\nAC1 John Phyphers of West Ham served with 541 Photographic Reconnaissance Squadron at RAF Benson in Oxfordshire.\nHe was sadly badly troubled by the ongoing stress of war, and he took his own life on the base on the 16th June 1943 aged 39.\nArnold Rumsey\nFlight Lieutenant Arnold Arthur Rumsey was born in West Ham but little is known of his personal life pre-war.\nHe joined the RAF and served in a Hudson crew in the Photographic Development Unit. On the 26th October 1940 his crew departed Heston on a photography mission over the Scheldt Estuary.\nApproaching the area, it was shot down by the pilot of a German fighter and crashed into the Scheldt off Vlissingen (Flushing).\nThe pilot of the aircraft drowned; however Rumsey and three other crewmen managed to escape the wreckage and were taken Prisoners of War.\nIt is assumed he survived the war, but little else is known about Rumsey.\nAnthony Sams\nWarrant Officer Anthony William Sams was born on the 25th June 1923 in West Ham.\nHe joined up in December 1941 but we know little of his wartime career other than he served with the wartime Photographic Reconnaissance Squadrons. He survived the war and passed away in Hornchurch in December 2001.\nSupporting the campaign for a national memorial, James Asser MP said:\n“I am happy to support the campaign to commemorate those who served in the Photographic Reconnaissance Units during the Second World War. This includes 6 local men: George Borrett, Ronald Kemp-Lewis, Alan McLaren, John Phypers, Arnold Rumsey, and Anthony Sams, who served admirably under exceptionally difficult conditions.\nI hope that descendants can be traced or more information found to ensure that these men are remembered for their work and sacrifice.\nI look forward to working with the Spitfire AA810 Project to establish this memorial to commemorate the PRU.”",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_cookie-policy/content_20.html": "Skip to content\nHome\nFind Help\nBenefits\nEducation\nHealthcare\nHousing\nImmigration and Visas\nOther Matters\nMy Work\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nYoutube\nInstagram\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_60-years-of-newham/content_8.html": "April 2025 marks 60 years since the creation of the London boroughs including Newham. In 1965 East Ham and West Ham merged to form Newham and absorbed North Woolwich from Woolwich and Gallions Reach from Barking.\nPresent day Newham naturally looks different over half a century later but as I walk around West Ham and Beckton there are constant references to our history. In our parks, buildings and roads named after the like of suffragette leader Minnie Baldock or campaigner Kamal Chunchie.\nKamal Chunchie who, in 1926, founded the Coloured Men’s Institute, also reminds us that the diversity in East London is a much older feature than many think. It has been a part of the history of our area much longer than ‘Newham’ itself.\nNow our diversity is apparent in the festivals and celebrations that have brought us together over the last couple of months. Across West Ham and Beckton we have marked Holi, Eid, Passover, Vaisakhi, Easter and many have celebrated the arrival of spring and the new year.\nAnniversaries always spark reflection, and 60 years of Newham was no different. As well as the changes that we have seen, I have been thinking of some of the challenges that have always faced our patch.\nOn average half of the personal casework that me and my team deal with is related to housing. This can vary from issues with social housing to private rent or service charge. Whilst we work on a case-by-case basis there is also a need for large scale change to help those in need now and address the root causes of our housing problems.\nThe Government has promised the largest increase in social and affordable housing in a generation with a commitment to build 1.5 million homes over the next 5 years. The Renters’ Rights Bill puts in protections from no-fault eviction, unfair advance rent payments and mould and damp. Homeowners will also receive more rights, power and protections over their homes thanks to leasehold and freehold reforms. Although I cannot guarantee a positive outcome, my team and I will always try our best to advocate for you.\nNewham and West Ham and East Ham before it have a rich history and we are all players in that. As long as I have the privilege of being your MP, I will do all I can and work with all of you across communities to continue and support that legacy of change and progress.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_privacy-policy/content_22.html": "Skip to content\nHome\nFind Help\nBenefits\nEducation\nHealthcare\nHousing\nImmigration and Visas\nOther Matters\nMy Work\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nYoutube\nInstagram\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_news/content_13.html": "As part of the Children’s Wellbeing and Schools Bill, the Government recently announced the rollout of its ‘breakfast clubs early adopter scheme’. Under the scheme,...\n09 April 2025\nwww.bartshealth.nhs.uk\nOfficial opening of a state-of-the-art intensive care unit and respiratory ward at Newham Hospital. Among those who came to celebrate included local MPs Uma Kumaran...",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk/content_1.html": "I am James Asser, I was elected in July 2024 as the Member of Parliament for the new constituency of West Ham and Beckton. I’ll continue to use my experience as a local resident, a campaigner and local councillor to be your champion in Parliament.\nI welcome opportunities to meet with local groups, organisations and businesses throughout West Ham and Beckton.\nPlease consider inviting me to your meeting or event, but understand that it will not always be possible, due to my parliamentary and other commitments.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_terms-of-use/content_21.html": "Skip to content\nHome\nFind Help\nBenefits\nEducation\nHealthcare\nHousing\nImmigration and Visas\nOther Matters\nMy Work\nNews\nAbout\nContact\nStay updated on social media\nFacebook-f\nX-twitter\nYoutube\nInstagram\nSkip to content\nOpen toolbar\nAccessibility Tools\nAccessibility Tools\nIncrease Text\nIncrease Text\nDecrease Text\nDecrease Text\nGrayscale\nGrayscale\nHigh Contrast\nHigh Contrast\nNegative Contrast\nNegative Contrast\nLight Background\nLight Background\nLinks Underline\nLinks Underline\nReadable Font\nReadable Font\nReset\nReset",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_free-breakfast-clubs-in-west-ham-beckton/content_7.html": "As part of the Children’s Wellbeing and Schools Bill, the Government recently announced the rollout of its ‘breakfast clubs early adopter scheme’. Under the scheme, up to 750 participating state-funded schools will be supported to provide breakfast clubs that offer free food and childcare.\nWest Ham and Beckton has three schools adopting of the Government’s free breakfast club scheme from April 2025:\n- Hallsville Primary School\n- Scott Wilkie Primary School\n- Portway Primary School\nI’m glad that so many students and parents can begin to benefit from the scheme right from the beginning as early adopters.\nI recently attended a Children’s Wellbeing event in Parliament to show my support for this initiative, and I am proud to advocate for free breakfast clubs in every primary school in England. We have seen in Newham the positive impact of free school meals on children’s ability to learn, and providing breakfast to all primary pupils will help them start their day focused and ready to learn\nProviding a free breakfast to all primary school pupils is another manifesto commitment which we are en route to fulfil.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_immigration-and-visas/content_10.html": "If your issue relates to an ongoing enquiry or complaint with an independent body, organisation or agency please note that I cannot intervene or help until all their complaints and appeals processes have been exhausted.\nYou are able to refer a case on behalf of a friend or relative. In order to assist them you must have provided written consent from them authorising you to act on their behalf.\nYou must include any case references from the home office.\nIf you are contacting me on behalf of a friend or relative you must include their written consent.\nPlease include your full address and postcode.\nMy office will try to assist you to expedite the consideration of your case. However please note that Home Office outcomes are out of our control.\nMy team are available to review your situation and see what I can do to assist your matter.",
  "https_www_jamesasser_co_uk_/https_www_jamesasser_co_uk_my-work/content_11.html": "Result: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Failed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed\nResult: Motion Passed"
}