{
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_12_18_who-should-be-the-next-labour-leader/content_32.html": "When I reflect on who should be the next leader of the Labour Party, my initial thoughts are, it should be a female leader. Someone from the North of England with lenience to remain and can take the party towards the centre-left.\nAm I wrong wanting a woman leader? It would be great if Labour had a women leader. Labour is dragging behind the world in this regard, and you don’t need to look far, Germany’s Chancellor Angela Merkel has stood the test of time.\nTo say the answer to all of Labour’s problems is to have a women leader might sound a bit patronising. And then to have someone from the North with a specific identity will solve the problems. But, hold on a minute, didn’t millions of voters across the UK vote for a white male, Eaton educated Boris Johnson to be our prime minister?\nThere have been two Tory female leaders, and I expect Harriet Harman MP, who was one of the outstanding MP’s of her time never took the plunge, is this something she will regret. I feel it was a blight on the Labour Party. However, the Last time we had the opportunity to choose a women leader, in Liz Kendal and Yvette Cooper, both did not do well, who I thought would have been ideal.\nKier Starmer MP has been suggested who I respect, I saw him handle the likes of Michael Gove MP in a panel discussion some years ago.\nThere are talented leaders in the Labour Party, let us listen to what they have to say before making our decision. Let’s see who puts themselves forward and has the best convincing argument before making a decision. So far Lisa Nancy, Rebecca Long-Bailey, Emily Thornberry, Angela Rayner, Yvette Cooper are among potential candidates, all great mouth-watering candidates.\nEach one will need to properly analyse and set up their stalls on what went wrong and what are their solutions to get it right.\nIt will be a shame if they are seen through a prism of just being women rather than their expertise and talents.\nMy final thought is, before deciding who should be the next leader, we should see what position we end up and then match the leader accordingly. Where will we end up? The far left, which is unlikely, centre-left, become more Social Democratic, my choice or Blair right. Anyway, I hope and pray we make the right decision as I fear for the future health of the country under the Conservative Party.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_07_18_synergy-sponsored-iam-cycling-competes-in-2016-tour-de-france/content_16.html": "The world’s most famous cycling race is in the middle of its final week, and Synergy Sponsored cycling group IAM Cycling is in the thick of competition.\nCompeting in the oldest and most prestigious cycling competition in the world, IAM Cycling is putting a world class effort into each grueling stage. Most recently, IAM Cycling’s Jarlinson Pantano won 1st place in Stage 15, while Jérôme Coppel took 4th place in Stage 13, and Stef Clement took 4th place in Stage 12. These Synergy sponsored riders are definitely making a name for themselves in the competition! Click here to stay updated on each stage and check the current ranking of all the competitors and teams.\nThis is IAM Cycling’s third time competing in the Tour de France. Over the course of three weeks, athletes endure a constant battle of mental and physical fatigue, changing weather and elements, drastic changes in elevation, as well as the logistical issues of crowding spectators and coordinating caravans and team cars.\nEach stage of the race comes with its own set of challenges. In stage 9, IAM Cycling’s Leigh Howard found himself in a position that no one wants to be in—nearly left behind. After stopping to replace both wheels and eventually changing bikes, Howard was in danger of being left in no man’s land and was forced to chase down the group on the descent. To do this, Howard pushed himself to the limit and topped out his speedometer at 122.7 kilometers per hour (75 miles per hour).\nThe Tour de France is a world class example of peak athletic competition. We are honored to know that IAM Cycling athletes are relying on Synergy products to push them through their difficult journey and hope everyone shows them their support as they push through to the last race day on July 24",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_privacy-policy_page_3/content_11.html": "LGBT LABOUR – The viewpoints of ALL in my community deserve to be heard and represented.\nI was able to attend a LGBTLabour meeting during the Labour Conference 2016 and learnt first hand of the difficulties facing the community. The Labour LGBT Manifesto 2015, A Better…",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2015_11_15_hounslow-ahmadi-muslims-shocked-by-the-atrocity-in-paris/content_39.html": "The Ahmadiyya Muslim Community in the Hounslow Borough expresses its utter abhorrence of the carnage that was carried out in Paris last night.\nThe World Head of the Ahmadiyya Muslim Community, the Fifth Caliph, His Holiness, Hazrat Mirza Masroor Ahmad, speaking from London said:\n“On behalf of the Ahmadiyya Muslim Community worldwide, I express my heartfelt sympathies and condolences to the French nation, its people and government following the heinous terrorist attacks that have taken place in Paris. This brutal and inhumane attack can only be condemned in the strongest possible terms.\n“I would also like to reiterate that all forms of terrorism and extremism are completely against the true teachings of Islam. The Holy Quran has said that to kill even one innocent person is akin to killing all of mankind. Thus under no circumstances can murder ever be justified and those who seek to justify their hateful acts in the name of Islam are serving only to defame it in the worst possible way.\n“Our sympathies and prayers are with the victims of these attacks and all those who have been left bereaved or affected in any way. May God Almighty grant patience to them all and I hope and pray that perpetrators of this evil act are swiftly brought to justice.”\nCllr Hanif Khan of Hanworth Park who is a member of the Ahmadiyya Muslim Community said:\n“We condemn the actions of extremists wherever they may be, whatever their cause.\n“We are with the people of France in sharing their pain. This was an outrageous attack on the peaceful innocent members of the public and they are in our thoughts and prayers.\n“We consider this to be not just an attack on France but on the entire humanity and we express our condolences to the families of the bereaved and pray for the fast recovery of all those injured.\n“We ask the world to unite against this menace and to work to eliminate all forms of extremism.\nBoth the local President of Hounslow South and North, Mr Zaheer Khan and Mr Zia Qureshi of the Ahmadi Muslim Community say:\n“We believe in love for all and hatred for none, and peaceful dialogue is the only way to cultivate understanding and harmony between people.\n“Our thoughts and prayers are with the families of those murdered in Paris. May God provide solace and strength to the bereaved and to their loved ones. Ameen.”",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2015_06_22_collective-action-needed-to-tackle-extremism/content_36.html": "The Ahmadiyya Muslim Community in Hounslow North, supports the Government’s action to root out extremism. Mr Zia Qureshi President of the Ahmadiyya Muslim Community in the Hounslow North said:\n“Any genuine attempt to curb extremism is to be welcomed. No true Muslim could contemplate acting against the laws of the land and so if he or she does, then strict law enforcement in such cases is necessary.\nCllr Hanif Khan, a member of the Ahmadiyya community said: “However, we do not agree that the term ‘Islamic extremism’ should be used in this context and is in fact misused by the media and by politicians. The Ahmadiyya Muslim Community considers terms that seek to link Islam with extremism or terrorism to be entirely wrong. This falsely associates the peaceful religion with evil acts of extremists and is entirely unhelpful and counterproductive.\n“Radicalisation by ISIL or anyone else needs a collective response. Families have a role to play in ensuring that their youth remain active citizens, faith leaders have a role to guide people to peace and social harmony and governments and media need to ensure that moderate voices are given a platform to present the true peaceful message of Islam. Governments must also promote and uphold justice in international affairs.”\nMr Zaheer Khan President of the Ahmadiyya Muslim Community in the Hounslow South said: The Ahmadiyya Muslim Community has been actively engaged in spreading the peaceful message of Islam for more than 125 years. Its Khalifa (Caliph), His Holiness Hazrat Mirza Masroor Ahmad) who is the London-based worldwide spiritual leader of the Ahmadiyya Muslim community, has repeatedly condemned all forms of extremism. Ahmadi Muslims, whose work the Prime Minister has described as ‘true faith in action’ have always been engaged from a young age to promote Islam’s values of loyalty, equality, freedom, respect and peace. Just last week, more than 5,000 Ahmadi Muslim youths, including youth from Hounslow attended their national convention in Surrey to strengthen their faith in God, build brotherhood, learn about service to mankind and the principle of loyalty to one’s country of residence.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2020_01_19_what-is-causing-the-fires-in-australia-and-beyond/content_8.html": "There has been no let-up for Australia, the weather is capricious, unpredictable and extreme. With heavy rain in eastern and southern parts of Australia, and hailstones the size of golf balls dropping in parts of the state of Victoria, many of the bushfires have been dampened. But flooding could still happen. The authorities say some of the areas most stricken by the fires have not received as much rain as they would have liked but, for the first time for a long time, less than a hundred bushfires remain in South Eastern Australia.\nWhat are the causes of bushfires in Australia?\nThe fires happen each year. During the Australian summer (which is happening right now, during our winter here) the weather gets very hot and dry – which makes it easy for blazes and fires to begin and spread rapidly.\nMostly natural causes, such as lightning strikes in drought-stricken forests, cause the fires. According to the state agency Victoria Emergency, lightning-caused many fires in the East Gippsland region in Victoria in December.\nBut humans can also be blamed in this case. According to a police statement in New South Wales, the police have charged 24 people for deliberately starting fires.\nCurrently, there are thousands of helpers involved in fighting the fires and not only firefighters but also army, navy and air force reservists and emergency personnel. There are also more than 240 firefighters from the US, Canada and New Zealand who have travelled to Australia to help tackle the fires.\nAll because of Climate Change?\nScientists and other experts believe that Climate Change also plays a role in the Australian Bushfires this season. Climate Change refers to a long-term change in the average temperatures and weather patterns.\nThere are other major factors that cause the Australian bushfires, such as the positive phase of the Indian Ocean dipole.\nClimate scientist Wenju Cai, said that this positive phase occurs when the Indian Ocean is cooler, and the west is warmer than usual – the rain moves towards the western part of the Ocean. This means that in East Africa there are heavy rains and flooding which affect thousands of people. On the other side, there are drought and wildfires in Australia and Indonesia.\nThe current bushfires in Australia are this extreme because of record high temperatures, drought, deficient soil moisture in the air and also because of human negligence.\nIn future, towards the end of the century, climate experts say, bushfires with such a severe and dramatic impact could become more common, which goes to show how climate change is already and will be affecting our life on planet earth.\nWhat can we personally do and change to prevent Climate Change?\nMany people think, “What could I possibly do, one person would not change much anyway”, but if everyone changed their behaviour and kept the environment clean, many things could be achieved. For example, I am planting trees. It is a great way to help and enhance nature and put emphasis on reducing waste and recycling.\nTo Donate & Help Support Today – Australia Bushfire Emergency https://support.wwf.org.uk/australia-bushfires",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_privacy-policy_page_2/content_23.html": "Making friends is easy, and their influences are hard to ignore, and this influence can be both contentment and irreversibly damaging. The reality is, we choose our friends and so…\nCan you see this situation improving, current signs are that it is escalating and will get worse this year. Alarming, one in every 200 person's were homeless at Christmas in…\nSounds good the £5000 for nurses, I welcome it. It's about time something, even if it's a token gesture to encourage the loss of skilled workers joining the profession. In…\nWhen I reflect on who should be the next leader of the Labour Party, my initial thoughts are, it should be a female leader. Someone from the North of England…\nWhen I saw the exit polls, like so many labour activists, devastation struck. I was saddened and surprised, and many thoughts went through my head. What will happen to the…\nI would like to congratulate Donald Trump on his victory and pray that he can unite all the American people together, bring prosperity to them and fight against extremism and…\nScientists at the Hughes Centre for Research and Innovation have made several remarkable discoveries on Synergy’s ProArgi-9+ formula, showing that ProArgi-9+ can do what l-arginine cannot do on its own. Following these…\nThis year on National Day, Nigeria celebrates 56 years of independence celebrated on 1st October. Most Nigerians celebrate Independence Day over four to five days as they engage in several cultural…",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_endorsements/content_3.html": "We're Backing Hanif Hi there, I would humbly like to share some endorsement from, Unions, MPs, Cllrs colleagues and residents that support me. Share this:FacebookX",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2020_02_24_hs2-106-billion-should-you-pay-for-it/content_9.html": "In the UK we have not built a new railway line for more than 120 years north of London and building a High Speed railway at this point, is actually playing catch up. When I look across the pond, High-Speed Railway is everywhere and can be seen in most countries, just look at China, Japan, France and Spain.\nHS2 is dividing opinion\nThis January 2020, the announcement of the new High-Speed Railway generated both excitement and anxiety. It is dividing opinion, especially amongst those people where the railway line smashes through the backyards of properties, carving up the landscapes and destroying the beautiful scenery they hold dear. And lets not forget it is 3 times over budget, at a cost of 106 billion of taxpayer’s money, that may or may not bring prosperity to the majority residents of the UK, like you and me.\nCutting a few minutes off the journey time from London to Birmingham, London to Crewe, London to Manchester – which is what critics say. It was never what this project was all about…it was more about speed, improved transport times, capacity, creating jobs and rebalancing the UK’s economy.\nBefore we weigh up the feasibility and the potential pros and cons, let’s understand what the HS2 project really is.\nWhat is HS2?\nIt is a high-speed railway line that will better link Britain’s biggest cities, London to Birmingham, Manchester and Leeds. It aims to create more jobs, increase connectivity between industries across the country. It also aims to cut journey times considerably from London to Birmingham and from London to Crewe by thirty five minutes.\nTrains will be built, 400m long carrying up to 1100 seats travelling up to 250mph with 14 trains per hour. This speed is insane, boasting a speed faster than the railway lines built on the rest of the continent.\nSource: https://www.hs2.org.uk/what-is-hs2/\nProposed build Schedule and Journey Times:\nThe first stage will be expected to be completed by 2026. The next part of the lines to Manchester, Sheffield, and Leeds, could start being built in the next decade.\nPhase 1: London to West Midlands, 2020 – 2026. Costing 40.5bn – £42.75bn. 1hr 20mins to 49mins\nPhase 2a: West Midlands’ to Crewe. Costing 4bn – 4.5bn. London to Manchester 2hrs and 7mins to 1hr and 7min\nPhase 2b: Crewe to Manchester and West Midlands to Leeds (Costing 36bn – 40.5bn). Birmingham to Leeds 2hrs to 1hr\nSource: Guardian graphic. Source: Department for Transport. Note: figures in 2019 prices, government/HS2 estimates September 2019\nExpress Online: https://www.express.co.uk/news/uk/1240725/hs2-cost-how-much-has-hs2-cost-hs2-rail-project-cost-breakdown\nSUPPORT FOR PROJECT\nCommenting on the announcement, Boris Johnson said: “I cannot say that HS2 Ltd has distinguished itself in the handling of local communities. The cost forecasts have exploded, but poor management to date has not detracted from the fundamental value of the project.”\nSource: https://www.standard.co.uk/news/uk/hs2-high-speed-train-confirmed-boris-johnson-a4358831.html\nShadow Transport Secretary, Andy McDonald, who is MP for Middlesbrough, said in support for HS2: “We’ve got to make a commitment to HS2, it’s an advanced rail network that the country needs for connectivity, to tackle capacity and deal with the critical issue of the climate crises”.\nSource: https://labour.org.uk/press/local-transport-spending-announcement-andy-mcdonald-responds/\nMick Whelan, general secretary of ASLEF, the train drivers’ union, has welcomed the government’s announcement last month, that HS2 has got the green light.\nOtherwise he explained, to have stopped HS2 would have sent out the wrong message to the countries we want to do trade with in the future. This doesn’t make sense\nSource: https://www.aslef.org.uk/article.php?group_id=6957\nOPPOSITION OF PROJECT\nSo what are the issues? why are they spiraling out of control? It seems construction companies take advantage of the TAX payers money. We have learned, some of it is due to the engineering costs, poor ground conditions, and underestimating the costs of training, wanting speeds of around 225mph and most important environmental concerns.\nResidents have criticised the scheme, especially where it runs close to their (no need to repeat residents) homes. They believe it will lead to an increase in carbon emissions and cause damage to natural ecosystems. Questions are being asked such as: how is it that Chinese companies can build it in less time, and cheaper? However, outsourcing this to China, will lead to other problems such as the lack of developing our own skills force and fewer employment opportunities. Despite the clear notable benefits, investing and retaining in our own skill force is paramount to our growth as a country.\nThis parent articulates how the HS2 will be funded by people unable to actually benefit from the service. “My son who is a UK taxpayer is paying towards the building of hs2 and yet when it is completed there will be no way he will be able to afford to travel on it. The fact is this is a form of SLAVERY where people work hard and pay part of their salaries towards something only comparatively few, well-off people will use. This is yet another way of crapping on people and rubbing their noses in it. A major problem in the UK, this; taking from the poor to give to the rich”.\nSOURCE: https://www.youtube.com/watch?v=lgrwEdvkd2k\nALTERNATIVE OPTIONS\nAlthough there is a clear divide in opinions, is there enough of an alternative solution? Considering this, the question you must ask is, what would you do with the money instead of HS2? I have a few suggestions: Investment in improving other train lines, lengthening carriages, new trains, better bus services, and cycle lanes, fixing potholes and building cohesion between communities. Therefore, communities up and down the country can be better served by creating safer, peaceful and healthy neighbourhoods. I know it sounds less attractive but it will do more for more people.\nCONCLUSION\nAt the end of the day, I believe, we need a national rail service fit for purpose which means it would need to be a High-Speed train service that spans across the breadth and width of our country. This will improve the network to our communities. Both Cycle lanes and bus routes, safer and healthier neighbourhoods. If we get this right HS2 will have a bigger impact on the wider public and economy. Improve the job market, training and public health.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2023_03_21_spring-budget-wow-not-in-recession/content_7.html": "Chancellor Jeremy Hunt’s spring budget brought with it the supposed good news was that we will not go into recession. Ideally, an announcement from the Chancellor highlights a growing economy; as citizens of the UK, we are all well aware that this is not the case and has not been for many years.\nFamilies are still struggling with the most significant fall in living standards in modern times. This simple fact has not been accommodated in this budget. The rise in corporation tax has upset the business community and done nothing for smaller high-street businesses, who are in essence the fabric of the communities in which they operate. Our care system is in the midst of a crisis, at a breaking point really: instead of prioritising those who need this care and their loved ones, social care has become yet another tool in the pursuit of profit.\nThe decision by this conservative government to give a tax cut to the rich, further helping the 1% of the top earners, while lifting the ‘lifetime cap’ on pensions giving rich people an additional £75,000 a year during a time when a fifth of the country is now considered under the poverty line is so very questionable; these changes will cost all taxpayers a billion pounds a year, but only a tiny group of people with a lot of money will reap the benefits. Why could the Chancellor not have been more empathetic?\nWe understand the need for doctors to return to work, but those negotiations should have been a separate scheme; initiating a TAX BREAK for the 1% is the wrong priority for the wrong people at the wrong time.\nThe magical ‘rabbit in the hat’ was to increase childcare assistance, a scheme which was originally suggested by the Labour Party. The scheme announced the increase of free childcare to 30 hours per week for children over nine months until the age of five, alongside boosts to subsidised childcare for parents on Universal Credit, including upfront support. However, this won’t kick in for another two years and help is required now; the only good thing to come out of this is that both Labour and Conservatives will make it an election promise, leaving us with an extraordinary policy.\nIf the Labour Party did not force the Conservative government to introduce a Windfall Tax, they would have let them keep their money. Even the Shell Boss said we should have a Windfall Tax. We live in difficult times, and we should go far as required to help the vulnerable in our society.\nIn regards to the NHS, one of the most used public services in this country, the Chancellor should have taken into consideration some other Labour ideas, such as:\n- Training a new generation of doctors & nurses so that we can treat patients on time again!\n- Doubling the number of district nurses qualifying yearly and train more than 5,000 new health visitors\n- Doubling the number of medical school places, in order to provide us with the doctors we need for the NHS\nOh well, there is next year’s budget; whether the NHS can cope in the terrible state, it is in until then is another debate in itself.\nWe are being asked to pay more for less as the economy is not growing fast enough. If we had more economic growth, the Chancellor would have more room to raise spending and cut taxes; for now, I am patiently waiting for the experts to come in and discover all of the HIDDEN tax rises and unravel this absurd budget which is catering to so few of among us.\nIt is time for a new government, a government that will tackle inequality and create a fairer taxation system that benefits the whole country, not leaving people to sink or swim. It is time for an active government, one who is on the side of the people.\nThe Conservatives are out of ideas and time, and we need a Labour government now. Sir Keir Starmer’s response to the Chancellor’s budget.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_09_30_lgbt-labour-the-viewpoints-of-all-in-my-community-deserve-to-be-heard-and-represented/content_17.html": "I was able to attend a LGBTLabour meeting during the Labour Conference 2016 and learnt first hand of the difficulties facing the community.\nThe Labour LGBT Manifesto 2015, A Better\nFuture for Britain’s LGBT Community, sets out the Labour party’s\ncommittment to take action to achieve LGBT equality. Labour’s LGBT\nmanifesto will pledge five promises to the LGBT community to drive\nforward progress:\n1. Tackle the discrimination that holds LGBT people back: Labour will strengthen the law on LGBT hate crime, undertake a review of gender identity law and policy; restroe the Equality Act and implement ‘Turing’s Law’ offering posthumous pardons to gay men convicted for homosexuality.\n2. An education free from homophobia, biphobia and transphobia: With Labour, teachers will be equipped to tackle LGBT-phobic bullying, and we will introduce age-appropriate compulsory sex and relationship education in all State-supported schools so that young people learn to respect each other’s relationships\n3. Leadership on LGBT rights around the world: Labour will appoint the UK’s first International envoy on LGBT rights to promote respect on LGBT rights globally, and review the procedures for asylum seekers fleeing persecution for their sexuality or gender identity, to ensure the rules are upheld fairly and humanely. We will ensure that development cooperation and aid supports LGBT communities.\n4. Accessible and supportive health services: With Labour, people will have an equal right to mental health treatment including talking therapies; we will work with the trans community to improve access to gender care services and improve action to tackle HIV & AIDS.\n5. Fairer and more diverse representation in public life: Labour will work to improve LGBT representation in Parliament and challenge narrow representations of LGBT people across public life.\nDownload a copy of A Better Future for Britain’s LGBT Community, Labour’s LGBT manifesto (PDF). If you require the manifesto in an alternative format please contact us.\nSpeaking on the launch of the manifesto:\nAngela Eagle, Labour’s Shadow Leader of the House of Commons and LGBT Labour Patron, said:\n“I’m proud that over the twenty three years I’ve been in parliament Labour has helped to deliver legal equality for LGBT people, but now we face a fight to make that equality a reality for every single LGBT person in our country. Too many LGBT young people are growing up scared and alone because they are bullied at school and don’t have sufficient support when their mental health suffers. In government Labour will finish the job we started and ensure every LGBT person has the chance to achieve their ambitions free from prejudice and discrimination.”\nGloria de Piero, Labour’s Shadow Equalities Minister, said:\n“As a country we have made huge strides towards equality in law and in life for LGBT people, and it is a source of huge pride that so many of these were delivered by Labour in Government. But when so many LGBT young people still suffer discrimination and bullying we cannot be complacent.\n“Labour will continue to drive forward progress with a plan to tackle homophobic bullying, strengthen the law on hate crime, improve access to mental health services for all and provide international leadership on LGBT rights.”\nSir Ian McKellen said:\n“I am impressed by the aims and commitments of Labour’s manifesto for LGBT people, particularly the appointment of Michael Cashman as an international LGBT Rights Envoy. Such initiatives cost little, yet help make the world a better safer place for us all.”",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2023_06_30_sewage-dumping-in-loddon-river/content_5.html": "The River Loddon faces significant pollution, which runs through a large part of Wokingham Borough and joins the Thames at Wargrave. Impacting its water quality and ecosystem. Various sources contribute to the pollution, including industrial discharges, agricultural runoff, and inadequate sewage treatment.\nToxic chemicals have been found in the river, posing a threat to aquatic life and potentially affecting the health of those who come into contact with the contaminated water. These chemicals can disrupt the ecosystem’s natural balance, harming fish, plants, and other organisms that rely on the river for survival. It is a vital waterway in the region.\nReports from local news outlets, such as the Reading Chronicle, and Basingstoke Gazette have highlighted the extent of the pollution and the need for urgent action. These reports have drawn attention to the presence of toxic chemicals and the detrimental effects on wildlife in and around the River Loddon. Efforts are being made to address the issue, including pressure from environmental organisations and political parties.\nIn May 2023, The Guardian News Paper reported that water companies announced an investment of 10 billion pounds. Still, the water companies had to apologise when it became clear that the TAX payers, their customers, would have to pay it back, bearing in mind this investment was long overdue.\nThe Labour Party, under the leadership of Keir Starmer and Jim McMahon, Shadow Secretary of State for Environment, Food and Rural and Affairs, has pledged to address this critical issue and implement legislation to safeguard the rivers and protect the local environment by combatting water pollution and safeguarding rivers like the River Loddon to prevent further damage.\nThe Labour Party aims to address the issue through the following initiatives:\n- Deliver mandatory monitoring of all sewage outlets\n- Give the Environment Agency the power to properly enforce the rules\n- Introduce a legally binding target to end 90% of sewage discharges by 2030\n- Introduce automatic fines for discharges, and a standing charge penalty for discharge points without monitoring in place\n- Ensure any failure to improve is paid for by eroding dividends, not added to customer bills, or hitting vital investment in the system\n- Water bosses that routinely and systematically break the rules will be held professionally and personally accountable, by striking off company directors and ensuring illegal activity is punished.\nThe Labour Party, recognising the situation’s urgency, has prioritised protecting the environment and combating water pollution. The party aims to address the sewage and chemical pollution plaguing the River Loddon in Reading and Wokingham by implementing stringent regulations, investing in infrastructure, and fostering collaboration. Through these measures, the Labour Party seeks to preserve the local environment and the well-being of communities relying on the river’s resources.\nThe residents of Reading and Wokingham can get involved to forge a cleaner, healthier environment by filling in the survey created by the MP of Reading East, Matt Rodda.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2020_02_05_malaysia-will-not-be-the-rubbish-dump-of-the-world/content_24.html": "Malaysia has recently sent back 150 containers of plastic waste to more than a dozen countries since the end of last year. Including 42 back to the UK. Malaysia saw an increase since China stopped the import of plastic waste from other countries in 2018.\nWhen I recycle my waste at home and separate it into plastic, tin, cardboard, and bottles, etc., I never thought, once collected from my home, it would be on its way to Malaysia. I am astonished that in the UK we don’t have a robust system of our own preventing the export of our refuse/plastic from being sent abroad. It does seem this job is largely left to the local authorities. It is unlikely the UK will achieve its European target of 50%. By the next two years.\nThe recycling and plastic being sent from Western Nations to the far east have been on the increase. There seems to be a lack of good solutions for these countries to manage their wastes.\nMalaysia has cracked down on 200 illegal recycling compounds and has sent back over 150 containers amounting to 3737 metric tones of plastic waste from all over the world. Predominantly from wealthy western nations.\n- 43 sent back to France,\n- 42 sent back to the UK\n- 17 sent back to the USA\n- 10 sent back to Spain\n- 11 sent back to Canada\nAnd there are nine more waiting to be sent back to the UK.\nAfter China announced in 2017 that it was going to stop accepting plastic from other countries and then following through in 2018, Malaysia was one of those countries that took the brunt of the plastic waste.\nThe UK will have to figure out it wants to do with its waste, as clearly Malaysia will not accept any more plastic from anywhere in the world.\nThe Environment Person, Malaysia’s Environment Minister Yeo Bee Yin. said We would not be the rubbish dump of the world.\nIn 2017, It was understood that the Department of Energy would launch a public awareness campaign in the coming weeks to encourage waste segregation, I wonder what happened to that?",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_10_10_who-won-the-second-presidential-tv-debate-donald-trump-or-hillary-clinton/content_42.html": "Last night my wife and I waited up to watch the debate with great interest as both of us missed the first one as we were in Liverpool at the Labour Party Conference.\nDonald Trump was on the back foot going into this debate with his lwed comments about women which he justified by calling it locker room banter. I was looking for a good performance and detail on Trumps policies on the burning questions on health care, education, energy, foreign policy and jobs et cetra. The republicans needed this performance to stop his campaign going into free fall after the recent polling results showing a downturn. In my opinion, it was not a complete disaster, but I did feel a lot of what he said was reactionary to Mrs Clinton rather than his own original policy. Mrs Clinton was able to talk from experience and spoke first on answering most of the questions.\nIt was evidence, that Mr Trump’s answers on policy were weak, and sometimes rambling. I was surprised that he broke ranks with his running mate, Mike Pence and said he had not spoken to him. His biggest flaw however was in body language. Whilst Mrs Clinton thought through every expression and move, he looked lost and spent a lot of time lurking and at times looking over her shoulder.\nMrs Clinton’s response – “that’s a lie; check my website” – was a good way of avoiding the facts debate and talking more about policy.\nI could not work out if either Clinton or Trump connected well with the town hall audience. Due to the lack of time, the audience were discouraged to applaud and make comments, It seemed they were more on lookers than participants.\nMr Trump, stalking around the stage like a grouchy bear, picking fights with the moderators and hurling abuse at the Clintons did him no favours. As for Mrs Clinton, she was calm to the point of being smug – a trait she showed in some of the primary debates. Smiling beatifically at the camera can eventually grate.\nThe biggest threat to her winning the election is her own complacency, she went to the debate to not lose rather than win convincingly. Many republicans were asking themselves, can they take a risk with Trump or let the Democratic win a third term.\nYou can probably work out who’s side I am on, I hope the American people can take the higher ground and elect Mrs Hilary Clinton into office a more suitable candidate. it is a difficult and stressful for both families of Clinton and Trump, as it is a personal drama that is unfolding around the world.\nThere two clear choices for the American people, not just two human beings, but between two futures that will make America great both home and abroad.\nCNN/ORC POLL: 57% SAY CLINTON WON\nYOUGOV POLL: 42% SAY TRUMP WON",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_07_09_i-was-on-camera-when-sadiq-khan-spoke-for-peace-at-trafalgar-square-at-eid-festival/content_18.html": "At the Eid Festival, Mayor Khan addressed an audience of thousands at London’s 11th annual Eid al-Fitr celebration in Trafalgar Square after taking office. He called for peace, unity and an embrace of religious freedom and diversity, describing this as one of London’s great strengths.\nHe pledged zero tolerance of hate crimes, reports of which have risen in the wake of the EU leave vote, and he denounced “criminals who do bad things and use the name of Islam to justify what they do”.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_09_09_the-future-of-labour-party-together-we-will-win/content_27.html": "I wanted to also share with you the statements issued by Jeremy Corbyn and Owen Smith this week.\nJEREMY CORBYN’S STATEMENT?\n“I am honoured to have won the votes of a majority of members, of affiliated supporters and of registered supporters, who have given me the second mandate in a year to lead our party.\nAlways remember, in our party, we have much more in common than that which divides us. As far as I’m concerned the slate is wiped clean from today.\nNow is the time for all of us to focus every ounce of our energy on exposing and defeating the Tories and the damage they are doing to our country. Theresa May’s Government isn’t a new government, it’s David Cameron’s Government with a new hard right edge.\nTogether, arguing for the real change this country needs, I have no doubt that this party can win the next election whenever Theresa May decides to call it and form the next government.”\nOWEN SMITH’S STATEMENT\n“I want to congratulate Jeremy Corbyn on his clear win in this leadership contest. There is no doubt that the Labour Party has changed under his leadership, he has mobilised huge numbers of people over the last 12 months …. and he deserves the credit for that, and for winning this contest so decisively.\nI am humbled by the more than 193,000 members, supporters and trade union members who have put their faith in me and I want to say a big thank you to them. It has been a privilege to meet so many of you, who have given so much of your lives to Labour, and I promise to continue to work for what we all believe in. It has been a huge honour for me to stand for leader of our great party and I am also deeply grateful to my Parliamentary colleagues for nominating me.\nI entered this race because I didn’t think Jeremy was providing the leadership we needed, and because I felt we must renew our party to win back the voters’ trust and respect. However, I fully accept and respect the result.\nI have no time for talk of a split in the Labour movement – it’s Labour or nothing for me. And although today’s result shows that our movement remains divided, it now falls primarily to Jeremy Corbyn, as Labour Leader, to heal those divisions and to unite our movement. We have to turn round our dire opinion poll ratings and take on this right wing, failing Tory Government. Jeremy has won this contest. He now has to win the country and he will have my support in trying to do so.\nAbove all, despite present divisions, we have to stick together in for the long term. I call on those party members disappointed by the result and tempted to look elsewhere to stay with Labour and to stay involved. Let’s work together to renew this movement and take the fight to the Tories\nI want to thank Iain McNicol, the Labour Party staff and ERS who have all worked tirelessly and professionally during this contest.”",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_08_09_b-a-m-e-and-race-equality-or-inequality-what-are-the-issues/content_12.html": "Whilst attending a meeting with Owen Smith recently, the topic being discussed was BAME, which I found both fascinating, and relevant to me.\nBAME stands for Black, Asian and Minority Ethnic.\nAs someone who is British born from an Asian background, second generation with two children born in the UK, I am concerned about being categorised by my ethnic origins. I consider myself as British first before anything else. I love my country, my nation and my religion. I don’t wish to be categorised in any other way. Whilst I know the argument for doing so, is to prevent ethnic biases in society, I don’t think it is helpful; it accentuates differences, and drives an ethnic wedge between us. White people don’t usually get described as white people, as much as I get described as Asian, so why should I have to be labelled?\nI was born in the UK, educated here, I have always been British, and have only ever had a British passport. I don’t come from Asia, and I’ve never lived there, and don’t feel I belong there. People whose parents were immigrants from other European countries, don’t get labelled according to where their family origins are from, so why should I?\nI was born in the UK, educated here, I have always been British, and have only ever had a British passport. I don’t come from Asia, and I’ve never lived there, and don’t feel I belong there. People whose parents were immigrants from other European countries, don’t get labelled according to where their family origins are from, so why should I?\nI suggest we forget BAME, and adopt BAU (Business as usual), reflecting everyone as individuals, regardless of ethnic origin. I do appreciate before this can happen, a lot work need to happen in peoples attitude and commitment to one another.\nI don’t deny there is some racial prejudice, but I wonder how much the race inequality issue is blown out of proportion? Do we, whose parents came from different places around the world, carry a chip on our shoulders? How much do BAME feel victimised?\nAre some BAME not putting themselves forward for top jobs and opportunities, simply because they think their race will prevent them from succeeding? Is their own lack of motivation or limiting self-belief stopping them taking the opportunities that are out there? I think we need to have an open dialogue.\nWhen you hear statistics like BAME Graduates are 2.5 times more likely to be unemployed compared to their white counterparts, and get less pay, and only temporary work, I do get concerned. Britain needs everyone to fulfil their potential, but we need to ensure merit comes first.\nPersonally, I’ve never felt discriminated against because of my ethnic origins, and I have to say that I only became aware of BAME later in life when I met people who said they have experienced racial inequality.\nI wonder if it had something to do with the fact that as a young person I grew up in the AMYA, (Ahmadiyya Muslim Youth Association) in the UK. It is an organisation committed to the spiritual, moral, social, intellectual and physical development of young Muslims, and runs regular programmes of structured activities, with a mix of academic, sporting, social welfare and charitable works, which keep its members engaged. One of AMYA’s key objectives, is to serve and contribute to society at all levels, through active integration and engagement. The purpose of all these activities is to engender the spirit of discipline and service to the wider community, irrespective of people’s beliefs, race, or gender. Its motto ‘Love for All, Hatred for None’ is the ethos that underpins the organisation. I believe that, due to the outreach community work I did, I developed positive self-esteem, a feeling of Britishness, and strong sense that the colour of my skin didn’t make me any different to anyone else. I feel certain that this is why I have never ever felt discriminated against.\nI know many people have very strong beliefs concerning BAME in every context, I hope that my thoughts, even though I know will be seen as controversial by some, can at least add to the debate. If we are not prepared to see all sides, and consider all views, how can we ever hope to solve problems and issues?\nDAVID Isaac, chairperson Equality of and Human Rights Commission, has talked of the dangers of attempting positive discrimination. He also spoke about the benefits of blind job applications, which make it very difficult for employers to show bias. What particularly resonated with me, was the idea that the Care Quality Commission could bring about positive change through training, education and confidence building.\nBonnie Greer, writer, broadcaster and chancellor of Kingston University, said that BAME people in the UK have a younger age mix than the white population, and that the entrepreneurial drive and business acumen of many BAME, could be highly beneficial in years to come, where the young are going to be burdened with having to support and aging population. BAME people starting and running businesses, create jobs, drive the GDP and provide vital tax revenue. I remain full of hope for BAME in the future, and I hope that it is sooner rather than later that we can stop using the term and see everyone as equal regardless of their racial and ethnic heritage.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2023_11_04_moment-to-talk/content_6.html": "My name is Hanif Khan, and I would like, with your support, to be the parliamentary candidate for Earley and Woodley Constituency, a newly formed parliamentary seat.\nEarley and Woodley, has over 70,000 people in the Constituency and a diverse multicultural community. There are many whose lives are blighted by poverty and live on benefits, and many are striving to survive on low pay and keep their heads above water. For many, there is no choice between energy and food, and their choices are minimal and can’t be realised.\nThere are many suffering.\nThose on higher incomes are often isolated in their own homes and have seen their mortgages sore.\nFor those who rent, many within our community are now forced out of the market due to rising rent charges and the cost of living crisis.\nWe need and should have more social housing that is affordable and built with the community in mind, transportation, doctors, schools, security, amenities and well-lit places.\nMany generations of families now live here, with strong links to London. And with the Elizabeth Line and improved motorways, it’s ideal for many to make this area a destination for work, home and leisure.\nThe Earley and Woodley seat will comprise locations from Church and Whiteley to Bulmershe and Whitegates through Sonning and Shinfield.\nI am committed to serving the Constituency and you all – I have a lifetime of experience uniting diverse communities and fighting for equality of opportunity for all. When in Westminster, I will represent your ambitions, your aspirations and how you might have been left behind after more than a generation of Tory rule.\nAll of us want a roof over our heads. We want to aspire to a better life and wish to develop ourselves by working hard. Our current government has not rewarded that hard work. I want to work with you to make a change, a change for the better, and a change for always. Artificial Intelligence, AI, is already here, and we need to maximise the benefits and, at the same time, protect ourselves from malice.\nSpeaking to many of you, I appreciate the challenges that are at the forefront of your minds, whether it is the cost of living crisis or whether you have been squeezed of rented property within the Constituency or school places for our children.\nWe see sewage flowing into rivers. Water companies will need to be held accountable, and so close to home, we see the river Loddon polluted.\nThere is a need for more affordable public Transport; ticket offices are closing across our country, and Earley Station is no exception, not forgetting the lack of bus routes and their insufficient frequency.\nBusinesses are suffering with the costs of overheads, and simply keeping their heads above water is becoming a lifetime struggle. I will work to solve the business rate inequality. Theft from shops is becoming out of control. Some of us have lost all and everything. We will end the £200 rule to tackle the shoplifting gangs. A law brought in by the Tories means shop thefts under £200 are not investigated even if the same gang comes back time and again.\nWe also see crime on the increase, with many suffering loss due to anti-social behaviour and increased assaults. Knife crime has gone up by 75% in eight years. Car crime and violence against women and girls have been unacceptable for a long time.\nDeveloping family values and equality for all is about who I am. Family is a vital and coherent value I adhere to.\nI grew up with my parents working hard, and my father, a socialist, inspired me to work for change that would make a difference. I am indebted to my parent’s sacrifices for me and my five siblings. My mum sewed clothes to ensure our family had food on the table and we had a secure home where we all could live. I am a carer for my father, who gave so much to our society but asked and expected so very little.\nI have run my business for more than 20 years, which has taken me worldwide and worked with award-winning companies like Sky News. I am a Union member of BECTU Prospects and the Community Union, all of whom champion small business owners and freelancers. Recently, they have, along with the Fabian Society, produced a game-changing manifesto called the Progressive Plan for Self-Employed People in the UK.\nI am a campaigner for change. I have experience as an elected councillor for eight years, working on the front bench in Transport, community protection, levelling up and working to unite the community. I understand the pressures and commitment to supporting you in Parliament. I am chair of our local Co-operative Party – a part of Labour that works towards a more equal society. We need that society, one which Labour leads in government.\nI work closely with SME4 Labour and Labour for Business, connecting and understanding the challenges and opportunities of business, such as the opportunities closer to home, Winnersh Triangle, Thames Valley Business Park, the growth of the IT sector, a massive potential for Earley and Woodley to seize on—education, employment and entrepreneurship.\nWe will recruit businesses to come to Earley and Woodley in the tech and media space. We have one of the biggest studios in Shinfield being developed, where some of the greatest stories will be told. I want to Encourage Reading students to stay here after graduating and give them the opportunities to have fulfilling lives.\nI understand the pressures and commitment to supporting you in Parliament. I will work with you, listen and develop a campaign for change, make a difference and fight for more Westminister attention.\nWe will gradually change our society for the better and realise our ambitions and aspirations.\n- Whether it’s working towards new green energy,\n- Improving our Environment,\n- Changing the face of the NHS for the better,\n- Training new doctors and nurses, reducing high waiting lists,\n- Safe and secure in your homes, the prosperity of our nation.\n- Break down the barrier to opportunity.\nI will be there with you at every step of the way.\nEarley and Woodley will have their own identity that we can all be proud of. No matter who you are or where you come from, we are one community; we will beat as one – We are one.\nThat’s what I will do.\nThank you.\nHanif",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_10_09_according-to-survey-more-than-half-the-uk-population-want-a-burka-ban/content_31.html": "Let be clear, what is it we are trying to ban. There are many types of Islamic dress for women not all of the as encompassing as the Burka. The Burka grabs the headlines as it the one which covers the most and adds a air of mystery and unknown. And people fear the unknown.\nAre we looking to ban the burka because it is a symbol of a religion or because it is a symbol of the oppression of women?\nIf a woman chooses to wear Islamic dress and that is her own personal choice, then how is that oppression?\nThe state should not interfere in such matters and history has shown that once laws are introduced to target religions or aspects of those religions it can have severe consequences and be misused by those in power.\nLook what happened in France, where police enforcing local laws forced a woman to remove her Burqini in public on the beach. Based on the photos I saw this caused her distress. How can this be right?\nWe had another example in France where a girl was sent home for wearing a long skirt which was considered symbol of religion by her teachers.\nThe Quran itself is not prescriptive on what to wear for women (except for righteousness and modesty to be followed) and most of what are perceived to be Islamic rules regarding women dress have been a result of interpretation of Hadith (the sayings of the Holy Prophet, Peace and Blessing be upon him)\nThere are various interpretations on wearing the burka amongst the scholars of Islam on how much of the face should be covered and they are just that; a person’s interpretation. Ultimately the person making the choice should be aware of the facts/regulations/guidance themselves and make up their own mind.\nI fear that if we ban the burka and other religious symbols we run the risk of creating a divide and driving our young people into the arms of religious extremists whose main message is that “come join us, you are one of us, not those who seek to discriminate against you“\nOnce laws are introduced, especially those not thought through properly or with a scope open to wide interpretation they are open to misuse. Close to home we have the use of anti-terrorism laws to check if children live within a school catchment area.\nMy late mother who worked extremely hard all her life, used to say, the Islamic guidelines on Hijab is not a disgrace or a hindrance for a woman in any way. On the contrary, it honours her and frees her from the obstacles that prevent her moral and spiritual advancement.\nFor me I see the Muslim dress as a step on the road to equality as it frees us to focus on what a person says and does as opposed to what they look like.\nNot only is a religious clothing ban likely to violate our fundamental right of choice it can also prevent those affected from moving comfortably in Western society and bringing us all closer together\nRemember the real barriers to integration are unemployment and poverty NOT clothing.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_12_22_what-is-the-real-value-of-boris-johnsons-5000-for-nurses/content_30.html": "Sounds good the £5000 for nurses, I welcome it. It’s about time something, even if it’s a token gesture to encourage the loss of skilled workers joining the profession. In 2016 George Osbourne cut the bursaries ultimately discouraging people from joining the profession, leaving a shortfall of about 50,000 nursing vacancies in the UK.\nBefore it was abolished, Nurses and even midwives could apply for non-repayable bursaries of up to £4191. And have their course fees paid for, worth up to £9000 a year. You can understand why we had a massive shortfall in nurses when it was withdrawn. The service nurses provide is imperative to the success of the recovery through the illness and wellbeing of patients.\nThis announcement from Mr Hancock came in just before the application deadline was approaching to entice those considering a nursing degree.\nIt’s an annual payment of £5000 starting at the next academic year. Also, those considering specialist disciplines, like mental health, will get an additional £3000.\nLabour’s shadow health secretary Jonathan Ashworth welcomed the partial reversal on student nurse bursaries but called for further funding.\nThe good thing is that NHS funding is in law and should never have been withdrawn in the first place. It is repairing the damage created by nine years of cuts since the coalition in 2010. We must ensure patients and the public can access safe and effective health care services.\nThis investment of 33.9billion till 2023/24 will still be the smallest increase, and it won’t go far enough because of what happened in the previous nine years. One hell of a crisis!\nNurses feel let down and undervalued. RCN Chief Executive & General Secretary Dame Donna Kinnair said: “With tens of thousands of vacant nurse jobs, serious measures are needed. This grant is a first victory for the campaign that our student nurses are running. The announcement will hopefully encourage more people to apply to a nursing degree by the mid-January deadline.\nThe Royal College of Nursing is asking you to get involved to save their future, #SaveOurFuture, and campaign with them to help increase funding.\nReference:\nMilne, O. (2019) ‘Why Boris Johnson’s £5,000 for nurses next year doesn’t reverse cruel Tory cuts’\nRCN, (2019) ‘RCN urges Government to put £1bn back into nursing higher education’\nRCN, (2019) ‘Student funding announcement: what we know so far’",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2020_04_04_covid-19-where-is-my-ppe-to-protect-me-and-nhs-staff/content_14.html": "Today, right now, where are the personal protective equipment (PPE) for our NHS Staff and frontline emergency workers? The Government must, without fail, provide them for our workers. It’s clearly their responsibility, and this problem has been persisting for months now.\nOutside of the hospitals, ICU’s and operating theatres the use of PPE’s in the healthcare sector, like, GP’s, nursing homes are not used much. This pandemic has turned all that upside down. Now the ambulance services, police services, fire officers and even street cleaners, waste and recycling workers need them. The problem seems to be that they are available but can’t distribute them to the places that need them. There is a high turn over for PPE’s and they need to meet strict contingent safety standards.\nWith the coronavirus pandemic spreading out of control across the globe, the only force we have at our disposal in defence of this catastrophic pandemic is our NHS.\nWe have all witnessed the tremendous pressure doctors, nurses and other health care professionals are facing, and they are all making heroic efforts to keep patients alive and stable. That is why every Thursday I have stood outside my house clapping for the NHS, carers and frontline emergency workers. And now with a loud voice, I am demanding that these great people be afforded this equipment.\nThe Secretary of State for Health and Social Care Matt Hancock said in March 2020. All care settings should have access to personal protective equipment (PPE) by the end of the week in a statement to the house of commons.\nIn another report, by the independent, showed NHS staff were supplied with out-of-date face masks.\nSource: VOI Radio Drive Time 3rd April 2020: 11 mins into the show, they said:\nWhilst the rest of us are told to keep 2 metres away from each other, treating COVID patients also requires physical contact. Whilst we are walking out covered in gloves and masks, health care workers are exposing themselves unflinchingly to the virus. Those doctors working in intensive care units, despite being covered well with protective gear, such as protective face masks, are being left with scars.\nLabour calls for urgent action for the Government to protect care staff and social care system. Barbara Keeley MP, (Labour’s Shadow Minister for Mental Health and Social Care) and Jonathan Ashworth MP, (Labours Shadow Health and Social Care Secretary) have set out four key areas of action from the Government to address the growing COVID-19 crisis faced by social care.\nThe four key areas:\n- Increased delivery of PPE for care staff.\n- Provide the social care sector with immediate additional funding.\n- Test, test, test in social care.\n- Provide continuous monitoring of the pressures faced by the social care system and leadership from the department of health and social care.\nDelivery of PPE: Millions of personal protective equipment (PPE) for frontline staff were delivered to NHS services across the country last month and now needs to be distributed to the most affected part of the country that needs them. The distribution, turnover of PPE’s and quality need to be resolved.\nDeliveries are arriving, but mainly on ships from around the world. Manufacturing companies and even students are turning their attention to producing masks while using 3D printers. And NHS staff are making masks from snorkels.\nToday, more than ever, service to humanity is crucial. When Prime Minister Boris Johnson made a call for volunteers to help serve alongside the NHS performing tasks. The response was fantastically and genuinely British.\nHow volunteers could help.\n- By delivering medicine to patients.\n- Transporting patients to and from the hospital.\n- Making regular phone calls to check in on people who may be isolated at home.\nThe Government called for 250,000 people for help, and the British people responded. no doubt out of their love and concern for the NHS. What amazed me was the triple the amount volunteered! And now they have had to pause recruitment drive as overwhelming amount responded.\nWe cannot forget, frontline doctors have been treating patients at the risk of contracting the virus themselves, and potentially taking it home to families, husbands, wives, parents and children. The doctors go from patient to patient, speaking to them, examining and reviewing their condition. We need to find an optimal balance between safety for patients and health care workers which considers existing guidelines and the urgency of delivering PPE.\nJust remember during these unsettling times, it is the duty of all to stay at home, protect the NHS and save lives.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2015_05_08_candlelight-vigil-held-outside-trinity-church-hounslow/content_43.html": "A candlelight vigil for victims of the Nepal earthquakes was held this weekend. Many people, from all backgrounds came to gather in Church Square, outside Holy Trinity Church, in High Street, Hounslow, on Saturday 23rd May 2015, to remember the many victims of the disaster.\nThousands were killed and many more were left homeless by a devastating quake on April 25, and the country’s recovery was set back by a second large earthquake on May 12, which claimed yet more casualties.\nHounslow has a large population of Gurkhas, who hail from Nepal, and many people in the borough have relatives or friends caught up in the tragedy.\nHounslow’s deputy mayor Bishnu Gurung, himself a Gurkha, lead the vigil, as around 500 people attended to pay their respects.\n“My heart goes out to all who have suffered in the Nepal earthquake I pray for a speedy return to normality, ,” Cllr Hanif Khan said.\nThe evening was enjoyed by everyone",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2020_01_19_is-climate-change-affecting-australia-fires/content_10.html": "The catastrophic natural disaster which is taking place in Australia is another alarm bell going off in my mind and I suspect yours too. Even though the threat has subsided, the problem has not gone away.\nThe extent of the current raging bushfires which began in September 2019, is notably greater and has caused an incredible amount of destruction.\nThere was a poll completed by Voice of Islam radio drivetime, on its Instagram asking if you agree with climate researchers who say there is a connection between climate change and increased risk of natural disasters? 89% of people said Yes, which clearly shows the world is concerned.\nAccording to the Canberra Times Newspaper, the fires have killed 28 people and more than 2200 houses destroyed.\nSir David Attenborough, has said it is “palpable nonsense” to suggest that Australia’s bushfire crisis has nothing to do with climate change as he warned “the moment of crisis” has arrived.\nFurther, Professor and ecologist Chris Dickman of the University of Sydney estimated the number of killed animals to one billion. This number excludes frogs, insects or fish. The affected area (10.7 million hectares) is said to be roughly the size of Guatemala or South Korea.\nThese figures may seem unfathomable, unfortunately, are very real and currently happening.\nThe effects of the fires are not only limited to Australia now but are impacting on New Zealand. The snow on the mountains is darkening, and the air quality is suffering. According to NASA, smoke has travelled to Chile and is expected to make a full circuit around the whole globe. Global data from three agencies, Nasa, Noaa and the UK Met Office show that 2019 was the second warmest year since 1850. Read in BBC News:\nAffected Wildlife\nAfter Conservation groups wrote their concerns about the extinction of certain species of animals to the government, the Australian government promised 50 Million Dollars to help rescue and preserve the affected wildlife.\nLast Saturday, Matt Kean, the Minister for Energy & Environment of New South Wales, has tweeted that the National Parks and Wildlife Service staff has dropped down thousands of Kilograms of Carrots and Sweet Potatoes via helicopter for the animals, especially the Brush-tailed Rock-wallaby colonies. On Twitter and other social media, the reaction to this act of kindness towards animals was highly praised.\nThere is an animal in Australia called the Wombat, which is a short-legged Marsupial. It was shared on Twitter that the Wombats have saved many animals by letting them take shelter in their deep burrows – they even actively herd fleeing animals.\nWhat can we do?\nMany people think, “What could I possibly do, one person would not change much anyway”, but if everyone changed their behaviour and kept the environment clean, many things could be achieved. For example, planting trees. It is a great way to help and enhance nature.\nIn these raging fires, many people lost their lives, and many more have lost their homes. Many animals were killed or lost their habitat. Now all over the world, people, be it celebrities or governments, have started donating to help the affected areas in Australia.\nTo Donate & Help Support Today – Australia Bushfire Emergency\nFires are still burning in Australia, and experts say that even cooler temperatures and the heavy rain which has arrived would not end the bushfire threat.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2022_06_18_lights-camera-and-action/content_13.html": "After the local elections in May 2022, camera, lights, sound, and action are something I have been saying a lot. Video-Shoot Productions takes me worldwide, from Africa, Europe and Japan—filming for charities, companies and myself. Sometimes at beautiful remote locations.\nBefore May the 5th, 2022, I was a Labour Councillor for eight years and six years on the front bench, and since then, it has been a roller coaster. I intend to stay in politics, but time will tell how that will play out. I still get many calls from residents asking for help, and I politely pass their requests on to relevant talented Labour councillors.\nMy values are still the same, such as building on the slogan, “Love for All, Hatred for None”. I very much want to see an end to extremism, discrimination, and racism. And live in a society where equal opportunities exist all over. I still experience and see it today.\nAlways a hard working and dedicated Councillor,a genuine loss for Hounslow Council and residents. I also consider you a friend and am sure you will be back.\nHanif worked tirelessly for his constituents and the borough. Always cheerful, positive and constructive, he remains a source of strength for progressive and kind politics everywhere.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2024_02_02_my-letter-to-the-ceo-of-thames-water-sewage-in-our-rivers/content_21.html": "This issue has been picked up by the Labour Party of Epsom and Ewell. They even met with the Thames Water board about the pollution of the Hogsmill along with the local Greens.\nThere is a petition you can sign on Change.org . . . . Thames Water should not be using the Green Lanes Stream and the Hogsmill River in Epsom & Ewell and Kingston Boroughs, as open sewers.\nThe Hogsmill is one of only 200 chalk streams in the world and used to be teeming with wildlife. Yet, it is now so polluted that warning signs advise people and their pets to stay out. for further information and sign the Petition . . .\nMy Letter to Chris Weston, CEO of Thames Water\nI wrote to Mr Chris Weston, CEO of Thames Water, urging him to stop sewage overflow into Hogsmill River and Green Lane stream and fix the known issues I put in my letter. And I thank Linzey Bell CEO Office manager for her response.\nHave your Water Bills increased over the Decade?\nRecent reports expose the disturbing truth that toxic chemicals, contaminate the very waters of Hogsmill River and Green Lane Stream. The culprits? Thames Water, the company entrusted with managing wastewater in the area, shamelessly dumps untreated sewage into our rivers,\nThis Conservative government has wilfully turned a blind eye to corruption at the heart of the water industry, leaving stinking, toxic sewage to ruin our countryside.\nIt is staggering that water bosses are lining their pockets with millions in bonuses, while asking consumers to foot the bill.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_01_07_different-types-of-islamic-dress-hijab-niqab-and-burka/content_40.html": "There are lots of different types of coverings worn by Muslim women all over the world, from the Middle East, to Africa, to Indonesia. Some have many colours besides the traditional black warn by many we see on TV. Some wear a headscarf to cover their head and hair, while others wear a burka or niqab, which also covers up their face. Headscarves are seen as a sign of modesty, and a symbol of religious faith. But how can you tell which one is which? Have a look below which will help you understand.\nHIJAB\nThe word hijab describes the act of covering up generally but is often used to describe the headscarves worn by Muslim women. These scarves come in many styles and colours. The type most commonly worn in the West covers the head and neck but leaves the face clear.\nNIQAB\nThe niqab is a veil for the face that leaves the area around the eyes clear. However, it may be worn with a separate eye veil. It is worn with an accompanying headscarf.\nBURKA",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_03_19_muslim-leader-calls-for-media-responsibilities-in-fight-against-extremism/content_15.html": "Members of Ahmadiyya Muslim Community Hounslow North and South along with many local residents attended the National Peace Symposium in London on Saturday the 19th March where their Caliph, His Holiness Hazrat Mirza Masroor Ahmad, called on the media to use its influence “as a force for good and a force for peace” by publicising the positive activities of the majority of Muslims across the world as opposed to the “tiny minority” who were perpetrating mass cruelties falsely in the name of Islam.\nHis Holiness also stated that there was no punishment for apostasy in Islam and that the Holy Quran was the standard-bearer for universal religious freedom. His Holiness reiterated the need to cut the supply lines and funding of all terrorist and extremist groups worldwide.\nHis Holiness condemned terrorist groups such as Daesh, as disgraceful and as acting completely against the teachings of Islam and quoted verses of the Holy Quran that refuted all forms of extremism.\nHis Holiness said\n“This event is taking place at a time when widespread fear of Islam is on the increase due to the horrific and disgraceful acts of terrorist groups such as Daesh. For example, last November, the world watched in horror when the terrorist attacks took place in Paris, and apart from this there have been suicide bombings and attacks in various countries at regular intervals.”\nNonetheless, His Holiness made it clear that true Islam was a religion of peace and that the brutal acts being committed by certain so-called Muslim groups were not permitted or justified by Islam in any way.\nSiobhain McDonagh, MP and Chair of the All Party Parliamentary Group for the Ahmadiyya Muslim\nCommunity said:\n“The Ahmadiyya Muslim Community contributes greatly to this country and your belief in peace and\nreligious tolerance is an example to us all, as you would expect from a community whose motto is\n‘love for all, hatred for none’.”\nZac Goldsmith ,MP and London Mayoral Candidate said:\n“For over a century the Ahmadiyya Muslim Community has taken a stand against hatred but you\nhave faced it down with compassion, love and practical help to bring communities together.”\nRafiq Hayat, the National President of the Ahmadiyya Muslim community said :\n“The Ahmadiyya Muslim Community focuses on education, humanitarian work and the Jihad of self-\nImprovement and of spreading peace.”\nLord Tariq Ahmad of Wimbledon, Minister for Countering Extremism said:\n“There can be no better example of [countering extremism] than that exemplified by the Ahmadiyya\nMuslim Community under the Divine and inspirational leadership of His Holiness, Hazrat Mirza\nMasroor Ahmad.”\nRt Hon Justine Greening, MP, Secretary of State for International Development said:\n“I just want to say how proud I am to play a role in representing the Ahmadiyya Muslim Community as a local MP, but also to say that in my broader role within government, it’s a privilege to work alongside Humanity First and to see the fantastic fundraising the Ahmadiyya Muslim Youth Association.”\nDuring the event, His Holiness also presented Ms Hadeel Qassim, the Ahmadiyya Muslim Prize for the Advancement of Peace in recognition of her outstanding efforts to personally alleviate the suffering of thousands of refugee children stranded in dangerous and inhospitable camps in the Middle East. During his address, His Holiness spoke of the fundamental need for justice and equity at all levels of society in order for genuine and long-lasting peace to be established.\nCllr Amrit Mann Deputy Leader of Council and his wife Mrs Amandeep Mann along with many other councillors, Cllr Ed Mayne, Cllr Shantanu Rajawat, Cllr Bishnu Gurung, Father Sergiy Diduk from All Saints in Hanworth Park, Cllr Daanish Saeed, Cllr Harleen Atwal, Cllr Bandna Chopra, Cllr Ajmeer Giriwal Mr Barnard Vian and Mrs Barnard Vian – Friends of Faith, Mr A. S. Mann and his wife Mrs Gurchan Mann from the Havalock Way Guduwara, Mr James Holmes, Mr I S Uppal M.B.E. attended the event.\nCllr Hanif Khan a member of the Ahmadiyya Muslim Community said that they have returned from the event inspired and committed to playing their part for peace in the country and the world, and for working to root out the terrorists and extremists from our midst.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2020_01_03_at-least-280000-people-in-england-are-homeless-what-is-being-done/content_26.html": "Can you see this situation improving, current signs are that it is escalating and will get worse this year. Alarming, one in every 200 person’s were homeless at Christmas in 2019,\nThere are 280,000 homeless people in insecure accommodation a staggering number, known as the hidden homeless. Those not seen on the streets, who we see on the streets are a tiny proportion of the real problem. It is distressing and something we can resolve.\nIt is an official number of 280,000 people homeless in England. Many are still under the radar. Less than 5000 are living on the streets. The vast majority of homeless people are ‘hidden homeless’.\nChief Executive, Polly Neate, of Shelter said people coming to their establishments include families with children.\nFamilies are facing a real crisis of insecure housing; they are being turned out of private accommodation by the increase in rents and the freezing of housing benefits. Even when people are working, and sometimes two jobs in a household, they still cannot afford the rent. That often tips people into homelessness. And then there is simply no social housing available that people can move into. The term affordable housing has become a ‘misnomer’ there is a complete shortage of housing.\nThe Government has set a target of ending street homelessness, which is excellent, and it can be done. It was almost eradicated when Labour was in power. However, the hidden homeless is another problem and requires more attention.\nJohn Healy MP, Labours’s Shadow Housing Secretary, responding to the latest quarterly homelessness statistics said:\n‘Rising homelessness shames this Conservative Government.\nHomelessness fell with Labour, but under the Tories, it has spiralled out of control, with over 126,000 children now without a home.\nIn terms of house building, let’s be clear, the Government set a target in Autumn 2017 of building 300,000 homes per year, they have nowhere near reached that target.\nThis Government has announced 260 million coming in early 2020 spread across 300 councils, but where will this money go? To the visible people living on the streets Or to the hidden homeless.\nThere is always the challenge of Nimbyism, (not in my back yard) But we need to build good quality social housing. There are plenty of people, even in the countryside recognising that people born in a rural community can no longer afford to live there and meanwhile second homeownership is increasing. Communities are being priced out of the area. Second homes purchased not by those on a low income but those who have the purchasing power. We must build good quality social housing.\nTerms like sofa surfing can trivialise the problem. Sounds fun and cool, BUT actually it’s anything BUT. Tackling homelessness both on the street and the hidden needs to be taken extremely seriously.\nHomeless people need expert help, they may have numerous issues, have an addiction of some sort. Many have lost trust in the system, people were not born to live on the street.\nSO the money pledged in my view will fall short making the change we so desperately need.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2020_01_15_how-our-social-circle-of-friends-can-be-a-threat-to-our-existence/content_35.html": "Making friends is easy, and their influences are hard to ignore, and this influence can be both contentment and irreversibly damaging.\nThe reality is, we choose our friends and so we ultimately choose to become an impression of them!\nHow important is it to choose our friends wisely?\nThe influence of the bad company in the context of gang crimes is one example of where choosing the right friend can keep you from trouble. Educators and parents can do a lot for our children, and it comes with a level of responsibility.\nResearch has been in favour of having healthy and fruitful friendships, it amounts to fewer stress levels and an overall improved lifestyle! This has been incorporated into numerous studies over time. Now researchers are turning their attention towards the ‘friends’ that can rather instigate stress in others or create resentment by being the wrong kind of influence.\nThe New York Times wrote a wonderful piece on this subject: Some friends, do more harm than good.\nConsequences of bad company: Gangs and knife crimes:\nIn recent news, we have been hearing repeatedly of brutal knife crimes and outrageous murders of young teenage boys. Take the case of Jaden Moodie- a 14-year-old boy mercilessly stabbed by a rival gang while dealing drugs last year. The horrific and condemnable crime is one of the hundreds that can be traced back to the bad company!\nAccording to BBC’s report on the case of Jaden Moodie:\n“The younger gang members – between the ages of 12 and 17 – are becoming increasingly active in street-level crime both as victims and perpetrators.”\nPeer Pressure and involvement in gangs:\nPeer pressure can push a child, who has no concrete notion of consequences at a young age to do something that has serious results.\nMotives and solutions have been under debate for months now, but the fact remains that most of these victims are innocent children. Adolescence is a wonderful time for anyone and to be exposed to elements of peer pressure and eventually committing a crime is a much bigger concern.\nThe role of parents and teachers:\nParents at home and teachers in schools should create awareness in children on the difference between right and wrong companies and the consequences of choosing each! Educators can teach children to spot the signs of gang association and can aid in helping pupils to make gangs seem less glamorous. Parents must teach their children that joining a gang can destroy lives; lead to criminal records, and to prison with serious charges.\nI believe classes should be developed to help parents overcome the challenges they face when they suspect and are losing their children to gang crime.\nParents sometimes turn a blind eye to a child’s company under the guise that they must be monitored by their teachers, but a child should be instilled with the ability to detect which friends can harm them right from the start at home.\nHome should be a friendly place and give the child the attention they deserve, so they don’t go looking for it outside and turn towards gang life. Sometimes they cannot differentiate the nuances of good/bad influence. Parents should take it upon themselves to guide their children who in turn should trust their judgment!.\nOur responsibility to society is to strip the glamour of crime and raise our children with the right morals, surrounded only by the right company.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_09_09_fgm-no-place-in-modern-society/content_19.html": "FGM is something a short while ago I knew very little about. After taking up the batten to highlight this antiquated and barbaric crime, illegal in the UK, I have submerged myself in understanding it further. To be honest it has been a difficult challenge, making me very uncomfortable and hard to stomach. I guess many of us feel this way and can’t bring ourselves to discuss it, learn about it and stop it from happening. When you get a glimpse of how horrendous this mutlilation is and damaging in every sense you quickly get passed it and realize you feeling uncomfortable is insignificant and inappropriate. Imagine the discomfort faced by the young girls and women cut.\nI would like to encourage you all to raise the awareness and take up the fight against female genital mutilation. There has been an international effort to stop this since 1970\nLady Rendell, is a long-term campaigner and is very outspoken. She has said that it would be classified “not as a quaint custom but as child cruelty, as child abuse, because that’s what it is”.\n“Even if it may be committed without child abuse or cruelty in mind, that’s what it is. I think that if we can persuade the Home Office to do more when the police are doing so much, I see that at last there has been a breakthrough and things are going to change. I hope so.”\nYou wouldn’t think school girls in the UK have to worry about female genital mutilation (FGM), but we do. Its illegal in the UK, it is still happening I was surprised to learn 24,000 girls in the UK are currently at risk of FGM. People just don’t talk about it, doctors don’t check for it and teachers don’t teach it. We need to change this attitude.\nI learnt that French girls are sent to Britain to be cut and brutalised in this way. This is very shaming for us in the UK. France are very out spoken and have zero tolerance to this barbaric act, they have already prosecuted and jailed 100’s of people, dozens of high profile cases. It was defined as a crime under French Law in 1983 with a threat of 10 years in Prison and up to 20 years if found cutting a girl under the age of 15.\n“Sweden and Italy have prosecuted, you get the feeling that our government is not doing enough yet.\nIn the UK recently there was a petition calling on educating girls as young as 5 about this brutal act, FGM, it was started by Fahma Mohamed and the final result was sent to the Department for Education, the then minister Michael Gove. On the change.org website It won with 234,375 online signatures.\nEven though this might be a bloody, difficult to understand subject to teach at school to young people and some parent may object. But I would still say this culture is wrong and needs to be totally abandoned, most girls are cut by the age of 5 and 10% of the children are killed in the this process. The sooner we start to educate sooner we can save the next generation.\nRuth Rendell helped introduce tough new laws in 2004 making it an offence to send a child abroad for the procedure. It was made illegal in the UK 1985 but there have been no successful prosecution and in 2003 it was illegal to take out children to be cut.\nFGM is child abuse. It forces girls into a future of pain from the moment they are cut. They face the risk of infertility, pain during urination, menstruation, childbirth and sexual intercourse. The pain doesn’t go. It’s a traumatic experience they have to live with every single day, physically and emotionally. This must stop.\nIt involves removing external female genital area for non medical reasons, We have to talk about it and stop being. Women who have undergone female genital mutilation are twice as likely to die in childbirth and four times more likely to give birth to a stillborn child, experts say.\nThis is not a religious act as it is being painted as, it is purely an antiquated, barbaric, cultural practice that has no place in this world, there is no Quranic text that FGM is allowed or has place in Islam.\nFGM is practiced all over the world especially in Africa, 29 countries and most common in Guinea, Sierra Leone, Mali, Egypt, Sudan and Somalia. And as a result of migration, it is increasing in Western counties amoungst the diaspora populations from area where the practice is common.\nBasically we all need to get together and end this practice that has gone underground and more dangerous to our vulnerable.\nThere is still a lack of understanding about this subject, there are various degrees, Type 1 or 2 or 3, People are uncomfortable about talking about this subject.\nWe are great in the UK, always strived to make things better for people through change and determination. Do you care enough to change the perception and eradicate FGM?",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_10_08_happy-independence-day-nigeria-blessed-to-be-part-of-the-celebrations-nigeriaat56/content_41.html": "This year on National Day, Nigeria celebrates 56 years of independence celebrated on 1st October.\nMost Nigerians celebrate Independence Day over four to five days as they engage in several cultural activities and community gatherings to make it memorable. This was no different in Hounslow and celebration continued all week finishing today at the Catholic Church Hall.\nI was asked to host the event and say a few words about peace, love and community. I have always had an affection to North Africa and travelled to many parts of it, from Ghana to Somalia and even Egypt. It just so great that we have a vibrant culture and the day was full of warmth and love.\nThere were speeches from the Mayor of London Borough Hounslow, Cllr Ajmer Gerewal, Seema Malhotra MP and the Chair person. Many danced their way to the end of the evening with performances from the OPV Dance academy.\nNigeria is Africa’s most populist nation, home to 150 million people, a quarter of the entire continents citizens. Colonised for the first 60 years of the 20th century by British rule over 250 tribes, often playing one against the other, so when independence was gain in October in 1960 tribalism was a powerful force. The challenge was to create a unity in the country, a sense of belonging. What I saw today was a glimpse of that success. I do hope it can fulfill its potential and become Africa’s success story.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_11_09_the-people-stand-up-donald-trump-is-elected-45th-u-s-president/content_37.html": "I would like to congratulate Donald Trump on his victory and pray that he can unite all the American people together, bring prosperity to them and fight against extremism and bring social justice around the world.\nHis off the wall campaign bewildered, disgusted and elated a divided nation all in equal measure, but the America people rejected Clintons pitch for continuity in favour of Donald Trump’s cry for change.\nIn his first address, Donald pledged to be a president for ‘all Americans’ saying the forgotten American men and women will not be forgotten any more.\nMany thought it was a joke he would run for president and then he did, many thought he wouldn’t climb the polls, but did. News Pundits, said he wouldn’t win any primaries, but he did. They said he wouldn’t win the Republican nomination, then he did. Finally, they said there was no way he could win a general election and then he did.\nThere has been such a massive reaction to the results in so many quarters, from the Canadian immigration website briefly going down to Europe’s Right-Wing politicians feeling triumphant and global markets plunging.\nJeremy Corbyn, says, ‘An unmistakable rejection of a political establishment’\nPresident of the European Council, Donald Tusk, tweeted a letter of congratulations to Trump, inviting him for an early summit to chart E.U. – U.S. relations.\nPutin says, Russia ready to work with U.S. to restore relations.\nGerman chancellor congratulates Trump on victory and offer close co-operation.\nThe results sound so much like the Brexit Vote in the UK, the majority of the American people fed and tired of the establishment, the polls not able to gage the feelings correctly. The campaign was not against the right or left of the political spectrum but against the different parts of the elite in USA, and in the end, Trump won. I believe many of the Bernie Sander’s supporters on the left went to Trump when Bernie was beaten by the democratic party machine.\nHillary Clinton tried to convince the electorate that the billionaire’s crude and often hateful rhetoric on race gender and immigration were at odds with core American values, But Trump’s call to drive out the corrupt political elite resonated with the majority of voters.\nAt some point when voters don’t see any improvement in their lives regardless of who is in power they stand up. The rest is history.\nIntroducing Donald Trump, the 45th President of the United States.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_02_02_3-reasons-your-business-needs-instagram/content_29.html": "Aside from being one of the fasting growing social media networks in the world, Instagram is a highly influential marketing tool for big businesses, small businesses, non-profits, and individuals all over the world. About 85 percent of top brands are using Instagram, proving that the network is both effective and here to stay.\nAlready have an Instagram account? Find us and follow us @synergyworldwide!\nWe’ll be doing plenty of giveaways in the near future through our Instagram account, but you need to 1) have an Instagram account and 2) follow @synergyworldwide to win!\nDon’t have an Instagram account? For your Synergy business, Instagram could be your best friend, and here’s why: #1. Networking\nIt may be hard to believe, but there is more to Instagram than millions of pet, baby, food, and nature photos. Like all other social networks, Instagram was created to bring people together. The connections you find through Instagram could result in new customers and business partners. Oh, and Instagram is connected to every other social network, so if you post to Instagram, you can at the same time post the same content to all of your other social media accounts.How to network: As you follow other people on Instagram, like their photos, and comment on their photos, you will notice your followers begin to rise if you actively post new and interesting content. High-quality images that tell a story will drive engagement.#2. Show Your Personality\nImages are worth at least a thousand words. Create an Instagram account that speaks to who you are. Collectively, all of the photos should portray who you are and entice people to see more. By successfully portraying your personality and lifestyle, intermixed with photos of you in your element as a Synergy Team Member, you’ll make your business offering more relatable and personal while leaving an impression on your followers.\n#3. New demographics\nAs a network marketer, you make special efforts to meet new people every day so that you can\nintroduce Synergy’s opportunities and grow your business. Instagram connects people all of the world through compelling images that, together, tell the story of a company’s or individual’s brand. By following the type of people you hope will follow you and posting relevant content that appeals to the demographics you want to reach, you can market your Synergy business subtly and tastefully. Interestingly, Instagram’s per-follower engagement rate for top brands is 58 times higher than it is on Facebook and 120 times higher than it is on Twitter. Convinced yet?\nHow to engage: Learn the art of hashtagging to help the right demographics find you. Instagram posts that include at least one hashtag receive 12.6 percent more engagement than those that don’t hashtag, and posts tagged with a location receive 79 percent higher engagement. #synergyworldwide #nutrition #healthylifestyle #entrepreneur #workfromhome\nWe encourage you to discover the business benefits of Instagram for yourself. It’s a great way to show limitless people your healthy lifestyle and the Synergy opportunities you want share. Plus, will be doing Instagram giveaways in the coming months!",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en/content_2.html": "Let's get Britains future back\nMy journey, is rooted in hard work and a commitment to making a positive difference. Raised by parents who toiled tirelessly, my father’s socialist ideals sparked my passion for change. I’m indebted to their sacrifices for me and my five siblings. My mum sewed clothes and supported the family so we had food on the table and a secure home where we all could live. I am a carer for my father, who has dementia. He gave so much to our society but asked and expected so little.\nMy wife’s parents have a long farming tradition, from goats and buffaloes to cows.\nHer father grows various crops, such as wheat, rice, and sugarcane, and is also developing expertise in fish farming. I thoroughly enjoy this.\nAlso, it is lovely to see that they have given land to local people so they can build their houses and live on it. They take care of them financially and support them in other ways. They are trying to build a school where her mother teaches local children.\nI’m deeply engaged in the community, home to over 70,000 people. As a media professional and radio presenter, I’m dedicated to providing our community a platform to voice their concerns.\nOver the years, I’ve spoken to residents grappling with the pressing issues at the forefront of their minds. The cost-of-living crisis, escalating mortgage rates, and soaring rents. Access to quality healthcare, doctors, schools, and the environment weigh heavily on their hearts. Pollution in our rivers: Water companies are not held accountable, so close to home, we see the rivers that demands particular attention. Transport and the infrastructure to encourage more use of Public Transport.\nWe must get Britain building again, Switch on Great British Energy, Get the NHS back on its feet, Take back our streets and breakdown the barriers to opportunities.\nA Labour Government is desperately needed to address these challeng\nWith over 20 years of active involvement in the Labour Party and a background as a Councillor and Cabinet Lead for Transport, I support the vision for our country that includes the establishment of a publicly-owned energy company, Great British Energy.\nAs a Union member of BECTU Prospects and the Community Union, all champion self-employed and freelancers, the game-changing manifesto they worked on with the Fabian Society called the Progressive Plan for Self-Employed People in the UK is transformative.\nI am the chair of my local Co-op, and my mission is to tackle poverty, advocate for the rights of asylum seekers and refugees to work and vote, and support family carers who provide invaluable care and support to their loved ones.\nOur NHS needs rescuing from the clutches of the Tory Party; proper investment and an honest conversation with the population on levelling up must happen.\nI understand the pressures and responsibilities of representing the constituency in Parliament. I’ll fight for more attention from Westminster, ensuring our issues are solved.\nI still remember my roots, and with unwavering conviction, boundless energy, and profound dedication, I will work tirelessly to secure victory for Labour in the next General Election.\nTogether, we’ll stand strong and proud.. That’s what I will do. Hanif",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk/content_1.html": "Let's get Britains future back\nMy journey, is rooted in hard work and a commitment to making a positive difference. Raised by parents who toiled tirelessly, my father’s socialist ideals sparked my passion for change. I’m indebted to their sacrifices for me and my five siblings. My mum sewed clothes and supported the family so we had food on the table and a secure home where we all could live. I am a carer for my father, who has dementia. He gave so much to our society but asked and expected so little.\nMy wife’s parents have a long farming tradition, from goats and buffaloes to cows.\nHer father grows various crops, such as wheat, rice, and sugarcane, and is also developing expertise in fish farming. I thoroughly enjoy this.\nAlso, it is lovely to see that they have given land to local people so they can build their houses and live on it. They take care of them financially and support them in other ways. They are trying to build a school where her mother teaches local children.\nI’m deeply engaged in the community, home to over 70,000 people. As a media professional and radio presenter, I’m dedicated to providing our community a platform to voice their concerns.\nOver the years, I’ve spoken to residents grappling with the pressing issues at the forefront of their minds. The cost-of-living crisis, escalating mortgage rates, and soaring rents. Access to quality healthcare, doctors, schools, and the environment weigh heavily on their hearts. Pollution in our rivers: Water companies are not held accountable, so close to home, we see the rivers that demands particular attention. Transport and the infrastructure to encourage more use of Public Transport.\nWe must get Britain building again, Switch on Great British Energy, Get the NHS back on its feet, Take back our streets and breakdown the barriers to opportunities.\nA Labour Government is desperately needed to address these challeng\nWith over 20 years of active involvement in the Labour Party and a background as a Councillor and Cabinet Lead for Transport, I support the vision for our country that includes the establishment of a publicly-owned energy company, Great British Energy.\nAs a Union member of BECTU Prospects and the Community Union, all champion self-employed and freelancers, the game-changing manifesto they worked on with the Fabian Society called the Progressive Plan for Self-Employed People in the UK is transformative.\nI am the chair of my local Co-op, and my mission is to tackle poverty, advocate for the rights of asylum seekers and refugees to work and vote, and support family carers who provide invaluable care and support to their loved ones.\nOur NHS needs rescuing from the clutches of the Tory Party; proper investment and an honest conversation with the population on levelling up must happen.\nI understand the pressures and responsibilities of representing the constituency in Parliament. I’ll fight for more attention from Westminster, ensuring our issues are solved.\nI still remember my roots, and with unwavering conviction, boundless energy, and profound dedication, I will work tirelessly to secure victory for Labour in the next General Election.\nTogether, we’ll stand strong and proud.. That’s what I will do. Hanif",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_11_09_hughes-center-makes-groundbreaking-proargi-9-discoveries/content_38.html": "Scientists at the Hughes Centre for Research and Innovation have made several remarkable discoveries on Synergy’s ProArgi-9+ formula, showing that ProArgi-9+ can do what l-arginine cannot do on its own. Following these discoveries, Nature’s Sunshine has filed a United States provisional patent application to ensure that Synergy maintains exclusive rights to this iconic formula.\nWhile the details of the patent application are not yet published, Dr. Matthew Tripp Nature’s Sunshine’s Chief Scientific Officer, shared some insights into their discoveries.\n“Numerous\nstudies have shown the cardiovascular benefits of l-arginine,”\nexplained Nature’s Sunshine’s Chief Scientific Officer, Dr. Matthew\nTripp. “However, our preliminary in vitro and human studies showed that\nthe unique combination of ingredients in our ProArgi-9+ formula enhances\nthe effects of L-arginine within the body in several ways.”\nSTUDY #1\nThe body converts the amino acid l-arginine into nitric oxide to support healthy circulatory and cardiovascular function. Although l-arginine alone can increase the surrogate marker of saliva nitric oxide, this is a gradual process. In testing ProArgi-9+, Nature’s Sunshine found that its formula significantly and rapidly increases the level of nitric oxide in the body.\nThe findings of this study are significant because other studies show that aging and poor diet can affect the metabolic systems responsible for producing nitric oxide, causing them to work less effectively. Healthy nitric oxide levels are important for proper vasodilation, along with blood pressure, muscle, heart and central nervous system function*\nSTUDY #2\nPrevious studies have shown that l-arginine has no significant effect on myeloperoxidase, an enzyme that inhibits nitric oxide production. Additionally, l-arginine has no significant influence on inhibiting the oxidation of LDL cholesterol. The Hughes Center’s preliminary study discovered that the unique combination of ingredients found in Synergy’s ProArgi-9+ potently inhibited myeloperoxidase and helps to reduce the oxidation of LDL cholesterol.\n“These groundbreaking studies are exactly what we hoped for when the Hughes Center opened its doors in February 2015,” said Dan Norman, President of Synergy WorldWide. “Thanks to Dr. Matthew Tripp and his team of skilled scientists, we can publicize the proven impact ProArgi-9+ can have on countless lives all over the world. This is exciting news, and we are eager to share it with individuals around the world with the hope of helping more people achieve optimal health.”\nTogether, the results of these studies indicate that the unique properties found in ProArgi-9+ positively impact cardiovascular health by supporting the production of nitric oxide and inhibiting myeloperoxidase. These findings support the use of ProArgi-9+ for optimal heart health.\nThe Hughes Center is revealing the power that lies in Synergy products. Synergy WorldWide is incredibly fortunate to have a brilliant and seasoned staff of scientists standing behind its products, providing telling research that reinforces Synergy’s mission to leave a lasting legacy of health around the world.\nFOR FURTHER INFORMATION PLEASE CONTACT HANIF KHAN\nMobile 07713151710\nEmail synergy@hanifkhan.info",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_09_18_black-history-month-do-you-think-more-black-history-should-be-taught-at-schools/content_20.html": "October is the month when Black History Month is celebrated in the United Kingdom. I was fortunate to be part of this celebration and joined the African diaspora in remembrance of this day to learn about its importance.\nThe event grew out of “Negro History Week,” the brainchild of noted historian Carter G. Woodson and other prominent African Americans, his work left an indelible mark ensuring the long and rich histories of black African Americans would never be forgotten.\nI believe more about Black History should be taught in our schools, if it does not fit into the curriculum at least celebrate it during the month in October and talk about the full story, such as colonialism, racism and not just the achievements.\nBearing in mind, some areas of our population in the UK are 10-15% non white, this to me enforces the fact we need to learn more about the origins of where the British people come from. Indeed, the contribution that black people have made to society recently is much more prominent, such as Dr King, Martin Luther King, Malcom X and Nelson Mandela. But we need to go back, way back to learn how slavery was abandoned and who were those amazing people who fought their way out of it.\nWe know that the Atlantic slave trade took place. With people being enslaved starting from Africa, coming down to America, Caribbean Island, and Europe, landing here in the United Kingdom. This needs to be put into the history curriculum. I believe we should not deny it, but look at the positives of black history and drive that forward and show how we came out of it. Who were those individuals that became great leaders, scientists, poets, writers and entrepreneurs.\nThis is all very important for the learning for children in today’s society, highlighting the high role models and inspiring them. With all the racism in the schools today its more important teaching black history we can teach that everyone is equal in this world and eradicate injustice.\nIf this can work, then widen it to other Asian communities so we can all learn to respect and live in peace.\nLove for all and hatred for none.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_04_08_synergy-an-introduction-to-the-acai-berry/content_28.html": "We’ve all heard about the acai berry and its superfood powers, but how much do you really know about this incredible fruit that has taken the nutrition industry by storm? Take a look at Synergy’s acai infographic for a few well-known and little-known facts about this magnificent little berry!",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_01_08_synergy-perfect-summer-slmsmart-recipes/content_25.html": "There is at least another month of blazing heat to survive before autumn kicks in, but a cold, refreshing smoothie or shake has the ability to make any stifling day tolerable. Pack your smoothies with as much nutrition as possible by adding SLMsmart Meal Replacement. You’ll get all of the vitamins and minerals provided in your regular smoothie ingredients, plus SLMsmart’s three-protein blend.\nGive these fruity SLMsmart recipes a try and they’ll quickly become your go-to summer meals:\nFor all recipes, simply blend and enjoy!\nPiña Colada\n2 scoops vanilla SLMsmart Meal Replacement\n½ cup pineapple, chopped\n½ frozen banana\n½ cup unsweetened coconut milk\n½ cup water\nChocolate Cherry\n2 scoops chocolate SLMsmart Meal Replacement\n1 cup unsweetened almond milk\n1 banana\n1 heaping cup frozen cherries\n3-5 ice cubes\nPeachy Green\n2 scoops vanilla SLMsmart Meal Replacement\n1 cup unsweetened almond milk\n1 cup frozen peaches\n1/2 cup frozen pineapple\n1/2 banana\n2 cups kale\nChocolate Covered Strawberry\n2 scoops chocolate SLMsmart Meal Replacement\n1 c. fresh strawberries\n1 banana\n¼ c. water\n2 c. crushed ice\nOrange Cream\n2 scoops vanilla SLMsmart Meal Replacement\n1/2 cup unsweetened almond milk\n1/2 cup water\n3 ounces frozen orange juice concentrate\n1/2 frozen banana\n3-5 ice cubes",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2016_12_17_my-thoughts-on-why-it-went-wrong-for-the-labour-party-general-election-2019/content_33.html": "When I saw the exit polls, like so many labour activists, devastation struck. I was saddened and surprised, and many thoughts went through my head. What will happen to the future of our nation, the vulnerable, the youth, our NHS and the effort on climate change etc. . . But, I had to accept the nation has spoken and to some extent, the uncertainty is over.\nBut why was there such a large loss when the Labour Party stands for ‘the many, not the few’. Established the NHS, improved worker rights and cared for the most vulnerable in our society and came from the grassroots of our country.\nTwo prominent factors seemed to be pushing through, Jeremy Corbyn MP and the Brexit result.\nJeremy Corby MP\nCaroline Flint who lost her seat in GE2019 said Jeremy Corbyn MP on BSkyB News on the Sophie Ridge show was a negative, even with armed forces families and did not see him as a leader. The ultimatum given to her by her voters was if she could guarantee that Jeremy Corbyn MP won’t be the Leader moving forward they would vote for her.\nSpeaking to a strong Jeremy Corbyn supporter after the results said, “I am devastated by the results and upset about the constant bad press and destruction of Jeremy Corbyn’s character. This should not happen and continuously toeing this line was wrong”.\nBrexit\nBrexit, this was the other reason which came up time and time again. The antagonism towards the labour party, frustrating Brexit and becoming a remain party overtly. This negativity was met with hostility made it hard to fight on the front line. Also, a point to note, there was not much change in the manifesto from the 2017 and 2019 election and the results in 2017 were nearly neck and neck. So, besides Brexit boiling over what was the difference in our message?\nIt seems that Jeremy Corbyn’s position to sit on the fence to unite the Labour vote, instead it united the Tory Party against us.\nAlso, in this General Election 2017, Caroline Flint lost her seat in Don Valley, which was a ‘leave seat’, she also voted for Boris Johnson MP withdrawal bill. And on the other hand, Richard Burgon MP for East Leeds won in the General Election 2019 which was 60% leave constituency.\nMy Conclusion.\nTo stop the continuous suffering, we need to stand strong. I believe there is no future for the Labour party if we water down our opposition to the conservative cuts, austerity, the inequality and the climate change challenge, which is on the way in the next few years.\nThe Labour Party will have to grow and regroup, start those community projects, soup kitchens, self-help movements etc. and return to the grassroots. Functional democracy requires strong opposition, and we won the argument, the debate has moved to austerity, corporate power, inequality, climate change.\nIn elections it’s not about winning the argument, it’s about winning the, votes and we did not do that. We should take the best bits of our manifesto and move towards the centre of the political spectrum and take the fight to the Tories. I am ready, are you?\nWho should be our next Leader?\nI believe it should be a female leader, someone from the north, with lenience to remain and can take the party more towards the centre. Producing a withdrawal agreement that protects businesses, the economy, worker rights and Climate Change. I have always believed we are stronger together.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_2012_02_12_hello-world/content_34.html": "Held on Friday 24th February 2012 at 6:00pm for 6:30pmPeace Loyalty Freedom Equality Respect Peace Loyalty Freedom Equality Respect\nAt Baitul Wahid, Raleigh Way, Hanworth Park, Feltham, Middx, TW13 7NX\nMain Purpose of the Event:\nRespect Peace LoyaltyFreedom Equality\nAGENDA:\n- Tilawat by Mr. Shafi Khokhar\n- Translation by Dr. Shirjeel Tahir.\n- Welcome address by Regional Amir Mr. A. Latif Khan\n- Address by Ms Mary Macleod (MP Brentford & Isleworth) (3 mins)\n- Address by Cllr Amritpall Sing Maan (Mayor Hounslow) (3 mins)\n- Address by Mr Jagdesh Rai Sharma (Leader of council) (3 mins)\n- Address by Ms Seema Malhotra (MP Feltham & Heston) (3 mins)\n- Key note address by Hazur (atba)\n- Gift from Hazoor (atba) (arranged by Jamaat Ahmadiyya UK)\n- Silent Prayers\n- Dinner with the guests\nWelcome address: Mr Abdul Latif Khan He said:\n‘For more than 40 years we have built very good links with our neighbours, friends and local communities. These have included people of all faiths and of no faith, councillors and members of parliament and I am delighted that so many of our friends are here with us today, for which I am grateful. We cherish your friendship’.\nHe finished by saying…\n‘I hope that this is the first of many visits\nto this mosque. Its doors, like our hearts are always open to you all. Thank\nyou’.\nMary Macleod MP Brentford and Isleworth\nin the eastern part of Hounslow said:\n‘A special and wonderful event honored\nto be at the inauguration of the mosque especially in the presence of His\nHoliness, Hadhrat Mirza Masroor Ahmad’.\n‘I appreciate the inclusivity of your community that\nwelcomes all people as you have done today in a spirit of true togetherness friendship\nand mutual respect’.\nShe was delighted to be part of peace initiative where branded buses on local bus routes in London, with a message ‘Muslims for Loyalty, Freedom and Peace’. Which helped to reassert the Islamic principles of peace and aims to counter the extremist who seek to hijack the faith for their own ends’.\nWebsite for bus campaign:\n‘Today more than ever we need to focus on helping and working one another we need to share the skills, ideas and aspirations of all of us with successful and inovaitive solutions to challenges that we face’.\n‘Championing ‘The big Society’, a cultural change, a liberation, a redistribution of power from central government to the man and women on the street. Its about people take responsibility of the way they live their lives, bringing back the true community spirit. I believe the openness of the Ahmadiyyah muslim community and the emphasis of working hard to make the world a better place are perfectly positioned to support these goals to build a strong society’. For example, the youth group organized feed the homless distribution session in hounslow south, support for selling poppies for the biritsh leigions and regular blood donations at mosques’.\nCllr Amritpall Sing Maan, Mayor of Hounslow\n‘The Ahmaddiyah community in Hounslow is a modeled community and excels in getting things done. The bus campaign started their journey from the hounslow Civic Centre and was very proud for this to happen’.\n‘There are a lot of things the Ahmaddiyah Muslim community should be very proud of, the message Love For All Hatetred For None, a universal message. The way they go about selflessly to help others, humanity first is a charity which regardless of race, religion and creed goes out to deliver a humanitarian call to all that require it.’\n‘This is a fine institution and is the heart of a community, and a community which Hounslow is proud of. We want to work closely to together to ensure humanity is served and as friends continue to deliver a message of peace and hope’.\nMr Jagdesh Rai Sharma – Leader of council\n‘The inauguration of Baitul Wahid Mosque is truly an event to be celebrated and one of which Hounslow Borough is proud to be associated with’.\nYour community in Hounslow, UK and across the world has earned the distinction of being known as Law abiding, peaceful, persevering and benevolent community, what a wonderful set of values for us in the bourough to aspire to.’\nThrough this association I know the outstanding work that has been done internationally and locally it is highly appreciated. Here in Hounslow the Ahmaddiyah Muslim community in Hounslow has been a pillar of the community playing a major roll in charitable, community events and projects to help those people who need help and support.\n‘The selfless service shows both fair-mindedness and commitment to the community in helping the country you have chosen to live in’.\nMrs Seema Malhotra (MP Feltham & Heston) (3 mins)\n‘Thank you all for the invitation today to the opening of Baitul Wahid mosque in Hanworth Park\n‘This is an example of what the Ahmadiyyah Muslim Community does in the way of brings together all backgrounds all faiths in something that brings us together as a community. ‘Its wonderful that this mosque will serve as a place of worship and community centre which will educate and bind our community together’.\nHi, this is a comment.\nTo get started with moderating, editing, and deleting comments, please visit the Comments screen in the dashboard.\nCommenter avatars come from Gravatar.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_privacy-policy/content_4.html": "Urgent Action Needed to Stop Sewage Overflow into Hogsmill River & Green Lanes Stream\nIn support of the change.org campaig to prevent sewage overflow into Hogsmill River & Gree Lanes Stream\nI wrote to Chris Weston CEO of Thames Water.Thames Water should not be using the Green Lanes Stream and the Hogsmill River in Epsom & Ewell and Kingston Boroughs, as open sewers.\nThe Hogsmill is one of only 200 chalk streams in the world and used to be teeming with wildlife. Yet, it is now so polluted that warning signs advise people and their pets to stay out.",
  "https_hanifkhan_co_uk_/https_hanifkhan_co_uk_en_privacy-policy_page_4/content_22.html": "There is at least another month of blazing heat to survive before autumn kicks in, but a cold, refreshing smoothie or shake has the ability to make any stifling day…\nThere are lots of different types of coverings worn by Muslim women all over the world, from the Middle East, to Africa, to Indonesia. Some have many colours besides the…\nThe Ahmadiyya Muslim Community in the Hounslow Borough expresses its utter abhorrence of the carnage that was carried out in Paris last night. The World Head of the Ahmadiyya Muslim…\nThe Ahmadiyya Muslim Community in Hounslow North, supports the Government's action to root out extremism. Mr Zia Qureshi President of the Ahmadiyya Muslim Community in the Hounslow North said: “Any…\nA candlelight vigil for victims of the Nepal earthquakes was held this weekend. Many people, from all backgrounds came to gather in Church Square, outside Holy Trinity Church, in High…\nHeld on Friday 24th February 2012 at 6:00pm for 6:30pmPeace Loyalty Freedom Equality Respect Peace Loyalty Freedom Equality Respect At Baitul Wahid, Raleigh Way, Hanworth Park, Feltham, Middx, TW13 7NX…"
}