{
  "https_hantsind_com/https_hantsind_com_what-does-the-internet-tell-us-about-covid-case-numbers/content_166.html": "Firstly, I want to be clear, I am not a doctor or a medic, however I am a scientist, a computer scientist. I have spent my life building things with computers to solve problems, and in doing this you get to learn a lot about the world. If you came here looking to hear “Donald Trump solved Covid” or “here is some wonder drug”, I am sorry you are going to be disappointed. I want to talk about something called graph theory and the physics of phase transitions.\nLet’s start with some basics, when I say “graph”, I am not talking about a chart of any kind, but a mathematical graph, they look like this:\nA set of vertices (the points) connected via edges (the lines). You can read a bit more about them online just search for “graph theory”.\nNow the structure of the internet can be thought of as a graph, there is a series of computers connected via network links together. The origin of the internet goes back a long time. It was designed as a communications network that could withstand a nuclear war but would still enable the military to communicate. The intention was that if one network link went down, the systems would attempt to route via another link.\nThere is no central authority that designs the internet, each network provider adds the routers and nodes it needs to function and service their users. This splits the internet into domains for each service provider with various interconnections internally. We would mathematically describe these domains as random graphs, (as the graph lacks a uniform structure). Each of these domains are then connected to form the internet as we know it. The internet is essentially a random graph of random graphs, (a weighted undirected random graph of weighted undirected random graphs if we want to be precise).\nNow random graphs are surprisingly common in the world. You may have heard of the idea of the “six degrees of separation”, the idea that you can connect to any other person in the world through a maximum of 6 hops through friends. Your network of friends, contacts and acquaintances is a random graph (again because the graph lacks a uniform structure). There are also games you can play like working out an actor’s “Bacon Index” which is how close someone is to co-starring in a film with Kevin Bacon. Someone who starred in a film with Kevin Bacon gets a Bacon Index of 1. Another actor who starred in a film with actor B where actor B starred in a film with Kevin Bacon gets a Bacon Index of 2 and so on.\nOne very interesting property of random graphs is how resilient they are, you can drop parts of them out left, right and centre and still easily be able to get from one side to the other. Some estimates suggest that at any point in time 3% of the internet is not functioning, and nobody even notices. The internet very much achieved the early aim of being resilient and able to withstand a nuclear attack. However, as you can imagine, resilience does not last forever. While continually removing parts of it at some point the graph will undergo something called a phase transition. This is a term borrowed from physics, where a process rapidly undergoes a transition from one state to another. An example of this is water boiling, you add heat to water for a period and nothing really happens other than the water gets warmer. However, you get to a point and just a little more heat causes the phase transition and the water boils. When you boil water in a saucepan you do not see the water slowly start moving and then getting faster and faster. You may see the odd air bubble, but that is it, the water stays still. It hits a point then boils, and we see it animatedly jumping around as it boils. The breakdown of a random graph occurs like this too, we keep slowly breaking parts of it, and you can find alternative routes, the basic properties of the graph remain the same. Eventually the graph goes through one of these phase transitions and breaks, it very quickly goes from a functioning graph to a collection of disconnected vertices (it is no longer a graph).\nWhy is this relevant to Covid? Apart from a joke about Donald Trump I have not mentioned Covid at all. Well, let us think about the transmission of Covid. Covid is transmitted from an infected person to another where the other person is not immune. Kind of like a message going from one computer to another on the internet. We can have outbreaks of Covid in care homes, a specific cafe or pub or a workplace. These are very much like the structure of the internet, there is a specific set of people going to care homes, but between these contacts there is no structure (a worker can be in touch with 50 people, an elderly resident may only be in contact with a handful). The network of people going to a care home is a random graph much like say BT’s bit of the internet infrastructure. Maybe a person who picks up Covid in a care home then goes to a cafe or a supermarket (another random graph) and passes it on, much like the random graph of random graphs structure of the Internet.\nSo why is this relevant? Well, it is all about the reliability of random graphs, at any one time 3% of the internet is down and nobody notices, so 3% of the population could be immune to Covid and it would have no effect (other than to the individuals immune). The bigger point to make is how resilient the transmission of Covid could be to vaccination. On the negative side, this means we would need to make a lot of people immune before there was any real impact. On the positive side, we could expect the graph of infections to go through the same phase transition that the breaking of the internet could go through once enough immunity is reached to break the graph, the pandemic should rapidly end.\nNow this thought came to me as I was walking to the shops on Monday 19th July 2021, it is now Saturday 24th July. Today the UK government has announced 31,795 new positive tests, a week ago it was 54,674. That is a drop of nearly 23,000 cases in a week (positive tests per day). At no point in the pandemic have we seen the cases increase at the rate we are now seeing them decrease, (previously the decrease was always much slower than the increase). This is following a hugely successful rollout of the vaccination in the UK. On the same day (24 July) 88% of the population have had one dose of the vaccine and 69.9% have had their second dose. With the number of people who have some degree of natural immunity adding to this, a very significant percentage of the population will now be immune.\nNow I am not a medical professional, but could the internet and a little bit of physics now be telling us that the pandemic in the UK is beginning to end?\nAs the first person to mark you down Scott, I feel obliged to explain why. Your exposition of the theory of graphs and breakdown thereof is a fresh slant on the issue and well made, But I wish you hadn’t been put off by your lack of medical training from investigating further. I too have no medical training (but I am human and I nurture my immune system, so I’m not entirely ignorant). I also underwent a very rigorous grounding in the matter of statistics when I was at college, and I am appalled at the obvious massaging of the… Read more »",
  "https_hantsind_com/https_hantsind_com_membership/content_59.html": "membership\nWe help our members achieve their goals for their community. We can help showcase your cause, provide you with space on our site, help design and print promotional material. We can help you understand the rules for elections and campaigning and connect you with other members that share the same goal. Our team don’t take a single penny for this, we do it so the places we live can be made better. However, hosting this website costs, keeping our registration with the electoral commission costs, printing material costs, hosting events costs. We ask people to donate and to become members to help with these costs.",
  "https_hantsind_com/https_hantsind_com_author_scott-neville_page_1/content_170.html": "We are pleased to be announcing our candidates standing across the county in the general election!\nAuthor Archives: Scott Neville\nWith fraud at a record high and the majority of people received fraudulent text messages, what can we trust and why do we trust it?\nDiscover why it’s important to accept that humans are fallible, and what history can tell us about our own ignorance.\nWe are pleased to be announcing our candidates standing across the county in May 2022!\nCllr Andy Moore tells us about his work with Bishopstoke Parish Council.\nWe have asked our candidates, members and friends for their hopes and predictions for 2022. In this edition we have Spencer Cleary & Scott Neville\nI am opposed to the introduction of vaccine passports, I want you to help me.\nNow I am not a medical professional, but could the internet and a little bit of physics tell us something about the pandemic?\nWe are pleased to be announcing our candidates standing across the county in May!\nWe are delighted to announce that councillor Andy Moore is joining Hampshire Independents.\n- 1\n- 2",
  "https_hantsind_com/https_hantsind_com_policing/content_34.html": "we promise\nVisible policing\nMore visible policing in high traffic areas such as our town centres, including evenings and weekends. No one should fear the police, but no one should fear other too.\nfocus\nFocus should be given to high impact crimes, the mental scars from burglary can be just as bad as the physical ones from violent crime.\ncleaner than clean\nWe support our police, we understand their job can be near impossible sometimes, but we cannot tolerate corrupt police officers.",
  "https_hantsind_com/https_hantsind_com_author_scott-neville_page_2/content_169.html": "We are pleased to announce our first spokesperson.\nAuthor Archives: Scott Neville\nThis has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.\nBusiness Improvement Districts or BID’s have been around since 2003, but you may not have heard of them unless you have experience of one.\n- 1\n- 2",
  "https_hantsind_com/https_hantsind_com_tag_bid/content_20.html": "Business Improvement Districts or BID’s have been around since 2003, but you may not have heard of them unless you have experience of one.\nBusiness Improvement Districts or BID’s have been around since 2003, but you may not have heard of them unless you have experience of one.",
  "https_hantsind_com/https_hantsind_com_global-climate-change-is-happening/content_149.html": "Wind farm and solar electricity is much more efficient, but green energy is still only part of it. We need to develop an environmental attitude to where we buy our goods and services.\nI am a scuba diver, as such I see the environmental damage that is happening across the planet’s oceans. It is disgusting the amount of pollutants and plastics that are pumped into our seas.\nWe, as a nation, must stop buying products from countries that cause the majority of this mess. One example is the Indian, Chinese and Asian clothing market. That business is the second largest polluters after the oil industry. Huge amounts of untreated contaminants are pumped into the environment unchecked. That industry will only clean itself up when consumers force it to. The only way business listens is when it affects their bottom line. We, the consumer, have the power and responsibility to change things. We must look at where our purchases come from and how they are produced. Manufacturers in the UK are already using more and more biodegradable packaging and green production methods. The carbon footprint of transportation is the lowest it could possibly be. British products might be a little more expensive, but long term, it is worth it for a clean planet.\nHampshire Independent councillors will fight for locally produced products and services to be used by local councils. Where possible insisting on Hampshire made products and Hampshire based services. This is good for the local economy, good for the environment and good for local moral.\nWe insist that the tax payer’s money, raised by councils, is used to support local industry, enriching local communities with safe and secure employment, producing a pride and community spirit – all but lost under the present bi-party political system.\nI agree with about 25% of what Alan says here, the country-side, atmosphere, waterways and seas must be protected from waste and chemical pollutants. Where I disagree is: Alan drops in the expression ‘climate change’, why? Is he inferring that this mess that he sees is mostly or even partly due to man-made Climate Change (anthropogenic global warming caused by infra-red active gasses) – that story is man-made fiction Solar panels and wind farms are not more efficient, if they were then they wouldn’t need subsidising with the Green levy in all business energy bills – ‘The Customer always pays’.… Read more »\n‘Climate change’ and pollution are two different things. This article is mostly about pollution. There clearly is a problem with that which needs resolving. Whether there is a real problem with global weather changes is not so black and white. Like some of the aspects of COVID policy politicians like to present ‘Climate change’ as settled science. It certainly isn’t. Let’s not be fooled on this issue, by forces who have other agendas, in the way we have been with COVID.",
  "https_hantsind_com/https_hantsind_com_2019_12/content_72.html": "This has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.\nThis has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.",
  "https_hantsind_com/https_hantsind_com_important-lessons-we-can-learn-from-history/content_130.html": "I am thankful that Jim shared his thoughts about “The Mix of Propaganda and Predictions”. It was an interesting read, but I think he missed something with the example he selected. Hanlon’s Razor should have been employed: “never attribute to malice that which is adequately explained by stupidity”.\nWhy is this important? Well, using the issue of climate change as Jim does, he correctly lists a series of predictions from 1970 onwards. The problem is, he attributes them to propaganda rather than stupidity. In the 1970’s, scientists did believe that the earth was cooling; this was an empirical fact according to the measurements taken. At the time, many prestigious institutions agreed and supported this, stating that by 2020 a new Ice Age was likely to occur in Europe. Now, step forward a good old enemy of science… bias. For somewhat obvious reasons, the most reputable universities in the world are in Europe and the US, (populations don’t worry too much about building universities unless they reach a certain level of economic development). Both Europe and the US are in the northern hemisphere, and a similar study conducted in New Zealand managed to empirically prove the exact opposite of the cooling story; the atmosphere was warming.\nHow can the earth be both cooling and warming simultaneously? Simple, there was another factor in the atmosphere which was unaccounted for: smoke. It was subsequently discovered that smoke particles in the atmosphere,which were vastly more present in the US and Europe due to industrial development, repelled more heat than greenhouse gasses contained. Therefore, both studies were correct to indicate in the northern hemisphere that the temperature was decreasing, whilst in the southern half it was increasing.\nThis whole issue of the earth cooling was therefore stupidity rather than malice. With the various clean air rules enacted over Europe and the US, (removing the smoke from the air), the observations changed in the northern hemisphere, therefore, the atmosphere was warming.\nWe arrive in the present day with the phrase “trust the science”, (the most anti-scientific statement that anyone can utter, although possibly beaten by “the science is settled”). Indeed, I would say “the science”, is the fastest growing religious cult in the world. As soon as we enter this mindset of “the science is settled”, or “trust the science”, we close our mind to the possibility we are wrong. We look back on the Victorians, Middle Ages or the ancient world, and think, “how could these people be so stupid believing X, Y or Z”? Do we really think future generations won’t look back and not say the same about us?\nRemember, in 1608 the science was settled; the Earth was the centre of the universe. Even in 1616, the idea that the earth was not the centre of the universe was “foolish and absurd”, despite being correct. Note: The heliocentric model proposed by Galileo was incorrect, because the Sun itself is not the centre of the universe. However, it is fair to say, his theory is more correct than stating the earth is the centre of the universe; the idea that the earth orbits the sun was correct.\nThe scientific method has given us a wonderful ability to test specific claims, and prove truths about the universe we inhabit. It was true that the air temperatures were cooling in the 1970s, but we can never assume that it tells us everything. We should do what we can to make our world a better place, that means using science to guide us, but not following it as a cult. After all, we should all remember the motto of the Royal Society, the oldest continuously existing scientific academy in the world. Their motto is: Nullius in verba – Take nobody’s word for it.\nI am not sure if you are explaining the changing view of science or claiming that science is a cult with no more basis than belief in unicorns. Science is not an unchanging body of knowledge which can not be contradicted: that sounds more like a cult. Science is a process. There is a truth somewhere. Each time a new discovery is made some part of science is found to be wrong, or at least incomplete. An example. Anyone with children over about 35 will have been told to put their babies to sleep face down. This was based on… Read more »\nI am claiming a distinction between “The Science” which is a religious cult and the scientific method which is a process by which we can test specific ideas to try to establish what is true. People that go round shouting “Trust The Science” have their mind closed to the possibility that they are wrong. We should question things, if there if the questions are misguided or have other flawed understandings in them, then the proof will stand up. If the proof is questionable (which many papers are now and has caused what some have called, the replication crisis https://www.science.org/doi/full/10.1126/science.aal3618 ),… Read more »",
  "https_hantsind_com/https_hantsind_com_tag_hampshire-county-council/content_120.html": "Announcement, ElectionsCouncillor Andy Moore is joining Hampshire Independents Posted on March 18, 2021March 18, 2021 by Scott Neville 18 Mar We are delighted to announce that councillor Andy Moore is joining Hampshire Independents. Continue reading →",
  "https_hantsind_com/https_hantsind_com_find-events/content_84.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nFind Events\nWe host social and political events all over the county. The major parties offer a social life to make you feel part of something, we want to bring that to all Independents.\nClick to Tweet\nFind Events\nWe host social and political events all over the county. The major parties offer a social life to make you feel part of something, we want to bring that to all Independents.\nClick to Tweet\nNo events at the moment 🙁\nSign up to our mailing list below and be the first to find out!\nBuy Tickets / Find out more\ndownload promotional pack now\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_cutting-edge-fabrics-basingstoke/content_40.html": "This week our beloved fabric shop, Cutting Edge Fabrics, closed after fifteen years of successful trading in Basingstoke.\nCutting Edge Fabrics has been a mainstay of the Brighton Hill shopping centre in Basingstoke since 2007. It is a thriving business with a far-ranging customer base. So you might be wondering why they had to close? The answer is simple: their lease came up for renewal, and the lease holders have increased the rent – making it too expensive to run the store any more. Also, the business owners are in their seventies, and understandably want to avoid signing another fifteen-year contract.\nIt is a massive blow to the people of Basingstoke and the surrounding areas, because people come from all over the county to shop there, as they were the best and only haberdashery shop around for miles. In July 2019 we lost Fabric Land in Festival Place for similar reasons.\nUnfortunately, they have yet to find alternative premises anywhere in the town. They were hoping to move to the town centre, but even the top of the town is too costly. What I cannot understand is why these management companies prefer to have large empty units rather than busy shopping centres. Surely, it is better to have consumers flooding into commercial centres rather than going online or elsewhere?\nAs it stands, now that Cutting Edge Fabrics has closed our nearest stores are in Newbury and Waterlooville – which are hardly on our doorstep! Both destinations are a bit far to go for a replacement zip or button.\nPlus, as a textile enthusiast I understand the importance of accurate colour matching. The closure of the store is a huge disappointment, because the textile trade has always been a tactile business. Fabric needs to be touched and felt because it is an intimate experience. Fabrics clothe us and help us present ourselves to the world. We can control our image via the clothes we wear. The loss of the store means that this task is inevitably much harder.\nWith the current cost of living crisis it is vital that we can prolong the life of our curtains, clothes, and furniture. Making do and mending may come back into fashion as we are all forced to economise.\nAround forty years ago, Basingstoke town centre was a hub for small businesses – with over two hundred stores at the top of the town. Now there’s just twenty. Why are costs so prohibitive that even a profitable business like Cutting Edge Fabrics is unable to afford to rent it?\nIf I were in government, I would enable small businesses to flourish in our town centres by introducing flexible terms and shorter leases of five years. This would give them the flexibility they need, whilst also encouraging shoppers back into our commercial centres. This is preferable to the sea of empty units we currently see around the country – or the endless chains and charity shops. If nothing is done to curb this, then we are going to see the steady decline of our high street which will be a huge loss to us all.",
  "https_hantsind_com/https_hantsind_com_tag_energy/content_29.html": "OpinionThe Energy Bill Posted on September 23, 2023September 23, 2023 by James Makin 23 Sep The Energy Bill, part of our “national security and investment policy”? Continue reading →",
  "https_hantsind_com/https_hantsind_com_lucys-london-marathon-4-wessex-heartbeat/content_99.html": "On Sunday 3rd October I am due to run the London Marathon on behalf of Wessex Heartbeat. After six months of training I am finally ready to take on what will be my longest run – ever. I am delighted to have chosen to represent a charity which means so much to myself and my family.\nIn 2016, my mother was referred to Southampton General Hospital for urgent heart surgery. She was struggling to walk and breath normally, which meant that a short walk up the road would completely exhaust her.\nIn total, she required at least four major operations: from heart valve repairs to a heart valve replacement – and an operation to correct the rhythm of her heart. She was in the operating theatre for most of the day, and afterwards spent a couple of weeks recovering in the hospital.\nI am so grateful that the consultant at Frimley Park Hospital referred her when he did because who knows if she would still be here today?!\nThe charity supported myself and my family throughout her stay in hospital by providing accommodation at their Heartbeat House in Southampton. Thanks to their generosity, I was fortunate to be able to visit my mother at any time – day or night. Without their support, I would have had to have commuted from Farnborough to see her. They therefore saved me lots of time, money, and stress. I’m convinced that it also aided in my mother’s recovery, because she knew that we were close by and could help her with whatever she needed.\nToday she is fully recovered and is exercising regularly, which is great to see because she is so much happier and healthier. Plus, she has made new friends by joining regular cardiac rehabilitation classes. These classes provide invaluable advice, support, education, and physical activities to help people to take control of their health and wellbeing.\nAs this year is the fifth anniversary of my Mum’s operation, I am thrilled to be fundraising for Wessex Heartbeat, so that more people can benefit from their amazing support. They literally change peoples’ lives.\nTo donate to my fundraising page, please visit:\nhttps://uk.virginmoneygiving.com/CanaryJamMedia\nWessex Heartbeat:\nhttps://www.heartbeat.co.uk/Event/2021-virgin-money-london-marathon",
  "https_hantsind_com/https_hantsind_com_tag_havant/content_68.html": "Announcement, Elections2022 Local Election Candidates Announced Posted on April 9, 2022April 9, 2022 by Scott Neville 09 Apr We are pleased to be announcing our candidates standing across the county in May 2022! Continue reading →",
  "https_hantsind_com/https_hantsind_com_category_opinion_page_1/content_56.html": "Jim takes reviews the bills passing through parliament and asks if the surveillance state is incoming?\nCategory Archives: Opinion\nJim takes a look at the history books to review what is going on in Israel and Palestine\nDominic Cummings – one-time evil guru of Downing Street, or saviour of the Tory government?\nThe Energy Bill, part of our “national security and investment policy”?\nWith fraud at a record high and the majority of people received fraudulent text messages, what can we trust and why do we trust it?\nDiscover why it’s important to accept that humans are fallible, and what history can tell us about our own ignorance.\nJim Makin discusses propaganda and how that might relate to predictions made in the past. First published in the Alton Herald.\nWe all make assumptions about politics, but how often do we check they are correct?\nThis week Jim shares his reflections on the Covid pandemic – previously posted in the Alton Herald.\nJim Makin shares his thoughts on being independent with us after it was posted in the Alton Herald",
  "https_hantsind_com/https_hantsind_com_sarah-everard-vigil-police-watchdog-report-reaction/content_95.html": "I welcome the report that confirms the police acted appropriately at the Sarah Everard vigil. Most protesters behaved in a ‘dignified and respectful’ manner. It usually is the case that it’s the minority few that spoil it for all, as it is clear in the findings.\nThe media without a doubt showed the police in a terrible light, and it was concerning. However, the report commissioned has shown that the police acted appropriately.\nWithout confusion in the law, a Peaceful protest could have gone ahead. I still question the leadership shown over protests in the last few years, but as I hoped the rank-and-file bobby did not disgrace themselves.\nAgain I say, ‘is it that the police always appear to be working between the Rock and a hard place throughout this pandemic?’ I believe blame should be levelled at politicians that made a law which the police are expected to enforce yet criticize them as soon as they enforce those laws at a politically sensitive protest.\nIs Government to blame? Should a report be commissioned with why there was such a confusion in the law? That will never happen for sure.\nAnyway, one thing is very clear from the report, let’s not judge until all the evidence is before us.",
  "https_hantsind_com/https_hantsind_com_tag_rubbish/content_75.html": "With our waste recycling centres (previously known as “the dump”) now charging for certain types of waste to be discarded, there is no doubt that this has increased the number of fly-tipping incidents that have happened in and around Basingstoke. Add on to that the long queues to get into the dump, that are a",
  "https_hantsind_com/https_hantsind_com_andover-bid/content_47.html": "Business Improvement Districts or BID’s have been around since 2003, they were introduced in the Local Government Act 2003 but you may not have heard of them unless you have experience of one. The concept of BID is not actually bad. The government defines a BID as:\nBusiness Improvement Districts are business led partnerships which are created through a ballot process to deliver additional services to local businesses.[1]\nOn the face of it this looks like a good idea and in many cases BID works out really well. For example, in my home town of Basingstoke, the local BID “Basingstoke Together” appears to be very popular with only 5-star reviews on Facebook. Earlier this month another BID only 15 miles from me won their ballot in Andover but with much more controversy. But why does something with such noble sounding intentions and positive results elsewhere attract controversy?\nThe BID in Andover started around 12 months ago, there are a number of ways that a BID can be started:\nA Business Improvement District can be set up by the local authority, a business rate payer or a person or company whose purpose is to develop the Business Improvement District area, or that has an interest in the land in the area.[2]\nThe critical part is “the local authority”, BID does not necessarily have anything to do with businesses and this is the case in Andover. Test Valley Borough Council (TVBC) have been massively invested in the project for a year before the ballot even took place. Back in October 2017 TVBC committed, £50,000 in Tax Payers’ Money to support the BID[3]. This was given to the BID consultants CMS. Before this money was made available TVBC Councillor David Drew told us “Evidence shows that a BID ballot is significantly more likely to succeed with the help of expert consultants”[4]. This on it own implies that a BID ballot will not be successful on its own merits, hence the need for £50,000 of tax payer’s money to get the process through. Andover BID freely admits in its prospectus that this will not be returned to the council[5].\nWe should of course first ask why the council is spending all this money on something for businesses? Why are the businesses themselves not funding this? Well the answer may shock you. In the Andover BID prospectus, they report “Over 207 written responses to consultation from businesses with RV of over £5000”. Yet only businesses with a rateable value of over £10,000 will have to pay the BID levy, interestingly some of those businesses were not consulted not given the proper documentation[6]. But why would it be in CMS’s interests to do so? If the BID gets a yes vote, the chances are they will get more work setting the BID company up. You can clearly see this vested interest in the map of the BID area[7]. The BID area contains a number of car parks, Andover college, but bizarrely misses out ASDA. Or is that so bizarre, when you consider that ASDA has a history of voting down BIDs which earned them a call to be boycotted in Bedminster[8].\nThe next twist is the car parks, which are owned by TVBC. The combinations of properties that TVBC own in the BID area means when it comes to the ballot they get to vote 13 times[9]. To put this number into perspective, there were only 137 votes cast, 13 of these were by TVBC that is almost 10% of the votes being the council votes. The vote was subsequently won by only 3 votes. How can it be democratic that a council who wants support for their project be allowed 10% of the votes? If that is not underhanded enough, TVBC is currently controlled by the Conservative Party, but the Conservative Party HQ will not have to pay the BID levy as it just happens to fall outside of the BID area[10].\nThe impact is already being seen on the high street, the BID will mean all businesses with a rateable value above £10,000 will need to pay a new tax in addition to their existing taxes. Reading the BID prospectus, the levy will be due in advance and must be paid as a one-off lump sum payment. Some retailers are already scaling back their community activities so they can cover the BID cost, since 2013 Andover has a “Remembrance Day Window”, funded by one of the local businesses. Sadly, the money they allocated to that now has to go to BID[11].\nBIDs are voted back in every 5 years across the country because the deliver value to the businesses they serve. Clearly this is not the case in Andover where, like HS2, a vanity project of the local council is a perfectly acceptable reason to spend a load of tax payers money.\n[1] https://www.gov.uk/guidance/business-improvement-districts#overview\n[2] https://www.gov.uk/guidance/business-improvement-districts#how-is-a-business-improvement-district-established\n[3] https://www.testvalley.gov.uk/news/2017/oct/a-bid-to-become-a-bid\n[4] https://www.testvalley.gov.uk/news/2017/jun/andover-s-bid-to-become-a-bid-takes-another-step-forward\n[5] http://www.andoverbid.co.uk/wp-content/uploads/2018/09/0065_Andover_business-prospectus-FINAL.pdf\n[6] https://www.andoveradvertiser.co.uk/news/16693375.business-owners-walk-out-of-aggressive-final-bid-meeting/\n[7] http://www.andoverbid.co.uk/bid-boundary-map/\n[8] https://www.bristolpost.co.uk/news/bristol-news/boycott-asda-call-fury-grows-1391271\n[9] https://loveandover.com/news/local-news/andover-businesses-claim-immoral-use-of-tvbc-votes-13910/\n[10] https://loveandover.com/news/local-news/andover-bid-underhanded-and-town-council-support-questionned-12494/\n[11] https://loveandover.com/news/local-news/annual-remembrance-tribute-removed-because-of-bid-13887/",
  "https_hantsind_com/https_hantsind_com_basingstoke-social-august-2021/content_97.html": "Since the lockdown rules have been relaxed, we have now organised our first social outing and we would love for you to join us. You don’t need to be a member or have been deeply involved, if you just fancy a meal and a chat about local issues with others that care, feel free to come along.\nWe are hosting a curry night on Wednesday 18th August 2021 in Basingstoke (top of town) starting at 19:30. We have booked lots of space, but there is a limit and it is first come first serve.\nIf you are interested please email us info@hantsind.com or contact us to let us know you would like to come (and how many). We will then confirm the venue if there is space.\nWant to know about future events early? Join our mailing list at the bottom of any page, we give everyone on our mailing list at least a weeks extra notice!",
  "https_hantsind_com/https_hantsind_com_looking-for-something-different/content_107.html": "For many years, Hampshire has watched developers change the faces of our cities, towns and countryside. A growing population demands that we change with the times. But change for the worst, is what many fear is happening now.\nMass housing developments across the county are failing to meet the needs of the people, particularly if support systems such as infrastructure and employment are not upgraded and improved. Consequently, our environment suffers which in turn impacts upon people’s lives and health. Indeed, many new developments are not served by public transport, so residents rely upon their cars to go out to shops, schools, doctors and to socialise.\nThe Westminster based parties who call upon you and demand that you vote for them, are taking your support for granted at each election where they promise you what you want to hear and subsequently fail to deliver and represent your views. Never so more when it comes to planning the future of our county, do you, the people of Hampshire deserve to be represented by politicians, free of the old political allegiances and tired dogma.\nHampshire Independents are made up from local taxpayers from across the political spectrum, who just like you, live in the real world with all of the highs and lows of the world of family, work and unfortunately for increasing numbers, unemployment due to covid.\nIf you are one of those people who are fed up with the same old party politics and tricks that bring development and the unwanted chaos of poor planning, there is now a credible alternative. You can vote for an independent candidate who has the support and backing of independently minded people.\nNow that’s different.",
  "https_hantsind_com/https_hantsind_com_the-mix-of-propaganda-and-predictions/content_61.html": "In this article I consider the subject of propaganda – that feat of public delusion often attributed to Joseph Goebbels. How was this feat performed?\n“Tell a lie big enough and repeat until people believe it.”\nNow I’m not saying that all TV advertisers are liars, but they sure do believe in the power of repetition. It works!\nHowever, so as not to impugn the integrity of TV advertisers, we must look elsewhere for suitable illustration. Let’s see … something really big, truly humongous, totally implausible … and endlessly repeated …\nYes! There is one stand-out candidate: Climate Change!\nLet’s check the record of past press predictions …\n1970: New Ice Age by 21st Century\n1972: New Ice Age by 2070 (Brown University to the President of the USA)\n1974: New Ice Age Coming Fast\n1978: ‘No End in Sight’ to 30-Year Cooling Trend\n1988: Prepare for Long Hot Summers\n1988: Maldives Completely Underwater in 30 yrs\n1989: New York City East Side Highway underwater by 2019\n2000: Children won’t know what snow is\n2004: Britain to have Siberian Climate by 2020\n2008: Arctic Ice-free by 2018\n2008: Ice-free arctic by 2013 (Al Gore)\n2009: 96 months to save the world (Prince Charles)\n2009: 50 Days to save planet from catastrophe (Gordon Brown)\n2014: 500 days to avoid climate chaos (Laurent Fabius / John Kerry).\nTrue, the IPCC did not support all these claims (which is not to say that the IPCC is blameless) but recall that my topic is propaganda.\nThis entertaining record cannot justify turning the world’s economies upside down right now. Maybe in fifty years time another review would be appropriate, but until then, keep calm and carry on.\nLet’s review some salient facts:\n- Plants converted the preponderance of CO2 in our original zero-oxygen atmosphere, giving us oxygen. The world thrived. More CO2 did not and thus cannot cook the world, ever.\n- Zero CO2 = ZERO FOOD. Plants require CO2 water and sunlight. In return we get food. More CO2 means more crops, more food, more oxygen, more abundance. That’s why growers add CO2 into their greenhouses! The world will make very good use of more CO2.\n- CO2 today is a surprising fraction of our atmosphere – go on, have a guess, then read to the end to see the actual figure (no cheating!).\nTo summarise – we need more CO2. More crops mean more wealth, less hunger, turning impoverished unhealthy crime-ridden communities (assuming Big Agriculture can be kept at bay) into healthier wealthier more productive communities.\nThe exact antithesis of where the UN-WEF “partnership” with our governments is taking us.\nSo what’s really not to like?\n(Air:- Nitrogen 78%, Oxygen 21%, H2O around 1%, CO2 0.04% or 417 ppm – less than half of one thousandth of one unit by volume. We could have 20 times as much before breaking 1% by volume. OK, now panic.)\nWell done for speaking out .Not enough brave men out there. But the more that do the more we will be heard.\n[…] am thankful that Jim shared his thoughts about “The Mix of Propaganda and Predictions”. It was an interesting read, but I think he missed something with the example he selected. […]\nHanlon’s razor is similar to Occam’s razor – never advocate a complex theory when a simple one will account for the observations. But both are only rules of thumb, and neither discounts the possibility of being wrong as a result. Taking the article in isolation, I would agree with you, but the problem is that the propaganda is all-pervasive these days and so one-sided that one cannot fail to be suspicious (only today this link arrived in my inbox: https://dailysceptic.org/2023/04/01/more-climate-fiction-from-the-bbc/ ). The BBC used to produce good scientific programmes that would contrast more than one point of view (I’m sure… Read more »\nOccam’s razor says nothing about simple. It states that when two hypotheses are comparable, the one which makes the fewest assumptions is more likely to be correct. A very complex solution may have many steps, each supported by evidence. That is far more likely to be correct than a simple solution making many assumptions.\nResearch before you write",
  "https_hantsind_com/https_hantsind_com_pcc/content_98.html": "Steve James-Bailey\nPolice & Crime Commissioner candidate | Hampshire & Isle of Wight\nHaving lived in Hampshire for more than 40 years, I have dedicated myself to public service.\nAfter spending 12 years in the Royal Air Force, I Joined Hampshire constabulary in 1989 specialising in several areas. I spent a significant amount of time as a community beat officer dealing with all aspects of the community, including close liaison with councils, adult/children’s social services, domestic violence units and victims of crime. Local policing issues are something I am deeply passionate about.\nFollowing promotion, I specialised as a custody sergeant and headed up the prosecution support team in Basingstoke. I then became a gatekeeping officer dealing with investigations prior to the Crown Prosecution Service.\nOn leaving the Police force, I have become involved in local politics, especially where policing issues REALLY are a priority.\nOn Thursday 6th May I hope you will back my 5 Point Plan for Policing and Crime in Hampshire.\nEmail | steve.james-bailey@hantsind.com",
  "https_hantsind_com/https_hantsind_com_boxing-day-parking-fines/content_49.html": "Following a complaint from a member of the public about being fined for parking in a car park run by Basingstoke & Deane Borough Council (BDBC), I decided to investigate.\nAlthough the signage of the council car parks say it is free on public holidays, it appears BDBC only consider Boxing day to be a public holiday when it falls on a weekday. If it falls on a weekend, it is a normal working day and parking charges apply. Boxing day in 2020 fell on a Saturday, so BDBC parking enforcement officers were out doing their duty. Under normal circumstances, the town would have been buzzing with shoppers hitting the boxing day sales in the Top of Town and Festival Place. There would have been hundreds of unsuspecting shoppers who would have fallen foul of the councils misdirection on parking policy. Basingstoke council insist that the public holiday falls on the Monday, which is correctly identified as a bank holiday. Boxing day is a public holiday by tradition and by tradition it falls on the 26th December every year regardless of weekends.\nThis is the sort of behaviour that gives our town centre a bad name, if our high streets are to survive, post Covid, Basingstoke Council must actively encourage people to come into Basingstoke. Overzealous car parking enforcement will only force people online or out of town\nThese are the number of fines (Parking Charge Notices) issued by other councils in Hampshire. All obtained by freedom of information requests by Hampshire Independents.\n| Council | PCNs |\n|---|---|\n| East Hants District Council | ZERO |\n| Hart District Council | ZERO |\n| Havant Borough Council | ZERO |\n| Gosport Borough Council | ZERO |\n| Test Valley Borough Council | ZERO |\n| Eastleigh Borough Council | ZERO |\n| Fareham Borough Council | ZERO |\n| Rushmoor Borough Council | ZERO |\n| New Forest District Council | ZERO |\n| Basingstoke & Deane Borough Council | 30 |\nYou can clearly see the wording on the sign states no charges on public holidays.\nAnd who would think it appropriate for hidden/mobile speed cameras to be deployed at a time like this (but they do). Hit us brutually hard with Lockdown restrictions from one side and absolutely no let up on the other. The point is these authorrities are so wrapped up in themselves and their way that they have lost sight of what it means to be flexible and helpful.\nI got a parking ticket from Basingstoke and Deane Council for parking what was not even their land! I declined to pay!\nThey are not alone, Newbury uses Euro-car-parks for their enforcement, all the signs say that they follow the British Parking Association procedures……but they don’t, they are happy to be a law completely to themselves. Right/Wrong Fair/Unfair and any part of English common law do not apply.",
  "https_hantsind_com/https_hantsind_com_donate_donate-10/content_36.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\n10 Pound Donation\n10 Pound Donation\nDonation\n*\n£ 10.00\nTotal Amount\nI want to contribute this amount every\nevery\nmonth\nyear\nDonor Information\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone Number\nAddress Line 1\n*\nAddress Line 2\nTown\n*\nCounty\n*\n- select State/Province -\nAberdeen City\nAberdeenshire\nAngus\nAntrim and Newtownabbey\nArds and North Down\nArgyll and Bute\nArmagh City, Banbridge and Craigavon\nBedfordshire\nBelfast\nBerkshire\nBlaenau Gwent\nBridgend\nBristol, City of\nBuckinghamshire\nCaerphilly\nCambridgeshire\nCardiff\nCarmarthenshire\nCauseway Coast and Glens\nCeredigion\nCheshire\nClackmannanshire\nClwyd\nCo Antrim\nCo Armagh\nCo Down\nCo Fermanagh\nCo Londonderry\nCo Tyrone\nConwy\nCornwall\nCounty Durham\nCumbria\nDenbighshire\nDerbyshire\nDerry City and Strabane\nDevon\nDorset\nDumfries and Galloway\nDundee City\nDyfed\nEast Ayrshire\nEast Dunbartonshire\nEast Lothian\nEast Renfrewshire\nEast Riding of Yorkshire\nEast Sussex\nEdinburgh, City of\nEssex\nFalkirk\nFermanagh and Omagh\nFife\nFlintshire\nGlasgow City\nGloucestershire\nGreater Manchester\nGwent\nGwynedd\nHampshire\nHerefordshire\nHertfordshire\nHighland\nInverclyde\nIsle of Anglesey\nIsle of Wight\nKent\nLancashire\nLeicestershire\nLincolnshire\nLisburn and Castlereagh\nLondon\nMerseyside\nMerthyr Tydfil\nMid and East Antrim\nMid Glamorgan\nMid Ulster\nMidlothian\nMonmouthshire\nMoray\nNa h-Eileanan Siar\nNeath Port Talbot\nNewport\nNewry, Mourne and Down\nNorfolk\nNorth Ayrshire\nNorth Lanarkshire\nNorth Yorkshire\nNorthamptonshire\nNorthumberland\nNottinghamshire\nOldham\nOmagh\nOrkney Islands\nOxfordshire\nPembrokeshire\nPerth and Kinross\nPowys\nRenfrewshire\nRhondda, Cynon, Taff\nRutland\nScottish Borders\nShetland Islands\nShropshire\nSomerset\nSouth Ayrshire\nSouth Glamorgan\nSouth Gloucestershire\nSouth Lanarkshire\nSouth Yorkshire\nStaffordshire\nStirling\nSuffolk\nSurrey\nSwansea\nTorfaen\nTyne and Wear\nVale of Glamorgan, The\nWarwickshire\nWest Dunbartonshire\nWest Glamorgan\nWest Lothian\nWest Midlands\nWest Sussex\nWest Yorkshire\nWiltshire\nWorcestershire\nWrexham\nPostcode\n*\nJoin Mailing List\n*\n- select Join Mailing List -\nNo\nYes\nContribute\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_2023_07/content_147.html": "With fraud at a record high and the majority of people received fraudulent text messages, what can we trust and why do we trust it?\nWith fraud at a record high and the majority of people received fraudulent text messages, what can we trust and why do we trust it?",
  "https_hantsind_com/https_hantsind_com_hampshires-gun-amnesty/content_161.html": "In the light of the current police amnesty on firearms, it is often forgotten that there are significantly more legitimate firearm users and weapons collectors than there are people with criminal intent.\nCurrent regulations within the UK are very strict compared to many other parts of the world, but the authorities do like to err on the cautious side and continue the myth that all guns are dangerous, all guns are illegal. This is not true.\nThere is a very large group of legitimate gun owners and gun users. Shooting clubs exist all around the country and many, including the Bisley range, offer exceptional training and service to gun users. The smaller airgun clubs also teach good practice and remove the myths and fears surrounding guns.\nAlso there is a large group of antique and historic weapons collectors, these enthusiasts keep the history of antique militaria and civilian weaponry alive. The craftsmanship and metalworking techniques of gun manufacturers of the 15th-18th century assisted metalworking for the medical and scientific instrument development right up to the early 20th century.\nMost modern firearms are illegal to own without the correct licensing, most antique guns are perfectly legitimate to own as a curiosity item. Owning them with the intent to use them is criminal in all but a few cases. If you are in possession of a firearm and do not know if you need a licensing, you should seek advice. Some of these firearms should be destroyed to stop them falling into the wrong hands.\nSome have a legitimate historic or collectors appeal. These should not be destroyed, they do not need to be handed into the Police for destruction. A trip to your local antiques shop, auction house, registered firearms dealer or police firearms officer should be all it takes to clarify.\nIf you choose to take your guns to the Police station, please ask them to check their legality before you surrender them.\nThe Police have to destroy surrendered weapons. Sometimes that is a travesty.\nItems asked to be surrendered include de-activated guns, airguns, flintlock and percussion weapons, rifles and handguns that use ammunition no longer available. Most of these are perfectly legal to own under set conditions. Mostly no licence is required just good management. Lets get illegal and unwanted guns off the streets and out of houses. Take advice, know what you have and make an educated, well informed decision. Always remember safety first, but your gun may have significant value and that value will vanish if the police destroy it.",
  "https_hantsind_com/https_hantsind_com_tag_election/content_54.html": "For many years, Hampshire has watched developers change the faces of our cities, towns and countryside. A growing population demands that we change with the times. But change for the worst, is what many fear is happening now.\nTag Archives: election\nThis has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.",
  "https_hantsind_com/https_hantsind_com_my-role-as-an-independent-councillor/content_148.html": "My role as an independent councillor is to keep my eyes open for mass building projects, and do all I can to prevent them. The biggest problems we have at present is a sewage treatment works that is over capacitated, and often spills into our rivers. Ok, the water board gets fined on most occasions but with the amount of sewage flowing into rivers over short periods of time allows build ups of long-time pollution causing untold damage to our salmon stock and spawning also effects the rest of the wildlife. In our rivers we have water Cress beds this is often picked and eaten, by people not knowing it’s been in contact with sewage thus sewage entering the human food chain it does not bare thinking about the danger to health. Swimming also goes on and swimmers can inadvertently ingest sewage and everything it contains.\nI would like to see weekly water test’s done on river water.\nI am a firm believer that sewage is a danger to humans as well, and all building programs should be suspended until adequate sewage treatment works are up graded as a matter of urgency. I often bring this up at meetings.\nCycling and cyclist the county council are pressing ahead with new cycle ways routes, did you know in Bishopstoke and Eastleigh the cycle route runs straight through one of the most polluted roads in the area. The cyclist’s breath in car exhaust fumes as do the people that walk the route! Answer more roads required asap.",
  "https_hantsind_com/https_hantsind_com_a-lesson-in-history-and-war/content_3.html": "War has long roots in history, but I propose to look back only to the Third Reich. It’s a salutary exercise to read Hitler’s list of demands of the German nation, which at that time was reeling under the draconian war reparations treaty of Versailles, a treaty that we, if it were imposed on us, would consider crushing, inhuman, impossible ever to satisfy. Clearly, something had to be done, and the German people were ready for it.\nHitler’s list wasn’t all negative. There are certainly some items that would resonate with us today as perfectly sensible. It was however a product of its times – a time of empire, of implacable economic war of nation against nation, with Germany, defeated in WW1, very much the underdog with no means to get out from under.\nHitler’s rhetoric must have seemed like a breath of fresh air to the Germans.\nI would have thought that somebody would have foreseen this – maybe some did. We might well ask how Hitler was permitted to get away with his putsch, and to go on to rearm the nation – where did he get his funding?\nI am struck by parallels today in Palestine. For around 70 years many Palestinians have been progressively bottled up in overcrowded Gaza, dependent on Israel for water, power, trade, and employment, which can all be turned off at will and have been.\nThis situation too was an eventual product of empire, of the Balfour Declaration, and of British stewardship of Palestine after the defeat of the Ottoman Turks. Post WW2, this led to the founding of the State of Israel, expulsion of the Palestinians from their homelands, and wars with Arab nations. The ensuing stalemate has festered and endured despite UN resolutions.\nWhatever Hamas told the Palestinians this time around, maybe they, like the Germans, were simply ready to hear any message that gave them hope of reclaiming their lost lives. And once again, we have to ask – how did Hamas obtain their weapons?\nTruth is always the first casualty of war. Despite lurid media reports, the assumption that everyone in Gaza must be a terrorist is facile (a high percentage are reportedly children), yet politicians the world around who should know better have been quick to make pious but impracticable statements supporting “decisive” action against “the terrorists” whilst somehow “safeguarding the innocent”. Inevitably this will lead to many more dead and injured combatants’ non-combatants and terrorists alike.\nThe situation cries out for wise leadership, but more of the same leadership that has maintained this flashpoint for so many years seems wholly inappropriate.\nI am not sure what this article is saying. It might come across as: “If Germans were desperate enough to follow Hitler and Palestinians desperate enough to follow Hamas then people of Hampshire are you desperate enough to vote for Hampshire Independents.” I’m that’s not what you meant to say.\nThe expulsion of Palistinians goes back to the ’48 War of Independance when many Arab’s left their lands to take up arms against the foundation of Isreal. After the War Isreal refused to let them come back – Something that I understand and is very different from an expulsion. Compare their history since then with that of Arab’s who remained inside Isreal’s ’48 and 56 borders who are full members of Isreal’s multicultural society. Also compare the West Bank and Gaza, neither are good but the differences are striking and the main advances came about after the PLO started to… Read more »\nAnd your policy is………………..? It sounds to me like you are sitting on the fence.\nAt the time I wrote this (Oct 2023) I was simply trying to point up the realities of the situation.\nMy policy now (June 2024) is to stop sending arms to the protagonists and to end the conflict by whatever peaceful means necessary. Starving the protagonists of arms would be the start. Respecting the findings of the ICJ would be a good step forward. Negotiations with the involved parties toward a peaceful settlement could then follow. I don’t pretend to have all the answers.",
  "https_hantsind_com/https_hantsind_com_recycling/content_32.html": "we promise\nLocal recycling\nWe want to focus on processing recycling locally. We believe it defeats the point of recycling if we need to ship it across the world.\nLearn from the best\nNobody has all of the answers. We will be open to new ideas and see what other councils do to improve recycling. We will consider all ideas to improve recycling in Hampshire.\nJoined up working\nWhere possible we will work together with neighbouring councils to bring cost savings and increased capacity. Everyone should be recycling, if there are efficiency savings to be made its our job to find them.",
  "https_hantsind_com/https_hantsind_com_2021_07/content_89.html": "I am opposed to the introduction of vaccine passports, I want you to help me.\nMonthly Archives: July 2021\nNow I am not a medical professional, but could the internet and a little bit of physics tell us something about the pandemic?\nI am opposed to the introduction of vaccine passports, I want you to help me.\nNow I am not a medical professional, but could the internet and a little bit of physics tell us something about the pandemic?",
  "https_hantsind_com/https_hantsind_com_tag_bishopstoke/content_80.html": "Climate Change, OpinionMy role as an Independent Councillor Posted on March 5, 2022March 12, 2022 by Scott Neville 05 Mar Cllr Andy Moore tells us about his work with Bishopstoke Parish Council. Continue reading →",
  "https_hantsind_com/https_hantsind_com_tag_internet/content_70.html": "OpinionInternet Poverty – My Thoughts Posted on February 8, 2021February 1, 2021 by John Edwards 08 Feb People are beginning to see their internet bills go up at a time when the Covid pandemic has reduced household income. Continue reading →",
  "https_hantsind_com/https_hantsind_com_buy-local/content_86.html": "we promise\nprefer local businesses\nWhere the councils buy services, we should favour local businesses, particularly when it involves physical goods.\nSupport local\nLarger chains tend to force smaller local businesses away from the popular parts of town. Planning should account for this and avoid entrenching depressed parts of town.\nBe Green\nBuying locally encourages local growth: more employment, more opportunities, and more hope. Buying local reduces carbon emissions and is environmentally better.",
  "https_hantsind_com/https_hantsind_com_tag_social/content_11.html": "EventsBasingstoke Social August 2021 Posted on August 11, 2021August 11, 2021 by Stan Tennison 11 Aug We are hosting our first social event in Basingstoke on 18 August 2021. Continue reading →",
  "https_hantsind_com/https_hantsind_com_2021_09/content_6.html": "AnnouncementLucy’s London Marathon Run for Wessex Heartbeat Posted on September 26, 2021September 26, 2021 by Lucy Dean 26 Sep On Sunday 3rd October I am due to run the London Marathon on behalf of Wessex Heartbeat. Continue reading →",
  "https_hantsind_com/https_hantsind_com_tag_climate-change/content_51.html": "Wind farm and solar electricity is much more efficient, but green energy is still only part of it. We need to develop an environmental attitude to where we buy our goods and services.\nWind farm and solar electricity is much more efficient, but green energy is still only part of it. We need to develop an environmental attitude to where we buy our goods and services.",
  "https_hantsind_com/https_hantsind_com_basingstoke-town-centre-concept/content_158.html": "Basingstoke Council have launched another tick box survey. This time it’s about the new Town Centre concept plan, which on the surface looks idilic. Lots more cycle paths, more green spaces, more shops, offices and homes. Ecologically and environmentally sound plans. It is good for people to be able to access the town centre safely and healthy for them to cycle or walk. To achieve this, the council plan to sell off the surface car parks within the centre of town and replace the lost parking spaces with a multi-storey car park over Southern Road car park. Again, this sounds very promising, not too many parking spaces lost and benefits to boot.\nBUT, let’s look closer at the plan.\nThe council have to fund this project and it looks like selling off the development rights\nThe car parks are also known as service yards. They allow delivery lorries and other services to access the businesses in their areas.\nThe plan is to turn the space above these new buildings into flats and offices. None of these will have parking, nor are there any plans for increased GP surgeries, school places, sewerage and water works or many other basic infrastructures.\nCar use is the primary method to get into the town centre.\nCan you imagine someone loading up their shopper bike, gathering the kids and making their way back to their home in Manydown on a rainy November evening?\nWe need car parking that can expand, the idea of a multi-storey car park on Southern Road was within the previous, highly expensive, consultation. We must keep the current surface carparks, they can (if future circumstances dictate) be multi-storied too.\nCars in one form or another, will be with us for the foreseeable future.\nThe only way the Council can guarantee an improved bus service that will be able to service the town centre, is not to rely on the public sector, but to run its own. That will never happen, so relying on subsidising the private sector is their only tool. This might work well if there were several bus companies competing. There is only one in Basingstoke. It has a virtual monopoly and can demand levels of subsidy that are excessive and restrictive.\nSchemes like Community centre run minibus services, empty taxi pick up points, car share that have been promoted by Hampshire Independents could ease the public transport crisis at a fraction of the cost of subsidising underused bus services.\nThe whole plan for Basingstoke Town Centre looks like a well wrapped up Conservative land grab. Development deals for the donors? With the benefit of increased council tax yields. With no real opposition at local, county or national level, it is up to us, the people to look beyond the glitter and gifts and ask the very serious question “who is making the profit?”\nThe survey and concept plan can be found here:\nhttps://www.basingstoke.gov.uk/towncentrefuture",
  "https_hantsind_com/https_hantsind_com_tag_sarah-everard-vigil/content_121.html": "Opinion, PolicingSarah Everard vigil: Police Watchdog Report Reaction Posted on March 31, 2021March 31, 2021 by Steve James-Bailey 31 Mar I welcome the report that confirms the police acted appropriately at the Sarah Everard vigil. Continue reading →",
  "https_hantsind_com/https_hantsind_com_2022_01/content_9.html": "We have asked our candidates, members and friends for their hopes and predictions for 2022. In this edition we have Spencer Cleary & Scott Neville\nWe have asked our candidates, members and friends for their hopes and predictions for 2022. In this edition we have Spencer Cleary & Scott Neville",
  "https_hantsind_com/https_hantsind_com_contact-us/content_77.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nCONTACT US TODAY\nNotice: JavaScript is required for this content.\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_eastleigh-lac-reject-application-to-extend-runway/content_67.html": "The hot topic for Eastleigh and indeed Hampshire is the refusal of E.L.A.C. (Eastleigh Local Area Committee) to pass the application to extend the runway at Southampton Airport.\nI deplore this short sighted decision that, if rubber stamped by the Eastleigh Borough full council meeting, will have a detrimental effect on the future prosperity of not only Eastleigh, but also the neighbouring districts and the whole county.\nWith the prospect of Southampton becoming a ‘Freeport’, an airport with expanded capacity that would include additional destinations, would be beneficial to new and prospective businesses that would generate employment and wealth. Added to that, the prospect of additional tourism would also be a welcome bonus to Hampshire and the local economy.\nWe must sound a word of caution regarding the planning needed to enable such growth and prosperity to occur should the airport expansion be passed. Covid aside, in normal times, Eastleigh’s transport infrastructure experiences excessive amounts of traffic that has seen the town and immediate neighbourhoods and districts, gridlocked. Improved access by car, coach/bus and train travel to the airport should be a priority item for consideration.\nAirport Runway extension: the facts. Much has been said, and written about about the proposed runway extension (164 metres 538ft) at Eastleigh/Southampton airport, many of the arguments and comments, simply not based on facts! In order to survive, following the demise of Flybe, the airport needs to attract more operators, offering more domestic routes, and in addition medium haul route options to countries such as Greece, Turkey, Italy, Spain, and other popular foreign holiday resorts. Currently, the most popular planes used, by holiday operators like Easyjet, are the Airbus 320: Jet2 & Ryan Air the Boeing 737-800. The Airbus 320… Read more »\nHello Brian. Thank you for your constructive response.",
  "https_hantsind_com/https_hantsind_com_2022-local-election-candidates-announced/content_62.html": "We are pleased to announce our candidates standing across Hampshire!\nWe are pleased to be announcing our candidates standing across the county in May! You can find the full list below. If you are able to help any of our candidates or want to know more, please get in touch. The main parties have their big party machines backing them, our candidates have a handful of volunteers giving their time freely. If you can deliver leaflets or put-up posters, please get in touch everything helps!\nBasingstoke & Dean Borough Council\n| Candidate | Ward |\n|---|---|\n| Alan Stone | Brookvale & Kings Furlong |\n| Alexis Smith | Eastrop & Grove |\n| Andy Liming | South Ham |\n| Anna-Marie Moynihan | Basing & Upton Grey |\n| Charlotte Bennett | Tadley & Pamber |\n| David White | Kempshott & Buckskin |\n| Duncan Stone | Norden |\n| Lucy Dean | Brighton Hill |\n| Phil Heath | Evingar |\n| Scott Neville | Oakley & The Candovers |\n| Spencer Cleary | Hatch Warren & Beggarwood |\n| Steve James-Bailey | Popley |\nHavant Borough Council\n| Candidate | Ward |\n|---|---|\n| Malc Carpenter | Battins |",
  "https_hantsind_com/https_hantsind_com_2023_10/content_39.html": "Jim takes a look at the history books to review what is going on in Israel and Palestine\nMonthly Archives: October 2023\nDominic Cummings – one-time evil guru of Downing Street, or saviour of the Tory government?\nJim takes a look at the history books to review what is going on in Israel and Palestine\nDominic Cummings – one-time evil guru of Downing Street, or saviour of the Tory government?",
  "https_hantsind_com/https_hantsind_com_2023_02/content_24.html": "We all make assumptions about politics, but how often do we check they are correct?\nMonthly Archives: February 2023\nThis week Jim shares his reflections on the Covid pandemic – previously posted in the Alton Herald.\nWe all make assumptions about politics, but how often do we check they are correct?\nThis week Jim shares his reflections on the Covid pandemic – previously posted in the Alton Herald.",
  "https_hantsind_com/https_hantsind_com_on-the-brain-dump-of-dominic-cummings/content_60.html": "Dominic Cummings – one-time evil guru of Downing Street, or saviour of the Tory government – take your pick – has treated us to what I can only describe as a brain-dump on his substack. And a good read it is too – I can wholeheartedly recommend it. https://dominiccummings.substack.com/\nFake news, fake politics, fake posturing – it’s all there.\nNow, I’m no particular fan of Dominic, but he was at the centre of Downing Street during the Covid event, and his opinions on the manner in which we are governed surely carry weight.\nOf course, Brexit gets a mention – how could it not, being the most contentious issue to set Parliament against the People for many years? Even now we might be forgiven for thinking that we have left the EU in name only.\nWe might be tempted to dismiss his rantings as a dumping of years of pent-up frustration, but even so – is this really how we wish to be governed?\nHis conclusion? The system is broken. How could it not be, when truth takes last place behind the political neuroses of the age?\nHe rightly lays the blame squarely at the doors of the political parties. The political parties who act as the gatekeepers to parliament, whose MPs are whipped to pass the Bills that the Party wants rather than the Bills that their constituents would prefer. This is rule by Political Party, subject to all the whims and fancies of the party donors.\nDominic’s solution? We need another one! This new Party will be wonderful, and will govern in wisdom and mercy. With a bit of luck it will replace the Tory party.\nCall me old-fashioned, but haven’t we had enough of this failed system? Would it be too much to suggest that actually, we would prefer our MPs to work for us? For that to happen, the constituency needs to pay them directly and must be able to hire them and fire them. Sadly, that isn’t going to happen any time soon. Even our current Monarch is openly working for the oligarchs of the WEF, for the New World Order. If we accept that, then democracy is well and truly ended in this land.",
  "https_hantsind_com/https_hantsind_com_prosperous-post-pandemic-future-for-hampshire/content_102.html": "The prospect of Southampton becoming a ‘Freeport’ coupled with the recent news that the airport located in Eastleigh has been granted permission to extend the runway should be used as a catalyst or a springboard for economic growth and investment that will benefit the county.\nIsn’t it now time consider a post pandemic campaign for Hampshire to stage a trade fair, to showcase the best of Hampshire and what it can offer prospective investors? County and local council facilities along with private venues and capital should be utilised to showcase our county. Such a bold move would surely deserve government backing and support.\nA rolling trade show with multiple venues over a period of up to six months or more is but one option to consider. We already have the Farnborough Air Show on a planned schedule, so why not consider this as a template for a timetable? Our maritime heritage should be exploited to the fullest extent. Over the years, both Southampton and Portsmouth have successfully been involved with Global Ocean Race and the Americas cup. Portsmouth has contributed to the construction of this country’s two aircraft carriers. Cowes puts on an annual world-renowned Regatta. The world would be focused on these venues, so why not exploit them to the fullest extent for business, leisure and tourism.\nLet’s not also forget that we are blessed with some fantastic seats of learning throughout the county, which can also be included in such a venture. How about a competition for students to encourage invention and innovation? District heats culminating in a countywide final with cash prizes and the chance of gaining employment or starting new businesses should be something to inspire fertile minds. Investing in people and their ideas has been sorely lacking over so many years. We need to treat our students, our young engineers, and builders in such a way to encourage them to help build a future for our country.\nBringing together the business, banking / finance, and education communities along with Chambers of Commerce and the many business networking groups under the auspices of such a venture, is in my opinion, a serious way to kick start serious economic growth in Hampshire. With the rail, road, air and sea links already in place, the county is in an ideal location to attract new investment.\nHampshire Independents call upon all political parties and the people of our county to come together in an effort to forge a new era of prosperity for our county.",
  "https_hantsind_com/https_hantsind_com_party-constitution/content_145.html": "Party Constitution\nAdopted by the Extraordinary General Meeting of the Hampshire Independents 9 Feburary 2020\n1 – Title and Status\n- The name of the party shall be The Hampshire Independents (hereafter referred to as “The Hampshire Independents”)\n- The Hampshire Independents may contest any national or local election within England & Wales, subject to eligibility of individual candidates.\n2 – Aims\n- The objective of the Hampshire Independents is to provide the electorate with a credible alternative to the mainstream parties at local and national level. We believe that people are disillusioned with the mainstream parties and this causes low turnout at elections. We feel that the electorate deserve a wider choice from people that are accessible to them by being local. The electorate deserve local candidates which understand their concerns and will serve the electorate better by experiencing the same issues. The Hampshire Independents aims to provide an alternative choice.\n- The Hampshire Independents will always consider the interests of everybody rather than favouring one particular section of the community. However, we accept such a balancing act is challenging. We will always try to be fair but we will never claim we can please everyone all of the time.\n- The Hampshire Independents aims to win one or more council seats within Hampshire and be in a position to contribute to the debate and influence council decisions.\n- The Hampshire Independents aims to win one or more Parliamentary seats local to Hampshire and be in a position to contribute to the debate and influence decisions in the House of Commons.\n3 – Membership\n- All UK residents on the electoral register are eligible to apply to become a member of The Hampshire Independents. An annual membership fee is payable, the amount of which may vary periodically.\n- 3.2 Members may be a member of another political party providing their aims and objectives do not conflict with ours.\n4 – Meetings and Decision Making\n- The business of The Hampshire Independents shall be decided and managed by party meetings (hereafter referred to as “party meetings”) held on an ad-hoc basis as required and chaired by the party leader. Party meetings are likely to be more frequent when elections are imminent and less so between elections.\n- Party meetings shall be open to all paid-up members of the Hampshire Independents\n- Potential new members and supporters may attend by invitation of the chairman or secretary of the meeting, but cannot vote and have no right to speak except at the discretion of the chairman of the meeting.\n- A draft agenda will be circulated in advance of each meeting, together with the minutes of the previous meeting. Any paid-up member can suggest additional items for the agenda in advance of or at the start of the meeting.\n- Members should be notified of any motions relating to policy at least one week before the meeting to discuss the issue.\n- A party meeting will be defined to be in quorum, and will be carried by achieving simple majority of vote of the members present.\n- Motions should be proposed and seconded, and will be carried by achieving a simple majority vote of the paid-up members present.\n- Only paid-up members of the Hampshire Independents will be entitled to vote. Those unable to attend may make their views known to the party meeting, either in writing or through representation by another member, but only those in attendance will be entitled to vote.\n- Attendance and business conducted as meeting shall be recorded in minutes to be approved by the next meeting.\n- In the event of a decision needing to be made before a meeting, or the lack of a quorum, an emergency decision may be made by agreement of a simple majority of the registered officers of the Hampshire Independents. This decision must either be ratified or revised at the next party meeting.\n- Working groups may be set up to discuss specific issues and prepare motions to be put to the next party meeting. All paid-up members can attend these working groups and participate in them.\n5 – Annual General Meeting (AGM)\n- Every year, as close as possible to 29th February, an AGM shall be held for purposes of:\n- Presentation of the Officer reports of work which has been carried out over the last year\n- Presentation of a financial statement for the last year\n- Election of Officers for the forthcoming year\n- Reviewing strategy and setting goals for the following year and beyond\n- Any other business on the agenda\n- Notice of the AGM shall be given at least one month prior to the meeting and any motions for consideration shall be submitted in writing to the Secretary at least two weeks prior to the meeting.\n- The chair shall be initially taken by the party leader, handing over to the new party leader (if different) after the election of officers has been completed.\n- All members of the Hampshire Independents who are present at the AGM have one vote each. Resolutions are carried with the support of a simple majority.\n- The Agenda will be circulated in advance at least one week prior to the meeting.\n- The chair has the right to rule on the admissibility of any emergency motions put forward.\n- The quorum of an AGM shall be three members of the Hampshire Independents.\n6 – Extraordinary General Meeting (EGM)\n- An Extraordinary General Meeting (EGM) may be called on the request of any formal meeting of the Hampshire Independents or by a majority of the Registered Officers of the Hampshire Independents.\n- The same general rules apply to the EGM’s as to the AGM’s, but it is not necessary to elect a new set of officers.\n7 – Officers of the Hampshire Independents\n- The Hampshire Independents will endeavour to elect its Officers at an AGM held in accordance with section 5. Optionally the Hampshire Independents may elect officers at an EGM which can be called in accordance with section 6.\n- The Hampshire Independents shall hold the following officers:\n- Leader: The figurehead for the party, with overall responsibility for its correct operation.\n- Secretary: The main administrator for the party, but not necessarily politically active.\n- Treasurer: Responsible for opening and maintaining a bank account, holding any cheque books, paying in any receipts and submitting the necessary returns to the Electoral Commission. Should keep Branch meetings fully and accurately appraised of the financial position and present and annual account to the AGM. Will always act in accordance with the Financial Scheme registered with the Electoral Commission.\n- Nominating Officer: Responsible for liaison with potential candidates and approving their candidacy on nomination papers. Jointly responsible for selection of candidates with the party leader.\n- Additional Officer: Maintains a broad overview of the parties activities without any specific responsibilities, but able to provide additional support and signature if necessary.\n- Nominations shall be proposed and sectioned, and will be won by a simple majority vote of the party members attending the AGM or EGM.\n- If an AGM cannot form a quorum, Officers can be appointed at the discretion of the Party Leader and the agreement of the existing Registered Officers of the party.\n- If an EGM cannot form a quorum, the existing Officers continue in their roles.\n- The AGM has the discretion not to fill posts if no suitable nominations are forthcoming or to propose the merging of posts of the creation of other posts with the agreement of a simple majority.\n- Should any Officer fail to attend three consecutive meetings without good reason or an apology, The Hampshire Independents may co-opt another person to act in their place.\n- In the event of a vacancy an officer may be co-opted at the next party meeting. In this situation, there is no need to wait for the next AGM or hold and EGM.\n8 – Finance\n- The Treasurer shall collect or arrange the collection of all money due to The Hampshire Independents and shall receive all donations to the Hampshire Independents and shall be the custodian thereof.\n- The Treasurer will arrange payment of any bills incurred by the Hampshire Independents and will notify the group if it is in danger of becoming overdrawn.\n- The Treasurer will at all time act in accordance with the Financial Scheme that is registered with the Electoral Commission.\n9 – Selection of election candidates\n- Any paid-up member of the Hampshire Independents can apply to become a candidate at a local or national election in England and Wales.\n- All election candidates and their agents are selected via an interview with the Party Leader and Nominating Officer\n10 – Amending the constitution\n- This constitution can only be altered by an AGM or EGM of the Hampshire Independents\n11 – Winding Up\n- The Hampshire Independents may be wound up by a decision at any AGM or EGM of the Hampshire Independents\n- If a quorum cannot be formed after an AGM or an EGM has been correctly called, the party may be formally wound up by the Party Leader, of if the Party Leader is deceased, by any Registered Officer of the Hampshire Independents.",
  "https_hantsind_com/https_hantsind_com_steve-james-bailey-selected-as-pcc-candidate/content_127.html": "I am very pleased to announce that I have been selected to stand for Police and Crime Commissioner in Hampshire on behalf of Hampshire Independents. I have lived in Hampshire for more than 40 years and I have dedicated myself to public life.\nAfter spending 12 years in the Royal Air Force, I Joined Hampshire constabulary in 1989 specialising in several areas. I spent a significant amount of time as a community beat officer dealing with all aspects of the community, including close liaison with councils, adult/children’s social services, domestic violence units and victims of crime. Local policing issues are something I am deeply passionate about.\nFollowing promotion, I specialised as a custody sergeant; headed up the prosecution support team in Basingstoke; gatekeeping officer investigations prior to the Crown Prosecution Service; and created policy.\nOn leaving the Police force, I have become involved in local politics, especially where policing issues REALLY are a priority.\nYou can find out more about my manifesto by visiting https://hantsind.com/pcc and please let me know what you think by taking my survey here https://hantsind.com/pcc/survey\nRenters rely on the police to protect them from illegal evictions – when landlords try to remove tenants without bailiffs appointed by a court. But we (Generation Rent) regularly hear that when police officers are called to attempted illegal evictions, they either falsely tell the tenants that it is a civil matter, or even assist the landlord in performing the eviction. A tiny minority of criminal landlords get prosecuted. Police and Crime Commissioners (PCCs) around the country could change this. On May 6, there are 41 PCC elections taking place around England and Wales. We need all PCC candidates to commit… Read more »",
  "https_hantsind_com/https_hantsind_com_latest/content_37.html": "news and views\nOur members and activists write for us, we don’t edit or change their work, they are free to write what they really think. We don’t always agree, that’s fine, we work together to resolve our differences through the open exchange of ideas.",
  "https_hantsind_com/https_hantsind_com_tag_southampton/content_153.html": "OpinionA Prosperous Post-Pandemic Future for Hampshire Posted on April 12, 2021April 12, 2021 by John Edwards 12 Apr Isn’t it now time consider a post pandemic campaign for Hampshire and what it can offer prospective investors? Continue reading →",
  "https_hantsind_com/https_hantsind_com_campaigns/content_19.html": "Our campaigns\nOur members campaign for issues that matter to them. We can help put our members in contact with other people who are politically active and offer advice. We stand by our principles, and we don’t gag our members. Our members have been active in many campaigns both local and national, standing up for what they think is right.\nwe stand for what we think is right",
  "https_hantsind_com/https_hantsind_com_join/content_141.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nJOIN OUR PARTY\nJOIN OUR PARTY\nMembership\n*\nFull Member\n-\n£ 20.00\nAdditional Contribution\n*\n£ 5.00\n£ 10.00\n£ 15.00\n£ 20.00\n£ 25.00\n£ 30.00\n£ 40.00\n£ 50.00\nNo thank you\nTotal Amount\nMember Registration\nFirst Name\n*\nLast Name\n*\nEmail Address\n*\nPhone Number\nAddress Line 1\n*\nAddress Line 2\nTown\nCounty\n- select State/Province -\nAberdeen City\nAberdeenshire\nAngus\nAntrim and Newtownabbey\nArds and North Down\nArgyll and Bute\nArmagh City, Banbridge and Craigavon\nBedfordshire\nBelfast\nBerkshire\nBlaenau Gwent\nBridgend\nBristol, City of\nBuckinghamshire\nCaerphilly\nCambridgeshire\nCardiff\nCarmarthenshire\nCauseway Coast and Glens\nCeredigion\nCheshire\nClackmannanshire\nClwyd\nCo Antrim\nCo Armagh\nCo Down\nCo Fermanagh\nCo Londonderry\nCo Tyrone\nConwy\nCornwall\nCounty Durham\nCumbria\nDenbighshire\nDerbyshire\nDerry City and Strabane\nDevon\nDorset\nDumfries and Galloway\nDundee City\nDyfed\nEast Ayrshire\nEast Dunbartonshire\nEast Lothian\nEast Renfrewshire\nEast Riding of Yorkshire\nEast Sussex\nEdinburgh, City of\nEssex\nFalkirk\nFermanagh and Omagh\nFife\nFlintshire\nGlasgow City\nGloucestershire\nGreater Manchester\nGwent\nGwynedd\nHampshire\nHerefordshire\nHertfordshire\nHighland\nInverclyde\nIsle of Anglesey\nIsle of Wight\nKent\nLancashire\nLeicestershire\nLincolnshire\nLisburn and Castlereagh\nLondon\nMerseyside\nMerthyr Tydfil\nMid and East Antrim\nMid Glamorgan\nMid Ulster\nMidlothian\nMonmouthshire\nMoray\nNa h-Eileanan Siar\nNeath Port Talbot\nNewport\nNewry, Mourne and Down\nNorfolk\nNorth Ayrshire\nNorth Lanarkshire\nNorth Yorkshire\nNorthamptonshire\nNorthumberland\nNottinghamshire\nOldham\nOmagh\nOrkney Islands\nOxfordshire\nPembrokeshire\nPerth and Kinross\nPowys\nRenfrewshire\nRhondda, Cynon, Taff\nRutland\nScottish Borders\nShetland Islands\nShropshire\nSomerset\nSouth Ayrshire\nSouth Glamorgan\nSouth Gloucestershire\nSouth Lanarkshire\nSouth Yorkshire\nStaffordshire\nStirling\nSuffolk\nSurrey\nSwansea\nTorfaen\nTyne and Wear\nVale of Glamorgan, The\nWarwickshire\nWest Dunbartonshire\nWest Glamorgan\nWest Lothian\nWest Midlands\nWest Sussex\nWest Yorkshire\nWiltshire\nWorcestershire\nWrexham\nPostcode\n*\nJoin Mailing List\n*\n- select Join Mailing List -\nNo\nYes\nContribute\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_2023_01/content_124.html": "OpinionJim’s Thoughts on Being an Independent Posted on January 29, 2023January 29, 2023 by James Makin 29 Jan Jim Makin shares his thoughts on being independent with us after it was posted in the Alton Herald Continue reading →",
  "https_hantsind_com/https_hantsind_com_2021_04/content_10.html": "Free Parking on public Holidays, simple right?\nMonthly Archives: April 2021\nIsn’t it now time consider a post pandemic campaign for Hampshire and what it can offer prospective investors?\nWe are pleased to be announcing our candidates standing across the county in May!",
  "https_hantsind_com/https_hantsind_com_our-story/content_133.html": "How our story began…\nOur story began in 2018 with 4 friends meeting in a Basingstoke pub. We had all been involved in politics for years standing for election, campaigning for change and making our voices heard. Each one of us was a member of a national party but we were no longer proud of them, how they acted or how the behaved. We broadly agreed on a number of principles, but we had our differences, we could discuss them in a civilised way. We decided we would stand as independent candidates in 2018.\nwe stand by our principles\nStanding as an independent candidate is challenging, the passes over you and you have to complete all the same tasks that major parties do with none of the support. In 2019 we decided to form a party, we all love our local area and proud to be from the county of Hampshire. We wanted to make it easier for us to share resources, push our message out and combine our skills. We wanted to retain our independence, to campaign on issues that were important to us and to stand for what we think is right.\nIn December 2019 we formally started the process of registering our party. Our party would have no top down manifesto, we would have a number of principles and we would expect out members to do what they believe is right for their area. We would campaign together for our shared principles and help each other with our unique skills. We can disagree, but we are committed to resolving our differences through debate and a free exchange of ideas.\nA group of independents like this may not work, but does the current red or blue party politics work? We think not!",
  "https_hantsind_com/https_hantsind_com_principles/content_104.html": "our party principles\nOur core beliefs reflect the desire for real independence from the mainstream arena but, more importantly, seek to tailor efforts towards the specific needs of individual Hampshire communities. Our councillor candidates will have identified key issues for their area and will be able to devote their energy to those things that matter to you.",
  "https_hantsind_com/https_hantsind_com_category_elections/content_79.html": "We are pleased to be announcing our candidates standing across the county in the general election!\nCategory Archives: Elections\nWe are pleased to be announcing our candidates standing across the county in May 2022!\nWe are pleased to be announcing our candidates standing across the county in May!\nWe are delighted to announce that councillor Andy Moore is joining Hampshire Independents.\nFor many years, Hampshire has watched developers change the faces of our cities, towns and countryside. A growing population demands that we change with the times. But change for the worst, is what many fear is happening now.\nThis has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.",
  "https_hantsind_com/https_hantsind_com_category_policing/content_57.html": "I welcome the report that confirms the police acted appropriately at the Sarah Everard vigil.\nCategory Archives: Policing\nWe are all equal before the law. Controversial? We don’t think so. Democracy advocates that all people should be treated equally. Controversial? We don’t think so. The human condition dictates that all lives matter. Controversial? Only if you’re brainwashed, or fearful of appalling hypocrisy crashing about your ears or worse – fearful of politically influenced",
  "https_hantsind_com/https_hantsind_com_2022-hope-predictions-p1/content_155.html": "We have asked our candidates, members and friends for their hopes and predictions for 2022. Up first we have our Treasurer and local election candidate in Hatch Warren & Beggarwood in Basingstoke Spencer Cleary:\nPrediction\nI think there will be a Conservative leadership challenge in the latter part of this year. I am not certain by whom or when it will be (other than in the later part of this year), but with everything that is going on at the moment, there appears to be a new scandal every week, I cant see Boris lasting the year unscathed.\nHope\nI am hoping and expecting all of the Covid restrictions to be removed by the end of February. The light is at the end of the tunnel and with so many people having caught Covid and being vaccinated the levels of protection are so high that it wont be long until the pandemic becomes endemic.\nThe second writer we have is Scott Neville our Nominating Officer\nPrediction\nI think that the high street will start to make a comeback, not in the way that we know it and it will really depends on how local councils support them. However, I think that we will see much smaller much more specialised shops return to the high street, possibly coupled with coffee shops, bakeries and cafes which make the high street a place to go to for something specific where you can grab a coffee and cake with friend at the same time. The massive department stores will be consigned to the history books and the high street will become much more agile place, fuelled by councils trying to get people to use public transport and the every increasing cost of car ownership. The high street will make a comeback, but it wont look like the 1990’s, possibly more like the 1950’s (with contact-less payments).\nHope\nWhat do I hope will happen. Well I hope that we return start to return to an age of reason. Most people are intelligent enough to realise that no one person or small group can conceptualise all risk that exists in the world, the dictatorial policies over Covid we have seen have been massively damaging. I would like to see a return to a time where information is reported and people make their own decisions. Most of the key discoveries and inventions came from people using their own reason and we need to encourage that. The big parties are utterly clueless on this issue and Britain’s key to success is people working in sheds innovating because they enjoy it and they are free to use their own minds. This applies to things like Covid too, 99% of people will make sensible decisions given full access to information. Climate change and pollution can be addressed with the same answer, empower people with the freedom and the information to make the world better and they will…. it just might not be the exact world that those in power imagined.\nThat is the end to our part 1, more will be published as our members send them to us.",
  "https_hantsind_com/https_hantsind_com_2021_05/content_156.html": "As a candidate for Whitchurch and the Cleres and Oakley and the Candovers, I am delighted to announce that this year I am fundraising on behalf of Wessex Heartbeat.\nAs a candidate for Whitchurch and the Cleres and Oakley and the Candovers, I am delighted to announce that this year I am fundraising on behalf of Wessex Heartbeat.",
  "https_hantsind_com/https_hantsind_com_tag_eastleigh/content_85.html": "Cllr Andy Moore tells us about his work with Bishopstoke Parish Council.\nTag Archives: Eastleigh\nIsn’t it now time consider a post pandemic campaign for Hampshire and what it can offer prospective investors?\nThe hot topic for Eastleigh and indeed Hampshire is the refusal of E.L.A.C. to pass the application to extend the runway at Southampton Airport.",
  "https_hantsind_com/https_hantsind_com_we-have-allowed-this-election-to-rob-us-of-our-choices/content_139.html": "This has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.\nAn election is supposed to be our time to have our say and vote for who we would like to see in Parliament – representing our local area.\nThe way politics is currently portrayed, particularly by the media, would have us believe that the names on the ballot paper will be those of the leaders from the major parties. But in reality this just isn’t the case.\nWe cannot vote for a Prime Minister unless we happen to live in the constituency where they are standing. Depending on where you live, your vote may mean much less than in other parts of the country.\nFor instance, those people that live in the constituency of the speaker, won’t get any say whilst that MP remains in the post. This has been the case for those living in Buckingham for the last 10 years, as their MP was John Bercow.\nFurthermore, you may live in a “safe seat” area, or perhaps the party you like is not standing. Nigel Farage recently stood down all Brexit party candidates within Tory-held constituencies. Other areas have experienced strategic alliances by groups of parties, such as The Liberal Democrats, who have entered into a “Remain Alliance” with Plaid Cymru and the Green Party. Such alliances may have taken away the choice you originally wanted to vote for.\nSmall parties get no chance too, there are many out there and they clearly represent a wide spectrum of views that many might hold. It may sound crazy now, but not long ago pubs had to shut during the day, changing this was a policy of the Monster Raving Loony Party during the 1980’s! We may not elect them but we should not restrict their access to spread their ideas with a complicated, outdated and expensive electoral process.\nMaybe you are worried about voting for the party you want to see in Parliament, for fear of splitting the vote, and letting another party you do not support win the seat, which could ultimately give them power in the House of Commons.\nMaybe you are happy; your MP is the person you voted for and the party has the majority in Parliament. However, there is still the barrier of the House of Lords to contend with, which may block proposals from the people you voted for!\nPerhaps you just want an option that says you aren’t happy with any of the choices on offer. You can spoil your ballot, but how many know and are confident of the legalities of this?\nSo, how do we fix this? How can we stop tactical voting and get back to focusing on appointing a representative that will steer domestic policies both nationally and in local areas?\nIs first past the post just the best method of a bad system? Should we try again for a system of proportionate representation like the alternative vote. Do we scrap it and switch to an American-style system where we vote for a President?\nOur opinion?\nFirst of all, we need a more accurate representation of politics to stop people becoming misinformed. The emphasis should be on where we live locally and the UK as a whole. Politics has become too much about personalities, not policies.\nSecondly, move the base of Parliament outside of London, and into an area that is more representative of the UK, and is free from any Londoncentric influences.\nThirdly, reform the House of Lords and make it fit for purpose. This is supposed to be place for final checks and balances but it’s unelected and unrepresentative. It could become a part time role, to be taken up by a more varied range of people, such as business leaders, charity organisers, and Doctors or even a system like jury service.\nSeats in the House of Lords could be allocated to parties according to vote percentages taken from the general election. This can be implemented by giving people an additional vote for a party, alongside their existing vote for an individual (and let’s rename it to the House of Representatives and take away the titles).\nWe may not agree with leave vs remain, left vs right, authoritarian vs libertarian, but we surely can agree that we deserve better?",
  "https_hantsind_com/https_hantsind_com_lucy-deans-fundraiser-garden-party-30-may-2021/content_150.html": "As a candidate for Whitchurch and the Cleres and Oakley and the Candovers, I am delighted to announce that this year I am fundraising on behalf of Wessex Heartbeat.\nOn 3rd October 2021 I am going to be running the London Marathon in aid of the charity, which has supported my family over the years.\n“In 2016 my Mum underwent open heart surgery at the hospital and thanks to the charity I was able to stay at the Heartbeat House for nearly two weeks. In that time, I regularly visited my Mum as she underwent her many operations. I am immensely grateful to the charity for allowing myself and my close family to stay there for free.”\nAs part of my fundraising efforts, I am hosting a Garden Party at the Alexandra Pub in Farnborough, Hampshire on 30 May 2021, to which YOU are all invited!\n- BBQ: starting from 1pm\n- Live Music from the indie band The Maida Vales: 3pm – 6pm\n- Fabulous prizes to be won in the Charity Raffle: starting from 5pm\nNo need to worry about parking, as facilities are provided in the nearby ASDA carpark. Tickets cost: £4.36 per person and children under 12 go free. All the proceeds of the tickets are going to Wessex Heartbeat, a charity which helps people with heart conditions who live throughout the Wessex region.\nTo book the last few remaining tickets: https://www.eventbrite.com/e/garden-party-in-aid-of-wessex-heartbeat-tickets-152479914529\nTo find out more about Lucy Dean’s fundraising efforts in aid of Wessex Heartbeat: https://uk.virginmoneygiving.com/CanaryJamMedia",
  "https_hantsind_com/https_hantsind_com_apprenticeships/content_21.html": "we promise\nSupport\nWe will highlight and support companies that endorse apprenticeships. We will strive to make it as easy as possible to offer apprenticeships.\nencourage\nWe want to encourage the next generation to take up apprenticeships making sure the schools and colleges know where they are.\ndeliver\nWhere the council is able to offer apprenticeships internally we will try to make this happen.",
  "https_hantsind_com/https_hantsind_com_community/content_122.html": "we promise\nNo central planning\nOur members stand for what they think is right, we don’t have a top-down manifesto. We believe each council should serve their local communities first, if that means working with other councils we will.\nCommunity Child care\nChildcare is best done local, it’s better children walk than drive, it’s better they see familiar faces, it’s better they have a stable environment. We will encourage and support community childcare.\ncommunity transport\nDelivering the right services to the community, not saying “more buses” because its an easy answer. We need to make it easy for people to move around.",
  "https_hantsind_com/https_hantsind_com_the-energy-bill/content_136.html": "Sponsored by: The Department for Business Energy and Industrial Strategy, (now replaced by the Department for Energy Security and Net Zero, Department for Science, Innovation and Technology, and Department for Business and Trade) and The Department for Energy Security and Net Zero\nResponsibility for national security and investment policy has gone to the Cabinet Office.\nAll clear?\nOh, is Energy Policy a key part of our “national security and investment policy”?\nSo responsibility for this bill lies somewhere within … all of the above.\nHelpfully the Bill has a Long Title – too long to reproduce here, but covering every conceivable aspect of energy provision distribution storage and usage.\nA perusal of the intersectional prose within the Bill swiftly drove me to conclude that this task could not yield reasonable comprehension in my lifetime.\nHowever, judging by media comments, it should probably be retitled the “Energy – Dictatorial Powers – Bill” with much being made of “reasonable force” wielded to ensure compliance.\nThe Bill was considered by the Commons on 6th September, giving rise to a number of amendments, such as “Clause 56, page 50, line 21, at end insert— ““eligible hydrogen storage provider” is to be interpreted in accordance with section (Direction to offer to contract with eligible hydrogen storage provider)(4); “eligible hydrogen transport provider” is to be interpreted in accordance with section (Direction to offer to contract with eligible hydrogen transport provider)(4)””\nI would wager that comprehension is also beyond the endurance of the MPs who debated and voted on it. The result is nitpicking amendments such as the above, which cover for inability to address major deficiencies.\nClearly Parliament is governed by whips – and we are governed by an Artificial Intelligence – legislation for bureaucrats to govern unconcerned by individual circumstance (let alone freedoms), mechanically following the legalistic verbiage through all the intersectionalities.\nNeither new nor (yet) automated – it is the Statute Book, inherently incomprehensible, inexorably expanding – Parliament’s monster, undead, uncontrolled, rampant.\nIgnorance of the law is no excuse but is guaranteed – we won’t understand our non-compliance until some official turns up to forcefully install a smart meter, or to stop us selling our house until we have ripped out our gas heating (that works) for a heat pump (that may not).\nThis bill will forcefully impose uncosted impractical solutions that deliberately put our quality of life last behind all the imagined dangers of living our previously happy carefree lives on what may still be, despite them all, the most beautiful planet, populated by the most beautiful people, in the universe.\nWould that we had a parliament to match.\nFloreat Gaia!",
  "https_hantsind_com/https_hantsind_com_2022_05/content_53.html": "It is often forgotten that there are more legitimate firearm users than there are people with criminal intent – my thoughts on Hampshire’s Gun Amnesty.\nIt is often forgotten that there are more legitimate firearm users than there are people with criminal intent – my thoughts on Hampshire’s Gun Amnesty.",
  "https_hantsind_com/https_hantsind_com_members/content_103.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nSign in to Your Account\nface\nvisibility\nLost your password?\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_category_parking/content_33.html": "Free Parking on public Holidays, simple right?\nCategory Archives: Parking\nFollowing a complaint from a member of the public about being fined for parking in a car park run by Basingstoke & Deane Borough Council (BDBC), Alan Stone decided to investigate.",
  "https_hantsind_com/https_hantsind_com_2024_06/content_35.html": "Announcement, Elections2024 General Election Candidates Announced Posted on June 8, 2024June 8, 2024 by Scott Neville 08 Jun We are pleased to be announcing our candidates standing across the county in the general election! Continue reading →",
  "https_hantsind_com/https_hantsind_com_category_announcement/content_14.html": "We are pleased to be announcing our candidates standing across the county in the general election!\nCategory Archives: Announcement\nWe are pleased to be announcing our candidates standing across the county in May 2022!\nOn Sunday 3rd October I am due to run the London Marathon on behalf of Wessex Heartbeat.\nWe are pleased to be announcing our candidates standing across the county in May!\nWe are delighted to announce that councillor Andy Moore is joining Hampshire Independents.\nI am very pleased to announce that I have been selected to stand for Police and Crime Commissioner in Hampshire on behalf of Hampshire Independents.\nWe are pleased to announce our first spokesperson.",
  "https_hantsind_com/https_hantsind_com_thoughts-on-covid-and-unemployment/content_110.html": "The impact of Covid on the economy at a time where 5% of the working population is now unemployed cannot be underestimated. Some 202,000 people are now reported to have lost their jobs in the run up to Christmas.\nRecord numbers are now claiming benefit to offset smaller pay packets that furlough has brought them. Small businesses shutdowns because they are deemed unessential, are also not immune to the negative effects of the pandemic and rising costs of keeping going.\nOne factor that is coming to the fore during this winter period is the rising numbers of ‘fuel poverty’.\nA study showing home workers may pay £28 – 45 a month in extra energy costs makes “grim reading”, campaigners have said. A midlands University team said those in England’s 600,000 un-insulated properties faced the biggest rise.\nA worrying aspect of fuel poverty aside from the financial implications is health of those affected. An additional concern of fuel poverty is that Covid may be exacerbated by cold, damp homes where people are trying to economise. Fuel poverty can make respiratory illnesses worse, of which Covid is one.\nAt the time of writing, government, utilities and Citizens Advice are trying to ensure people are protected during lockdown. That’s all well and good until at such time when the pandemic hopefully clears. Can people expect payment plans made easy? Or maybe loans made easier to cover existing debt exasperated by Covid? Energy providers are going to have to do their bit and cut their costs.\nBut all of this is not enough if you consider that the government eventually went into overdrive and increased quantative easing. Where is all this money coming from that the government is borrowing to fund the effects of Covid? Globally, trillions are been made available.\nThe best thing that could happen is that all Covid related debt should be cancelled. What a great boost to people’s mental health such a move would achieve. What price would you put on that?",
  "https_hantsind_com/https_hantsind_com_2020_11/content_93.html": "We are all equal before the law. Controversial? We don’t think so. Democracy advocates that all people should be treated equally. Controversial? We don’t think so. The human condition dictates that all lives matter. Controversial? Only if you’re brainwashed, or fearful of appalling hypocrisy crashing about your ears or worse – fearful of politically influenced",
  "https_hantsind_com/https_hantsind_com_author_spencer-cleary/content_45.html": "Free Parking on public Holidays, simple right?\nAuthor Archives: Spencer Cleary\nIn response to the article reported by Ryan Evans and the proposed Amazon development at the M3/Jct 7, if have the following comments.\nWith our waste recycling centres (previously known as “the dump”) now charging for certain types of waste to be discarded, there is no doubt that this has increased the number of fly-tipping incidents that have happened in and around Basingstoke. Add on to that the long queues to get into the dump, that are a\nThe UK government decided to lockdown the country for all but essential key workers. Is this the best option? The government is stating they are going to pay 80% of furloughed peoples salaries for a period of time which is in fact a cost to the tax-payer. Apart from the money, our money, that is",
  "https_hantsind_com/https_hantsind_com_2020_12/content_25.html": "For many years, Hampshire has watched developers change the faces of our cities, towns and countryside. A growing population demands that we change with the times. But change for the worst, is what many fear is happening now.\nMonthly Archives: December 2020\nWind farm and solar electricity is much more efficient, but green energy is still only part of it. We need to develop an environmental attitude to where we buy our goods and services.",
  "https_hantsind_com/https_hantsind_com_tag_charity/content_44.html": "On Sunday 3rd October I am due to run the London Marathon on behalf of Wessex Heartbeat.\nTag Archives: Charity\nAs a candidate for Whitchurch and the Cleres and Oakley and the Candovers, I am delighted to announce that this year I am fundraising on behalf of Wessex Heartbeat.",
  "https_hantsind_com/https_hantsind_com_tag_poverty/content_42.html": "OpinionInternet Poverty – My Thoughts Posted on February 8, 2021February 1, 2021 by John Edwards 08 Feb People are beginning to see their internet bills go up at a time when the Covid pandemic has reduced household income. Continue reading →",
  "https_hantsind_com/https_hantsind_com_jim-reviews-the-covid-years/content_58.html": "Last time, I summarised UK Politics over the last 50 years.\nThis week I review the Covid years.\nThe last real pandemic (bar a few minor scares) was the “Spanish Flu” of 1918.\nSuddenly we had scary news from China of a deadly new coronavirus. The deadly new Common Cold? Hmmmm.\nIn Italy, “Covid” patients were dying. And in New York, patients were being intubated (and dying) because there was “no cure”.\nExcept – France’s Professor Didier Raoult had stated (March 2020) that hydroxychloroquine was effective and this infection was readily treatable with existing cheap simple safe and effective options. Some suggested Ivermectin. Others noted that the age of the dying clustered around normal life expectancy – this was evidently a survivable infection for most.\nSo just a seasonal virus, take the cure, a couple of days off, and back to work?\nNo so fast! The full weight of government, medical authorities, and global media deployed to insist that such “cures” were untried and dangerous – “Horse dewormers” etc – especially when Mr Trump expressed support. So the intubations and deaths continued.\nBut hey, Big Pharma were working “at warp speed” on vaccines which would soon be available (at massive public expense).\nMeanwhile lockdowns ‘social distancing’ and ‘test and trace’ appeared (also at massive public expense). And in July 2020 when UK Covid deaths had evaporated (yup, it’s a seasonal infection), the media segued breathlessly into reporting “cases” (positive PCR tests).\nAnd Boris imposed a mask mandate! In mid-summer?\nIt also became clear that Covid deaths had been seriously inflated by including anyone who died with a positive test. Even if they had fallen under the proverbial bus.\nNow, I’m not medically qualified, but three things I remembered from my formative years:\n- Using masks against a virus is like stopping a swarm of Scots midges with a chain-link fence\n- Lockdowns are ineffective\n- Tests alone do not define infection – they are fallible\nIn a low-incidence population, extremely fallible. Even the WHO says so. Reputable scientists considered the PCR test unsound, but no media would report this – were we living under censorship?\nMoreover, deaths from all causes remained close to normal bounds (although flu deaths all but vanished?!).\nSo where was the ”pandemic”?\nIn 2021, mass vaccinations under emergency use authorisation (and minimal safety data) began, alongside probably the biggest fear campaign ever mounted against we the people, pushing the totally unproven assertion that the asymptomatic were spreading the virus unawares. Yet with serious excess deaths elusive, where was the emergency?\nWell, excess deaths subsequently became apparent over the time-frame that the vaccines should have kicked in to “save lives”, and they continue unabated today; yet weirdly this is a baffling mystery to everybody?\nWhy do I remember Thalidomide?\nAnd what was HM “Loyal Opposition” doing throughout?\nUntil next time …",
  "https_hantsind_com/https_hantsind_com_phil-heath-north-west-hampshire/content_163.html": "Phil Heath\nNorth West Hampshire\nI am honoured to be nominated as your Independent Parliamentary Candidate in North West Hampshire. I live in the constituency, in St Mary Bourne, a retired Senior Insurance Account Manager in the City of London and most recently a Care Worker in Basingstoke.\nI was a Basingstoke Councillor for 20 years, a County Councillor for 12 years, Vice Chairman of Hampshire Fire and Rescue Service and a Police Authority Member for Hampshire Police.\nWith many years experience in local Government, helping residents with Housing, Planning, Education and Adult Social Care I will be a champion for all residents, working solely for you with no political masters, available for you and supporting you. It’s time we give justice to Waspi women and their pensions, back increases in basic tax allowances, provide more apprenticeships, force water companies to tackle flooding and clean our rivers.\nEmail | phil.heath@hantsind.com",
  "https_hantsind_com/https_hantsind_com_2023_04/content_152.html": "OpinionImportant lessons we can learn from history Posted on April 1, 2023April 1, 2023 by Scott Neville 01 Apr Discover why it’s important to accept that humans are fallible, and what history can tell us about our own ignorance. Continue reading →",
  "https_hantsind_com/https_hantsind_com_tag_general-election/content_63.html": "Announcement, Elections2024 General Election Candidates Announced Posted on June 8, 2024June 8, 2024 by Scott Neville 08 Jun We are pleased to be announcing our candidates standing across the county in the general election! Continue reading →",
  "https_hantsind_com/https_hantsind_com_2023_09/content_38.html": "OpinionThe Energy Bill Posted on September 23, 2023September 23, 2023 by James Makin 23 Sep The Energy Bill, part of our “national security and investment policy”? Continue reading →",
  "https_hantsind_com/https_hantsind_com_category_events/content_4.html": "EventsBasingstoke Social August 2021 Posted on August 11, 2021August 11, 2021 by Stan Tennison 11 Aug We are hosting our first social event in Basingstoke on 18 August 2021. Continue reading →",
  "https_hantsind_com/https_hantsind_com_2021_03/content_22.html": "I welcome the report that confirms the police acted appropriately at the Sarah Everard vigil.\nMonthly Archives: March 2021\nThe hot topic for Eastleigh and indeed Hampshire is the refusal of E.L.A.C. to pass the application to extend the runway at Southampton Airport.\nWe are delighted to announce that councillor Andy Moore is joining Hampshire Independents.\nI am very pleased to announce that I have been selected to stand for Police and Crime Commissioner in Hampshire on behalf of Hampshire Independents.\nFare rises came into effect today. This is an unnecessary burden on those who have to use public transport.",
  "https_hantsind_com/https_hantsind_com_andy-moore-joining-hampshire-independents/content_126.html": "We are delighted to announce that councillor Andy Moore is joining Hampshire Independents.\nAndy has over twenty years of experience campaigning on behalf of Hampshire residents at both county and local level. This means that he brings a wealth of experience to his new role.\nAndy said this of joining Hampshire Independents: “I am ecstatic, honoured and privileged to work with the Hampshire Independents. I have always been an independent thinker and have worked tirelessly to help local people. It is thrilling to have the opportunity to get more bobbies on the beat, and to help people feel safer. I am passionate about helping people out. It’s more important than ever that we come together and help each other”.\nHe also said: “Being a part of Hampshire Independents will enable me to continue to forge strong links with the local community, and to help more people”.\nAlan Stone, our leader said this in response: “We are thrilled that councillor Andy Moore is joining our party. He has a wealth of knowledge and genuinely wants to help make peoples’ lives better. Also, he is extremely well known in Hampshire as a former Group Leader of Hampshire County Council.”\nIf you, or anyone you know is interested in helping to support Councillor Moore’s upcoming election campaign, then please let us know.",
  "https_hantsind_com/https_hantsind_com_tag_tactical-voting/content_134.html": "This has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.\nThis has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.",
  "https_hantsind_com/https_hantsind_com_tag_southampton-airport/content_117.html": "Isn’t it now time consider a post pandemic campaign for Hampshire and what it can offer prospective investors?\nTag Archives: Southampton Airport\nThe hot topic for Eastleigh and indeed Hampshire is the refusal of E.L.A.C. to pass the application to extend the runway at Southampton Airport.",
  "https_hantsind_com/https_hantsind_com_2021_02/content_128.html": "We are pleased to announce our first spokesperson.\nMonthly Archives: February 2021\nIn response to the article reported by Ryan Evans and the proposed Amazon development at the M3/Jct 7, if have the following comments.\nPeople are beginning to see their internet bills go up at a time when the Covid pandemic has reduced household income.\nThe impact of Covid on the economy at a time where 5% of the working population is now unemployed cannot be underestimated. What problems are we building for the future?",
  "https_hantsind_com/https_hantsind_com_2022_09/content_31.html": "OpinionCutting Edge Fabrics closes in Basingstoke Posted on September 11, 2022September 11, 2022 by Lucy Dean 11 Sep Cutting Edge Fabrics closed its doors this week after fifteen successful years in Basingstoke. Continue reading →",
  "https_hantsind_com/https_hantsind_com_public-holiday-parking-in-basingstoke/content_76.html": "December 26th. Central Car Park.\nI decided to go for a walk around the town to burn off some of the calories from the excesses of Christmas day and parked in one of the BDBC car parks. The sign on the meter clearly said “No Charges on Public Holidays”. Boxing Day for as long as I can remember has always been a Public Holiday and so I parked my car and went for a stroll around the town.\nOn my return I found a Parking Ticket (PCN) on my car windscreen stating that I had “Parked in a car park without clearly displaying a valid pay & display ticket or voucher or parking clock”. It stated the penalty was £50 but if I paid it quickly, it would reduce the penalty by 50% to £25. Given that my car was one of two cars that were in the Central Car Park, I walked over to the other car and noticed that they had also received a PCN. Clearly that driver also took the parking sign at face value in that Boxing Day is a Public Holiday.\nI sent an online appeal to Basingstoke Parking Enforcement stating that I believed they had made a mistake and that Saturday was a Public Holiday. A few days later I got a reply from them stating that Boxing Day was not an official Public Holiday and that it had been moved to the Monday 28th December. My PCN charge still stood and they expected payment. I asked to appeal their decision but was told I had to wait for the penalty charge to increase before I had the right of appeal. Incredible! However, determined that I was right, I waited for the formal letter from the BDBC and lodged my appeal online with photographic evidence of their own parking meter signage along with the empty car park that I was in. Further to this, I also provided evidence that stated that all Taxi Fares from the period between 8pm Christmas Eve to 6am on the 27th December are Tariff 3, which in effect states the following:\nBDBC taxi licensing team consider 8pm 24th December to 6am on the 27th December to be double rate because of Christmas. This premium rate for Taxi’s covers the holiday period 25th and 26th December. If 26th December is a normal working day, as BDBC are arguing, why would BDBC allow taxi’s to charge double?\nThe appeal was submitted, and as expected BDBC rejected my argument, stated that I was wrong and that £50 was now payable. It made no comment about the Taxi tariff’s but just said I was now expected to pay the £50. However, there was another route of appeal that I could take, and this was with the Traffic Penalty Tribunal who are independent lawyers who make the final decision without any further route of appeal. Still adamant that I was right in my understanding of a Public Holiday along with all the supporting evidence I had supplied, I submitted my appeal. I asked for a Zoom meeting on the date of my hearing to make my own representation. To my surprise, a short time later I received an email from the adjudicators stating that I had won the appeal as the council were wrong.\nI submitted a number of Freedom of Information (FOI) requests to the council between January and February related to parking. I asked how many tickets were purchased from the actual parking meters or the Ringo app on the 26th December 2020. I received a reply stating that 30 PCN tickets were issued in Basingstoke on that day. However, that was not the question I asked, but if all 30 had paid the £25, that is £750 straight into the coffers of BDBC which they were not entitled to. I am still waiting for my answer related to how many people actually paid for parking on the 26th.\nI also submitted an FOI asking how many people work on a normal Saturday during the year and how many people were working on the 26th December 2020. Initially I got a reply stating that there are normally shifts of parking enforcement officers, street cleaners and community safety officers working on Saturdays, but on the 26th there were only 2 parking enforcement officers. A cynic would think this was a money-making exercise by BDBC to raise revenue. A further reply from an FOI then stated that BDBC Human Resources have confirmed that for all council workers, Saturday 26th December was a Bank Holiday.\nI just hope that the other 29 people who paid their PCN fine now appeal and get their money back and that this council stop treating the residents as cash cows and start acting responsibly. But I doubt that will happen ………\nGood comment. There are a lot of things that are no go because of political correctness. I include the Gazette in this. The whole system started by voting for the right person to represent you at local and national level. With the tories there is no choice. They give you one person every time and that is it. If you disagree with her tough.",
  "https_hantsind_com/https_hantsind_com_tag_vaccine-passport/content_41.html": "OpinionStop Vaccine Passports Posted on July 28, 2021July 28, 2021 by Scott Neville 28 Jul I am opposed to the introduction of vaccine passports, I want you to help me. Continue reading →",
  "https_hantsind_com/https_hantsind_com_surveillance-state-incoming/content_2.html": "Leaving the EU in order to re-establish our national sovereignty was a good idea at the time, being the prerequisite for maintaining our freedoms to the UK’s liking as opposed to the EU’s, but it turns out that it served only to highlight the tremendous gulf between the people’s idea of freedom, and our government’s idea of freedom.\nSince the Coronavirus Act 2020 (all 348 pages of it – how long would it take to draft such a beast?) was rushed through in 3 days flat, those paying attention have seen a succession of Bills trundling through Parliament, all of which curtail our freedoms one way or another:\nOnline Harms Bill\nEnergy Bill\nGenetic Technology (Precision Breeding) Act 2023 (AKA GMO)\nHealth and Care Bill (centralising control over fluoridation of our water)\nData Protection and Digital Information (No. 2) Bill\nNot forgetting the UK –Covert Human Intelligence Sources (Criminal Conduct) Bill 2019-21 which must rank as one of the most in-your-face attacks on our “rule of law” so far.\nMost share the dubious traits of:\n- more centralisation of powers\n- ineffective monitoring and control of abuse of the system\n- delegation to government ministers of freedom to change, update, or repeal any and all aspects of the legislation by means of “regulations” that are subject to minimal scrutiny by Parliament – MPs being given a time period to object, but if none object they go through by default.\nThus the separation of powers between parliament (responsible for defining legislation) and ministers of the Crown (responsible for implementing legislation) is now cigarette paper thin. How anybody is supposed to keep track of such changes I cannot say.\nFor practical purposes, our Ministers of the Crown are now out of control.\nThe Data Protection and Digital Information (No. 2) Bill – replacing the current GDPR measures – will (on past form) shortly be passed by Parliament. The great interest of the State in obtaining our data for its own purposes (invariably accomplished by private corporations under contract to the State, itself a private corporation) is no surprise.\nWill there be scope here for the misuse of our data? Are there safeguards? Does our State really need all this data?\nWhy does section 112 of the Bill remove “… provision for regulation of CCTV etc” together with the code of practice for CCTV operation, along with with the post of “Surveillance Camera Commissioner”, from existing Acts already on the Statute Book, apparently without inclusion of any such provisions in the new Bill?\nSurveillance State incoming – or perhaps already here?",
  "https_hantsind_com/https_hantsind_com_ge24/content_115.html": "Our top priorties\nAccountability\nWe need more accountability from the Chief’s of major companies to elected politicians. With much public spotlight over the post office scandal when people get paid for “the buck stopping with them”, we need reform to make sure it really does.\nReform Public Spending\nFrom overrunning IT contracts to renting traffic cones, the public sector is ripped off due to its own overly complex procurement. While public spending does need to be transparent, it does not need to be as complicated. We will push for reform to return funding to front line services and reduce the budget deficit.\nElectoral Reform\nAt local elections “did not bother to vote” is always the clear winner. Our choice at a general election is “the big blue machine” or “the big red machine”. We need to reform the voting system to allow a wider range of voices in the democratic process hand in hand with more accountability.",
  "https_hantsind_com/https_hantsind_com_housing/content_43.html": "we promise\nCouncil social housing\nWe want the council to be more involved with the provision of social housing. The local councils are key in a joined-up approach to ensuring the vulnerable are looked after.\nBrownfield first\nWe want priority to be given to brownfield developments and other low impact sites. We need more housing, but we need countryside too.\nPredictable growth\nWe want house building to roughly track population change. We should build extra houses roughly in line with yearly population growth.",
  "https_hantsind_com/https_hantsind_com_log-in/content_168.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nSign in to Your Account\nface\nvisibility\nLost your password?\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_2022_04/content_73.html": "Announcement, Elections2022 Local Election Candidates Announced Posted on April 9, 2022April 9, 2022 by Scott Neville 09 Apr We are pleased to be announcing our candidates standing across the county in May 2022! Continue reading →",
  "https_hantsind_com/https_hantsind_com_development/content_90.html": "we promise\nInfrastructure first\nWe don’t want to stop development, but we do want to demand that infrastructure is expanded first.\nWork with developers\nWe want to work with developers, we need to move forward with housing and industrial estates fit for the future. We will ask developers what benefits their projects bring to the community.\nMake regeneration easy\nWe want to make it easier for developers to make brownfield developments their first choice. We want to prioritise these developments.",
  "https_hantsind_com/https_hantsind_com_tag_councillor-andy-moore/content_100.html": "Announcement, ElectionsCouncillor Andy Moore is joining Hampshire Independents Posted on March 18, 2021March 18, 2021 by Scott Neville 18 Mar We are delighted to announce that councillor Andy Moore is joining Hampshire Independents. Continue reading →",
  "https_hantsind_com/https_hantsind_com_tag_business/content_119.html": "Cutting Edge Fabrics closed its doors this week after fifteen successful years in Basingstoke.\nTag Archives: business\nBusiness Improvement Districts or BID’s have been around since 2003, but you may not have heard of them unless you have experience of one.",
  "https_hantsind_com/https_hantsind_com_2021-local-election-candidates-announced/content_82.html": "We are pleased to announce our candidates standing across Hampshire!\nWe are pleased to be announcing our candidates standing across the county in May! You can find the full list below. If you are able to help any of our candidates or want to know more, please get in touch. The main parties have their big party machines backing them, our candidates have a handful of volunteers giving their time freely. If you can deliver leaflets or put-up posters, please get in touch everything helps!\nBishopstoke Parish Council\nWe are pleased to report that Andy Moore was elected as our first Hampshire Independents councillor of 2021 in an uncontested election\nPolice and Crime Commissioner for Hampshire & Isle of Wight\nSteve James-Bailey – Find out more\nHampshire County Council\n| Candidate | District |\n|---|---|\n| Alan Stone | Basingstoke South East |\n| Andy Moore | Eastleigh South |\n| Caroline Mussared | Yateley East & Blackwater |\n| Charlotte Bennett | Tadley and Baughurst |\n| Christine Heath | Andover South |\n| Malc Carpenter | North East Havant |\n| Dave Watson | Odiham & Hook |\n| David White | Basingstoke North West |\n| Duncan Stone | Winchester Eastgate |\n| John Edwards | Eastleigh North |\n| Lucy Dean | Whitchurch and The Cleres |\n| Malcolm Bint | Petersfield Hangers |\n| Neil Fellman | Hartley Wintney & Yateley West |\n| Peter King | Alton Town |\n| Phil Heath | Loddon |\n| Robert Holliday | Calleva |\n| Scott Neville | Andover North |\n| Seem Alsasa | Andover West |\n| Spencer Cleary | Basingstoke South West |\n| Stan Tennison | Basingstoke Central |\n| Steve James-Bailey | Basingstoke North |\n| Timothy Douglas | Candovers, Oakley and Overton |\n| Wendy Laidlaw | Liphook, Headley & Grayshott |\nBasingstoke & Dean Borough Council\n| Candidate | Ward |\n|---|---|\n| Alan Stone | Brighton Hill |\n| Anna-Marie Moynihan | Basing & Upton Grey |\n| Charlotte Bennett | Tadley & Pamber |\n| Christine Heath | Bramley |\n| Dave Watson | Chineham |\n| David White | Kempshott & Buckskin |\n| Duncan Stone | South Ham |\n| Lucy Dean | Oakley & The Candovers |\n| Peter King | Sherborne St John & Rooksdown |\n| Phil Heath | Norden |\n| Robert Holliday | Whitchurch, Overton & Laverstoke |\n| Scott Neville | Winklebury & Manydown |\n| Seem Alsasa | Eastrop & Grove |\n| Spencer Cleary | Hatch Warren & Beggarwood |\n| Stan Tennison | Brookvale & Kings Furlong |\n| Steve James-Bailey | Popley |\nSouthampton City Council\n| Candidate | Ward |\n|---|---|\n| Kim Rose | Bargate |\nEastleigh Borough Council\n| Candidate | Ward |\n|---|---|\n| Raj Sukhdev | Eastleigh Central |\nHart District Council\n| Candidate | Ward |\n|---|---|\n| Caroline Mussared | Yateley East |\nHavant Borough Council\n| Candidate | Ward |\n|---|---|\n| Malc Carpenter | Battins |\nWe are proud to work with other community parties across the county\nPlease support our friends across the county including:\nWhitehill & Bordon Community Party\nWe have been in close contact with Andy Tree the party leader throughout the year, you can find out more about them on Facebook https://www.facebook.com/whitehillandbordon/.\nPortsmouth Independent Candidates\nThere are several independent candidates standing across the city who we support.\nCommunity Campaign (Hart)\nAnother small party who shares our vision to keep national politics out of local issues.\nbe nice to have somethiung more than just a name – how can we vote for you if we have NO data",
  "https_hantsind_com/https_hantsind_com_2022_03/content_116.html": "Climate Change, OpinionMy role as an Independent Councillor Posted on March 5, 2022March 12, 2022 by Scott Neville 05 Mar Cllr Andy Moore tells us about his work with Bishopstoke Parish Council. Continue reading →",
  "https_hantsind_com/https_hantsind_com_policy/content_12.html": "we promise\nCommunity councillors\nOur councillors don’t have a manifesto forced on them, we expect them to do what they believe is right for their constituents.\nreturn allowances\nBorough councillors will return their basic allowance to community projects in their area.\nLocal referenda\nWe will implement local referenda for key issues, targeting those who will be affected by council decisions to gain, respect and implement their response.",
  "https_hantsind_com/https_hantsind_com_business/content_64.html": "we promise\nBuy local\nCouncils should focus on buying from local firms, particularly for physical goods, supporting the local economy and reducing transport costs.\nBe flexible\nBusinesses change over time, we want to make change of use planning quick and easy. Wherever possible we should remove roadblocks to start-ups.\nGive & Take\nWorking with business to reduce restrictive red tape and encourage business development to be symbiotic within Hampshire. Remembering business pays wages and taxes, which support social infrastructure.",
  "https_hantsind_com/https_hantsind_com_author_scott-neville/content_157.html": "We are pleased to be announcing our candidates standing across the county in the general election!\nAuthor Archives: Scott Neville\nWith fraud at a record high and the majority of people received fraudulent text messages, what can we trust and why do we trust it?\nDiscover why it’s important to accept that humans are fallible, and what history can tell us about our own ignorance.\nWe are pleased to be announcing our candidates standing across the county in May 2022!\nCllr Andy Moore tells us about his work with Bishopstoke Parish Council.\nWe have asked our candidates, members and friends for their hopes and predictions for 2022. In this edition we have Spencer Cleary & Scott Neville\nI am opposed to the introduction of vaccine passports, I want you to help me.\nNow I am not a medical professional, but could the internet and a little bit of physics tell us something about the pandemic?\nWe are pleased to be announcing our candidates standing across the county in May!\nWe are delighted to announce that councillor Andy Moore is joining Hampshire Independents.\n- 1\n- 2",
  "https_hantsind_com/https_hantsind_com_2024-general-election-candidates-announced/content_109.html": "We are pleased to announce our candidates standing across Hampshire!\nWe are pleased to be announcing our candidates standing across the county in the July 2024 general election! You can find the full list below. If you are able to help any of our candidates or want to know more, please get in touch. The main parties have their big party machines backing them, our candidates have a handful of volunteers giving their time freely. If you can deliver leaflets or put-up posters, please get in touch everything helps!\nAll our candidates subscribe to our principles, and we will link to their more detailed manifesto as its published.\nAldershot\nSteve James-Bailey (steve.james-bailey@hantsind.com)\nBasingstoke\nAlan Stone (alan.stone@hantsind.com)\nEast Hampshire\nJim Makin (jim.makin@hantsind.com)\nFareham and Waterlooville\nRobert Holliday (robert.holliday@hantsind.com)\nFarnham & Bordon\nDon Jerrard (don.jerrard@hantsind.com)\nGosport\nDave Watson (dave.watson@hantsind.com)\nHamble Valley\nBinka Griffin (binka.griffin@hantsind.com)\nNorth East Hampshire\nDuncan Stone (duncan.stone@hantsind.com)\nNorth West Hampshire\nPhil Heath (phil.heath@hantsind.com)\nWinchester\nAndy Liming (andy.liming@hantsind.com)\nHaving stood for parliament myself for a Fringe Party I know what it takes out of the candidates and their pre-active supporters. I can only hope that more people are looking AT the candidates this time around and less so the political parties!\nAs it appears all of your candidates have differing focuses, it is extremely difficult to form an opinion. unless they vocalise on here and out in the constituency (I didn’t even know there was a a Hampshire Independents group until I got my postal voting form) what they are about so that an informed opinion can be made it is unlikely that people will vote for them unless its just a protest vote against main stream parties and that’s not really how to govern a country. Please put some meat on the bones. Get the candidates to give us their… Read more »\nOur priorities can be found here: https://hantsind.com/ge24/\nThanks for that, at least its given me some idea, I would suggest that links from each of the candidates names above straight to their thoughts would be a great way of making that easier to find.",
  "https_hantsind_com/https_hantsind_com_tag_eu/content_125.html": "OpinionJim’s Thoughts on Being an Independent Posted on January 29, 2023January 29, 2023 by James Makin 29 Jan Jim Makin shares his thoughts on being independent with us after it was posted in the Alton Herald Continue reading →",
  "https_hantsind_com/https_hantsind_com_sign-up/content_162.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nRegistration is disabled in this site.\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_policing-in-the-modern-age/content_83.html": "We are all equal before the law. Controversial? We don’t think so. Democracy advocates that all people should be treated equally. Controversial? We don’t think so. The human condition dictates that all lives matter. Controversial? Only if you’re brainwashed, or fearful of appalling hypocrisy crashing about your ears or worse – fearful of politically influenced police commissioners and chief constables that have a dick (Cressida), but no balls (colloquial).\nBy not listening to the majority, the chief puppeteers are creating racial divisions, not healing them. Indeed anyone with the temerity to question, is not an upstanding member of the public, but a far right activist, as the administers of our laws make no distinction between honest right wing politics and the extreme right. Consequently, a vociferous minority aren’t challenged because the force is neutered through fear of false accusation or disciplinary action.\nLet’s consider those who uphold the law and just how far we’ve moved away from Peel’s principles; so far in fact that many of us how now moved Orwell’s 1984 to the non-fiction section of our book collections. Dear Robert believed that police effectiveness is not measured on the number of arrests, but on the lack of crime. The approach expressed in his principles is commonly known as policing by consent, but this doesn’t mean policing by consent of that minority, but the consent of a society as a whole, as society that is founded on the equality of all its citizens.\nHe believed in seeking to preserve public favour, not by pandering to public opinion, but by constantly demonstrating absolutely impartial service to law, in complete independence of policy. In this model of policing, police officers are regarded as citizens in uniform. They exercise their powers to police their fellow citizens with the implicit consent of those fellow citizens with a transparency about their powers, their integrity in exercising those powers and their accountability for doing so.\nWe don’t see much of that today. We want this decline into the the farcical, the blatant move to partiality – where the vociferous few are indulged and the honest vilified – to stop now. We need to return to that place where our police officers are supported at every level, where they uphold the law, not politically expediency – and reverse this creeping evolution of Thought Police UK.\nThe Hampshire Independents have supreme respect for what the police are capable of doing in our name, but this county needs a new collective name, who will stop the degeneration and fight for the robust force that Hampshire society needs.",
  "https_hantsind_com/https_hantsind_com_donate_donate-50/content_52.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\n50 Pound Donation\n50 Pound Donation\nDonation\n*\n£ 50.00\nTotal Amount\nI want to contribute this amount every\nevery\nweek\nmonth\nyear\nDonor Information\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone Number\nAddress Line 1\n*\nAddress Line 2\nTown\n*\nCounty\n*\n- select State/Province -\nAberdeen City\nAberdeenshire\nAngus\nAntrim and Newtownabbey\nArds and North Down\nArgyll and Bute\nArmagh City, Banbridge and Craigavon\nBedfordshire\nBelfast\nBerkshire\nBlaenau Gwent\nBridgend\nBristol, City of\nBuckinghamshire\nCaerphilly\nCambridgeshire\nCardiff\nCarmarthenshire\nCauseway Coast and Glens\nCeredigion\nCheshire\nClackmannanshire\nClwyd\nCo Antrim\nCo Armagh\nCo Down\nCo Fermanagh\nCo Londonderry\nCo Tyrone\nConwy\nCornwall\nCounty Durham\nCumbria\nDenbighshire\nDerbyshire\nDerry City and Strabane\nDevon\nDorset\nDumfries and Galloway\nDundee City\nDyfed\nEast Ayrshire\nEast Dunbartonshire\nEast Lothian\nEast Renfrewshire\nEast Riding of Yorkshire\nEast Sussex\nEdinburgh, City of\nEssex\nFalkirk\nFermanagh and Omagh\nFife\nFlintshire\nGlasgow City\nGloucestershire\nGreater Manchester\nGwent\nGwynedd\nHampshire\nHerefordshire\nHertfordshire\nHighland\nInverclyde\nIsle of Anglesey\nIsle of Wight\nKent\nLancashire\nLeicestershire\nLincolnshire\nLisburn and Castlereagh\nLondon\nMerseyside\nMerthyr Tydfil\nMid and East Antrim\nMid Glamorgan\nMid Ulster\nMidlothian\nMonmouthshire\nMoray\nNa h-Eileanan Siar\nNeath Port Talbot\nNewport\nNewry, Mourne and Down\nNorfolk\nNorth Ayrshire\nNorth Lanarkshire\nNorth Yorkshire\nNorthamptonshire\nNorthumberland\nNottinghamshire\nOldham\nOmagh\nOrkney Islands\nOxfordshire\nPembrokeshire\nPerth and Kinross\nPowys\nRenfrewshire\nRhondda, Cynon, Taff\nRutland\nScottish Borders\nShetland Islands\nShropshire\nSomerset\nSouth Ayrshire\nSouth Glamorgan\nSouth Gloucestershire\nSouth Lanarkshire\nSouth Yorkshire\nStaffordshire\nStirling\nSuffolk\nSurrey\nSwansea\nTorfaen\nTyne and Wear\nVale of Glamorgan, The\nWarwickshire\nWest Dunbartonshire\nWest Glamorgan\nWest Lothian\nWest Midlands\nWest Sussex\nWest Yorkshire\nWiltshire\nWorcestershire\nWrexham\nPostcode\n*\nJoin Mailing List\n*\n- select Join Mailing List -\nNo\nYes\nContribute\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_tag_pcc/content_28.html": "Announcement, Elections2021 Local Election Candidates Announced Posted on April 10, 2021April 10, 2021 by Scott Neville 10 Apr We are pleased to be announcing our candidates standing across the county in May! Continue reading →",
  "https_hantsind_com/https_hantsind_com_author_john-edwards/content_135.html": "Isn’t it now time consider a post pandemic campaign for Hampshire and what it can offer prospective investors?\nAuthor Archives: John Edwards\nThe hot topic for Eastleigh and indeed Hampshire is the refusal of E.L.A.C. to pass the application to extend the runway at Southampton Airport.\nPeople are beginning to see their internet bills go up at a time when the Covid pandemic has reduced household income.\nThe impact of Covid on the economy at a time where 5% of the working population is now unemployed cannot be underestimated. What problems are we building for the future?\nFor many years, Hampshire has watched developers change the faces of our cities, towns and countryside. A growing population demands that we change with the times. But change for the worst, is what many fear is happening now.",
  "https_hantsind_com/https_hantsind_com_volunteer/content_71.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nCONTACT US TODAY\nCompany\nFirst Name\n*\nPhone number\nLast Name\n*\nPost Code\n*\nEmail\n*\nJoin our mailing list?\nNo\nYes\nMore information\n*\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_stop-vaccine-passports/content_164.html": "Dear MP,\nI am writing as one of your constituents. I wish to bring up the issue of domestic vaccine passports which the government is proposing to introduce for access to nightclubs and other venues “where large crowds gather”. This is an issue I feel particularly strongly about, and I would ask you regardless of any party affiliation to vote against these discriminatory and totalitarian measures.\nFirstly, vaccine passports are inequitable and will create a segregated society; a shameful situation for the country that funded the end of the transatlantic slave trade, and which has worked hard to end segregation on racial grounds. It has been observed that the take up of the vaccine is related to ethnicity, with Polish nationals having one of the lowest rates of vaccination in the UK. On closer inspection this makes complete sense, as most Polish nationals will remember the years of oppression they endured at the hands of the Nazis and the Soviets. Also, take up amongst the BAME community has also been lower than the remainder of the population. However you may wish to justify the introduction of said passports, there can be no denying they will recreate some degree of racial division and tension. An utterly appalling situation.\nSecondly, can we get a clear confirmation of what the vaccine passports are intended to achieve? If the government is to be believed, the coronavirus vaccine does not stop transmission of the virus, but in fact lessens the effects on the recipient (to avoid serious complications). It seems to me that the unvaccinated are in fact more at risk from the vaccinated and are therefore much more likely to be denigrated. Have I misunderstood the purpose of the passports and the intention is to keep the vaccinated people out of nightclubs and other venues?\nFurther to this, the vaccine minister Nadhim Zahawi has confirmed that even those who were given a placebo vaccine will still get a vaccine passport, regardless of the fact they may not have been immunised against the virus. Clearly the purpose of the vaccine is not a question of health, but a question of compliance.\nThe proposals of the vaccine passports are very similar to the proposed ID card schemes of Tony Blair’s government. I find it interesting to note that previously our prime minister said he would tear up and eat such a card should it ever be introduced. This is in complete contrast to the position he now adopts, since he is being vocal in his support of such ID cards. How can the prime minister be trusted when he is so inconsistent?\nUnder current human rights legislation religion or belief are protected characteristics. Therefore, the introduction of vaccine passports will clearly override these human rights. As you know, the law works on precedence; once vaccine passports have paved the way for trashing human rights legislation, this, or future governments (which you may or may not be a part of) will find it much easier to violate our other human rights.\nOn one final note, if you are adamant you wish to ignore my wishes and vote in favour of a segregated society, can you answer me this one question: at any time in history, can you name me one instance where increased government surveillance, and a divided society have allowed freedoms to be restored?\nThank you for taking the time to read this letter.\nREPLY FROM STEVE BRINE MP As you can appreciate, I am getting a fair few on this subject and (like many members) was surprised when the Minister said in the House last week: “at the end of September we plan to make full vaccination a condition of entry to those high-risk settings where large crowds gather and interact.” A number of us pointed at that this will be a decision for the HOUSE OF COMMONS not the Executive so we will see. I am instinctively hostile to this idea (because we have long ago protected the vulnerable – groups 1-9… Read more »\nReply From Maria Miller MP: Thank you for contacting about COVID-status certification and vaccine passports. I apologise for the delay in responding. As we learn to live with this virus, some of life’s most important pleasures and opportunities are likely to be increasingly dependent on vaccination. For example, there are already countries that require you to be double jabbed as a condition of quarantine free travel and that list seems likely to grow as more countries catch up to our successful vaccination programme. As we have opened up our economy and society from 19 July, ministers are concerned – as people… Read more »\nMaria Millers reply is a boiler plate letter same as the one I got. She’s not in the slightest bit interested or bothered. Waste of time, been in place far too long.\nI am against vaccine passports-please all.. email your MP/s before it is too late\nIt is an ABSOLUTE WASTE OF TIME writing to Maria Miller; she is irrelevant and is a puppet MP!! Frankly most of them are self-serving OXYGEN THIEVES!!",
  "https_hantsind_com/https_hantsind_com_author_stan-tennison/content_142.html": "We are hosting our first social event in Basingstoke on 18 August 2021.\nAuthor Archives: Stan Tennison\nWe are all equal before the law. Controversial? We don’t think so. Democracy advocates that all people should be treated equally. Controversial? We don’t think so. The human condition dictates that all lives matter. Controversial? Only if you’re brainwashed, or fearful of appalling hypocrisy crashing about your ears or worse – fearful of politically influenced",
  "https_hantsind_com/https_hantsind_com_author_stevej-b/content_46.html": "I welcome the report that confirms the police acted appropriately at the Sarah Everard vigil.\nAuthor Archives: Steve James-Bailey\nI am very pleased to announce that I have been selected to stand for Police and Crime Commissioner in Hampshire on behalf of Hampshire Independents.",
  "https_hantsind_com/https_hantsind_com_category_climate-change/content_111.html": "Jim Makin discusses propaganda and how that might relate to predictions made in the past. First published in the Alton Herald.\nCategory Archives: Climate Change\nCllr Andy Moore tells us about his work with Bishopstoke Parish Council.\nWind farm and solar electricity is much more efficient, but green energy is still only part of it. We need to develop an environmental attitude to where we buy our goods and services.",
  "https_hantsind_com/https_hantsind_com_2020_06/content_138.html": "This is nothing but a Conservative plan to reduce services. I agree some households do not need a weekly refuse service, but some do. This service is supplied to everyone regardless of need. Crowded households, those in flats and those with young children/babies will suffer by having to keep rubbish in and around their homes\nMonthly Archives: June 2020\nThe UK government decided to lockdown the country for all but essential key workers. Is this the best option? The government is stating they are going to pay 80% of furloughed peoples salaries for a period of time which is in fact a cost to the tax-payer. Apart from the money, our money, that is",
  "https_hantsind_com/https_hantsind_com_tag_farnborough/content_144.html": "As a candidate for Whitchurch and the Cleres and Oakley and the Candovers, I am delighted to announce that this year I am fundraising on behalf of Wessex Heartbeat.\nTag Archives: Farnborough\nIsn’t it now time consider a post pandemic campaign for Hampshire and what it can offer prospective investors?",
  "https_hantsind_com/https_hantsind_com_reset-password/content_160.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nReset Your Password\nface\nReturn to Login\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_author_jimmfreecitizen-uk/content_27.html": "Jim takes reviews the bills passing through parliament and asks if the surveillance state is incoming?\nAuthor Archives: James Makin\nJim takes a look at the history books to review what is going on in Israel and Palestine\nDominic Cummings – one-time evil guru of Downing Street, or saviour of the Tory government?\nThe Energy Bill, part of our “national security and investment policy”?\nJim Makin discusses propaganda and how that might relate to predictions made in the past. First published in the Alton Herald.\nWe all make assumptions about politics, but how often do we check they are correct?\nThis week Jim shares his reflections on the Covid pandemic – previously posted in the Alton Herald.\nJim Makin shares his thoughts on being independent with us after it was posted in the Alton Herald",
  "https_hantsind_com/https_hantsind_com_category_rubbish/content_140.html": "With our waste recycling centres (previously known as “the dump”) now charging for certain types of waste to be discarded, there is no doubt that this has increased the number of fly-tipping incidents that have happened in and around Basingstoke. Add on to that the long queues to get into the dump, that are a",
  "https_hantsind_com/https_hantsind_com_author_alan-stone/content_106.html": "It is often forgotten that there are more legitimate firearm users than there are people with criminal intent – my thoughts on Hampshire’s Gun Amnesty.\nAuthor Archives: Alan Stone\nBasingstoke’s waterways are being used to dump excess untreated sewage. I ask Maria to stand up for our environment.\nBasingstoke Council have launched another tick box survey on the new Town Centre Concept.\nFare rises came into effect today. This is an unnecessary burden on those who have to use public transport.\nFollowing a complaint from a member of the public about being fined for parking in a car park run by Basingstoke & Deane Borough Council (BDBC), Alan Stone decided to investigate.\nWind farm and solar electricity is much more efficient, but green energy is still only part of it. We need to develop an environmental attitude to where we buy our goods and services.\nThis is nothing but a Conservative plan to reduce services. I agree some households do not need a weekly refuse service, but some do. This service is supplied to everyone regardless of need. Crowded households, those in flats and those with young children/babies will suffer by having to keep rubbish in and around their homes",
  "https_hantsind_com/https_hantsind_com_author_lucy-dean/content_30.html": "Cutting Edge Fabrics closed its doors this week after fifteen successful years in Basingstoke.\nAuthor Archives: Lucy Dean\nOn Sunday 3rd October I am due to run the London Marathon on behalf of Wessex Heartbeat.\nAs a candidate for Whitchurch and the Cleres and Oakley and the Candovers, I am delighted to announce that this year I am fundraising on behalf of Wessex Heartbeat.",
  "https_hantsind_com/https_hantsind_com_donate_donate-5/content_74.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\n5 Pound Donation\n5 Pound Donation\nDonation\n*\n£ 5.00\nTotal Amount\nI want to contribute this amount every\nevery\nmonth\nyear\nDonor Information\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone Number\nAddress Line 1\n*\nAddress Line 2\nTown\n*\nCounty\n*\n- select State/Province -\nAberdeen City\nAberdeenshire\nAngus\nAntrim and Newtownabbey\nArds and North Down\nArgyll and Bute\nArmagh City, Banbridge and Craigavon\nBedfordshire\nBelfast\nBerkshire\nBlaenau Gwent\nBridgend\nBristol, City of\nBuckinghamshire\nCaerphilly\nCambridgeshire\nCardiff\nCarmarthenshire\nCauseway Coast and Glens\nCeredigion\nCheshire\nClackmannanshire\nClwyd\nCo Antrim\nCo Armagh\nCo Down\nCo Fermanagh\nCo Londonderry\nCo Tyrone\nConwy\nCornwall\nCounty Durham\nCumbria\nDenbighshire\nDerbyshire\nDerry City and Strabane\nDevon\nDorset\nDumfries and Galloway\nDundee City\nDyfed\nEast Ayrshire\nEast Dunbartonshire\nEast Lothian\nEast Renfrewshire\nEast Riding of Yorkshire\nEast Sussex\nEdinburgh, City of\nEssex\nFalkirk\nFermanagh and Omagh\nFife\nFlintshire\nGlasgow City\nGloucestershire\nGreater Manchester\nGwent\nGwynedd\nHampshire\nHerefordshire\nHertfordshire\nHighland\nInverclyde\nIsle of Anglesey\nIsle of Wight\nKent\nLancashire\nLeicestershire\nLincolnshire\nLisburn and Castlereagh\nLondon\nMerseyside\nMerthyr Tydfil\nMid and East Antrim\nMid Glamorgan\nMid Ulster\nMidlothian\nMonmouthshire\nMoray\nNa h-Eileanan Siar\nNeath Port Talbot\nNewport\nNewry, Mourne and Down\nNorfolk\nNorth Ayrshire\nNorth Lanarkshire\nNorth Yorkshire\nNorthamptonshire\nNorthumberland\nNottinghamshire\nOldham\nOmagh\nOrkney Islands\nOxfordshire\nPembrokeshire\nPerth and Kinross\nPowys\nRenfrewshire\nRhondda, Cynon, Taff\nRutland\nScottish Borders\nShetland Islands\nShropshire\nSomerset\nSouth Ayrshire\nSouth Glamorgan\nSouth Gloucestershire\nSouth Lanarkshire\nSouth Yorkshire\nStaffordshire\nStirling\nSuffolk\nSurrey\nSwansea\nTorfaen\nTyne and Wear\nVale of Glamorgan, The\nWarwickshire\nWest Dunbartonshire\nWest Glamorgan\nWest Lothian\nWest Midlands\nWest Sussex\nWest Yorkshire\nWiltshire\nWorcestershire\nWrexham\nPostcode\n*\nJoin Mailing List\n*\n- select Join Mailing List -\nNo\nYes\nContribute\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_privacy-policy/content_13.html": "Privacy Policy\nWe value privacy because of its value to you. It belongs to you and The Hampshire Independents are committed to processing your data honestly, ethically, with integrity and always consistent with applicable laws. The intention our our approach is to enable you to make simple and meaningful choices about your privacy.\nWho we are\nWe are Hampshire Independents, a UK political party registered with the Electoral Commission (RPP6665544). Our website address is: https://handsind.com\nWhat personal data we collect and why we collect it\nComments\nWhen visitors leave comments on the site we collect the data shown in the comments form, and also the visitor’s IP address and browser user agent string to help spam detection.\nAn anonymized string created from your email address (also called a hash) may be provided to the Gravatar service to see if you are using it. The Gravatar service privacy policy is available here: https://automattic.com/privacy/. After approval of your comment, your profile picture is visible to the public in the context of your comment.\nMedia\nIf you upload images to the website, you should avoid uploading images with embedded location data (EXIF GPS) included. Visitors to the website can download and extract any location data from images on the website.\nContact Forms\nWe have a number of contact forms where we may collect the following information:\n- Name\n- Email Address\n- Postcode\n- Telephone number\nWe will use this information to process your enquiry and to respond to any comments. Where the contact form has a specific purpose (for example to tell us about an issue that is important to you) we will use this information to understand the level of public support and the distribution of that support.\nMembership\nWe are open to members joining our party. For our members we will collect the following information:\n- Name\n- Email Address\n- Full Address (including postcode)\n- Telephone Number\n- Payment Details (provided by the payment processor)\nWe will use this information to process your membership including sending invitations to relevant meetings. Your membership details and history will be kept on file until you request we delete it. Audit trails relating to financial records will be kept in line with current legislation.\nDonations\nWe accept donations providing they comply with current UK legislation. With donations we will collect the following information:\n- Name\n- Email Address\n- Full Address (including postcode)\n- Payment Details (provided by the payment processor)\nCookies\nIf you leave a comment on our site you may opt-in to saving your name, email address and website in cookies. These are for your convenience so that you do not have to fill in your details again when you leave another comment. These cookies will last for one year.\nIf you visit our login page, we will set a temporary cookie to determine if your browser accepts cookies. This cookie contains no personal data and is discarded when you close your browser.\nWhen you log in, we will also set up several cookies to save your login information and your screen display choices. Login cookies last for two days, and screen options cookies last for a year. If you select “Remember Me”, your login will persist for two weeks. If you log out of your account, the login cookies will be removed.\nIf you edit or publish an article, an additional cookie will be saved in your browser. This cookie includes no personal data and simply indicates the post ID of the article you just edited. It expires after 1 day.\nEmbedded content from other websites\nArticles on this site may include embedded content (e.g. videos, images, articles, etc.). Embedded content from other websites behaves in the exact same way as if the visitor has visited the other website.\nThese websites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including tracking your interaction with the embedded content if you have an account and are logged in to that website.\nAnalytics\nWe do not use any third party analytics tools.\nWho we share your data with\nYour data will be shared with our payment processor (PayPal) where you are making a donation or subscribing to a membership. In some cases we are required by law to share data with the Electoral Commission. We are required to report details of income and expenditure and we will report these to the Electoral Commission.\nHow long we retain your data\nIf you leave a comment, the comment and its metadata are retained indefinitely. This is so we can recognize and approve any follow-up comments automatically instead of holding them in a moderation queue.\nFor users that register on our website, we also store the personal information they provide in their user profile. All users can see, edit, or delete their personal information at any time (except they cannot change their username). Website administrators can also see and edit that information. Financial records (donations, memberships, etc) are retained in line with current UK law.\nWhat rights you have over your data\nIf you have an account on this site, or have left comments, you can request to receive an exported file of the personal data we hold about you, including any data you have provided to us. You can also request that we erase any personal data we hold about you. This does not include any data we are obliged to keep for administrative, legal, or security purposes.\nWhere we send your data\nVisitor comments may be checked through an automated spam detection service.\nYour contact information\nYou can contact us via our contact us form or writing to us at our office shown on the footer of the website.\nAdditional information\nHow we protect your data\nOur site is only accessible via a secure (HTTPS) connection and sorted on servers within the UK. The site infrastructure is managed by Ionos and the website is managed by Hampshire Independents. The Ionos data centre is based in London and is ISO 27001 certified. We use automated technology to identify attempted breaches and alert our admin team, accounts are automatically locked after a number of failed authentication attempts. We have a policy on installing software patches as soon as possible via our admin team. The data is held on the CiviCRM system which is only accessible to a limited number of party officers. Backups are taken daily of our site and email systems, these are held off site for 10 days.\nWhat data breach procedures we have in place\nNotification – Any data breach should be reported to the party officers via email or telephone. Automatic intrusion detection software installed on the website will notify the party officers of any suspicious activity.\nOnce notified the party offices (with relevant technical skill) will investigate the incident. Multiple officers have access to the web server logs and all party officers have access to the audit information recorded on the website. Should a data breach be confirmed by the party officers the scope of the data breach will be identified. The party officers will contact the effected individuals, informed them of the data breach and what information has been lost or compromised. The party officers will notify the Office of the Information Commissioner should they believe this to be required under UK data protection law.\nWhat third parties we receive data from\nWe may receive data from the Electoral Commission, unless required this will be held outside of our website.\nWhat automated decision making and/or profiling we do with user data\nWe do not make any automated decisions based on the data provided. We may profile data to understand the level of support for certain issues or to understand the popularity of our policies.\nIndustry regulatory disclosure requirements\nHampshire Independents is registered with the Electoral Commission registration: RPP6665544. Our Registered offices are: Hampshire Independents, 9A New Street, Basingstoke, Hampshire, RG21 7DE.",
  "https_hantsind_com/https_hantsind_com_donate_donate-25/content_137.html": "Skip to content\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\n25 Pound Donation\n25 Pound Donation\nDonation\n*\n£ 25.00\nTotal Amount\nI want to contribute this amount every\nevery\nweek\nmonth\nyear\nDonor Information\nFirst Name\n*\nLast Name\n*\nEmail\n*\nPhone Number\nAddress Line 1\n*\nAddress Line 2\nTown\n*\nCounty\n*\n- select State/Province -\nAberdeen City\nAberdeenshire\nAngus\nAntrim and Newtownabbey\nArds and North Down\nArgyll and Bute\nArmagh City, Banbridge and Craigavon\nBedfordshire\nBelfast\nBerkshire\nBlaenau Gwent\nBridgend\nBristol, City of\nBuckinghamshire\nCaerphilly\nCambridgeshire\nCardiff\nCarmarthenshire\nCauseway Coast and Glens\nCeredigion\nCheshire\nClackmannanshire\nClwyd\nCo Antrim\nCo Armagh\nCo Down\nCo Fermanagh\nCo Londonderry\nCo Tyrone\nConwy\nCornwall\nCounty Durham\nCumbria\nDenbighshire\nDerbyshire\nDerry City and Strabane\nDevon\nDorset\nDumfries and Galloway\nDundee City\nDyfed\nEast Ayrshire\nEast Dunbartonshire\nEast Lothian\nEast Renfrewshire\nEast Riding of Yorkshire\nEast Sussex\nEdinburgh, City of\nEssex\nFalkirk\nFermanagh and Omagh\nFife\nFlintshire\nGlasgow City\nGloucestershire\nGreater Manchester\nGwent\nGwynedd\nHampshire\nHerefordshire\nHertfordshire\nHighland\nInverclyde\nIsle of Anglesey\nIsle of Wight\nKent\nLancashire\nLeicestershire\nLincolnshire\nLisburn and Castlereagh\nLondon\nMerseyside\nMerthyr Tydfil\nMid and East Antrim\nMid Glamorgan\nMid Ulster\nMidlothian\nMonmouthshire\nMoray\nNa h-Eileanan Siar\nNeath Port Talbot\nNewport\nNewry, Mourne and Down\nNorfolk\nNorth Ayrshire\nNorth Lanarkshire\nNorth Yorkshire\nNorthamptonshire\nNorthumberland\nNottinghamshire\nOldham\nOmagh\nOrkney Islands\nOxfordshire\nPembrokeshire\nPerth and Kinross\nPowys\nRenfrewshire\nRhondda, Cynon, Taff\nRutland\nScottish Borders\nShetland Islands\nShropshire\nSomerset\nSouth Ayrshire\nSouth Glamorgan\nSouth Gloucestershire\nSouth Lanarkshire\nSouth Yorkshire\nStaffordshire\nStirling\nSuffolk\nSurrey\nSwansea\nTorfaen\nTyne and Wear\nVale of Glamorgan, The\nWarwickshire\nWest Dunbartonshire\nWest Glamorgan\nWest Lothian\nWest Midlands\nWest Sussex\nWest Yorkshire\nWiltshire\nWorcestershire\nWrexham\nPostcode\n*\nJoin Mailing List\n*\n- select Join Mailing List -\nNo\nYes\nContribute\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_tag_portsmouth/content_91.html": "OpinionA Prosperous Post-Pandemic Future for Hampshire Posted on April 12, 2021April 12, 2021 by John Edwards 12 Apr Isn’t it now time consider a post pandemic campaign for Hampshire and what it can offer prospective investors? Continue reading →",
  "https_hantsind_com/https_hantsind_com_tag_policing/content_16.html": "Opinion, PolicingSarah Everard vigil: Police Watchdog Report Reaction Posted on March 31, 2021March 31, 2021 by Steve James-Bailey 31 Mar I welcome the report that confirms the police acted appropriately at the Sarah Everard vigil. Continue reading →",
  "https_hantsind_com/https_hantsind_com_open-letter-to-maria-miller-basingstoke-waterways/content_132.html": "Dear Maria,\nBack in 2015, I was a parliamentary candidate for Basingstoke, in the general election.\nI unearthed quite a significant issue. Our waterways, the Loddon, the Itchen and others were being used to dump excess untreated sewage. During our investigation, Hampshire County councillor, Andy Moore and myself met with a representative of Southern Water. That representative confirmed that “accidental” spillages occur regularly into the Itchen and other waterways. He also stated that Southern Water had no plans to build new sewage works in the medium term (5-10 years) and they only had sewage capacity for a few hundred new homes. Thames Water had no plans either.\nThat was 5 years ago, since then 1000’s of new homes have been built across Hampshire, particularly inner town flats. Sewage overspills are happening daily. Both Hampshire County Council and Basingstoke & Deane Borough Council have been covering up this environmental disaster for years. I reported on this problem back in 2015, nothing has improved. With so much house building in Hampshire this problem will only escalate. Neither Southern Water nor Thames water will voluntarily build sewage treatment facilities, they must be compelled.\nIt has only now come to light that Hampshire County Council has given the green light on raw sewage overflow from Buckskin being piped to Saunders Field, which was recently sited as a future beauty spot for the leisure park development. This is the source of the river Loddon. The Conservatives are actually allowing contaminants like nitrates, cleaning chemicals and hormones (from contraceptives) as well as the obvious, to contaminate Eastrop Park and the chalk stream running through Old Basing.\nI understand how difficult it must be for the Conservative party in Basingstoke and Hampshire to stop this happening, so much of their funding comes from developers. Unless we want a major health or environmental crisis, we must block home building until vital infrastructure like sewage and water works, are put in place. We need drastic action to improve our sewerage systems and waterways or this problem will only escalate. Over 100,000 new homes are planned for Hampshire with no extra sewage works. Is it all going to be pumped into our streams and rivers? The Loddon, the Itchen and other rivers in Hampshire must not be used as a dumping ground for anything, let alone sewage.\nYours\nAlan Stone\nIf we continue dumping sewerage into the rivers we will be back to pre victorian times in a few years. ☹\nAt least the Victorians were honest about it!\nCanvey Island is a classic case where by raw sewage floated out of the Thames which would quite often turn in a sea mist. Which, when breath in causing terrible chest complaints or even death, especially if you were new to the area. Many women die in this way, until they cleaned up the River Thames. We are heading in that direction again, the health of the community is under threat unless something done now and immediately.\nThe data West Heath (Bow Brook, which flows into River Loddon): 74 spills, 1138.78 hours Kingsclere STW (Kingsclere Brook, which flows into River Enborne): 105 spills, 1669.61 hours Crooked Billet, Hook (River Whitewater): 19 spills, 42.85 hours Sherfield-on-Loddon (Bow Brook, which flows into River Loddon): 34 spills, 393.36 hours Basingstoke STW (River Loddon): 40 spills, 410.85 hours Hartley Wintney STW (River Hart): 41 spills, 442.81 hours Wedmans Lane, Rotherwick (eventually flows into River Whitewater): 6 spills, 37.43 hours Water End, near Andwell (Lyde River): 5 spills, 25.73 hours St Stephens Hall, near Little London (Bow Brook, which flows into River… Read more »\nFor many years it seem that I haven’t had a political party which inspired me. I am not in the minority because many of my friend are equally in the same opinion. But the common interest you state are similar to my beliefs. It really needs a broader appeal to be successful, to catch the floating voters like me who have not found a new party to join.",
  "https_hantsind_com/https_hantsind_com_tag_covid-19/content_81.html": "This week Jim shares his reflections on the Covid pandemic – previously posted in the Alton Herald.\nTag Archives: covid-19\nI am opposed to the introduction of vaccine passports, I want you to help me.\nNow I am not a medical professional, but could the internet and a little bit of physics tell us something about the pandemic?",
  "https_hantsind_com/https_hantsind_com_2023_03/content_87.html": "Jim Makin discusses propaganda and how that might relate to predictions made in the past. First published in the Alton Herald.\nJim Makin discusses propaganda and how that might relate to predictions made in the past. First published in the Alton Herald.",
  "https_hantsind_com/https_hantsind_com_pcc_survey/content_108.html": "Steve wants yo hear your feedback\nI can only accept responses from people that live in Hampshire or the Isle of Wight.\n \nI want to know how crime and criminality has affected you, how you see the police and how you value the police.\nI want to know how crime and criminality concerns you, what things keep you awake at night, what do you believe can be done better?\nYou have seen my 5 priorities; you can read them in more detail here. Please place them in order, 5 being the most important to you, 1 being the least important.\nYou have seen my 5 priorities; you can read them in more detail here. Have I missed anything?\nOverall, what do you think about my plans?\nThank you for taking the time to send me your feedback. Would you be interested in hearing more from me?\nYou can unsubscribe from and of our emails at any time, full details of our privacy policy can be found here.",
  "https_hantsind_com/https_hantsind_com_tag_fly-tipping/content_55.html": "With our waste recycling centres (previously known as “the dump”) now charging for certain types of waste to be discarded, there is no doubt that this has increased the number of fly-tipping incidents that have happened in and around Basingstoke. Add on to that the long queues to get into the dump, that are a",
  "https_hantsind_com/https_hantsind_com_2021_11/content_78.html": "OpinionOpen Letter to Maria Miller MP Posted on November 29, 2021November 29, 2021 by Alan Stone 29 Nov Basingstoke’s waterways are being used to dump excess untreated sewage. I ask Maria to stand up for our environment. Continue reading →",
  "https_hantsind_com/https_hantsind_com_internet-poverty-my-thoughts/content_65.html": "People are beginning to see their internet bills go up at a time when the Covid pandemic has reduced household income.\nMillions of Virgin Media customers will soon see a price hike of up to £54 a year. Most of the company’s UK cable customers will receive an increase of between £2.50 and £4.50 per month. Letters to customers have already started to drop on the door mat.\nAs more citizens turn to technology with another national lockdown underway, Virgin Media customers will see an average increase of £3.63 a month, equivalent to four per cent.\nThis is 13 times higher than the current consumer price inflation (CPI) rate which stands at 0.3 per cent, as of November 2020.\nBT, Three and Vodafone customers have recently been notified about incoming price rises for their monthly bills. Those who have packages from BT can expect no good news if they have a landline, broadband, TV, sport and a mobile phone included within their package.\nAnd there’s more grim news for those consumers who subscribe to Netflix and Disney who are also experiencing price rises if they haven’t already occurred yet.\nLockdown sees a captive audience that is relying upon these providers to help maintain a semblance of normality in these difficult times. A lot of families have not met for up to a year and in many cases and can only stay in touch via the internet and mobile phone networks.\nFamilies who normally enjoying escaping the everyday routine through maybe a meal out or organised sports and leisure for instance, now rely upon the internet and mobile phone networks. Home schooling has also making its demands on networks.\nWith the exception of Netflix who was reportedly in debt last year to the tune of $15 billion, companies such as Vodafone had a Euro4.1 billion profit, Virgin a £5.1 billion profit, BT a £2.7 billion profit and Disney, a $11 billion profit.\nYet despite hardships being experienced through no fault of their own, hard pressed citizens are being asked to pay more. No one expects something for nothing. But would it not be a grand gesture by these companies who we have come to rely upon, to offer some sort of relief on monthly bills?\nIf nothing is forthcoming from such companies, it would not be unexpected to see swathes of customers switching providers.",
  "https_hantsind_com/https_hantsind_com_jims-thoughts-on-being-an-independent/content_101.html": "Hampshire Independents are a local political party, without manifesto, whose purpose is to support independent candidates for election in Hampshire.\nWithout manifesto because we believe that policies should be appropriate to local circumstances, and it’s inappropriate to impose policies centrally.\nBut we have principles which candidates undertake to promote (see them at https://hantsind.com/) which are very much what you would expect of a local party.\nSo what about my policies as an independent politician?\nAs a supporter of leaving the EU I have always supported independence.\nOne might think that in Britain this concept would be uncontroversial – we fought a world war ostensibly to retain both our own independence and to restore the same to others, yet after a long train of subterfuges and usurpations we found ourselves (in apparent defiance of our constitution) members of a supranational EU whose laws ranked above our own.\nHow did that come about? Both major political parties avoided a vote on the matter. Ted Heath and Harold Wilson took us into the putative arrangement by calling it a “common market” without much mentioning the ultimate destination – many years later after a “totalitarian tiptoe” of integrationist steps, the Commission published a Constitution for the EU in 2005 – on which we British never voted because (bless them!) both the French and the Dutch rejected it.\nUndaunted, the Commission redrafted it as the “Lisbon Treaty” and Gordon Brown signed us up without so much as a “by your leave” (although he notably funked attending the official signing ceremony).\nHappily, goaded by UKIP’s subsequent success at the polls, David Cameron blinked and promised us a referendum about leaving, and we the people voted “Out”!\nMrs May’s government then tried every trick in the book to pretend to be leaving without actually leaving, which was hilarious to observe but tragic for our democracy, now revealed as a sham where the main parties all dance to the same mysterious piper.\nOur MPs do not represent “we the people”, they represent those who through funding and/or other means control our political parties.\nThen along came Boris, picking up Theresa’s “Hotel California” Withdrawal Agreement and saying “Let’s get Brexit Done!”; followed by Covid, lockdowns, and all other ludicrous measures designed to make us fearful, divided, and above all, compliant no matter the cost.\nNow we find the WEF-UN partnership weaponising the WHO “pandemic preparedness” treaty, to give themselves powers to override freedoms the world over; of course to “keep us safe” in the next pandemic. Given that the last real pandemic was the Spanish flu a century ago, what do we think is the real probability that we are suddenly now in for a whole succession of real pandemics?\nWhat to do?\nIndependence starts with us. It’s personal. We have a remarkable organ between our ears – we should use it. Politics isn’t for everyone, but even if we don’t agree with everything above, we can see where outsourcing our thinking to the political parties takes us.\nIf we want freedom we will have to reclaim politics from the establishment and make it truly ours.\n“Ask not what your country can do for you – ask what you can do for your country” – JFK.\nUntil next time …\n[…] Last time, I summarised UK Politics over the last 50 years. […]",
  "https_hantsind_com/https_hantsind_com_jim-makin-east-hampshire/content_167.html": "JIm Makin\nEast Hampshire\n“For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places” – Ephesians 6:12\nResident of Petersfield. Retired, following a working life in Information Technology, mainly for manufacturing enterprises using IT to support their businesses\n- Leave the WHO and all putative global governance bodies that are unaccountable to “we the people”. The internal affairs of the UK are a matter for the people of the UK only, through their true representatives in Parliament.\n- Banish political parties from Parliament. They are unaccountable for election promises and plainly controlled by external UN/WEF agencies. Elected MPs should be accountable to their constituents only.\n- Discard the antagonistic tradition of “government” and “opposition”, reform Parliament around policy groups (current prototype: APPGs). We are stronger when we cooperate than when we fight.\n- Delete the Crown Prosecution Service bureaucracy, return responsibility for prosecutions to the police where it belongs.\n- Reform the Police to honour their oath as constables, to serve the people, and to uphold the law without fear or favour.",
  "https_hantsind_com/https_hantsind_com_help-us/content_7.html": "volunteering is great\nDo you support one of our campaigns or do you just think local decisions should be made by local people? We need people to spread the word about what we do online and in the real world. Volunteering is a great way to meet people with ideas and help them shape the future.",
  "https_hantsind_com/https_hantsind_com_category_opinion/content_48.html": "Jim takes reviews the bills passing through parliament and asks if the surveillance state is incoming?\nCategory Archives: Opinion\nJim takes a look at the history books to review what is going on in Israel and Palestine\nDominic Cummings – one-time evil guru of Downing Street, or saviour of the Tory government?\nThe Energy Bill, part of our “national security and investment policy”?\nWith fraud at a record high and the majority of people received fraudulent text messages, what can we trust and why do we trust it?\nDiscover why it’s important to accept that humans are fallible, and what history can tell us about our own ignorance.\nJim Makin discusses propaganda and how that might relate to predictions made in the past. First published in the Alton Herald.\nWe all make assumptions about politics, but how often do we check they are correct?\nThis week Jim shares his reflections on the Covid pandemic – previously posted in the Alton Herald.\nJim Makin shares his thoughts on being independent with us after it was posted in the Alton Herald",
  "https_hantsind_com/https_hantsind_com_a-plan-to-reduce-services/content_165.html": "This is nothing but a Conservative plan to reduce services. I agree some households do not need a weekly refuse service, but some do. This service is supplied to everyone regardless of need. Crowded households, those in flats and those with young children/babies will suffer by having to keep rubbish in and around their homes for longer. Increased vermin and disease.\nWhat we need to develop is daily collections of refuse from community refuse storage areas. Used by those who need it and not used by those who do not. Doorstep collections of rubbish just causes pavement cluttered with various coloured wheelie bins, unless of course you have a huge garden and a nice long drive!\nSubscribe\n0 Comments\nOldest",
  "https_hantsind_com/https_hantsind_com_tag_history/content_15.html": "OpinionA lesson in History and War Posted on October 29, 2023October 29, 2023 by James Makin 29 Oct Jim takes a look at the history books to review what is going on in Israel and Palestine Continue reading →",
  "https_hantsind_com/https_hantsind_com_tag_basingstoke/content_26.html": "Cutting Edge Fabrics closed its doors this week after fifteen successful years in Basingstoke.\nTag Archives: Basingstoke\nWe are pleased to be announcing our candidates standing across the county in May 2022!\nWe have asked our candidates, members and friends for their hopes and predictions for 2022. In this edition we have Spencer Cleary & Scott Neville\nBasingstoke’s waterways are being used to dump excess untreated sewage. I ask Maria to stand up for our environment.\nBasingstoke Council have launched another tick box survey on the new Town Centre Concept.\nWe are hosting our first social event in Basingstoke on 18 August 2021.\nFree Parking on public Holidays, simple right?\nIn response to the article reported by Ryan Evans and the proposed Amazon development at the M3/Jct 7, if have the following comments.",
  "https_hantsind_com/https_hantsind_com_tag_independence/content_94.html": "OpinionJim’s Thoughts on Being an Independent Posted on January 29, 2023January 29, 2023 by James Makin 29 Jan Jim Makin shares his thoughts on being independent with us after it was posted in the Alton Herald Continue reading →",
  "https_hantsind_com/https_hantsind_com_2021_08/content_105.html": "EventsBasingstoke Social August 2021 Posted on August 11, 2021August 11, 2021 by Stan Tennison 11 Aug We are hosting our first social event in Basingstoke on 18 August 2021. Continue reading →",
  "https_hantsind_com/https_hantsind_com_the-challange-of-stated-and-unstated-assumptions/content_129.html": "I might be loosely described as an IT factotum – programmer, analyst, project manager, consultant, troubleshooter, help desk supervisor – I have built PCs and installed operating systems.\nTo make computers work we must set emotions aside in favour of evidence and logic. Likewise to design human interfaces and troubleshoot problems we must account for human factors.\nI learned to park my emotions and respect evidence and logic – so when senior management complain that a system “doesn’t work” and “when will I fix it?”, I respond: “show me the evidence, then I can fix it”.\nI discovered that technical problems are not always caused by faulty program code. It sometimes happens that the code is perfect – but it doesn’t work! How so?\nAll code relies on (stated and unstated) assumptions – that the hardware and operating systems work, the network works, data in the databases comply with rules, etc. When the code is perfect but doesn’t work, it’s an underlying assumption that is broken.\nAnd so it is with politics. Do our systems of government work, or are they broken? There is a reason we re-elect our politicians every few years – we need to weed out those that don’t work. But we’ve been doing that for at least a century, and few would say that all is now satisfactorily responsive.\nSo what assumptions underlie our political systems?\n- Our electoral systems are incorruptible.\n- Elected politicians are incorruptible. They are not, they are human. How corrupt are they? How do the corrupt get weeded out?\n- Elected politicians represent our interests. In practice they obey the political parties. Who controls the parties? “Follow the money” is but one useful guide.\n- The civil service works for our government. There are thousands of civil servants in the cabinet office alone – more than enough to run rings around any cabinet minister (“Yes Minister” was a documentary!).\n- Our politicians can change any legislation. But much control is delegated to NGOs QUANGOs and regulators of byzantine complexity, even charities (yes, the Franco-British Council is a “charity”), making change an impossibly glacial process.\n- Our politicians owe primary allegiance to their voters. But their sojourn in the EU belies that belief, international treaties need not be voted in Parliament, and steadfast adherence to extra-national bodies (UN-WEF, NATO) is asserted. Are these bodies all trustworthy and democracy-compatible?\n- Parliament’s website states: “Parliamentary sovereignty is a principle of the UK constitution. It makes Parliament the supreme legal authority in the UK, which can create or end any law. Generally, the courts cannot overrule its legislation”.\nThese statements are simply wrong.\nBoth constitutional law and Common Law override Parliament and legislation. Magna Carta 1215 still holds. The monarch must agree all Acts of Parliament, and is constrained by the Coronation Oath. Any jury can ignore unjust legislation or legal precedent via a “not guilty” verdict. This is our remaining constitutional defence against tyranny.\nDoes Parliament not know this?",
  "https_hantsind_com/https_hantsind_com_tag_amazon-warehouse/content_88.html": "In response to the article reported by Ryan Evans and the proposed Amazon development at the M3/Jct 7, if have the following comments.\nIn response to the article reported by Ryan Evans and the proposed Amazon development at the M3/Jct 7, if have the following comments.",
  "https_hantsind_com/https_hantsind_com_category_opinion_page_3/content_50.html": "I welcome the report that confirms the police acted appropriately at the Sarah Everard vigil.\nCategory Archives: Opinion\nThe hot topic for Eastleigh and indeed Hampshire is the refusal of E.L.A.C. to pass the application to extend the runway at Southampton Airport.\nFare rises came into effect today. This is an unnecessary burden on those who have to use public transport.\nIn response to the article reported by Ryan Evans and the proposed Amazon development at the M3/Jct 7, if have the following comments.\nPeople are beginning to see their internet bills go up at a time when the Covid pandemic has reduced household income.\nThe impact of Covid on the economy at a time where 5% of the working population is now unemployed cannot be underestimated. What problems are we building for the future?\nThis has been the election of all elections for tactical voting, and all based on one policy – Brexit! It only supports our concerns that the current political system is broken.",
  "https_hantsind_com/https_hantsind_com_tag_parking/content_92.html": "ParkingPublic Holiday Parking in Basingstoke Posted on April 27, 2021April 28, 2021 by Spencer Cleary 27 Apr Free Parking on public Holidays, simple right? Continue reading →",
  "https_hantsind_com/https_hantsind_com/content_1.html": "latest news\nStay updated with Hampshire Independents\n2024 General Election Candidates Announced\nWe are pleased to be announcing our candidates standing across the county in the general\n4 Comments\nread more\n08\nJun\nJun\nSurveillance State Incoming?\nJim takes reviews the bills passing through parliament and asks if the surveillance state is\nread more\n12\nNov\nNov\nA lesson in History and War\nJim takes a look at the history books to review what is going on in\n4 Comments\nread more\n29\nOct\nOct",
  "https_hantsind_com/https_hantsind_com_tag_cost-of-living/content_5.html": "OpinionInternet Poverty – My Thoughts Posted on February 8, 2021February 1, 2021 by John Edwards 08 Feb People are beginning to see their internet bills go up at a time when the Covid pandemic has reduced household income. Continue reading →",
  "https_hantsind_com/https_hantsind_com_2021_10/content_146.html": "OpinionBasingstoke Town Centre Concept Posted on October 31, 2021October 31, 2021 by Alan Stone 31 Oct Basingstoke Council have launched another tick box survey on the new Town Centre Concept. Continue reading →",
  "https_hantsind_com/https_hantsind_com_re-the-proposed-amazon-development/content_159.html": "In response to the article reported by Ryan Evans and the proposed Amazon development at the M3/Jct 7, if have the following comments.[1]\nWhilst not a fan of Amazon for many reasons, two of which are the impact Amazon has to the high street and the fact that they pay minimal tax to the exchequer, I am not overly averse to the proposed development. However, I would demand undertakings from Amazon along the lines of the following. Amazon should be made to ensure that the entry on and off of Jct7 is improved and able to handle the increased traffic load of all the lorries that will be using it. Also, Amazon must ensure that any lorries using the site must only use Junction 7 and not cut through on the A303 past the crematorium or go through the middle of town if coming via the A339 or A33. It must be mandated that all lorries using this route use the motorway from Jct6 to Jct7. Also, whilst I also realise that the majority of the jobs at the warehouse are likely to be zero hour contracts, it is worth remembering that some people actually like the flexibility of this model. There are always going to be pro’s and con’s with any new development, but we need to look at the Amazon warehouse with a realistic view. If the site does not get approved, it does not mean Amazon will scrap the plans to build a Warehouse. It just means they would build it somewhere else. That means another town will get the benefit of those jobs and Basingstoke town will lose the revenue from the workers that could have been earning their money here and spending it here. We need to accept the Amazon warehouse, but put conditions on Amazon that aren’t too punitive that they change their mind, but are realistic and show them that we will work with them to bring that business, which is much needed, to our town. Every new development brings objections, we just need to weigh up the positives against the negatives.\n[1] https://www.basingstokegazette.co.uk/news/19036681.basingstoke-gateway-homeowners-lives-transformed/",
  "https_hantsind_com/https_hantsind_com_2023_11/content_131.html": "OpinionSurveillance State Incoming? Posted on November 12, 2023 by James Makin 12 Nov Jim takes reviews the bills passing through parliament and asks if the surveillance state is incoming? Continue reading →",
  "https_hantsind_com/https_hantsind_com_an-issue-of-trust/content_18.html": "Action Fraud report that “Almost 21 million reports have been made to the Suspicious Email Reporting Service (SERS), resulting in the removal of over 235,000 malicious websites”[1]. Eight in ten people have experienced some sort of text message or telephone call just over the summer[2]. Shockingly 4.5 million fraud offences were recorded April 2021/March 2023 which represents a 25% increase[3].\nSo what is fraud? The Cambridge dictionary provides two definitions[4]:\n- The crime of getting money by deceiving people\n- Someone who deceives people by saying that they are someone or something that they are not\nThis is only part of the answer though because legally in the UK Fraud is defined in the Fraud Act 2006. As you might expect the act is quite lengthy, but we will summarise as follows:\nA person is guilty of fraud if they dishonestly make a false representation and intends to make a gain for someone. A representation is false if its untrue or misleading and the person knows it might be untrue or misleading[5].\nYou might be wondering where this is going. Well, firstly protect yourself! Ask yourself this, if something is true (your account is about to be closed) how do you know its true? So, lets say you get a text message saying your account is about to be closed, can you verify it? Surely if this is true the bank must know something about it, why not call them to find out? But wait, how do you know the telephone number in the text message is valid, well on the back of most bank cards they print the telephone number, so you can double check the number in the text message. Alternatively, you can check on the paperwork you have received in the post, or on their website.\nAnother example you have an invoice via email for some work done, you must have phoned or spoken to the company to get them to do the work, so phone them back ask them to confirm the bank details on the invoice. No reputable company will complain about you asking about how to pay them money.\nNothing is immune to fraud. Even Harvard Business school (the prestigious university in America) has been a victim of academic fraud [6] [7] [8].\nIf you find yourself a victim of fraud, I can only suggest that you report it to ActionFraud: https://www.actionfraud.police.uk/ as soon as possible, they may be able to help, they may not I don’t know. I am no expert on solving cases of fraud, my background is science where we work to establish what is true. But on the subject of establishing what is true, why do so many trust politicians? I could sit here and write a list of all the time politicians in the UK have mislead (you could argue defrauded the electorate, but for some reason that does not count), but I am already 37, I don’t think I have enough life left to complete such a list.\nMost interestingly electoral fraud in the UK does not include outright lies during the campaign [9]. So if a politician says “We will cut immigration” or “We will fix the deficit” or “We will make people wealthier” or “free cheeseburgers for everyone”, what is our options if that is a lie? Well, none! There is no comeback if a politician lies during the campaign (other than the definition set out by the Electoral Commission), so why would they not lie to make themselves look better? The age-old joke is true, Question: “how do you tell if a politician is lying?”, Answer: “Their lips move”.\nSo, before you go vote for anyone, please double check their claims!\nReferences\n[1] Neighbourhoodalert.co.uk email dated 20 June 2023 https://www.ourwatchmember.org.uk/Alerts/A/91044\n[2] Ofcom: https://www.ofcom.org.uk/phones-telecoms-and-internet/advice-for-consumers/scams/7726-reporting-scam-texts-and-calls\n[3] ONS: https://www.ons.gov.uk/peoplepopulationandcommunity/crimeandjustice/articles/natureoffraudandcomputermisuseinenglandandwales/yearendingmarch2022\n[4] Cambridge Dictionary: https://dictionary.cambridge.org/dictionary/english/fraud\n[5] Fraud Act 2006: https://www.legislation.gov.uk/ukpga/2006/35/section/2\n[6] Data Colada: https://datacolada.org/109\n[7] Data Colada: https://datacolada.org/110\n[8] Data Colada: https://datacolada.org/111\n[9] Electoral Commission: https://www.electoralcommission.org.uk/i-am-a/voter/report-electoral-fraud\nI admire how this blog promotes kindness and compassion towards ourselves and others We could all use a little more of that in our lives",
  "https_hantsind_com/https_hantsind_com_tag_local-elections/content_23.html": "Announcement, Elections2021 Local Election Candidates Announced Posted on April 10, 2021April 10, 2021 by Scott Neville 10 Apr We are pleased to be announcing our candidates standing across the county in May! Continue reading →",
  "https_hantsind_com/https_hantsind_com_who-we-are/content_143.html": "Hampshire Party Leaders\nBe Independent, Think Independent, Vote Independent\nBe Independent, Think Independent, Vote Independent\nFounder | Party Leader\nAlan is a father of four and a Grandfather of four. He has lived and worked in Basingstoke for 50 years. He runs his own business and is an employer who understands that tax from business profits funds the support and care for the needy, local amenities, Policing and other key services. He believes nothing in this life should be taken for granted; rights are earned and come with a price tag of commitment. Our politicians have let us down. Their promises come without the commitment to follow through, empty words designed to fill election leaflets. Things need to change. Councillors work for us, the residents and tax payers of our towns. Not the other way round. Government and Council money does not belong to politicians. It is our money and must be spent wisely.\nFounder | Nominating Officer\nScott has followed politics since a young age. He is a lifelong believer in localism and people being empowered to take control of their own lives. Since 2015 he has been disappointed in major national parties using national issues in local politics. Scott thinks that where possible problems should always be solved as close to the affected people as possible. Scott has campaigned for both the alternative vote referendum in 2011 and the EU referendum in 2016 believing that it’s never wrong to ask the electorate. Scott is very keen to promote a low tax environment which makes it easy to do business while supporting and encouraging business to do social good. Scott’s key values are: individual liberty, equality under the law and localism.\nScott was born in Basingstoke and has lived and worked in Hampshire all his life. He has worked in software development roles supporting UK policing since completing a BSc in Computer Science and MSc in Data Science and Artificial Intelligence. Scott is a keen runner having completed the Basingstoke Half Marathon numerous times as well as the Fleet Half Marathon and the New Forest Marathon.\nFounder | Chairman\nStan has lived in Basingstoke for over fifty years. He was apprenticed in the town then worked in the Public Sector and then for two major blue chip companies, gaining a MSc with Distinction at Portsmouth University. He now runs his own business, a successful consultancy supporting major telcos. He understands that tax from business profits fund the support and care for the needy, local amenities, policing and other key services. He believes that Council money does not belong to the politicians, it is our money and must be spent wisely – and transparently.\nStan will be available for you and will strongly support and promote the community in the Basingstoke council. As your local councillor, Stan will fight for issues that concern you and not a party whip. Stan opposes over-development, especially any development on our green belt. The people should decide if they need more housing – not a council that just panders to government-set targets.\nFounder | Treasurer\nSpencer was originally born in London and moved to Hampshire over 20 years ago for a better life for his children. He is a father of 4 and recently became a Grandad in February 2020. He is an investigator for a Global IT company where he has been employed for the last 23 years. He is very interested in Politics and was involved in the Vote Leave campaign as he believes the UK has a much better future under its own rule without the interference of Brussels. From a local perspective, he feels that the Basingstoke Councillors that represent the main Political Parties are not at all independent and just tow the line in relation to what they say and what they do. He feels these Councillors are not working in the best interests of the people they are there to represent. Basingstoke is a growing town and without the right representation at a local level, there are likely to be decisions made that are not favourable to the residents of this great town. Being an Independent Councillor means there is no higher power to obey and the words and actions that he takes will be for the people and not for the Political Party.\nNow you met our party leaders, its time to read our story and how it all started.\nOur story\nOur members and leaders have been involved in many campaigns, find out what we have been up to.\nOur campaigns",
  "https_hantsind_com/https_hantsind_com_category_uncategorized/content_118.html": "This is nothing but a Conservative plan to reduce services. I agree some households do not need a weekly refuse service, but some do. This service is supplied to everyone regardless of need. Crowded households, those in flats and those with young children/babies will suffer by having to keep rubbish in and around their homes\nCategory Archives: Uncategorized\nThe UK government decided to lockdown the country for all but essential key workers. Is this the best option? The government is stating they are going to pay 80% of furloughed peoples salaries for a period of time which is in fact a cost to the tax-payer. Apart from the money, our money, that is\nBusiness Improvement Districts or BID’s have been around since 2003, but you may not have heard of them unless you have experience of one.",
  "https_hantsind_com/https_hantsind_com_charlotte-bennett-youth-groups-spokesperson/content_17.html": "We are pleased to announce our first spokesperson. We select spokespeople who have specific expertise in a particular field. They are there to help our candidates and councillors offering help and advice.\nToday we are pleased to announce Charlotte Bennett as our spokesperson on Youth Groups.\nHampshire Independents believe overbearing red tape has hindered people volunteering to set up and help at youth groups. We believe council officials and employees should be there to assist rather than obstruct the youth voluntary sector.\nYou can contact Charlotte at any time via email: charlotte.bennett {at} hantsind.com",
  "https_hantsind_com/https_hantsind_com_donate/content_123.html": "You can donate via PayPal using finance@hantsind.com or direct into our bank account (Sort Code: 30-96-26 / Account No: 75930160).\nPlease be aware that we must record certain information about all donations, any donations larger than £499 we must verify and record your identity.",
  "https_hantsind_com/https_hantsind_com_downloads/content_66.html": "Downloads\nFirst Name*\nLast Name*\nAddress Line 1*\nAddress Line 2\nTown*\nCounty*\nPostcode*\nback to main site\nWho we are\nParty Leadership\nOur Story\nOur Campaigns\nPrinciples\nMembership\nJoin Our Party\nFind Events\nHelp us\nLatest\nJoin\nhelp us\ndonate\nThis site uses cookies to improve your browsing experience. By browsing this website, you agree to our use of cookies.\nAccept",
  "https_hantsind_com/https_hantsind_com_2018_11/content_113.html": "Business Improvement Districts or BID’s have been around since 2003, but you may not have heard of them unless you have experience of one.\nBusiness Improvement Districts or BID’s have been around since 2003, but you may not have heard of them unless you have experience of one.",
  "https_hantsind_com/https_hantsind_com_fly-tipping-can-it-be-solved-for-the-benefit-of-all/content_96.html": "With our waste recycling centres (previously known as “the dump”) now charging for certain types of waste to be discarded, there is no doubt that this has increased the number of fly-tipping incidents that have happened in and around Basingstoke. Add on to that the long queues to get into the dump, that are a regular occurrence, and now the fact that all cars have to be registered and pre-booked before attending, the fly-tipping has proven to have gotten worse. Recent Freedom of Information requests that have been submitted to Basingstoke and Deane Borough Council are very alarming. I will share some of those highlights with you.\nTotal number of fly-tipping incidents reported to Basingstoke and Dean Borough Council (BDBC)\n| 2018 | 2093 reports |\n| 2019 | 2138 reports |\n| 2020 | 2699 as of 14 November 2020 |\nThe numbers clearly speak for themselves in that fly-tipping is increasing year on year. Now let’s consider the reasons for fly-tipping. If someone is going to be charged for the disposal of certain types of waste, for example, rubble, sanitary units, plasterboard to name just a few, then there are going to be some people who are going to object to paying those fees and would rather take the easier and very much cheaper option of just fly-tipping their waste anywhere they can. That waste can then cause serious environmental issues especially if that waste contains asbestos or plasterboard. BDBC are then paying council employees to record the incident and then more employees to go and collect the waste. FOI numbers for total waste tonnage collected are below:\n| 2018 | 992 tonnes |\n| 2019 | 941 tonnes |\n| 2020 | 535 tonnes as of 14 November 2020 |\nIt is important to note that BDBC have changed the way fly-tipping waste is measured as they have changed the categories for what is waste and what isn’t. Interesting why they decided to do that in a year that has seen increased numbers of reported cases. A cynic could think this is to dilute the numbers and therefore not present the problem to be as big as it really is. But I will let you decide on why they have made this change in reporting.\nBDBC pay one full time officer to whose sole remit is the investigation and enforcement of waste offence. BDBC also have other officers from the Community Safety Team and Street Cleansing Teams assist with the physical removal and cleaning of the fly-tipping sites. Now we need to look at how successful the full time officer has been in prosecuting those that are caught fly-tipping.\n| 2018 | 2093 reported incidents. 80 cases were investigated. Only 6 were charged and prosecuted. Summary = 4% investigated. 0.3% successfully prosecuted |\n| 2019 | 2138 reported incidents. 119 cases were investigated. Only 8 were charged and prosecuted. Summary = 5.5% investigated. 0.37% successfully prosecuted |\n| 2020 | (14th November) 2699 reported incidents. 119 cases were investigated. Only 8 were charged and prosecuted. Summary = 3.7% investigated. 0.33% successfully prosecuted |\nIs this a good return on the investment of a full time employee who is paid a salary, pension and many other benefits that the council offer its employees? I will let you decide.\nIt is worth mentioning that Hampshire County Council (HCC) pay for the Waste Recycling Centres (dumps) and sub-contract that task out to independent contractors. The money that is paid to these contractors when chargeable waste is taken to the dump is retained by the contractors. Furthermore, any money that is paid to these contractors when you find something at the dump that you want to take away, is also charged for. So in effect, someone has taken their waste to the dump that is classed as rubbish. The contractors sort through that waste and take out what they believe to be valuable, and then sell that back to anyone that wants to pay for it. So they are getting 3 different types of income, money from HCC, money from certain waste disposal and money from sales.\nBDBC take all the waste collected from fly-tipping to the Veolia waste facility in Chineham. The cost of sending this waste to Veolia in Chineham is paid for by HCC. Let’s think about this for a second. HCC pay the contractors (Veolia) to run the dumps. BDBC pay for the management , collection costs and clean-up costs of the fly-tipped waste. HCC then pay the costs of that fly-tipped waste to be taken to the Veolia Chineham waste facility. What do you think the costs would be if HCC contracted the waste contractors to accept any and all types of waste ? There would be a lot less cases of fly tipping. There would be a considerable reduction in clean up costs and all the other hidden costs that exist. Our streets and country lanes would be cleaner and less chance of being polluted by any contaminated waste. Ironically the HCC control the waste facilities, yet the costs of fly tipping are borne by local councils. However, the fly-tipped waste is then charged back to HCC to dispose of once the local authority take it to the waste facilities. What a mess this is with the amount of cross charging and management involved in this madness.\nSurely the benefit and cost savings are obvious for all to see. Allow any and all waste to be received at the dumps. No charges should be levied, after all we pay for the HCC and BDBC in our council taxes so why should we pay twice. The amount of fly-tipping would reduce dramatically as would the costs of all the clean up needed to decontaminate certain sites. Does it not make economic sense as well as being environmentally aware of the obvious benefit to all?\nTotally agree with all that was said.It applies equally to all borough councils across the land.Maybe some day,someone will listen.",
  "https_hantsind_com/https_hantsind_com_basingstoke/content_154.html": "Since the lockdown rules have been relaxed, we have now organised our first social outing and we would love for you to join us. You don’t need to be a member or have been deeply involved, if you just fancy a meal and a chat about local issues with others that care, feel free to come along.\nWe are hosting a curry night on Wednesday 18th August 2021 in Basingstoke (top of town) starting at 19:30. We have booked lots of space, but there is a limit and it is first come first serve.\nIf you are interested please email us info@hantsind.com or contact us to let us know you would like to come (and how many). We will then confirm the venue if there is space.\nWant to know about future events early? Join our mailing list at the bottom of any page, we give everyone on our mailing list at least a weeks extra notice!",
  "https_hantsind_com/https_hantsind_com_are-we-dealing-with-this-coronavirus-lockdown-in-the-correct-way/content_114.html": "The UK government decided to lockdown the country for all but essential key workers. Is this the best option?\nThe government is stating they are going to pay 80% of furloughed peoples salaries for a period of time which is in fact a cost to the tax-payer. Apart from the money, our money, that is being used to keep people at home, those companies of those employees are going to struggle. With a lockdown of the country, people are not able to go out and spend money. Shops are not allowed to be open for anything other than essential shopping items. Small independent business are likely never to recover. Those people on furlough are still going to be nervous when the lockdown comes to an end as their employers may not be able to trade anymore due to the impact on shoppers not being able to go out and spend money. Unemployment will inevitably rise which means we, the tax payer, are going to be paying more into the social pot to cover the costs of benefits. The government will have no choice to borrow billions to survive.\nWould not the best option have been to take this as seriously as a military threat back in January and immediately build the NHS infrastructure (that will be needed for the future, inevitable, pandemics), sponsor the research into new vaccines and allow the country to continue as normal? Yes there would be people getting the virus, and yes there would be deaths , just like there is now, but we would be able to handle the situation without the catastrophe that has now happened. The economy would still be carrying on as normal, the country would still be running, people would still be working and getting paid.\nThis country has in my opinion made a mistake. When you consider that on average 1500 people in the UK die every day of other conditions, the numbers for Coronavirus deaths are not anywhere near that figure. We don’t lock down the country for the Flu virus that plagues the country every year. We should have just spent the money on the NHS to be prepared for the numbers of people that would contract the virus. Most people would survive and more importantly , their bodies would be stronger for it. We are not letting our bodies fight diseases anymore but instead choose to throw ant-biotics at everyone. If this Coronavirus returns as a different strain again next year, are we going to shut down the country again? We need to re-evaluate our position and think about the long term effect of what this lockdown is doing to the country and the economy.",
  "https_hantsind_com/https_hantsind_com_tag_eastleigh-councillor/content_8.html": "Announcement, ElectionsCouncillor Andy Moore is joining Hampshire Independents Posted on March 18, 2021March 18, 2021 by Scott Neville 18 Mar We are delighted to announce that councillor Andy Moore is joining Hampshire Independents. Continue reading →",
  "https_hantsind_com/https_hantsind_com_2021_01/content_151.html": "Following a complaint from a member of the public about being fined for parking in a car park run by Basingstoke & Deane Borough Council (BDBC), Alan Stone decided to investigate.\nMonthly Archives: January 2021\nWith our waste recycling centres (previously known as “the dump”) now charging for certain types of waste to be discarded, there is no doubt that this has increased the number of fly-tipping incidents that have happened in and around Basingstoke. Add on to that the long queues to get into the dump, that are a",
  "https_hantsind_com/https_hantsind_com_category_opinion_page_2/content_69.html": "Cutting Edge Fabrics closed its doors this week after fifteen successful years in Basingstoke.\nCategory Archives: Opinion\nIt is often forgotten that there are more legitimate firearm users than there are people with criminal intent – my thoughts on Hampshire’s Gun Amnesty.\nCllr Andy Moore tells us about his work with Bishopstoke Parish Council.\nWe have asked our candidates, members and friends for their hopes and predictions for 2022. In this edition we have Spencer Cleary & Scott Neville\nBasingstoke’s waterways are being used to dump excess untreated sewage. I ask Maria to stand up for our environment.\nBasingstoke Council have launched another tick box survey on the new Town Centre Concept.\nI am opposed to the introduction of vaccine passports, I want you to help me.\nNow I am not a medical professional, but could the internet and a little bit of physics tell us something about the pandemic?\nAs a candidate for Whitchurch and the Cleres and Oakley and the Candovers, I am delighted to announce that this year I am fundraising on behalf of Wessex Heartbeat.\nIsn’t it now time consider a post pandemic campaign for Hampshire and what it can offer prospective investors?",
  "https_hantsind_com/https_hantsind_com_conservatives-are-on-the-wrong-track/content_112.html": "Despite the current crisis, looming recession and lowest passenger figures for decades, rail companies, under government control, have increased prices on rail transport. Fare rises came into effect today. This is an unnecessary burden on those who have to use public transport. Key workers and low paid most affected.\nSouth West Trains continue to increase costs for travelling whilst wages are frozen. Speaking to a guard on south west trains this morning, Alan Stone learned that south west train staff wages have been frozen for the next few years.\n“The Conservatives at all levels are out of touch with real life” Alan (party leader) says. “It is the wrong time to increase costs, these increases are going to affect key workers and the low paid paid disproportionally. Public transport should cheap and readily available. We will need a cheap and reliable public transport system to get our country back on its feet after the Covid crisis. This and increases to car parking charges are hitting commuters hard”.\nThe headline picture is a photograph taken today at Winchester Station."
}