{
  "https_www_johncope_uk_/https_www_johncope_uk_news_we-won-free-short-stay-parking-returning-elmbridge/content_2.html": "Thanks to the support of local residents, we’ve finally (after four years!) convinced Elmbridge Council to bring back the free short stay parking they took away. Huge damage has been done to our high streets in that period, but hopefully they can now start to recover.\nBack in 2021, a group of local Conservative councillors launched a community campaign to help local shops and revive our high streets after the Council stripped free short stay parking. Thousands of residents, signed our petition or shared your support. And while our Liberal Democrat run Council ignored us for many years, they’ve finally done what we all called for.\nIt shouldn’t have taken this long. And no doubt they’ll pretend it was their idea. But what matters now is that free short stay parking is in place and it’s a win for our community.\nConservatives willl keep standing up for practical, common-sense policies that support residents and local businesses.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_inflation-has-fallen-23-111-october-2022/content_6.html": "It’s inflation that eats into your savings and makes your money not stretch as far. That’s why the Prime Minister made halving it his number one priority. We’ve achieved that, with inflation down at 2.3% - back to normal and its lowest point since 2021.\nThe plan is working. That’s why it’s important we stick with it.\nFind out what lower inflation means for you here.",
  "https_www_johncope_uk_/https_www_johncope_uk_campaigns_scrapping-unfair-ulez-tax-elmbridge-residents/content_32.html": "ULEZ is an unfair tax that hits the most vulnerable. We have prevented signs going up in Elmbridge, now we need to get ULEZ scrapped.\nLabour's Mayor of London has implemented his unfair ULEZ expansion, with the unanimous backing of Liberal Democrat Assembly Members.\nThis is despite little evidence it will help the environment or improve air quality. Instead, ULEZ is hitting those on lower incomes, pensioners, and local businesses outside London, who may no longer be able to afford to serve customers there due to this unfair charge on their livelihoods.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_uk-economy-one-fastest-growing-europe/content_30.html": "There is no doubt it has been a difficult few years, but today’s growth figures are proof that by sticking to the plan the economy is turning a corner for the first time since the pandemic and global energy crisis.\n- The economy is showing strong growth of 0.6%\n- Interest rates increasingly likely to be cut\n- Earnings and pensions are growing strongly above inflation\n- Inflation has fallen to 3.2% from 11.1% in October 2022 – now at the lowest rate in two and a half years\n- Employment remains at near record highs at 75%, up by 4.8 points since 2010\nIt's not just these big headline indicators. Beneath them you'll find some impressive milestones too:\nThe UK is the fastest growing major European economy since 2010, with the IMF predicting the same for the next 6 years and we have decarbonised faster than any economy in the G7. We are both the 3rd largest technology sector in the world and have the 3rd highest rate of “greenfield” foreign direct investment.\nThis is all despite a global pandemic, global energy crisis, and war in Europe and the Middle East.\nThere’s still lots more to do, but today’s news shows why it’s important we stick to the plan that’s working. Find out more here.",
  "https_www_johncope_uk_/https_www_johncope_uk_contact/content_18.html": "Skip to main content\nMain navigation\nHome\nAbout John\nNews\nContact\nContact\nLeave this field blank\n326 Molesey Road, Walton-on-Thames, KT12 3PD\n[email protected]\nOn Facebook\nOn X (Twitter)\nOn LinkedIn\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_johncope_uk_/https_www_johncope_uk_news_holding-thames-water-account/content_22.html": "Whether it's the Thames, Mole, Imber, or Wey, we all want to see more wild life, better water safety, and better water quality. Here's an update on progress\nThe main cause of pollution in our rivers locally is agriculture methods, but we have to keep up the pressure on the water companies too, especially Thames Water, to prevent any discharges during storms and heavy rain. The issue of people putting oils, baby wipes, nappies, and non-biodegradable objects down the drain continues to cause major blockages and maintenance issues.\nI visited Esher treatment works (our main sewage treatment plant) to see what impact the previous government's polices (including fining water companies over £200 million, with this money used on water quality improvements) have had; how the periodic smells that come from Esher are being tackled (it was agreed during the visit covers would be added to the offending containers); and the proposal to upgrade the Esher treatment plant to stop discharges entirely. This proposal is due to happen in 2027.\nI will continue to keep up the pressure on these three areas and make sure local water quality keeps improving.\nIf you have any problems with sewage smells or have a question, let me know on [email protected]",
  "https_www_johncope_uk_/https_www_johncope_uk_news_elmbridge-council-abandons-plans-close-historic-cecil-hepworth-playhouse-walton/content_17.html": "After an outpouring of anger and dismay from local residents, along with the Playhouse User Group and our local MP, Dominic Raab, we have forced the Liberal Democrats that run our Council to abandoned its plans to close the precious Cecil Hepworth Playhouse in Walton. A victory for common sense and our local heritage - the Playhouse is due to celebrate it's 100th anniversary soon.\nThe council have released a statement apologising and inviting playhouse users to submit a proposal to take a self-managed lease from April 2023. Importantly, the statement said:\n“We understand [the playhouse] is much loved by its users […] it is clear there is strong local feeling about the facility, as well as maintaining the provision of local arts.”\nThis is a marked contrast from the council’s previous position that the playhouse would be closed entirely, and shows how important local community campaigning is.\nThere’s still work to do, but this is a very welcome step forward in the campaign to save this vital community asset.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_environment-secretary-agrees-john-ensure-environment-agency-tackles-illegal-moorings-elmbridge/content_29.html": "Thank you to DEFRA Secretary of State, Thérèse Coffey, for joining me and Dominic Raab in Molesey to take a look at the unauthorised moorings blighting the riverbank.\nStretches of the riverbank in Elmbridge are owned by the Environment Agency (EA), an executive non-departmental public body sponsored by DEFRA. It was important to raise the longstanding issue riverside residents have been experiencing with illegal moorings, and ask for the Secretary of State’s support to press the EA to take necessary enforcement action.\nI am delighted that Thérèse agreed to follow this up with the EA to ensure they are using all the tools at their disposal to see the permanent removal of these boats.",
  "https_www_johncope_uk_/https_www_johncope_uk_campaigns_affordable-homes-protected-green-spaces/content_35.html": "Affordable housing is scarce in Elmbridge, but we must protect our shrinking green belt from being overdeveloped by the Lib Dems.\nThat's why John is backing the Government's 'brownfield first' approach, and is campaigning to get the Lib Dem Council to adopt this approach. John's campaign has already stopped Molesey Hurst Rec from being concreted over by the Liberal Democrat Council.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_john-welcomes-new-cctv-across-walton-funded-governments-safer-streets-fund/content_7.html": "As part of this Conservative Government’s £330,000 award from the Safer Streets Fund to tackle anti-social behaviour in Walton, five mobile CCTV cameras are being installed this week. The cameras will be installed at the following locations:\n- Ashley Park\n- Cowey Sale\n- Ambleside Avenue\n- Hepworth Way\n- Drewitts Court Car Park\nThe aim of these cameras is not only to deter anti-social behaviour, but also to provide video evidence, if needed, to Surrey Police and local councils.\nThe £330,000 Safter Streets funding will also be used for youth outreach programmes, security measures in Drewitts Court Car Park, and improvements to the community garden in St John’s.\nMy Plan for our area includes more visible policing now Surrey has a record number of police, which is something I discussed recently with our Surrey Police and Crime Commissioner. You can read more here.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_how-does-labours-budget-affect-you/content_15.html": "Last week, Labour delivered a budget of broken promises—a budget that raises taxes on working families and businesses, removes the Winter Fuel Payment from pensioners, and hikes bus fares by 50%, bringing the cap to £3.\nThis budget is a direct hit to your wallet.\nLet’s work together to reverse these damaging decisions. Sign our petitions below:\nSave the Winter Fuel Payment: www.keepwinterfuel.com\nStop the Family Farm Tax: www.stopthefarmtax.com\nStop Labour's Bus Fare Hike: www.stoplaboursbushike.com",
  "https_www_johncope_uk_/https_www_johncope_uk_news_new-bridge-walton-train-station-track/content_16.html": "New Bridge at Walton Train Station is on track!\nHopefully you've had the latest Walton Conservatives newsletter through your letter box - the big news was about the successful campaign with our local MP Dominic Raab to get a bridge for Walton Station so it's much more accessible (esp. for those in wheelchairs, with prams, or heavy items!). There will also be more security cameras to help tackle the spate of bike thefts we've sadly had recently.\nAbove is the first artist impression of what it will look like! Work has started on site already (you can see fences on the Hersham side) with the main works taking place over Christmas to minimise disruption. The bridge should be in service in spring, if all goes well!",
  "https_www_johncope_uk_/https_www_johncope_uk_news_category_Westminster-News/content_19.html": "John welcomes measures to right the wrongs of the Post Office scandal 13th January 2024 The Post Office scandal is one of the greatest miscarriages of justice in our nation’s history. This is why we established a full independent statutory public... Westminster News",
  "https_www_johncope_uk_/https_www_johncope_uk_news_health-minister-joins-john-white-house-dental-clinic-hear-what-government-can-do-improve/content_21.html": "It was great to join Health Minister, Andrea Leadsom, at White House Dental Clinic in Walton to hear more about the Government’s new NHS Dental Recovery Plan, which will deliver 2.5 million additional NHS dental appointments in England over the next year.\nBacked by £200 million of funding, the Government’s Dental Recovery Plan aims to make sure everyone who needs to see a dentist, particularly those who have been unable to access care in the past two years, will be able to do so. The plan will also drive a major new focus on prevention and good oral health in young children, and deliver an expanded NHS dental workforce. Measures in the plan include:\n- A greater incentive for dentists to work in underserved areas with a one-off payment of £20,000\n- New patient payments will be provided to NHS dentists to prioritise treating adults and children who have not seen a dentist for two years or more\n- New Smile for Life programme to expand preventative care for younger children to help reduce tooth decay\nMy plan includes strengthening local NHS services, so it was great to have the Minister down in Walton to see how she can better support White House and hear what else we can do to improve access to NHS dentists in our community. You can read more about our plan below, and if you're struggling to get an appointment or registered let me know on [email protected].",
  "https_www_johncope_uk_/https_www_johncope_uk_cdn-cgi_l_email-protection/content_26.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_john-welcomes-plans-introduce-100000-more-apprenticeships-every-year/content_12.html": "I’ve spent most of my career working in education, which is why I am campaigning for even more apprenticeships locally. Since 2010, there have been nearly 6 million new apprenticeships – about 5,000 of these have been in our local area – and I wants to build on this progress.\nIt's why the Prime Minister has set out a clear plan to deliver 100,000 extra apprenticeships per year. This is nearly £1 billion extra for apprenticeships on top of the existing system.\nThis bold action will ensure young people have the skills they need to get good, secure jobs. As opposed to Labour, who would oversee a 50% reduction in apprenticeship funding by relaxing funding rules.\nYou can read more about my plan to secure even more apprenticeships locally here.",
  "https_www_johncope_uk_/https_www_johncope_uk_events_feed/content_36.html": null,
  "https_www_johncope_uk_/https_www_johncope_uk_news_tackling-crime-across-esher-and-walton-lisa-townsend/content_10.html": "Surrey's Police & Crime Commissioner, Lisa Townsend PCC, & Surrey's Chief Constable ,Tim De Meyer, came to Elmbridge this week to meet with me & local residents to discuss how they're reducing crime & how Surrey's record number of police are becoming more visible.\nWe talked through local concerns, especially around:\nanti-social behaviour\nspeeding\nshoplifting\nonline and phone scams\nIf you're worried about any criminal activity not being tackled locally, however small, please let me know & I can raise with Surrey Police. In an emergency, always call 999, & you can report crime online here: https://www.surrey.police.uk/ro/report/",
  "https_www_johncope_uk_/https_www_johncope_uk_news_johns-ulez-update/content_34.html": "Incredibly disappointing news that Surrey County Council lost the ULEZ High Court fight to axe ULEZ expansion. ULEZ is unfair, hits the poorest, damages local businesses, and does little to tackle air pollution.\nMayor Sadiq Khan and Labour/Liberal Democrat London Assembly Members are wrong to push ahead without even consulting those affected. The campaign to stop ULEZ doesn't end - we will keep up the pressure and show the damage their policy will have. If you haven't already, sign the petition today: https://action.conservatives.com/stop-drivers-tax/.\nThank you to Cllr Tim Oliver, Leader of Surrey County Council, for leading the legal action against ULEZ - it's been deeply frustrating our Council, Elmbridge, didn't join the legal action (a consequence of Lib Dems being in charge) like many other councils did, such as Bexley, Bromley, Harrow & Hillingdon Councils.",
  "https_www_johncope_uk_/https_www_johncope_uk_campaigns_cheaper-and-easier-transport-links-tackle-congestion/content_28.html": "Extending Zone 6 to all local stations\nZone 6 already covers Thames Ditton and Hampton Court stations. We're campaigning to extend contactless payment to all of our stations to save local commuters money.\nBetter station facilities\nJohn has successfully campaigned for step-free access at Walton Station, including securing government funding to build a new footbridge with lifts. Lifts at Esher Station and improving Hersham Station are next on his list, as is returning Hampton Court Station to its previous glory.\nSchool crossings to keep local children safe\nJohn successfully campaigned for a safe pedestrian crossing outside Walton Oak School, which was installed in 2023. Zebra crossings are set to be installed outside St Lawrence Junior School and St Alban's Primary School in Molesey over Spring / Summer 2024. Under Our Plan, John will continue to work with Surrey County Council to secure more school crossings around our local schools, and get more potholes repaired across the constituency.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_category_Articles/content_4.html": "We won! Free short stay parking is returning to Elmbridge 3rd April 2025 Thanks to the support of local residents, we’ve finally (after four years!) convinced Elmbridge Council to bring back the free short stay parking they took away... ArticlesLocal News",
  "https_www_johncope_uk_/https_www_johncope_uk_news_john-welcomes-measures-right-wrongs-post-office-scandal/content_24.html": "The Post Office scandal is one of the greatest miscarriages of justice in our nation’s history. This is why we established a full independent statutory public enquiry a few years ago and now the Conservative government is acting at speed to bring forward legislation to quash all convictions that were based on this miscarriage of justice. This will clear people’s names, deliver justice, and ensure swifter access to compensation for innocent people who have waited too long.\nThe government is doing this by:\n- Introducing primary legislation within weeks to quash all convictions that were based on erroneous Horizon evidence and the egregious behaviour of the Post Office in the period in question\n- Bringing forward an upfront offer for the Group Litigation Order cohort, recognising the vital role the 555 postmasters played, enabling them to receive compensation faster\n- Consulting the independent Horizon Compensation Advisory Board to speed up the roll out of compensation schemes, helping deliver swifter support to the wronged\nFind out more about what the Government is doing to quash wrongful Post Office convictions here.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_feed/content_27.html": null,
  "https_www_johncope_uk_/https_www_johncope_uk_about-john-cope/content_13.html": "I’ve lived between Hersham and Walton for many years with my partner and dog, as well as being elected to serve my local community as a local councillor in Elmbridge.\nSo I’ve seen first-hand what a great community we have, but also the problems that need fixing.\nYou can read more about what I've achieved for our area by clicking here.\nWhy I stood for election\nWhat drove me into politics is making sure that regardless of a person’s background, they get an excellent education, a great job, a chance to buy an affordable home, a safe neighbourhood to live in, and green spaces to enjoy. In one word: opportunity.\nThis is because access to opportunity changed my life. I was born on a council estate to a 14-year-old girl before going into foster care and being adopted by my family. My mum and dad worked exceptionally hard to give me the best upbringing they could. Their support helped me become one of the first in my family to get A Levels, and the very first to go to university.\nThe problem is, far too many people don't get that second chance. So I’m standing for Parliament to help people in our area - which I’m passionate about as a local councillor - and address the root causes of problems, help fix the system, and keep knocking down barriers to opportunity.\nIt’s why I’ve also dedicated my career to education, adult learning, and apprenticeships. I’m currently an executive director at the charity UCAS - the Universities and Colleges Admissions Service - which helps over a million people each year get the support they need to make life-changing decisions. I therefore see the transformative power of education every day, including in our area, where the number of schools rated by Ofsted as ‘good’ or ‘outstanding’ has risen from 69% in 2010 to 93% today. We must get this to 100%.\nMy proudest achievement at UCAS has been driving forward our expansion into apprenticeships for the first time. Academic study works for many, but not all. It's been great to see job boosting and life changing apprenticeships expand significantly in our area, with nearly 5,000 new apprenticeships started in Esher and Walton alone since 2010.\nAs well as a passion for education, I want to see business flourish in our area.\nThis includes smaller, local, independent companies, like my dad’s. He sold machinery and parts to factories, and I saw the extra mile he went to keep his shop going: bending over backwards for customers, supporting his staff, and working weekends to keep the ship afloat. Businesses like these are often the backbone of our high street and our economy, as well as making up the supply chains of larger firms. We must back local businesses and entrepreneurs - and critically, cut the taxes they pay so they can hire more local people and invest in the company.\nDespite the best intentions, I think government and regulation can get in the way of business too often. I believe passionately we need to make it easier for companies to grow, to employ and train people, and to innovate. Not just to provide people with a good salary, but also to fund public services like the NHS: a growing economy means more tax income for the Government to provide a safety net for those who need it most.\nWhat has John achieved for the area already?\nThe Conservatives haven’t run Elmbridge Borough Council for almost seven years. As the leader of the opposition group on the Council, I’ve worked hard to stop the neglect of our area that very sadly residents have just started to accept as the norm: too few genuinely affordable homes; green spaces disappearing; tired and sad high streets; and one of the highest council tax bills in the country landing on our doormats. But why? It's the price of years of a Liberal Democrat-dominated council that’s made empty promises while charging us through the roof on council tax - they're infamous for it around the country.\nWe’ve worked hard to hold them to account for this.\nI’ve led Conservative councillors in stopping the Lib Dems from closing our historic Walton Playhouse, and successfully prevented them removing the paddling pools our local children enjoy. We’re still fighting their plans to close the Thames Ditton and Claygate community centres.\nI launched a petition against massive increases in council parking charges, and the removal of free parking that has hit our local high streets hard. I’ve secured sensible measures to prevent dangerous driving and speeding to protect our children and people with disabilities, and successfully won the argument for step-free access at Walton Station via a new bridge. Constructing a bridge at Esher Station and improving Hersham Station are next on my list. As is returning Hampton Court Station to its previous glory after much-delayed works rumble on.\nI’ve held the Environment Agency to account for not tackling unauthorised moorings on the Thames, together with the anti-social behaviour and pollution that comes with them. Boats have been removed and new orders issued on some of those remaining.\nI’ve fought for those in social housing in our borough who have for too long been abandoned by the Council in low-quality PA Housing. A new “Tenant’s Charter” of minimum standards is being established as a result.\nAnd finally, I’ve battled against the Lib Dem-backed attack on local businesses and the less well-off that is the ULEZ charge.\nAs well as these campaigns, the Conservative Government has enabled real improvements locally. We now have a record number of police officers protecting our streets; we’ve got the brand-new Walton Free School being built; the new state-of-the-art Three Rivers Academy is up and running; the vast financial support during the pandemic that saved millions of jobs and many businesses, as well as help with household and business energy bills and the cost-of-living crisis caused by the attack on Ukraine.\nWith your support, I can ensure the Government continues delivering for our area. You can read more about my plan for our areas here, as well as sharing your thoughts.\nIf you have any questions, please email me at [email protected], and share any local events, charities, and workplaces you’d like me to visit. I’d love to hear from you.",
  "https_www_johncope_uk_/https_www_johncope_uk_campaigns_strengthening-local-nhs-services-and-more-gp-appointments/content_31.html": "NHS funding has increased in real terms every year since 2010, equating to more than an extra £700 million every week.\nJohn is campaigning to rebuild the Weybridge Health Centre, and for a cutting-edge update to Molesey Hospital. John will continue campaigning locally for more face-to-face appointments with GPs, and better mental health care.",
  "https_www_johncope_uk_/https_www_johncope_uk_accessibility/content_9.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_johncope_uk_/https_www_johncope_uk_about-rss/content_25.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_johncope_uk_/https_www_johncope_uk_campaigns_state-art-schools-are-good-or-outstanding-and-more-apprenticeships/content_33.html": "Since 2010 the number of 'good' and 'outstanding' schools locally has gone from 69% to 93%. Also, state of the art Three Rivers Academy was built, and Heathside Walton has recently been opened.\nJohn is campaigning for even more educational choice locally, and for all of our schools to be rated 'good' and 'outstanding' by Ofsted.\nWe also need to see more special needs places and local apprenticeships.",
  "https_www_johncope_uk_/https_www_johncope_uk_privacy/content_14.html": "This document outlines how John Cope processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is John Cope\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact John Cope.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of John Cope, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact John Cope via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_johncope_uk_/https_www_johncope_uk_cookies/content_8.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_johncope_uk_/https_www_johncope_uk_ourplan/content_20.html": "Heathside Walton is now completed, John is campaigning for even more school choice locally. This includes more special needs places and more local apprenticeships.\nZone 6 already covers Thames Ditton and Hampton Court stations. We're campaigning to extend contactless payment to all of our stations to save local commuters money.",
  "https_www_johncope_uk_/https_www_johncope_uk_news/content_23.html": "We won! Free short stay parking is returning to Elmbridge Thursday, 3 April, 2025 Thanks to the support of local residents, we’ve finally (after four years!) convinced Elmbridge Council to bring back the free short stay parking they took away. Huge damage has been done to our high streets in that period, but hopefully they can now start to recover. Back in 2021, a group of local Conservative councillors launched a community campaign to help local shops and revive our high... ArticlesLocal News\nHolding Thames Water to account 13th January 2025 Whether it's the Thames, Mole, Imber, or Wey, we all want to see more wild life, better water safety, and better water quality. Here's an update on progress The... Local News\nCllr John Cope & Dr Ben Spencer MP Demand Action on Failed Local Plan 27th November 2024 Cllr John Cope, Leader of the Conservative Opposition on Elmbridge Borough Council, has joined local MP Dr Ben Spencer in calling for urgent action to fix the... Local News\nTackling Crime across Esher and Walton with Lisa Townsend 20th November 2024 Surrey's Police & Crime Commissioner, Lisa Townsend PCC, & Surrey's Chief Constable ,Tim De Meyer, came to Elmbridge this week to meet with me & local residents... Local News\nHow does Labour's budget affect you? 8th November 2024 Last week, Labour delivered a budget of broken promises—a budget that raises taxes on working families and businesses, removes the Winter Fuel Payment from... Local News\nJohn welcomes plans to introduce 100,000 more apprenticeships every year 30th May 2024 I’ve spent most of my career working in education, which is why I am campaigning for even more apprenticeships locally. Since 2010, there have been nearly 6... Local News\nJohn welcomes new CCTV across Walton funded by the Government's Safer Streets Fund 28th May 2024 As part of this Conservative Government’s £330,000 award from the Safer Streets Fund to tackle anti-social behaviour in Walton, five mobile CCTV cameras are... Local News\nInflation has fallen to 2.3% from 11.1% in October 2022 22nd May 2024 It’s inflation that eats into your savings and makes your money not stretch as far. That’s why the Prime Minister made halving it his number one priority. We’ve... Local News\nHealth Minister joins John at White House Dental Clinic to hear what government can do to improve access to NHS dentists in our community 21st May 2024 It was great to join Health Minister, Andrea Leadsom, at White House Dental Clinic in Walton to hear more about the Government’s new NHS Dental Recovery Plan... Local News\nUK economy one of the fastest growing in Europe 10th May 2024 There is no doubt it has been a difficult few years, but today’s growth figures are proof that by sticking to the plan the economy is turning a corner for the... Local News",
  "https_www_johncope_uk_/https_www_johncope_uk/content_1.html": "Latest News We won! Free short stay parking is returning to Elmbridge Thanks to the support of local residents, we’ve finally (after four years!)… Holding Thames Water to account Whether it's the Thames, Mole, Imber, or Wey, we all want to see more wild life… Cllr John Cope & Dr Ben Spencer MP Demand Action on Failed Local Plan Cllr John Cope, Leader of the Conservative Opposition on Elmbridge Borough… Map of Esher and Walton Constituency Follow John on Facebook\nWe won! Free short stay parking is returning to Elmbridge Thanks to the support of local residents, we’ve finally (after four years!)…\nHolding Thames Water to account Whether it's the Thames, Mole, Imber, or Wey, we all want to see more wild life…\nCllr John Cope & Dr Ben Spencer MP Demand Action on Failed Local Plan Cllr John Cope, Leader of the Conservative Opposition on Elmbridge Borough…",
  "https_www_johncope_uk_/https_www_johncope_uk_news_category_Local-News/content_3.html": "We won! Free short stay parking is returning to Elmbridge 3rd April 2025 Thanks to the support of local residents, we’ve finally (after four years!) convinced Elmbridge Council to bring back the free short stay parking they took away... ArticlesLocal News\nHolding Thames Water to account 13th January 2025 Whether it's the Thames, Mole, Imber, or Wey, we all want to see more wild life, better water safety, and better water quality. Here's an update on progress The... Local News\nCllr John Cope & Dr Ben Spencer MP Demand Action on Failed Local Plan 27th November 2024 Cllr John Cope, Leader of the Conservative Opposition on Elmbridge Borough Council, has joined local MP Dr Ben Spencer in calling for urgent action to fix the... Local News\nTackling Crime across Esher and Walton with Lisa Townsend 20th November 2024 Surrey's Police & Crime Commissioner, Lisa Townsend PCC, & Surrey's Chief Constable ,Tim De Meyer, came to Elmbridge this week to meet with me & local residents... Local News\nHow does Labour's budget affect you? 8th November 2024 Last week, Labour delivered a budget of broken promises—a budget that raises taxes on working families and businesses, removes the Winter Fuel Payment from... Local News\nJohn welcomes plans to introduce 100,000 more apprenticeships every year 30th May 2024 I’ve spent most of my career working in education, which is why I am campaigning for even more apprenticeships locally. Since 2010, there have been nearly 6... Local News\nJohn welcomes new CCTV across Walton funded by the Government's Safer Streets Fund 28th May 2024 As part of this Conservative Government’s £330,000 award from the Safer Streets Fund to tackle anti-social behaviour in Walton, five mobile CCTV cameras are... Local News\nInflation has fallen to 2.3% from 11.1% in October 2022 22nd May 2024 It’s inflation that eats into your savings and makes your money not stretch as far. That’s why the Prime Minister made halving it his number one priority. We’ve... Local News\nHealth Minister joins John at White House Dental Clinic to hear what government can do to improve access to NHS dentists in our community 21st May 2024 It was great to join Health Minister, Andrea Leadsom, at White House Dental Clinic in Walton to hear more about the Government’s new NHS Dental Recovery Plan... Local News",
  "https_www_johncope_uk_/https_www_johncope_uk_campaigns_more-visible-policing-now-surrey-has-record-number-police/content_11.html": "Surrey has a record number of police officers: we've recruited an additional 395 since 2010: an historic high.\nTo make our streets safer for you and your family, John is working closely with Surrey Police to increase their visibility. Most recently, John secured anti-speeding measures on Rydens Road, with more measures to come to protect our children and people with disabilities.",
  "https_www_johncope_uk_/https_www_johncope_uk_news_cllr-john-cope-dr-ben-spencer-mp-demand-action-failed-local-plan/content_5.html": "Cllr John Cope, Leader of the Conservative Opposition on Elmbridge Borough Council, has joined local MP Dr Ben Spencer in calling for urgent action to fix the Liberal Democrat-led Council's failure on the Local Plan. Together, they’ve written to Planning Minister Matthew Pennycook MP, demanding a solution to protect residents from further delays and costs. You can read the letter below\nAfter 8 years of work and millions in wasted taxpayer money, the Planning Inspector has declared the Council’s plan “unsound.” Despite this, the Council continues to drag its feet—risking higher taxes, a loss of green spaces, and fewer affordable homes for Elmbridge.\nJohn Cope commented:\n“It’s now clear years of work and millions of pounds of local people’s money have gone down the drain – and an acute shortage of affordable housing allowed in Elmbridge.\nI don’t think Elmbridge residents should be held responsible for the failings of their Liberal Democrat-led Council – and should not pay the consequences of higher council tax and reduced local services, or see what remains of their green spaces lost.\nAny new Local Plan will not just cost over a million pounds but will also have to accept the Labour government’s 121% increase in top-down development targets meaning a huge loss of green belt and loss of local democratic control of planning – but with no new roads, GPs, or schools to support the development.”\n\"If the Council is unable to deliver something as basic as a Local Plan, I suggest the Liberal Democrat leadership hands over control to the local Conservatives and residents so we can get the job done.\""
}