{
  "https_mertongreenparty_org_uk_/https_mertongreenparty_org_uk/content_1.html": "-\nWe Want to Hear from You\nWhat do you think of the local area? Can we help with anything? Please click here to complete our short survey.\n-\nMitcham residents let down by Merton Council\nHaving, over the last two years, engaged with residents living next to the old Mitcham gasworks site (see here and here), we think it is safe to say that the Development and Planning Applications Committee’s decision to approve St William’s planning application has infuriated them. No one denies that new homes are needed desperately. However,…\n-\nThe Green Party’s General Election manifesto is here!\nYou can read our General Election manifesto here. Please note that there are three versions – easy read, short, and long. All three are available to download here.\n-\nUpdate on Planning Application for Old Mitcham Gasworks Site\nFollowing our previous work to support residents living near the old Mitcham Gasworks site, we submitted to the Council, on 13th May, our response to the latest planning application. 1. We find it extremely disappointing that the original vision for the site, as set out in the 2021 version of the Local Plan, has…\n-\nMeet Dr Pippa Maslin, our by-election candidate for the St Helier ward and parliamentary candidate for Mitcham and Morden\nMy Background: Born to a Filipina and a Briton, I moved from Manila to Morden in 1977, living with my grandparents on the Hatfeild Mead Estate in the St Helier ward until my parents and I were housed in a council flat in Colliers Wood. After some time away, I returned to the St…\n-\nWe are proud to introduce our parliamentary candidate for Wimbledon, Rachel Brooks\nI have lived in the Wimbledon constituency for nearly three decades. I grew up here, was educated here, and have started my own family here. I have come to know and understand the many faces of Wimbledon – there are so many great things about the area, but there is also so much we could…\n-\nMitcham Gasworks\nSince the summer of 2022, we have been engaging with residents living in the vicinity of the old Mitcham gasworks site – listening to and helping to amplify the community’s views on a proposal by the developer, St William, to build hundreds of flats on the site. At the pre-application stage, we attended St…\n-\nCeasefire now!\nMerton Greens have attended peace vigils and marches calling for the release of hostages and an end to the collective punishment of the Palestinian people. Statement issued by Merton Green Party in early January 2024 The Green Party has been calling for a full ceasefire in Gaza and the return of hostages since mid-October.…\n-\nA visit from London Assembly Member Caroline Russell\nAt our public meeting in Merton Arts Space on 13th March, Caroline Russell (right), one of the Green Party’s three London Assembly Members, gave an inspiring account of her work. The meeting was chaired by Rachel Brooks (left), our parliamentary candidate for Wimbledon. Caroline spoke about her work on the Police and Crime Committee and…\n-\nMerton and Wandsworth London Assembly hustings\nFive hustings have been organised. Sustainable Merton, Merton Friends of the Earth and Merton Cycling Campaign: Thursday 11th April, 7.30pm, Merton Arts Space (at back of Wimbledon Library), Compton Road, SW19 7QA. Southfields Grid Residents’ Association: Tuesday 16th April, 7.45-9.15pm, St Barnabus Church, 146 Lavenham Road, SW18 5EP. The Battersea Society: Thursday…"
}