{
  "https_edward-jones-for-old-bexley-and-sidcup_mailchimpsites_com_/https_edward-jones-for-old-bexley-and-sidcup_mailchimpsites_com_labours-plan/content_2.html": "Labour’s candidate for Old Bexley and Sidcup\nFamilies across Britain are being hit hard by a mortgage and housing bombshell, costing homeowners and renters hundreds extra each month. With food and energy prices so high, this is the last thing families need. We're in this mess because the Tories crashed the economy, leaving families to pay the price. Labour will take tough decisions to restore economic stability.\nAfter 14 years of Tory neglect, our healthcare system is too often not there when it's needed. The longer the Conservatives are in power, the longer patients will wait. I am proud to work for the NHS, but I see how it’s been let down by over a decade of Tory decline. I will work tirelessly to help cut NHS waiting times, expand community care and improve access and outcomes for patients.\nI was the first in my family to go university, benefiting from the expansion of places delivered by Labour. But today I meet so many local people who tell me they don’t think their children will have the same opportunities they had. Is it any wonder, when schools across Bexley have suffered £21 million of cuts under the Tories? If elected, I’ll help deliver Labour’s pledge to recruit 6,500 new teachers and to reform childcare to make sure that all of our children get the best possible start in life.\nGuaranteeing town centre police patrols in every community to tackle gangs, drug dealers and fly tippers – paid for by cutting outside contractors and waste. Labour will put police back in towns centres and neighbourhoods to make our streets safe again, with increased patrols and 13,000 more neighbourhood police and PCSOs. I’ll support a Labour government and local services to prevent crime, punish criminals and protect victims.\nResidents’ mortgages and rents are soaring, driven by a shortage of housing and the Tories’ economic mismanagement. The dream of home ownership pushed further out of reach for so many people. I support Labour’s plan to protect our natural spaces and free up grey belt land for building. This will mean more affordable homes for people who need them.\nWe use cookies to improve your experience and to help us understand how you use our site. Please refer to our cookie notice and privacy statement for more information regarding cookies and other third-party tracking that may be enabled.\nEmail me at team@edwardjoneslabour.co.uk\nPhone: 020 8302 6843\nPost: Gerda Slater House, 31 Sidcup Hill, Sidcup DA14 6H",
  "https_edward-jones-for-old-bexley-and-sidcup_mailchimpsites_com_/https_edward-jones-for-old-bexley-and-sidcup_mailchimpsites_com/content_1.html": "Labour’s candidate for Old Bexley and Sidcup\nI’m Edward Jones and I’m standing as Labour’s parliamentary candidate for Old Bexley & Sidcup at the general election on 4 July.\nI hope to have your support to be the constituency’s next MP. I’d love to hear your views about the change we need - please get in touch below.\nI’m honoured to be Labour’s candidate to be the next Member of Parliament for Old Bexley and Sidcup. After 14 years of decline under the Tories, it’s time for change – in Bexley and across Britain.\nI am proud to work for the NHS. But after 14 years of Tory neglect, our healthcare system is too often not there when it's needed. The longer the Conservatives are in power, the longer patients will wait. I meet so many local people who tell me they don’t think their children will have the same opportunities they had. Is it any wonder, when schools across Bexley have suffered £21 million of cuts under the Tories.\nI live in South East London and have grown up and spent most of my life in outer London. I know the challenges that residents here face, from the cost of living, crime and anti-social behaviour, to accessing NHS services when you need them and an education system that improves life chances for local children.\nResidents struggle with the cost of living after the Tories crashed the economy, leaving families to pay the price.\nI’m asking residents in Old Bexley and Sidcup for your support and your vote on Thursday 4th July so we can have a Labour government which will lead a decade of renewal.\nA strong local voice – I live locally in South East London and know the challenges our community faces. I will be a strong voice in Parliament, championing local issues and fighting on your behalf.\nAvailable and accountable – As your MP, I would work tirelessly all year round to make sure that I can effectively represent you. I will host regular drop-in surgeries to support constituents with their issues.\nAn honest politician – As your local representative, I will always do what I think best represents the views of our area and make it clear why I have come to a particular position. You might not always agree with me, but you’ll always know where I stand.\nWe use cookies to improve your experience and to help us understand how you use our site. Please refer to our cookie notice and privacy statement for more information regarding cookies and other third-party tracking that may be enabled.\nEmail me at team@edwardjoneslabour.co.uk\nPhone: 020 8302 6843\nPost: Gerda Slater House, 31 Sidcup Hill, Sidcup DA14 6H"
}