{
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_hillingdon-herald/content_2.html": "Every month I write my column for the Hillingdon Herald newspaper, which is produced by the students at Brunel University in Uxbridge and South Ruislip.\nAs the newspaper is printed product only, I have linked all my monthly columns below.\nSteve Tuckwell, Conservative Candidate for Uxbridge and South Ruislip's columns for the Hillingdon Herald\nPlease note that all of this content was produced while I was a Member of Parliament. As Parliament has been dissolved, there are no MPs until after the General Election on the 4th of July 2024.\nIf you're a local resident and have a local story you want published in the newspaper, please contact: [email protected].",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_news_category_Speeches/content_9.html": "My first Westminster Hall Debate 16th January 2024 My first Westminster Hall debate was on the topic of protecting heritage assets in UXSR: “Never in the field of human conflict was so much owed by so many to so... Speeches",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_news_april-may-column-published-hillingdon-herald/content_4.html": "April-May column published by The Hillingdon Herald\nMy thoughts this month centre around the recent London Mayoral election that saw Sadiq Khan win a third term. I am bitterly disappointed at the result that furthers the risk of the whole of London continuing to deteriorate for another four years. Across Uxbridge & South Ruislip, we saw overwhelming support for Susan Hall throughout her campaign and through the election results announced for Hillingdon. For the past eight years, we have seen crime rise, police stations close, police recruitment targets missed, council tax raised by 71%, house building below what is needed, our nighttime economy devastated, bus routes decimated across Hillingdon, the Central Line in chaos and the war on motorists boosted with the expansion of ULEZ to outer London. For eight long and arduous years, the Labour Mayor of London has ignored the residents of Uxbridge & South Ruislip which will now continue for a further four years. Despite political gimmicks, the Labour Mayor has still not confirmed that our Police Station in Uxbridge will remain open with a full custody suite and public front desk. There is also the emerging risk of pay-per-mile charging using the ULEZ camera infrastructure that will further hammer local motorists whether driving electric, diesel or petrol vehicles. As your MP, I will be working with other Conservative MPs across London in ensuring that the Labour Mayor of London is held to account for his decisions that will impact on Londoners. Unfortunately, we have seen how Hillingdon Labour politicians, including Sadiq Khan’s own candidate from Camden, publicly congratulating the Labour Mayor’s recent victory. Clearly, the Hillingdon Labour Group are also willing to ignore local residents and press ahead with policies that will have devastating consequences for the people of Uxbridge & South Ruislip. As your MP and your voice, I will ensure that the Labour Mayor will not be allowed to ignore us anymore.\nOn a more positive note, the local by-election result for Hillingdon East saw a significant majority for the local Conservative Team with Cllr Kelly Martin joining Hillingdon Council. Kelly will be a great Councillor for his residents.\nWest Drayton Station and the lack of bus access has been a major inconvenience to local residents. After chasing Network Rail for a commitment to complete the sub-surface repair work, I was pleased to have arranged an on-site meeting with Network Rail and Huw Merriman MP (Minister of State for Transport) where a firm timescale to complete the repair was finally agreed. I am looking forward to buses returning to the forecourt at West Drayton station in the months ahead. This will improve access to travelling residents and reduce the impact of traffic on Yiewsley High Street.\nDuring my time as the MP for Uxbridge & South Ruislip, I have had the privilege of working with many local charities, youth groups, schools and colleges. Many Hillingdon Herald readers will be aware of the Daniella Logun Foundation who do amazing work for children and their families with brain tumours. I had the pleasure of welcoming Angela Logan, Co-Founder, to Parliament for a Brain Tumour UK Charity event. This gave Angela the opportunity to talk with other charities who do similar great work in supporting people through this terrible condition. I have also co-signed a letter to the Health Minister calling for a National Brain Tumour Strategy.\nMany of you will know that I started my working life as a postman in Uxbridge. It was great to visit the Royal Mail Delivery Office in Uxbridge which gave me a real sense of nostalgia. Meeting former colleagues brought back some very happy memories, especially catching up with Les who has given 47 years of dedicated service to Royal Mail.\nIt is always a privilege to serve as your MP for Uxbridge and South Ruislip. As ever, if you wish to contact me, please do so by email: [email protected]",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk/content_1.html": "Latest News\nFollow me on Twitter\nDissolution of Parliament\nMuch of the content on this website was established while I was a Member of Parliament. As Parliament has been dissolved, there are no MPs until after the General Election on the 4th of July 2024.\nAm I your local candidate?\nEnter your postcode to confirm that Steve Tuckwell is your candidate.",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_cdn-cgi_l_email-protection/content_11.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_contact/content_3.html": "Skip to main content\nMain navigation\nHome\nAbout Steve\nAbout You\nOur Plan\nLocal News\nHillingdon Herald\nMy words\nNewsletters\nContact\nContact\nLeave this field blank\nUxbridge Office\n36 Harefield Road, Uxbridge UB8 1PH\n07507 917741\n[email protected]\nSteve on Facebook\nSteve on Twitter\nSteve on Instagram\nSteve on LinkedIn\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_accessibility/content_7.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_news_labour-claims-champion-working-class-and-those-need-then-dismantles-vital-lifeline-pensioners/content_5.html": "It may be Parliamentary recess, but it’s not recess for pensioners who are currently planning the sacrifices they will have to make this winter, as a result of the Labour government scrapping their winter fuel allowance.\nClick here to read my article for GB news.",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_news_december-hillingdon-herald-column/content_6.html": "December column published by The Hillingdon Herald\nThis month has been another busy one for me. Following on from my maiden speech, I took the opportunity to contribute to a Westminster Hall Debate where I highlighted the importance of our local heritage pubs, such as the Crown and Treaty in Uxbridge. Built in the early sixteenth century, it is where King Charles I and his Parliamentary opponents held negotiations. Today the pub is restored with a restaurant offering a warm, welcoming place for families and friends.\nIn the House of Commons Chamber, I had the opportunity to ask the Immigration Minister if we could work together to focus on the unique pressures faced by Hillingdon Council in supporting Asylum Seekers. It is recognised that as a port authority, Hillingdon experiences this pressure more than other local authorities and I was pleased that the Immigration Minister acknowledged the situation and gave a firm commitment to work with me in ensuring that Hillingdon Council is supported.\nFor UK Parliament week, I visited Hillingdon Manor School, where I met the newly elected Pupil Voice committee along with a visit to Hermitage Primary School, where Student Council elections were taking place. I thoroughly enjoyed visiting both schools and participating in question-and-answer sessions, where I was quizzed on my background, life as an MP and how young people can get involved in politics. My sincere thanks to both schools for inviting me. Additionally, I had the pleasure of visiting Learn Hillingdon – Adult Community Education at their education centre in Uxbridge, where I met adult learners who were broadening their knowledge about democracy. I was happy to share with them the difference between life in parliament and life in the constituency.\nThe month of December has opened with Small Business Saturday; it was great to be able to celebrate small and local businesses at the networking event held by the Hillingdon Chamber of Commerce. Interesting discussions took place around the topic of businesses using AI and how it can assist in improving efficiency and providing a cost saving. Conversations also focused on the Chancellor’s announcement in the Autumn Statement to freeze the business rates multiplier, which is saving our small businesses an average of £1,650 per shop.\nDuring this month, which is also Disability History month, I have been fortunate to visit to Moorcroft School, where I had the chance to learn about the magnificent work that the SeeAbility charity are doing for children with learning disabilities, autism, and sight loss. I was also fortunate enough that the pupils made me a cup of coffee, led me on a tour and gifted me with some fresh eggs that the school hens had laid!\nI recently attended a SEND Football Session organised by Wealdstone Youth FC. These sessions are specifically designed to enable children with Special Educational Needs & Disabilities to have fun and learn new skills in a safe environment. Despite the wet weather, attendance was strong and there were plenty of smiles.\nWealdstone FC continue to make local news with the possibility to build a new stadium on an 18-acre site at Freezeland Way. Though Wealdstone FC need to undertake feasibility studies, including funding availability and planning permission, a new stadium development that enables the club to flourish as a community club is a good news story.\nAnother good news story is the redevelopment programme at Hillingdon Hospital. On a recent visit, it was great to catch up with the senior team, consisting of the Senior Redevelopment Director, Programme Director, Estates Lead and Clinical Lead to understand how plans are progressing. I also had the opportunity to meet with the Chief Operating Officer and Chief Information Officer to learn more about the introduction of an electronic patient recording system. If you would like to learn more about the Hillingdon Hospital redevelopment project, there is an exciting new virtual tour that you can view online, find it on my website under ‘local news.’\nAs we approach the festive season, I wish you all a very merry Christmas and a peaceful and happy new year. As always, if you wish to contact me please do get in touch by emailing me: [email protected] or feel free to complete a survey on my website: www.steve-tuckwell.uk/about-you.",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_news_january-hillingdon-herald-column/content_8.html": "January column published by The Hillingdon Herald\nAs we begin 2024, it is great to see that a vast number of residents will benefit from a tax decrease thanks to the Government’s reduction in national insurance contributions. This will be welcome news for many families and shows that the plan to reduce inflation creates the right conditions for reducing taxes.\nI am sure that many residents will agree with me that the Post Office Scandal is one of the greatest miscarriages of justice in our nation’s history. The Government’s speed to bring forward legislation to quash all convictions as well as the introduction of an upfront compensation offer is welcomed, and I hope that justice is delivered to the many innocent people who have waited far too long.\nAnimal welfare is a topic that is important to my residents and is something that I am regularly contacted about. To represent these views in Parliament, I supported the Second Reading of the Animal Welfare (Livestock Exports) Bill which was passed.\nEnsuring that all children and young people get access to a good quality education is important to me and I welcome the Conservative Government’s announcement of an extra £440m of investment to support Special Educational Needs & Disabilities (SEND) pupils in schools across the UK, including Uxbridge and South Ruislip.\nFurthermore, the recent roll out of 30 hours a week of free childcare for children from aged 9 months demonstrates the Government’s support to working parents and the understanding that they are great assets to our economy.\nIn the Chamber this month, I had the opportunity to ask the Prime Minister if he would agree with me that the new state-of-the-art Hillingdon Hospital will enhance the health provision for residents of Uxbridge and South Ruislip. He agreed and hoped to visit in the future. In the meantime, I look forward to welcoming Health Minister Victoria Atkins to the project site in the Spring.\nIn the 2023 Autumn Statement, it was pleasing to see the Chancellor’s announcement of £12m funding to tackle domestic abuse, including £2m of payments directly to victims to help them leave their abusive relationships and rebuild their lives. Subsequently, the Home Office announced a monumental change to the Criminal Justice Bill, making spiking illegal, which puts perpetrators behind bars for up to 10 years. Alongside this, in 2024 there will be an increase in education for young people to raise awareness of spiking and its effects, as well as an online reporting tool. Police and venues will have trained door staff and self-testing toolkits. Under the Conservative Government, Uxbridge and South Ruislip is a safer place to live, work and socialise.\nI recently met with the new London Fire Brigade Borough Commander for Hillingdon, as well as continuing to attend my regular meetings with the Police. Keeping our community safe is a priority for me therefore it was disappointing to see how the Mayor of London failed to commit to the future of Uxbridge Police Station at a recent London Assembly meeting where he was quizzed by Conservative (Greater London Authority) GLA members. I have since written to Sadiq Khan twice on this matter and demanded that he provide clarification on the future of Uxbridge Police Station (without the courtesy of a reply). Residents will recall the Mayor’s dramatic U-turn two weeks before the by-election in an attempt to support his inner-London Labour candidate. Residents can be assured that I will continue to hold the Mayor to his by-election promise/stunt.\nAs always, if you wish to contact me, please do so by email: [email protected]\nTo pick up a physical copy, see here.",
  "https_www_steve-tuckwell_uk_/https_www_steve-tuckwell_uk_about-you/content_10.html": "As your Conservative Candidate, I want to work hard for the residents of Uxbridge and South Ruislip, all year round, and not just at election time!\nI want to take up your issues of concern and help you as much as possible.\nAs your Conservative Candidate, I want to work hard for the residents of Uxbridge and South Ruislip, all year round, and not just at election time!\nI want to take up your issues of concern and help you as much as possible."
}