{
  "http_electshahrar_co_uk": "Shahrar Ali - Bring Power to Truth Worthy of Respect in A Political Party #BackReality Enter Website Join Our Campaign",
  "http_electshahrar_co_uk_home": "#ElectShahrar — Back Reality #ElectShahrar #ElectShahrar Overview Campaigns Media Performance Testimonials Overview Worthy of Respect in a Political Party SCROLL DOWN Overview Worthy of Respect in a Political Party For Legal case Ali vs GPEW: Worthy of Respect in a Political Party 10 Sept 2022: Interview with Julie Bindel 10 July 2022: Free Speech Nation interview with Andrew Doyle . 27 Feb 2022: Free Speech Nation interview with Andrew Doyle . 19 Feb 2022 : The Telegraph Green Party spokesman sues after being sacked for transgender views Recent articles: Challenging GPEW Deputy Leader Election 2022: Institutionalised Smear Campaigns, Rule Breaches & Hostile Environment for Gender Critical candidate Gender-Affirmative Healthcare, Actual Green Party Policy and Cass SHAHRAR ALI ENTERS GREEN PARTY LONDON ASSEMBLY SELECTION WITH STRONGER TOGETHER “We need to back reality – for the sake of the planet, for the sake of human rights and for the sake of how we do politics.” Back Climate Reality “I’ve been political for as long as I can remember. As a child, when I’ve asked my parents why people in faraway lands fought with one another it must have been out of incredulity that a planet, which bore such riches, could be cause for any kind of disharmony. Why didn’t people just get on? Though older and wiser about widespread inequality, this question still bugs me today – whether in awe of the mechanics of our planetary ecosystem or fascinated by human nature and motivation. “I’m standing through necessity. We are the last generation able to save the planet from ourselves. Despite decades of knowing that we were living unsustainably, we carry on trying to have our cake and eat it – with a return to post-Covid short-haul flights and overconsumption. Millennia of technological advancement and unabated pursuit of desires have led to our standing on the edge of an abyss – collectively responsible for countless species extinctions, ecological devastation and now the prospect of universal death. “After my active involvement for nearly two decades, I don’t think we have achieved enough. Yes, we’ve enjoyed record local election results, but with environmental consciousness and extreme weather calamities at an all-time high, we should be polling double-digit figures nationally. Back Debating Reality “When I joined, in 2002, Green Party conference felt like a university of ideas – where we could debate one another in good faith and still indulge in a round of drinks and laugh together. Today, we have become fractious and risk losing our sense of collective purpose (and humour). “This conflict is evident in discussion of provision of services for transgender people and those who feel impacted by changes to services provided on same-sex lines, especially women. We must return to a culture of open debate, where the taking of offence is not used as a means to prevent those who do wish to debate from doing so. “Party unity will not come from wishfully brushing problems under the carpet, or sitting on the fence while bullies continue their lies and intimidation, but from tackling challenges head on – and having those difficult conversations. “You need a leader not afraid to question, and to actively take a stand against, the abuse directed upon women – many of whom have been driven to resign from parties and others of whom are resisting from within. I will not stand by as a feminist speaker is debarred from giving a talk at a public library by the Council itself. I do understand that a rape victim has the right to choose to be examined by a clinician of her sex as a matter of basic human dignity. “I will defend and champion all the protected characteristics enshrined in the Equality Act 2010. This includes the sex-based rights of women and girls, some 52% of the population; a population we can see being persecuted in Afghanistan today. “We must welcome women back to our party, many of whom are feeling politically homeless. No campaign for mass social and political transformation has ever succeeded without women. There will be no human rights for all if we do not succeed in averting universal death from the climate crisis we face. “We need to back reality – for the sake of the planet, for the sake of human rights and for the sake of how we do politics.” Who is Shahrar Ali? Worked in European Parliament 1999 Published 'Why Vote Green?' 2010 & 2015 First BME Deputy of a UK Parliamentary party 2014 Home Affairs/Policing & Domestic Safety Spokesperson 2017 - Feb 2022 Shahrar Ali was elected Deputy Leader of the Green Party in 2014, becoming in the process the first BME deputy of a UK parliamentary party . He entered green politics after working as a researcher in the European Parliament on the risk of GM foods. He has a PhD in philosophy, in which he tackled the morality of lying and deception. Shahrar edited Why Vote Green 2015, an impassioned call for environmental action in the 21st century. “ Principle without power benefits no one. Power without principle is not worth having. ” — Shahrar Ali Shahrar Ali combines outstanding commitment to the well-being of the party with an impassioned call to Green voters everywhere. Campaigns Back Climate Reality Campaigns Back Climate Reality A veteran grassroots campaigner, Shahrar has been fighting campaigns with the Green Party since joining in 2002. Climate Justice Matters Following an interview with the Guardian in which he described his number one priority for the Party as the Climate and Ecological Emergency, Shahrar Ali said: “Time is running out for the human race to overcome climate change catastrophe. As Green Party Leader, I will articulate our bold vision for social, economic and environmental transformation. We must begin now a radical plan of investment in renewable technology and decarbonisation of every aspect of our lives.” “Whichever recent measure you use, they are the hottest on record: the last ten years, the last five years or the last twelve months. Climate impacts are being felt now, today, through drought and disease. The consequences fall heavily on those least responsible for creating the problem.” “I will help deliver the change that’s required, with the urgency and coherence that’s needed. The government offers up state capitalism as the new normal. Greens will offer Universal Basic Income and Green jobs for the millions that are about to become unemployed.  We need to change what’s politically possible to deliver what’s scientifically necessary.” Join our Campaign Media Performance Accomplished Media Performer Media Performance Accomplished Media Performer Shahrar in the Media An accomplished media performer and stirring public speaker, Shahrar is known for his ability to deliver in the public eye. Don't take our word for it, take a look at some of the videos below to experience his speaking first hand: Shahrar Ali Clashes with Amelia Womack Live on LBC Green Party Leadership Debate. 2 Sept 2021 Shahrar Ali  was interviewed on BBC Daily Politics & Sunday Politics today where he spoke about the EU and solidarity - and the strong green case for voting remain. Deputy Leader Shahrar Ali speaks at the Green Party's Spring Conference, 2016 A serious issue, a not-so serious interview: Shahrar Ali, our Home Affairs Spokesperson on BBC Two's Mash Report to discuss policing with Andrew Hunter Murray. On BBC general election debate 2015, Deputy leader Shahrar Ali takes on the big guns, including Sadiq Khan, on the political issues facing our country, whether the housing crisis or the economic crisis. Deputy Leader of the Green Party, Shahrar Ali, joined a panel debate on BBC South East Today to talk about the crisis in Calais and the humane response we should be taking. Other Links: GUARDIAN ARTICLE AND INTERVIEW 17 Aug 2021: SHAHRAR ALI tells the Guardian why free speech and mature debate is more important to politics than ever, ‘ Green frontbencher at centre of trans rights row to run for leadership ’ Responses to Member Climate Change questions here ; Jewish Greens Survey here . LBC Green Party Leadership Debate, 2 Sept 2021 - far-ranging debate available in full here (clip above) Statement on Commitment to Animal Welfare and Animal Well-being. MORNING STAR ARTICLE AND INTERVIEW 21 Aug 2021: Climate Emergency, Women’s Rights and Free Speech, Why I want to Lead the Green Party INTERVIEW 24 July 2020: SHAHRAR ALI tells the Star why he's pitching himself as the ‘radical’ candidate in the Green Party leadership race, ‘ We are an eco-socialist party and we shouldn't shy away from that ’ NEWS 24 July 2020: ‘Disastrous’ alliance with Lib Dems cost the Greens its ‘credibility,’ leadership candidate says GUARDIAN PODCAST: Guardian Politics interview , from 27.30 mark VIDEO: \"Animal Sentience\": Shahrar Ali on BBC Daily Politics https://www.bbc.co.uk/programm es/p05p2x7z PODCAST: \"Moral Maze\": Shahrar Ali (from 19'44\" to 28'24\") https://www.bbc.co.uk/programmes/b08g7mjy Testimonials supporters Testimonials supporters Supporters In 2014, Greens successfully backed Shahrar Ali for Deputy Leader, a term which he served during a time of tremendous expansion for the party. Browse the slideshow to see why Greens want to elect Shahrar for Leader in 2020. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "http_electshahrar_co_uk_challenge_to_deputy_leader_result_2022": "Challenge to Deputy Leader Result 2022 — Back Reality #ElectShahrar #ElectShahrar Challenge to Deputy Leader Result 2022 Challenging GPEW Deputy Leader Election 2022: Institutionalised Smear Campaigns, Rule Breaches & Hostile Environment for Gender Critical candidate Unfortunately, I feel I must speak out against the legitimacy of the Deputy Leader contest. I have raised my concerns with the ERO and was told that the results would not be announced today (7 Sept 2022) and that this would give him extra time to consider my representations and consult with other officials. I have challenged the result on a number of grounds, including material breaches of the rules by the candidate who was announced today as the winner, Zack Polanski. Best laid plans on announcing a result should not take priority over the integrity of our internal democracy. Let me start with a little background about what I have had to endure in recent leadership contests, before summarising my concerns about this year’s election. Survivor of multiple smear campaigns I have had to face down negative campaigns in three previous leadership election campaigns. In 2018, a member who actively campaigned for Siân Berry was subsequently suspended from the Party, following their false allegations of “transphobia”. This was the year of the Challenor scandal. I was the only candidate to speak out against the Party’s collective safeguarding failure and subsequently had to fight off a series of vexatious complaints alleging “transphobia”. In 2020, I received a torrent of abuse following my determination to speak plainly on the importance of free speech and plain talking on sex-based rights, including for providing a straight-forward definition of woman . Here’s the kind of thing I said in hustings: “I'll be reaching out to people who currently classify themselves as politically homeless and far from us navel-gazing I want us to be externally facing. There are lots of women voters who feel politically homeless and we have got to be articulating their voices and concerns, including within our own party. It is absolutely shocking that women in our party find themselves unable to convene meetings, internally or externally, without fear of being trampled over and deplatformed.” This elicited coordinated face-palming from two of the candidates (see 44.40 at 2020 hustings video ). Candidates for Leader Rosi Sexton and Siân Berry face-palming Shahrar Ali when advocating for right of women to be able self-organise, 2020 hustings. In 2021, I stood again in the leadership by-election following the resignation of both co-leaders. A great deal of vitriol ensued. My polling in these last three elections was 18%, 24% and 21% of first preferences, respectively. Following the 2021 count, I was commended by the CEO in the following terms: “I just wanted to say congratulations on a well fought campaign and for the positive and calming approach you displayed to the count today. I appreciated it.” This was certainly a reference to my help in overcoming the logjam at the start of the count over questions of electoral impropriety and whether the count carried sufficient confidence to proceed. I had plenty of reason to feel aggrieved at the conduct of the election, as I’d already made clear in an open letter to Siân Berry. This background is to serve as a reminder that I have always accepted election results even though I was not the victor and even though I may have had ample reason to feel aggrieved by members misconduct or even the Party’s treatment of me. It is an interesting fact that when I was elected deputy in 2014, it was only after I insisted on a recount which resulted in a small pile of ballot papers (all of which had my votes on them) being found, without which I would not have won. In 2016, I was nearly cheated out of a lead candidate position on a regional list selection, were it not for a miscount being finally corrected after the then ERO had been found to have given faulty instructions to the Electoral Reform Services Ltd. I am not saying this is evidence of corruption, but it is very strange that I have faced two strongly-evidenced instances of nearly being cheated out of rightful positions. Breaches of Election regulations and Candidate misconduct So it is with a heavy heart that I must explain why I have challenged the Deputy Leader result of 2022. This election, I had to suffer and endure an unprecedented volume of vicious personal attacks. Some of these attacks were actively staged and propagated by Zack Polanski, a candidate in the election, across hustings and social media. I believe there have been multiple breaches of the election rules or the code of conduct, and other irregularities, sufficient to cast grave doubt upon the integrity of the result. I set out three problems here: No Disclaimer Allegations of GDPR Breaches Multiple breaches of Election Rules and Members Code of Conduct 1. No Disclaimer Polanski failed to put a disclaimer on his Twitter profile to say that his candidacy did not constitute official GPEW communication. Given that he was also a national spokesperson and elected representative it was doubly imperative for this candidate to make clear that his statements, including personalised attacks, did not carry the authority of the party. The ERO was alerted to this breach at any early stage but no correction was forthcoming. Here is the relevant section from the Executive Election regulations published July 2022: 4.2.5 Election materials. Any campaign materials distributed online should bear the following imprint, written in at least an 8 point typeface: “Promoted and Produced by (Candidate name) as part of their campaign for election to the post of (insert position here). This is not an official communication from the Green Party of England and Wales.”  (p. 11) 2. Alleged GDPR Breaches 2.1 In the run up to the opening of ballot, I received communications from an officer who raised the alarm about suspected GDPR breaches by Polanski and his campaign team to the ERO. The officer did not wish to be identified, but they did give me permission to go public, and so I give a brief summary of their allegations: a)       Polanski’s election team contacted them using data they could only have had as officers and this was unethical and unfair on other candidates. b)      They were being asked to promote Polanski’s candidacy using their own contacts, which would have been known to have been extensive as a result of their previous party roles, which again would be unethical. c)       That Polanski has made similar breaches in a previous selection campaign. There has been a potential breach of 4.2.7: Paid assistants working for the Party are not permitted to campaign for candidates in the election. (p. 11) Candidates are encouraged to campaign through the official mailings and using online channels available to all candidates. (5.1, p. 12) A current party employee was named here by a former party employee. If access to membership data has been misused for the purpose of campaigning for a candidate this could clearly have been of the order necessary to have affected the outcome of the election, particularly on a small turnout where access to scores of members, through go-betweens, could easily affect the voting numbers. This campaign tactic is one of devolving access to members’ data through a sort of plausible deniability, by asking others who do have access to data to make use of it for the same ends. 2.2 During the election, a party officer, also an elected representative, misused a local party What’s App group to rally members to vote for their favoured candidates, with an explicit invitation to contact them for advice on voting choices. They also circulated links to a controversial pledge response sheet from LGBTIQ+ Greens, with a clear imputation that any candidate who had not responded should not be worthy of their consideration either. The reality is that I had taken the trouble to produce a nuanced and comprehensive response . These communications are potentially in breach of the following regulations: The ERO regards it as an overriding concern that as far as possible a level playing field is maintained between candidates. Any publicity opportunities, except hustings organised by properly constituted groups in the Green Party, or otherwise approved by the ERO, and other materials specified as permitted, that will draw the attention of members beyond the candidates local party to a particular candidate will not be permitted. All candidates, and in particular members who are already in elected positions must consider themselves in ‘purdah’ from the date that candidates names are published until the close of voting. (p. 9) The fact that the member was also an elected representative compounds this infraction of the rules, in broadcasting preferences using a channel which is outside the candidates’ local parties and to which not all candidates would have had access. This is a clear breach and it should be established the extent to which groups like this have been abused. This particular group had scores of members on it. 3. Multiple breaches of Election Rules and Members Code of Conduct On 15 July 2022, a member wrote to the ERO to complain about the conduct of Polanski towards me at the national party hustings of 13 July. Whilst considering that Polanski should have to make a public apology for his behaviour, they go on to say: “I have come to the conclusion that that [a well-publicised apology] would not be enough. The effect of Zack Polanski's words, spoken to over 200 voting members on the night, and potentially seen, in the recording, by hundreds or thousands more voting members, cannot be overestimated [example of transcribed words below left]. We cannot know how differently Shahrar's contribution might have gone, had he not been subject to this underhand attack. Along with a repeat of the slur on twitter by another GPEW member (who even created a graphic/meme of the quote) [below right], this has now skewed the election to such an enormous degree that the election can no longer be seen as fair and unbiased.” (member complaint to ERO, 15 July) The following section of the Rules are relevant here: The ERO has no redress against members who are not candidates in the election. A candidate should not be disqualified due to the actions of another member, unless it is clear that member has acted with the approval of the candidate. However, if, in the opinion of the ERO, the actions of a third party may have materially affected the result of the election, the ERO may declare the election void. (6.1, p. 13) The member has directly quoted Polanski following the attack he made upon me in the hustings and tagged Polanski. He did not retract his words and may reasonably be taken to have approved the actions of this member in using his words, which would constitute a breach of 6.1 and potential grounds for disqualification . Polanski cannot claim to be unaware of these rules as they are expressly stated as a condition of nomination, and he has agreed to abide by them, as follows: 4.1 Rules of Conduct By submitting their online nomination forms, candidates agree to abide by these rules. If candidates, or their supporters acting with their approval, are found to have violated these rules the ERO and/or the Standing Orders Committee may make a formal report to the Regional Council. If the ERO considers any violation has materially affected the result (i.e. led to the election of one candidate rather than another) the election may be ruled void. (P. 9) The situation is worse, again, as Polanski has arguably breached the Code of Conduct for Party members. This was explicitly referenced by then ERO on 15 July in the following terms (excerpted by me): Dear Candidates As you will recall I wrote to you on Saturday [13 July] drawing your attention to the Party Code of Conduct and its binding nature. I particularly directed attention to some parts of the code for example: Section 9: 9.1 The Green Party should be an organisation in which people can feel comfortable, feel welcome and enjoy being a member and taking part in its activities. Members' behaviour towards each other and non-members should therefore be: tolerant, considerate, respectful and civil. 9.3 Members should in all their interactions with colleagues, assume the best of them. 9.4 Members should not: shout at someone; be aggressive in their manner; make belittling, derogatory or disparaging remarks about another member; insult a member or disrupt a meeting or discussion. It is highly arguable that Polanski has breached the Code with respect to 9.1, 9.3 and 9.4 in his behaviour towards me at the national hustings. He made belittling, derogatory and disparaging remarks about me and did not assume the best of me. Even if this was to be read as a final, final warning to any and all candidates, Polanski went on to ignore the warning by further continuing to act in a harassing way towards me, in continuing to make derogatory comments about me in hustings and in public and to encourage others to do so by amplifying attacks upon me on social media. One of the most overt attacks was made during the LGBTIQ+ hustings on 20 July, which I subsequently called out . I also made representations to the ERO on 21 July and, on 30 July, directly challenged Polanski to retract his misrepresentations . There were further anomalies in the conduct of the election: Absence of an ERO for a crucial period between their removal and replacement by SOC, during the ballot period. No ERO at Count. Inconsistency of advice or practice between special interest groups in their publication and promotion of candidates’ responses to questionnaires or pledges, most notably, between LGBTIQ+ Greens and Green Party Women (who felt prohibited from publishing candidate responses received). Interference from a third party, particularly officers and elected representatives of the Scottish Green Party, making unfounded allegations of a candidate, publicly, encouraged and amplified by candidates and their supporters. Story here . For all these reasons, I am challenging the fairness and integrity of the result. This is not an action I take lightly, but the integrity of our internal democracy is of the utmost importance; as is the capacity for candidates with gender critical views to feel they can stand for election or selection without fear of horrific abuse. Hostile environment This is the kind of abuse I have had to endure on Twitter in recent weeks and some in the Party have stated their belief that it was deserved. That is the kind of intolerant fanaticism we are dealing with in the party. I’ve never known it to be so extreme or so hostile to reason. Abuse received during Deputy Leader election It is known that I am currently taking the Party to court for discrimination on grounds of gender critical protected belief, following their removal of my national spokesperson role in February 2022. The party has been actively facilitating this hostile environment against me, continuing to cede to authoritarian bullies and reinforcing misrepresentations and innuendo from transphobia smear campaigns against me. On the day of the opening of ballot, 1 August, the party chose to give credence to yet more complaints from members seeking my expulsion for “transphobia”. Chief among the allegations was my questioning the legitimacy of Stonewall’s approach to LGBTQ education for children. The clear implication is that debate is not welcome in this party, especially during a deputy leadership contest in which reasonable disagreement could be had about the direction the party is taking, and that I should STFU. Despite this hostile environment, I am putting a motion to conference again to seek our disaffiliation from Stonewall. That is the backdrop against which, despite the Party’s boast that I still remain a member, with all the rights that I am meant to enjoy, the reality is that they have made it impossible for me to meaningfully exercise those rights. As recently as June 2022, an officer abused their privilege as a host to a regional zoom meeting questioning my right to participate in a meeting by directing a series of private messages to me in the chat, in quick succession. Their behaviour was unacceptable and harassing, This individual also stood in the recent GPEx elections. Harassing private messages during a zoom meeting from party officer and co-host, June 2022. Knowing One’s Friends Finally I want to thank all those members and supporters who have stood by me through thick and thin. Some of you also voted for me, despite the intensity of the attacks and determination to stigmatise me as hateful, which has become institutionalised. Under these circumstances to still command 24% of first preferences demonstrates that many of you understood the imperative for mature open debate, whether on the right of women to self-organise for their sex-based rights or the existential climate emergency. I stand for the human rights of all, equally. I also stand for the integrity of our internal democracy. Therefore, I cannot pretend that the outcome of the election was fair, nor in accordance with our election rules or that the conduct of one deputy candidate was in accordance with our members’ code. The double-standard is breath-taking. I would never have got away with even half this level of misconduct towards another candidate. Nor would I have wanted to and nor should I have. Our internal democracy is already broken enough, when only 12.5% of 50,000 members feel motivated to vote (compare this to Conservative party’s 82%). To let multiple breaches of our rules go unanswered, too, is surely the final straw for any pretence that we are a party of principle and better than the other parties. I await news from the ERO, who has given every indication that he took my concerns seriously. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "http_electshahrar_co_uk_gender_affirmation_and_actual_green_party_policy": "Gender Affirmation and Actual Green Party Policy — Back Reality #ElectShahrar #ElectShahrar Gender Affirmation and Actual Green Party Policy GENDER-AFFIRMATIVE HEALTHCARE, ACTUAL GREEN PARTY POLICY AND CASS Sharp rise in child and adolescent referrals to GIDS over period 2009-16, particularly affecting females. Source CASS review On 28 July, LGBTIQ+ Greens contacted all candidates, including Deputy Leader ones, with a pledge request and a deadline of 31 July for responses. Those received were published and circulated on 1 Aug on day of ballot opening. There seems to have been quite a low response rate. Some candidates have since stated they had pressure of time and others that the format was not appropriate (citing advice from the ERO). A Twitter user commented , with an illustration, “More than half asked either didn't fully support or didn't think it important enough to respond to the pledge?” I will set out my response here (also available as pdf ). Firstly, I am certainly not one of those for whom the inference can be drawn I didn’t think it important enough to respond. Last year, as a leadership candidate, I did produce a longer response to a similar set of pledges and these can still be viewed here . These historical responses should still be of interest to voting members today because they will demonstrate consistency in my thinking and statements and also show that I have been able to anticipate some big political issues of the day. I also raised the alarm about GIDS in a motion to conference in Spring 2021, and endured sustained harassment for it by some. This year, I was in correspondence with LGBTIQA Greens before the deadline about whether they could allow a more detailed response outside the format of the pledge request, which only allowed Yes/No answers on each pledge. I was willing to supply a link as I did last year but it seems they did not approve this idea. I am going to focus on what I take to be the most controversial pledge: Support gender affirming healthcare for trans youth, rejecting ideological interference with current practice. I cannot agree to this pledge as stands as at best it does not clarify what gender affirming healthcare is and on the standard meanings it is not something I can support. Let me define it with a view to saying that I believe the Green Party policy would strongly support my stance. A broad definition would encapsulate a range of approaches to care and treatment, including social, psychological, legal and clinical. But options for treatment should not be prejudiced towards affirmation of gender, absent a thorough assessment of the individual. That prejudgment, contrary to the implication of the pledge , would itself betray an ideological bias , not necessarily in the patient interest. The focus of the gender-affirming model of healthcare is normally in clinical contexts, as a way of justifying medical interventions, such as puberty blockers, hormone therapy and genital surgery, all aimed at supporting the patient to live in the gender that does not match their natal sex. These medical interventions are some of the most controversial – because experimental, irreversible or hard (some might say impossible) to obtain age-appropriate consent for. The thresholds for referral and clinical due diligence for implementation are currently the subject of a wide-ranging review into NHS treatment standards and options for patients who may be presenting with gender distress, incongruence or dysphoria. We should be thoroughly conversant with the progress of the Cass Review, its interim report and the reasons for the announcement , which broke just last week, to close the GIDS clinic at Tavistock. That closure announcement followed the culmination of years of whistleblowing from clinicians, David Bell and Sonia Appleby, and patients at the Tavistock, most notably Kiera Bell (which led to the judicial review in Dec 2020). We should also be concerned at the historically sharp rise in child and adolescent referrals to GIDS, such as over the period shown below 2009-16, particularly affecting females. So what should the Green Party be saying about gender affirming healthcare in this context? Firstly, for avoidance of doubt, we do not have an explicit policy on gender affirming healthcare (the relevant sections are Rights and Responsibilities and Health ). Judging from statements regularly and repeatedly made, or amplified in public, by some Greens, you might have assumed the contrary. To repeat: Gender-affirming healthcare, as an ideological approach, is not Green Party policy. We do however have policy that would chime with the very deliverances of the CASS review, which stated: A comprehensive patient and family centred service and package of care is needed to ensure children and young people who are questioning their gender identity or experiencing gender dysphoria get on the right pathway for them as an individual. (Cass to NHS England, 19 July 2022) This is not gender-affirming healthcare as it does not prejudge the end goal. It is, moreover, entirely consistent with the values and statements of our health policy, for example, take this opening section: HE300 This policy sets out how services will be delivered and regulated. It expands on our values and principles where necessary but it will not make judgements on individual treatments or medicines unless as a point of principle. In so far as gender-affirming healthcare attempts to push for a general course of action, without sufficient evidence or exploration of alternatives, it is inconsistent with this Green Party policy to treat each individual according to the merits of each case. Under Assessment of Treatments (HE1408-HE1411), we say: The effectiveness of treatments will be assessed by the [independent healthcare] agency using the best clinical evidence available. The agency will use independent panels of experts to assess treatments. The agency will assess the effectiveness of treatments across the entire health care spectrum, from synthetic pharmaceuticals and surgical procedures to public health interventions and complementary therapies. (HE1408) This sounds remarkably like what the independent CASS review is doing. Nor is it the case that Party policy would avoid consideration of budgetary constraints in assessing the overall viability of treatment options: The agency will produce recommendations that compare effectiveness against cost allowing the NHS to decide which treatments are required to meet the needs of the service within its budget. CASS has emphasised holistic, multidisciplinary care in its new offer to patients referred for gender distress, and wants to ensure greater attention to potential co-morbidities: The centres should have an appropriate multi-professional workforce to enable them to manage the holistic needs of this population, as well as the ability to provide essential related services or be able to access such services through provider collaborations. These should include, but not be limited to: mental health services; services for children and young people with autism and other neurodiverse presentations. (Cass to NHS England, 19 July 2022) This alternative approach is remarkably consistent with what we say in Health: HE1409 Whilst assessment of treatments must be evidence based, an holistic approach will generally be taken. This will take into account the range of factors in health and disease, wider benefits and health outcomes than addressing a single illness and a full assessment of side effects and risks to the patient and to society. Treatments that target the causes of ill-health will be favoured over treatments that simply target symptoms. So, in response to the pledge, in a nutshell: I do not support a gender-affirmative approach to healthcare, but an evidence-based, holistic approach that does not predetermine the source of the gender distress. My approach is entirely consistent with actual Green Party policy. The other pledge which I cannot support in the format given is the Conversion therapy bill. Yes, all of us is against conversion therapy as such (as stated in our policy under HE1003) – and I have signed up to the general principle even in my responses of 2021 (linked to earlier). But the original government bill risks criminalising therapists who would prioritise talking, exploratory therapy; not with the aim of denying their patient gender affirmation but for confirming the diagnosis (or not). I have addressed this topic in the LGBTIQ+ Greens hustings and you can playback my response to Zack Polanski’s disreputable attempt to smear me at the same time (smears I have asked him to retract). Members have the opportunity to vote for the Deputy Leader candidate who would put science front and centre of their thinking, as should all Greens, whether in medical science or climate emergency. #BackReality Coda. As a caveat, there should be no doubt that the Green Party is allied to science not ideology. Our health policy is shot through with reference to objective science and authoritative medical scientific bodies, to which or whom we would remain answerable. Some examples: On single sex wards and patient dignity: HE204 To ensure that health care services are delivered with compassion, taking into consideration patients full range of needs, health care will be delivered in an environment that promotes healing and care. This includes single sex wards in hospitals, ensuring that maternity care is of the highest quality, ensuring that care reflects people's needs and that care promotes the dignity of all patients. Teaching of biology in schools (in context of pregnancy section): The Green Party would implement medically-accurate abortion, pregnancy and childbirth education for all genders into its education policy. Nobody should leave school unaware of the medical realities of reproduction. (HE701) Avoidance of unscientific or ideological bias in medical settings: The Green Party would ensure that all medical staff involved in publicly-funded counselling and healthcare involving a person’s reproductive health are committed to providing unbiased, patient-led, and medically accurate advice, regardless of their personal moral convictions. (HE704) Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "https_electshahrar_co_uk_shahrar_ali_reponses_to_climate_questions": "Shahrar Ali Reponses to Climate Questions — Back Reality #ElectShahrar #ElectShahrar Shahrar Ali Reponses to Climate Questions Shahrar Ali answers Climate leadership questions from members – 31 Aug 2021 Also available as pdf here . 1.       How do you ensure the importance of the climate emergency stays at the top of agenda whilst bringing in new voters? There’s a virtuous circle here between our prioritisation of the climate emergency and membership recruitment. Firstly, climate justice requires justice for all and my role would be to bring out the interconnectedness between our climate mitigation policies and win-wins for ordinary people looking for secure, meaningful work in green technology; or being able to focus on important things in life like knowing their basic needs will be met through a Citizens’ income. Membership, and party activism, is just one measure of our success in getting our message across. 2.       How do you plan to effectively engage non Greens in this country who say \"we are doing enough as we are only responsible for 1% of world carbon emissions\"? This sounds like lying with statistics, as it fails to take into account our per capita carbon consumption, much of which is not accurately accounted for due to exporting of the production activity to faraway lands. Our per capita emissions, whilst not top of the league table, are still grossly unsustainable and we can’t beg off on our own responsibilities by thinking we are not the worst offender. 3.       Do you agree that addressing climate change is our number one priority and that we owe it to future generations to focus on that? Yes, we owe it to future generations, and we owe it to ourselves this generation and for our children today and their children tomorrow. There’s a great book by Rupert Read which explores the imperative to care for our children and he tries to develop a motivational requirement upon us all to invest as much in the plight of generations who aren’t around yet as those who currently are, and that we have this strong interest in the well-being of everyone. You can read my review of the book here https://greenworld.org.uk/article/book-review-parents-future 4.       Should the GPEW focus its efforts on highlighting the global ecological collapse of which climate change is one element, or should the focus be solely upon climate change? We need to tell the truth about both, not least because the interconnectedness of our own species survival is so inextricably bound up with the health of other species, plant and animal, we share this beautiful planet with. Species loss today is estimated to be 1,000 to 10,000 times higher than the natural extinction rate. 5.       With tipping points being reached in 2040 under all scenarios, do you think your candidature will put due focus on the climate emergency, and how will you make sure that other issues, important as they may be, will not distract from human and planetary survival issues in the face of developments such as the imminent collapse of the Gulf Stream? The climate emergency has been my priority for as long as I’ve been active in the party, for the last 19 years. I have authored books in which climate takes centre stage; you will find in my 2010 and 2015 Why Vote Green books. As policy coordinator for London, I argued for a redraft of the national party template for the general election communication to voters to incorporate much more climate text. I do share the frustration of many in the party that climate campaigns appear to be playing second fiddle to other priorities. As one among equals on GPEx I would use my voice to attempt to redress this imbalance. I have been a founding member of GreensCAN, which aims to develop a support network for environmental action https://www.greens-can.earth/copy-of-about . 6.       We have so little time to make vast changes re alleviating climate / eco breakdown. How do we make this time count? What are the candidates’ priorities for achieving change? This is going to be a longer answer! We must overcome political cowardice. Outside the global Green parties few politicians have been willing to shout, “Fire!” But as Greta says, the building is on fire. Of course, shouting fire isn't enough. To avoid catastrophe we have to transform our energy, transport and farming systems. That's going to be hard and even with a just transition to a more sustainable way of life it will be uncomfortable for some. But we have to do it. The first climate priority for a Green government would be 'stop digging'. We have to stop making the climate problem worse so: ·       No airport expansion ·       No new roads ·       End fossil fuel subsidies ·       No gas boilers in new homes ·       All meetings between government and industry or Trade Unions (other than security matters) to be announced and minuted. Second - begin to build the low-carbon alternative - this is at least a ten-year programme: ·       Introduce carbon tax ·       In parallel, supplement taxation with Personal Carbon Allowances (the latter is a policy proposal coming from me to Autumn conference) ·       Expand wind power and energy development and the grid ·       Announce dates from which fossil-fuelled vehicles can't be used on UK roads (probably different dates for cars, vans, buses, HGVs, tractors, etc.) ·       Start major training programme for retrofit workers ·       Start national housing retrofit programme ·       Make Passivhaus the default standard for new buildings ·       Accelerate the development of active travel infrastructure (e.g. cycle lanes, Low Traffic Neighbourhoods, after full consultation on design with disability user groups) ·       Set target for making company accounts comply with Sustainable Cost Accounting - largest first ·       Expand R&D on low-carbon technologies Third - start national and regional discussion of Just Transition measures with local authorities, employers’ organisations, trade unions and community groups. Develop a Just Transition support budget. Fourth – start a phased programme of industrial decarbonisation – probably start by expanding steel recycling and closing blast furnaces. The bottom line is that every sector will have to change.  There are 50 – maybe 500 – actions needed in a comprehensive, co-ordinated systemic approach.  This is just a sketch for a vast change across government, politics, economics and society.  I would be advocating for and asking Greens to set up citizens' assemblies to help to support the sea-change in thinking and behaviour required.  We need to change what is politically possible if we are do what is scientifically necessary. 7.       Do you agree that the Green Party might achieve more on climate / ecosystem crisis by placing more weight on these issues than on social justice issues? I don’t accept that climate collapse can be properly addressed without discussing social justice, too, whether as a means or an end in itself. However, I do accept that we can afford to communicate more directly about the impact of our climate trajectory and that we can broaden out the scale of harms to include unborn future generations and the multitude of others species we share this planet with, none of which is traditionally included in considerations about social justice. Ecocide, for example, is an attempt to confer value upon non-human species, too. 8.       Will you put the Climate and Ecological Emergencies at the absolute forefront of everything you do as leader as all matters of social and economic justice are connected to environmental justice? Yes. 9.       What will you do to address the regional inequality that exists between England and Wales in government spending on the decarbonisation measures necessary to tackle the climate crisis? It’s vitally important for us to protect the most vulnerable and marginalised in society through any widespread social and economic change proposed, especially when the change is systemic. Economic and social deprivation in Wales or Cornwall, for example, would be tackled first through a citizen’s income. Thereafter, we must pursue just transition so that pockets of poverty are not exacerbated but lifted up; and this is entirely possible if we were to pursue a principle of carbon tax or budget that enabled our per capita carbon emissions to be capped at the same level for all. I believe we should supplement carbon taxes with Personal Carbon Allowances – a system of carbon currency accounting at source, where each of us would be given an annual carbon budget to spend against. We need a radical shift in how we budget in order to bring CO2 within safe limits, today not tomorrow. This system would also be egalitarian at stroke, as the rich would have the same budget as the poorest in society. The rich West would also have to bring their overconsumption down more sharply than those in less developed countries. This is fair as it is those least responsible for climate change who are often made to suffer most at the sharp end of rising sea levels or drought, yet least able to afford the remedial action to contend with it. This is the double injustice of the climate emergency. The devastation reeked upon Western Europe, closer to home as it was, should be a wake up call to us all. 10. Will you promise to prioritise stopping the building of coal mines, encourage wind farms and shout loudly about global warming? I do and will continue to do all these things: ·       Coal is the worst fossil fuel but we burn very little for electricity. We should stop using it now. ·       The coal mine planned for Cumbria will produce coal for blast furnaces. Since it is party policy to phase out blast furnaces in favour of recycling steel in electric arc furnaces I would oppose any new coal mine. ·       Wind is the future of the UK's energy system. A recent study by Imperial College has confirmed our view that we need to build on and offshore wind turbines much faster than the government plans. ·       I'm on record - the climate emergency is the greatest current threat to humanity. It is already central to green politics - within a decade it will be central to all political debate. That may not be soon enough. The leader of the Green Party is not part of the government so has no power. That's why we need a Green government! 11. Should we be telling the public that billions of people are likely to starve to death as a result of imminent exponential global heating? That's very much a worst case but the best cases are very bad. Already we see drought in the horn of Africa, famine in Madagascar, flooding in Germany. Temperatures and sea levels will continue to rise beyond the date we get emissions to zero. We've managed a global mobilisation - incomplete but real - to resist Covid19 whose death toll has been less than we fear from climate change. It should not need a billion future deaths to prompt action and I don't think it does. There's already wide support for action - we need to turn this into support for specific actions. 12. Do you consider current environmental concerns and climate change to be a result of overpopulation globally and nationally, and if so what approach would you take to strategy and policy in this specific area of concern? Population is clearly a factor in the global climate and environmental emergency but it's not the most important factor. The most important factors are: Rising prosperity - first in the West and more recently in China. This prosperity would not have been possible without coal, oil and natural gas. Political cowardice. Outside the global Green parties few politicians have been willing to shout Fire! But as Greta says the building IS on fire. Of course shouting fire isn't enough. To avoid catastrophe we have to transform our energy, transport and farming systems. That's going to be hard and even with a Just Transition it will be uncomfortable for some. But we have to do it. But you asked about population so I'll answer. The most effective policies are improving girls’ education and providing easier access to contraception and abortion. Happily these are policies we want anyway. They give girls more choices and effective means to make those choices happen. And  just for the avoidance of doubt let me say that these policies are needed here in the developed world generally - as that's where the emissions are greatest. 13. Do you really believe we can turn back the tide of global warming? Yes. We can. We know what to do - end fossil fuels subsidies, introduce a carbon tax, fly less - what the UK needs to do now is in the 2019 manifesto. Every country is different but every country needs a transformational plan. Will they all do it? Well the Global Greens is the largest political party on earth but there are strong forces against us. But unless we try we cannot win. The prize is great: nothing less than avoidance of universal death. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "https_electshahrar_co_uk_shahrar_ali_response_to_jewish_greens_candidate_survey": "Shahrar Ali Response to Jewish Greens Candidate Survey — Back Reality #ElectShahrar #ElectShahrar Shahrar Ali Response to Jewish Greens Candidate Survey SHAHRAR ALI RESPONSES TO JEWISH GREENS LEADERSHIP CANDIDATE SURVEY 060921 Shahrar Ali meeting with Jewish community leaders before Lockdown, Holocaust Memorial Day 2019 Responses also available as pdf here . Question 1: How do you intend to support the role of liberation groups such as Jewish Greens within the Party? Liberation groups play an important role in building party solidarity around external campaigns and in providing a locus for members to develop policy in particular areas of interest. I do, however, think we are suffering from divisiveness in the party which these liberation groups could help to overcome. Take the slogan, “nothing about us without us”. Of course, I agree with the principle and spirit of it, but with the caution that there can be a tendency to assume that genuine consultation has included all the relevant people when in fact it hasn’t, because more people are affected than were originally assumed. Moreover, delegating initiative to interests groups can carry with it a risk of excluding others who are equally affected. For example, proposals for GRA reform arguably affect everyone equally and so assuming only one group should have authority in the matter would be a mistake. The “about us” and “without us” is not always obvious. Another example is that a bad definition of antisemitism could disproportionately affect Palestinians, or their allies, as well as Jews – precisely because it would be counterproductive on its own terms and not help to tackle genuine antisemitism by conflating legitimate political criticism. The Campaign Against Antisemitism, which promotes adoption of the highly problematic IHRA, has been caught out for peddling Islamophobic stereotypes and so we must look out for all communities and call out any racist stereotyping, equally. Question 2: What is your strategy for tackling antisemitism within the party? What do you see the leadership’s role in this as? I oppose all racism, including anti-Jewish racism, which is sadly on the rise. I regard our party as a safe and tolerant space for members of all religions or none, but this is not something we can be complacent about. We must ensure that members treat one another with respect and that they feel safe and supported in reporting any incidences of antisemitism. We can improve trust in our processes, and where necessary this includes the use of disciplinary ones, by adopting good definitions, such as the Jerusalem Declaration of Antisemitism instead of the IHRA. The JDA supports a robust interpretation of how to identify antisemitism, especially within the context of free speech on Israel and Palestine, following a critique of the IHRA. I have a motion to conference to do just this, which I know another candidate pair now supports, too. I also support training on all forms of anti-discrimination awareness and think it is important that these both be delivered by properly licensed and vetted organisations and that we fulfil our duties under the Equality Act by being proactive on all forms of discrimination. As one among equals on GPEx, I would be part of the deliberation and decision-making on how best to achieve this. I would like us to introduce and prioritise training on active bystander techniques against bullying in the party. Standing by and witnessing should not be an option, especially among our leadership figures. Question 3: What should the Green Party’s role be in tackling new far-right and conspiracist movements, which have strong antisemitic elements, particularly on social media? One of the great strengths of the Green Party is our commitment to the principle of assessing information based on evidence.  Conspiracy theories appeal to those who are trying to make sense of an increasingly complex world; many of these theories are indeed antisemitic. We need to make it clear that there is absolutely no place for such false and destructive theories in our party. We must concentrate on promoting evidence-based factual information to counter such falsehoods, while encouraging critical thinking so that people can more accurately assess the tremendous amount of information with which we are faced every day. Question 4: As leader how would you promote outreach to faith communities such as the Jewish community? I agree that outreach to religious communities is important.  I have been taking part in the commemoration activities of Holocaust Memorial Day every year for many years. Here’s a recent example just pre-lockdown: https://www.facebook.com/ShahrarAliGreenParty/posts/1157593461078817 I am delighted that this year’s Rosh Hashanah can be properly celebrated this week, with the lifting of the Covid restrictions. And of course, in addition to the three main religions of this country, I am also keen to reach out to people of other traditions: Muslim, Hindu, Buddhist and others. We need to celebrate the common values of our wonderful range of traditions in the UK, while respecting differing expressions and contributions to society. Question 5: What do you believe the Green Party’s stance should be on ritual slaughter practices such as Kosher and Halal meat? We should promote dialogue with religious communities around humane slaughter methods, many of whom are already engaged in this matter. The Green Party is rightly committed to promoting animal welfare and where there is a conflict between that and religious tradition, we must not be afraid to face that conflict and look for a positive way forward. I am aware that the proponents of ritual slaughter methods claim that these methods are humane, but more research must be done in this area. I also have a good relationship with East London Mosque and have been impressed with their commitment to reducing meat consumption in its own right as part of responsible environment action. With a diploma in Theology and sometime teacher of classes in philosophy of religion and animal ethics, I am confident in being able to address audiences or journalists on these matters with minimal preparation. I hope I’d be well-placed to avoid the kind of cross-fire which Jonathan got into over his incautious, nay offensive, remarks about halal meat. Despite his apology those comments did stick with many in the Muslim community, one we would do well to better reach out towards. Question 6: With a year on year rise in reported antisemitic hate crime since 2015 (excluding data collected during the pandemic), what steps should the Green Party be pushing for to reduce this? The Green Party must send an unmistakable message utterly condemning antisemitic hate crimes. Just one aspect of this is clamping down on racially motivated hate-speech in the context of international politics. By setting out our own policy regarding antisemitism within the Party, based on a clear definition of antisemitism that permits the justified critique of the actions of the Israeli government (instead of a conflation of the two), we will demonstrate a clear model and protect others in our party from vexatious allegations. Question 7: Jews and GRT [Gypsy, Roma, traveller] communities share common histories of racial violence and discrimination. What would you do as leader to help tackle discrimination against GRT communities? Racial violence and discrimination against the Roma and wider travelling community is a big issue.  I am extremely concerned about the Police Crime Sentencing and Courts bill currently making its way through Parliament. Not only does this bill have grave implications with regard to our right to protest, it also has potentially very negative implications for travellers. One of my first acts, if elected leader, will be to speak out strongly against this bill, pointing out the implications and the hardships it would inevitably lead to if passed. I have already begun the work of speaking out against these abuses of state power in my role as spokesperson for Policing and Domestic Safety. Pledge 1: Would you support the Guidance on Antisemitism being included in the Framework for Ethics and Conduct? No [with more about context of better alternative above]. Pledge 2: Would you commit to the principle of “nothing about us, without us” when talking publicly about issues relating to liberation groups? Yes [with more about context of saying yes above]. Pledge 3: Would you attend antisemitism training and support its role out across the party? Yes [with more about conditions for saying yes above]. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "https_electshahrar_co_uk_shahrar_ali_on_animals": "Shahrar Ali on Animals — Back Reality #ElectShahrar #ElectShahrar Shahrar Ali on Animals STATEMENT OF COMMITMENT TO ANIMAL WELFARE AND ANIMAL WELL-BEING Also available as pdf here . I am proud of our Party's stance on animal rights; I fully support our policies and I welcome the role Greens for Animal Protection plays in ensuring that we continue to develop and improve these policies. How humans treat the other animals with whom we share this planet is hugely important with regard both to the immediate suffering caused to others by our actions and to how humans' ill-treatment of animals contributes to the environmental crisis that threatens us all. In this brief statement, I shall pick out just a few key areas to mention: Farming: I would strongly promote our Green Party policy on moving away from animal farming and towards plant-based food production. I strongly support the promotion of a vegan diet in public institutions, such as in schools, to have that as a substantial option in their canteens. This is both an animal rights issue and an environmental one. As long as animal farming remains, we must enforce the highest possible standards of animal care. Having received questions in this election campaign about whether we should ban the ritual slaughter of animals, I'd like to mention here that I believe we should promote dialogue with religious communities about this; where there is a conflict between animal rights and religious tradition, we must not be afraid to face that conflict. The proponents of ritual slaughter methods claim that these methods are humane, but more research must be done in this area. We should be more vocal in opposing the badger cull; measures should be put in place to vaccinate badgers and cattle and to improve the farming methods which are implicated in disease. Intensive agriculture: The use of antibiotics and growth hormones in farm animals is a concern regarding animal welfare and also for human health and environmental impact. I left the biotechnology field out of a deep concern for exploitation of animals in intensive agriculture, including the manufacture of BST which fortunately did not get a product licence in the EU but I was no longer comfortable about being associated with its production. My work in the EU covered environmental protection and risk assessment including producing briefings to parliamentarians to help inform their debates and votes on maintaining a moratorium on GM organisms and GM food. Fishing : this is another area of great concern, again, both regarding animal suffering and environmental harm. Whole ecosystems are damaged by modern fishing methods and untold suffering is inflicted on not only the target fish but also all those so callously dismissed as 'by-catch'. I would push hard for the sentience of decapod crustaceans to be recognised, and to ban the hideous boiling alive of crabs and lobsters. Animal experiments : I strongly support animal-free research and endorse our Party's policies on ending animal experiments, including in the military. I have gone head-to-head with Colin Blakemore on a public platform and believe I was able to expose the flaws in his justifications for continued animal research. Sports : the exploitation of animals for human entertainment is utterly unacceptable. The recent Animal Aid investigation into the slaughter of unwanted racehorses demonstrated the callousness of the horse racing industry; greyhound racing is a similarly vile industry, and I would like to see these sports banned. I would push for the Hunting Act to be enforced – as we all know, it is routinely ignored, with trail hunting merely a smokescreen for illegal hunting – and for the banning of all blood sports including shooting and fishing. Public speaking and community relations: I believe in two main ways of championing animal rights: speaking out and leading by example or encouraging others to do so at a community level. I take every opportunity I can to speak out. I have studied and taught ethics for many years and the ethics of how we relate with our fellow animals is an important part of my work. (Here is a clip from me speaking on the BBC about animal sentience: https://www.bbc.co.uk/programmes/p05p2x7z ) Regarding my setting an example, for those contemplating a vegan diet, personally, I'm not quite there yet but am moving in the right direction, especially when combining all the productive joys of seeding and harvesting vegetables from the allotment – which is already doing much to address this balance in my diet. However, we should avoid turning electors away for not doing enough; that’s not a good motivational strategy. We have to start from where they are at, and provoke their thinking and raise their aspirations, gradually and collaboratively. I have had conversations with Islamic community leaders, for example, about the promotion of meat-free days, explicitly referencing the harm to the environment and climate change. They truly get this. Centring animals : Respect and compassion for other species is inseparable from Green Party philosophy; however, I am aware that sometimes animal rights can get buried in environmental issues. Our animal policies should be firmly placed at the forefront of our debates. I think you will regularly hear me scope out from our anthropocentric ways in topical debates by mentioning the negative impact we are having on other animals. The preservation of species and habitats is different from protecting wildlife and individual wild animals. Anyone who has ever connected deeply with a non-human animal knows that the other is cognitively and emotionally a fully sentient being. This is of course a frightening realisation for humanity: so much of our advancement has been at the expense of our fellow beings, animal and other than animal. To acknowledge it will mean radically changing our ways. I believe we must find the courage, and the moral honesty, to do so. And what a different world that will be. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "http_electshahrar_co_uk_shahrar_ali_open_letter_to_sian_berry_1_sept_2021": "Shahrar Ali Open Letter to Sian Berry 2021 Leadership Election — Back Reality #ElectShahrar #ElectShahrar Shahrar Ali Open Letter to Sian Berry - 1 Sept 2021 Open Letter to Si â n Berry from Shahrar Ali, GPEW Leadership candidate, 1 Sept 2021 FROM: Shahrar Ali for Reality Check, Candidate for Green Party Leader, Personal capacity (not GPEW) TO: Siân Berry, Acting Leader, Green Party Pdf version 1 September, Eve of Leadership ballot Dear Siân Negative voting in Leadership elections I was disappointed and upset to see you actively campaigning yesterday ( 31 August ) against three of the leadership candidates, including me, by publicly advocating that members should place RON ahead of us. I would like to set out why I think this behaviour falls short of the standards we expect from our Leaders and how your recent public pronouncements have put me, as a candidate in this election, in a situation where I feel that I must now speak out. My overriding objective is the well-being of the Party and to this end I am convinced that we must find a way to settle our differences and unite around urgently tackling the pressing crises faced by humanity. You have every right to vote as you please but I do think that the position of Acting Leader, and the use of that platform, carries with it certain duties towards the well-being and reputation of the Party, especially in one’s public statements. Most people would regard it as an unwritten rule that an outgoing incumbent would not try to exert undue influence over the election of their successor. There is a potential conflict of interest to consider, just as it would be improper for the returning officer, say, to sanction your chairing one of our hustings events. By writing off four of the candidates as being unworthy of election, you are effectively sowing the seeds for further division and conflict should one of those candidates or a pair succeed, contrary to your wish. Should myself, or Tina and Martin, say, be elected, would you cooperate with us in handover processes and generally help us settling in? I should hope that you would respect the integrity of the process and the will of the voting membership. Can one meaningfully indulge in publicly announcing one’s voting preferences, in a personal capacity, while in the role of primary spokesperson for the Party – when most everything one does or says can be interpreted as official? I note that, today, you have reposted your video this time without a Green Party world with petals logo – to reduce the misapprehension that this was an official announcement, approved by the Party. Your resignation statement, “active anti-transphobia” and inconsistency I have refrained from responding in any way to your resignation statement of 14 July 2021 but now feel bound to say something. To date, I know of no member who has received an official party communication about your resignation, i.e. your statement of intent not to stand again following Jonathan’s resignation (which was official). Your statement avoided naming me as the reason for your dissatisfaction with the appointment of our spokespersons and the alleged inconsistency between those appointments and the Party’s position on trans rights and inclusion. However, since the official spokesperson launch on 7 June, no other spokesperson has been subjected to an onslaught of mob abuse over social media alleging transphobia; and it is clear to everybody who has been following the matter that you could only have had me in mind. I think you do me a disservice not to contact me directly over your stated concerns, which remain vague, or even to use internal processes to evidence your allegations. Whilst I wouldn’t wish complaints upon anyone, you do know how to use such processes; of which more shortly. Instead, I believe, the course of action you have taken has facilitated, however unwittingly, a climate of hostility towards me. You gave an interview on 17 July (Open Democracy) advocating for “active anti-transphobia”. Some members have taken this as a call to attack me further, citing that very phrase. I am sure you would not seek to stir up a hostile environment towards me, which could endanger my personal safety and those who most relied upon me. Had many, many friends in the party not stood up for me or called out this hostile campaign for what it was, I don’t think I could have survived it. I would like to ask you, however, to ask others to desist from such behaviour and take greater care yourself not to make statements which could reasonably be interpreted as about me – at least not before you have taken steps to have them proven first. The zeal with which I have been targeted, with a blogger in train, can hardly be overestimated. On 18 July, Young Greens, at their annual convention, passed a motion calling for GPEx to consider terminating my appointment as spokesperson. This was reported the same day (by Bright Green) as 93% voting in favour and without giving any further numbers. I had been offered no prior right of reply to the motion and subsequently learned, after some considerable effort, that only 21 people had voted for it. Does this kind of institutionalised attack upon a spokesperson lack democratic legitimacy? A subsequent attempt to put this motion to our national party conference this October has been deemed out of order due to insufficient supporting signatories. Siân, I see inconsistency between your attitude towards me in a recent election – where I was also a candidate (following an STV ballot), helping you and others to get elected – and your position on my candidacy now. Personal note to Shahrar from Siân 2021 This inconsistency is not something I have had to face only now. In 2019, you sponsored a complaint against me on behalf of the Campaign Against Antisemitism, alleging antisemitism. Following investigation, this complaint was dismissed in all respects . Rumours have been circulating about your role and I have decided to confirm it – I think members have a right to know. I have never received any kind of acknowledgment from you about the considerable stress that put me under. I also won a significant IPSO ruling against the Jewish Chronicle in Oct 2020 on five counts. I have a motion again going to next Party conference advocating for our adoption of the Jerusalem Declaration instead of the IHRA – because I want us to fight racism in all its invidious forms, including anti-Jewish racism, and believe we must adopt a definition fit for purpose not counterproductive on its own terms. Fostering Active Debate In basing my leadership campaign on the three crucial issues of climate emergency, women's rights, and free speech, I am confident that all of us in the Party are united in caring about these issues. In expressing my support for women's rights, I am in no way minimising the importance of LGBTQI+ rights. I am convinced that the way forward within the Party – and indeed in wider society – lies in mutually respectful dialogue to ensure that everyone's concerns are heard and taken into account. Nor am I going to sit on my hands when I see bad decisions being taken or thought justified as if they were truly Green. I cannot condone the hostile environment which former MSP Andy Wightman had to suffer when he wanted to vote for an amendment in the Scottish Parliament, which would have protected the right of rape victims to choose to be examined by someone of the same sex (his salutary tale ). I believe the funding of women’s refuge Rise in Brighton, which was providing a vital same-sex service, was something we should have done more to support. I cannot remain mute while brilliant women campaigners in our party have felt compelled to leave because they cannot discuss their sincerely held convictions about the threat to same- or single-sex spaces or services. Unfortunately, there have been communication problems within the Party that have resulted in many people feeling that their concerns are not being taken seriously. I want to encourage a culture of openness and mutual respect so that these matters, which naturally elicit strong feelings in people, can be debated in a compassionate manner. Kindness is sometimes overlooked in the heat of the moment, especially in the heat of exchanges on social media. I hope that, if elected, I can help to facilitate our all working together in the Party to find the way forward on these complex issues. I end with a personal plea. Firstly, please respect the integrity of the Leadership elections (in your current role) and recognise that members may reasonably disagree about whom is best placed to lead the Party over the next few years. Secondly, why not come to me directly to discuss any concerns you might have about statements I have made or motions I’ve put to conference? Here we are engaging in lively discussion in 2016 – it can happen! Why don’t we ask someone we both trust in the party to facilitate such a discussion – a genuine invitation for dialogue? Shahrar on campaign trail with Siân and Caroline Russell, 2016 Only by tackling these communication problems we can move forward together in our united determination to face the environmental crisis that threatens us all. The Green Party has a great contribution to make: we have to find the way to resolve our differences and pull together. With best wishes, Shahrar Promoted and Produced by Amelie Boleyn on behalf of Shahrar Ali as part of his campaign for election to the post of Leader. Not an official communication of the Green Party and England and Wales. Postscript: I am going to include some apologies I have received from members in recent years (anonymised), to highlight where I think the opposite culture leads or has led us (cancel culture). Apologies must be authentic, as I believe these were, wholly unsolicited. Party Member 1 - 2019 “I failed to intervene when there were attendees who were clearly out of line. I should have taken the time to challenge their tone and encouraged them to be more constructive or else desist. It was a hostile unacceptable environment. I apologise too that it’s taken one of those people to do the same thing to me, for me to realise I should apologise.” Party Member 2 - 2018 “I would like to apologise for my conduct during the last few weeks. I have reflected on my online behaviour and I have realised that I have been unreasonably negative and critical of you. I am sorry for this approach and my actions. I still feel very strongly about this issue, but I acknowledge that this was the wrong way to approach the issue and I continued to berate you online after you had given an answer to my enquiry. For that, I am sorry and I am particularly sorry if this caused you any unnecessary stress. I wish you good will in your continued efforts in this campaign.” ENDS. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "http_electshahrar_co_uk_shahrar_ali_on_lgbtiq_pledges": "Shahrar Ali on LGBTIQ+ Pledges — Back Reality #ElectShahrar #ElectShahrar Shahrar Ali on LGBTIQ+ Pledges SHAHRAR ALI RESPONDS TO LGBTIQA+ GREENS PLEDGE REQUEST 2021 Keira Bell, 23, who was prescribed puberty blockers at age 16 and later chose to detransition, speaks outside the High Court in London, Britain, on December 1, 2020. Available as pdf here . Shahrar Ali responds to the LGBTIQA+ Greens pledge request to leadership candidates. I have chosen to elaborate upon my answers as I believe that Yes/No answers offer limited insight into, or fail to do justice to, often-complex matters. I look forward to having the opportunity to discuss our party positions further at hustings. LGBTIQA+ Greens have asked me to commit to: 1. Campaign with the LGBTIQA+ Greens to protect all LGBTIQA+ communities I am committed to supporting all these communities, including the lesbian and gay communities who are experiencing particular difficulties at this time. However, I do not always see eye-to-eye with LGBTIQA+ Greens’ political statements, especially where I feel party policy would say otherwise or is yet to be democratically approved or established, and so of course will reserve the right not to proactively campaign on matters where reasonable disagreement may occur or persist on what we should be saying. 2. Promise to recognise non-binary identities are valid and promise to ensure they are recognised in internal processes and in wider society. Before making such a promise, I would welcome a conversation in which we could define our terms and clarify the meaning of this pledge. I was struck by the failure of a trustee of Stonewall, in a recent radio interview, to be able or willing to define “genderqueer” in response to a straight question about a primary school teaching material that was proving controversial.  It is not obvious to me that everybody has a gender identity either; many do not even think in those terms, and nor should they be compelled to do so, at least with respect to themselves. The Census 2021 also distinguished between the sex question (compulsory) and the gender identity question (voluntary) and the ONS had to reissue guidance following a successful High Court challenge brought by Fair Play for Women. 3. Support a ban on so-called 'conversion therapy', including that affecting trans and ace* people with no exemptions. Of course, I deplore so-called conversion therapies of all kinds. I would like to promote a society that encourages individuals to embrace their sex and sexual orientation. In a society where children are exposed to so much safeguarding danger, on-line and off, we should all be campaigning for improvements to the quality (and quality control) of age-appropriate teaching materials in schools, with a particular focus on mutually respectful, consenting and loving relationships. (PS. would appreciate explanation of your use of the asterisk in “ace*”.) 4. Support increased LGBTIQA+ representation at all levels of government Yes, I am keen to support the representation of all under-represented groups at all levels of government. However, I do think better legislation needs to be drafted, for example, around the appropriate threshold for opening up all-women shortlists to transgender women, including the difference between legal sex and self-identification as an eligibility criterion. The Sex Discrimination Election Candidates Act 2002, subsequently extended to 2030, refers to reducing inequality between men and women and so its original purpose seems clear. Dedicated legislation for other under-represented groups may be a better way forward and prove less divisive (see Labour’s testy implementation of these shortlists of late). 5. Support gender-affirming healthcare for Trans youth Gender-affirming healthcare is *not* Green Party policy as such and arguably some current medical practices framed by this approach are contrary to our pre-existing policy, especially practices in the private sector. In particular, I am very concerned about the medical treatment of children who may be questioning their gender identity, or simply be confused about it following unsupervised membership of online forums (e.g. when does change in personality, which may be short-lived, become identity?). I would like to see greater access to counselling and other forms of psychological support for such children. I am opposed to the current trend to prescribe such children drugs that cause irreparable harm, and am even more alarmed by the presence of companies such as Gender GP that have supplied children with such drugs without proper medical supervision or parental consent. I respect the findings of the Keira Bell case, and the current NHS moratorium on puberty blockers, that upheld the principle that generally children cannot be said to have the capacity for informed consent when agreeing to experimental drugs that could lead to further treatment pathways all with irreversible, life-altering effects. We need far better regulation in this area. I recently put an emergency motion to conference in order to have our concerns clearly stated and to affirm the primary duty upon a medical practitioner, first, to do no harm. 6. Call for proper funding for Trans healthcare in the NHS Yes, of course trans people should receive proper healthcare in the NHS. As with all healthcare provision, resources will have to be shared and prioritised according to clinical need and emergency care. Waiting lists must be reduced across the board and this will benefit all patients, including trans patients. 7. Actively support increased LGBTIQA+ inclusion both within and without the party. Yes, and I am happy to say that I have received communications indicating that many lesbian and gay people have been joining the Party because they are confident in my support for their rights, as are many current members. 8. Campaign against medically unnecessary surgeries on Intersex children. Yes, medically unnecessary surgeries on intersex children often betray great ignorance about the condition. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "http_electshahrar_co_uk_late_motion_prohibit_private_clinics_from_exploiting_nhs_moratoria_on_puberty_blockers": "Late Motion: Prohibit Private Clinics from Exploiting NHS Moratoria on Puberty Blockers — Back Reality #ElectShahrar #ElectShahrar Late Motion: Prohibit Private Clinics from Exploiting NHS Moratoria on Puberty Blockers Late Motion to Green Party Spring Conference 2021- also available HERE . Prohibit Private Clinics from Exploiting NHS Moratoria on the Prescription of Puberty Blockers: Treatment for Gender Dysphoria in Children and Under-18s following the Bell vs Tavistock Ruling and Jan 2021 release of Whistle-blowers’ Evidence Synopsis For the safety and well-being of children and young people under 18 with gender dysphoria, the Green Party would prohibit private clinics from exploiting NHS moratoria on the prescription of puberty blockers, measures justified following the GIDS judicial review of Dec 2020, and would stop their associated fundraising campaigns launched since Jan 2021. Motion The Green Party recognises the distress caused to people under 18, and their families, from having to suffer long waits for access to advice and treatment for gender dysphoria from the NHS Gender Identity Development Service. Uncertainty over access to puberty blocker treatments has increased, or their prescription has been prohibited, following acknowledgment by the NHS of the following key findings from the High Court judgment in Bell vs Tavistock [ link ]: Administering puberty blockers as a treatment for diagnosed gender dysphoria is properly described as \"experimental\" due to uncertainty over the short and long-term consequences for the patient, limited evidence as to efficacy and lack of clarity over purpose. In nearly all cases, initiating treatment with puberty blockers has led to cross-sex hormones as the treatment pathway, with potentially lifelong and life-changing consequences for the patient, such as loss of fertility and impact on sexual function and future relationships. Depending on age group, informed consent will either be impossible (age 10), highly unlikely (under 16), or should be supplemented by referral to a court acting in their protective role (ages 16 and 17). For children just entering puberty, some as young as 10, it will not be possible for them to understand what not being able to give birth to children could mean in adult life; or loss of fertility or full sexual function in later years. On medical professional, safety and ethical grounds, the Green Party would: Provide extra mental health and well-being support services for children, young people and their families impacted by the withdrawal of GIDS treatment options following the Bell vs Tavistock ruling into the harms associated with puberty blockers and irreconcilability of informed consent at that age. Prohibit private clinics from advertising or administering puberty blockers as a treatment for children diagnosed with gender dysphoria, when the NHS has already refused or recommended against such treatment. Prohibit the practice, which whistle-blowers have raised the alarm about in Jan 2021, of asking minors to choose sperm donors for their eggs – as a means to insure against their subsequent infertility because of PB treatment. Asking a child to choose the genetic father (say) for their future potential child, and creating and storing their embryos, poses a host of highly problematic ethical issues, not least of all age-appropriateness and safeguarding. Conference calls upon GPEX, the Green Party campaigns team and elected Green Party representatives to publicise this policy statement in any and all future work in this area. Additional Resources Relevant passages around key themes from our Policies for a Sustainable Society: On health practitioners as whistle-blowers: “The health service should be managed as a “learning organisation” in which there is a clear responsibility for continual improvement and in which all staff are encouraged to comment on the systems in which they work and share learning in an open and fearless way.” HE208 On avoidance of unaccountable, private healthcare: “Healthcare is not a commodity to be bought or sold. It must be a public service funded by, run by and accountable to local and national government and devoid of all privatisation,” HE104 On emphasis on mental health provision for children and adolescents: “We recognise the importance of child and adolescent mental health and will ensure that services to support this are properly funded and accessible close to the people who need them.” HE1001 On the principle of protecting children from medical interventions they are not old enough to decide: “The Green Party would seek to protect intersex minors from medical interventions that could be delayed until they are old enough to decide for themselves.” RR521 Key links to resources Bell and A vs Tavistock and Portman NHS Foundation Trust, 1 Dec 2020 https://www.judiciary.uk/wp-content/uploads/2020/12/Bell-v-Tavistock-Judgment.pdf NHS Amendments to Service Specification for Gender Identity Development Service for Children and Adolescents (E13/S(HSS)/e), 1 Dec 2020 https://www.england.nhs.uk/wp-content/uploads/2020/12/Amendment-to-Gender-Identity-Development-Service-Specification-for-Children-and-Adolescents.pdf Autistic girls seeking answers ‘are seizing on sex change’, Times, 9 Jan 2021 https://www.thetimes.co.uk/article/autistic-girls-seeking-answers-are-seizing-on-sex-change-3r82850gw How to launch a successful crowdfunder for trans youth healthcare, 21 Jan 2021 https://www.gendergp.com/trans-kids-healthcare-crowdfunder-tips-puberty-blockers-gofundme/ Children have been very seriously damaged’ by NHS gender clinic, says former Tavistock staff governor, Channel 4, 23 Jan 2021 https://www.channel4.com/news/children-have-been-very-seriously-damaged-by-nhs-gender-clinic-says-former-tavistock-staff-governor GREEN PARTY MEMBERS: To countersign this Late Motion for Spring Conference 2021 please visit https://spaces.greenparty.org.uk/s/late-motions-forum-spring-2021/ and “Like” the motion by 2359 on Mon 8 Feb 2021. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "https_electshahrar_co_uk_home": "#ElectShahrar — Back Reality #ElectShahrar #ElectShahrar Overview Campaigns Media Performance Testimonials Overview Worthy of Respect in a Political Party SCROLL DOWN Overview Worthy of Respect in a Political Party For Legal case Ali vs GPEW: Worthy of Respect in a Political Party 10 Sept 2022: Interview with Julie Bindel 10 July 2022: Free Speech Nation interview with Andrew Doyle . 27 Feb 2022: Free Speech Nation interview with Andrew Doyle . 19 Feb 2022 : The Telegraph Green Party spokesman sues after being sacked for transgender views Recent articles: Challenging GPEW Deputy Leader Election 2022: Institutionalised Smear Campaigns, Rule Breaches & Hostile Environment for Gender Critical candidate Gender-Affirmative Healthcare, Actual Green Party Policy and Cass SHAHRAR ALI ENTERS GREEN PARTY LONDON ASSEMBLY SELECTION WITH STRONGER TOGETHER “We need to back reality – for the sake of the planet, for the sake of human rights and for the sake of how we do politics.” Back Climate Reality “I’ve been political for as long as I can remember. As a child, when I’ve asked my parents why people in faraway lands fought with one another it must have been out of incredulity that a planet, which bore such riches, could be cause for any kind of disharmony. Why didn’t people just get on? Though older and wiser about widespread inequality, this question still bugs me today – whether in awe of the mechanics of our planetary ecosystem or fascinated by human nature and motivation. “I’m standing through necessity. We are the last generation able to save the planet from ourselves. Despite decades of knowing that we were living unsustainably, we carry on trying to have our cake and eat it – with a return to post-Covid short-haul flights and overconsumption. Millennia of technological advancement and unabated pursuit of desires have led to our standing on the edge of an abyss – collectively responsible for countless species extinctions, ecological devastation and now the prospect of universal death. “After my active involvement for nearly two decades, I don’t think we have achieved enough. Yes, we’ve enjoyed record local election results, but with environmental consciousness and extreme weather calamities at an all-time high, we should be polling double-digit figures nationally. Back Debating Reality “When I joined, in 2002, Green Party conference felt like a university of ideas – where we could debate one another in good faith and still indulge in a round of drinks and laugh together. Today, we have become fractious and risk losing our sense of collective purpose (and humour). “This conflict is evident in discussion of provision of services for transgender people and those who feel impacted by changes to services provided on same-sex lines, especially women. We must return to a culture of open debate, where the taking of offence is not used as a means to prevent those who do wish to debate from doing so. “Party unity will not come from wishfully brushing problems under the carpet, or sitting on the fence while bullies continue their lies and intimidation, but from tackling challenges head on – and having those difficult conversations. “You need a leader not afraid to question, and to actively take a stand against, the abuse directed upon women – many of whom have been driven to resign from parties and others of whom are resisting from within. I will not stand by as a feminist speaker is debarred from giving a talk at a public library by the Council itself. I do understand that a rape victim has the right to choose to be examined by a clinician of her sex as a matter of basic human dignity. “I will defend and champion all the protected characteristics enshrined in the Equality Act 2010. This includes the sex-based rights of women and girls, some 52% of the population; a population we can see being persecuted in Afghanistan today. “We must welcome women back to our party, many of whom are feeling politically homeless. No campaign for mass social and political transformation has ever succeeded without women. There will be no human rights for all if we do not succeed in averting universal death from the climate crisis we face. “We need to back reality – for the sake of the planet, for the sake of human rights and for the sake of how we do politics.” Who is Shahrar Ali? Worked in European Parliament 1999 Published 'Why Vote Green?' 2010 & 2015 First BME Deputy of a UK Parliamentary party 2014 Home Affairs/Policing & Domestic Safety Spokesperson 2017 - Feb 2022 Shahrar Ali was elected Deputy Leader of the Green Party in 2014, becoming in the process the first BME deputy of a UK parliamentary party . He entered green politics after working as a researcher in the European Parliament on the risk of GM foods. He has a PhD in philosophy, in which he tackled the morality of lying and deception. Shahrar edited Why Vote Green 2015, an impassioned call for environmental action in the 21st century. “ Principle without power benefits no one. Power without principle is not worth having. ” — Shahrar Ali Shahrar Ali combines outstanding commitment to the well-being of the party with an impassioned call to Green voters everywhere. Campaigns Back Climate Reality Campaigns Back Climate Reality A veteran grassroots campaigner, Shahrar has been fighting campaigns with the Green Party since joining in 2002. Climate Justice Matters Following an interview with the Guardian in which he described his number one priority for the Party as the Climate and Ecological Emergency, Shahrar Ali said: “Time is running out for the human race to overcome climate change catastrophe. As Green Party Leader, I will articulate our bold vision for social, economic and environmental transformation. We must begin now a radical plan of investment in renewable technology and decarbonisation of every aspect of our lives.” “Whichever recent measure you use, they are the hottest on record: the last ten years, the last five years or the last twelve months. Climate impacts are being felt now, today, through drought and disease. The consequences fall heavily on those least responsible for creating the problem.” “I will help deliver the change that’s required, with the urgency and coherence that’s needed. The government offers up state capitalism as the new normal. Greens will offer Universal Basic Income and Green jobs for the millions that are about to become unemployed.  We need to change what’s politically possible to deliver what’s scientifically necessary.” Join our Campaign Media Performance Accomplished Media Performer Media Performance Accomplished Media Performer Shahrar in the Media An accomplished media performer and stirring public speaker, Shahrar is known for his ability to deliver in the public eye. Don't take our word for it, take a look at some of the videos below to experience his speaking first hand: Shahrar Ali Clashes with Amelia Womack Live on LBC Green Party Leadership Debate. 2 Sept 2021 Shahrar Ali  was interviewed on BBC Daily Politics & Sunday Politics today where he spoke about the EU and solidarity - and the strong green case for voting remain. Deputy Leader Shahrar Ali speaks at the Green Party's Spring Conference, 2016 A serious issue, a not-so serious interview: Shahrar Ali, our Home Affairs Spokesperson on BBC Two's Mash Report to discuss policing with Andrew Hunter Murray. On BBC general election debate 2015, Deputy leader Shahrar Ali takes on the big guns, including Sadiq Khan, on the political issues facing our country, whether the housing crisis or the economic crisis. Deputy Leader of the Green Party, Shahrar Ali, joined a panel debate on BBC South East Today to talk about the crisis in Calais and the humane response we should be taking. Other Links: GUARDIAN ARTICLE AND INTERVIEW 17 Aug 2021: SHAHRAR ALI tells the Guardian why free speech and mature debate is more important to politics than ever, ‘ Green frontbencher at centre of trans rights row to run for leadership ’ Responses to Member Climate Change questions here ; Jewish Greens Survey here . LBC Green Party Leadership Debate, 2 Sept 2021 - far-ranging debate available in full here (clip above) Statement on Commitment to Animal Welfare and Animal Well-being. MORNING STAR ARTICLE AND INTERVIEW 21 Aug 2021: Climate Emergency, Women’s Rights and Free Speech, Why I want to Lead the Green Party INTERVIEW 24 July 2020: SHAHRAR ALI tells the Star why he's pitching himself as the ‘radical’ candidate in the Green Party leadership race, ‘ We are an eco-socialist party and we shouldn't shy away from that ’ NEWS 24 July 2020: ‘Disastrous’ alliance with Lib Dems cost the Greens its ‘credibility,’ leadership candidate says GUARDIAN PODCAST: Guardian Politics interview , from 27.30 mark VIDEO: \"Animal Sentience\": Shahrar Ali on BBC Daily Politics https://www.bbc.co.uk/programm es/p05p2x7z PODCAST: \"Moral Maze\": Shahrar Ali (from 19'44\" to 28'24\") https://www.bbc.co.uk/programmes/b08g7mjy Testimonials supporters Testimonials supporters Supporters In 2014, Greens successfully backed Shahrar Ali for Deputy Leader, a term which he served during a time of tremendous expansion for the party. Browse the slideshow to see why Greens want to elect Shahrar for Leader in 2020. Top Promoted and Produced by Shahrar Ali. Not an official communication of Green Party and England and Wales.",
  "https_electshahrar_co_uk": "Shahrar Ali - Bring Power to Truth Worthy of Respect in A Political Party #BackReality Enter Website Join Our Campaign"
}