{
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_raising-expansion-beddington-incinerator-parliament/content_46.html": "This week was a bumper week for being able to speak in the Chamber itself.\nIn fact, I was incredibly lucky to have two questions drawn to be answered by the Department for Energy Security and Net Zero.\nI wanted to use the opportunity to raise the issue of the Beddington Incinerator and especially the consultation that's just closed on expanding the amount of waste that's allowed to be burnt at the site.\nI find it highly suspect, and indeed questionable, for the Environment Agency to have stated that they were minded to approve the application - before the consultation had even closed!\nThat's despite the incinerator originally being designed to treat up to 302,500 tonnes of waste, with this application allowing it to take up to 382,000 tonnes per annum. That's a 26% increase in waste!\nI stand with the countless residents who have raised concerns about the incinerator, and its impact on the local community. I have done since the original plans were announced, and I will continue to.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_category_Opinions/content_41.html": "Remembering Sir David Amess 16th October 2021 Waking up this morning and remembering the tragic events of yesterday has left us all feeling very sad indeed. I wanted to put some words down of my memory of... Opinions\nElliot's Pride Message 2020 2nd June 2020 June is Pride month, but Pride will look very differently for those celebrating this year. Opinions\nElliot's Easter Message 12th April 2020 Easter Sunday will look very different to many people in Carshalton and Wallington this year. Opinions",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_introducing-my-bill-protect-dogs-and-puppies-horrors-smuggling/content_33.html": "Last week, I was grateful to be able to present my bill to properly close the loopholes used by puppy smugglers and those illicitly importing dogs, including those with illegally docked tails and cropped ears.\nI'm incredibly thankful for the work done by the Dogs Trust in shining a light on these illegal practices and what needs to be done to ensure they are stopped once and for all.\nWe're a nation of dog lovers - and they've been our steadfast companions for thousands of years.\nNow, this is our chance to repay that companionship and assistance by protecting them.\nAnd that’s what this bill does - by setting out to right the wrongs currently being perpetrated, to close the loopholes smugglers continue to exploit, and to strengthen the existing laws and legislation.\nWatch my full speech introducing the bill on this page!",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_debating-sutton-councils-send-failings/content_49.html": "I was grateful for the opportunity to lead on a Westminster Hall debate to raise the fight that too many children in our area face in getting access to special educational support due to Sutton Council's failings. I welcome the Minister's response and look forward to working with him and his department to ensure that ALL children across Carshalton and Wallington get a good education.\nYou can watch the full exchange, including my speech and the Minister's follow-up above.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk/content_1.html": "About Me Map Latest News Contact Me Is Elliot your candidate? Enter your postcode to confirm that Elliot Colburn is your candidate. Postcode",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_local-bank-branches-will-remain-open/content_18.html": "Following the recent closure of our local bank branch for Barclays in Woodcote Road, I recently wrote to TSB, Santander, NatWest, Nationwide, HSBC to ensure that our local branches for these banks, plan to stay open. I am extremely glad to say that all our local branches for these five banks are staying open with no plans to close.\nAs your local MP for Carshalton and Wallington, one of my six main plans is to keep our thriving economy bustling by supporting our local businesses and helping our high streets. This is significantly important to ensure that Carshalton and Wallington continues to be a desirable place to live, work and raise a family.\nThe Covid 19 pandemic has had enormous impacts in the UK, especially to our local high streets, and I will fight where I can to help our businesses bounce back.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_questioning-minister-afghan-relocation-numbers/content_51.html": "I know many residents throughout Carshalton and Wallington have been involved in the Afghan relocation scheme - just as they have with the Homes for Ukraine programme, a testament to our community's spirit and pride - so I wanted to use the opportunity to raise this directly with the Minister at today's Defence Questions.\nAlongside noting my personal thanks to the MoD team heading up the relocation programme, I was also able to ask the Minister for updated figures as to just how many people have been resettled as part of the programme since the beginning of Operation Pitting.\nYou can watch my full question, and the Minister's answer, in the video above.\nLikewise, if you are currently facing issues with the Afghan resettlement scheme, or with Homes for Ukraine, please do get in touch with my team and I, to see if we can help in anyway. You can email the office at [email protected].",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_meeting-nationwide-discuss-their-banking-plans-going-forward/content_44.html": "I appreciated the opportunity to meet and chat with the Nationwide Building Society team at their recent event in Parliament.\nOur local Nationwide branches have helped to support countless members and causes and continue to keep our high streets alive, so I was pleased to celebrate that success in Parliament. As part of this work and support for our high streets, I'd especially like to welcome their commitment to no branch closures in the UK until at least 2026.\nWhat's more, I will continue to work with our local building societies and banks, as well as in Parliament, to ensure that people have access to their money as and when they need it.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_together-we-all-stand-solidarity-ukraine/content_37.html": "Today is Ukrainian Independence Day - I was proud to join Ukrainian refugees and those who have welcomed them to Britain at an event in Parliament before Recess to underline our unwavering commitment to Ukraine and its people and to stand in solidarity with Ukraine.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_condition-improvement-funds-our-local-schools/content_15.html": "It is fantastic to hear the following schools will be given Condition Improvement Funds! These funds are a part of the Department for Education's priority in keeping education providers' buildings safe and in good working order. This includes funding projects that address health and safety issues, building compliance and buildings in poor condition.\nThe successful schools are:\n- Wallington High School for Girls\n- Carshalton High School for Girls\n- Wallington County Grammer School\n- Carshalton Boys Sports College\n- Wandle Valley Academy\n- Abbey Primary School\nIf any schools have enquiries, they can enquire via the Education and Skills Funding Agency customer help portal: https://customerhelpportal.education.gov.uk/",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_raising-cost-living-payments/content_54.html": "Earlier today, I got to raise the 11,600 local residents who will soon be receiving a cost of living payment, with Rt Hon Thérèse Coffey MP, the Secretary of State for Work and Pensions. The payment is part of a wide-ranging package of support that was announced earlier this year to help families and the most vulnerable in society as we face rising bills and costs due to global cost of living issues. As part of this, I especially welcomed the fact that many of the payments being made will be to working households.\nAs my second question to the Secretary of State underlined, there is still work to be done to ensure more local people are able to find fulfilling, well-paying jobs. It's because of this, and as we continue to work to to get people into those jobs, that I'd like to thank all of those involved in the effort - from our Job Centre teams, the vocational skills trainers, charities and organisation. The foundations are strong, and together we can ensure a truly holistic approach to not just getting people into work but ensuring they stay in those jobs.\nYou can watch my whole question - and the response - above.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_neighbourhood-fund-2024/content_35.html": "The Neighbourhood Fund 2024 project submission window is now open!\nThis is a great opportunity to choose where you want to see money invested in our local area. This year there is a focus to fund projects which help with the following:\n- Environmental Improvements & Tackling Climate Change\n- Inclusivity, Health & Wellbeing\n- Local Community Improvements\nYou can find more information on the Neighbourhood Fund 2024 here.\nIf there is a project you are wanting to submit, you can do so here.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_talking-sme-support-parliament/content_27.html": "We're incredibly lucky to have a community powered by innovative business owners - especially those with small and medium-sized businesses.\nThat's where we find the big thinkers with passion and skill to turn something like an interest or a hobby into a business. They keep our high streets and town centres going and employ local people.\nSo, it was incredibly interesting to stop by a parliamentary drop-in with SMEs last week to discuss what sort of support they need and how existing assistance can help.\nThere's no denying that recent times have been incredibly tough on businesses, especially SMEs. Whilst the Government support has indeed been welcomed, there is still more to do. Something that I'm acutely aware of getting to speak to so many business owners in and around Carshalton and Wallington.\nI will continue to work with them on a local level to ensure they can explore and access the support available, as well as working with the Government to open up new levels and branches of support and the ability to do business as smoothly and efficiently as possible.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_statement-dominic-cummings/content_52.html": "First of all, I want to sincerely thank the residents of Carshalton and Wallington for their efforts in tackling this virus. Not only have people been largely compliant with the lockdown measures, but there has also been an incredible take up of volunteers that I have met each week as we go out to deliver food, medicine and PPE to vulnerable people and organisations.\nI fully appreciate that this has also been extremely difficult for people to be kept away from their friends, family and loved ones. We have missed the happiest of occasions such as birthdays, holidays, weddings and more. I, like many others, have had to cancel my own wedding, as well as be apart from my friends and family.\nHowever, we have also been unable to come together in times of grief. I especially want to highlight the heartbreaking stories I have heard of people being unable to say goodbye to their loved ones at the end of their life.\nRegarding Mr Cummings, I have taken stock of yesterday’s news conference and the emails I have received from constituents and have come to the following view.\nAs I said on social media yesterday morning, I had already conveyed the strength of feeling from local residents to relevant colleagues. I know I am not the only one to have done so.\nI sent the attached letter to the Prime Minister on Sunday evening as I started receiving hundreds of emails about this issue, asking that he invite Mr Cummings to consider his position. You will appreciate that I wanted to give the Prime Minister the courtesy of receiving that letter first of all.\nSince sending that letter, more information has come to light, particularly during the press conferences yesterday afternoon.\nI have to say, that I do not believe in trial by the media, threats or abusive behaviour, and will not condone any such treatment that has been received Mr Cummings, his family or indeed anyone else.\nNevertheless, after listening to that conference and listening to local constituents, it is clear that many feel his decision is not one that they would have come to, or have open to them in similar circumstances. I myself do not believe I would have come to such a decision, although I confess that neither myself nor my husband-to-be have children yet.\nWhat is more, I am deeply concerned about what this could do to the public’s engagement with the measures being taken to tackle this virus. As we start to relax some of the lockdown measures, we must continue to stay alert in order to prevent a second wave of this virus. I fear this situation risks undermining those efforts, just when we are seeing a significant reduction in the number of tragic lives this virus has claimed.\nIt is for these reasons, that I have written to the Prime Minister again today to express my view that Mr Cummings should resign.\nI will now be returning to the efforts I have been putting locally to tackle this virus, continuing to volunteer when needed, recognising our Unsung Heroes as well as our front line key workers, and ensuring the hundreds of people that have come to me looking for direction to the right help and support to see them through this virus get that assistance.\nAs ever, if you or anyone you know needs anything at all, please feel free to contact me.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_labour-votes-remove-winter-fuel-payments-pensioners/content_38.html": "The Labour Government is cutting Winter Fuel Payments for roughly 12,500 pensioners in Carshalton and Wallington.\nThat cut will cost pensioners up to £300 a year. It will impact pensioners earning as little as £13,000 a year.\nLabour is doing this just as they spend billions on an energy company which won’t produce any energy.\nAnd billions more on pay hikes for their allies in the trade union movement.\nLabour didn't want our MPs to debate this. But we forced a debate in Parliament and, shamefully, they voted to scrap it.\nI’ve signed this petition which urges Labour to keep the Winter Fuel Allowance. If you agree with me then please sign it here and share it with a friend or family member.\nWorking together I know we can force Labour to rethink this cruel policy and honour commitments we’ve made to our nation’s elderly\nIf you are on pension credit you are still eligible for Winter Fuel Payments. Find out if you’re still eligible for help at www.gov.uk/pension-credit/how-to-claim.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_st-helier-betrayed-labour-and-lib-dems/content_23.html": "What a depressing day for our local hospital.\nDuring the campaign I said the NHS plans to improve St Helier and build a second local hospital were under threat from Labour and the Lib Dems - and today that threat’s been confirmed.\nThe new Labour Government today announced (alongside scrapping winter fuel payments for millions of pensioners) a review with the potential for SCRAPPING new hospital plans like those for St Helier.\nAs for the Lib Dems, they’ve let them get away it - they have been very open that they oppose the local NHS plan to improve St Helier and build a second hospital. Shameful.\nLocal NHS staff have put so much work into this plan, getting it to the point that it could apply for planning permission and get building.\nToday, Labour and the Lib Dems have sent them back to square one.\nI won’t stop fighting for St Helier and I invite residents to help me. More details to come.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_marking-fifty-years-pride/content_11.html": "It was a real personal honour to be able to speak in the recent House of Commons debate marking five decades since the first London #Pride march.\nThe anniversary was a chance to reflect on how far we've come - indeed, we've made some huge strides towards greater equality - but it was also an opportunity to reflect on the change that is still to come.\nYou can watch my full remarks in the video above.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_about-elliot/content_4.html": "I was proud to serve as the Member of Parliament for Carshalton and Wallington between 2019 and 2024.\nDuring my time as your MP, together; we secured investment for St Helier Hospital and a second hospital in Sutton, financial support during Covid and the global energy price rises, delivered improvements in local public transport such as doubling the number of SL7 buses and making the platform at Hackbridge Station safer, stood up to say no to the expansion of the Lib Dem-backed Beddington incinerator and much more.\nNow all of this progress is under threat from Labour and the Lib Dems.\nThat's why I believe we need to see Conservatives elected here again.\nI'm a life-long local resident, I was born at St Helier Hospital, I went to school at Carshalton Boys and I worked for our local NHS. I really get the issues that matter most to you and your family - because they're the issues that affect me and my family too.\nI know how much we all value our NHS services locally. Every day when I'm out and about I hear how much people care about our NHS and I've seen first hand how much of a difference it makes to our lives. That's why I'm passionate about ensuring we deliver the very best health and care outcomes for Carshalton and Wallington residents and making sure that we protect our St Helier Hospital.\nI've also been a local councillor, where I worked hard to hold the failing Lib Dem-run Council to account. It wasn't an easy job, and I spent most of my time tackling road safety, parking and bin collections. We deserve better. We did then, and we still do.\nI'm a keen supporter of charitable causes locally, too, having served as a trustee of Community Action Sutton, and as a Scout Leader for the 6th Carshalton Scout Group. After leaving Parliament, I am proud to have joined the incredible team at Samaritans to continue my work on suicide prevention.\nI am so proud to have be your strong, local voice in Parliament, standing up for the issues that matter most to you, such as delivering improvements at St Helier Hospital, holding the Council to account, delivering better public transport, more good school places and protecting our local environment.\nNow we have a Labour Government, a Lib Dem Council and Lib Dem MPs, we are once again seeing our community continually let down. We can't trust them to stand up for our community.\nBut you can trust me.\nI've proven I can deliver for this community and my promise to you is that, whether I am the MP or not at the moment, you can count on me.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_westminster-hall-debate-tackling-crash-cash-scams/content_36.html": "Today (22/05/2024) I hosted a Westminster Hall debate to raise the issue of 'Crash for Cash' scams taking place in Carshalton in Wallington, but also across the rest of the UK.\nThere are three principal types of crash for cash scams:\n1. Induced accidents which involve fraudsters targeting an innocent motorist to be the \"at fault driver\" often by suddenly breaking to ensure the car behind crashes into them.\n2. Staged accidents which involve fraudsters crashing their own vehicles or mimicking damage from genuine crashes using tools like sledgehammers.\n3. Fabricated accidents involve fraudsters submitting false claims for accidents that never occured.\nI have heard awful stories from how these crash for cash scams are affecting many of my constituents. It is vital that awareness is raised of this issue and motorists have the knowledge to protect themselves which the Police and Government work together to put this issue to bed.\nSome important tips are:\n- Maintain a sade distance from other vehicles, ensuring you can break in good time.\n- Following the Highway Code and look ahead for potential hazards, including unusual driving behaviour.\n- Notice if the other driver is too calm, has pre-written insurance details, or if their injuries seem exaggerated.\n- If involved in a suspected crash for cash incident, gather as much information as possible, including written details, photos, dashcam footgae, and noting any nearby CCTV.\n- Report the incident to your insurer, the local police and IFB's Cheatline.\nBy staying vigilant and informed, we can protect ourselves and help combat the scourge of crash for cash scams.\nResponding to the debate, the Minister for Security, Rt Hon Tom Tugendhat MP, highlighted a number of points. He was clear that while there is still a lot that we must do with moped-enabled crash-for-cash schemes on the rise, and I am pleased that he confirmed this was a matter of huge importance to the Government.\nHe reiterated several areas where the Government has already taken steps to help with both Cash for Crash scheme, but also fraud more broadly, such as:\n- 400 new officers for the National Fraud Squad – thanks to their efforts and the City of London police, fraud is down 16% year on year, building on 13% last year – showing we are moving in the right direction on fraud more generally.\n- Work is taking place across all 43 police forces of England and Wales to support more victims from Action Fraud, as part of the Governments Fraud strategy.\n- Working with the Government’s Fraud Champion to ensure that all work in the area comes together, including working with not just the police, but solicitors, regulatory authorities, the insurance industry and the various other organisations with oversight of the area.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_work-experience/content_7.html": "I offer work experience opportunities to students from the constituency. The placement gives young people an insight in to local politics and a chance to boost their skills. Students will be able to help with a number of tasks:\n- Casework, depending on the age and ability of the student\n- Researching an issue\n- Taking press-cuttings\n- Writing press releases\n- Accompanying the MP to a meeting or event in the House or in the Constituency\n- Assisting with office duties\n- Answering queries from constituents, either by 'phone or by email\nPlease contact us to enquire about work experience in my office.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_category_Articles/content_40.html": "Freedom to Donate 14th June 2020 Today is World Blood Donor Day, an opportunity to raise awareness of the importance of blood donations to save lives, and to thank all those who voluntarily... Articles\nStatement on Dominic Cummings 26th May 2020 First of all, I want to sincerely thank the residents of Carshalton and Wallington for their efforts in tackling this virus. Not only have people been largely... Articles",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_launching-hepatitis-day-reception/content_9.html": "It was great to join the Hepatitis C Trust earlier today to help them launch their World Hepatitis Day reception right in the heart of Parliament.\nAs I noted in my speech opening the event, we’ve come a long way in the battle for Hepatitis C elimination. This is something that should be celebrated, and indeed the progress that’s been made featured front and centre in the event.\nThe session was also useful for the various organisations and individuals involved in the eradication effort to come together, to hear from each other and understand some of the stumbling blocks we’ve encountered and how we can overcome them going forward. I was keen to underline that central to this will be an evidence-based, well-thought out roadmap if it is to remain a key priority for health leaders.\nI was also glad to be able to draw on the newly announced mobile clinic for the Borough of Sutton that will make it easier to bring blood-borne virus screening and liver health checks to more people in our area.\nThose in the battle for Hepatitis C elimination do amazing work, often under the radar, and so I would like to thank them for all that they are doing to avoid more people contracting it.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_raising-passport-and-visa-wait-times/content_45.html": "Over the last few months, my team and I have received a number of messages from constituents expressing frustration - with many at their wits end - over the enormous waiting times currently faced for passport applications and visas.\nOn the back of this, I was very glad to have the opportunity recently to use questions to the Cabinet Office to ask the Ministers what work was being done by the Home Office to improve their systems, increasing efficiency, and speeding applications up.\nYou can watch the question, along with the Minister's response, in the clip above.\nAs always, please remember that my team and I are here to help you, so if you've got concerns or issues, please get in touch at [email protected].",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_category_Westminster-News/content_16.html": "Local knife crime and antisocial behaviour raised in Parliament 8th December 2023 Yesterday evening, I led the Adjournment Debate in the House of Commons on ‘Violent Crime and Antisocial Behaviour in Carshalton and Wallington. Following... Westminster News\nReport on Freedom of Religion or Belief in Pakistan 29th November 2023 It was humbling to attend the launch of the Pakistan Report at the All Party Parliamentary Group (APPG) on Freedom of Religion or Belief today. Westminster News\nMeeting with Nationwide to discuss their banking plans going forward 26th September 2023 I appreciated the opportunity to meet and chat with the Nationwide Building Society team at their recent event in Parliament. Westminster News\nIntroducing my bill to protect dogs and puppies from the horrors of smuggling 25th September 2023 Last week, I was grateful to be able to present my bill to properly close the loopholes used by puppy smugglers and those illicitly importing dogs, including... Westminster News\nRaising the expansion of the Beddington Incinerator in Parliament 25th September 2023 I wanted to use the opportunity of a question in the Commons Chamber to raise the issue of the Beddington Incinerator and especially the consultation that's... Westminster News\nTalking SME support in Parliament 19th September 2023 We're incredibly lucky to have a community powered by innovative business owners - especially those with small and medium-sized businesses. Westminster News\nDiscussing how to level the playing field when it comes to fertility treatment 18th September 2023 It’s becoming clearer that there needs to be more of a level playing field when it com`es to IVF and access to it, with the current status quo featuring too... Westminster News\nDiscussing the importance of boosting organ donor numbers 14th September 2023 I appreciated the chance to meet with Kidney Care UK and NHS Blood and Transplant at their reception in Parliament yesterday, as well as patients and those on... Westminster News\nTogether, we all stand in solidarity with Ukraine 24th August 2023 Marking Ukrainian Independence Day Westminster News",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_campaigns/content_12.html": "Save St Helier Hosptial The new Labour Government announced a review of the New Hospital Programme with the potential for SCRAPPING plans for St Helier and a second hospital in Sutton.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_parliament/content_2.html": "Tweet Here you can see Elliot Colburn's latest speeches and appearances in Parliament (provided by theyworkforyou)\nLaunching the Hepatitis Day Reception Wednesday, 13 July, 2022 Launching the World Hepatitis Day reception in Parliament, reflecting on the progress that's been achieved on eliminating Hepatitis C and how we can work together to go even further.\nMarking Fifty Years of Pride Friday, 1 July, 2022 My remarks marking fifty years since the first London Pride march.\nCrash-for-cash Insurance Fraud - [Yvonne Fovargue in the Chair] | Westminster Hall debates I thank all right hon. and hon. Members for their contributions. This has been a fantastic debate.\nCrash-for-cash Insurance Fraud - [Yvonne Fovargue in the Chair] | Westminster Hall debates I thank all right hon. and hon. Members for their contributions. This has been a fantastic debate.\nCrash-for-cash Insurance Fraud - [Yvonne Fovargue in the Chair] | Westminster Hall debates I beg to move, That this House has considered the matter of tackling crash for cash insurance fraud.\nCrash-for-cash Insurance Fraud - [Yvonne Fovargue in the Chair] | Westminster Hall debates The hon. Gentleman is absolutely right, and I will come on to that point shortly.\nCrash-for-cash Insurance Fraud - [Yvonne Fovargue in the Chair] | Westminster Hall debates I beg to move, That this House has considered the matter of tackling crash for cash insurance fraud.\nCrash-for-cash Insurance Fraud - [Yvonne Fovargue in the Chair] | Westminster Hall debates The hon. Gentleman is absolutely right, and I will come on to that point shortly.\nEngagements | Prime Minister | Commons debates Today’s news on inflation is good news not just for consumers in Carshalton and Wallington but for capital projects, such as the investment\nEngagements | Prime Minister | Commons debates Today’s news on inflation is good news not just for consumers in Carshalton and Wallington but for capital projects, such as the investment\nNew Clause 86 - Creating purported sexual image of adult | Criminal Justice Bill | Commons debates I rise to speak to my new clause 32, which would address the disparity between existing protected characteristics and current hate crime leg\nNew Clause 86 - Creating purported sexual image of adult | Criminal Justice Bill | Commons debates I rise to speak to my new clause 32, which would address the disparity between existing protected characteristics and current hate crime leg",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_thank-you-carshalton-and-wallington-its-been-honour/content_26.html": "I’ve been completely overwhelmed by the kind messages from people, whether they supported me or not. It means the world to me!\nBeing the MP for my hometown has been an enormous privilege. Despite the difficulties, I’ve enjoyed it immensely and am so proud of what we achieved together.\nI wish my successor and the incoming Government every success.\nI’m looking forward to spending more time with my family and catching up on some rest.\nThank you - Carshalton and Wallington - it’s been an honour.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_events_feed/content_43.html": null,
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_get-involved/content_20.html": "I believe that our community deserves better and that's why I am standing to be your local MP again.\nBut to do that, I need your help.\nIf you can spare any time to help my campaign, please fill out this form and we'll be in touch!\nI believe that our community deserves better and that's why I am standing to be your local MP again.\nBut to do that, I need your help.\nIf you can spare any time to help my campaign, please fill out this form and we'll be in touch!",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_moped-crash-scams-wallington/content_34.html": "I've heard from many local residents in Wallington about the moped crash scams happening around Ross Parade and Woodcote Road.\nThis behaviour is completely unacceptable. The moped drivers are deliberately putting themselves in dangerous situations to try and get money from insurance scams.\nIt is so important that if you are to witness this taking place, that you note down as many details as possible so that you can pass them along to the police.\nI am in touch with our local police force for Wallington and we are discussing ways in which we can increase patrols in this area, to prevent this type of thing from happening in the first place.\nOnce again, it is so important that if you witness this happen, you should report it to the police and give your details to the driver so you can also act as their witness in this case.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_contact/content_6.html": "Skip to main content\nMain navigation\nHome\nAbout Elliot\nCampaigns\nNews\nIn Parliament\nContact\nContact\nLeave this field blank\nHow to speak to Elliot\nDonnington House, 2a Sutton Court Road, Sutton, SM1 4SY\n020 8642 3791\n[email protected]\nElliot on Facebook\nElliot on X\nElliot on Instagram\nElliot on LinkedIn\nElliot on YouTube\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_cookies/content_14.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_donate/content_30.html": "Can you help me get re-elected as Member of Parliament for Carshalton and Wallington?\nFighting - and winning - elections is expensive and your financial support now will make a real difference to our campaign.\nIf you would prefer to donate by BACS, cheque or cash, please just get in touch here.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_discussing-importance-boosting-organ-donor-numbers/content_28.html": "I appreciated the chance to meet with Kidney Care UK and NHS Blood and Transplant at their reception in Parliament yesterday, as well as patients and those on waiting lists, to talk all things organ donation.\nWhat was evident is that for many people needing an organ donation, time is currently not on their side with huge waiting lists for organs, including 5,000-plus for kidney donation alone.\nWith Organ Donation Week coming up, getting as many donors as possible for the thousands waiting for a lifesaving transplant is vital.\nYou can find out more about the transplant system - including how you might be able to help one of the many waiting for a transplant - here: www.nhsbt.nhs.uk.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_elliot-launches-petition-save-st-helier/content_29.html": "What a depressing time for our local hospital.\nDuring the campaign I said the NHS plans to improve St Helier and build a second local hospital were under threat from Labour and the Lib Dems - and on Monday 29th July, that threat’s been confirmed.\nThe new Labour Government announced (alongside scrapping winter fuel payments for millions of pensioners) a review with the potential for SCRAPPING new hospital plans like those for St Helier.\nAs for the Lib Dems, they’ve let them get away it - they have been very open that they oppose the local NHS plan to improve St Helier and build a second hospital. Now they're silent on Labour potentially shelving these plans. I think that's shameful.\nLocal NHS staff have put so much work into this plan, getting it to the point that it could apply for planning permission and get building.\nNow, Labour and the Lib Dems have sent them back to square one.\nI can't quite believe we're back here so soon after Labour and the Lib Dems are back in office. When I was the MP we'd finally got confirmation that St Helier was going nowhere, A&E and maternity were protected locally and we would get a second hospital in Sutton. A planning application for the new hospital was supposed to come THIS YEAR.\nIt's not even been a month since the election and Labour and the Lib Dems have thrown it all up in the air again.\nThe NHS Trust has been clear that they need this plan to be funded by Government in order to improve outcomes for local patients, but also that if they don't get that second hospital, there is a real risk to patients and to services being able to continue being provided locally.\nIt is that serious - if this plan isn't funded, there is a real risk to services closing.\nI won’t stop fighting for St Helier and I invite residents to help me.\nPlease sign my petition to be delivered to the Government before the dreaded budget in the Autumn where a final decision will be made, urging them to stick with the NHS plan to save St Helier and build a second hospital in Sutton.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_ensuring-restorative-justice-front-and-centre-parliaments-work/content_53.html": "Getting to chair the All Party Parliamentary Group (APPG) on Restorative Justice is one of my favourite parts about being an MP.\nI was determined to set-up the APPG following my election - to increase the profile of restorative justice in Parliament and build on the incredible campaigning of local residents Ray and Vi Donavan.\nThe APPG is doing great work bringing various organisations, charities, and parliamentarians together to put restorative approaches centre in discussions over the justice system.\nIt was great to hear what the APPG are up to at one of our recent meetings to discuss what we've been doing in Parliament, and plan our next steps!\nYou can find out more about Ray and Vi's work, as well as their charity, at: https://www.chrisdonovantrust.org/, as well as that of the APPG via our Twitter page: twitter.com/appgrj.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_natwest-local-branch-closing/content_17.html": "After the closure of our local Barclays branch on Woodcote Road, I wrote to NatWest, Nationwide, Santander, TSB and HSBC to ensure these bank branches had no plans to close. You can read more about that here.\nLess than three months ago, NatWest assured me that they were committed to staying in the area and had no plans to close their Wallington Branch.\nAs a result, I am extremely frustrated to learn that they have decided to close their branch on Woodcote Road in September this year. Access to banking services is vital for our community – and I have particular concerns regarding the impact this with have on vulnerable customers.\nI have requested an urgent meeting with NatWest to discuss this matter further.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_more-carriages-trains-london-victoria-saturdays/content_19.html": "Exciting news.... from June 2024, trains running to London Victoria from Carshalton/Hackbridge will run from a mixture of 8-10 carriages on Saturdays! This means that people wanting to travel to London on Saturdays will no longer have to be squished on a 5 carriage train or risk not being able to fit on!\nThe transport links to Carshalton and Wallington is something that I have campaigned on since becoming elected as the local MP. I have been working hard with GTR to ensure that our trains are regular and efficient and I am really pleased to see our campaigning pay off.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news/content_10.html": "Labour votes to remove Winter Fuel payments for pensioners Tuesday, 10 September, 2024 The Labour Government is cutting Winter Fuel Payments for roughly 12,500 pensioners in Carshalton and Wallington. Local News\nElliot launches petition to save St Helier 5th August 2024 Please sign my petition to save St Helier Hospital. Local News\nSt Helier BETRAYED by Labour and the Lib Dems 29th July 2024 The new Labour Government today announced a review with the potential for SCRAPPING new hospital plans like those for St Helier. Local News\nThank you, Carshalton and Wallington, it's been an honour. 5th July 2024 I’ve been completely overwhelmed by the kind messages from people, whether they supported me or not. It means the world to me! Being the MP for my hometown has... Local News\nWestminster Hall debate on tackling Crash for Cash scams 22nd May 2024 Today (22/05/2024) I hosted a Westminster Hall debate to raise the issue of 'Crash for Cash' scams taking place in Carshalton in Wallington, but also across the... Local News\nMoped crash scams in Wallington 10th May 2024 I've heard from many local residents in Wallington about the moped crash scams happening around Ross Parade and Woodcote Road. This behaviour is completely... Local News\nNeighbourhood Fund 2024 9th April 2024 The Neighbourhood Fund 2024 project submission window is now open! This is a great opportunity to choose where you want to see money invested in our local area... Local News\nNatWest local branch closing! 2nd April 2024 After the closure of our local Barclays branch on Woodcote Road, I wrote to NatWest, Nationwide, Santander, TSB and HSBC to ensure these bank branches had no... Local News\nMore carriages on trains to London Victoria on Saturdays! 2nd April 2024 Exciting news.... from June 2024, trains running to London Victoria from Carshalton/Hackbridge will run from a mixture of 8-10 carriages on Saturdays! This... Local News\nCondition Improvement Funds for our local schools 27th March 2024 It is fantastic to hear the following schools will be given Condition Improvement Funds! These funds are a part of the Department for Education's priority in... Local News",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_category_Speeches-in-Parliament/content_42.html": "Raising New Mill Quarter failings and other issues in Parliament 20th September 2023 Yesterday in Parliament, I had the opportunity to raise the litany of issues that residents living in New Mill Quarter have been facing since they moved in due... Speeches in Parliament\nEnsuring restorative justice is front-and-centre of Parliament's work 17th September 2023 Getting to chair the All Party Parliamentary Group (APPG) on Restorative Justice is one of my favourite parts about being an MP. Speeches in Parliament\nCelebrating local charity's success in Parliament! 21st June 2023 We have so many amazing local community groups throughout our area - and it's always great to celebrate their success. Speeches in Parliament\nQuestioning the Minister on Afghan Relocation Numbers 18th July 2022 I know many residents throughout Carshalton and Wallington have been involved in the Afghan relocation scheme - just as they have with the Homes for Ukraine... Speeches in Parliament\nRaising Cost of Living Payments 11th July 2022 11,600 local residents will soon be receiving a cost of living payments - I got to raise this with the Secretary of State. Speeches in Parliament\nMarking Fifty Years of Pride 1st July 2022 My remarks marking fifty years since the first London Pride march. Speeches in Parliament\nRaising Passport and Visa Wait Times 27th June 2022 Constituents are facing enormous wait times for passports and visas. I raised this issue with the Minister to find out what is being done to improve efficiency... Speeches in Parliament\nDebating Sutton Council's SEND Failings 21st June 2022 Discussing the failings of Sutton Council when it comes to its SEND provision. Speeches in Parliament\nRaising the Issue of Pension Credit in Parliament 10th June 2022 I asked the Pensions Minister about working together to ensure that as many people as possible understand the benefits and help available. Speeches in Parliament",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_discussing-how-level-playing-field-when-it-comes-fertility-treatment/content_21.html": "It’s becoming clearer that there needs to be more of a level playing field when it com`es to IVF and access to it, with the current status quo featuring too much variance.\nAccess to fertility treatment is something that I’ve had residents get in touch with, especially sharing their own, often difficult, stories in battling such a minefield.\nI therefore appreciated the chance to chat with the team from the Progress Educational Trust, who work to break down the barriers and open up access to fertility treatment.\nOne of PET’s current campaigns emphasises the importance of three IVF cycles and ensuring that NHS trusts provide the three full IVF cycles as per NICE recommendations.\nI will continue to monitor this and encourage anyone affected by these issues to get in touch with me so that I can escalate these with the relevant authorities.\nYou can find out more about PET and the work that they do here: www.progress.org.uk.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_elliots-pride-message-2020/content_55.html": "June is Pride month, but Pride will look very differently for those celebrating this year.\nThis time of year would normally be a time for celebration for the LGBT+ community, coming together all over the UK to celebrate Pride, recognise how far we've come, but also realise how much further we have to go.\nSadly, Coronavirus has meant that we won't be able to come together to celebrate as we normally would, but we will still find ways to mark Pride in 2020 in many other ways.\nI am proud to represent Carshalton and Wallington as an openly gay man.\nI am also extremely proud of the progress the government has made over the last 10 years on LGBT+ issues. Not only did we legislate for equal marriage, but introduced the first ever LGBT Action Plan in 2018, following the largest every survey of LGBT+ people in the UK.\nThe Action Plan was incredibly positive and committed to extensive action to improve the lives of LGBT+ people in the UK and overseas. This includes action to tackle bullying of LGBT+ children in school, and indeed adults in the workplace, ending the abhorrent practice of conversion therapy, and reforming the Gender Recognition Act to mention just a few.\nSince being elected, I have been working with the Government Equalities Office (GEO) to ensure we continue to make good progress on implementing the plan, and I look forward to seeing this work continue over the course of this Parliament.\nSo may I wish everyone a very Happy Pride!",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_map-locations/content_5.html": "Skip to main content\nMain navigation\nHome\nAbout Elliot\nCampaigns\nNews\nIn Parliament\nContact\nMy map",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_freedom-donate/content_47.html": "Today is World Blood Donor Day, an opportunity to raise awareness of the importance of blood donations to save lives, and to thank all those who voluntarily give their life-saving gifts of blood to those who are in need.\nOver 6,000 life-saving blood transfusions take place in the UK each and every day, however we have seen a 40 per cent drop in the number of people giving blood over the last decade, with a gender imbalance developing as men fall to 41 per cent of overall donors.\nThere are thousands and thousands of gay and bisexual men who would love to support the wider community by donating blood but, due to a current lack of research into this area, are restricted from doing so. As an LGBT+ rights advocate who is a Member of Parliament and a champion of the #FreedomToDonate campaign, I have a privileged position to be able to campaign for this to change, and to press for an individualised risk-based assessment model to replace the decades of stigma that has restricted, and previously prevented entirely, men who have sex with men from donating blood.\nWhilst the lifting of the lifetime ban, and then the subsequent introduction of the three-month deferral, was welcomed, there are many who feel that the current policy is still discriminatory towards gay and bisexual men. The default assumption by NHSBT is that heterosexual donors’ sexual behaviour is less risky than that of men who have sex with men, and treats all gay and bisexual men as a homogeneous group. An individualised risk-based assessment, which assesses donor safety based on sexual behaviour rather than sexual preference, is the best way to ensure all those who want to donate and could do so safely can.\nOn behalf of gay and bisexual men across the UK, on World Blood Donor Day and during Pride Month, I have written to the Health Secretary to ask him to speak with NHSBT in order to bring about this change.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_raising-issue-pension-credit-parliament/content_50.html": "This week I got the chance to raise the issue of the many pensioners in our area who are unaware of their eligibility for Pension Credit.\nAs I outlined in my question, it is clear that much of this issue surrounds better awareness for those eligible as to what assistance is available to them. You can listen to my question and the Minister's answer in the video above.\nWhat's more, I look forward to welcoming Guy Opperman MP to my next Older Persons' Fair, so he can see some of the great work done by our local organisations to ensure uptake of all relevant benefits, including Pension Credit.\nI am always happy to help if you or someone you know is finding it difficult to access the assistance they're entitled to, so please get in touch with me and my team.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_savesthelier/content_24.html": "What a depressing time for our local hospital.\nDuring the campaign I said the NHS plans to improve St Helier and build a second local hospital were under threat from Labour and the Lib Dems - and on Monday 29th July, that threat’s been confirmed.\nThe new Labour Government announced (alongside scrapping winter fuel payments for millions of pensioners) a review with the potential for SCRAPPING new hospital plans like those for St Helier.\nAs for the Lib Dems, they’ve let them get away it - they have been very open that they oppose the local NHS plan to improve St Helier and build a second hospital. Now they're silent on Labour potentially shelving these plans. I think that's shameful.\nLocal NHS staff have put so much work into this plan, getting it to the point that it could apply for planning permission and get building.\nNow, Labour and the Lib Dems have sent them back to square one.\nI can't quite believe we're back here so soon after Labour and the Lib Dems are back in office. When I was the MP we'd finally got confirmation that St Helier was going nowhere, A&E and maternity were protected locally and we would get a second hospital in Sutton. A planning application for the new hospital was supposed to come THIS YEAR.\nIt's not even been a month since the election and Labour and the Lib Dems have thrown it all up in the air again.\nThe NHS Trust has been clear that they need this plan to be funded by Government in order to improve outcomes for local patients, but also that if they don't get that second hospital, there is a real risk to patients and to services being able to continue being provided locally.\nIt is that serious - if this plan isn't funded, there is a real risk to services closing.\nNow people will be asking why this is happening. Labour are using the old political cliché of 'we didn't know until we got in', which has been completely torn apart. If you want to see proof, click here and here.\nThe public finances are just that, public. They made their manifesto and made promises they said were fully costed. They inherited a growing and resilient economy from the Conservatives and the truth is, they are laying the ground work for tax rises they originally said they wouldn't do. And just like with the hospital, the Lib Dems are just sitting there silently and letting them get away with it.\nI won’t stop fighting for St Helier and I invite residents to help me.\nPlease sign my petition to be delivered to the Government before the dreaded budget in the Autumn where a final decision will be made, urging them to stick with the NHS plan to save St Helier and build a second hospital in Sutton.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_report-freedom-religion-or-belief-pakistan/content_32.html": "It was humbling to attend the launch of the Pakistan Report at the All Party Parliamentary Group (APPG) on Freedom of Religion or Belief today.\nWe heard the ongoing concerns about the treatment of Ahmadis in Pakistan and the human rights abuses they face.\nThis was following a visit by the APPG to Pakistan earlier in the year.\nThe report will be published on the APPG website here.\nI will continue to work with this APPG and the APPG on the Ahmadiyya Muslim community, which I am proud to be a Vice Chair of, to press the UK Government to use all bilateral and international opportunities to raise these issue and bring about change in Pakistan's constitution and laws.\nYou can also read the debate I held about treatment of Ahmadi Muslims in Pakistan earlier this year here.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_privacy/content_3.html": "This document outlines how Elliot Colburn processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Elliot Colburn\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Elliot Colburn.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Elliot Colburn, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Elliot Colburn via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_cdn-cgi_l_email-protection/content_25.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_about-rss/content_13.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_violentcrime-adjournmentdebate/content_31.html": "Yesterday evening, I led the Adjournment Debate in the House of Commons on ‘Violent Crime and Antisocial Behaviour in Carshalton and Wallington.\nFollowing recent incidents of violent crime, both in Carshalton and Wallington but also the surrounding area, as well as a rising amount of antisocial behaviour and youth crime, I know that many of my constituents are rightly concerned. No one should live in fear of being attacked in our community.\nMy inbox is often full of correspondence from residents and concerned parents who feel vulnerable, and it must not be allowed to continue. No one should feel unsafe taking the bins out in the evening, and our children must feel safe out in our local area.\nWe have seen our police numbers here in London increase in recent years, thanks to the Government's commitment to recruit 20,000 new police officers. This target was met last year and included an additional 3,666 officers on the streets of London. Despite this, we still need a higher police presence on our streets. The Government has given further grants to the Mayor of London to recruit more officers, which where unused by the end of this year.\nI urged the Mayor of London, who is responsible for policing in London, to get a grip. We must also look at the role of education, Violence Reduction Units and community schemes to tackle these issues head on.\nResponding to the Debate was Rt Hon Chris Philp MP, who is the Minister for Policing and Crime and is also the neighbouring MP for Croydon South, so understands these issues first hand.\nThe Minister confirmed that thanks to Government funding we have more police officers than ever before, but that more needs to be done. He confirmed:\n- a range of measures that the Government is taking through both the Criminal Justice Bill, and through secondary legislation, to ban zombie knives and machetes that are currently legal\n- changes to sentencing for those who sell knives to under-18s\n- the police will also get additional powers to seize legal knives that are held in private but that they think will be used for criminal purposes\n- a range of new technology that is being developed that will help catch those carrying dangerous weapons\nEach and every violent crime that we see on our streets is a tragedy, and I will continue to raise these issues at every opportunity.\nYou can watch the full video of the debate in the House of Commons above.\n---\nBelow, you can read a full transcript of the debate:\nElliot Colburn MP\nMay I begin by expressing how devastated I am that the hon. Member for Strangford (Jim Shannon) is not here to intervene on me? I have heard that that is a staple of Adjournment debates, but I fear that I will miss out on the opportunity. Nevertheless, I will soldier on and do what I can.\nI would like to address a growing concern in our community of Carshalton and Wallington: violent crime and antisocial behaviour, which demands our attention and is a huge concern to my constituents. I am delighted that my constituency neighbour, my right hon. Friend the Member for Croydon South (Chris Philp), is the Minister responding today, because he will know about many of these issues already. I am also delighted to be joined by my hon. Friend the Member for Sutton and Cheam (Paul Scully), who will know full well about some of the issues I plan to raise. I will start with a few recent examples of violent crime and antisocial behaviour in the constituency.\nOn 3 October, a man was fatally stabbed in Roundshaw, just a week after a tragic stabbing in the neighbouring borough of Croydon, which I know the Minister is aware of as the constituency MP for the area. That followed a number of recent attacks, not all of which took place in my constituency—some occurred in neighbouring Croydon, including the tragic case of a 15-year-old girl—involving several of the many teenagers who have been killed on London’s streets in 2023. Each one is a tragedy.\nIn Wallington, a man sustained a thankfully non-life-threatening chest wound and a woman suffered a hand injury in a knife attack on Birchwood Avenue last Saturday. I thank the police for their work. They always respond with the utmost professionalism, and they do a fantastic job. I also thank the air ambulance and NHS staff who cared for the victims. However, such incidents are of concern, because the London borough of Sutton, which includes Carshalton and Wallington, has long enjoyed a reputation as one of the safest in London, often competing with Richmond. Violent crime is not something we are necessarily used to, so seeing it happen on our streets over the course of the last few months is of real concern.\nLike the inboxes of many of my colleagues across the capital, my inbox is often full of correspondence from residents, concerned parents and others who feel vulnerable and unsafe because of the crime that is happening in their area. It must not be allowed to continue. I vividly remember one constituent writing to me after the attack in Roundshaw to say that she did not feel safe enough to put her bins out in the dark. Another’s teenage daughter did not want to leave the house for fear of being attacked. We must not let that become the new normal in London—or anywhere, for that matter.\nPaul Scully MP - Member of Parliament for Sutton and Cheam\nMy hon. Friend is making a powerful speech. We have had the sad news of the fatal stabbing of a 17-year-old boy outside Sutton station, and a 15-year-old was recently killed in the Minister’s town of Croydon. Not only do we have to lean into knife crime, which is sometimes imported into Sutton; we also need to make sure that we can bring down the fear of crime. Often it is imported by gangs, but it is really important that we can reassure people that the police are there and that we have a holistic view of knife crime in Sutton.\nElliot Colburn MP\nAbsolutely; I thank my hon. Friend and constituency neighbour for that intervention. He is absolutely right about the need to bring down the fear of crime and introducing measures to do that, and I would like to hear more from the Minister about what steps the Home Office is taking in that respect. My hon. Friend is absolutely right about providing reassurance, and I will go into that in a bit more detail. I pay tribute to him for his time as one of the longest-serving Ministers for London, and for the work he did in this space. He has been a fantastic champion of his constituency and the capital, and he is a great loss to the Government, but I am pleased to have him back on the Back Benches helping me to advocate for our fantastic borough of Sutton.\nOn 30 October—just a few weeks ago—a 15-year-old boy who was minding his own business was approached by another teenage boy, who led him to a block of flats, where three other teenagers armed with knives awaited. The young victim was robbed of his phone. That incident was one of many that underscores the vulnerability of our youth and the audacity of those who will prey on our children. Our children’s minds should be free to explore and not be occupied with threats to their lives, but, sadly, that was not an isolated incident.\nOur community has witnessed rises in house break-ins and people trying car doors. One of the most common things that I see on social media is Ring doorbell footage of people trying car doors or front doors late at night in our community. That really makes people feel violated and scared in their own homes, and that cannot be right. These doorbell cameras deter crime in their own right. I often encourage my constituents to get them, because thankfully I have seen many videos where someone has clocked a Ring doorbell camera and turned away from the house. That is fantastic, but it is awful how often such footage comes up on social media.\nAnother fairly distressing incident was that of a four- year-old child who was slapped at a bus stop just a couple of weeks ago. Though details are still emerging, and I do not want to prejudice investigations in any of the cases I raise, that incident underscores the urgency with which we must tackle the root causes of knife crime and antisocial behaviour in our community. No child, no parent and no person should be left with the weight of that trauma or left feeling unsafe in their own community.\nIn our area in the last year, thefts are up by 31%, sexual offences are up by 43% and robberies are up by 58%. Those statistics are alarming—and more so because they are not part of a national trend. Across the whole of the United Kingdom, crime has fallen since 2010—the Minister will want to expand on the Government’s record in bringing crime down—so we must ask ourselves why it is only within London that we do not see that trend being played out. Some responsibility—in fact, I would argue quite a lot—must rest on the shoulders of the police and crime commissioner for London, who also happens to be the Mayor of London.\nWe have seen London benefit from the massive increase in police officers—we met our manifesto commitment of 20,000 new police officers, and 3,666 of those are working on the streets of London—yet we see this worrying trend with crime levels. Even just this past week, the Mayor of London was caught out misleading Londoners on statistics about crime in London. He may not be prepared to put the work in and would rather spend his time jetting off around the world trying to sell his book, legalise weed or whatever it is he is interested in doing other than getting on with his job. However, we cannot leave criminals to take over the streets of London, so I would really like to understand what work the Home Office is doing with the Metropolitan police to recapture the trust of Londoners and get on with the job of deterring and catching criminals, ensuring that our constituents—those of the Minister and my hon. Friend the Member for Sutton and Cheam, and mine—are kept safe.\nI absolutely welcome the increase in police numbers, but we face unique challenges on the fringes of London, from which a significant number of officers are regularly transferred away for major events in central London, where help is needed for policing, leaving only a minimal presence in outer London. I would like to hear a bit more from the Minister on the work that he is doing in the Home Office with the Metropolitan police to address that promptly so that when big events happen in central London, neighbourhood and local policing in outer London does not suffer.\nCollaboration between the police and local communities is also paramount, and policing is only half the battle. I absolutely want to continue advocating for an increased police presence. We all want to see bobbies back on the beat, and it is great to see those new police officers getting out there in our communities and doing just that, but we must also tackle the causes of crime and antisocial behaviour along the way. Education is a crucial step in doing that. We have seen how that has worked in other parts of the world, and even here in the United Kingdom. Glasgow was once the most violent city in the whole of Europe. It took a different approach to violent crime, and has turned that reputation around and driven down that number.\nIn London, we were promised a violence reduction unit that would tackle knife crime in a similar way, yet we have seen no results from that violence reduction unit. There is little transparency about who sits on it and what work they are doing, whether they have met, what they have spoken about and when they meet. The violence reduction unit for London has not achieved anything because, as I said earlier, London is not following the national trend for crime at the moment.\nThe challenges that we face are daunting, but the spirit of our community is always resilient. We must do all that we can to tackle violent crime and anti-social behaviour and reclaim the safety and security of my constituents in Carshalton and Wallington, and across the whole of London. We need to ensure that we have a constant and visible police presence on the streets of Sutton. We need to ensure that people are aware of the consequences of criminal activity, and educate them to prevent their turning to crime in the first place, particularly our young people. I will not stop raising these issues, and nor will my hon. Friends, because until no one lives in fear, our community thrives, and people value and protect each other, we will not have achieved our aims.\nRt Hon Chris Philp MP - Minister for Crime, Policing and Fire\nIt is a pleasure to respond to my hon. Friend the Member for Carshalton and Wallington (Elliot Colburn). I congratulate him on securing this Adjournment debate, and on his extremely powerful and eloquent speech, which furthers his tireless campaigning on this issue, often in partnership with his constituency neighbour, my hon. Friend the Member for Sutton and Cheam (Paul Scully), who has contributed already this evening.\nThis is an incredibly important topic. I say that not just as the Minister for Crime, Policing and Fire, but as the constituency neighbour, on the other side, of my hon. Friend the Member for Carshalton and Wallington. I am a fellow south-London MP, so I, too, see at first hand the effect of knife crime and serious violence on our communities. In particular in Croydon, but I think across all of south London, we felt for the family of Elianne Andam, the 15-year-old girl who was brutally murdered on the morning of 27 September. The whole community was incredibly moved and mourns her loss. I went to her funeral with many others. About 1,000 people attended that funeral, just a few weeks ago. It had a profound impact on the whole borough, and more widely across south London, and we all need to redouble our efforts to end the scourge of knife crime and serious violence.\nAlthough serious violence is down by 25% over the last four years, and even though homicide has reduced this year compared with last year and is lower than it was in 2010, every single death, and every single incident of serious violence or homicide, is an individual tragedy, and we need to do more to get the figures down even further. On the Government’s work in this area, we have delivered record police numbers, with 149,566 across England and Wales—more police than we have ever had before. That includes more police than we have ever had across London, in the Metropolitan Police.\nHowever, as my hon. Friend the Member for Carshalton and Wallington pointed out, the Mayor of London, Sadiq Khan, as London’s police and crime commissioner, has been pretty deficient in managing the police force. Although there are record numbers in the Met thanks to Government funding, there could have been an extra 1,089 officers. Government funding was available to recruit those officers to the Met, but the Mayor of London, thanks to his ineptitude, failed to recruit them. Knife crime in London has also increased on his watch. He shamefully made a claim to the contrary and was publicly rebuked by the Office for National Statistics for making misleading claims. Clearly, the Mayor of London needs to do a lot more to tackle knife crime.\nLet me set out some of the things that the Government are doing in this area. One of them is funding violence reduction units across the 20 police force areas where violent crime is the most serious. Those violence reduction units, which are managed by the police and crime commissioners but are funded by the Government, are designed to make early interventions to identify people—often young people—who are on the wrong track and try to put them on the right track, whether that is through educational interventions, social services work, sporting activity or whatever it may be. We intend to continue supporting and expanding the work of violence reduction units, supported by the Youth Endowment Fund, which has received £200 million of Government money.\nWe also want to stop the supply of knives getting on to our streets in the first place. That is why we are legislating, both through the Criminal Justice Bill and through secondary legislation, to: ban certain zombie knives and machetes that are currently legal; double the sentence for selling knives to under-18s; and give the police additional powers to seize legal knives that are held in private if they think those knives are going to be used for criminal purposes. As for selling knives online, the Online Safety Act 2023—which received Royal Assent just a few weeks ago—will, when fully in force, require online marketplaces such as Facebook Marketplace to proactively prevent the sale of illegal knives online, again choking off the supply of those knives into our communities.\nElliot Colburn MP\nWill the Minister join me in paying tribute to three people? First, Ray and Vi Donovan are an incredible couple living in my constituency who helped bring a knife bin to the centre of Sutton—some truly horrific things have been found in that knife bin, but thankfully, they are off the streets. Secondly, as the Minister mentioned the Online Safety Act, will he join me in congratulating my hon. Friend the Member for Sutton and Cheam (Paul Scully), who was the Minister who took that Act through Parliament in its final stages and managed to secure that important measure to stop knives being sold?\nRt Hon Chris Philp MP\nI certainly join my hon. Friend in paying tribute to his constituents and their work on the knife bin—we need to have more of those around—and my hon. Friend the Member for Sutton and Cheam did indeed take the Online Safety Bill through its concluding stages in the House of Commons. I was involved in an earlier stage of that Bill’s passage, but he was the Minister who, after a number of years and a number of Ministers, got it over the line.\nIt is also important to take action on the streets, and although it sometimes attracts controversy, stop and search is an important way of getting knives off our streets. Each month, the Metropolitan police takes about 400 knives off the street through stop and search, which is an important part of the police’s arsenal when done lawfully and respectfully. I would like to see the police be more proactive, using stop and search more—using it more confidently and more widely—to get those knives off the street. Some people raise concerns about disproportionality, but if we look at the success rate for finding knives or drugs on those people who are stopped and searched, the percentage of stop and searches resulting in a find of knives or drugs—which is typically between 25% and 28%—is virtually exactly the same across all ethnic groups. That suggests that allegations that the police are behaving unfairly are without foundation, so I would like to see stop and search used more.\nThe Home Office is also investing in the development of technology that will be able to covertly scan for knives as people walk down the street. That technology is a year or so away from being deployable, but it is something we are investing in, and it is something I would like to see deployed on our streets. We are also investing in hotspot patrolling: through a project called Grip, hotspot patrols take place in areas where serious violence is a particular problem. We are also running antisocial behaviour hotspot patrols in some force areas. Those hotspot patrols will be rolled out across the whole country from next April—we found that where they take place, antisocial behaviour and serious violence drop noticeably, so we are going to be increasing funding for hotspot patrols across the country from April.\nFinally, I draw the House’s attention to the importance of catching perpetrators, and of using technology to do so. My hon. Friend the Member for Carshalton and Wallington mentioned the availability of CCTV footage these days: a lot of images are now available, whether that is CCTV footage from shops or local authorities, Ring doorbells in people’s houses, dashcam footage or footage taken on mobile phones. The facial recognition algorithm that the police can run, which takes an image of a criminal committing a crime from any of those things—CCTV, mobile phones and so on—and runs it through the police database, can now produce remarkably accurate matches even when the image is not particularly clear. I therefore urge all police forces to redouble their efforts to always run those images through the police national database and to do the facial recognition search. The evidence so far suggests that many perpetrators who would previously not have been caught now can be caught using retrospective facial recognition, which is what I have described.\nI thank again my hon. Friend the Member for Carshalton and Wallington for securing this debate. It is a really important topic not just in south London or London more widely, but across the whole country. A lot of progress has been made, but there is more to do. Every single injury or death is a tragedy and all of us in Parliament and in Government must work together with the police and others to ensure that we do everything humanly possible to end the scourge of knife crime, which is far too frequent at the moment.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_elliots-easter-message/content_48.html": "Easter Sunday will look very different to many people in Carshalton and Wallington this year.\nAs well as being a significant time of year in the Christian calendar, April marks a series of important Holy events for people of all faiths.\nWhether it be Easter, the start of Ramadan, Passover, Theravada New Year, Tamil and Sinhala New Year, Vaisakhi, or any of the Holy events that are observed this month, I appreciate how difficult this time of year will be, for people of all faiths and none, not to spend it with their friends and family.\nRegardless of whether you are observing a religious holiday or not, this weekend is normally one we cherish to spend time with our loved ones. It is a period in which we can reflect, give thanks and be renewed – an encompassing of the feeling of new life that comes with spring.\nNormally this is marked by families and friends coming together to eat, drink and celebrate – to enjoy and refresh in the extended bank holiday with those we love most.\nThis year will not only be very different, but also very difficult.\nIn the face of the global Coronavirus pandemic, we are having to stay at home to protect the NHS and save lives – unable to gather with our friends and family as we normally would.\nAt such a time, I find it becomes easy to be consumed by fear, anxiety and worry. The deadly effects of this invisible killer are already well documented, with the tragic loss of life bringing pain to families across the country.\nEvery single person who has sadly passed away was special to somebody, and our thoughts and prayers are with their loved ones at this terrible time.\nIt is hard to imagine how anybody could fail to feel the affects of the virus in some way shape or form, not just in our physical health, but whether it be the disruption to our work, the concern about our businesses, the strain on our mental health, the charities we support, the friends and family on the front line of tackling this virus, our children’s education, the worry for those already struggling with loneliness, the inability to leave our home, how we come out the other side – all of us have had our lives touched by this pandemic.\nConsequently, we can fall prey to the negative, the frightening and the unknown. We grow angry, scared and concerned.\nHowever, as with every dark time, there are those who offer rays of light and give us hope for the future.\nThose small acts that warm our hearts and fill us with the confidence to carry on. It is for that reason that I want to give thanks to those extraordinary people helping to see Carshalton and Wallington through this crisis.\nI give thanks to the doctors, nurses, allied care professionals, porters, cleaners, kitchen staff, receptionists, admin staff and everyone at the Epsom and St Helier University Hospitals NHS Trust, Sutton CCG, our care homes, our community pharmacies and all local health and care providers who are responding brilliantly and caring for us and our families.\nI give thanks to the amazing charity staff and volunteers, particularly those from Volunteer Centre Sutton, Community Action Sutton and Age UK Sutton, for co-ordinating the huge amount of inspirational local volunteers to help deliver food, medicines, PPE equipment and more to those in need.\nI give thanks to the Police for responding to the changing nature of crime, enforcing the new restrictions and keeping us safe.\nI give thanks to businesses big and small, whether they be remaining open to provide us with essential supplies, helping in the national effort to tackle the virus by manufacturing new products, donating to local good causes, etc, changing the way they operate to keep their staff safe, or closing and ensuring their employees get the financial peace of mind to see them through this crisis.\nI give thanks to the hardworking staff and officers at Sutton Council who are helping to disperse some of the help and support available to businesses and individuals, to the refuse collectors and street cleaners, and all those helping to keep vital services ongoing.\nI give thanks to the teachers and schools who are helping our key workers by continuing to teach their children and the most vulnerable children in our community.\nI give thanks to my own amazing team, Lewis, Tommy, Catherine and Richard, who have helped me to respond to the literally hundreds of people who have called or emailed me to seek help or advice in dealing with this pandemic. If you need my help then please get in touch by emailing me at [email protected] or calling me on 020 7219 5862.\nAnd finally, I give thanks to you. For staying at home and observing social distancing when you go out to shop or exercise, you are helping to respond to this pandemic, and the more we do this, the quicker the restrictions can be lifted and our lives returned to normal.\nI would like to finish with a few inspirational words from Her Majesty, The Queen:\n\"We should take comfort that while we may have more still to endure, better days will return: we will be with our friends again; we will be with our families again; we will meet again.\"\nRemember.\nStay Home. Protect the NHS. Save Lives.\nA very happy Easter to you and your families.",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_accessibility/content_8.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_category_Local-News/content_22.html": "Labour votes to remove Winter Fuel payments for pensioners 10th September 2024 The Labour Government is cutting Winter Fuel Payments for roughly 12,500 pensioners in Carshalton and Wallington. Local News\nElliot launches petition to save St Helier 5th August 2024 Please sign my petition to save St Helier Hospital. Local News\nSt Helier BETRAYED by Labour and the Lib Dems 29th July 2024 The new Labour Government today announced a review with the potential for SCRAPPING new hospital plans like those for St Helier. Local News\nThank you, Carshalton and Wallington, it's been an honour. 5th July 2024 I’ve been completely overwhelmed by the kind messages from people, whether they supported me or not. It means the world to me! Being the MP for my hometown has... Local News\nWestminster Hall debate on tackling Crash for Cash scams 22nd May 2024 Today (22/05/2024) I hosted a Westminster Hall debate to raise the issue of 'Crash for Cash' scams taking place in Carshalton in Wallington, but also across the... Local News\nMoped crash scams in Wallington 10th May 2024 I've heard from many local residents in Wallington about the moped crash scams happening around Ross Parade and Woodcote Road. This behaviour is completely... Local News\nNeighbourhood Fund 2024 9th April 2024 The Neighbourhood Fund 2024 project submission window is now open! This is a great opportunity to choose where you want to see money invested in our local area... Local News\nNatWest local branch closing! 2nd April 2024 After the closure of our local Barclays branch on Woodcote Road, I wrote to NatWest, Nationwide, Santander, TSB and HSBC to ensure these bank branches had no... Local News\nMore carriages on trains to London Victoria on Saturdays! 2nd April 2024 Exciting news.... from June 2024, trains running to London Victoria from Carshalton/Hackbridge will run from a mixture of 8-10 carriages on Saturdays! This... Local News",
  "https_www_elliotcolburn_co_uk_/https_www_elliotcolburn_co_uk_news_feed/content_39.html": null
}