{
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_campaigns_supporting-local-businesses/content_8.html": "Tweet I am dedicated to securing greater investment in the local businesses that make up our high streets.",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_about-tom-drummond/content_10.html": "Skip to main content\nMain navigation\nHome\nAbout Tom\nNews\nOur Plan\nContact\nAbout Tom Drummond\nTweet\nBiography coming soon...",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk/content_1.html": "I'm Tom Drummond, Conservative group leader on Sutton Council, councillor for Worcester Park North and the candidate for Sutton and Cheam in 2024. I am part of this community, and I love this place, but there is work to be done. As the Conservative group leader on the council I hold the incumbents to account and I aspire to deliver the change we need in our local communities.",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_ourplan/content_3.html": "3,666 extra police to tackle crimes like anti-social behaviour My target is for 3,666 extra police to tackle crimes like anti-social behaviour on London's streets.\nImproving public transport and standing up for local commuters One of the most important things we need to do locally is to improve public transport in order to support the thousands of people who commute daily.\nSupporting local businesses I am dedicated to securing greater investment in the local businesses that make up our high streets.\nInvesting in our schools and boosting apprenticeships I am passionate about giving the next generation the best chances of success, so I am committed to increasing investment in our local schools and boosting apprenticeships.\nScrapping Sadiq Khan's unfair ULEZ expansion Once elected I would work from day one to scrap Sadiq Khan's unfair expansion of ULEZ.",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_campaigns_protecting-st-helier-and-build-brand-new-hospital-right-here-sutton/content_11.html": "Skip to main content\nMain navigation\nHome\nAbout Tom\nNews\nOur Plan\nContact\nProtecting St Helier and build a brand-new hospital right here in Sutton\nTweet\nComing soon...",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_campaigns_improving-public-transport-and-standing-local-commuters/content_4.html": "Tweet One of the most important things we need to do locally is to improve public transport in order to support the thousands of people who commute daily.",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_news/content_6.html": "Tom Drummond to stand as Sutton and Cheam MP Thursday, 11 April, 2024 The Conservative Party have announced local man Tom Drummond as their parliamentary candidate for Sutton and Cheam constituency. This comes as serving MP Paul Scully has decided to step down at the next election. Tom, who serves as the Conservative Group Leader in the local Council, has consistently supported local people, from ensuring a fair deal for children with special educational needs to... Local News",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_campaigns_investing-our-schools-and-boosting-apprenticeships/content_2.html": "I am passionate about giving the next generation the best chances of success, so I am committed to increasing investment in our local schools and boosting apprenticeships.\nI am passionate about giving the next generation the best chances of success, so I am committed to increasing investment in our local schools and boosting apprenticeships.",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_news_tom-drummond-stand-sutton-and-cheam-mp/content_5.html": "The Conservative Party have announced local man Tom Drummond as their parliamentary candidate for Sutton and Cheam constituency. This comes as serving MP Paul Scully has decided to step down at the next election.\nTom, who serves as the Conservative Group Leader in the local Council, has consistently supported local people, from ensuring a fair deal for children with special educational needs to overturning irresponsible parking schemes across the borough. He has raised his family in the constituency over the past 17 years, and sits on local boards and volunteers for many local charities, all of which have influenced him to stand as Sutton and Cheam’s voice and champion in Westminster.\nSetting out his plans for Sutton, Tom has identified healthcare, transport, the cost of living and policing as priorities for the area - as well as supporting local people through their own individual struggles:\n“I am part of this community, and I love this place, but there is work to be done.\n“Paul Scully worked hard to achieve a £500 million investment for a state of the art hospital in Sutton, yet the Liberal Democrats are trying to prevent it ever being built. We must not let them scrap it. It is a lifeline we cannot afford to lose.\n“Transport is a huge issue for our community. As ULEZ has hit local people hard, Labour’s plans to introduce a pay per mile car scheme could cripple our local families. They must be stopped and local transport infrastructure must be improved. We need a Sutton and Cheam that moves for everyone.\n“The economy, anti-social behaviour and knife crime - these are all things that I will address to help our community. Step one of doing the right thing for our community is listening to the people who make it. That is my commitment.”",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_cdn-cgi_l_email-protection/content_12.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_campaigns_3666-extra-police-tackle-crimes-anti-social-behaviour/content_7.html": "Tweet My target is for 3,666 extra police to tackle crimes like anti-social behaviour on London's streets.",
  "https_www_tomdrummond_uk_/https_www_tomdrummond_uk_contact/content_9.html": "Skip to main content\nMain navigation\nHome\nAbout Tom\nNews\nOur Plan\nContact\nContact\nLeave this field blank\n[email protected]\nTom on Facebook\nTom on Twitter\nTom on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy"
}