{
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_category_Speeches-in-Parliament/content_15.html": "Victoria's Speech in Rural Affairs Debate 11th November 2024 A transcript of the speech Victoria gave in the 11 November 2024 debate on rural affairs. Speeches in ParliamentWestminster News\nTalking about violence against women and girls 2nd March 2022 In the UK House of Commons talking about tackling violence against women and girls. #Enough! By working together we can make this the decade of change. Watch my... Speeches in Parliament\nSupporting the Scam Awareness Campaign 17th June 2019 For two weeks, between June 10 and June 23, Citizens Advice Bureau will run their Scam Awareness Campaign, encouraging people to take action to spot, report and... Speeches in Parliament\nSpeaking in the Serious Violence debate 17th February 2019 Victoria Atkins, Member of Parliament for Louth and Horncastle, spoke in Mondays debate on serious violence, highlighting the work that the Government is... Speeches in Parliament\nAnnouncing landmark draft #DomesticAbuseBill 22nd January 2019 Yesterday Victoria Atkins MP announced that a draft of #DomesticAbuseBill would be published. Domestic abuse is a devastating, complex and often hidden crime... Speeches in Parliament\nOffensive Weapons Bill passes Second Reading 29th June 2018 Violent crime has a devastating impact on communities in every part of the country, not just in London. The Offensive Weapons Bill will strengthen the powers of... Speeches in Parliament\nModernising the Mental Health Act 3rd November 2017 Today's debate on the use of force in mental health units looked at important measures to make the 1983 Mental Health Act fit for purpose. It recognised the... Speeches in Parliament\nWestminster Hall debate on Surgical Mesh Implants 18th October 2017 This morning Victoria Atkins MP contributed to an important debate giving a voice to those affected by complications from surgical mesh implants. She raised the... Speeches in Parliament\nBreaking the barriers to women standing for Parliament 17th September 2017 Earlier in the week, Victoria Atkins MP contributed to an important Westminster Hall on barriers to women standing for Parliament. It was thoughtful debate... Speeches in Parliament",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-speaks-louth-leader-about-challenges-local-farmers-are-facing-under-labour-government/content_59.html": "Recently Victoria spoke to the Louth Leader and Horncastle News about the challenges facing the farming sector since the new Government came to power. You can read the interview here.\nRecently Victoria spoke to the Louth Leader and Horncastle News about the challenges facing the farming sector since the new Government came to power. You can read the interview here.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_meeting-austrian-minister-women/content_91.html": "Victoria Atkins, Member of Parliament for Louth and Horncastle and Minister for Women recently met with the Austrian Minister for Women, Julia Bogner-Strauss.\nReflecting on the success of the visit, Victoria said, ''Ms Bogner-Strauss and I had a wonderful time exchanging views and chatting about the importance of our respective positions in 21st century politics. We had a lively and productive discussion about a range of incredibly important issues, including the gender pay gap, violence against women and girls and domestic abuse.''\nMs Atkins and Ms Bogner-Strauss were joined by a representative from the UK Government and Equalities office.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-attends-breast-cancer-campaign-event/content_25.html": "Earlier this week, Victoria attended an event hosted by Estee Lauder’s Breast Cancer Campaign. Alongside hearing about their research, we also heard about the signs of breast cancer to look out for and the importance of attending breast cancer screenings.\nEarly detection through these screenings and treatment can help prevent the cancer from progressing, and often means it can be cured.\nIf you are invited to a breast cancer screening, please don’t ignore the letter. It is time to end breast cancer.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-article-ahead-mass-farming-lobby/content_41.html": "“As long as Mum dies before 2026, we’ll be okay?”\nThis was the profoundly sad message I received from a farmer this week, when I asked farmers to tell me how Labour’s family farm tax will affect them and their farms.\nFarmers are the keystone of rural communities. They feed us and they are the custodians of our countryside. When they struggle, our rural economy is weakened and our food security is put at risk. Labour have doubled down on their cruel and illogical plans for our farming sector. In response, thousands of farmers from across the United Kingdom will descend on London on Tuesday to force this city-dwelling government to listen to them.\nAs the proud MP of an agricultural seat in Lincolnshire for nearly a decade, I have never known an issue that has united rural communities like this. As well as meeting many farmers, I have been inundated with messages from farming families who are deeply distressed that Labour’s budget is targeting them. In a sign of our commitment to our farming industry, Kemi Badenoch joined farmers, the local MP Greg Smith and me in Buckinghamshire last week to make clear our commitment to scrap the Family Farm Tax – the first policy commitment Kemi has made since being elected Leader.\nThe tax reliefs of Agricultural and Business Property Relief have meant that families can pass on their farms and businesses to the next generation. The removal of these reliefs will be devastating. The Country Land and Business Association have provided analysis which says that a typical 250-acre arable farm will be forced to sell twenty percent of its land to cover the inheritance tax bill. This is land that may well have been farmed by generations of the same family. If these farms close down, we will quickly feel the rise in food prices and the fall in food security. Before the General Election, Keir Starmer said “food security is national security”; he should be eating his own words in shame following his Budget.\nSteve Reed, the DEFRA Secretary, and the Cabinet represent city and urban constituencies.\nThis disconnect with the countryside means that they seem to have a skewed view of farmers. They don’t seem to appreciate that many farmers work all year round for very little profit. Any livestock farmer will tell you that they work 365 days a year – their animals need feeding on Christmas Day and bank holidays just as we do. They certainly don’t work a four-day week, as some Defra civil servants seem to want for themselves.\nOf course, abuse of the tax system must be tackled, but those British families who are asset rich and cash poor are the ones that Labour is targeting. The wealthiest landowners will be able to afford lawyers to litigate and plan their way out of Labour’s tax raid. The ones who will struggle are tenant farmers and those in the middle.\nThe future of tenant farming is particularly worrying. One Welsh landowner contacted me to say that Labour’s plans mean he must tell six multi-generational farming families on his land that he will have to sell their farms. In his words, ‘they will lose their homes, their businesses and their children’s future’.\nAnother family has been custodians of their five hundred acre farm for four generations. They earn some £45,000 per year but face an inheritance tax bill of almost £900,000. How does Labour think these farmers will pay the Family Farm Tax without selling the farm?\nLabour’s figures which they are using to try and justify this nonsense simply don’t add up. While the Treasury claims that “only” a quarter of farms will be affected, the Department for Environment, Food and Rural Affairs’ figures contradict this, showing it to be around two thirds of farms. I am fighting to get clarity on those figures. It is deeply concerning that the Chancellor has announced this Budget measure without seeming to check whether the figures used by the Treasury are indeed accurate. Is the Chancellor sure of the other figures used in her Budget?\nIn recent days, we have seen ministers give conflicting answers when pushed on these numbers – and even anonymous briefing suggesting an ongoing row between the two departments. Whilst they continue to argue in the Westminster bubble, farmers are having to make immediate decisions about whether they continue to build barns, buy new machinery and invest in their farm businesses for fear that any such investment will push them over the cliff edge of this tax raid. For a government that claims to want growth, this single decision is ant-growth and will set the sun on the rural economy.\nThe truth is that Labour don’t understand the countryside.\nThey are not part of our rural communities and worse, many don’t care about them. This is perfectly summed up by a Labour MSP last week. She was asked about the case of a farmer who is recovering from cancer. He has invested in a dairy, and she was asked how his son would pay the inheritance tax bill if he died. Her response? He should “put his affairs in order”.\nPerhaps this MSP has been taking lessons from former Labour adviser John McTernan, who stated on national television that farming is an industry “we can do without… we do not need small farmers.” Rural communities fear that these comments reveal a disdain within the Labour movement for the rural way of life and the people within it.\nOnce these family farms are gone, they are gone – and we will feel the consequences a long time after this Labour Government is removed from office. That is why thousands of farmers are leaving their farms on Tuesday, from all corners of the country, to try and force Labour to listen. This policy risks family farms, our food security and our countryside.\nWe Conservatives will be pulling on our wellies to stand alongside them.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-sets-out-her-reasons-voting-remain-european-union/content_7.html": "Last week our country suffered a terrible loss on what was a very dark day for democracy.\nMy thoughts and prayers are with the family, friends, colleagues and constituents of Jo Cox MP.\nIt is not easy to return to the issue we will face this Thursday in the wake of such hatred and violence, however we must.\nWe each have a momentous decision to make on Thursday. The result of the Referendum will decide our place in the world for generations to come.\nWhen the Prime Minister returned with his renegotiated deal, I approached the issue of whether to support the remain or leave campaigns with an open mind. I looked at the evidence and concluded that the case for remaining in Europe is stronger than for leaving. I shall deal with the main reasons for my decision in turn.\nTHE PRIME MINISTER'S DEAL\nThe UK has a unique status in the EU, thanks to the Prime Minister’s deal. We now have flexibility in our relationship with the EU, whilst remaining an important trading nation in the Single Market, which is the world's largest trading bloc. The new deal includes:\n• The United Kingdom is exempted from “ever closer union”, the Euro, Eurozone bailouts, the Schengen 'no borders' agreement, the refugee resettlement scheme and an European Army.\n• The pound is protected permanently, with safeguards against discrimination towards British businesses by the Eurozone.\n• We have an emergency brake to prevent EU migrants from having full access to our welfare system for 4 years, as well as limits being imposed on child benefit being sent to foreign countries.\nThe Prime Minister's deal is an irreversible international law decision that will come into effect as soon as Britain votes to remain in the EU on Friday.\nAnd don't forget that no British Prime Minister can give further powers to Brussels without a referendum – thanks to the Referendum Lock passed in the last Parliament.\nOUR ECONOMY\nToday, British businesses have full access to the European free trade area of 500 million people, bringing jobs, investment, lower prices and financial security, with safeguards against discrimination. This is the best trade deal of all – better than anything we could get outside of the EU.\nThe EU is the UK’s biggest single trading partner, worth more than £500 billion a year – that’s half of our total trade in goods and services.\nIn 2014, the EU accounted for 44% of UK exports of goods and services. In contrast just 8% of the EU’s exports came to the UK. This matters because any trade deal would be with the EU as a bloc, not with individual countries within the EU.\nWhat is the view of our businesses? Eighty one per cent of small businesses, the Federation of Small Businesses, the British Chamber of Commerce, the Confederation of British Industry, the Institute of Directors and the National Farmers Union, as well as major employers such as Rolls Royce, BT, Airbus, Ford, Hitachi, Honda and Marks & Spencer all urge us to remain in the EU. Why would we ignore their knowledge and experience?\nIn contrast, the Leave campaign has no plan for what will follow a vote to leave. They have no unified vision of the trade deal the UK should seek with the EU. Some campaigners recommend the Norwegian model, others recommend the Swiss model, and even Albania has been suggested as the economy we should be following! Some leavers want us to walk away from the Single Market completely and negotiate a new deal, but they can’t explain what it would be or how long it would take.\nThe truth is the EU will not give us a better deal than they have themselves.\nThis may feel like a long way from our part of Lincolnshire, but it is not. Leaving the EU will affect jobs, prices, mortgages and funding for public services. It is not a risk worth taking in my view.\nSOVEREIGNTY\nThe Leave campaign paints our Parliament – the Mother of all Parliaments – as being powerless and weak, cowering in the corner from the EU Commission, being told what to do. This is nonsense. It is not the House of Commons to which I am so proud to have been elected.\nThe Leave campaign makes the mistake of confusing sovereignty and power. They are different. From NATO to the International Monetary Fund, our sovereignty is pooled - but our power is strengthened - every time we join other countries in an international treaty or agreement because, by joining, we are agreeing to act as an alliance of nations, rather than on our own.\nThe most important fact about sovereignty is the European Communities Act 1972. This is the Act on which our membership of the EU rests. Only Parliament can repeal it – and if the country votes to leave, we will do so.\nThe 'faceless bureaucrats', the big businesses, the experts dismissed so contemptuously by the Leave campaign, none of them can stop me and other MPs from voting to repeal the European Communities Act 1972 if that is what we as a country decide.\nThat is sovereignty and power. It is control.\nSECURITY\nCriminals and terrorists do not respect national and local borders. Our relationship with our neighbours is vitally important because, if we don’t work together, the criminals will win.\nLeaving the EU means leaving the many agreements in place through which we share information and intelligence with our neighbours such as Europol and the European Criminal Records Information System (ECRIS).\nIt will also mean leaving the European Arrest Warrant regime. I used to prosecute criminals for a living. I drafted European Arrest Warrants to return criminals to the UK who had fled our country so that they would face justice here.\nThrough the European Arrest Warrant; we have removed more than 5,000 people from the UK and returned 675 suspects to the UK to face justice.\nIf we leave the EU, we will leave the European Arrest Warrant regime. Why would we vote to reduce the police's powers to bring criminals to justice?\nIMMIGRATION\nThe Leave campaign has confused control of our borders with control of the volume of immigration. We have control of our borders. Every time you fly into this country, your passport is checked. That is because we are not and will not be part of the Schengen ‘no borders’ agreement. We also make other checks, such as criminal records checks, to keep bad people out of our country.\nBut I think most people are concerned about the volume of immigration. Millions of people around the world are on the move. That is why Donald Trump wants to build a wall!\nVolume of immigration is something that the EU has to get a handle on and we are leading the way in Europe to achieve this. In his deal, the Prime Minister secured an emergency brake on immigration which will come into force if we remain in Europe, making sure that migrants pay in before they take out, with restrictions on benefits and stopping sham marriages. We also are not part of the EU’s quota scheme for asylum seekers.\nIt is not as simple to control volume of immigration as the Leave campaign suggest. In the event of a vote to leave the EU, we will have to renegotiate our trade agreement with the EU. If we want to trade as part of the Single Market it is clear that we will have to concede free movement of people in any deal that would give even the smallest protection to our economy. We know this because the Norwegian and Swiss deals, two models often recommended by the Leave campaign, have to accept Free Movement of People.\nAt the moment, our borders are safeguarded in Calais – an agreement that was made between fellow members of the EU. I am very concerned from my work on the Home Affairs Select Committee that if we leave the EU, that agreement will fall.\nAt the moment, we really have the best of both worlds. We have the freedom to work, live and travel around Europe, yet because we are not members of the Schengen agreement, we have preserved our own border security. When we have a labour shortage, for example when local farmers need help picking their crops, they rely on freedom of movement to employ the workers to do so.\nMYTH-BUSTERS\nI thought I would take this opportunity to tackle some myths that have arisen during the campaign:\nMyth no.1 – Turkey is going to join the EU soon\nThis is not correct. Turkey first asked to join in 1987, but since then it has only met 1 of the 35 conditions it needs to meet before it can apply to become an EU member. At that rate, Turkey will not be an EU member until the year 3031.\nEven if Turkey were to reach the standards set by the EU, any one nation in the EU could veto their joining. This means the British Prime Minister can veto this. Indeed, France has said it will have a referendum on this matter if it ever reaches that stage.\nMyth no. 2 – we are joining an European Army\nThis is another irresponsible claim from the Leave campaign. Our renegotiation makes clear that the UK will never be part of any EU army.\nNational security is a matter for national government; the UK consequently has a veto on any issue which would affect national defence policy.\nNato remains the cornerstone of our defence policy, but this is supported by our EU membership, which magnifies our influence in the world.\nThe President of the United States puts this very clearly;\n“The European Union doesn’t moderate British influence – it magnifies it. A strong Europe is not a threat to Britain’s global leadership; it enhances Britain’s global leadership’\nMyth no. 3 – \"Project Fear\"\nI believe people need to know that this is a serious decision for our country which carries a great deal of risk and uncertainty. Explaining this is not ‘Project Fear’.\nImagine that you are buying your dream home. You get a survey done by experts to check that the foundations are safe and the roof isn’t going to fall in.\nThe Leave campaign is asking us to invest everything we have without any reliable, credible assessment of the alternative. They are all too quick to dismiss the contribution of the multitude of experts who say the risks of this move are too great. I do not believe these experts are infallible, they are not always right – no one is – but why would we dismiss their expertise out of hand?\nThe Leave campaign is unable to answer the fundamental questions of what Britain’s relationship with the EU would look like if we leave. They refuse to accept what the economic impact would be on jobs, prices and businesses.\nMyth no. 4 – BMW and French wine makers will ensure we get a better deal from Europe\nWe will not be making individual trade deals with each separate country in the European Union. We will have one trade deal with the whole bloc of 27 nations. Will countries such as Spain prioritise the interests of German car manufacturers?\nThe Leave campaign claims that German and French politicians won’t ignore BMW and French wine makers when renegotiating with the UK. However, they – the leave campaign - are ignoring the 81% of small businesses, the Federation of Small Businesses, the British Chamber of Commerce, the Confederation of British Industry, the Institute of Directors and the National Farmers Union, as well as major employers such as Rolls Royce, BT, Airbus, Ford, Hitachi, Honda and Marks & Spencer who all urge us to remain in the EU.\nWhy do they ignore the experts, yet believe that German and French politicians would behave differently?\nMyth no. 5 – The UK loses votes in the Council of Europe repeatedly\nWe have the joint highest number of votes at the EU Council, and in the past 12 years the UK has been on the winning side in 97 per cent of votes in the EU Council.\nIf we left, we would have to accept all these rules with no say if we wanted access to the single market, meaning we risk being on the losing side 100% of the time.\nCONCLUSION\nOur special status in Europe gives us the best of both worlds. It means families across the UK get the benefits of staying in the EU, including more jobs, lower prices and greater security.\nWe are out of the parts of Europe that don’t suit us. We will never join the Euro and never be part of Eurozone bailouts, the Schengen 'no borders' agreements, a European Army or an EU super state.\nThe task of reforming Europe goes on but the benefits of being a member of the EU outweigh the costs.\nI want Great Britain to be the great success story of the 21st century and we can do that in our own right, whilst standing shoulder to shoulder with our friends and allies.\nLet’s lead Europe, not leave it.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_outcome-victorias-survey-public-vote-nuclear-waste-site/content_43.html": "Thank you to everyone who participated in my recent survey on Nuclear Waste Services' proposals for a Nuclear Waste Site in Theddlethorpe.\nBelow are the responses from the more than 350 people who completed the survey and live in the Search Area.\nDo you think there should be a public referendum on whether a nuclear waste facility should be built in Theddlethorpe?\n- 97% Yes\n- 3% No\nDo you feel you have enough information to vote in a referendum about whether a nuclear waste facility should be built in Theddlethorpe?\n- 89% Yes\n- 9% No\n- 2% Don't know\nWhen do you think a referendum about whether a nuclear waste facility should be built in Theddlethorpe should be held?\n- 90% Within 12 months\n- 3% Between 12 and 24 months\n- 1.4% In more than 2 years\n- 3% Other\n- 1.4% There should not be a referendum\n- 0.6% Don't Know\nWho do you think should be eligible to vote in a referendum about whether a nuclear waste facility should be built in Theddlethorpe?\n- 32% People living within 3 miles of the proposed site\n- 24% People living within 6 miles of the proposed site\n- 21% People living within 10 miles of the proposed site\n- 9% People living within 20 miles of the proposed site\n- 9% Anyone in Greater Lincolnshire\n- 4% Other",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_campaigns_opposing-nuclear-waste-dump-lincolnshire/content_9.html": "I have opposed the threat of a nuclear waste dump on the Lincolnshire Coast since the proposal came to light several years ago. In that time, residents have had to live with the uncertainty, worry and financial costs of having this monstrous carbuncle threatened in their area.\nHaving initially been looking at the brownfield site of the former gas terminal at Theddlethorpe, NWS are now looking at the land to the north of the A157, south-west of Gayton wind farm, between the villages of Gayton le Marsh and Great Carlton for the above ground part of the Waste site.\nThis means a potential site being less than five miles from the Lincolnshire Wolds Area of Outstanding Natural Beauty and could now be closer to the historic town of Louth than it is to the coast where the waste would actually be stored.\nWith an area of focus being identified, I was calling for a public vote this year, however welcome the news of the two local councils withdrawing from the Community Partnership, which will put an end to NWS looking at this site.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-visits-british-growers-association/content_29.html": "Last week, Victoria met the British Growers Association at their base in Louth. They discussed some of the challenges and opportunities for the future of the fresh produce sector.\nLast week, Victoria met the British Growers Association at their base in Louth. They discussed some of the challenges and opportunities for the future of the fresh produce sector.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-survey-when-have-public-vote-theddlethorpe-nuclear-waste-plans/content_84.html": "If you live in the Theddlethorpe area, please let me know your views about having a public referendum on whether a nuclear waste facility should be built in Theddlethorpe.\nI have met numerous local residents who have indicated to me that they would like a public vote on the proposed nuclear waste facility in Theddlethorpe to be held within the next 12 months. They want the uncertainty to stop and for local residents to be able to express their views transparently and clearly.\nI will back the call for a public vote within the next 12 months if this is the will of the majority of constituents in Theddlethorpe.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-speaks-support-women-politics/content_52.html": "Last week Victoria joined The Rt Hon. Theresa May, Secretary of State for the Home Department, in offering support to women who are interested in entering the world of politics, at local and national level.\nVictoria addressed the event hosted by Women2Win after the Home Secretary, sharing with the audience her experiences since May 2015 and her hopes for the young people in her constituency.\nVictoria said,\n“It was a privilege to discuss the role of women in politics with the longest-serving Home Secretary, who is also the most senior woman in Government.\nWith this in mind I will be opening a competition in the coming weeks in honour of International Women’s Day for a young female student from Louth & Horncastle to shadow me in the House of Commons for the day.\nFor further details do email me at [email protected] “",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-speaks-lincolnshire-mayoral-candidate-about-nuclear-waste-dump-proposals/content_79.html": "Following the NWS consultation event in Great Carlton yesterday, Victoria spoke with the Conservative Candidate for Lincolnshire Mayor, Rob Waltham, about why this was being proposed. You can watch this here.\nFollowing the NWS consultation event in Great Carlton yesterday, Victoria spoke with the Conservative Candidate for Lincolnshire Mayor, Rob Waltham, about why this was being proposed. You can watch this here.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_campaigns_protecting-our-constituency-flooding/content_46.html": "Flooding can have an absolutely devastating impact on everyone who experiences it, be it residents, businesses or farmers. Protecting our constituency from flooding is therefore a priority for me.\nFlooding can have an absolutely devastating impact on everyone who experiences it, be it residents, businesses or farmers. Protecting our constituency from flooding is therefore a priority for me.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_category_Media/content_31.html": "Victoria speaks to the Louth Leader about the challenges local farmers are facing under the Labour Government 7th April 2025 Recently Victoria spoke to the Louth Leader and Horncastle News about the challenges facing the farming sector since the new Government came to power. You can... ArticlesMedia\nVictoria Speaks on Lorraine 24th June 2024 It was lovely to chat with Lorraine this morning about the upcoming election and on my work as Health Secretary championing women’s health. Media\nAppearance on \"The Spectator's Women with Balls\" podcast. 20th July 2022 It was a pleasure to once again sit down with Katy Balls on The Spectator's Women With Balls podcast to discuss recent events. The podcast is available on Apple... Media\nVictoria speaks to BBC Radio Lincolnshire about Nuclear Waste Proposals 29th July 2021 Victoria was interviewed by BBC Radio Lincolnshire about proposals for a nuclear waste dump in Theddlethorpe. You can listen to this online here. Local NewsMedia\nOpening a modern slavery safe house in North London 10th February 2019 Victoria Atkins, Member of Parliament for Louth and Horncastlle and Minister for Crime, Safeguarding and Vulnerability, recently visited a newly-opened North... Media",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_campaigns_tackling-crime/content_81.html": "I will back our police by supporting measures to equip our officers with the powers and tools they need to keep themselves and all of us safe. I will lobby for more support to tackle rural crime and press for measures to tackle violence against women and girls.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-writes-education-secretary-about-adoption-and-special-guardianship-support-fund/content_47.html": "Victoria has today written to the Secretary of State for Education to ask that they urgently provide clarity about the adoption and special guardianship support fund.\nWith the fund shortly due to expire, she is asking for urgent detail to be given on this and will provide the response once it has been received.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-presents-award-nhs-parliamentary-awards/content_58.html": "\"It was an honour to present the award for Excellence in Emergency and Urgent Care at the #NHSParlyAwards yesterday, which celebrated the amazing work being carried out across our NHS services.\nI'd also like to give a special mention to the Lincolnshire Health & Care Apprentice Centre, which I was proud to nominate for The Excellence in Education and Training award.\"",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_parliament/content_56.html": "Sewage | Commons debates On a point of order, Madam Deputy Speaker. Labour Back Benchers should know this by now. The hon.\nSewage | Commons debates On a point of order, Madam Deputy Speaker. Labour Back Benchers should know this by now. The hon.\nSewage | Commons debates On a point of order, Madam Deputy Speaker. Labour Back Benchers should know this by now. The hon.\nSewage | Commons debates I am very happy to give way if the hon. Lady is going to support and carry on our work—delighted, in fact.\nSewage | Commons debates I respect the fact that this is the Liberal Democrats’ Opposition day debate, so I have been cutting parts out of my speech.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_category_Westminster-News/content_10.html": "Victoria writes to the Education Secretary about the Adoption and Special Guardianship Support Fund 27th March 2025 Victoria has today written to the Secretary of State for Education to ask that they urgently provide clarity about the adoption and special guardianship support... Westminster News\nVictoria Speaks After Family Farm Tax Rally 7th March 2025 Earlier this week I joined farmers in protesting Labour’s immoral Family Farm Tax, which is harming growth and risks increasing food bills for us all. The... Westminster News\nVictoria Joins Farmers on Pancake Day March Against Family Farm Tax 4th March 2025 Today I join farmers in Westminster calling on the Labour Government to Axe the Family Farm Tax. See my video here. Westminster News\nVictoria Atkins MP Statement on the Terminally Ill Adults (End of Life) Bill 29th November 2024 Thank you to the constituents who have written to me recently with their thoughts on this piece of legislation. I have read every letter and email, and assure... Westminster News\nVictoria's Speech in Rural Affairs Debate 11th November 2024 A transcript of the speech Victoria gave in the 11 November 2024 debate on rural affairs. Speeches in ParliamentWestminster News\nVictoria attends Breast Cancer Campaign event 18th October 2024 Earlier this week, Victoria attended an event hosted by Estee Lauder’s Breast Cancer Campaign. Alongside hearing about their research, we also heard about the... Westminster News\nVictoria Atkins MP presents award at NHS Parliamentary Awards 15th October 2024 \"It was an honour to present the award for Excellence in Emergency and Urgent Care at the #NHSParlyAwards yesterday, which celebrated the amazing work being... Westminster News\nVictoria Atkins MP's Winter Fuel Payments Survey 13th September 2024 Labour’s first move in Government has caused outrage with their plan to remove the Winter Fuel Payment this year from 26,570 pensioners in our constituency... Westminster News\nVictoria Joins MND Campaign on Winter Fuel Payment 12th September 2024 Victoria has joined the Motor Neurone Disease Association in writing to the Chancellor about what the loss of the Winter Fuel Payment means for people with... Westminster News",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_about-victoria/content_8.html": "I consider myself lucky to have both northern and southern roots. I was raised in a market town in Lancashire, about the size of Horncastle. I went to school in Blackpool and could hear the screams from the Pleasure Beach whilst sitting in class!\nI was the first member of my family to go to university, reading law at Cambridge University. I wanted to be a criminal barrister, so went to the Capital of Crime - London - to practise. I specialised in prosecuting serious organised crime.\nIt was a privilege to represent the decent, law-abiding majority in my work prosecuting hardened criminals. I have prosecuted international drug trafficking rings, gun-runners and fraudsters who steal £100s million from British taxpayers. I am one of only 30 advocates in England and Wales appointed to the prestigious Attorney General’s Regulators Panel and the Serious Fraud Office’s List of specialist fraud prosecutors. I hope to put my experiences in the criminal courts to good use in the political world.\nI was first elected in 2015 and re-elected in 2017, 2019 and most recently in 2024. I have spoken up for the constituency of Louth & Horncastle on a range of issues, including the provision of rural broadband, defence, wind turbines, coastal issues, roads, schools, the health service and the importance of the rural way of life.\nI have hosted public meetings including on pylon proposals, a Jobs & Apprenticeships Fair, Older People's Fair, Community Summits, Flood Forums and a Broadband Summit. I meet regularly with constituents and I have enjoyed visiting schools, businesses, farms and attending community events.\nMy husband Paul works for a food company. We like to spend what little spare time we have going to running around after our son, Monty, building sandcastles on the beautiful Lincolnshire coastline and pulling our boots on to walk the Wolds.\nIn November 2024, I was pleased to be appointed Shadow Secretary of State for Environment, Farming and Rural Affairs. In this role, I want to hold this government to account on the serious and urgent challenges of food security, climate change, flooding and the survival of family farms.\nPrevious Political Roles\n- In November 2017, I was delighted to be appointed to the Home Office, a team whose central purpose is to keep the people of this country safe and secure\n- In September 2021, I moved to the Ministry of Justice where I was able to carry on this work.\n- At the start of 2018, the centenary year of some women gaining the right to vote for the first time, it was an honour to be Minister for Women between 2018-2020.\n- I was further honoured in October 2022 to be appointed as the Financial Secretary to the Treasury working in government to stabilise the markets and build a bright future.\n- In November 2023, I was thrilled to become the Secretary of State for Health & Social Care. My belief in our National Health Service, and its founding principles, is one of the reasons I came into politics and as Secretary of State my agenda was simple – to make the NHS and our social care system simpler, faster and fairer.\n- Following the July 2024 General Election, I maintained scrutiny of these important principles in opposition as Shadow Secretary of State for Health and Social Care.\n- I am now proud to serve HM Loyal Opposition as the Shadow Secretary of State for Environment, Food and Rural Affairs.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-statement-terminally-ill-adults-end-life-bill/content_80.html": "Thank you to the constituents who have written to me recently with their thoughts on this piece of legislation. I have read every letter and email, and assure you that your views, beliefs and experiences have formed part of my considerations.\nI would also like to thank the constituents who have contacted me about this issue since I was first elected in 2015. I have met several families over the years who have wanted to share their very difficult and emotive experiences with me. I thank you sincerely for this insight into your personal grief and anguish; your stories have stayed with me and have also formed part of my considerations.\nI have attended evidence sessions by campaigners for both sides of the debate, including Liz Carr and Rebecca Gillanders, and read the campaigns’ documentation carefully. I am struck by how thoughtful and thought-provoking their work has been and thank both campaigns for the way in which this discussion has been conducted.\nI also wanted to listen to the debate today in Parliament. This is, after all, why we have debates as part of the legislative process - to question, to justify, to persuade. I wanted to see how questions raised about the legislation would be addressed by those who support it, as well as how the challenges of maintaining the status quo would be answered by those who oppose it.\nThis was the second reading of the Bill which is when MPs decide whether the contents of a Bill should continue to be debated or stopped in its tracks. It does not mean the Bill becomes law today or that it will inevitably become law: there is more scrutiny - and the power to stop the Bill - in future stages.\nHaving considered all of these factors, and that a significant proportion of the public want to have this national conversation, I have concluded that this debate should continue and should not be cut short at this stage. I have therefore decided to vote for the Bill at second reading so as to enable the debate to continue.\nI reserve my position, however, for Report Stage and Third Reading (the final stage in the Commons before it goes to the House of Lords). There needs to be further scrutiny and answers, including the examples provided to me by constituents where they or a loved one were given six months to live only to survive many years later: how would the proposed process be halted in such cases? Fears have also been expressed by many of my constituents about the expansion of the Canadian model: how will “a slippery slope” be prevented in the UK? And an understandable concern is whether the safeguards in the Bill are sufficient to prevent and detect coercion?\nAnd those who oppose the Bill must not rely on misleading claims about the NHS. If the Bill is passed, the NHS will adapt and systems will be set in place. The NHS exists to serve patients, not the other way round.\nI will consider carefully the next stages of the Bill and will continue to welcome correspondence from my constituents on this important matter.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-response-participants-wragby-phone-signal-survey/content_19.html": "Thank you everyone in Wragby who took the time to respond to my recent mobile signal survey. I’ve now collated all of your feedback regarding the ongoing mobile signal issues and shared it directly with Openreach and the major mobile network providers. I’ve urged them to prioritise improvements in our area and am pressing for a clear timeline on when you can expect better coverage.\nI’ll keep everyone who contributed to the survey updated on any progress and will be holding them to account to deliver the reliable service we need.\nIf you live elsewhere in the constituency and are experiencing a poor mobile signal, please do get in touch with my office. I want to ensure our providers know exactly where improvements are still needed. Please do so by emailing [email protected], or by calling my office on 02072195897.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-speaks-after-family-farm-tax-rally/content_13.html": "Earlier this week I joined farmers in protesting Labour’s immoral Family Farm Tax, which is harming growth and risks increasing food bills for us all.\nThe Conservative Party stands with farmers and will axe this tax. \"We won’t back down!\"\nYou can see my video from the day here.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_breaking-barriers-women-standing-parliament/content_28.html": "Earlier in the week, Victoria Atkins MP contributed to an important Westminster Hall on barriers to women standing for Parliament.\nIt was thoughtful debate addressing issues of selection, election and the workings of the House to see what more we can do to make the political arena more friendly to women from a diverse range of backgrounds and their families.\nPlease follow this link to watch the full debate: https://goo.gl/LwFr2y.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_domestic-abuse-bill-has-passed/content_82.html": "THE DOMESTIC ABUSE BILL HAS PASSED!!!\nAfter 3 years of scrutiny, debate and hard work, this landmark Bill will become law, helping millions of victims. There are so many people to thank, from victims, the DA Commissioner and DA charities, to the Home Office team, other govt officials and parliamentary colleagues, including Minister Alex Chalk and whip Tom Pursglove MP.\n.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_eu-referendum-result/content_90.html": "The people of Britain - and Louth & Horncastle - have spoken clearly and I respect that result.\nAlthough I was in favour of our continued membership of the European Union, mine was just one vote like that of everyone else.\nThe task ahead of me now is to play my part in maintaining the United Kingdom, in continuing to rebuild our economy and to represent the expressed views of my Constituents in effecting the disengagement of the UK from the EU in the most beneficial manner for all of us.\nIt will largely happen under a new Prime Minister and I wish to record my thanks to David Cameron for his leadership and achievements, not least in implementing the pledge to let the voters decide on our future in Europe.\nThey have now done so and I shall do my very best to abide by their wishes.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-receives-response-lincolnshire-icb-about-overnight-end-life-care-contract-changes/content_2.html": "The response from Lincolnshire ICB to Victoria about their end-of-life care contract is below. Victoria will continue to monitor this and please do get in touch if you experience any problems as a result of these changes.\nThe response from Lincolnshire ICB to Victoria about their end-of-life care contract is below. Victoria will continue to monitor this and please do get in touch if you experience any problems as a result of these changes.\n| Attachment | Size |\n|---|---|\n| 202504 Marie Curie.pdf (154.81 KB) | 154.81 KB |",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_pharmacies-launch-codeword-scheme-offer-lifeline-domestic-abuse-victims/content_92.html": "Yesterday, I visited Boots to launch our new 'Ask for Ani' scheme.\nVictims of domestic abuse will be able to access support at Boots and 257 independent pharmacies across the UK. This is about providing another avenue of support to victims who can often find it difficult to seek help from their perpetrators.\nFor independent pharmacies that would like to join the scheme, there is an on-going sign-up process open to all pharmacies.\nTo find out more visit https://www.gov.uk/government/news/pharmacies-launch-codeword-scheme-to…",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-attends-consultation-event-great-carlton-proposed-nuclear-waste-site/content_26.html": "No nuclear waste dump in Lincolnshire! The message is clear from Theddlethorpe to the villages of Gayton Le Marsh and Great Carlton and surrounding areas: our Lincolnshire coastline and countryside must not be scarred with this monstrous carbuncle.\nYesterday I visited the new proposed site to see for myself the green fields and homes between Great Carlton and Gayton le Marsh now subject to this threat. I also joined constituents in Great Carlton to make clear our opposition at a Nuclear Waste Services consultation event. I was joined by our Conservative Candidate for Lincolnshire Mayor, Rob Waltham, and our local County Councillor, Dan McNally to show our unity in opposing these plans.\nWe met one of the local farmers who farms the land which is earmarked for NWS’s proposals. It was clear from our conversation that this land is productive and plays a vital role in producing the food we eat. The damage to productive agricultural land in this area and in the construction of rail and road links will be enormous - yet there is no sign that this loss has been understood or included in the national food security debate.\nThe anguish, shock and worry amongst constituents is palpable. Residents had no idea that this site was being considered; even after I forced NWS to announce their expanded search site in November last year, no meaningful engagement with the local community occurred.\nThere are many questions remaining such as why this waste is not kept in Sellafield where the majority of it is produced, rather than transporting it across the country? Why NWS has moved the site further inland onto productive agricultural land? How and when will the test of public support be held?\nThe financial and emotional impacts on residents are immediate - I was told that a house sale in the area has already fallen through as a direct result of this announcement. Others spoke of their fears that they will not be able to sell their homes in the future. I am taking this up with NWS on their behalf.\nEnough is enough. The local people whose lives are being blighted by these proposals need to be given their say this year.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-writes-lincolnshire-icb-about-overnight-end-life-care-contract-changes/content_33.html": "Victoria has recently written to NHS Lincolnshire Integrated Care Board to raise concerns about the removal of the overnight end-of-life care contract from Marie Curie and the impact this may have for patients. Victoria will update constituents once she has received a response from the ICB.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_westminster-hall-debate-surgical-mesh-implants/content_22.html": "This morning Victoria Atkins MP contributed to an important debate giving a voice to those affected by complications from surgical mesh implants.\nShe raised the case of a constituent who developed debilitating pain from nerve damage and fibromyalgia as a result of her mesh surgery. As the debate highlighted, many women have suffered in silence with these conditions. Please do not hesitate to get in touch if you have been affected. Victoria's email address is [email protected].\nTo watch the full debate please click here. Please note that it contains graphic descriptions of surgery and medical issues.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-speech-rural-affairs-debate/content_54.html": "From the arable fields outside my front door to the cattle and horticulture that stretch from the fens, the wolds and the marshes to the coast, my constituency feeds the country. I am delighted and determined to bring some of my county’s common sense and love of the countryside to this important portfolio. On Armistice Day, I pay tribute to the fallen, and particularly to the farmers who stayed behind to feed the nation in wars gone by.\nThis is a critical time for our rural way of life. After years of unforgiving weather, rising commodity prices and more crop and livestock diseases, our farmers now face a new threat: a city-dwelling, socialist Government who do not understand or care for the rural way of life. The evidence is there in Labour’s first Budget, for which it had 14 years to prepare. In this Budget of broken promises, the Chancellor laid careful plans to break the farming sector, the wider rural economy and our food security. Farmers look after 70% of the UK’s land. They are the keystone of our rural communities. When they struggle, our rural economy is weakened and our food security is put at risk.\nToday, as the consequences of this Budget are becoming clearer, I will focus solely on the rural economy, but I make this promise to the Secretary of State: in the future, I will be pressing him and his Government on rural infrastructure, flooding, crime, healthcare, broadband and mobile signals, the solar and wind industries and other matters that affect our countryside, because the impact of this Budget and the choices Labour has made will be felt for years after his expensive wellies have worn out.\nI am going to focus on three broken promises by Labour; I am going to make it simple for them. The first broken promise for farming families is the removal of the tax relief that has meant families can pass on their farms to the next generation: agricultural property relief and business property relief. These are not loopholes, as they were described by the city-dwelling Chancellor, but careful tax policy planning developed over many years to prevent family farms and businesses from being split up and sold off. Of course we support efforts to root out abuse of the tax system, but the way in which the Chancellor has designed this policy means that it is tenant farmers and farmers in the middle who will struggle, not the very wealthiest.\nThis morning, I asked farmers on social media to send me details of how the policy will affect them and their businesses, and it makes for anguished reading. Farmers are furious, anxious and even distressed about the changes. They feel that the Government are coming after them and their families’ livelihoods, when all that they and their ancestors have done is work hard, follow the rules and feed us. I have been inundated with messages about tenant farmers, whom the Government seem to have forgotten. A Welsh landowner has contacted me to say that this change in policy will mean that he must tell six multigenerational farming families on his land that he will have to sell their farms to pay Labour’s family farm tax. As he put it, “they will lose their homes, businesses and their children’s futures”.\nCan the Minister please explain what those six tenant families are to do when their farms are sold?\nAn example of how the measure will affect landowning families is provided by a family who have worked their 500-acre farm for four generations. The farm is owned by the mother, who is in her 70s, and her two sons, who are in their late 40s and early 50s, their father having died a few years ago. They make an annual income of around £45,000. When the mother dies, the sons will face an inheritance tax bill of at least £870,000. There is no way in which they can pay that bill without selling their farm. Could the Minister advise the House how that family are to pay Labour’s tax bill without selling their farm?\nAs a fifth-generation farmer put it to me this morning: “Would you want to work somewhere that you knew over your lifetime was going to be taken away bit by bit?”\nAnother has urged us to “fight this vindictive, illogical and ideologically driven tax”.\nJust before I began my speech, in response to the Secretary of State’s speech, I received this message from another farmer: “So long as mum dies before March 2026, we’re okay”. Yet the farming Minister and the Secretary of State seem to think that these worries are exaggerated. Indeed, the farming Minister got a ripe old reaction when he said words to that effect at today’s poultry conference.\nWhen we warned in June that a Labour Government would do this, the Secretary of State said that such warnings were “desperate nonsense” and accused us of lying. This followed the assurances he gave in December that Labour would not change this policy. So that is a broken promise. He is doing the exact opposite of what he said. How can rural communities trust him in the future?\nThe Secretary of State has given some helpful advice to farmers, however. He has told them that they will have to “learn to do more with less”. Labour has not said the same to train drivers, resident doctors or their other union friends. Indeed, pensioners and family businesses will be the ones paying for these public sector pay rises.\nNot only do some farmers have mortgages, but we know tenant farmers worry that their farms will be sold off, so that the landowners can enter into what some call a “greenwashing” agreement with corporates, in order to plant trees and gain access to green funds. One should not make the mistake of assuming that this ill-thought-through policy will lead to cheaper land prices: the maths on that is almost as bad as the Chancellor’s cockeyed accounting with her economic inheritance.\nLet me tackle the ideology of this policy, reiterated by the Secretary of State during this debate, which is matched by Labour’s incompetence. First, the Chancellor herself does not seem to know the threshold at which her policy kicks in and whether spouses can transfer their allowances. Indeed, the Secretary of State does not seem to know that either. The Chancellor has said that the allowances can be transferred, yet Treasury documents supporting her Budget say that they cannot. Will the Minister clarify whether the Treasury’s documents are wrong or the Chancellor is wrong?\nSecondly, will the Minister explain why this Government have targeted only British-owned farms and businesses with this tax hike? Companies operating here but owned overseas, private equity-owned businesses and public companies listed on stock markets will not have to pay Labour’s tax; it is just British families.\nThirdly, the Chancellor—and, indeed, just now, the Secretary of State—gave assurances that only a quarter of farms will be affected, but that is not backed up by the data from the Secretary of State’s own Department. DEFRA figures show that, in fact, these changes will affect two thirds of farms—some 66%. Will the Minister explain that discrepancy and what he has done personally to confirm those figures, so that he ensures he gives only accurate information to the House?\nThe immediate impact of the changes is that farmers are already stopping capital investments in machinery, systems and buildings for fear that any improvements to their farms will send them over the cliff edge into this tax trap. So for a Government that claim to want to grow the economy, their choices are achieving the exact opposite. This family farm tax is a broken promise that will break family farms.\nI move now to the second broken promise: the accelerated reduction in delinked payments. From next year, those vital payments will be substantially less than farms were promised. They cannot have foreseen that when they made their business plans. A tenant farmer has told me that he does not know how he is going to pay his rent next year, because the drop is worth more than £20,000. Can the Minister explain how this farmer should do more with less?\nThe third broken promise is the hike in national insurance for employers, of course. As the OBR has said, an increase in employer NICS will be passed “entirely” on to working people. I know that Labour does not actually know who it means by “working people” but the Conservatives are clear that it definitely includes farmers, their staff and the small businesses that support them, day in, day out.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-joins-mnd-campaign-winter-fuel-payment/content_66.html": "Victoria has joined the Motor Neurone Disease Association in writing to the Chancellor about what the loss of the Winter Fuel Payment means for people with motor neurone disease.\nPeople suffering from MND face disproportionate financial pressures as they lose the body’s natural insulation due to muscle wastage.\nYou can read more here.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mps-winter-fuel-payments-survey/content_30.html": "Labour’s first move in Government has caused outrage with their plan to remove the Winter Fuel Payment this year from 26,570 pensioners in our constituency.\nPensioners in the Louth & Horncastle constituency shouldn’t have to choose between heating and eating this winter. The decision is already being criticised by leading organisations, including AgeUK, for putting pensioners’ health and safety at risk.\nThat’s why I’m campaigning to put a stop to Labour’s damaging cash-saving move.\nPlease use this survey to share your thoughts with me on this important issue.\nIf you or someone you know needs support, please contact my office by emailing [email protected] or calling 02072195897 or 01507 527017.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-visits-grainthorpe-junior-school/content_23.html": "Yesterday, Victoria visited Grainthorpe Junior School.\nShe was given a tour by two of the students and had a chance to see some their excellent facilities and watch their two classes at work. After this, she had a question and answer session with the school council, which produced some very difficult questions, ranging from important local campaigns, to her favourite foods.\nThe visit ended with an invitation for the school to visit the House of Commons in the future.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-hosts-2024-community-summt/content_32.html": "Today I hosted a Community Summit for organisations throughout our constituency to come together, network and share information.\nI ran a session focusing on support for pensioners as I know many people are very worried about coping with the loss of their winter fuel payment and it was useful to hear about where local organisations are stepping in to provide support for these vulnerable pensioners.\nThere was then a session after this on support for families and the wider community. I was deeply concerned to hear how many of our organisations are worried by the new government’s changes to national insurance, which is why I have previously written to the Treasury on this issue and will continue to push for answers about how the government will shelter our charities and community organisations from this huge financial blow.\nI’d like to thank everyone who came along to the Summit and contributed, I’m delighted to hear that so many people found it to be so useful and I look forward to sharing more detail of what came out of this in the near future.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_opening-modern-slavery-safe-house-north-london/content_69.html": "Victoria Atkins, Member of Parliament for Louth and Horncastlle and Minister for Crime, Safeguarding and Vulnerability, recently visited a newly-opened North London safehouse for victims of modern slavery.\nA tree was planted to mark the opening of the facility, and was accompanied by Desmond Tutu's poignant words: ''Hope is being able to see that there is light despite all of the darkness.''\nVictoria commented, ''It was a privilege to open the safe house and to speak to staff about the tireless work that they do.''\n''The Government is committed to ending this horrendous crime, and I thank all the staff at the safe house for their tremendous work in supporting the victims affected.''",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-article-food-security-and-farming/content_71.html": "“This lake was my family farm a few days ago” said Henry last year as we stood looking out at a vast area of water that Storm Babet had thrown onto prime agricultural land in my Lincolnshire constituency. This scene, and the other flooded farms I visited that day, highlighted some of the challenges that farmers face and over which they have no control, from catastrophic weather to international commodity price inflation.\nThose few words hinted at the emotional toll that this vocation can take on the people who grow our food for us. Farmers pride themselves on their resilience – they know the knocks and are raised from the cradle to always look for a Plan B – but we must not take them or their livelihoods for granted.\nSadly, this is a serious mistake that Labour has made in their Budget. Their lack of understanding of the realities of farming was revealed in the crass decision to slash years of careful tax policy to keep family farms intact and protected from inheritance tax. By removing agricultural and business property reliefs, and setting an artificially low threshold, they have consigned family farms and businesses to being sold off and split up as families cannot afford massive tax bills.\nSteve Reed, MP for Croydon and the current Defra Secretary, say only 500 farms a year will be affected because the tax is to be charged on farms worth over £1 million. But, in doing so, he betrays a basic lack of knowledge about the countryside.\nThe price of a hectare on paper does not mean that the farmer is cash-rich. Farmers and their families have to absorb price and supply chain shocks, as well as risks such as crop or livestock diseases, and their farm properties may be decades or even centuries old. Their salaries and their savings may be modest. And so that figure of £1 million may seem a lot in a ministerial policy paper but it will not stretch very far on the ground in many parts of this crowded island where land and homes are expensive.\nIt is also puzzling as, before the election, Labour ruled out changing this policy, describing such a suggestion as “desperate nonsense”. Why did they say one thing before the election and now do the opposite? And when the Defra Secretary wrote in The Telegraph recently that “food security is national security”, did he know of his Chancellor’s plan to risk family farms?\nMuch like Labour’s jobs tax or their 1970s-style union laws, Labour ministers either do not care about the consequences of their policies, or just have not thought them through. If farmers have to set aside money for a potential tax raid rather than investing in the farm, it will no doubt impact food production, increase prices and make British farmers less competitive.\nIt will make us more reliant on imports, just at the exact time we should be doing the opposite. Despite the chorus of opposition from the food industry, ministers still seem intent on ignoring the experts and dogmatically ploughing on.\nA year later, the floodwaters have receded from Henry’s farm but the ground is soggy and we will all be watching the winter weather as closely as the winter wheat. I am proud to represent a highly productive agricultural constituency in Lincolnshire, the bread basket of our country. It is why I asked Kemi Badenoch, the new leader of the Conservative Party, to appoint me as shadow secretary of state for the environment, food and rural affairs, to support our rural and coastal communities and the environment. I will pull my (old) Hunter boots on and hold this socialist, city-dwelling government to account to protect our farms of the future.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_over-50-pharmacies-uk-now-use-ask-ani-scheme/content_96.html": "A year ago I launched the codeword scheme \"Ask For ANI\". Now over 50% of all pharmacies across the UK, including Boots, Superdrug and Lincolnshire Co-op Pharmacy have joined the scheme.\nIn its first year, the scheme has provided emergency support to at least 100 victims.\nI would like to thank all the members of staff across the UK who are helping domestic abuse victims and their families.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news/content_3.html": "Victoria receives response from Lincolnshire ICB about overnight end-of-life care contract changes Tuesday, 29 April, 2025 The response from Lincolnshire ICB to Victoria about their end-of-life care contract is below. Victoria will continue to monitor this and please do get in touch if you experience any problems as a result of these changes. Local News\nVictoria's response to participants of the Wragby Phone Signal Survey 25th April 2025 Thank you everyone in Wragby who took the time to respond to my recent mobile signal survey. I’ve now collated all of your feedback regarding the ongoing mobile... Local News\nVictoria speaks to the Louth Leader about the challenges local farmers are facing under the Labour Government 7th April 2025 Recently Victoria spoke to the Louth Leader and Horncastle News about the challenges facing the farming sector since the new Government came to power. You can... ArticlesMedia\nVictoria visits Louth Livestock Market to discuss challenges for the agricultural communities and ideas for the future 4th April 2025 Today, I was pleased to be at Louth Livestock Market, which is such a pillar in our local community to hear ideas on building a bright future for our... Local News\nVictoria writes to Lincolnshire ICB about overnight end-of-life care contract changes 4th April 2025 Victoria has recently written to NHS Lincolnshire Integrated Care Board to raise concerns about the removal of the overnight end-of-life care contract from... Local News\nVictoria Atkins MP Visits British Growers Association 31st March 2025 Last week, Victoria met the British Growers Association at their base in Louth. They discussed some of the challenges and opportunities for the future of the... Local News\nVictoria writes to the Education Secretary about the Adoption and Special Guardianship Support Fund 27th March 2025 Victoria has today written to the Secretary of State for Education to ask that they urgently provide clarity about the adoption and special guardianship support... Westminster News\nVictoria visits Grainthorpe Junior School 25th March 2025 Yesterday, Victoria visited Grainthorpe Junior School. She was given a tour by two of the students and had a chance to see some their excellent facilities and... Local News\nVictoria's statement on the end of the Nuclear Waste Dump 19th March 2025 I am pleased and relieved that Lincolnshire County Council is withdrawing from the Community Partnership that had been looking at building a nuclear waste dump... Local News\nVictoria's Statement on North Sea Collision 12th March 2025 The collision in the North Sea yesterday has shocked and worried us all. My thoughts are with those on board, especially the family of the missing crew member... Local News",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_campaigns_improving-health-and-social-care/content_12.html": "I've been campaigning for better health and social care in our area, from the future of our hospital, to individual health conditions that affect residents of the constituency of Louth & Horncastle.\nThe response from Lincolnshire ICB to Victoria about their end-of-life care contract is below. Victoria will continue to monitor this and please do get in touch if you experience any problems as a result of these changes.\nVictoria has recently written to NHS Lincolnshire Integrated Care Board to raise concerns about the removal of the overnight end-of-life care contract from Marie Curie and the impact this may have for patients. Victoria will update constituents once she has received a response from the ICB.\nVictoria today signed a joint letter to the Chancellor of the Exchequer sent by Dr Caroline Johnson MP. The letter calls for the Charity to be exempted from the increase in National Insurance that Labour have introduced as part of their recent budget.\n\"It was an honour to present the award for Excellence in Emergency and Urgent Care at the #NHSParlyAwards yesterday, which celebrated the amazing work being carried out across our NHS services.I'd also like to give a special mention to the Lincolnshire Health & Care Apprentice Centre, which I wa\nI was honoured today to deliver the keynote speech at the ‘Pathways to Research and Innovation’ conference hosted by Lincolnshire Community Health Services and United Lincolnshire Hospitals Trust.\nVictoria has joined the Motor Neurone Disease Association in writing to the Chancellor about what the loss of the Winter Fuel Payment means for people with motor neurone disease.\nI met with representatives from the Lincolnshire Integrated Care Board and the East Midlands Primary Care Team yesterday to discuss the delays in the opening of the Mablethorpe Dental Practice.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_weve-secured-nearly-ps1m-east-lindseys-drainage-boards/content_86.html": "Alongside other Lincolnshire MPs, I have been campaigning for more funding for our drainage boards, which do such important work protecting our area from flooding.\nI'm pleased the government has acknowledged the exceptional pressure that East Lindsey District Council has been under this year to meet the unprecedented rise in energy costs associated with funding our local drainage boards.\nThe funding has come out of a one-off £3 million grant announced yesterday by the Department for Levelling Up, Housing and Communities. The £3m is being shared between 15 local authorities, with almost a third of the total - £927,373 - coming into East Lindsey!\nThis funding is great news for Council Tax payers in East Lindsey and a testament to the great work that the leadership of ELDC has undertaken to make this case to the government.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_map-locations/content_24.html": "This map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_speaking-serious-violence-debate/content_40.html": "Victoria Atkins, Member of Parliament for Louth and Horncastle, spoke in Mondays debate on serious violence, highlighting the work that the Government is undertaking to tackle this crime.\nVictoria Atkins, Member of Parliament for Louth and Horncastle, spoke in Mondays debate on serious violence, highlighting the work that the Government is undertaking to tackle this crime.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_taking-police-crime-sentencing-and-courts-bill-through-commons/content_83.html": "The Police, Crime, Sentencing and Courts Bill passed through the UK House of Commons yesterday, delivering on our promises to take measures to make our society safer and to crack down on crime.\nThe Police, Crime, Sentencing and Courts Bill passed through the UK House of Commons yesterday, delivering on our promises to take measures to make our society safer and to crack down on crime.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_campaigns/content_75.html": "Opposing a Nuclear Waste Dump in Lincolnshire I have opposed the threat of a nuclear waste dump on the Lincolnshire Coast since the proposal came to light several years ago. In that time, residents have had...\nProtecting our Constituency from Flooding Flooding can have an absolutely devastating impact on everyone who experiences it, be it residents, businesses or farmers. Protecting our constituency from...\nStanding up for our Rural Communities I have always been a committed advocate for our rural, farming and agricultural communities and will always ensure their voice is heard in Westminster.\nObjecting to National Grid's On-Shore Pylon Proposal for Lincolnshire I object to National Grid’s proposal for 140km of overhead lines being treated as the default option for Lincolnshire. We deserve to be able to have a...\nTackling Crime I will back our police by supporting measures to equip our officers with the powers and tools they need to keep themselves and all of us safe. I will lobby for...\nChampioning our Local Economy I have been promoting our local economy in our area, from meeting and speaking to local business owners, to hosting an online jobs and careers fair, and calling...\nImproving health and social care I've been campaigning for better health and social care in our area, from the future of our hospital, to individual health conditions that affect residents of...",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_cookies/content_17.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_about-rss/content_61.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-statement-end-nuclear-waste-dump/content_78.html": "I am pleased and relieved that Lincolnshire County Council is withdrawing from the Community Partnership that had been looking at building a nuclear waste dump on the Lincolnshire East Coast.\nI know how difficult the last three and a half years have been for residents, with the worry, uncertainty and financial costs hanging over them. This is why I have been steadfast in my opposition to these proposals and in my support for local residents and the campaign against these plans.\nI am pleased that both Councils have listened and are withdrawing from the Community Partnership. It means the Partnership will end and Nuclear Waste Services will have to look elsewhere for their dump site. This is not a “willing community” and it is time for NWS to move on.\nI hope this will bring a sense of relief to local people and I want to thank everyone who has worked hard to stop these plans, including local residents, campaign groups, local councillors and our Conservative mayoral candidate, Rob Waltham.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-meets-nhs-representatives-push-mablethorpe-dentist-opening/content_53.html": "I met with representatives from the Lincolnshire Integrated Care Board and the East Midlands Primary Care Team yesterday to discuss the delays in the opening of the Mablethorpe Dental Practice. I've been told there is one outstanding issue remaining, that everyone is working hard to resolve and that more news will be provided imminently.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-article-budget-and-farming/content_63.html": "There are children in our cities who do not know where our food comes from. It’s not their fault: the fields, cattle sheds and flour mills which produce our staples can feel a million miles away from hectic modern lives in urban centres where cost, speed and convenience are often paramount.\nThe people who produce the food so that we can pop into our local supermarket and buy what we need do so without the recognition they deserve. Thanks to our farmers, their staff and their families (often the same people), our food chains stay intact and we have a high degree of food security. And this certainty is now at risk from the decisions Labour has made in the Budget.\nFood security is national security. Labour’s manifesto and candidates repeated this line. And yet, four months in government and they have reneged on their promises to support the very people that produce our food. But more than that, they have outlined crass plans that will both threaten food security and destroy small family farms up and down this country. They have demonstrated starkly that they neither value nor understand rural communities. Same old Labour.\nFarmers tend to be asset rich but cash poor. Family farms are passed down through generations, thanks to Agricultural Property Tax Relief and Business Tax Relief. These are not “loopholes” as Rachel Reeves describes them, but careful tax planning policies that have evolved over decades to protect family businesses and farms from being split up upon death. The measures set out by Rachel Reeves and Keir Starmer will rip this up. The family farm tax means that land and assets that generations of farmers have nurtured will have to be sold in order to pay death duties - a move that will affect tens of thousands of farms.\nI have already been contacted by the NFU, who have been in touch with many older farmers who are hugely distressed. It is simply devastating.\nWe already know that mental health amongst farmers is a huge concern. It can be a lonely and isolating line of work. There are some fantastic charities that exist, but this latest challenge will only add to the burden. My colleague, Aphra Brandreth MP, will be bringing forward a debate this week on how we can improve mental health amongst agricultural communities and I am sure this will be raised.\nLabour have chosen to wage war on an industry that is already under pressure. Rather than give farmers the confidence that they need to invest in their farms, they are ripping up the protections they need to survive. With some farmers already at breaking point, the human cost could be very serious.\nI am proud that Kemi Badenoch challenged Keir Starmer on his plans this week, and made clear that we Conservatives will reverse Labour’s family farm tax. This is the first policy commitment since Kemi became the Leader. We cannot allow Labour to break British farming.\nFinally, a message to every farmer, every farming family, every farm worker and every rural community in Britain - we Conservatives stand with you and we will fight these plans. Our farmers feed us and they now need us to stand up for them and stop the family farm tax.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_supporting-scam-awareness-campaign/content_45.html": "For two weeks, between June 10 and June 23, Citizens Advice Bureau will run their Scam Awareness Campaign, encouraging people to take action to spot, report and protect themselves against scams.\nA scam is defined by the CAB as any attempt to steal money, personal information or data from an individual or a business, and can be conducted via emaill, text, post or phone call to name a few. The CAB state that there are 2 groups most at risk from scams: the 'life established' group, aged between 40 and 60, and older people, aged 60+. It is also estimated, however, that many scams go unreported, which is why the scam protection campaign this year encourages everyone to Stop, Report, Talk.\nStop\n- Recognise the signs of a scam, and appreciate that scams are increasing in sophistication and scope\nReport\n- Contact the police or Action Fraud immediately if you think you have received fraudulent communications\nTalk\n- .Engage with the Scam awareness campaign, details linked below, to help spread awareness.\nhttps://www.citizensadvice.org.uk/Global/CitizensAdvice/campaigns/SA19/Scams_Briefing.pdf\nEarlier this month, on June 4, I spoke in the Westminster Hall debate concerning telephone and online scams. My contribution is below, taken from theyworkforyou and available in context here https://www.theyworkforyou.com/whall/?id=2019-06-04a.16.0.\n\"It is a pleasure to serve under your chairmanship, Mr Hollobone. I thank Chris Elmore for securing this debate. He and other hon. Members have campaigned consistently on this extremely important subject. I thank all hon. Members who made contributions. As Jim Shannon said, this issue affects each and every constituency, and we all know someone, whether personally or professionally, who has been a victim of a scam or an attempted scam.\nThe examples that hon. Members gave show the range of scams that criminals can pursue and the range of people who can be victims. We rightly tend to focus on the most vulnerable—particularly the elderly, who are exploited by fraudsters because of their age and, the fraudsters assume, their frailties—but as the hon. Members for Strangford and for Westmorland and Lonsdale (Tim Farron) highlighted, these scams are not restricted to the most vulnerable. They are now so sophisticated that they can take in people who would ordinarily think that they are able to withstand such efforts. The methods that fraudsters use include playing a recording of a call centre in the background so it sounds like they are calling from a large call centre, which reassures the victim that the call is legitimate. There are huge challenges, not just for law enforcement, which must respond robustly, but for us as individuals. We must ensure that we are as knowledgeable as possible about these scams to protect ourselves, those we care for and those we think may be vulnerable. I will go into that in a bit more detail in due course.\nThe Government take this harm extremely seriously. Fraud is the second most prevalent crime in England and Wales. The crime survey estimates that there were 3.6 million frauds in 2018. Victims can suffer serious financial and emotional harm, and the money that fraudsters make can fund other serious organised crime. Although we have made substantial progress, the Government’s efforts to tackle scams and fraud in general are focusing on three areas: the policing response to fraud, reducing vulnerabilities, and the care and service that victims receive.\nWe are clear that the law enforcement response to fraud must improve. The previous Home Secretary, my right hon. Friend Amber Rudd, requested that Her Majesty’s inspectorate of constabulary and fire and rescue services conduct an inspection of the police response to fraud because we wanted a much clearer view of how fraud is being investigated and what improvements are needed. The inspectorate’s recent report highlighted key weaknesses in the police response, suggesting that significant improvements are required to ensure the efficient and effective operation of the current fraud policing model. In practice, that means local and, increasingly, regional investigations, supported by national functions.\nThe hon. Member for Strangford rightly said that fraudsters do not recognise geographical boundaries. On his point about the UK-wide response, we very much recognise the need to develop a national policing strategy for fraud, which will address, for example, how the Police Service of Northern Ireland can link with the overall national strategy. The City of London police is the national lead force for fraud and serves as a national centre for the collection and sharing of intelligence across the four regions of the United Kingdom. We very much take on board the hon. Gentleman’s point about the cross-border implications for the internal borders in the United Kingdom.\nThe inspectorate’s report and 16 recommendations demonstrate that the policing response to fraud must improve. My right hon. Friend the Minister for Security and Economic Crime, who apologises for not being able to be present today, takes this matter extremely seriously. He expects that the report will be taken seriously by chief constables and police and crime commissioners alike. We are working with the police and other law enforcement agencies to take forward those recommendations and challenge fraud at a national, regional and local level. The shadow Minister rightly asked about the statistics. I will take that point back to the Minister for Security and Economic Crime.\nLet me turn to reducing vulnerabilities. In addition to improving the police response to fraud, we must also address the vulnerabilities in systems that fraudsters exploit if we are to make the UK a harder target for fraudsters. The hon. Member for Ogmore gave the example of a fraudster citing the DWP in a scam that one of his constituents suffered. We recognise that the Government and law enforcement must work closely with the private sector, as well as with each other. Agencies such as Her Majesty’s Revenue and Customs are leading the way in the fight against online and phone fraudsters and are working relentlessly to close tax scams and raise awareness.\nIn the previous financial year, HMRC reported more than 12,000 malicious websites for takedown, recovered hundreds of misleading HMRC-branded domains, initiated the removal of hundreds of phone numbers used to perpetrate HMRC-related phone scams, and increased education efforts to ensure that the general public are aware that people may use HMRC’s or other agencies’ branding to try to extract their much-needed and carefully saved savings and income. Those education campaigns are being run by the media, television and newspapers. In 2016, HMRC identified a significant increase in the number of customers receiving malicious HMRC-branded texts. With the phone industry, it piloted award-winning controls that resulted in a 90% reduction in reports of such scams. The lessons learned from that are being scaled into a solution for the whole of the United Kingdom. As was reported at the weekend—hon. Members mentioned this—HMRC is deploying new controls to put an end to fraudsters spoofing the tax authorities’ most recognisable helpline numbers.\nNuisance calls are a source of extreme irritation for many, but for the most vulnerable they can also be incredibly stressful and harmful. We have taken a range of actions to reduce the number of nuisance calls. We have banned cold calls from personal injury firms and pension providers, as hon. Members noted. The hon. Member for Ogmore asked for an update. I will ask the Minister for Security and Economic Crime to write to him about that. It is very early days, but hopefully we can provide some information to him.\nWe have also introduced director liability for nuisance calls, and we are supporting national trading standards in rolling out call-blocking devices to vulnerable people. Members of Parliament have a real opportunity to help our constituents to understand the ways in which scams can operate and what we can do to protect ourselves against them. I recommend the Take Five to Stop Fraud scheme—a joint awareness campaign run by the Government and UK Finance, which provides simple advice to prevent people from falling victim to scams. The key message is that people should take their time when making a new payment, because fraudsters will try to rush them, as some of the very sad examples highlighted in this debate show.\nThe response to scams and fraud in general requires a collaborative, innovative response, because as we catch up with criminals, they will find other ways of exploiting technology to present new challenges and find new ways to steal people’s money. That is why the Government created the joint fraud taskforce: to better protect the public and businesses from fraud, reduce the impact of fraud on victims, and increase the disruption and prosecution of fraudsters. We continue to work with the taskforce to build on successful initiatives, such as the banking protocol—it has been discussed today—which is a code of practice to help banks to identify victims and alert law enforcement. It has prevented more than £48 million from falling into the hands of fraudsters and has led to more than 400 arrests.\nWe also welcome the publication of the voluntary industry code. It marks a significant step forward in the fight against authorised push payment frauds, which involve tricking customers into sending money to fraudsters via a payment service provider. To give an idea of the scale of the task, in the first half of 2018, consumer losses from APP scams amounted to around £145.4 million, of which just under £31 million was repaid to customers. The code will ensure that sending and receiving payment service providers will take steps to protect their customers, including with procedures to detect, prevent and respond to APP scams, with greater protection for customers who are considered vulnerable to that type of fraud.\nThe hon. Member for Westmorland and Lonsdale asked about the retrospectivity of the code. Again, I will raise that with the Minister for Security and Economic Crime. There are no plans to force banks to apply the code retrospectively, but there are certainly no rules or laws in place that prevent banks from making good-will payments. We also encourage victims of APP scams who have not been compensated by their bank to lodge a complaint with the financial ombudsman.\nAs the hon. Member for Strangford said, the code is voluntary, but to reassure hon. Members, the current signatories of the code cover approximately 85% of APP scams, and the Payments Systems Regulator, which leads the development of the code, actively encourages banks to sign up, as does UK Finance. In addition, the Financial Ombudsman Service will take the code into consideration when determining cases, regardless of whether the bank in dispute has signed up to the code.\nOn the other work that the payments industry does to prevent APP scams from occurring in the first place, the confirmation of payee service is the industry-agreed way of ensuring that names of recipients are checked before payments are made. Essentially, it is an account name checking service that can help to avoid the misdirection of payments. The industries developing the service say that it can be implemented by payment providers during the course of this year.\nRegulators and industry are taking further action to increase payment security and reduce fraud via stronger customer authentication. From 14 Septemberthis year, rules supplementary to the second payment services directive will apply, meaning that payment service providers such as banks will be required to apply more security measures to large transactions, and customers may be asked to provide more credentials. That could reduce some types of fraud by up to 30%.\nIt is also right that we look at the service provided to victims of scams and fraud. Two economic crime victim care units have been established to better identify vulnerable victims of fraud and ensure that they are provided with the right level of support. That includes practical advice, support and guidance to help victims to cope and to prevent them from again falling victim in future. The units have been trialled in the Greater Manchester and West Midlands Police force areas, and an assessment will be completed this year to help to measure the impact of the scheme.\"\nWith funding from the Home Office, National Trading Standards has piloted local multi-agency hubs to ensure that victims of fraud receive support from the local agency best able to provide it, whether that be the police, social services or charities. At the risk of boasting about my own county, in Lincolnshire—one of the pilot areas—the local police, National Trading Standards and a health trust have worked in partnership to train 1,000 health and social care professionals to identify and support older people who have been, or may be, the victims of doorstep crime and scams.\nA strategic action plan has been developed by Victim Support and National Trading Standards, with Home Office support, to ensure that the service received by fraud victims is rapid, appropriate and consistent, and takes into account any specific needs that they may have that might make them particularly vulnerable or susceptible to fraud. The joint fraud taskforce is working on a technical and regulatory framework to ensure that more fraud losses can be returned to victims. Work is also being undertaken to test the technology that can trace the movement of funds back to their source. The next step will be for banks to agree ways of operating that allow for the freezing of funds, a system of dealing with disputes and, ultimately, the return of stolen funds.\nWe all take this threat very seriously. The responsibility is shared by all concerned agencies, both in the public and private sectors, which is supported by civil society. I am extremely grateful to the hon. Member for Ogmore for providing the opportunity to discuss this fraud, innovative ways of tackling it, and ways to ensure that the Government’s steps are monitored and have the impact that we wish them to have. This is a piece of work that, I am delighted to say, many colleagues across the House, not all of them here today, have shared in common to ensure that the financial and social damage that such invasive crime inflicts on some of our most vulnerable citizens is tackled and stopped.\"",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-speaks-against-theddlethorpe-gdf-proposals/content_68.html": "I've opposed plans for a nuclear waste dump in Theddlethorpe from the very start. Our local community need to have a meaningful referendum on this issue - and that is what I will continue to push for if you re-elect me as your Member of Parliament on Thursday.\nYou can see Victoria speak on this here.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-responds-concerns-about-recent-vote-tampon-tax/content_57.html": "Constituents have contacted me regarding their concerns about the recent vote on the 'Tampon Tax'.\nI did not vote against removing the VAT charged on sanitary products. In fact, I support the repeal of any such tax. The meaning of the vote this week has been misrepresented by commentators. To explain the meaning of the vote, I must give some detail about how VAT is charged.\nVAT is a Europe-wide tax. As a member of the European Union, the UK cannot remove VAT unilaterally from any item. To ‘zero-rate’ items, the UK must obtain the consent of all 28 member states of the EU and of the European Commission.\nThere are some items that are already zero-rated, such as food and children’s clothing. These levels were negotiated in the 1970s, when the VAT harmonisation rules were agreed between member states.\nRegrettably, therefore, the House of Commons does not have the power to repeal the VAT charged by itself: it is a change that must be agreed across Europe.\nI turn now to the vote itself. We were not, as is being reported, voting on whether to abolish VAT on sanitary products. The motion committed the Government to conduct a three-month negotiation exercise with the 28 member states and the European Commission. MPs must vote on the wording of the motion put forward.\nThe Government took the view that the approach set out in the motion was unlikely to lead to success (not least because many EU members regard the UK as having more than its fair share of zero-rated items). The three-month limit in the motion was an unrealistic timeframe, particularly as the UK does not have any power to demand such a timetable.\nAs the Government is negotiating the UK’s EU membership rules, it makes sense for the Government to fold this issue into discussions about powers which the Government are seeking to take back from EU control. The Minister undertook to work on this issue. With that commitment, I voted for the most realistic option, namely to support the Government’s commitment to seek to negotiate the consent from the 28 EU member states and the EU Commission.\nThis is a timely example of why we must renegotiate our relationship with the EU. I support our Prime Minister in his efforts to do so.\nShould anyone have further questions on this issue do email me at [email protected]",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-article-daily-telegraph-farming-protest/content_72.html": "Today, Labour will see their chickens come home to roost. Thousands of farmers, farm staff and supporters from all generations and from across the UK are flocking to Westminster to protest against Labour’s Budget of Broken Promises.\nFarmers are turning out in huge numbers today because of the actions taken by this city-dwelling government. The tax reliefs on inheritance tax that have kept family farms and businesses together over generations are now to be swept aside.\nChanges to Agricultural Property Relief (APR) and Business Property Relief (BPR) announced in the Budget will destroy family farms and businesses, change the face of this country and its rural communities, increase food prices and damage food security.\nThese reliefs aren’t “loopholes” in the tax system as claimed by the Chancellor; they are careful safeguards created and upheld by successive Chancellors to ensure family farms and businesses could be protected for future generations.\nI am proud to be a Lincolnshire MP – our county boasts the largest agricultural sector in the UK. The careful stewardship by farmers and tenant farmers over generations has been the foundation of our local rural economy and is the reason why Lincolnshire continues to be the breadbasket for the nation.\nBut like many farming communities across all regions of the UK, Lincolnshire farmers are warning Labour’s cruel Family Farm Tax will mean they have to sell off their farms to pay the enormous tax bills they will face. A constituent whose family has farmed for over a century told me they would have to sell their farm to pay Reeves’s“vindictive tax”.\nFarmers are being advised by their accountants that their tax bills could be hundreds of thousands or even millions of pounds because of the value of their land and buildings. Another farmer put it bleakly when they asked, “so long as mum dies before March 2026, we’re okay?”\nYesterday, I met a farmer whose father owns a 450 acre farm, worth some £8 million. A huge sum of money on paper, yet their income last year was just £19,000. The 80 year old father is asking whether he is a burden, because his family will face a tax bill of £1.2 million. This is absolutely heartbreaking.\nMany farmers are asset-rich but cash-poor. Some of the farmers I’ve met in recent days work 365 days a year, yet earn incomes of £20,000 to £45,000. These are tenant farmers and farmers in the middle who are now struggling because of Labour’s choice to impose the Family Farm Tax.\nNot, as ministers are trying to suggest, wealthy figures who are trying to abuse the tax system. These are the same ministers who also say their cut to the Winter Fuel Payment won’t hit vulnerable pensioners despite their own assessment confirming it will.\nAnd if farmers can survive the changes to APR and BPR they still face the barrage of the hike in National Insurance or Jobs Tax, the acceleration of delinked payments, a tax hike to fertiliser, the cladding over of prime agricultural land with solar panels, and an ideological determination to decarbonise at an unachievable and economically damaging rate.\nBefore the General Election the now Prime Minister said his Government would seek a relationship with the countryside and farming communities which was “based on respect, on genuine partnership.” Yet each of these measures reveals a clear lack of understanding or care for rural Britain.\nAnd rather than listen to the worries of farmers, the National Farmers Union (NFU), Country Land and Business Association (CLA), Tenant Farmers Association (TFA) and others, that have decades of experience, the Government has said farmers are exaggerating and that they will just “need to learn to do more with less”. These are not the actions of a serious government that wants to back British farming.\nMoreover, this morning the Chancellor and Environment Secretary are peddling a myth that the £500 million this tax will raise in years to come will somehow fund the NHS – which has a budget closer to £200 Billion. This is economic illiteracy.\nSo today, Conservatives and I will be pulling on our wellies and joining farmers from across the UK who have made the long trek down to add our voice to their calls for this cruel Family Farm Tax to be reversed. They can be sure of one thing: we will reverse Labour’s Family Farm Tax when in government.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_category_Speeches/content_39.html": "Victoria Atkins MP speaks in support of women in politics 16th February 2016 Victoria Atkins MP speaks in support of women in politics Speeches",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_louth-horncastle-mp-hosts-community-summit-and-meeting-environment-agency-and-flood-affected/content_89.html": "Last week I held two community events at The Hub in Horncastle.\nI hosted a Community Summit last Friday morning to bring together representatives from more than fifty local organisations that work to support people in our community.\nThe Community Summit was split into two sections, the first focused on supporting children and young people, the second focused on supporting adults. Attendees heard from a wide range of contributors who were able to ask questions, share ideas and connect with other organisations in order to work together in the future. Organisations attending the Community Summit included local banks, charities, disability support groups, schools, grant making organisations, as well as parish, district and county councils.\nSupport being offered by East Lindsey District Council and from the government was also outlined for attendees.\nThis Community Summit was held following from the success of a similar event held last year focusing on supporting constituents with the cost of living.\nFollowing the Summit, having listened to local farmers affected by recent flooding, I further organised a meeting for local flood affected farmers to meet two representatives of the Environment Agency; Leigh Edlin, Environment Agency Area Director for Lincolnshire and Northamptonshire and Adrian Clack, Lincolnshire Delivery Lead. Representatives from local drainage boards, the National Farmers’ Union and from the County and District Council were also in attendance at the meeting.\nThis meeting provided farmers with an opportunity to have a frank and open conversation with the Environment Agency representatives about how recent flooding has affected their land. A number of farmers raised significant concerns about how the Horncastle Flood Alleviation Scheme had worked during Storm Babet and their concerns about communication and the importance of prioritising the maintenance of watercourses. A number of possible future action points were also discussed for how the agricultural community can support the Environment Agency’s efforts to reduce flooding in the future.\nOur local farmers do fantastic work meeting the challenges presented by unpredictable weather all year round. I’m keen to support them in their efforts to become an even bigger part of the solution for preventing and managing future floods.\nI’d like to thank everyone who attended and helped to make these events such a success.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-new-years-message/content_20.html": "\"2016 was quite a year! The EU Referendum, a new Prime Minister and a surprise win for President- Elect Trump means that 2016 is a year that will be studied by historians in years to come.\nThe EU Referendum was a promise made and a promise kept by the Conservative Party. The Prime Minister, Theresa May, has been very clear that the result of the referendum will be acted upon by the Government and a new relationship forged with the world.\nAccordingly, before Christmas, I voted to trigger Article 50 by the end of March 2017. The Prime Minister will then commence negotiations to secure the best terms for our exit from the European Union.\nMeanwhile, day-to-day life - and politics - carries on, and my resolutions for 2017 include helping the Government to deliver Brexit, working hard in my role as Parliamentary Private Secretary to the Home Office and continuing to campaign for better broadband.\nWe have big decisions to make in 2017. I hope that we can do so in a peaceful and polite climate.\"",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_announcing-landmark-draft-domesticabusebill/content_36.html": "Yesterday Victoria Atkins MP announced that a draft of #DomesticAbuseBill would be published.\nDomestic abuse is a devastating, complex and often hidden crime. The draft Domestic Abuse Bill would recognise the psychological, controlling and manipulative behaviours to which victims are often subjected. For the first time, the definition of abuse would encompass financial abuse.\nA key aspect of the bill is that victims would be automatically eligible to receive special protections when giving evidence, and their abusers would be banned from cross-examining them in family courts. Those found to be guilty of domestic abuse could be required to attend behaviour-changing rehabilitation programmes under new powers given to courts.\nThe new legislation would seek to establish a national ‘Domestic Abuse Commissioner,’ who would oversee the implementation of improvements to response and support for victims across public services.\nCommenting on this draft piece of landmark legislation, Victoria said, ''I have heard absolutely heart-breaking accounts of victims whose lives have been ripped apart because of physical, emotional or economic abuse they have suffered by someone close to them.''\n''The draft Domestic Abuse Bill recognises the complex nature of these horrific crimes and puts the needs of victims and their families at the forefront.''\n''This Government is absolutely committed to shining a light on domestic abuse to ensure this hidden crime does not remain in the shadows.''\n''The draft Bill will introduce measures to address coercive control and economic abuse, how domestic abuse affects children and transform the response in the justice system.''\n''The Bill will also ban the distressing practice of domestic abuse victims being cross examined by perpetrators in the family courts.''",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-visits-louth-livestock-market-discuss-challenges-agricultural-communities-and-ideas/content_77.html": "Today, I was pleased to be at Louth Livestock Market, which is such a pillar in our local community to hear ideas on building a bright future for our agriculture industry.\nThere was a great turnout and I had some really important conversations and got some interesting suggestions, as well as huge concerns from people locally and it was clear from our discussion that this city-dwelling government is showing a blatant disregard for rural communities\nIf Labour cared about farmers, they would join me and agree to axe the Family Farm Tax.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_response-nuclear-waste-services-expanding-site-search/content_70.html": "I have forced Nuclear Waste Services (NWS) to come clean on their plans to expand the site search for their nuclear waste dump from the former gas terminal to the wards of Withern & Theddlethorpe and Mablethorpe. Constituents from the area will feel betrayed by this move from NWS. Until this point, our collective understanding has been that NWS was looking only at the former gas terminal as the site for the infrastructure, not the agricultural land surrounding it or the tourist destination of Mablethorpe next to it. This widening of scope is deeply worrying, and I oppose it strongly.\nLast week, I demanded an emergency meeting with NWS as I had heard rumours about their intentions. When they confirmed to me that they were looking beyond the gas terminal site, I said that I would not keep this secret for them and that I would tell my constituents within the next few days if they did not. Today, they have slipped out a statement on the gov.uk website confirming their intentions.\nI have always made clear that I oppose the dump and am deeply concerned about the effect it is already having on the local community. In recent months, I have written to households in Theddlethorpe with a survey asking for their views on when they would like to hold a referendum, as a 'test of public support’. Should the public vote against the proposals then the current policy is that the project will be stopped.\nMy survey results show overwhelming support for a referendum in the next 12 months. In the last few days, I have held meetings with the Leaders of the District and County Councils to discuss these results, NWS’ intentions and the councils’ roles on the Community Partnership which will decide when the referendum should be held.\nI alongside many of my constituents oppose this nuclear waste dump in our area. I urge the Community Partnership to hold a referendum in the next 12 months so that residents can have their say and take control of our areas future.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-speaks-bbc-radio-lincolnshire-about-nuclear-waste-proposals/content_44.html": "Victoria was interviewed by BBC Radio Lincolnshire about proposals for a nuclear waste dump in Theddlethorpe. You can listen to this online here.\nVictoria was interviewed by BBC Radio Lincolnshire about proposals for a nuclear waste dump in Theddlethorpe. You can listen to this online here.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_contact/content_38.html": "If you would like to contact me regarding any issues, please fill in my contact form.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-speaks-debate-about-labours-family-farm-tax/content_73.html": "I have always been a committed advocate for our rural, farming and agricultural communities and will always ensure their voice is heard in Westminster.\nThe response from Lincolnshire ICB to Victoria about their end-of-life care contract is below. Victoria will continue to monitor this and please do get in touch if you experience any problems as a result of these changes.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-reacts-nws-changing-area-focus-nuclear-waste-dump-lincolnshire/content_11.html": "I have opposed the threat of a nuclear waste dump on the Lincolnshire Coast since the proposal came to light several years ago. In that time, residents have had to live with the uncertainty, worry and financial costs of having this monstrous carbuncle threatened in their area.\nToday, Nuclear Waste Services have finally published their update on their “area of focus” with regards to the potential siting of a nuclear waste dump on our coastline. It shifts the location for the above-ground site further inland.\nNWS are now looking at the land to the north of the A157, south-west of Gayton wind farm, between the villages of Gayton le Marsh and Great Carlton.\nThis news will be very distressing for the residents in and around this area. Rest assured that I will be meeting NWS in the coming week to continue to put pressure on them to move their focus away from Lincolnshire entirely.\nThis change in focus will mean a potential site being less than five miles from the Lincolnshire Wolds Area of Outstanding Natural Beauty and could now be closer to the historic town of Louth than it is to the coast where the waste would actually be stored. I have been against these proposals since the beginning and this latest move has only strengthened my resolve.\nWith an area of focus now being identified, I am again calling for a public vote on this within the year. Local people must be able to set their own destiny and to have certainty.\nNWS are holding consultation events on this in the coming days. I encourage everyone in the local area affected by these plans to attend these events and make your feelings known. These are taking place at:\n• Gayton le Marsh Village Hall, Monday 3 February, 3-7PM\n• Strubby, Beesby and Maltby Village Hall, Tuesday 4 February, 3-7PM\n• Great Carlton Village Hall, Wednesday 5 February, 3-7PM\n• Withern Village Hall, Friday 14 February, 3-7PM\n• Theddlethorpe Village Hall, Saturday 15 February, 12- 3,30PM\n• Legbourne Village Hall, Sunday 16 February, 12-3.30PM\n• Grimoldby & Manby Village Hall, Thursday 20 February, 3-7PM\n• Louth Town Football Club, Friday 21 February, 3-7PM",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_talking-about-violence-against-women-and-girls/content_67.html": "In the UK House of Commons talking about tackling violence against women and girls. #Enough! By working together we can make this the decade of change.\nWatch my whole speech at https://parliamentlive.tv/.../a3823a26-dfc4-4e74-9be3...\nIn the UK House of Commons talking about tackling violence against women and girls. #Enough! By working together we can make this the decade of change.\nWatch my whole speech at https://parliamentlive.tv/.../a3823a26-dfc4-4e74-9be3...",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_update-people-who-suffered-internal-flood-damage-during-storm-babet/content_95.html": "Grants are available in Lincolnshire from the government’s Flood Recovery Framework to support communities following severe flooding.\nIf you suffered internal flood damage to your home or business during Storm Babet, you may be able to apply for up to £5,000 to help make the property more resilient to future flooding\nProperties must have been seriously damaged internally by flood waters between the dates of 19 and 25 October, and subsequently required drying out or repairs to the fabric of the building.\nEligible properties are:\n- Residential properties, including static caravans if they are the property owner’s primary residence\n- Business properties where internal areas which are critical to the day-to-day operations of the business were affected\n- Properties owned by local authorities who act as the landlord\n- Holiday lets that are operated as a business, where non-domestic rates are paid\n- Bed and Breakfast properties where the owner lives on site as their primary residence and pays domestic or non-domestic rates or both\n- Houses of Multiple Occupancy (HMOs) or blocks of flats, which will be considered as one property\nNon-eligible properties include:\n- Garages, outhouses or storage areas\n- Second homes\n- Empty homes\n- Basements or cellars not used as part of the habitable or business area of the property\n- Holiday cottages which are not part of a commercial enterprise and are not the principal residence of the owner\n- Properties that received property flood resilience grants in 2013/14, 2015/16, November 2019 and February 2020\n- Properties that received Grant in Aid funding under a Regional and Flood Coastal Change Committee property level scheme\nThe scheme expires in early 2025. Please register as soon as you are able to, to avoid any delay to your claim.\nYou can find out more and apply for the grant here:",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_category_Local-News/content_4.html": "Victoria receives response from Lincolnshire ICB about overnight end-of-life care contract changes 29th April 2025 The response from Lincolnshire ICB to Victoria about their end-of-life care contract is below. Victoria will continue to monitor this and please do get in touch... Local News\nVictoria's response to participants of the Wragby Phone Signal Survey 25th April 2025 Thank you everyone in Wragby who took the time to respond to my recent mobile signal survey. I’ve now collated all of your feedback regarding the ongoing mobile... Local News\nVictoria visits Louth Livestock Market to discuss challenges for the agricultural communities and ideas for the future 4th April 2025 Today, I was pleased to be at Louth Livestock Market, which is such a pillar in our local community to hear ideas on building a bright future for our... Local News\nVictoria writes to Lincolnshire ICB about overnight end-of-life care contract changes 4th April 2025 Victoria has recently written to NHS Lincolnshire Integrated Care Board to raise concerns about the removal of the overnight end-of-life care contract from... Local News\nVictoria Atkins MP Visits British Growers Association 31st March 2025 Last week, Victoria met the British Growers Association at their base in Louth. They discussed some of the challenges and opportunities for the future of the... Local News\nVictoria visits Grainthorpe Junior School 25th March 2025 Yesterday, Victoria visited Grainthorpe Junior School. She was given a tour by two of the students and had a chance to see some their excellent facilities and... Local News\nVictoria's statement on the end of the Nuclear Waste Dump 19th March 2025 I am pleased and relieved that Lincolnshire County Council is withdrawing from the Community Partnership that had been looking at building a nuclear waste dump... Local News\nVictoria's Statement on North Sea Collision 12th March 2025 The collision in the North Sea yesterday has shocked and worried us all. My thoughts are with those on board, especially the family of the missing crew member... Local News\nVictoria Atkins Reacts to ELDC Withdrawal from NWS Community Partnership. 12th February 2025 From the very start four years ago when plans were revealed for a nuclear waste dump on our coastline, I have campaigned against it. Last week, I joined local... Local News",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-signs-joint-letter-chancellor-behalf-lincolnshire-and-nottingham-air/content_87.html": "Victoria today signed a joint letter to the Chancellor of the Exchequer sent by Dr Caroline Johnson MP.\nThe letter calls for the Charity to be exempted from the increase in National Insurance that Labour have introduced as part of their recent budget.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_cdn-cgi_l_email-protection/content_65.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_appearance-spectators-women-balls-podcast/content_55.html": "It was a pleasure to once again sit down with Katy Balls on The Spectator's Women With Balls podcast to discuss recent events.\nThe podcast is available on Apple Podcasts, Spotify, Audible and the Spectator website. If you would like to listen to the episode please follow the link below.\nhttps://www.spectator.co.uk/podcast/anatomy-of-a-downfall-with-victoria…",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-welcomes-new-dental-surgery-opening-mablethorpe/content_37.html": "I am delighted that Winsover Dental Care have opened their doors in Mablethorpe to provide new NHS dental services. I know how important this is for residents and have been working closely with partners at the local NHS trust and at the dental practice to get the practice open.\nAnyone seeking an NHS dentist can express an interest in accessing dental services via the website www.winsoverdentalcare.co.uk or by telephone on 01507 225 226 (Monday-Friday 8am-6.30pm). The team politely ask that you do not attend the practice in person unless you are attending an appointment.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_category_Articles/content_48.html": "Victoria speaks to the Louth Leader about the challenges local farmers are facing under the Labour Government 7th April 2025 Recently Victoria spoke to the Louth Leader and Horncastle News about the challenges facing the farming sector since the new Government came to power. You can... ArticlesMedia\nVictoria Atkins MP Article in the Daily Telegraph on Farming Protest 19th November 2024 Today, Labour will see their chickens come home to roost. Thousands of farmers, farm staff and supporters from all generations and from across the UK are... Articles\nVictoria's Article Ahead of the Mass Farming Lobby 19th November 2024 Labour are not just targeting farmers, they simply don’t understand them. ArticlesOpinions\nVictoria's perspective on the Domestic Abuse Bill 18th July 2019 Home should be a place of safety and of love, but for 2 million people it is not. Domestic abuse takes place behind closed doors, turning people’s homes into... Articles\nBacking Sajid Javid for leader 11th June 2019 The Conservative leadership election officially began on June 10th, and Louth & Horncastle’s MP Victoria Atkins has announced her support for Home Secretary... Articles\nAttending the modern slavery summit at British Embassy in Paris 22nd February 2019 Member of Parliament for Louth and Horncastle, and Minister for Crime, Safeguarding and Vulnerability, Victoria Atkins, was a speaker at the recent modern... Articles\nMeeting the Austrian Minister for Women 9th February 2019 Victoria Atkins, Member of Parliament for Louth and Horncastle and Minister for Women recently met with the Austrian Minister for Women, Julia Bogner-Strauss... Articles\nTalking crime policing and innovation with Lancashire Constabulary 5th February 2019 Louth and Horncastle's Member of Parliament, and Minister for Crime, Safeguarding and Vulnerability, Victoria Atkins, visited Lancashire Constabulary in South... Articles",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-joins-farmers-pancake-day-march-against-family-farm-tax/content_21.html": "I have always been a committed advocate for our rural, farming and agricultural communities and will always ensure their voice is heard in Westminster.\nThe response from Lincolnshire ICB to Victoria about their end-of-life care contract is below. Victoria will continue to monitor this and please do get in touch if you experience any problems as a result of these changes.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk/content_1.html": "Latest news\nCampaigns\nAm I your Member of Parliament?\nEnter your postcode\nLouth and Horncastle map\nContact Victoria Atkins\nConstituency Office\n01507 527017\nI am delighted and honoured to be the Conservative Member of Parliament for the Louth & Horncastle Constituency. I look forward to meeting as many people as possible locally and listening to your views on how to ensure that our area remains a wonderful place in which to live and work.\nEnter your postcode",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_backing-sajid-javid-leader/content_64.html": "The Conservative leadership election officially began on June 10th, and Louth & Horncastle’s MP Victoria Atkins has announced her support for Home Secretary Sajid Javid.\nVictoria said:\n\"Our next Prime Minister must deliver Brexit, forge new domestic policies which will help improve social mobility and prosperity, as well as bring some stability to our national politics.\nI have listened carefully to constituents and understand their concerns and expectations of the next Prime Minister. In particular, many people want us to get Brexit done, as soon as possible, deal or no deal. But people also want a government that will turn after Brexit to the issues which endure: building a strong economy which spreads prosperity and enables investment in high quality public services.\nAs a Home Office minister, I have worked with the Home Secretary, Sajid Javid, on some of the most difficult issues of the day such as knife crime and domestic abuse, and believe that he is well placed to tackle the most important challenges facing our country.\nSajid will do everything he can to secure a deal with the EU but will prepare for the possibility of a ‘No Deal’ departure on 31st October, including setting a No Deal Budget. His successful business career before he entered politics will help in negotiations with the EU. He will, however, use his experience at the highest levels of government to plan effectively for a ‘No Deal’ scenario if agreement cannot be reached with the EU.\nIn a hung Parliament, with divisions rife, this will be extremely difficult but Sajid has beaten the odds before. His journey of growing up on one of the toughest streets in the country to holding one of the great offices of state is an example of the opportunities our country can - and should - offer our children and young people. It is these experiences that shape his commitment to improving prosperity across our country, including here in Lincolnshire, and investment in vital public services beyond Brexit.\nSajid has my support as the candidate who can deliver Brexit, heal divisions and take our country forward.\"\nMore information about Sajid's campaign can be found in his official campaign video linked below, and the following article clearly sets out Sajid's position on Brexit.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_offensive-weapons-bill-passes-second-reading/content_27.html": "Violent crime has a devastating impact on communities in every part of the country, not just in London.\nThe Offensive Weapons Bill will strengthen the powers of the police to deal with these terrible crimes and bring offenders to justice.\nWatch my remarks to conclude the Second Reading of the Bill earlier this week below, which has now progressed to committee stage following this link.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_privacy/content_5.html": "This document outlines how Victoria Atkins processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Victoria Atkins\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Victoria Atkins.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Victoria Atkins, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Victoria Atkins via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-statement-north-sea-collision/content_35.html": "The collision in the North Sea yesterday has shocked and worried us all. My thoughts are with those on board, especially the family of the missing crew member. This highlights the dangers faced by those who work at sea, from large container ships to our fishing fleet.\nI would like to thank the Coastguard, RNLI and emergency services who raced to the rescue in the last 24 hours and who continue to battle with the fires at sea. In particular, we should be proud of constituents who volunteer with the RNLI and Coastguard and who continue to support the operational response, as part of their duties looking after our coastline each and every day.\nI am liaising with local Coastguards and ELDC to offer my support and to track the emerging impacts on our coastline and local area, including environmental and health concerns.\nI will continue to engage with local bodies and the Government to ensure that this is dealt with swiftly and that any potential impacts are mitigated as fully and quickly as possible.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-speaks-environment-agency-about-lincolnshire-flooding/content_93.html": "I have spoken to the Environment Agency about flooding today in Lincolnshire. They have given me assurances that the Horncastle Flood Alleviation Scheme has been activated and is working. They also confirmed they have teams on the ground closely monitoring the situation and, where safe, clearing blockages and screens.\nI would encourage you to stay up-to-date with the latest information by:\n• Signing up for free updates by calling Floodline on 0345 988 1188.\n• Check the weather forecast UK rainfall radar map: https://weather.metoffice.gov.uk/.../rainfall-radar...\n• Keep up to date with the current flood warning situation: https://check-for-flooding.service.gov.uk/alerts-and...",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-welcomes-further-funding-local-council-help-flooding-costs/content_50.html": "It is fantastic news that the government has announced £3m for councils with Internal Drainage Boards (IDBs).\nIDBs provide a vital service in rural communities, helping protect people and properties from flooding. I have worked with Lincolnshire MPs, the Leader of East Lindsey District Council, Cllr Craig Leyland, local Conservative Councillors and our IDBs to press for this extra funding.\nI also welcome the commitment by the Secretary of State for the Department for Levelling Up, Housing and Communities, the Rt Hon Michael Gove MP, to work with the sector and Department for Environment, Agriculture and Rural Affairs to implement a long-term solution.\nYou can read more about this here.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_talking-crime-policing-and-innovation-lancashire-constabulary/content_88.html": "Louth and Horncastle's Member of Parliament, and Minister for Crime, Safeguarding and Vulnerability, Victoria Atkins, visited Lancashire Constabulary in South Ribble, to discuss crime policing and innovation.\nVictoria spoke to the Chief Constable about the work he and his team do in keeping Lancashire safe.\nCommenting, Victoria said, ''Thank you to the Chief Constable for such an informative visit. South Ribble Constabulary work tirelessly to keep residents safe, and it was a wonderful opportunity to speak to those on the 'front line' about their experience of policing.''",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-reacts-eldc-withdrawal-nws-community-partnership/content_49.html": "From the very start four years ago when plans were revealed for a nuclear waste dump on our coastline, I have campaigned against it. Last week, I joined local residents in Gayton le Marsh, Great Carlton and the surrounding area to show our opposition to the latest plans to move the dump further inland. We are all horrified by the prospect of such a monstrous carbuncle and the industrial wastelands that will be built around it being imposed on our corner of England.\nI welcome, therefore, the announcement this morning by the Leader of East Lindsey District Council, Cllr Leyland, that he will withdraw ELDC from Nuclear Waste Services’ Community Partnership.\nWhen the latest proposals were revealed by NWS, I immediately called a meeting with Cllr Leyland and Cllr Hill, leader of Lincolnshire County Council, to reiterate local residents’ opposition to a dump. Local residents must be listened to and I will continue to fight for them and our area.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-speaks-tax-credits/content_34.html": "Victoria Atkins MP said:\n“We must live within our means as a country. To do that, the Government has needed to find at least £12 billion of welfare savings. Identifying such savings was never going to be easy and the changes to Tax Credits is one of a number of ways in which the Government will achieve this.\nTax Credits were introduced to help people live on low wages – in other words, helping to subsidise low wages. The system has grown far beyond what was intended and what is affordable.\nThe Government believes that it is better for wages to be increased, rather than relying on Tax Credits to make up the difference. That is why the changes to Tax Credits comes alongside the introduction of a new National Living Wage. This will be set at £7.20 in April 2016, with plans to raise it to at least £9 per hour by 2020, which will be a direct pay rise to over 2 million people worth up to £5,000. This is in addition to the continued policy of raising the threshold at which people start paying tax, so that the lowest paid keep more of their money.\nThese changes will return Tax Credit spending to the level it was in 2007-2008 in real terms. I do recognise, however, that these changes may be felt keenly by some of my constituents. Anyone who has specific concerns about this should please contact me at [email protected]. “",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-gives-keynote-speech-local-nhs-conference/content_76.html": "I was honoured today to deliver the keynote speech at the ‘Pathways to Research and Innovation’ conference hosted by Lincolnshire Community Health Services and United Lincolnshire Hospitals Trust. This conference was a fantastic opportunity for staff to share the latest research ideas and network with colleagues. I’d like to thank LCHS and ULHT for putting this brilliant event on and for inviting me along to join you.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_category_Opinions/content_6.html": "Victoria's Article Ahead of the Mass Farming Lobby 19th November 2024 Labour are not just targeting farmers, they simply don’t understand them. ArticlesOpinions\nVictoria's Article on the Budget and Farming 9th November 2024 Thanks to our farmers, our food chains stay intact and secure. Labour's Budget decision puts all this at risk. Opinions\nVictoria's Article on Food Security and Farming 5th November 2024 Labour’s crass tax raid will make British farms uncompetitive Opinions\nVictoria's New Year's Message 1st January 2017 \"2016 was quite a year! The EU Referendum, a new Prime Minister and a surprise win for President- Elect Trump means that 2016 is a year that will be studied by... Opinions\nVictoria Atkins MP sets out her reasons for voting to remain in the European Union 22nd June 2016 Victoria Atkins MP sets out her reasons for voting to remain in the European Union Opinions\nVictoria Atkins MP addresses constituents’ concerns on fracking 30th October 2015 Victoria Atkins MP addresses constituents’ concerns on fracking Opinions\nVictoria responds to concerns about the recent vote on the \"Tampon Tax\" 29th October 2015 Victoria responds to concerns about the recent vote on the \"Tampon Tax\" Opinions\nVictoria Atkins MP speaks on Tax Credits 1st October 2015 Victoria Atkins MP speaks on Tax Credits Opinions",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-speaks-lorraine/content_62.html": "I've been campaigning for better health and social care in our area, from the future of our hospital, to individual health conditions that affect residents of the constituency of Louth & Horncastle.\nThe response from Lincolnshire ICB to Victoria about their end-of-life care contract is below. Victoria will continue to monitor this and please do get in touch if you experience any problems as a result of these changes.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_feed/content_85.html": null,
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victorias-perspective-domestic-abuse-bill/content_74.html": "Home should be a place of safety and of love, but for 2 million people it is not. Domestic abuse takes place behind closed doors, turning people’s homes into places of fear, abuse and violence.\nLast week, I introduced the Domestic Abuse bill to Parliament, to strengthen the protection offered to the victims of this terrible crime, acknowledging the impact on children and breaking the cycle of abuse.\nDomestic abuse is not restricted to acts of violence; plenty of non-violent actions can contribute to a pattern of abusive behaviour, such as controlling a partner’s finances, restricting the use of a phone, taking away car or house keys, dictating who a partner can or cannot see, deciding what, how and when a partner eats… the list goes on. While these actions may be part of a longer journey that ultimately leads to violence, we also recognise that some abusers may never commit an act of physical violence. The actions constitute domestic abuse in and of themselves.\nThe bill\nThis bill is the most comprehensive package ever presented to Parliament to tackle domestic abuse. It has been crafted over the last two years with the help of charities, the police, councils, healthcare and education professionals and, most importantly, those affected directly by abuse. Without the courage of so many survivors who have come forward to share their stories, this Bill would not have been possible.\nThe Domestic Abuse Bill introduces, for the first time, a legal definition of domestic abuse and acknowledges the controlling and coercive behaviour so often at its core. This ensures that the victims of economic, psychological and sexual abuse receive the same legal protection as victims of physical abuse, and that perpetrators of all forms feel the full force of the law.\nThroughout this process, I have spoken to many brave survivors of domestic abuse, not just about how they have suffered, but also about their experience of the legal system. The bill ensures that the victim cannot be cross-examined in the family courts by the offender, and automatically makes them eligible for special measures and enhanced support when giving evidence in criminal courts. It also introduces Domestic Abuse Protection Orders to restrict the actions ofoffenders and a Domestic Abuse Commissioner to champion survivors and victims.\nUltimately, we wanted to create a victim-focussed approach, and we knew that for this to be successful, we had to listen to those who have been, for too long, scared to come forward and have suffered in silence. That is why, in 2018, the Government carried out extensive public consultation on measures to be included in the bill and considered the over 3200 responses we received carefully.\nIn January 2019, our response to this consultation was published, along with the draft Domestic Abuse bill, to allow for a period of cross-party scrutiny whose recommendations we have mainly accepted, either in part or in full. The first reading of the Domestic Abuse bill represents the culmination of many months of collaborative, non-partisan action to do all we can to eradicate domestic abuse. Should anyone reading this article realise that they, or someone they know, needs help, please call the Domestic Abuse helpline on 0808 2000 247. Together we can stop the cycle of abuse.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_victoria-atkins-mp-addresses-constituents%E2%80%99-concerns-fracking/content_60.html": "Many constituents have contacted me with concerns about the impact of fracking on our local and national landscape.\nI understand and appreciate these concerns, but I have been reassured that the Government is creating a regulatory regime that provides clear, strong protections for the environment.\nThe regulatory regime will provide clear, strong protections for the environment. For example, Areas of Outstanding Natural Beauty are protected, consent cannot be granted for drilling without an environmental impact assessment and operators are required to monitor methane levels in groundwater. The Government has introduced draft regulations to Parliament that define the areas in which fracking will be banned.\nWith safeguards in place, I think it right that we explore and make use of shale gas and oil, as part of a diverse national energy supply, as well as to secure jobs and investment. Each application will have to be judged on its merits.\nI am, therefore, cautiously in favour of fracking, on three conditions: that the technology is safe, that the visual impact is minimal and that local communities are compensated properly.\nFor those constituents who have contacted me regarding National Parks, the protections cover National Parks and as such, fracking cannot take place at depths of less than 1,200 metres in these areas. The Government has clearly committed to ensuring that fracking cannot be conducted from wells that are drilled at the surface of National Parks, and I am confident that these protections will ensure that the beauty of our National Parks is protected.\nThe UK has one of the best track records in the world when it comes to protecting our environment while also developing our industries, and Ministers have assured me that that this experience will be brought to bear on the shale gas protections. The industry will be developed safely with world class environmental protections, creating jobs and delivering better energy security, while all the time safeguarding some of our most precious landscapes.\nAny constituents with specific concerns should email me at [email protected]",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_accessibility/content_51.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_announcing-safer-streets-fund/content_94.html": "The aim of the Safer Streets Fund is to stop offenses that blight communities and cause untold suffering to victims from happening in the first place.\nGrants of up to £550,000, have been awarded following a bidding process and will be provided to PCCs in England and Wales for projects to improve security in areas particularly affected by acquisitive crimes such as burglary, vehicle theft and robbery. Lincolnshire has been awarded £250,780.\nNo one should feel afraid while walking the streets, yet for so many people, particularly women and girls, a background hum of feeling uncomfortable or even unsafe in public spaces has become an all too common occurrence.\nWe want the Safer Streets Fund to help the police and local councils ensure that our streets are safe for everyone.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_campaigns_standing-our-rural-communities/content_14.html": "I have always been a committed advocate for our rural, farming and agricultural communities and will always ensure their voice is heard in Westminster.\nRecently Victoria spoke to the Louth Leader and Horncastle News about the challenges facing the farming sector since the new Government came to power. You can read the interview here.\nToday, I was pleased to be at Louth Livestock Market, which is such a pillar in our local community to hear ideas on building a bright future for our agriculture industry.There was a great turnout and I had some really important conversations and got some interesting suggestions, as well as huge con\nLast week, Victoria met the British Growers Association at their base in Louth. They discussed some of the challenges and opportunities for the future of the fresh produce sector.\nEarlier this week I joined farmers in protesting Labour’s immoral Family Farm Tax, which is harming growth and risks increasing food bills for us all.The Conservative Party stands with farmers and will axe this tax. \"We won’t back down!\"You can see my video from the day here.\nToday I hosted a Community Summit for organisations throughout our constituency to come together, network and share information.I ran a session focusing on support for pensioners as I know many people are very worried about coping with the loss of their winter fuel payment and it was useful to hear\nToday, Labour will see their chickens come home to roost. Thousands of farmers, farm staff and supporters from all generations and from across the UK are flocking to Westminster to protest against Labour’s Budget of Broken Promises.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_modernising-mental-health-act/content_18.html": "Today's debate on the use of force in mental health units looked at important measures to make the 1983 Mental Health Act fit for purpose. It recognised the disproportionate rates of detention of black and ethnic minority patients which have persisted for too long.\nVictoria is pleased with the cross-party consensus over the provisions in the Bill on better oversight and management in mental health units, and the use of body-worn cameras by police officers there.\nThe Bill has now been passed at second reading and is returning to the House soon.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_hunting-act/content_42.html": "The Conservative Party manifesto included a commitment to allow time for a vote on the repeal of the Hunting Act. As I stated during the General Election campaign, I supported the commitment to allow time for that vote as I believe Parliament should be able to look at the Act again to see whether it is working in the best interests of the countryside.\nIn July, the Secretary of State for Environment, Food and Rural Affairs, the Rt. Hon. Elizabeth Truss MP, proposed an amendment that would align the law in England with the law in Scotland. The amendment would have been brought into force through a Statutory Instrument, meaning that the Hunting Act would have remained in force.\nThe proposed amendment dealt with the number of dogs permitted to flush out foxes. As part of the Hunting Act's pest control exemptions, farmers and gamekeepers can use up to two dogs to flush foxes from cover to be shot. This makes an important contribution to land managers' ability to control foxes. However, upland farmers have said that the two-dog limit is impractical on this terrain, which can be vast, difficult and often covered by woodland. They have asked for more flexibility, bringing the law closer to the position in Scotland.\nThe Government had intended to give the House of Commons an opportunity on 15 July to amend the provisions for exempt hunting so that farmers and gamekeepers could decide, based on the terrain and other circumstances, whether it is appropriate to use more than two dogs to flush out foxes. This debate did not occur, however, as the Scottish National Party announced that its MPs would vote on this measure, despite the fact that this is already the law in Scotland.\nI read with care the correspondence I have received on the subject, both in favour of and against the proposed change. I have concluded that the proposed Statutory Instrument was a reasonable compromise.",
  "https_www_victoriaatkins_org_uk_/https_www_victoriaatkins_org_uk_news_meeting-radioactive-waste-management-protecting-home-owners/content_16.html": "I met Radioactive Waste Management (RWM) recently to discuss some of the concerns of constituents. I again highlighted my own opposition to the possibility of nuclear waste being dumped on the Lincolnshire coast.\nWe particularly focused on the property market as this is a matter I have raised regularly on behalf of constituents. RWM confirmed that if the Working Group were to decide to progress to the next stage a scheme would be implemented to address the impact of the GDF proposals on house prices. From my correspondence RWM recognised, however, that there is a very real need to support residents before this and confirmed they are considering launching an interim scheme in the summer of 2022. I expressed concern about the length of time this would take and told RWM that I hoped that any scheme put in place would be retrospective, compensating people who have already been affected. I will be seeking further information about this scheme as it progresses.\nFor those with house sales being affected now by this proposal, RWM has also agreed to consider individual cases in the meantime. If you are a constituent in this position you can contact RWM directly or I can contact them on your behalf if you email [email protected] with the details."
}