{
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-meets-yaxley-residents-and-developers-tackle-threat-flooding/content_6.html": "Shailesh Vara MP, along with representatives from Yaxley Parish Council, local residents and the Middle-Level Commissioners has met with the developers Vistry and their consultants Stantec, who are developing the Great Haddon site. The aim of the meeting was to discuss the risk and potential impact of flooding from the development into neighbouring Yaxley.\nThose attending included Cllr Andrew Wood, Vice Chair of Yaxley Parish Council, Helen Taylor, Clerk to the Council and Paul Burrows, Chief Executive Officer of the Middle-Level Commissioners.\nThis meeting followed a previous one last year with the Parish Council and District Councillors Kevin Gulson and the late Mac McGuire. It was decided at the time that a meeting with the developers and the Middle-Level Commissioners, who are responsible for managing the water levels in the Fens, would prove to be beneficial.\nDuring the recent meeting, Mr Vara and the Yaxley residents made clear their serious concerns regarding the increased flow of water and associated flood risk posed by the Great Haddon development which when completed will have over 5000 homes.\nAlso of much concern is the fact that the cost of managing the floods would have to be met by Yaxley Parish Council, and so far, there has been no offer of financial assistance from either Peterborough City Council or the developers.\nThe role of the City Council at the early planning stages was also discussed. In particular, it was noted that initially the City Council had intended to carry out a Flood Risk Assessment, but the Council subsequently decided not to proceed with this.\nIt was felt by all those present that such an Assessment would be very useful in helping to better understand the issue and Mr Vara said he would contact the City Council to request that a Flood Risk Assessment be carried out.\nFollowing the meeting, Mr Vara said:\n“It is clear that at the earlier planning stages not enough attention was given to the flood risk for Yaxley and its residents. Given the huge development at Great Haddon, with over 5000 new homes to be built, it is a major omission on the part of the planners.\n“Andrew Wood and Helen Taylor, along with other local residents, are right to raise their very serious concerns and they have my full support in trying to resolve this issue.\n“I will be writing to Peterborough City Council to request that a Flood Risk Assessment be carried out as this may help us to move forwards.”\nCllr Wood added:\n“The remodelling of the drainage system for Great Haddon and the A15 has resulted in a significantly increased drainage flow, which the watercourse in Yaxley was not designed for. It should always have been a requirement for the Great Haddon development to assess the potential impact on Yaxley, and we have been consistent in our demand for a Flood Risk Assessment to satisfy this need.”\nMrs Taylor said:\n“A Flood risk assessment for Yaxley should have been carried out prior to any approval to put additional water into a small watercourse. The volumes and flow experienced over the recent months is beyond the capacity of the existing system resulting in the flooding we have experienced. Yaxley Parish Council welcomes this request to Peterborough City Council.”",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament/content_16.html": "Speaking in Prime Minister’s Questions, Shailesh Vara welcomes the £8million set aside for pothole repairs and calls for a higher standard of quality specification to be used for materials to ensure the repairs last longer.\nShailesh Vara makes interventions in the debate on the Second Reading of the Post Office (Horizon System) Offences Bill which will quash convictions resulting from the Post Office Horizon scandal. He calls for lessons to be learned and acted on, including looking at those who produced the evidence in the first place.\nFollowing the Government statement about Post Office legislation and the Horizon redress schemes, Shailesh Vara seeks assurances that where postmasters do not accept the fixed offer, but wish to pursue an individual claim, such claims will be treated expeditiously, and that resources will be made available to deal with those claims quickly and efficiently.\nSpeaking in Northern Ireland Questions, Shailesh Vara asks the Secretary of State about the Republic of Ireland’s decision to take the UK Government to court over the Northern Ireland Troubles (Legacy and Reconciliation) Act 2023, which is designed to bring justice and information recovery to victims of the troubles.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_reject-cooper-letwin-tomorrow-and-focus-good-deal-which-can-secure-commons-majority/content_29.html": "Joint article with Suella Braverman MP\nTomorrow, Parliament will vote on the wrecking amendment that is Cooper-Letwin. Make no mistake, the sole intention of its creators is to block Brexit. They must not succeed. It would leave a poisonous constitutional legacy and will break the solemn commitments made in the 2017 Conservative manifesto.\nAt this moment of heightened tension, it a crucial time to focus on what actually unites our Government, our party and our country.\nThe Brexit prize is in sight. We may all have been so worn down we’ve lost focus on what we believe and what we can achieve.\nThere has been a lot of jargon on backstops, on Malthouse Compromises and meaningful votes. But what do we actually all want?\nWe want to deliver what record numbers of Britons voted for, namely taking back control over our borders, laws and money. We want to keep our manifesto commitments that Brexit will be delivered on time and that the UK will leave the customs union and single market. We want to protect the integrity of the Union of Great Britain and Northern Ireland. Above all, we all want an orderly exit from the European Union.\nSo how does that all come about? We are reassured that this week the Prime Minister reiterated her desire to honour our 2017 manifesto commitments on Brexit. We are further reassured that she says she wants to secure legally binding changes to the backstop to ensure that the will of Parliament prevails and that we can secure a unilateral exit mechanism from the backstop or a final date for our exit from it.\nSo the important thing to focus on now is to secure those ends from the negotiations and bring a better deal back to Parliament. If the Prime Minister achieves this, she can be assured of the support of her party in Parliament. The successful passing of the Brady amendment showed that the will is there in Parliament and a majority can be achieved. This is in our national interest, and provides the benefit of uniting our party after a difficult few days where we have unfortunately lost three of our colleagues.\nIn delivering our manifesto commitments and honouring the public mandate, we feel that the Prime Minister is owed loyalty and support. Our sense is that the Party – whether voters, members or MPs – wants to come together to get Brexit over the line and take the fight to Corbyn’s Labour Party. We all want Brexit over and done with now, but the deal has to be the right one for our country. As Martin Howe QC, the distinguished constitutional lawyer, wrote recently, the “acid test” must be “whether it gives the UK a clear and unconditional legal right to break out of the backstop if the negotiations fail.”\nFrankly, labels are unhelpful at the present time. If the right deal is secured it really does not matter what group people belong to or how their views are labelled. Secure the best Brexit and we will all rally to the cause.\nThen we can move on to discussing the real prize of Brexit: our future trading relationships with the EU and the rest of the world. There is no reason at all why we cannot secure the optimum deal with the EU of a Canada-style Free Trade Arrangement. We can also simultaneously negotiate similar FTAs with countries across the globe, delivering the global Britain the British people voted for.\nThe Conservative Party is united in searching for the best solution to take us out of the EU on the 29th March 2019. The backstop has to go in its present form, we must not be in the customs union thereby enabling us to agree far reaching global trade deals, and thus honouring our commitment to the referendum vote on the 23rd June 2016. We can all support the Prime Minister in this endeavour.\nWe very much hope that we will be able to support the Prime Minister in her effort to unify the party around a deal it can support. We are sure she will take account of the clearly expressed wishes of the House of Commons and deliver the Brexit the British people voted for. That would offer the optimistic future the British people deserve and deliver the feel-good factor of honouring promises and fulfilling people’s hopes. Let’s be positive and seize the moment to negotiate the deal we all want.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-supports-world-parkinsons-day/content_10.html": "Shailesh Vara MP is supporting World Parkinson's Day. He recently met with members of Parkinson’s UK, as well as people living with Parkinson’s disease, at the House of Commons.\nParkinson’s UK is the largest charity funder of research into Parkinson’s in the UK. It supports initiatives that seek to find better treatments and improve the understanding of the disease and its causes.\nParkinson’s disease is a condition where parts of the brain get damaged over time, leading to symptoms such as involuntary shaking, slow movement, and stiff muscles. They may also experience depression, balance problems, and memory issues. Many people are of the view that those with Parkinson’s develop symptoms later in life, but the reality is that many thousands of younger people are also affected.\nIn the United Kingdom, around 153,000 people live with Parkinson’s, affecting all aspects of their daily lives. This includes talking, swallowing, as well as writing. While there is currently no cure, research and support services – such as those provided by Parkinson’s UK – help improve the quality of life for those affected.\nAmongst the issues discussed by Mr Vara was the need for early diagnosis and the importance of ensuring that those with the disease have access to appropriate care provision, as well as the need for continued support to try to better understand the disease and eventually find a cure.\nFollowing the meeting, Mr Vara said:\n“I was very pleased to meet with Parkinson’s UK to discuss the impact of Parkinson’s disease on our communities. Many people in the UK live with the condition, and it affects their lives in significant ways. It is important to recognise that this disease affects not only older people but also younger ones.\n“It is vital that we continue to support the research and services which improve the quality of life for those affected.\n“Parkinson’s UK has my full support as it continues to support research to find a cure and also as the charity offers help.”",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-calls-quick-settlement-horizon-scandal-victims-who-pursue-individual-claim-rather/content_20.html": "Following the Government statement about Post Office legislation and the Horizon redress schemes, Shailesh Vara seeks assurances that where postmasters do not accept the fixed offer, but wish to pursue an individual claim, such claims will be treated expeditiously, and that resources will be made available to deal with those claims quickly and efficiently.\nShailesh Vara (North West Cambridgeshire) (Con)\nI congratulate my hon. Friend on all that he is doing, working night and day to bring this painful issue to a conclusion for the many postmasters and their families who have suffered so much over so many years. Where people do not accept the fixed offer but wish to pursue an individual claim, may I seek his assurance that such claims will be treated expeditiously, and that resources will be made available to deal with those claims quickly and efficiently? Will he also give an assurance that claimants will have a named individual responsible for their file, rather than whoever happens to pick up the file on a specific day?\nThe Parliamentary Under-Secretary of State for Business and Trade (Kevin Hollinrake)\nI thank my right hon. Friend for his question and can absolutely give him the assurance he seeks. A fixed-sum award is only one route; it is not right for everybody. Some people have higher levels of claims, and we will support them where we can. In my remarks, I announced new measures we are using to do that, including a pilot scheme where expert reports are not required. That should significantly abbreviate the timescale between being able to submit a claim and getting a response. As for expediting in this area, in the GLO scheme we set a target that in 90% of cases we would respond to a final claim within 40 days. Currently, we are on 87% against that measure, so we are delivering this more quickly. He makes an interesting point about a named claim manager or something along those lines, and, if I may, I will take that away with me.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news/content_14.html": "During Prime Minister’s Questions today, Shailesh Vara raised the issue of the quality of materials being used for potholes and road repairs in his constituency and in many other constituencies across the country.\nDuring Prime Minister’s Questions today, Shailesh Vara raised the issue of the quality of materials being used for potholes and road repairs in his constituency and in many other constituencies across the country.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-critical-republic-irelands-action-northern-ireland-troubles-act/content_32.html": "Speaking in Northern Ireland Questions, Shailesh Vara asks the Secretary of State about the Republic of Ireland’s decision to take the UK Government to court over the Northern Ireland Troubles (Legacy and Reconciliation) Act 2023, which is designed to bring justice and information recovery to victims of the troubles.\nShailesh Vara (North West Cambridgeshire) (Con)\nDoes my right hon. Friend agree that it is deeply regrettable that the Taoiseach, Leo Varadkar, is pandering to his domestic audience, rather than thinking of the greater good of Northern Ireland and the victims of the troubles?\nThe Secretary of State for Northern Ireland (Chris Heaton-Harris)\nMy right hon. Friend makes a very fair point, because in the midst of everything we are trying to do to get the Executive back up and running, the Republic of Ireland’s decision to take an inter-state case out against the UK Government on our Northern Ireland Troubles (Legacy and Reconciliation) Act 2023, which is designed to bring justice and information recovery to victims of the troubles, is unhelpful and unfortunate. We have made our representations very plain on that matter.\nHansard",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_privacy/content_19.html": "This privacy notice relates to the personal data processed by the Office of Shailesh Vara MP in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is Shailesh Vara.\nWhat does the office do?\nWe conduct casework and respond to policy queries, for which we must process people's personal data.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent.\nWe are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted Shailesh about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you such as local authorities, government agencies, public bodies, health trusts, regulators and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures.\nIn any case, we will not use your data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Unless specifically requested by you, we feel it is reasonable that our office will hold your personal data for the duration of Shailesh ’s time as representative for the North West Cambridgeshire Constituency. Following an election, if unsuccessful, all records will be destroyed within one calendar month of the election.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page.\nPlease note that we will ask for identification (passport, driving license, utility bill from the last 3 months) should you choose to exercise any of the above rights in relation to personal data we hold.\nComplaints\nIn the event that you wish to make a complaint about how your personal data is being processed by this office, or how your complaint has been handled, you have the right to lodge a complaint directly with the Information Commissioner’s Office www.ico.org.uk\nShailesh Vara MP\nHouse of Commons\nLondon, SW1A 0AA\nTelephone: 0207 219 6050\nemail:\nshailesh.vara.mp@parliament.uk",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_articles/content_8.html": "Tomorrow, Parliament will vote on the wrecking amendment that is Cooper-Letwin. Make no mistake, the sole intention of its creators is to block Brexit. They must not succeed. It would leave a poisonous constitutional legacy and will break the solemn commitments made in the 2017 Conservative manifesto.\nAcross the globe the United Kingdom is at the forefront for championing the principles of democracy. Underpinned by the rule of law, with Magna Carta having been sealed more than 800 years ago at Runnymede, our country has led the way in telling leaders of other countries that they should respect the views of the people whom they govern.\nI voted to remain in the EU referendum, but I believe the largest ever public mandate should be respected. Parliament should deliver what the people wanted and that is to leave the European Union. In so doing, it is important that we get the very best deal possible.\nIt’s Wednesday and I have been considering what to do about the draft Withdrawal Agreement for some time now. Although it has not yet been made public, the rumours are that the UK will be locked into an EU Customs Arrangement with no say on the rules that will govern it and there will be no definite end date.\nMy decision to resign as a government minister yesterday was not an easy one. And given that, during the referendum, I had decided that on balance it was better to remain in the EU, my reason for resigning – that we would not be a sovereign nation if the draft Withdrawal Agreement was accepted – has surprised some.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_cookies/content_21.html": "We want to make this website as easy to use and helpful as possible. This sometimes involves placing small amounts of information on your computer. These are called 'cookies'.\nThese cookies cannot be used to identify you personally and are only used to improve the service offered to users of this website.\nYou can manage or disable these small files yourself in your web browser, but some features of the website may not function as a result. To learn more about cookies visit AllAboutCookies.org.\nThe cookies we use\nThe open source platform and content management system on which this website is built uses the following cookies:\n|\nDrupal |\nSESS |\nLogs the current session, Expires 21 days from the session date. |\n|\n|\n|\nhas_js |\nLogs whether or not you have javascript enabled. Expires at end of session. |\n|\n|\n|\nDrupal.tableDrag.showWeight |\nThis cookie determines whether a numeric weight is shown when a table is dragged. Expires 1 year from the session date. |\n|\n|\nGoogle Analytics |\n_gat _ga _gid |\nThese cookies are used to collect information about how visitors use this website. We use the information to compile reports and to help us improve the website. The cookies collect information in an anonymous form, including the number of visitors to the website, where visitors have come to the site from and the pages they visited |\n|\n|\nCookie control |\nCookiecontrol |\nThis cookie is set when you accept cookies from this site. Expires 2 months from the session date. |\nThird Party cookies\nSome third-party services used on this website also use cookies. These are not controlled by us, but are controlled by the service provider:\nGoogleMaps",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-backs-legislation-supporting-drivers/content_13.html": "Shailesh Vara MP is co-sponsoring a 10-Minute-Rule Bill tabled by his Parliamentary colleague, Kit Malthouse MP, who was previously Minister for Crime and Policing.\nThe Road Traffic and Street Works Bill seeks to address three issues, including the enforcement of low-level speeding offences and the way that roadworks are carried out on A roads.\nCurrently, those caught speeding up to 30 miles per hour in a 20-mile zone are given the choice of having penalty points put on their licence or attending a speed awareness course when they commit their first offence, but on subsequent occasions they automatically receive penalty points.\nHowever, the Bill would ensure that drivers only recieve speed awareness courses as a penalty at this speed range, rather than having penalty points for second and subsequent breaches.\nMoreover, Local Authorities have the power to fine drivers caught for non-speeding traffic offences, such as being caught in a yellow box junction or accidentally turning left or right when it is prohibited.\nThe Bill proposes that motorists caught in such circumstances should receive a warning letter in the first instance, which would allow drivers to learn from their mistake. Thereafter, for second and subsequent offences of the same kind, fines would be permissible, as is the case at present.\nThe Bill also deals with roadworks taking place on A roads, which are typically left unattended, often for many weeks. The Bill requires that there should at all times be at least one employee present at the works.\nThis would ensure that there is always someone working on the site, and if necessary, able to help with the traffic and congestion that occurs. It would also act as a powerful incentive to contractors to complete the works much sooner.\nFollowing the presentation of the Bill in Parliament, Mr Vara said:\n“I am very pleased to be supporting this Bill which is on the side of drivers.\n“The current penalties for speeding up to 30 miles per hour in a 20-mile zone, where someone can end up receiving penalty points for driving at 24 miles per hour, is felt by many people to be disproportionate to the offence.\n“It is also long overdue for contractors doing works on A roads to be incentivised to complete the repairs quickly, rather than leaving them unattended for weeks on end, causing much misery to drivers and their passengers.”",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_theresa-mays-one-sided-brexit-plan-has-left-us-halfway-house-pleases-no-one/content_26.html": "My decision to resign as a government minister yesterday was not an easy one. And given that, during the referendum, I had decided that on balance it was better to remain in the EU, my reason for resigning – that we would not be a sovereign nation if the draft Withdrawal Agreement was accepted – has surprised some.\nOnce the public had voted to leave, I was in no doubt that it was for Parliament to deliver on the result, irrespective of what MPs’ personal views were. I should add that I am not in favour of a second referendum. There was no mention of it during the referendum campaign and, frankly speaking, the vast majority of those who want one see this as another means of achieving what they failed to secure the first time around.\nThe Government’s route from referendum to the draft Withdrawal Agreement has been a difficult one and I confess, I have been deeply disappointed with the manner in which the UK Government has been treated by the EU. Instead of the negotiations being between two sides seeking a mutually advantageous deal, it has been a relatively one-sided affair with the EU more or less taking the lead from the start. They set the agenda and insisted that nothing could be discussed unless we agreed to a financial settlement, which we did agreeing at £39 billion.\nThereafter, the UK continued to make concessions but, significantly, none were given in return by the EU. These included the UK giving residency assurances to the three million EU citizens living in Britain as well as the unconditional offer to provide crucial security co-operation to other EU countries.\nThe Government’s intention no doubt, was that we would build up goodwill with the EU for a better deal in the future. It is, however, clear that we failed miserably in achieving this objective. In fact, the contrary is true, as was seen by the EU leaders’ cavalier treatment of Theresa May in Salzburg. European leaders do not generally treat other European leaders in this fashion. The fact is, having given the upper hand to the EU, they felt confident to behave in such an appalling manner.\nIn view of the way that the EU has dominated the discussions until now, it is to be expected that we now have a draft Withdrawal Agreement which is basically a halfway house, pleasing very few from either the Leave or Remain camps.\nThe agreement risks locking the UK in a customs arrangement indefinitely, bound by rules decided solely by the EU over which we have no say. Worse, we cannot leave this customs arrangement unilaterally.\nIn the meantime, Northern Ireland will be subject to a different relationship with the EU from the rest of the UK. As a former Northern Ireland minister, I fully appreciate the significance of not having a hard border between Northern Ireland and Ireland. But that should not be at the expense of compromising the economic and constitutional integrity of the UK.\nThe referendum result tasked Parliament to deliver a sovereign, independent UK, freed from the shackles of the EU. No amount of words can alter the fact that the draft agreement does anything but. Indeed, given the EU’s past performance and their reluctance to see us leave, there is every possibility that the UK-EU trade deal that we seek will take years to conclude.\nWe should look to the future with confidence, not fear. I accept that there will be economic turbulence in the short term as we seek to pursue our own destiny, but that should not stop us from taking a path that will allow a sovereign UK to prosper on its own terms.\nConsidering the way the EU has treated the UK, in the event that there were to be another referendum, this time I would vote to leave. And unlike before, second time around, I would have no doubts as to how I should vote.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-questions-lord-chancellor-progress-introducing-virtual-hearings/content_34.html": "Shailesh Vara who introduced virtual hearings in courts when he was a Justice Minister so cases could proceed more effectively asks the Lord Chancellor for an update on them.\nShailesh Vara (North West Cambridgeshire) (Con)\nWhen I was a Justice Minister, I introduced virtual hearings so that cases could proceed much more effectively. Will the Lord Chancellor kindly update the House on the progress of those hearings?\nThe Lord Chancellor and Secretary of State for Justice (Alex Chalk)\nI am delighted to hear from my right hon. Friend, who was such a distinguished Minister in this Department. He did indeed introduce virtual hearings in our courts, and time has proved how prescient he was, because that was the right thing to do. I welcome the recent decision by the Judicial Office to make remote hearings the default arrangement for bail applications. In a wider context, a private Member’s Bill introduced by my hon. Friend the Member for Warrington South (Andy Carter), which is currently making its way through Parliament, will amend legislation so that magistrates and judges in magistrates, county and family courts will be able to hear cases remotely when that is appropriate.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-backs-british-deaf-associations-campaign-families-have-access-sign-language/content_15.html": "Shailesh Vara MP recently attended a Parliamentary reception hosted by the British Deaf Association (BDA) to mark Sign Language Week 2024.\nThe charity is the only national deaf-led charity in the UK which represents and advocates for the signing community. They aim to “empower deaf people to fully participate and contribute to society as equal and valued citizens and to build a world in which the languages, culture and heritage of deaf people in the UK are protected, preserved and promoted.”\nMr Vara met Ms Nadia Nadarajah, a constituent from Peterborough and active member of the deaf community, along with Mr Tom Lichy, Head of Policy for BDA, and discussed with them the provision of British Sign Language education for deaf children and their families.\nIn view of the importance of sign language exposure in the very early years of deaf children’s lives, Mr Vara pledged his support for the charity’s campaign urging the Government to fund access to sign language education for the families of deaf children, the amount being just under £5 million per year. With 90-95% of deaf children being born to hearing parents with little or no experience of deafness or sign language, bridging this gap is essential to maximise their linguistic abilities.\nFollowing the reception, Mr Vara said:\n“I am grateful to the British Deaf Association for the opportunity to speak with Ms Nadarajah and Mr Lichy about their efforts to raise awareness of this issue for the over 50,000 deaf children in the UK and their families.\n“Given the pivotal role of early exposure in sign language acquisition, I very much hope that the Government will consider providing the necessary funds to provide free access to sign language for the parents of newly identified deaf children.\n“The estimated cost of just under £5 million would be well spent in better providing for thousands of children and their families.”\nPhoto: Ms Nadia Nadarajah, Rt Hon Shailesh Vara MP and Mr Tom Lichy.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_increased-abuse-mps-and-innocent-victims-their-staff/content_12.html": "Shailesh Vara writes for The Telegraph.\nThe tragic passing of Sir David Amess, a much-loved member of Parliament, has again ignited a debate as to how MPs are treated by the public.\nThe verbal and physical threats are real and the free-flowing bile and poison on social media is easily available for everyone to see and contribute to.\nOne aspect of abuse and harassment against MPs that is less public however, is the correspondence that we receive from constituents, in the hundreds, on a weekly basis. Much of it is by email although some is still by letter.\nRegrettably, the tone in some of this correspondence in recent years has become increasingly hostile and aggressive. Swear words, including referring to MPs with the “c” word is not unusual.\nThere has been a distinct difference in tone since the rise of social media, with many of the more abusive correspondence coming from individuals who have clearly taken a leaf from the book of the unpleasant side of online debate.\nWhen challenged on their unacceptable language, some constituents come back, saying there is nothing unusual in the language they are using as it is “normal” as far as they are concerned.\nTo be clear, the vast majority of constituents are respectful and, if they disagree, are able to do so in a constructivemanner.\nBefore the advent of emails, MPs used to receive about 20-25 letters a week and it was not uncommon to have one secretary working for two or three MPs. Today however, MPs can easily receive more than 25 emails in an hour and they need to employ several staff to deal with their inbox.\nA direct consequence arising from the change in tone is that while the venom is intended to be directed at MPs, it is our staff who often have first sight of the emails or end up answering the telephone when an abusive constituent calls.\nExtraordinarily, when a member of my staff once told a constituent that they were simply doing their job and there was no need to be abusive, the constituent responded by saying that anyone working for an MP should not complain. If they didn’t like the way they were spoken to, then they shouldget a different job.\nOur staff are not public figures. They are ordinary citizens simply doing a job, trying to put food on their tables and pay their rent or mortgage. Sadly, they have become innocent victims in the process.\nIt is not acceptable to abuse or harass MPs, and certainly not their staff who are private citizens simply trying to earn a living.\nAs we move forwards, the tone and quality of political dialogue must change. When there is disagreement, and there always will be, it must be done in a respectful manner.\nIf people dislike their MP, or what they stand for, the solution lies in making a change through the ballot box which is central to our democratic way of life.\nThe silent majority believes in civility and respect for others. It is time to get that message out to the minority who believe otherwise.\nShailesh Vara MP\nFormer Northern Ireland Minister",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com/content_1.html": "This website was set up and updated whilst Shailesh was a Member of Parliament.\nIn Pictures\nNews\nVara meets with Yaxley residents and developers to tackle threat of flooding\n1 February 2024\nShailesh Vara, along with representatives from Yaxley Parish Council, local residents and the Middle-Level Commissioners has met with the developers Vistry and their consultants Stantec, who are developing the Great Haddon site.\nIn Parliament",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_pm-backs-vara-local-communities-should-be-heard-and-their-voices-matter/content_30.html": "Shailesh Vara MP today spoke at Prime Minister’s Questions against the inclusion of land to the west of Peterborough City in a revised Local Plan.\nMr Vara made reference to a previous attempt to build nearly 7,000 houses near the villages of Castor and Ailsworth, against the wishes of local residents.\nHe said that at the time, working with the local community, together they were able to stop the development from going ahead.\nHowever, Mr Vara went on to say that\n“efforts are now being made to include this land in a revised Peterborough Local Plan”\nand it is\n“very important that the voice of the local community is heard”.\nHe added, it\n“is unacceptable that developments can take place in this circuitous way, especially when there is other more suitable land available in and around the City of Peterborough”.\nIn his reply, Prime Minister Rishi Sunak commended Mr Vara for his support for his local community and he agreed that the local community should have its voice heard.\nThe Prime Minister added\n“It’s important that councils bring forward Local Plans, but this must be done in close consultation with local communities, because their views matter.”\nFollowing PMQs, Mr Vara said that previous attempts to build on this “beautiful” land had been defeated and he will work closely with local residents to prevent the area from being included in the new Plan.\nHe added\n“We have had this fight once before, and it is very disappointing that those in favour of these thousands of houses are determined to press on, despite massive local opposition.\n“I will be fighting alongside the local residents to ensure that this land remains unspoilt and is not included in a revised Local Plan.”\nAttached clip shows the exchange between the two at Prime Minister’s Questions.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_about-shailesh-vara/content_22.html": "Shailesh was first elected to Parliament in 2005, representing the constituency of North West Cambridgeshire. He has since been re-elected to Parliament in 2010, 2015, 2017 and 2019.\nFrom July to September 2022 Shailesh served as Secretary of State for Northern Ireland. He has formerly served as a Minister for Northern Ireland, a Minister for Justice, a Minister in the Department for Work and Pensions and as a Government Whip.\nIn Opposition, Shailesh was Shadow Deputy Leader of the House of Commons and before being appointed to the Front Bench, he was on the Select Committee for Environment, Food and Rural Affairs.\nShailesh has also introduced two Private Members’ Bills. The first, in 2006, sought to increase the age range for women for compulsory breast cancer screening from the 50-70 age range to 45-75. Whilst the Labour Government of the time did not allow the Bill to progress it did follow the Bill’s lead and moved part-way to meeting the aspirations Shailesh pressed for.\nThe second Private Members’ Bill was in 2007 and it sought to give greater protection to house holders who tried to defend themselves and their property from intruders in their own houses. Again the Labour Government of the time did not allow the Bill to progress. However, the proposals were put into law in 2013 by the Conservative led Coalition Government.\nIn North West Cambridgeshire\nSince 2005 Shailesh has helped many people who have approached him about problems they have had with personal matters or about problems they have had with various authorities. Whether these requests have come via post, email, phone or in person at one of his regular surgeries, he has always tried his best to assist. Shailesh has also been keen to receive people’s views and has invited more than 25,000 local residents to coffee mornings so he could hear their opinions on local or national issues.\nAs well as helping individuals, Shailesh has campaigned on matters that benefit the whole community. He successfully persuaded BT to introduce broadband in the Hamptons, worked with others to ensure Hinchingbrooke Hospital’s survival and was instrumental in achieving the installation of speed cameras along the Forty Foot Road, which should help save lives on that dangerous accident hotspot. Shailesh has consistently campaigned to upgrade the A14, and has also in the past presented three petitions to the Prime Minister, in conjunction with local residents. The first concerned saving Hinchingbrooke Hospital, the second protested against the 82% increase in car parking charges at Peterborough Rail Station by GNER and the third campaigned against cuts to our local post office network.\nPersonal\nShailesh was educated at Aylesbury Grammar School and Brunel University and qualified as a solicitor. He has worked in the City and the West End of London, as well as in Hong Kong. He is married with two children.\nPrior to entering Parliament, Shailesh held various posts in the Conservative Party including being a Vice-Chairman of the Party during 2001-2005. During the period 2005-2006 Shailesh held a range of other responsibilities. These included being Joint-Vice Chairman of the All Party Parliamentary Group on Trafficking of Women and Children, Treasurer of the BBC All Party Parliamentary Group, Vice-Chairman of the Executive Committee of Conservative Lawyers and the Chairman of the Conservative Parliamentary Friends of India Group.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-supports-local-residents-campaign-against-waste-site/content_24.html": "Shailesh Vara MP today gave evidence at the appeal hearing regarding the application by Envar Composting Ltd for an expansion at their waste disposal facility on St Ives Road, Woodhurst, Huntingdonshire.\nThe hearing follows an appeal by Envar, after Cambridgeshire County Council rejected their planning application. The 8 day hearing started with opening statements by lawyers on both sides. Following this Mr Vara spoke saying that in his time as a Member of Parliament, this is one of the biggest community protests he has seen.\nAs well as citing the negative impact of a 26 metre chimney on the local rural landscape, he said that the planning application contravenes many aspects of the Huntingdonshire District Council Local Plan to 2036. This includes increased noise, light, and odour pollution.\nMr Vara went on to criticise the lack of proper public consultation, by Envar, including not seeking the views of the 6,000 residents in neighbouring villages.\nFollowing the hearing, Mr Vara said:\n“This started as a mushroom composting facility in 1965, and since then it has expanded considerably, and the local community has been very accommodating. But this application is a step too far.\n“If the proposal goes through, it will have a huge negative impact on the local community as well as local businesses, some of which are family businesses passed down through generations.\n“I very much hope this application does not go through and that the voice of the community is heard.”\nPhoto: Members of POWI (People Opposing Woodhurst Incinerator) outside New Shire Hall Alconbury, where the hearing is taking place. Shailesh Vara MP (fourth from left) and Cllr Steve Criswell (seventh from right).",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-secures-meeting-health-secretary-discuss-better-allergy-policies-schools/content_3.html": "During Prime Minister’s Questions today, Shailesh Vara MP raised the issue of children suffering from allergies and the need to ensure better safeguards for them in schools.\nMr Vara spoke of five year old Benedict Blythe, who was “a lovely little boy” and who attended a primary school in his constituency but sadly died of anaphylaxis, which is a severe allergic reaction.\nA Coroner’s Inquest has yet to report on Benedict’s tragic death, but speaking generally, Mr Vara said that “on average 2 children in every class have a food allergy and allergic reactions take place more in school than in any other setting outside the home”.\nHe went on to say that severe allergic reactions “are on the rise and can be fatal” but other than guidance for schools, there is no explicit legal requirement for the provision of “allergy medication, an allergy policy or other recommended safeguards being made available”.\nMr Vara asked Mr Sunak to meet with him and Benedict’s parents, Helen and Pete, to discuss ways “to ensure that children who suffer from allergies in schools can be more safe, including schools having an allergy policy, adrenaline pens and staff who know how to use them”.\nIn responding, Mr Sunak extended his sympathy to Benedict's family, saying “it is tragic always to hear about the loss of a child”.\nHe added “we fully understand the seriousness of severe allergies and believe that children with medical conditions should be properly supported to enjoy a full education and be safe at school.”\nHe went on to say, “there is a legal duty on the governing body of schools to make arrangements for supporting pupils, including setting out what needs to be done” and he said that he would ensure that Mr Vara had a meeting with the Health Secretary “to discuss how we could further support pupils with serious allergies.”\nFollowing the exchange in the House of Commons, Mr Vara said:\n“Benedict was a lovely little boy, and it is so tragic that he died of anaphylaxis.\n“Given that allergic reactions take place more in school than in any other place outside the home, it is vital to have more than just optional guidance for schools.\n“As matters stand, the legal duty on the governing body of schools to ‘make arrangements’ to support pupils is very weak. It is important to have an obligation for specific requirements.\n“All schools should have an allergy policy and adrenaline pens, as well as people who know how to use them. This is currently not the case in many schools.\n“I am very pleased to have secured a meeting with Victoria Atkins MP, the Health Secretary, and along with Benedict’s parents, Helen and Pete, I very much hope to make more progress in making our schools safer for those who suffer from allergies.”\nHelen Blythe, who is the Founder and Director of the Benedict Blythe Foundation which she set up in 2021 following Benedict’s death, added:\n“Over the last two years we have heard heartbreaking stories from families and teachers put in impossible positions because of a lack of legislation and funding for allergy in English schools, and across the UK. With increasing numbers of children with allergies in schools, and clinicians, coroners and charities united behind the same clear set of modest recommendations, it seems unfathomable that there’s been no firm commitment from government to implement those recommendations. As each year goes by, children are being needlessly put at risk, and more needs to be done.”",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-calls-post-office-lawyers-who-prosecuted-sub-postmasters-horizon-scandal-be-held/content_5.html": "Shailesh Vara calls on the Government to ensure Post Office lawyers responsible for prosecuting the sub-postmasters in Horizon scandal are held to account.\nShailesh Vara (North West Cambridgeshire) (Con)\nI appreciate that an inquiry is being conducted regarding the Horizon scandal, but what is the Department doing to hold to account those lawyers who prosecuted sub-postmasters despite the evidence being to the contrary?\nThe Lord Chancellor and Secretary of State for Justice (Alex Chalk)\nAnybody who appears in court, but particularly prosecutors, must be mindful of their solemn and sacred duty to disclose material to the defence that might reasonably be considered capable of undermining the case for the prosecution—that is literally the most important rule. If they failed in this case, I would expect the appropriate authorities to take robust and prompt action.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-calls-use-better-materials-repairing-potholes-and-roads/content_9.html": "During Prime Minister’s Questions today, Shailesh Vara MP raised the issue of the quality of materials being used for potholes and road repairs in his constituency and in many other constituencies across the country.\nMr Vara spoke of the “£8 billion made available by the government for the repair of roads and potholes”, saying that it was “very welcome”.\nHe went on to say however, that “some local authorities such as Cambridgeshire County Council and Peterborough City Council, which serve [his] constituency, sometimes use inferior materials so that the works need to be done again in a few months’ time.”\nHe called on the Prime Minister, Rishi Sunak, to “use his influence to ensure that there are tough quality specifications so that the repairs can last much longer”.\nIn his response, Mr Sunak said that he was “proud that [the government] had announced £8 billion for road resurfacing over the next decade” claiming that the funding would result in “fewer potholes and smoother safer roads across the country”.\nHe went on to agree with Mr Vara that “it is of the utmost importance that these repairs are completed with high quality materials”.\nMr Sunak also called on Cambridgeshire County Council and Peterborough City Council to make sure that they deliver the repairs for those living in Mr Vara’s Constituency of North West Cambridgeshire.\nFollowing his exchange with the Prime Minister, Mr Vara said:\n“The issue of potholes and road surfaces is frequently raised with me by constituents, both in terms of the work being required in the first place and also when it is eventually done, as to the poor quality of the material used.\n“It is bad enough that drivers and cyclists have to put up with potholes and poor roads, and worse still that the issue persists due to the poor quality of the material used.\n“It is so important that Local Authorities adhere to tough quality specifications so that when repairs are carried out, they last for much longer.\n“I am very pleased that the Prime Minister agreed with me that we should be using better quality materials and that he specifically called upon Cambridgeshire County Council and Peterborough City Council to address the issue for my constituents.”",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_gallery/content_2.html": "Skip to main content\nMain navigation\nHome\nAbout Shailesh\nNews\nIn Parliament\nArticles\nGallery\nToggle navigation\nMain navigation\nHome\nAbout Shailesh\nNews\nIn Parliament\nArticles\nGallery\nGallery\nPagination\nCurrent page\n1\nPage\n2\nPage\n3\nPage\n4\nPage\n5\nPage\n6\nPage\n7\nPage\n8\nPage\n9\n…\nNext page\nNext ›\nLast page\nLast »",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-calls-local-communities-be-heard-local-plan/content_33.html": "Speaking in Prime Minister’s Questions, Shailesh Vara speaks out against the inclusion of land to the west of Peterborough City in a revised Local Plan.\nShailesh Vara (North West Cambridgeshire) (Con)\nQ11. A few years ago, there was a proposal to build nearly 7,000 houses in a beautiful part of my constituency near the villages of Castor and Ailsworth, against the wishes of local residents. I worked with the local community, and together we were able to stop the development. However, efforts are now being made to include this land in a revised Peterborough local plan. Does the Prime Minister agree that it is very important that the voice of the local community is heard and that it is unacceptable that developments can take place in this circuitous way, especially when other, more suitable land is available in and around the city of Peterborough? (901705)\nThe Prime Minister (Rishi Sunak)\nMy right hon. Friend raises an important issue, and he is right to say that the local community should always have their voice heard. It is important that councils bring forward local plans, but this must be done in close consultation with local communities, because their voices matter. As I understand it, the Peterborough local plan is still under preparation and there are opportunities to provide comments on the draft plan, so I commend him for continuing to support his local community to ensure that their voice is heard.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-backs-calls-mandatory-allergy-guidance-schools/content_7.html": "Shailesh Vara calls for mandatory guidance on allergies for schools and funding being made available so that all schools have adrenaline pens and staff trained to use them.\nShailesh Vara (North West Cambridgeshire) (Con)\nI congratulate my hon. Friend and constituency neighbour on securing this important debate, and on the fact that although Adjournment debates are normally lonely affairs, others are present for this one. Does she agree that the cost the Government would incur in helping schools to provide, for example, adrenaline pens is, in the overall scheme of things, very small indeed, and should not be a barrier to supplying schools with a little bit of extra cash to procure a few adrenaline pens which may save lives?\nAlicia Kearns (Rutland and Melton) (Con)\nMy right hon. Friend is right, and I pay tribute to him for raising this issue during Prime Minister's questions only last week on behalf of Benedict and his family. Other countries have taken action, and we have the opportunity to do the same.\nThe Benedict Blythe Foundation has worked tirelessly under Helen’s leadership to investigate the issues facing pupils with allergies, and—most importantly—to make policy recommendations to solve them.\nShailesh Vara\nI know the Minister is diligent, conscientious and caring in all that he does, and the tone he is adopting clearly shows that. While he is absolutely right that there is legislation and guidance for schools as to how to deal with this issue, I and others would say that it is too general in nature, and it leaves much discretion with the schools as to what precisely they do in the event of a child having an allergic reaction. I urge him to reflect and to consider tightening the laws, so that they become mandatory. That should be in a limited way, but nevertheless we need some mandatory rules for schools, rather than them being left as general and vague as they are at present.\nThe Minister for Schools (Damian Hinds)\nI am grateful to my right hon. Friend, and I acknowledge the gravity of what he says. Of course, we are talking about conditions that can be very varied, and the responses that are called for can be quite different. Schools know their pupils almost best; they, working with parents, who absolutely know their children best, are in the best place to enact that. I want to be clear that the guidance that accompanies what I have just been outlining is statutory guidance supporting pupils with medical conditions. It is not voluntary, and governing bodies must have regard to it when carrying out their duties.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_second-referendum-would-mock-democracy/content_23.html": "6 January 2019\nA second referendum would mock democracy\nAcross the globe the United Kingdom is at the forefront for championing the principles of democracy. Underpinned by the rule of law, with Magna Carta having been sealed more than 800 years ago at Runnymede, our country has led the way in telling leaders of other countries that they should respect the views of the people whom they govern.\nPrime ministers, ministers and backbenchers from across the political divide have regularly stood in parliament and espoused the value and need to respect democracy.\nWe are now, however, at a dangerous crossroads because the UK’s hard won reputation to uphold the principles of democracy is threatened by those who seek a second referendum on whether we should leave the European Union.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-calls-use-better-materials-repairing-potholes/content_25.html": "Speaking in Prime Minister’s Questions, Shailesh Vara welcomes the £8million set aside for pothole repairs and calls for a higher standard of quality specification to be used for materials to ensure the repairs last longer.\nShailesh Vara (North West Cambridgeshire) (Con)\nQ5. I, too, welcome back my hon. Friend the Member for South Thanet (Craig Mackinlay). The £8 billion made available by the Government for the repair of roads and potholes is very welcome; however, some local authorities, such as Cambridgeshire County Council and Peterborough City Council, which serve my constituency, sometimes use inferior material, so the works need to be done again in a few months’ time. That is an issue that applies to many constituencies across the country, so will the Prime Minister use his influence to ensure that there are tough quality specifications, so that the repairs can last much longer? (903005)\nThe Prime Minister (Rishi Sunak)\nI am proud that we have announced an additional £8 billion for roads resurfacing over the next decade—money made available through the reallocation of HS2 funding. That will mean fewer potholes and smoother, safer roads across our country, but I agree with my right hon. Friend that it is of the utmost importance that these repairs are completed with high-quality materials. I join him in calling on Cambridgeshire County Council and Peterborough City Council to make sure that they deliver that for his residents.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-gives-support-wateraid/content_27.html": "Shailesh Vara MP met with representatives of WaterAid at the House of Commons to discuss the lack of clean water and proper sanitation for millions of people in some of the world’s poorest countries.\nWaterAid is an international charity dedicated to increasing access to clean water, decent sanitation, and better hygiene for all. Operating in 22 countries, the charity installs clean water systems such as wells, taps and toilets where they are most needed; in addition to their work training local people to manage and maintain them.\nSince 1981, WaterAid has helped 28.5 million people with clean water, 29 million with decent toilets and 27.8 million with good hygiene.\nGlobally, one newborn dies every minute from infections caused by a lack of clean water and an unclean environment, and a child under 5 dies from diarrhoea caused by dirty water and poor toilets every two minutes.\nMr Vara discussed the importance of collaborating with communities to raise awareness of the issues, and the need for continued global support to ensure that there is accessibility of clean water, toilets and proper hygiene practices for those who need it.\nFollowing the meeting, Mr Vara said:\n\"It is clear that continued action is needed to ensure that many more millions of people are able to have access to clean water and better sanitation.\n“It is good to see WaterAid working to improve the life chances of some of the poorest people in the world, and it is important for the UK to continue working with our international partners to support such efforts.\n“In the UK, we take such matters for granted, but this is a life-or-death issue for far too many.”\nPhoto: Rt Hon Shailesh Vara MP with a representative of WaterAid",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_better-deal-would-solve-backstop-problem/content_17.html": "I voted to remain in the EU referendum, but I believe the largest ever public mandate should be respected. Parliament should deliver what the people wanted and that is to leave the European Union. In so doing, it is important that we get the very best deal possible.\nThe current Withdrawal Agreement is clearly unsatisfactory, and that is why I resigned from my ministerial post in the Northern Ireland Office. The bedrock of dissent has been about the backstop.\nIt strikes at our nation’s soul and imperils our Union by treating Northern Ireland differently to the rest of the UK. If we signed up to it, we would be trapped under the thumb of the EU as its satellite, obeying its laws without a say, unless the EU and its members gave permission for us to leave.\nThe backstop would place the UK in a “single customs territory”, causing two fundamental problems for our post-Brexit trading relationships.\nFirst, it would stop us from being able to strike trade deals with non-EU countries, as it would bar us from controlling our tariffs and regulations. Without control in these areas, we would be useless to any prospective trading partner.\nSecond, with regard to the UK-EU trading relationship, the backstop would create a climate which lends itself to continued EU belligerence. The EU would have no incentive to make concessions in future trade negotiations.\nOnce member states have the ability to wield the threat of plunging us into the backstop – and keeping us there indefinitely – we will have no alternative but to make concessions we don’t want to. The Spanish could use Gibraltar as a bargaining chip and the French could demand continued access by EU boats to UK fishing waters. We can’t possibly let the backstop hold our future trade talks hostage in this way.\nSo we need a new approach – A Better Deal – and that what’s been published by a team of legal and customs experts. It is supported by remainers like me, by leavers such as David Davis and Dominic Raab and crucially, the DUP. It doesn’t throw out the Prime Minister’s plan. Indeed, it retains the vast majority of the draft Withdrawal Agreement, whilst identifying and removing the poison pills that have prevented it from finding cross-party support.\nA Better Deal provides the Government with an alternative vision to present to Brussels. It is likely to command support in Parliament, closely resembles the offer made by the EU itself last March and honours the referendum result.\nOur proposal would restore – rather than destroy – the UK’s leverage for future trade talks with the EU. It safeguards the integrity of the United Kingdom, since it doesn’t treat Northern Ireland differently to the rest of the UK, and it would allow us to be a credible trade partner for third countries after 29th March 2019.\nA Better Deal bins the divisive and ill-thought-through Northern Ireland Protocol and replaces it with an extendable backstop. The new backstop would allow us to control our own tariff schedules and regulations – so it’s not an inherently negative situation for the UK to be in.\nIn fact, some may even argue that under our proposal the backstop becomes a “front stop” – and for that reason, no EU country could use it to cajole us into having to agree to a set of appalling terms from Brussels which would let British consumers and businesses down.\nThe new backstop would provide for tariff-free trade in goods; it would bring about regulatory cooperation between us and the EU as well as regulatory recognition based on “deemed equivalence” – making use of the unique fact that our regulations will be identical on day one of Brexit.\nThis new and reformed backstop include an agreement to deploy advanced customs and trade facilitation measures, including any specific measures necessary for the Northern Ireland/Ireland border, in addition to normal, free trade agreement-style level playing field provisions on labour, the environment, competition and state aid – unlike the hugely one-sided commitments in the Withdrawal Agreement. And importantly, it will include a commitment by all parties not to place infrastructure on the border – nobody wants to see that.\nBrussels wants to do a deal with us. They offered us a free trade deal back in March, and I suspect that the EU negotiators have been surprised at our inability to grab what is on offer.\nWe have a chance to put our future prosperity in our hands as we become a great, self-governing, free trading nation once again. The proposals in A Better Deal will, I believe, meet with the approval of many of my colleagues in Parliament as well as the public. It stays loyal to the Belfast Agreement, avoids a hard border and allows us to leave the arrangement, should we wish to do so. The UK is crying out for a better deal. Let’s make sure we deliver it.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-calls-expeditious-dealing-postmasters-cases/content_31.html": "Shailesh Vara MP has called on Post Office Minister, Kevin Hollinrake MP, to ensure that claims by Postmasters are dealt with quickly and efficiently.\nFollowing a Ministerial Statement, Mr Vara congratulated Mr Hollinrake for working “night and day to bring this painful issue to a conclusion”.\nMr Vara also sought assurances from the Minister regarding those Postmasters who did not wish to accept the fixed sum offer, but instead wished to pursue a personal claim. He asked that they are given “expeditious treatment” to ensure that their claims are concluded as swiftly as possible.\nHe also asked for claimants to be provided with a named claims manager, rather than having to deal with random individuals.\nIn his reply, Mr Hollinrake gave an assurance that the Government would support those wishing to pursue a personal claim and would work to “significantly abbreviate the timescale” for their claims.\nMr Hollinrake also said that he would reflect further on Mr Vara’s suggestion for named claims managers.\nFollowing the exchange, Mr Vara said:\n“I am very pleased to see that further progress is being made to support all those affected.\n“These Postmasters and their families have suffered greatly, over a number of years, and every effort must be made to ensure that they are properly compensated and that this is done as quickly as possible.\n“It was reassuring to hear the Minister’s response, particularly as regards the speed of processing claims, and I very much hope to see that there will also be named claims managers for claimants.”\nAttached video shows exchange between Shailesh Vara MP and Kevin Hollinrake MP.\nShailesh Vara MP has called on Post Office Minister, Kevin Hollinrake MP, to ensure that claims by Postmasters are dealt with quickly and efficiently.\nFollowing a Ministerial Statement, Mr Vara congratulated Mr Hollinrake for working “night and day to bring this painful issue to a conclusion”.\nMr Vara also sought assurances from the Minister regarding those Postmasters who did not wish to accept the fixed sum offer, but instead wished to pursue a personal claim. He asked that they are given “expeditious treatment” to ensure that their claims are concluded as swiftly as possible.\nHe also asked for claimants to be provided with a named claims manager, rather than having to deal with random individuals.\nIn his reply, Mr Hollinrake gave an assurance that the Government would support those wishing to pursue a personal claim and would work to “significantly abbreviate the timescale” for their claims.\nMr Hollinrake also said that he would reflect further on Mr Vara’s suggestion for named claims managers.\nFollowing the exchange, Mr Vara said:\n“I am very pleased to see that further progress is being made to support all those affected.\n“These Postmasters and their families have suffered greatly, over a number of years, and every effort must be made to ensure that they are properly compensated and that this is done as quickly as possible.\n“It was reassuring to hear the Minister’s response, particularly as regards the speed of processing claims, and I very much hope to see that there will also be named claims managers for claimants.”\nAttached video shows exchange between Shailesh Vara MP and Kevin Hollinrake MP.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-calls-lessons-be-learned-and-acted-result-post-office-horizon-scandal/content_18.html": "Shailesh Vara makes interventions in the debate on the Second Reading of the Post Office (Horizon System) Offences Bill which will quash convictions resulting from the Post Office Horizon scandal. He calls for lessons to be learned and acted on, including looking at those who produced the evidence in the first place.\nShailesh Vara (North West Cambridgeshire) (Con)\nI thank the hon. Gentleman for giving way; he is being generous with his time. Does he also agree that we must look not only at how lawyers have handled this but, more importantly, at those who produced the evidence in the first place to persuade prosecutions? I hope he will agree that lessons must be learned by those who blindly said, “These people are probably guilty” and built up a case around that when, as we have found, that was not the case.\nJonathan Reynolds (Stalybridge and Hyde) (Lab/Co-op)\nI thank the right hon. Member for making those powerful points, which reflect on the nature of the evidence that was given. One of his hon. Friends has already made the point about the role of technological, computer-based evidence in the legal process. To be frank, there is also the Post Office’s approach to the data as it saw it, which I assume it believed to be a way of unveiling wrongdoing, rather than questioning that data. Most of our constituents ask, “How could the number of convictions have gone from five or six a year to 50 or 60 without that being flagged in some way?” Clearly, the powers that be—at the time—thought the data was revealing wrongdoing, rather than necessarily revealing something going wrong.\nShailesh Vara\nI am most grateful to the hon. Lady, who has been very generous in giving way. She says that the Scottish Government want to see what happens here. We have heard that a Bill can be passed in three days. Once the Bill goes through this place, then in a matter of days, not weeks, it can be replicated in Scotland and passed in 72 hours. Given that the matter has been going on for years and years and years, I fail to see what the big issue is with having a few days more so that a Bill can get through in Scotland.\nMarion Fellows (Motherwell and Wishaw) (SNP)\nThere is absolutely no guarantee that it would just be a few days more. There are the different timings of Scottish Parliament sittings and a lot of other considerations that the right hon. Gentleman will not know about and does not normally need to know about. I will be seeking to amend the Bill—I will take advice and then attempt to do what is going to be done for Northern Ireland. I am well aware that that may seem a futile exercise to some, but this is democracy and this is what has to be done from a Scottish perspective, and I am more than happy to take that on.\nShailesh Vara\nThose are the people who received the awards, but does my hon. Friend agree that an award is due for every single sub-postmaster?\nPaul Scully (Sutton and Cheam) (Con)\nFor sure. We cannot do enough for these people. They have been cast out as pariahs in their communities. They have been charged, they have been put in prison, they have lost houses, families and health, because of a body that is ultimately owned by the state. We, as a collective body, have destroyed these people’s lives. There is not enough that we can do for them.\nShailesh Vara\nI commend my hon. Friend for a very passionate and committed speech. The point about learning lessons is crucial. I fear, as do others in this Chamber, that in the old times we would say that the file is sitting on a shelf, collecting dust; nowadays, it would be archived and just stay there. Does my hon. Friend agree that serious attention needs to be paid to ensuring that we learn from this episode and the countless other occasions when things go wrong? There needs to be some sort of set-up to make sure that other bodies—voluntary organisations or those at arm’s length—actually take on board what has been said.\nPaul Scully\nAbsolutely; that is a really good case in point. I hope my right hon. Friend will be in the next Parliament to help drive this through. I have said I am stepping down, so I will not see Sir Wyn Williams’s final report—not from these Benches, anyway. I hope the House takes it to heart and drives through the lessons learned.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_commons-diary-shailesh-vara/content_11.html": "It’s Wednesday and I have been considering what to do about the draft Withdrawal Agreement for some time now. Although it has not yet been made public, the rumours are that the UK will be locked into an EU Customs Arrangement with no say on the rules that will govern it and there will be no definite end date. Nor a provision for the UK to unilaterally leave the customs arrangement. Moreover, Northern Ireland will have greater alignment with Ireland than the rest of the UK, effectively compromising our constitutional and economic integrity. If that is true, then I will not be able to support it, which obviously means resigning as a minister in the Northern Ireland Office.\nI am however keen to see the Draft Agreement before deciding as I remain hopeful that my apprehensions may be eased.\n---\nReading the agreement into the early hours of Thursday morning, with the help of lots of black coffee, I conclude that my concerns have not been addressed.\nI have been a Member of Parliament for over 13 years, fought six general elections and been loyal to the Conservative party throughout. My decision is not easy, but I have made up my mind. I see no point in delaying the inevitable. Just before 07.30, I submit my resignation – the first Minister to do so following the release of the draft agreement. I then tweet a copy of my letter of resignation. Within minutes my phone is ringing, and I am on the Today programme just after 08.00 explaining my position.\nThe Prime Minister is making a statement at 10.30 in the Commons. I enter the Chamber and stand at its entrance along with several other MPs. Colleagues across the party divide with different views on Brexit greet me warmly; people recognise that resigning isn’t easy.\nI listen to the Prime Minister and Jeremy Corbyn and return to my office. There are endless media requests and I organise my diary for the day – one interview after another, shuttling between Central Lobby, College Green and Millbank.\n---\nFriday is an early start. I’m on College Green at 06:00 and it’s near freezing temperatures as I do more interviews. The producers are well stocked with warm drinks and kindly offer me some too. With interviews completed by 08.30, life begins to return to normal and I turn my attention to constituency matters.\nI am interrupted during the day by a phone call from the Northern Ireland Office. There is sadness on both sides and then “err, can we please have back your departmental pass, phone and iPad”. “Of course,” I say, and we make arrangements for their pick up.\n---\nThe weekend is a mixture of constituency matters, media and a little catching up on sleep. I reply to the many friends and colleagues who have contacted me following my resignation, as well as to constituents and the general public of whom the overwhelming majority are supportive of my decision.\n---\nIn the Commons on Monday there is an Urgent Question on the demise of Johnston Press who own the Peterborough Telegraph in my constituency. I ask my good friend Jeremy Wright, the Secretary of State at the Department for Culture, Media and Sport for an assurance that in the event of there being redundancies, the new owners of the Peterborough Telegraph be asked to provide more than just the minimum statutory help to those affected.\nThe political debate continues to be dominated by Brexit but there is also discussion about a vote of no confidence in the Prime Minister. I make clear that my concern is not with the individual but with the agreement that I am being asked to vote on. I cannot support an agreement that I do not believe is in the national interest and would deny the UK freedom from the shackles of the EU and prevent us from pursuing our destiny as a sovereign nation.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_parliament_vara-calls-safer-schools-children-allergies/content_28.html": "Speaking at Prime Minister’s Questions, Shailesh Vara called for better safeguards and support in schools for children with allergies and secured a meeting with the Health Secretary to discuss this further.\nShailesh Vara (North West Cambridgeshire) (Con)\nQ14. Five-year-old Benedict Blythe was a lovely little boy who attended a primary school in my constituency. Sadly, he died of anaphylaxis, a severe allergic reaction. The coroner’s inquest has not yet reported, but on average, two children in every class have a food allergy, and more allergic reactions take place in school than in other setting outside the home. Severe allergic reactions are on the rise and can be fatal, yet there is no explicit legal requirement for schools to have allergy medication and an allergy policy, or for other recommended safeguards to be made available; there is only guidance. Will the Prime Minister meet me and Benedict’s parents, Helen and Pete, so that we can discuss a way forward to ensure that children who suffer from allergies can be safer in school, including by ensuring that schools have an allergy policy, adrenalin pens, and staff who know how to use them? (902740)\nThe Prime Minister (Rishi Sunak)\nFirst, may I extend my sympathy to Benedict’s family? It is always tragic to hear about the loss of a child. We fully understand the seriousness of severe allergies, and believe that children with medical conditions should be properly supported to enjoy a full education and be safe at school. There is a legal duty on the governing body of schools to make arrangements for supporting pupils, including setting out what needs to be done, symptoms and treatment, but I will ensure that my right hon. Friend gets a meeting with the Health Secretary to discuss how we could further support pupils with serious allergies.",
  "https_www_shaileshvara_com_/https_www_shaileshvara_com_news_vara-calls-horizon-scandal-lawyers-be-held-account/content_4.html": "Former Justice Minister Shailesh Vara MP today spoke in the House of Commons to hold to account the Post Office lawyers responsible for prosecuting the sub-postmasters affected by the Horizon scandal.\nWhilst recognising that there is currently an inquiry being conducted into the scandal, Mr Vara asked the Secretary of State for Justice, Alex Chalk KC MP, what his Department was doing to\n“hold to account those lawyers who prosecuted sub-postmasters despite the evidence being to the contrary?”\nIn a robust reply, the Lord Chancellor said that\n“Anybody who appears in court, but particularly prosecutors, must be mindful of their solemn and sacred duty to disclose material to the defence that might reasonably be considered capable of undermining the case for the prosecution” and added that this was “literally the most important rule.”\nHe went on to say that\n“if they failed in this case, [he] would expect the appropriate authorities to take robust and prompt action.”\nFollowing the exchange, Mr Vara said:\n“The manner in which the sub-postmasters were treated is appalling and those responsible must be brought to account.\n“I am grateful to the Lord Chancellor for his robust and very clear response to my question.\n“There have clearly been failures in the legal process, as well as by some of the lawyers acting for the Post Office. Those failings need to be thoroughly investigated, and action taken where necessary.”"
}