{
  "http_victoriaprentis_com_/http_victoriaprentis_com_about-rss/content_26.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_category_Local-News/content_32.html": "Dissolution Update 29th May 2024 At midnight tonight, Parliament will be dissolved. From that point, there will no longer be any MPs until after the General Election which will take place on 4... Local News\nHomes for Hooky Open Day 20th May 2024 Fascinating visit to the Homes for Hooky Open Day. The Hook Norton Community Land Trust set out in 2019 to develop affordable homes that meet the needs of their... Local News\ndpa Lighting 17th May 2024 Great to be invited back to dpa Lighting in Clifton! I enjoyed catching up with Nick Hoggett and hearing more about the projects his growing team of lighting... Local News\nOxfordshire Artweeks and Katharine House Hospice Open Garden 7th May 2024 I enjoyed getting out and about over the Bank Holiday weekend, at least while the rain held off! Oxfordshire Artweeks is the UK’s largest open studio and pop-up... Local News\nChiltern Railways meeting with Transport Secretary 1st May 2024 On Monday, my fellow Chiltern MPs and I sat down with the Transport Secretary in Parliament. We called for the meeting in order to raise our constituents’... Local News\nBloxham Grove 30th April 2024 I had a wonderful time visiting Bloxham Grove earlier this month. It is an amazing school dedicated to supporting children with special educational needs and... Local News\nBanbury 20mph Consultation 28th November 2023 Oxfordshire County Council has launched a public consultation on its plans to introduce a 20 mph zone covering much of Banbury, including the town centre. The... Local News\nResponse to Draft Local Plan Consultation 13th November 2023 In recent weeks, Cherwell District Council held a consultation on the draft Cherwell Local Plan 2040. Local Plans are really important as they provide a... Local News\nOfsted Report into Oxfordshire SEND Services 15th September 2023 Today, Ofsted and the Care Quality Commission (CQC) have published their report into the Oxfordshire Local Area Partnership’s Special Educational Needs and... Local News",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_banbury-community-food-pantry/content_14.html": "I was pleased to get along to Banbury Community Food Pantry’s recent coffee event. Founder Andrew Wickham told me more about their hard work to provide food for those most in need, with the support of big chains like Tesco, M&S, Greggs, Nando’s and KFC. Their £1-a-visit policy means anybody can access healthy food without any hassle.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_cookies/content_15.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_banbury-samaritans/content_19.html": "I had a really insightful meeting with the team at Banbury Samaritans last week.\nManager Hannah Swirsky and her team provide safe, around the clock support for those in need. We discussed their efforts to increase awareness of their services within rural communities, supported by the NFU, which is an excellent initiative. Across the UK, volunteers respond to a call for help every 10 seconds.\nI was particularly interested to learn more about their online chat for the hard of hearing. This is an important step towards inclusivity, making sure everyone can access support.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_katharine-house-hospice/content_11.html": "I was pleased to visit Katharine House Hospice in Adderbury last week where I met CEO Emma Radley and Chair of the Board Sir Tim Jenner.\nKatharine House has been undergoing significant refurbishments to enhance its facilities. The hospice has increased bed space by 25% this month which will allow the team to improve the support they are giving to patients with life limiting conditions.\nKatharine House Hospice is an incredibly special place in our community, supporting over more than 1,300 patients with life limiting conditions each year. It was good to hear how well the team have been getting on and to see some of the refurbishments that have taken place which will enable the team to continue providing high-quality care to those they look after. I think we can all agree just how well the partnership between Katharine House Hospice and Oxford University Hospitals has been going. Working in such a joined-up way has brought with it many advantages including improved specialist care.\nIt is important that we carry on doing everything we can to support and protect our much loved local hospice.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_chancellor-breaks-ground-siemens-healthineers-site/content_12.html": "It was great to join the Chancellor in Bicester on Friday to break ground on a new state-of-the-art facility for Siemens Healthineers. The site on the side of the A41 was chosen by Siemens following a global search for a new headquarters for the production of superconducting magnets used in their life-saving MRI technology.\nOnce constructed, the facility will support over 1,300 jobs, representing a £250 million investment into our local economy. This is exactly the right kind of development we need locally. Building here is a vote of confidence in our economy and demonstrates that North Oxfordshire remains at the top of the list of destinations for companies to invest.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_columns/content_25.html": "April 2024\nWhile overall crime in the UK has been falling for some time, I know that this is not a reality recognised or enjoyed by all. That is why the Government is focused on ensuring that crime prevention, community engagement and targeted interventions sit at the very heart of local policing through the Beating Crime Plan.\nThese are priorities shared by Thames Valley Police who are working hard to support victims, fight crime and build trust in policing. We know that Community Safety Partnerships have proved a real success, allowing our police, local authorities and other agencies to work in a more joined-up way. The 15% increase in partnership funding over the next four years will strengthen our collective ability to tackle the root causes of crime.\nTVP have exceeded the Government’s Uplift programme target by recruiting an additional 784 police officers within the last 3 years. This has given us a greater police presence in Banbury and the surrounding villages with more resources to prevent and tackle crime. A few weeks ago, I had the opportunity to see some of the important work carried out by our local police firsthand by joining the police force for a “ride along”. The day started early with the morning briefing at Banbury Police Station before I went out with two of our local police officers on their morning patrol. It was a very valuable experience where I learnt more about the challenges our town is facing and how they are working hard to tackle issues including anti-social behaviour, county lines and violent crimes.\nWe are all very aware of the challenges associated with anti-social behaviour which is having a real impact on local businesses and residents in our town centres. Although often seen as a low-level crime, persistent anti-social behaviour can blight communities, create a climate of fear and soon escalate to more serious crime. I have been assured that a number of prolific offenders have been arrested and TVP are actively engaging with Cherwell District Council and other organisations. Operation Jin has been launched in an effort to tackle this ongoing issue and residents are being asked to share their views: https://orlo.uk/sTc48.\nAnother challenge is the rise in keyless car thefts which is a problem facing police forces nationally. TVP have been advising residents to take extra precautions including storing their vehicle keys in a metal tin away from the front of the property as well as using steering locks.\nI know that rural crime is also something that worries my constituents. That is why I will be hosting a Rural Crime Forum on Tuesday 9 April at Hook Norton Brewery. This will be an opportunity for constituents to hear more about the work being done to tackle rural crime locally and put questions to our Police and Crime Commissioner.\nIt is so important that people feel safe in their community and live without fear of crime. When people have reason to call the police, they need to have full confidence in the initial and ongoing contact they have. Although TVP answer 999 calls in an average of 11.54 seconds, greater investment in the 101 telephone service will open new ways to report crime. I will continue to work closely with our local Police Force, including our Local Area Commander, Superintendent Jen Hogben, to support them and ensure they have the resources they need to keep our streets safe.\nMarch 2024\nThe River Cherwell is a much-loved stretch of water that flows through the constituency here in north Oxfordshire, rising in Northamptonshire and ending in Oxford. We are all understandably concerned about what is being done to safeguard our river which is why I welcome the steps the Government has taken over the past two years to improve our water system as a whole.\nWhile the use of storm overflows are necessary to prevent sewers from backing up and flooding into streets and people’s homes, releasing untreated sewage into rivers is unacceptable. Since 2010, the monitoring of storm overflows has significantly improved from just 7 per cent to now 100 per cent. This has revealed the serious problems we are facing while allowing greater transparency with the public so we can all hold water companies and polluters to account.\nThe Government has been working hard to improve the situation. Building on our landmark Environment Act 2021, the Environmental Improvement and the Storm Overflows Discharge Reduction plans give regulators stronger powers to tackle pollution with legally binding targets placed on water companies. Our integrated Plan for Water, launched in April 2023, aims to clean up our waters and ensure a plentiful supply for the future.\nMy family have always enjoyed our summers swimming in the river in the great spot between North Aston and Somerton, and it is fair to say I have a keen interest in water quality. In December 2022 I met Thames Water representatives at the Banbury Sewage Treatment Works they told me about what they are doing to take responsibility and make improvements to our local water quality. While the frequency and duration of discharges in Banbury have decreased significantly in recent years, there is much more still to do.\nWater quality was a central part of my discussions with the Environment Agency when I saw them at the Banbury Flood Alleviation Scheme in early February. Since the start of 2024 we have seen heavy rainfall across it our area which has created significant challenges for organisations like Banbury United FC who have had to postpone and cancel various football matches. The Mill Arts Centre was also badly affected. Were it not for the Flood Alleviation Scheme, flooding would have been far more widespread.\nFebruary 2024\nA tragedy is unfolding in the Middle East; Israel has suffered the worst terror attack in its history at the hands of Hamas, and Palestinian civilians in Gaza are experiencing a humanitarian disaster. There is no perfect formula for peace, but we can be sure that leaving Hamas in power in Gaza would be a permanent roadblock to a two-state solution.\nThe Prime Minister has been clear that ahead of a permanent ceasefire, the Government wants to see immediate and sustained humanitarian pauses. This will allow a window for hostages to leave and more aid to enter Gaza. I know that my ministerial colleagues continue to use all the diplomatic tools at the UK’s disposal to bring about a long-term political solution which enables both Israelis and Palestinians to live in peace.\nAt the same time, Houthi attacks on merchant and naval ships in the Red Sea are risking lives, exacerbating the humanitarian crisis in Yemen and disrupting international trade. We have been working to de-escalate tensions and restore stability in the region, but the Prime Minister has been clear that we will not hesitate to defend lives and ensure the free flow of commerce in one of the world’s most critical waterways in the face of continued threats.\nAs war persists on European soil, I welcome that the UK will be providing £2.5 billion in military aid to Ukraine in 2024/25. It has been almost two years since the war began in February 2022. We have been one of the largest aid donors in that time; over £7 billion in military assistance and £4.6 billion in non-lethal aid has been committed to ensure Ukraine’s victory on the battlefield. Under Operation Interflex, more than 30,000 Ukraine recruits have undergone soldier training in the UK to develop and prepare them to defend their homeland.\nI know that many constituents have been playing their part, whether through hosting a family in need or volunteering to set up collections for supplies to be transported to those who have sought refuge on the Ukrainian border. Our community spirit locally is something we can all be really proud of.\nIn providing that vital reassurance against Putin’s menace, 20,000 service personnel from the Royal Navy, the British Army and the Royal Air Force will deploy across Europe to take part in Exercise Steadfast Defender 24 this year. This will see our Armed Forces join thousands of personnel from 31 NATO allies and Sweden in the largest NATO manoeuvre since the end of the Cold War.\nWith our adversaries busy building barriers and redrawing battle lines, it is vital that our Armed Forces are readily able to meet the challenges of today and tomorrow. Through ‘Future Solider’, the Government is undertaking the most significant modernisation programme in a generation. We must adapt to these growing threats and ensure that our Army can compete successfully in the grey-zone between peace and war.\nThis Government will always back our serving troops. They protect and defend our freedom every day of every year which we are all enormously grateful for. I know that the Prime Minister equally remains focused on ensuring that the UK is the best country in the world to be a veteran. With over 4,500 veterans living locally, Banbury has very strong links with our Armed Forces community, with the Armed Forces covenant a central focus of charities, businesses and local authorities in our area.\nJanuary 2024\nThe Christmas period is often a time for reflection as the year draws to a close. As I write this New Year message, I can’t help but think of all those who lost their lives in 2023 in conflicts and humanitarian disasters around the world. These are undoubtedly dangerous times.\nAs The King reminded us in his second Christmas broadcast, our sense of shared values is now more important than ever. Care, compassion and community are what bind us together. His Majesty’s coronation was definitely a high point of 2023 for many of us, who are confident the monarchy is in good hands.\nAlthough the years following the pandemic are certainly tough economically, it is good news for everyone that inflation has more than halved since October 2022 to 3.9%. The Chancellor’s plan for the economy seems to be working, but I know many families are still struggling with high prices. That is why it is so important that the Government continues to prioritise measures that help with cost of living pressures this year.\nAlongside our strong sense of community in Banbury, one of the things we can be most proud of is our extremely low rate of unemployment as a result of the widespread opportunities we have locally. I was fortunate enough to visit many of our fantastic local employers last year including for example DCS Group and TWE Haulage. Our hundreds of fantastic small businesses really are the lifeblood of our towns and villages which is why we must continue to go out and support them.\nLast summer we marked 75 years of our NHS. I know that we are all grateful for the incredible work NHS staff do each day, particularly given the enormous pressure they have faced this past year. Alongside visiting the South Central Ambulance Service northern headquarters in Bicester and many of our general practices, I have as ever visited the Horton for meetings with the Trust throughout the year. There is good news; in 2023, we saw significant investment arrive onsite through the introduction of a new CT scanner, the opening of the new ophthalmology unit and funding for decarbonisation projects. I will continue to work to ensure we get the funding we need. It would be good to do some tidying up of the site this year too; great medicine happens at the Horton, but I think we can all agree the buildings look well used.\nOne of the best parts about being a Member of Parliament is getting out to our brilliant local schools to meet teachers and pupils. I want to make sure that all children have good access to high quality education. As a historically underfunded local authority, I welcomed the news that core schools budget will be the highest it has been in real terms for the 2024/25 academic year. I also remain focused this year on helping to drive change in Special Educational Needs provision in our county.\nHelping my constituents is at the heart of my work as your Member of Parliament. 2023 was a busy year for me and my four staff members who support me. I received over 16,000 casework emails, held regular constituency surgeries in both Banbury and Bicester and enjoyed a number of stops at our local pubs as part of my Summer and Autumn Pub Tours. Alongside visits to schools, businesses and local events, my Christmas card and Coronation card competitions were particular highlights in 2023, as was my ninth Cherwell Democracy Challenge with local sixth form students. I look forward to everything 2024 has in store, meeting more of you and helping all those who reach out to me for assistance.\nMay I take this opportunity to wish you all a very happy and healthy 2024.\nNovember 2023\nA key part of my role as your local Member of Parliament is answering correspondence from constituents, whether that be emails, letters or telephone calls. Over the past year, more than 50 parents and carers have got in touch with me about their experience with Children’s Services at Oxfordshire County Council and I have met many more at local community groups. It has been clear to me for some time now that Special Educational Needs and Disability (SEND) provision across the county is not where it should be. Constituents tell me of the difficulties they have faced to have their voices heard. Missed deadlines, non-attendance at statutory meetings and exclusion from important decisions about their child’s future regularly feature in parents’ complaints.\nWhen I met the Minister for Children, Families and Wellbeing in March, I was told that the Department for Education knew that Oxfordshire parents were concerned about the retention of specialists, compliance with Education and Health Care Plans and the lack of school places for children with additional needs across the county. Three months later, Ofsted and the Care Quality Commission carried out an inspection into the provision. Over 2,000 parents and carers took the time to share their experiences with Ofsted – well above the average for an inspection. The final report – which was published in September and highlighted “widespread and systemic failings”. This evidenced my long-held concerns and those of my fellow Oxfordshire MPs.\nFor too many children, when they can't manage in a mainstream school, they end up missing key parts of their education as they have to adjust to school on a part-time basis or rely on home learning. I know of some children who have been without educational provision for more than six years. The County Council needs to do much better. It is now time for them to right their wrongs, overhaul their processes and restore confidence in the system. I am having regular meetings with some of the Council leadership, including Chief Executive Martin Reeves. He has given me his personal assurances that SEND is his top priority and has explained how things are changing.\nI am hopeful that they have been given a long-overdue wake up call. The promises that have been made must deliver the improvements we need to see. These are some of the most vulnerable children and their parents are at their wits end. Anyone with concerns should contact me via [email protected].\nOctober 2023\nThe Prime Minister recently outlined his practical and realistic approach to reaching net zero. Being honest about the costs does not mean we are losing our ambition or abandoning commitments. Far from it. We really lead the way on tackling climate change and this will carry on, but now in a sensible way that is still stretching but we can achieve if we try hard.\nIn recent months, many constituents have got in touch with me about the previously planned ban on properties replacing their oil boilers by 2026. From my conversations with residents during my Summer Pub Tour and my recent local farmers’ roundtable, to discussions about our own boiler at home, I know this has been a cause of real worry for many of you. For those of us who live in villages gas is simply not an option, and we rely on oil.\nSo, I'm pleased that households will not now be required to install heat pumps until after 2035 – and then only when their existing boiler needs to be replaced. In addition, the 20 per cent of all homes which are not suitable for heat pumps will be exempt, which reflects the needs and concerns of a constituency like Banbury which has some very large rural areas.\nThis represents a much fairer approach to decarbonising how we heat our homes. Families will not be forced to make the switch, particularly at a time when many are worried about the cost of living. For those who do want to make the change now, cash grants through the Boiler Upgrade Scheme have been increased by 50 per cent to £7,500. Please take a look at what is available to help you.\nThe ban on the sale of new petrol and diesel cars and vans will also be extended to 2035. It is expected that the vast majority of cars sold by 2030 will be electric. We are seeing changes in behaviour, as electric cars become cheaper and the charging infrastructure is growing. Germany, France, Spain, Italy, Australia, Canada, Sweden and US states like California and New York all share our 2035 deadline.\nWe have done well in reducing emissions in recent years. The UK was the first G7 country to legislate to achieve Net Zero by 2050. Since 2010, we have cut our CO2 emissions by 40% - far more than the EU or any other G7 country. UK emissions are at their lowest level since the mid-1800s, accounting for less than 1 per cent of current global emissions. Meanwhile, our new farming schemes will ensure we leave the natural world in a much better state than we found it.\nNet zero must be reached in an honest, fair and sensible way and we will only succeed if public support is maintained. We know we must clean up our emissions and be greener. We know this matters to us all and to future generations. We know this won't always be cheap or easy, but if we all make changes where we can and Government policy continues to help us to do so, then we will stay on track.\nSeptember 2023\nComing from a family of teachers, the importance of education was drummed into me at an early age.\nEnsuring all children have access to a good quality education is vital. As a local authority which has been historically underfunded, I welcome the news that the core schools budget in Cherwell will be the highest it has ever been in real terms for the 2024/25 academic year.\nThe Government’s long-term vision is for a school system that helps every child to fulfil their potential by ensuring that they receive the right support, in the right place, at the right time. A broad and balanced curriculum helps ensure that our young people have the opportunity to achieve their full potential and are prepared for the opportunities and responsibilities of later life.\nWe have some fantastic schools here in north Oxfordshire with teachers who do their very best to support our children’s learning. One of the best parts about being a Member of Parliament is having the opportunity to get out to visit them regularly and speak to pupils. Recent visits have taken me to Hanwell Fields to see how Opening School Facilities funding is supporting pupils to live healthy and active lives; Dashwood Banbury Academy to join a Be Internet Legends assembly teaching online safety; and, The Warriner where I was invited to speak at their Careers Experience Week. This summer I have seen first-hand the impact of recent reforms to the curriculum which have allowed schools to tailor lessons more specifically for their pupils.\nWhen I meet students, I am always so impressed with how engaged they are, particularly about politics. It always shines through at my annual Cherwell Democracy Challenge where teams of students from local secondary schools debate motions on a range of topics relevant to them. Returning for the ninth time this year, my Democracy Challenge coincides with UK Parliament Week which takes place in November. In previous years Banbury has been one of the most engaged constituencies in the country, with more schools, groups and young people signing up to take part in Parliament Week activities than anywhere else. I am really looking forward to hearing more about what the groups get up to and getting involved with some of their plans.\nI was thrilled for those who received good A-Level, T-Level, vocational and technical qualification (VTQ) and GCSE results last month. The past few years have not been easy for young people – including my own children – who had to study through the disruption of the pandemic. I hope all those who sat exams this year got the results they were expecting. There are plenty of options available for people to explore, from university courses to apprenticeships. We are lucky in our area to have so many opportunities on the doorstep.\nAugust 2023\nIt is hard to believe that seven years have passed since that awful July day when we heard about the threatened downgrade of services at the Horton. It was an extremely difficult time for us all. We fought hard to make sure our voices were heard. Working together we were able to protect A & E and paediatrics. Sadly, owing to staffing problems, the decision was made to downgrade maternity to a midwife led unit. I continue to fight for full maternity services for Banbury. In the meantime, a significant service is still provided. When I visited last month and met the Chief Nurse I was particularly reassured to hear about the good quality pre- and post-natal care which takes place at the Horton for expectant and new mothers across the north of the county. A static ambulance remains outside the unit, ensuring transfers can take place as swiftly as possible if intervention is required.\nLike so many of my Banbury constituents, I was born at the Horton and four generations of my family have been treated there. I have always felt very strongly that we must keep excellent healthcare locally. I am in no doubt that this value is now understood by the wider Trust, particularly following a very busy pandemic at the Horton.\nThere has been significant investment in our hospital in recent years. The working partnership between Katharine House Hospice and the Trust has been a success. In May I was at the opening of the new Surgicube Ophthalmology Unit at the Ramsey Centre which will help bring down NHS waiting lists and improve patient care. For the tenth year running the Hip Fracture team has been celebrated as one of the best in the country. A second CT scanner was also acquired this year to help people receive treatment much closer to home.\nIt is a disappointment that the Trust has not been successful in its bid for the New Hospitals Programme. But there is no doubt the Horton is here to stay. As we have worked on our future vision, I have always made it clear that we must have Plan B. It is now time to explore those alternative options, and look for other funding sources. The Government has been clear that significant money will be available in these funds. I have meetings with both Chief Executives of the Trust and the local commissioners later this month and will continue to keep you all informed.\nI am certain that the Horton must remain a General Hospital. We need it. The Trust must communicate openly with us. Working together we can make sure the Horton continues to provide excellent care for our families now and for many generations to come.\nJuly 2023\nThis is always a busy time of year for our farmers in North Oxfordshire. After a particularly dry spell, haymaking is well underway and combines are gearing up for harvest. As Jeremy Clarkson has shown us on Diddly Squat Farm, the summer marks the end of a long and difficult agricultural year. Farmers hope for high yields and good prices to make all of the long hours and sleepless nights worth it.\nThe need for a good harvest has been no more pressing than in recent years. Russia’s illegal invasion of Ukraine and its impact on the global supply chain has left farmers’ input costs spiralling. The invasion of one of the bread baskets of the world has also thrust global food security into the spotlight.\nThis is something the Government takes extremely seriously. During my time as Minister for Farming, Fisheries and Food, I published the first ever Government Food Strategy. This committed to bolstering our domestic food security and boosting production through innovation and investment.\nI know that farmers and rural communities are at the top of the Prime Minister's agenda, as a proud rural MP himself. This was demonstrated when he hosted the Farm to Fork national food security summit in 10 Downing Street recently. At this summit, the Prime Minister pledged to put UK agriculture at the forefront of our trade negotiations, protecting our standards and sensitive sectors while prioritising export opportunities.\nThis comes at an important time for UK farming. Having left the EU’s Common Agricultural Policy, we are able to set our own agricultural policies for the first time in over forty years. This has enabled us to embark on a bold transition away from unfair direct payments, which simply gave farmers a cheque based on the area of land they owned, towards our new Environmental Land Management Schemes.\nUnder our new schemes, sustainable farming practices are being incentivised, which reduce our carbon emissions and increase our biodiversity. Investment is also going into large-scale landscape recovery, as well as improving animal health and welfare and boosting productivity. More details were announced on these schemes last month, with more and more farmers signing up all the time.\nOur farmers in North Oxfordshire produce the finest quality food with some of the highest standards anywhere in the world. This Government will always back British farmers. We can do the same by buying British and buying local wherever possible.\nJune 2023\nAccess to high-speed broadband and reliable mobile coverage is essential in the modern world. The pandemic only emphasised how much we have all come to rely on the internet to communicate and carry out an increasing number of day-to-day tasks. At the same time however, the more that our lives become focused online, the more we realise where there are gaps in current digital connectivity.\nI know how frustrating poor mobile coverage and weak broadband can be. Banbury and Bicester broadly benefit from strong broadband and reliable mobile coverage. But there are many in surrounding villages who have been left behind by the rollout of gigabit-capable broadband and suffer from partial mobile coverage. I remember how exciting it was when fibre optic broadband arrived in our village. Our mobile signal is not so good, however. Constituents regularly get in touch with me to share their concerns, which is why I decided to launch my Digital Connectivity Survey. I received hundreds of responses, which have helped me to build a really comprehensive picture of coverage across our area.\nIn particular, the results highlighted a number of mobile not-spots which still persist in North Oxfordshire. After seeing this, I had a meeting with EE, in which I was pleased to learn that they are committed to playing their part in tackling these through the Shared Rural Network. This agreement between mobile network operators and the Government aims to increase 4G mobile coverage by sharing both existing and new masts. It is hoped that this will increase 4G coverage throughout the UK to 95 per cent by the end of 2025. The launch of the Wireless Infrastructure Strategy in April reaffirmed the Government’s commitment to achieving this.\nThe results of my survey also demonstrated that there is significant demand for full fibre broadband across North Oxfordshire. Our area has the lowest rate of gigabit-capable broadband coverage in Oxfordshire and one of the lowest in the South East, with coverage 20 percent below the national average. Through Project Gigabit, the Government aims to deliver gigabit broadband to at least 85% of homes by 2025 and over 99% by 2030. Backed-up by £5 billion worth of investment, each month more contracts are being launched to connect homes which the market would not otherwise reach. In a meeting with the BT Group, I was reassured that Openreach are working at pace to rollout full fibre coverage across our area. This is not to mention a number of other providers who are also offering services in North Oxfordshire.\nWhile great progress is being made to upgrade our network, we must ensure that the Government’s ambitious targets are met locally. One of the Prime Minister’s five priorities is to grow the economy. To do this, it is vital that we deliver digital infrastructure that ensures everyone, including in rural areas, has access to good quality mobile and broadband coverage. Mobile and network providers have an enormous responsibility in this rollout. I have further meetings planned with these providers and will continue to work with them closely to ensure they understand the challenges we face in North Oxfordshire.\nMay 2023\nOn May 6 we witnessed history as His Majesty King Charles III followed in the footsteps of 39 monarchs before him in being crowned at Westminster Abbey.\nThe atmosphere in London is one I will never forget. Tens of thousands of people braved the wet weather – as they did on the day of his mother’s Coronation in 1953 – to watch the immaculately rehearsed procession. I think we were all in awe of the resplendent Gold State Coach which has been used at the Coronation of every monarch since William IV in 1831.\nIt was a real honour to attend the ceremony inside the Abbey. I was wearing a long wig and gown in my role as Attorney General, and this seemed appropriate on this occasion. It felt at times that little had changed since the first English Coronation of King Edgar in 973. So many of the rituals have endured, from the oath and anointing to the crowning and enthronement.\nAt the centre of it all was The King, who managed to look both magnificent and very human at the same time. He clearly found the service very moving. It was a modern Coronation for a modern King.\nThe ceremony was just the beginning of a long bank holiday weekend of festivities. From colourful parades and street parties to village fêtes and family fun days, we made sure we enjoyed our communities across North Oxfordshire.\nA highlight was Banbury's Party in the Park. Over 15,000 people of all ages came throughout the afternoon to enjoy the sunshine with live music, great food and drink and fun for all the family. To round off the day, Ivy Rose lit Banbury's beacon, which was followed by a red, white and blue themed firework display. It was brilliant to see so many out enjoying themselves and sending a resounding three cheers to His Majesty.\nAs we celebrated the start of a new chapter in our nation’s rich royal history, we were reminded just how important our monarchy is in bringing us together. In it is a great strength that uniquely provides us with a sense of continuity and stability. This is perhaps best captured by The King's own vow, echoing the words of his late mother: \"I come not to be served, but to serve.\"\nMarch 2023\nThe earthquakes in Turkey and Syria are deeply saddening and have put already struggling communities in a desperate situation. It is really difficult to take in the scale of the tragedy unfolding; more than 41,000 have been killed across the region and at least 25 million people have been affected. I know that many constituents are worried about family and friends at this tragic time. Our thoughts remain with them all.\nAs the evolving situation on the ground moves from rescue to recovery, I welcome the Government’s commitment of £25 million in new overseas aid which will fund additional emergency relief to help those affected begin to rebuild their lives. Our priority is to ensure humanitarian assistance reaches those who need it most. Constituents who wish to help can continue donating to the Disasters Emergency Committee’s Turkey-Syria Emergency Appeal at www.dec.org.uk. It is vital that we continue to do all that we can to support the people of Turkey and Syria.\nIn February we also marked the one-year anniversary of Russia’s brutal and unprovoked invasion of Ukraine. Thousands have been killed defending their country against this appalling onslaught and millions more have been forced from their homes.\nPresident Zelenskyy’s historic address to both House of Parliament in Westminster Hall reminded us once again of the bravery and determination of the Ukrainian people. The war is still very real and traumatic. I am reminded of this most days by Vika who joined our family in March last year when she fled the shelling at home. Sometimes we hear the air raid sirens from Kyiv through her phone. We also regularly hear from her grandparents who are still living, mainly in their cellar, on the outskirts of Kherson.\nDespite the circumstances, we are having a really happy experience with Vika. Like many hosts, we have been much more involved than we first expected and have found it very rewarding. Vika is now part of our family. Homes for Ukraine has so far welcomed 326 people to North Oxfordshire, but more help is needed as there are still many looking for places to live. Visit www.cherwell.gov.uk/ukrainesupport to find out more.\nThere are many other ways you can help: the UK Help for Ukraine unit at Castle Quay in Banbury need medical supplies, toiletries, generators and tools. If you can spare any of these items, then please donate them to the centre. The brilliant team of volunteers working from there need all the support they can get as they continue to transport much-needed supplies to the Ukrainian border.\nFebruary 2023\nOur health service is facing some enormous pressures; there is no question that flu has made this winter particularly difficult alongside high levels of Covid admissions. Hospitals have been dealing with their highest ever number of A&E attendances and the pandemic legacy of delayed discharges has put a real strain on our frontline services. These are not issues unique to us but are mirrored in health systems across Europe.\nWhile the circumstances are challenging, we must keep our foot on the accelerator as the NHS continues to deliver on the most ambitious catch-up programme in its history. Thanks to the incredible efforts of our health workers, NHS England reported last week that waiting lists have fallen for the first time since the start of the pandemic. I know that the Prime Minister remains focused on ensuring better care for patients. His vision is for an NHS where people are more in control, with as much choice as possible. There are no silver bullets; it is a complex challenge that needs a range of responses. But we are making steady progress.\nI remain in regular contact with our local health officials: last week I had a catch-up with Nick Broughton, Chief Executive of Oxford Health NHS Foundation Trust to talk about mental health provision in Oxfordshire, including waiting times for Children and Adolescent Mental Health (CAMHS) services. I also met our Bicester GPs to hear more about their experiences and listen to their concerns. It is clear that they are working extremely hard to provide consistent, high-quality care to all their patients. I hope to be able to speak to the Banbury GPs in the weeks ahead.\nI am conscious that Will Hancock will be standing down as Chief Executive of the South Central Ambulance Service NHS Foundation Trust (SCAS) after seventeen-years of service next month. Will achieved lots in his time, most notably the merger of the four ambulance services covering Hampshire, Oxfordshire, Berkshire and Buckinghamshire in 2006. I look forward to working with his successor, David Eltringham, as SCAS seeks to integrate health and social care further as part of a new five-year strategic journey. David is extremely experienced with a particularly strong patient focus. I have no doubt that SCAS has been left in very capable hands.\nDecember 2022\nThe lead up to Christmas is always a busy time of year. Each year I ask local school children to design my Christmas card. This year’s competition for the front cover design was really popular and it was hard to select a winner; it was Year 6 Cropredy Primary School pupil, Ellen Cherry, who was named winner for her cherubic angel watercolour painting. I was delighted to meet her last week along with the rest of the school and present her with her prize. I explained to Ellen that when I showed her design to the Prime Minister he commented how professional it looked! She will also visit Parliament in the New Year with her parents which I am really looking forward to.\nI will also be welcoming The Warriner School to Parliament early next year after they were crowned winners of my Cherwell Democracy Challenge. The annual debating competition took place during UK Parliament Week at the end of November. Six schools went head-to-head debating issues including the best age to begin voting and who should play James Bond in the future. A well-fought final debating a motion on British involvement in Ukraine saw The Warriner walk away as this year’s champions, with The Cooper School coming in as close runners up.\nUkraine remains a cause close to my heart. This year we will be joined by Vika and her parents at the table for Christmas lunch and have been busy learning about their festive traditions. It will be very special sharing our own Christmas with them, from lighting the Advent candle to choosing our Christmas tree together. The situation in Ukraine is very serious. I had many meetings last week with the Ukrainian Prosecutor-General, Andriy Kostin, in my role as Attorney General. His team is navigating a horrific catalogue of war crimes. I represented the UK at the G7 meeting of Justice Ministers in Berlin where we discussed the situation further. We are committed to working together with the international community to hold Putin to account for the actions of his forces.\nThe consequences of the war in Ukraine continue to be felt closer to home, as we deal with the rising cost of living. I know many will be having to face some difficult decisions this Christmas. I hope that the package of support announced by the Chancellor at the Autumn Statement will go some way to help in the months ahead.\nNovember 2022\nIt was an enormous privilege to be appointed Attorney General for England and Wales by the Prime Minister. It is a role that has existed in Parliament since at least 1243. Before I was first elected as your MP in 2015, I worked in the Government Legal Department for seventeen years. I provided advice on military, prisons and national security matters and represented the Government in court. It is great to be returning to the law in my new role, and to be working with the many excellent professionals across the Law Officers’ Departments once again.\nIt has been another busy month in the constituency. As always, it was a pleasure to visit Glory Farm Primary School. I was given a brilliant tour of the school by Headteacher Jane MacLachlan and the senior leadership team, and enjoyed meeting every year group. It was great to see building work well underway for their brand-new classrooms. I look forward to visiting again once the work is complete!\nI was also pleased to visit HMP Bullingdon last week to meet Governor Laura Sapwell and discuss future plans for the facility. I was encouraged by the progress which has been made during her tenure. I was particularly interested to discuss recent work to improve the access of prisoners to education and job support, acknowledging the specific needs of prisoners to facilitate reform, and reintegration on release.\nIt was great to see so many constituents at one of my regular advice surgeries, this time held at Garth House. I enjoyed speaking to those who had booked appointments, including 11-year-old Grace who wanted to speak to me about how we can all do our bit to protect the environment by picking up litter and avoiding single-use plastics. Surgeries are a great way to raise issues with me in person. If you have any concerns you would like to discuss, please do get in touch.\nEarlier in the month, I caught up with Superintendent Emma Garside, our local police commander in Cherwell, at Bicester Police Station. Emma told me that the most concerning crimes locally include drug dealing, violent crime and anti-social behaviour. She was keen to share the real progress that has been made in these areas recently. I was particularly pleased to hear that there has been a significant reduction in reports of anti-social behaviour in Bicester in recent months. I am grateful to Emma for meeting me and will continue our regular conversations to make sure that constituents’ concerns on local policing matters are always heard.\nOver the past few weeks, I have also launched some new campaigns on important local problems. I know many of my constituents share my concerns about the discharge of sewage into rivers, including the River Cherwell. Last month, I wrote to the Chief Executive of Thames Water, Sarah Bentley, to find out about what is being done to safeguard our River Cherwell and limit sewage discharge into it. I asked her for a meeting to discuss the issue in more detail and understand what work Thames Water is doing to deliver on the new duties placed on water companies. I will post updates on this issue on my website and social media.\nAccess to high-speed broadband and reliable mobile coverage is another issue that has been raised consistently with me in recent months. While Banbury and Bicester broadly benefit from strong broadband and reliable mobile coverage, there are many in surrounding villages who have been left behind by the rollout of gigabit-capable broadband and are frustrated by mobile not-spots.\nOur area has the lowest rate of gigabit-capable broadband coverage in Oxfordshire, and one of the lowest in the South East, with coverage 20 percent below the national average. It is absolutely vital that residents have access to a reliable broadband service. We must also work towards achieving universal mobile coverage in line with the Government’s Shared Rural Network programme.\nMy Digital Connectivity Survey is now live on my website. To help me build a comprehensive picture of where mobile and broadband coverage is weak in North Oxfordshire, please visit www.victoriaprentis.com/digital-connectivity. Paper copies can also be requested by getting in touch with my office. Your experiences will help inform my findings, which will be shared with providers and colleagues in Government.\nSeptember 2022\nThe death of Her Majesty the late Queen Elizabeth II is an enormous loss for us all. She has been a constant presence in all our lives. Seventy years on the throne made her the longest-serving monarch in our history. As we reflect on the Elizabethan age, we remember her as a guiding light of duty, service and unity.\nAs I sat in the Commons listening to tributes last Friday, it became clear that she has extraordinary reach. Almost everyone had a personal memory. In my own tribute on behalf of my North Oxfordshire constituents, I remembered her address to the nation during the pandemic when, resplendent in her NHS scrub coloured dress and brooch, Her Majesty praised “the attributes of self-discipline, of quiet good-humoured resolve and of fellow-feeling,” of our people. These are all qualities she modelled for us and for which we loved her. To them, she added a less definable quality: a presence, a splendour which came from her deep faith and her certainty that the Crown is at the very centre of our constitution. She lit up every room; I will not forget the day she came to Oxfordshire in 2008. Hundreds of people filled the Market Place in Banbury waving flags, including lots of excited school children, as she helped us mark the 400th anniversary of the town’s Charter. Later that day, I met her as she opened the Oxford Children’s Hospital. In her we see a reflection of our own passions which is why we all feel such a deep and personal sense of loss.\nAs we grieve for one monarch, we welcome the reign of another whose own sense of duty is in the best traditions of his mother and his country. On Saturday, His Majesty King Charles III was proclaimed at the Accession Council at St James’s Palace in London, a historic moment which was televised for the first time. The following day, towns and cities across Britain made their own proclamation to the new king marking a new Carolean age. It was good to attend the Banbury Proclamation which took place at the Town Hall. High Steward of Banbury, and my predecessor, the Rt Hon Sir Tony Baldry led the reading with several hundred in attendance. We then managed the National Anthem with the new unfamiliar words, followed by three cheers for the new King.\nReturning to London the following day, it was extraordinary to be in Westminster Hall to hear King Charles III address both Houses of Parliament for the first time as monarch. His Majesty spoke very clearly about the enduring example of selfless duty set by his mother. The past few days will not have been easy for him, but he has undertaken his duties with strength and stoicism.\nHundreds of thousands of people are expected to attend Her Late Majesty’s Lying-in-State at Westminster Hall to pay their respects over the five days before her funeral at Westminster Abbey on Monday 19 September.\nMay The Queen rest in peace and rise in glory.\nGod Save The King.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_horton-hospital-facilities-visit/content_35.html": "I had a useful meeting with the new Chief Estates and Facilities Officer Mark Holloway at the Horton to discuss what is being to modernise the hospital’s site and its structures.\nThe Horton is already benefitting from £5.7 million through the Government’s Public Sector Decarbonisation Scheme and it was great to see some of the transformative work underway. The grant funding is helping the Trust in achieving its Green Plan objectives, but it will also improve the comfort of patients and staff in some of the older buildings.\nMark told me that he is undertaking a diagnostic review of the estate and will be using the findings to determine action that can be taken in the short, medium and long-term to improve our hospital’s facilities.\nI think we can all agree that the Horton could also do with a facelift. Mark assured me that he is focused on working to improve the overall appearance of the site and is looking to organise a clean-up action day over the summer. I will share further news on this as soon as possible.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_easington-football-club/content_17.html": "I had a great time visiting Easington Sports FC in Banbury recently, where I met Board members Richard, Jamie and Michael.\nEasington is a much-loved and thriving sports club in our community. I enjoyed learning more about the excellent work they do to support 600 players of all ages and abilities, with 38 mens, ladies, boys and girls teams registered next season.\nI am going to be working with Easington and other local sports clubs to see what we can do to improve the provision of sports facilities in our town.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_category_European-News/content_34.html": "Brexit Negotiations 8th December 2020 Following our departure from the EU, the Government has been in ongoing trade negotiations with the EU. Negotiations continued throughout the peak of the... European News",
  "http_victoriaprentis_com_/http_victoriaprentis_com_cdn-cgi_l_email-protection/content_39.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_infected-blood-compensation/content_22.html": "I welcome the Prime Minister's apology regarding the infected blood scandal. It is a significant acknowledgment of the decades-long moral failure that has devastated countless lives. The commitment to providing comprehensive compensation is a crucial step towards addressing the immense suffering and injustice endured by so many individuals and families.\nAs an MP, I've spoken to constituents who have been affected by this tragedy, either directly themselves or because a parent, sibling or child has been affected. The implications of this scandal are far-reaching. It is important that we continue to prioritise accountability, transparency, and support for all those affected. I am pleased that the Government has pledged to compensate those impacted and further measures are to be taken",
  "http_victoriaprentis_com_/http_victoriaprentis_com_contact/content_28.html": "Tweet If you would like to contact me, please email [email protected]. Please note that this email is only checked intermittently following the election.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_events_feed/content_37.html": null,
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_victoria-prentis-member-parliament-north-oxfordshire-speaks-during-charities-and-volunteering/content_20.html": "On Wednesday 13 February 2018, Victoria Prentis MP spoke about the importance of charity work and volunteering during a debate in Parliament. Please see below for a full transcript of Victoria’s speech, taken from Hansard.\nVictoria Prentis (Banbury):\n“My parents were dedicated to voluntary work. Whereas other children played cricket, as you did, Mr Deputy Speaker, or played mummies and daddies or shops, my sisters and I used to play “holding a meeting”, and it was invariably a charity meeting. So it is not a great surprise that, all my adult life, I have tried to work at least one day a week for charity. That has enabled me to move from charity to charity locally, helping to buy a bus for Leonard Cheshire and selling cushions for Fine Cell Work—good golly, that was difficult; nobody likes giving money to prisoners, apart from those involved in the criminal justice system. I also raised money for the urology department—try that, guys; a urology ball, anyone?\nThere are two things that I am most proud of. First, along with my right hon. Friend the Member for South Northamptonshire (Andrea Leadsom), I set up NorPIP, as a founding trustee. Our by-line was “Two is too late”, which is not quite true, but it focused strongly on the attachment issues between parents who are struggling and their very young babies. Secondly, I set up the benefactors’ board for my local hospital trust. We described that as the icing on the cake. What we were adding to the NHS, which we all really supported, were the bits that the NHS could not fund, such as new bits of equipment that it could not take the extra leap to fund, nice duvet covers for the children and equipment for the hospital school. I am proud to have set up that fund and chaired it for many years. I am also proud that my predecessor’s wife took it over when I was elected to this place. She is a great lady, and he is a great man. He has had a knock-back in his charitable experiences today as Age Friendly Banbury has not received the funding it went for, but I know that will not set him back.\nI am trying to say that charity work is a great background for someone to be a local MP. It means they know people locally—leant-in people locally—and they know what is going on in their local area. It is of course a great background for everybody. As the hon. Member for West Dunbartonshire (Martin Docherty-Hughes) said, it is really good for everybody’s mental health to volunteer. When our son died, my work for Save the Baby helped me to get back to playing a part in society. We can get positive things, as you know, Mr Deputy Speaker, out of tragedy.\nTo put it politely, volunteers are so much more powerful and good, at fundraising in particular, than paid charity workers. People give money to people. We know that, and we have proved it time and again.\nWe are not just talking about formal charities today. I would like to tell the Chamber about Tony, my next-door neighbour. He not only takes my children to the bus, reduces the local rat population, uploads new photos on the village website, takes other families’ dogs for walks, and opens and checks the church daily, but he does all this by 8.30 every morning. We all know people like this and, quite frankly, we want to grow into such people. It is great that, as the Minister told us earlier, 30% of adults are doing some volunteering. I would like her to measure not just the money that is given, but the time that is spent by stalwarts of our communities, such as Tony, who do so much for us.\nI could not let such an opportunity pass without mentioning Singing for Syrians, which I set up soon after my election in 2015. I heard on the radio that Syrian doctors were working unpaid, and I thought we would have a bit of a whip round. Everybody I asked said yes and tried to help. It is my dream charity. We encourage people to do the work for us and to do their own thing—inspired slightly, I must say, by the Macmillan annual coffee morning. Everybody can get involved in the singing, or in eating at the fabulous Syrian supper clubs. This year, our flagship will be on 10 December in St Margaret’s, and a marvellous cross-party choir of MPs will be taking part. Others do the work; we just receive and distribute the money, and there are events all over the country.\nWe need the money more than ever. The Hands Up Foundation, which we fund, is one of the very few charities still donating into northern Syria, as the big players have pulled out. Our prosthetic limb clinic was flooded two weeks ago—all the equipment is kept in the basement to protect it from aerial bombardment—and we are trying to raise £10,000 to re-home the limb clinic, which provides such essential services to those who have lost limbs in the war. We are still about £4,000 short of that target, so if anybody would like to give me a cheque afterwards, it would be gratefully received. I encourage everybody present in the Chamber, perhaps if there is a boring moment later, to google “Singing for Syrians” and watch our very short clip, “Sing like they can hear us!” If they have three minutes and want a good laugh, they can google, “Singing for Syrians Flashmob” in Marylebone station, which is fantastic.\nI would like to thank everybody who volunteers for all our local and national charities. I especially want to thank those who volunteer in north Oxfordshire. I am particularly proud that we have national bases locally for the Child Brain Injury Trust and for Adoption UK. I am inspired by my hon. Friend the Member for Witney (Robert Courts), who has a “Volunteering Week”, during which it appears that he does a lot of gardening. I am going to do “Victoria Volunteers” from 23 September for a week, when I am looking forward to cooking for Banbury Young Homelessness Project, eating cake at Restore, making tea at the Royal Voluntary Service and reading to children with the indomitable women of ARCh—Assisted Reading for Children—which is just a fantastic organisation. If I am allowed to, I will also do some volunteer driving for the people who volunteer out of the citizens advice bureau, but they may not want me and I may not pass the check. It is fantastic what is done by people all around our country, and I cannot praise them highly enough. I thank the Minister for all she does.”",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_category_Articles/content_6.html": "Resignation Honours 11th April 2025 It is a huge privilege to have been recognised in the former Prime Minister's resignation honours. In the Lords, I hope to focus on my areas of interest: the... Articles\nChancellor breaks ground for Siemens Healthineers site 15th May 2024 It was great to join the Chancellor in Bicester on Friday to break ground on a new state-of-the-art facility for Siemens Healthineers. The site on the side of... Articles\nBanbury Community Food Pantry 25th April 2024 I was pleased to get along to Banbury Community Food Pantry’s recent coffee event. Founder Andrew Wickham told me more about their hard work to provide food for... Articles\nEasington Football Club 23rd April 2024 I had a great time visiting Easington Sports FC in Banbury recently, where I met Board members Richard, Jamie and Michael. Easington is a much-loved and... Articles\nBanbury Samaritans 22nd April 2024 I had a really insightful meeting with the team at Banbury Samaritans last week. Manager Hannah Swirsky and her team provide safe, around the clock support for... Articles\nKatharine House Hospice 18th April 2024 I was pleased to visit Katharine House Hospice in Adderbury last week where I met CEO Emma Radley and Chair of the Board Sir Tim Jenner. Katharine House has... Articles\nTobacco and Vapes Bill 17th April 2024 I was pleased to support the Tobacco and Vapes Bill in Parliament last night. The Prime Minister feels strongly about the importance of public health and... Articles\nHorton Hospital Facilities Visit 16th April 2024 I had a useful meeting with the new Chief Estates and Facilities Officer Mark Holloway at the Horton to discuss what is being to modernise the hospital’s site... Articles\nReducing the Risk of Domestic Abuse 15th April 2024 I had a thought-provoking meeting with the team at Reducing the Risk of Domestic Abuse last week. Domestic abuse is a very real issue that has devastating... Articles",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_chiltern-railways-meeting-transport-secretary/content_36.html": "On Monday, my fellow Chiltern MPs and I sat down with the Transport Secretary in Parliament. We called for the meeting in order to raise our constituents’ concerns about the current levels of overcrowding on Chiltern Railways services.\nChiltern have a plan to lease additional trains for their fleet and increase their capacity. We emphasised the need for these trains to be entered into service as quickly as possible. The Transport Secretary listened to our concerns and understood the urgency of the situation. We were reassured that he is going to support Chiltern as they navigate the procurement process.\nI know how important Chiltern services are to so many of my constituents who rely on them for getting to work, school and important appointments. I will continue to work with my colleagues, Chiltern and the Department for Transport to get additional trains operating on our routes as soon as possible.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_privacy/content_4.html": "This document outlines how Victoria Prentis processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Victoria Prentis\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Victoria Prentis.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Victoria Prentis, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Victoria Prentis via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_reducing-risk-domestic-abuse/content_23.html": "I had a thought-provoking meeting with the team at Reducing the Risk of Domestic Abuse last week.\nDomestic abuse is a very real issue that has devastating consequences for victims, which is why the work that CEO Dawn Hodson and the team do is so important.\nReducing the Risk provides safe, confidential support for over 200 victims at high risk of harm and trauma each year, helping many of them navigate the criminal justice system. Working in an extremely joined-up way, the team bring local partners together to ensure the safety and wellbeing of victims and survivors and to reduce the risk of domestic abuse in our community and beyond. They also coordinate a vast Domestic Abuse Champions Network countrywide, offering ongoing training and support to over 2,300 front line staff from a range of agencies and services.\nDawn, Emma, Stewart, Nikki and the rest of the team really are unsung heroes.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_category_Opinions/content_38.html": "Police, Crime, Sentencing and Courts Bill 2021 17th March 2021 I share my constituents' shock and sadness at the death of Sarah Everard. My heart goes out to all her family and friends at this unimaginably difficult time... Opinions\nVictoria responds to Black Lives Matter correspondence 14th June 2020 I am grateful to all those who have got in touch with me in recent weeks. The shocking events in America and the subsequent protests here in the UK have... Opinions\nStatement on Dominic Cummings 27th May 2020 Over the past few days I have received hundreds of emails regarding the actions of Dominic Cummings and his family, with the full range of views represented. I... Opinions",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_dissolution-update/content_3.html": "At midnight tonight, Parliament will be dissolved. From that point, there will no longer be any MPs until after the General Election which will take place on 4 July. While Parliament may not be sitting, my office can deal with urgent casework enquiries only via the usual channels.\nAs many will know, the upcoming General Election will be fought on new constituency boundaries which will see Bicester become its own Parliamentary constituency. Since my first election in 2015, Bicester has grown enormously, with new housing areas including Kingsmere, Elmsbrook and Graven Hill. At the same time, we have seen new schools open like Gagle Brook and Whitefields Academy. Businesses including Siemens Healthineers, Ocado and YASA have all recognised Bicester's potential by choosing to open new state-of-the-art sites in the town.\nWe should be enormously proud of how the town has flourished, but also how all those living in the town have managed the growing pains. It has been an honour to represent the area as it has undergone such significant change. I wish all those living in Bicester and the nearby villages the very best in the future.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_bloxham-grove/content_9.html": "I had a wonderful time visiting Bloxham Grove earlier this month. It is an amazing school dedicated to supporting children with special educational needs and disabilities (SEND). It was good to sit down with Headteacher Charlotte and Harry from the Gallery Trust. The work they do is brilliant.\nWhile I was there, I got to explore their fantastic facilities, including a sensory room, cooking facilities, and classrooms. I really enjoyed joining the school council meeting. A range of issues were discussed such as mandatory school uniform and whether zip-wires out of windows should be provided!",
  "http_victoriaprentis_com_/http_victoriaprentis_com/content_1.html": "I'm Victoria Prentis, Conservative Party MP for Banbury 2015-2024, former Attorney General for England and Wales and Advocate General for Northern Ireland. Please take a look around the website to find out more about my work.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_accessibility/content_18.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news/content_2.html": "Resignation Honours Friday, 11 April, 2025 It is a huge privilege to have been recognised in the former Prime Minister's resignation honours. In the Lords, I hope to focus on my areas of interest: the law and the countryside, and to continue to support justice for Ukraine. Resignation Honours and Peerages: April 2025 - GOV.UK Notes to Editors Victoria Prentis served as the MP for her hometown of Banbury 2015-2024. Victoria was Attorney... Articles\nDissolution Update 29th May 2024 At midnight tonight, Parliament will be dissolved. From that point, there will no longer be any MPs until after the General Election which will take place on 4... Local News\nPost Office (Horizon System) Offences Act 28th May 2024 I am pleased Parliament has passed legislation to ensure that hundreds of postmasters affected by the Post Office Horizon IT scandal will have their convictions... Westminster News\nInfected Blood Compensation 21st May 2024 I welcome the Prime Minister's apology regarding the infected blood scandal. It is a significant acknowledgment of the decades-long moral failure that has... Westminster News\nHomes for Hooky Open Day 20th May 2024 Fascinating visit to the Homes for Hooky Open Day. The Hook Norton Community Land Trust set out in 2019 to develop affordable homes that meet the needs of their... Local News\ndpa Lighting 17th May 2024 Great to be invited back to dpa Lighting in Clifton! I enjoyed catching up with Nick Hoggett and hearing more about the projects his growing team of lighting... Local News\nChancellor breaks ground for Siemens Healthineers site 15th May 2024 It was great to join the Chancellor in Bicester on Friday to break ground on a new state-of-the-art facility for Siemens Healthineers. The site on the side of... Articles\nOxfordshire Artweeks and Katharine House Hospice Open Garden 7th May 2024 I enjoyed getting out and about over the Bank Holiday weekend, at least while the rain held off! Oxfordshire Artweeks is the UK’s largest open studio and pop-up... Local News\nChiltern Railways meeting with Transport Secretary 1st May 2024 On Monday, my fellow Chiltern MPs and I sat down with the Transport Secretary in Parliament. We called for the meeting in order to raise our constituents’... Local News\nBloxham Grove 30th April 2024 I had a wonderful time visiting Bloxham Grove earlier this month. It is an amazing school dedicated to supporting children with special educational needs and... Local News",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_category_Westminster-News/content_21.html": "Post Office (Horizon System) Offences Act 28th May 2024 I am pleased Parliament has passed legislation to ensure that hundreds of postmasters affected by the Post Office Horizon IT scandal will have their convictions... Westminster News\nInfected Blood Compensation 21st May 2024 I welcome the Prime Minister's apology regarding the infected blood scandal. It is a significant acknowledgment of the decades-long moral failure that has... Westminster News\nThe Growth Plan 2022 23rd September 2022 This morning, the Chancellor announced The Growth Plan. This sets out the Government’s new approach to ease the cost of living, tackle the energy crisis and... Westminster News\nCOVID-19: Autumn Boosters 19th July 2022 Under plans to increase protection against respiratory viruses ahead of winter, everyone aged 50 and over will be among those offered a Covid-19 booster and flu... Westminster News\nStatement on Vote of Confidence in the Prime Minister 7th June 2022 Last night, I voted for the Prime Minister in the vote of confidence. Now that we have the result, it is time to focus our efforts on delivering on what we were... Westminster News\nMeeting with BEIS Minister Paul Scully to discuss situation at JDE 29th July 2021 This afternoon, I had a really helpful meeting with BEIS Minister, Paul Scully, to chat about JDE Banbury and discuss the use of fire and rehire tactics. It is... Westminster News\nState Opening of Parliament 2021 11th May 2021 I am proud of the legislative achievements of the 2019-2021 Parliamentary session. 44 new bills were passed, including the framework for the UK’s future outside... Westminster News\nBrexit deal agreed 24th December 2020 Today's news that a UK and EU post-Brexit trade deal has been agreed comes as a great relief. Brexit has always meant different things to many of us. It has... Westminster News\nPreparing for the end of the Transition Period 16th December 2020 The UK has left the EU and on 31 December we will leave the Transition Period. Regardless of the outcome of negotiations, the UK will leave the single market... Westminster News",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_north-oxfordshire-mp-speaks-animal-welfare-service-animals-bill/content_30.html": "On Friday 8 February 2018, Victoria Prentis MP contributed to the Animal Welfare (Service Animals) Bill debate in Parliament. Her full speech, taken from Hansard, is below:\nVictoria Prentis (Banbury):\n“As I think we will hear from Members from all corners of the House, we owe an enormous debt of gratitude to Finn, to PC Dave Wardell and to my right hon. and learned Friend the Member for North East Hertfordshire (Sir Oliver Heald). The Bill has not had an easy passage through this House, and I fail to see how someone without my right hon. and learned Friend’s many years of experience in a wide range of judicial and barristerial posts could have got it this far. Many congratulations to him.\nIt is a genuine honour to speak in support of the Bill. I am sure we all agree that service animals, from the police to the prison service, do a very important job. There are 1,200 police dogs in service, and more often than not their role is to help in unpredictable and very dangerous situations. Between April 2017 and March 2018, they were used in nearly 2,000 incidents, including 557 occasions when the suspect had a weapon. In just 99 of those incidents, the suspect escaped. I suspect that that is rather better than the statistics for humans who try to apprehend suspects.\nAs we know from the case of PC Dave Wardell and Finn, however, the result is not always a happy one for the dogs in the line of duty. Finn is just one of hundreds of dogs to sustain an injury while they are doing their jobs. My own local neighbourhood inspector in Cherwell, John Batty, told me about an incident that he witnessed. He says:\n“I will always remember an incident in Slough when I was on firearms a number of years ago. A suspect made off from us and the dog, Tyke”—\nhe is, perhaps, not known to Finn—\n“was released to catch him. The suspect had a knife on him and he stabbed Tyke causing him to lose an eye and although he eventually recovered he had to be retired. It was very traumatic, especially for the dog handler, so anything we can do to evidence the need for such a law is well worth the effort.”\nI could not agree more.\nToday’s Bill brings in long-overdue changes to provide proper recognition in law of service animals’ vital role. Service animals are used widely across the prison service; police dogs are bred and trained to be brave, and, where necessary, aggressive; and sniffer dogs also have specific characteristics. Those characteristics may make life after service very difficult for such animals, and it is not always easy to rehome them. We know from well publicised cases that the retirement of military dogs can be difficult, and it may require sensitive handling. Now that we recognise that these dogs exist and we can talk about military service—at an earlier point in my career, we certainly were not permitted to do that—it is important that we talk about the needs of those dogs and their handlers. They really are a fourth or fifth emergency service. They play an essential part in keeping the brave men and women who protect us safer than they would otherwise be, and it is important that we recognise that.\nI am glad to see the Minister here. I hope that he will remind us later of the Government’s commitment to increase the maximum penalty for animal welfare offences from six months to five years. My right hon. Friend the Prime Minister has spoken of her desire to make sure that the United Kingdom is a world leader in the care and protection of animals. This Bill takes us one step closer to achieving that aim. This Bill is for Finn, who is sitting very quietly in the Gallery; for Tyke, who I hope is still enjoying his retirement; and for all of our brave service animals.”",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_category_Speeches-in-Parliament/content_16.html": "Victoria Contributes to HS2 Debate 11th July 2019 On Wednesday 10 July 2019, the Member of Parliament for North Oxfordshire contributed to a Westminster Hall debate on HS2. Despite limited time in the debate... Speeches in Parliament\nVictoria Speaks About Prison Reform During House of Commons Debate 14th May 2019 On Tuesday 14 May, Victoria Prentis MP spoke passionately about the importance of prison reform during her speech in the opposition day debate on Prisons and... Speeches in Parliament\nNorth Oxfordshire MP Contributes to the Holocaust (Return of Cultural Objects) Bill Amendment 15th March 2019 On Friday 15 March, Victoria Prentis MP spoke about the importance of returning cultural artefacts lost during the Holocaust. Please see below for a full... Speeches in Parliament\nVictoria Speaks During Civil Partnerships, Marriages and Deaths (Registration Etc.) Bill 15th March 2019 On Friday 15 March 2019, Victoria Prentis MP spoke in support of extending civil partnerships to opposite-sex couples during a Parliamentary debate. Please see... Speeches in Parliament\nVictoria Prentis, Member of Parliament for North Oxfordshire, Speaks During Charities and Volunteering Debate 13th February 2019 On Wednesday 13 February 2018, Victoria Prentis MP spoke about the importance of charity work and volunteering during a debate in Parliament. Please see below... Speeches in Parliament\nNorth Oxfordshire MP speaks in Animal Welfare (Service Animals) Bill 8th February 2019 On Friday 8 February 2018, Victoria Prentis MP contributed to the Animal Welfare (Service Animals) Bill debate in Parliament. Her full speech, taken from... Speeches in Parliament\nVictoria speaks in Budget Resolutions debate 30th October 2018 On Tuesday 30 October 2018, Victoria Prentis MP spoke in the Budget Resolutions debate in Westminster, following the delivery of this year’s Autumn Budget... Speeches in Parliament\nVictoria speaks in Inclusive Transport Strategy debate 25th October 2018 On Thursday 25 October 2018, Victoria Prentis MP contributed to the Inclusive Transport Strategy Debate in Westminster. During her speech, she highlighted the... Speeches in Parliament\nNorth Oxfordshire MP invites Secretary of State to visit local veteran group 22nd October 2018 Victoria Prentis MP has invited the Secretary of State for Defence, Gavin Williamson MP, to visit the Heyford and Bicester Veterans group. Speaking during... Speeches in Parliament",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_victoria-speaks-during-civil-partnerships-marriages-and-deaths-registration-etc-bill/content_33.html": "On Friday 15 March 2019, Victoria Prentis MP spoke in support of extending civil partnerships to opposite-sex couples during a Parliamentary debate. Please see below for a full transcript of Victoria’s speech, taken from Hansard:\nVictoria Prentis (Banbury):\n“It is a great pleasure to follow my hon. Friend the Member for South Suffolk (James Cartlidge), who spoke very passionately. I echo what he said at the beginning of his speech: it is relevant, when, on Fridays, we consider important, life-changing events, that we think about people around the world recovering in the aftermath of a horrific attack in New Zealand. I think today about my constituents going to Friday prayers at our two mosques in Banbury. That will be a difficult and worrying experience for people all around the world and it is right that we should think of them.\nThis is the third time that I have risen to support the Bill. We could view it as hatched and matched, and now is the time to dispatch it to the wider world. I am very glad to see that the Lords considered it in such detail and to be here today for its return to the Commons. I appreciate the Bill’s far-reaching scope, but it has come a long way since it was introduced by my hon. Friend the Member for East Worthing and Shoreham (Tim Loughton)—my good friend. It is customary on Fridays for us all, at this point in the dispatching process, to praise to the skies the hon. Member who has brought the Bill to its dispatching moment, but as he did that so well himself, I do not know that I need to add much, apart from to congratulate him on ultimately getting dressed this morning and to thank him for the persistence and good humour with which he has involved very many people in both Houses in the production of the Bill.\nLooking around the Chamber, I see my hon. Friend the Member for Solihull (Julian Knight), who I remember had a very emotional debate in Westminster Hall when we first arrived in this place about mothers’ names on marriage certificates. I think that he, like me, would like to pay tribute to our other right hon. Friend the Member for Meriden (Dame Caroline Spelman), who has worked particularly hard on that issue, which really is irritatingly long overdue.\nIn all seriousness, I pay great tribute to my hon. Friend the Member for East Worthing and Shoreham, who has worked hard, even if he knows it himself. I wish all parts of the Bill well. It has had cross-party support and I hope that we can come to an agreement today so that it can get through its remaining stages and receive Royal Assent before the end of the parliamentary Session. I also hope that Members in the Chamber continue to push. We may have achieved consultations and we may have got the Government to agree to look at things, but we want to deliver on all the Bill’s promises, so that dispatching means fruition rather than the sadder meanings of the word.\nThe focus of amendments from the Lords centre around extending civil partnerships to same-sex couples. We have moved from a position where the Government were going to undertake unspecified work on how that could be done to putting an obligation on the Minister for Women and Equalities to prepare a report on the subject. We find ourselves today with a real commitment to bring in the necessary regulations before the end of the year. This is a great example of how Back-Bench MPs can work with Government to bring about change, and it is possibly also an example of why we think that a deal is better than no deal.\nI also welcome the reassurance in subsection 7 that the decision to host an opposite-sex civil partnership on religious premises will remain a decision for individual religious organisations. I know that the Bishop of Oxford made an extremely thoughtful contribution when the matter was discussed in the other place last week.\nAs I have said previously, other measures on the registration of stillbirth and mothers’ names on marriage certificates are long overdue. Members will know that I represent the all-party parliamentary group on baby loss, which I am glad to say is also very well represented in the House of Lords by a number of grandfathers, who have spoken to me passionately about how they too have suffered when a baby has died. Members of both Houses feel very passionate about this, and fully understand why these changes were needed, but also needed to be consulted on and dealt with extremely sensitively. When the law comes up against personal feelings, particularly death, it is important for us to go slowly and consult slowly, but to achieve progress in the end.”",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_resignation-honours/content_7.html": "It is a huge privilege to have been recognised in the former Prime Minister's resignation honours. In the Lords, I hope to focus on my areas of interest: the law and the countryside, and to continue to support justice for Ukraine.\nResignation Honours and Peerages: April 2025 - GOV.UK\nNotes to Editors\nVictoria Prentis served as the MP for her hometown of Banbury 2015-2024. Victoria was Attorney General for England and Wales from October 2022 until the General Election in July. Before this, Victoria was the Minister of State at DWP (Minister for Work and Welfare) and DEFRA (Minister for Farming, Fisheries and Food). She was responsible for food during the pandemic, and steered through the legislation which made the greatest environmental changes for seventy years.\nCalled to the Bar in 1995, Victoria practised at the Treasury Solicitor’s Department (now the Government Legal Department) from 1997 to 2014. She took a number of cases to the Supreme Court and represented parties in public inquires. She has worked on many of the major judicial review cases of the last thirty years.\nVictoria is currently helping to train Ukrainian lawyers to prosecute war crimes cases.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_speeches/content_29.html": "Tweet Here you can read Victoria's most recent speeches and appearances while she was in Parliament (provided by theyworkforyou):\nWar Crimes: Gaza | Attorney General | Written Answers As per my previous answer to UIN 25822 tabled on Thursday 16 May, and as reflected in the Ministerial Code, I do not confirm publicly whethe\nSalvage: South Africa | Attorney General | Written Answers I have not had any discussions with the Government of South Africa on this legal case.\nOnline Safety Act 2023: Convictions | Attorney General | Written Answers I wrote to you on this important subject on Friday 17 May 2024. For completeness, I set out my full written response below.\nWar Crimes: Gaza | Attorney General | Written Answers I cannot answer your question as to do so would be in breach of the Law Officers’ Convention.\nRoyal Albert Hall: Governance | Attorney General | Commons debates The Royal Albert Hall is one of our most important cultural institutions.\nInternational Humanitarian Law: Israel-Palestine Conflict | Attorney General | Commons debates This Government firmly respect the role and the independence of the ICJ.\nInternational Humanitarian Law: Israel-Palestine Conflict | Attorney General | Commons debates This Government believe very firmly in international law.\nViolence Against Women and Girls: Prosecution Rates | Attorney General | Commons debates The Chair of the Select Committee is tempting me to step on the firm territory of the Lord Chancellor, as he well knows.\nInternational Humanitarian Law: Israel-Palestine Conflict | Attorney General | Commons debates I thought that the ICC’s statement was worthy of note, and I am grateful to the right hon. Lady for bringing it to the House’s attention.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_oxfordshire-artweeks-and-katharine-house-hospice-open-garden/content_27.html": "I enjoyed getting out and about over the Bank Holiday weekend, at least while the rain held off!\nOxfordshire Artweeks is the UK’s largest open studio and pop-up art exhibition event is is taking place across the county this month. It was good to get along to The Red Lion in Steeple Aston and St Mary’s Church in Adderbury. These are just two of the many exhibitions currently displaying brilliant works by talented local artists in North Oxfordshire. These run until Sunday and are definitely worth a visit!\nIn Adderbury, I also had a lovely time at the first of this year’s Katharine House Hospice Open Gardens. These are always a great day out, but also an important opportunity to support Katharine House.\nFind more information on Artweeks exhibitions and future Katharine House Open Gardens here:\nOpen Gardens 2024 | Katharine House Hospice, Banbury (khh.org.uk)\nOxfordshire Artweeks | Be a part of Oxfordshire’s largest arts festival",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_dpa-lighting/content_13.html": "Great to be invited back to dpa Lighting in Clifton! I enjoyed catching up with Nick Hoggett and hearing more about the projects his growing team of lighting consultants have been working on recently. The team have developed a reputation for delivering exceptional work across the world, whether in historic homes, public buildings, famous hotels or even iconic landmarks like the Old War Office in London. dpa really are a great local success story.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_covid-19-autumn-boosters/content_31.html": "Under plans to increase protection against respiratory viruses ahead of winter, everyone aged 50 and over will be among those offered a Covid-19 booster and flu jab this autumn.\nI am pleased that the Joint Committee on Vaccination and Immunisation (JCVI) has recommended this action to boost immunity. I welcome that the government has committed to continuing protecting those most at risk with targeted vaccines and treatments. Vaccination remains our best possible line of defence against this virus.\nYou can read more on this announcement here.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_about-me/content_24.html": "Personal Life and Early Career\nI was born at the Horton General Hospital. I grew up on the mixed family farm in Aynho and have always lived locally.\nI attended Royal Holloway, University of London and Downing College, Cambridge from where I gained degrees in English and Law. It was at Cambridge University that I met my future husband, Sebastian.\nIn 1995 I qualified as a barrister. For seventeen years, I worked in the Civil Service as a lawyer, and until November 2014 was head of the Government’s Justice and Security team.\nI founded the Oxford Hospital Trust’s Benefactors’ Board, which I chaired for over nine years. I have also been involved with a number of other local charities, including Leonard Cheshire, the Northamptonshire Parent Infant Partnership (NorPIP), and my parish church. I have acted as Churchwarden and have been deeply involved in several campaigns about local issues, particularly the fight to retain vital services at the Horton General Hospital.\nI love living in the village of Somerton, right in the centre of the Banbury constituency, with my husband and two daughters. My family are active members of the village community and take part in, and host, many events, including May Day and an annual cider making festival.\nEvery year, I organise the church nativity service, which includes donkeys, sheep, chickens, and, of course, a baby to play the part of Jesus! I am a passionate advocate of buying locally produced goods and have enjoyed raising pigs, sheep and cattle at home. My family are also partial to a pub lunch and can speak with knowledge on many pubs in the constituency.\nParliamentary Career\nI was first elected in 2015. In Parliament, I sat on the Justice Select Committee, and made regular appearances in the House of Commons. I helped organise two national campaigns – Singing for Syrians, raising money for charities working in Syria, and the Great British Spring Clean. I was also Vice-Chair of the All-Party Parliamentary Group on Baby Loss.\nIn February 2020 I was appointed Parliamentary Under Secretary of State at the Department for Environment and Rural Affairs (Defra) and in September 2021, I was appointed Minister of State at Defra. During this time, I was responsible for Farming, Fisheries and Food.\nIn September 2022, I was appointed Minister of State at the Department for Work and Pensions (DWP). During this time, I was responsible for Work and Welfare.\nIn October 2022, I was appointed Attorney General for England and Wales and Advocate General for Northern Ireland.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_post-office-horizon-system-offences-act/content_10.html": "I am pleased Parliament has passed legislation to ensure that hundreds of postmasters affected by the Post Office Horizon IT scandal will have their convictions quashed. This marks a significant step in rectifying one of the biggest miscarriages of justice in British history. These individuals will soon have their records updated and be given a pathway to their rightful compensation.\nMy office and I have been in touch with constituents affected by this scandal for some time now. I am pleased that the Government has secured justice for the victims once and for all.",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_homes-hooky-open-day/content_5.html": "Fascinating visit to the Homes for Hooky Open Day. The Hook Norton Community Land Trust set out in 2019 to develop affordable homes that meet the needs of their village.\nThe result is a fabulous community space with 12 innovative, sustainable homes. What an inspiring project!",
  "http_victoriaprentis_com_/http_victoriaprentis_com_news_tobacco-and-vapes-bill/content_8.html": "I was pleased to support the Tobacco and Vapes Bill in Parliament last night. The Prime Minister feels strongly about the importance of public health and believes that it is his duty to protect the next generation. Smoking is the UK’s biggest preventable killer, so it is right that we take firm action now.\nWhen I have met school children either in Parliament or out in the constituency, this is one of the key topics of discussion. I know that making a smokefree generation a reality is something they care very passionately about and, for the most part, support. Tobacco is addictive and particularly difficult to give up. Given its dangers, most wouldn't choose to start smoking today.\nI think it was extremely important that this issue was put to a free vote giving Members the opportunity to speak freely on a matter. I welcome that the Bill will now progress to its Committee Stage."
}