{
  "https_www_drewhendry_scot/https_www_drewhendry_scot_2024_12_16/content_20.html": "Growth For Good: Expert Series\nAs your business grows, things can get messy fast. But scaling doesn’t have to mean drowning in detail. So, take five and let’s focus on growth that’s smart and manageable.\nAs your business grows, things can get messy fast. But scaling doesn’t have to mean drowning in detail. So, take five and let’s focus on growth that’s smart and manageable.",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_privacy-policy/content_4.html": "Last Updated: 17 November 2024\nWelcome to Drew Hendry’s website. Your privacy is important to us, and we are committed to safeguarding and respecting your personal data. This Privacy Policy explains how we collect, use, and protect your information in accordance with the General Data Protection Regulation (GDPR) and other applicable data protection laws.\n1. Who We Are\nThis website is operated by Drew Hendry’s team. For any queries regarding this Privacy Policy, please contact us at:\nEmail: drew@drewhendry.scot\nAddress: Drew Hendry, Old Kilcoy House, Tore, IV6 7RZ\n2. What Information We Collect\nWe may collect and process the following categories of personal data:\n- Personal Identification Information: Name, email address, phone number, and postal address when you voluntarily provide them (e.g., signing up for a newsletter or contacting us).\n- Technical Data: IP address, browser type, device information, and operating system when you visit our website.\n- Usage Data: Information about how you interact with our website, including pages visited and time spent on the site.\n- Communication Data: Any personal information shared through emails, forms, or messages submitted via the website.\n3. How We Use Your Information\nWe use your personal data for the following purposes:\n- To Communicate with You: Responding to your queries, sending newsletters, or providing updates on Drew Hendry’s activities.\n- To Improve Our Website: Analysing usage patterns to optimise the user experience.\n- For Compliance: Meeting legal and regulatory obligations.\nWe will only process your personal data when we have a lawful basis, such as your consent, a contractual obligation, or a legitimate interest (e.g., improving our services).\n4. How We Store Your Information\nWe take appropriate technical and organisational measures to ensure your data is secure. Data is stored on secure servers and is only retained for as long as necessary to fulfil the purposes outlined in this policy or to comply with legal requirements.\n5. Sharing Your Information\nWe do not sell, trade, or rent your personal information to third parties. However, we may share data with:\n- Service Providers: Trusted third parties who help us operate our website, provided they adhere to data protection standards.\n- Legal Authorities: If required by law to comply with a legal obligation.\n6. Your Rights\nUnder GDPR, you have the following rights regarding your personal data:\n- Access: Request a copy of the data we hold about you.\n- Rectification: Correct inaccuracies in your personal data.\n- Erasure: Request the deletion of your data where applicable.\n- Restriction: Request the limitation of data processing.\n- Data Portability: Receive your data in a structured, commonly used format.\n- Objection: Object to the processing of your data for certain purposes.\n- Withdrawal of Consent: Revoke your consent for data processing at any time.\nTo exercise these rights, please contact us at drew@drewhendry.scot.\n7. Cookies\nOur website uses cookies to improve functionality and analyse website traffic. You can manage your cookie preferences through your browser settings.\n8. Third-Party Links\nOur website may contain links to external websites. We are not responsible for the privacy practices or content of these sites. Please review their privacy policies before submitting personal data.\n9. Changes to This Policy\nWe may update this Privacy Policy from time to time. Any changes will be posted on this page, and where appropriate, notified to you via email or website notice.\n10. How to Contact Us\nFor questions about this Privacy Policy or to exercise your data rights, please contact:\nEmail: drew@drewhendry.scot\nAddress: Drew Hendry, Old Kilcoy House, Tore, IV6 7RZ",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_podcast_weighing-in-for-good-reason/content_12.html": "In the heart of Nairn, Highland Weigh is more than a zero-waste store and café—it’s a hub of community spirit. Founded by Amanda MacArthur, a former nurse turned social entrepreneur, it embodies conscious consumerism, environmental responsibility, and local support. Amanda MacArthur tells Drew why she was moved to create this social enterprise",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_podcast_idm-listen-respect-and-nurture-and-dont-be-a-dick/content_15.html": "In this #GrowthforGood episode, you can listen to some straight-forward wisdom, from a multi award winning, if reluctant, entrepreneur. Rapid, rapid, growth but leaving nobody behind on their ‘Mission to Mars’ I think you’ll like this. Listen on….\nIn this #GrowthforGood episode, you can listen to some straight-forward wisdom, from a multi award winning, if reluctant, entrepreneur. Rapid, rapid, growth but leaving nobody behind on their ‘Mission to Mars’ I think you’ll like this. Listen on….",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_clare-campbell-a-rebel-in-the-highlands-weaving-growth-for-good/content_8.html": "Clare Campbell is spearheading a unique entrepreneurial journey through Prickly Thistle, the weaving mill she founded in the Highlands, the only one on the mainland, Clare’s venture is not just about weaving and tartan; it’s about identity, sustainability, and creating a blueprint for community-driven change.\nFrom Numbers to Looms\nBorn and raised in Inverness, Clare initially pursued a career far removed from textiles. A chartered accountant by trade, she spent over a decade solving financial puzzles in industry and practice. But in her mid-30s, a combination of existential questioning and the personal tragedy of the loss of her brother, at a young age, inspired her to pivot. With no prior experience in manufacturing or weaving, she embarked on a bold mission: reviving the lost art of Highland tartan weaving.\nHer decision wasn’t just a career change but a personal rebellion against the traditional corporate structures she had worked within. “I wanted to experiment with different business cultures and challenge the status quo,” she explained. She was particularly drawn to tartan, an emblematic fabric of Scotland, and was struck by the absence of mills in the Highland region.\nBuilding a Legacy\nLaunching Prickly Thistle wasn’t smooth sailing. Early crowdfunding attempts failed, and acquiring century-old looms from the Borders posed logistical and technical challenges. Yet, six years on, the venture boasts a team of 14 and is the first B Corp-certified weaving mill in Scotland. B Corp status aligns with Claire’s ethos of prioritising people and the planet over profit—a principle deeply rooted in her mother’s advice: “The greatest gift in the world is the one that you give.”\nIn recent years, she has opened ‘Rebel Row’ her own retail outlet in Inverness that has become a magnet for locals and visitors alike due to the quality of offering.\nAct of Ambition\nClare’s ambition is about more than business; it’s about a movement. Her next chapter involves lobbying for a Highland Tartan Act, modelled on the Harris Tweed Act of 1993. This legislation would ensure that tartan associated with the Highlands benefits the local community and environment. For Claire, this is about reclaiming cultural identity and creating long-term economic equity for Highlanders.\nShe said “I just had this kind of epiphany, of thinking, could something that is a global icon be a key to solving some acts of social and environmental justice for the Highlands? Create a blueprint in our little region which is loved. The world over, but it’s a blueprint that is going to be the best free open-source franchise ever.”\nShe passionately advocates for tartan as a vehicle for social and environmental justice. “This global icon can drive meaningful change locally,” she explained, envisioning a circular economy centred on Highland values and resources.\nAs Prickly Thistle enters its next phase, Clare has no shortage of ambition for the wider Highlands, her recently launched Highland Caim Dion Trust (HIGHLAND CAIM DION TRUST) aims to champion the ‘Tartan Act’ in order to channel investment, foster innovation and develop long term sustainability.\nClare spoke in more depth about the principles around the ‘Tartan Act’ and what it could mean in the ‘Growth for Good’ podcast –\nDrew Hendry’s ‘Growth For Good’ Podcast Clare Campbell Rebel of Prickly Thistle\nKindness at the Core\nWhen asked about her core value, Clare is unequivocal: kindness. It’s a principle she strives to embed in her business and personal life. From supporting her team to engaging with her community, her approach reflects a commitment to ethical practices and a kinder, more equitable world.\nHer journey also reminds us of the power of home. She invoked the famous line: “There’s no place like home,” emphasising the importance of local roots in creating global impact.\nClare’s story is a testament to the courage it takes to challenge conventions, embrace failure, and transform a vision into reality. It’s a narrative of resilience, community, and, above all, kindness—a fitting embodiment of growth for good.",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_cookie-policy/content_11.html": "Effective Date: 29-Dec-2024\nLast Updated: 29-Dec-2024\nWhat are cookies?\nHow do we use cookies?\nTypes of Cookies we use\nManage cookie preferences\nCookie SettingsYou can change your cookie preferences any time by clicking the above button. This will let you revisit the cookie consent banner and change your preferences or withdraw your consent right away.\nIn addition to this, different browsers provide different methods to block and delete cookies used by websites. You can change the settings of your browser to block/delete the cookies. Listed below are the links to the support documents on how to manage and delete cookies from the major web browsers.\nChrome: https://support.google.com/accounts/answer/32050\nSafari: https://support.apple.com/en-in/guide/safari/sfri11471/mac\nInternet Explorer: https://support.microsoft.com/en-us/topic/how-to-delete-cookie-files-in-internet-explorer-bca9446f-d873-78de-77ba-d42645fa52fc\nIf you are using any other web browser, please visit your browser’s official support documents.",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_a-radical-prescription-wild-ness-a-business-with-a-vision-for-sustainable-healing/content_6.html": "Dr Katharine Jones is an experienced GP with big ideas about changing the way we think about health and healing. Her journey, spanning three decades in medicine, has led her to found Wild-Ness Health, an unusual business initiative dedicated to transforming healthcare into a more realistic and sustainable endeavour. Through her experiences, she challenges traditional paradigms and highlights the role of balance, community, and personal empowerment in achieving true wellness.\nDr Jones’s career has been as diverse as it is inspiring, with roles ranging from academia to GP partnership to, more recently, a role as an Associate Medical Director in NHS Highland. However, her stint in leadership left her grappling with the immensity of systemic inertia. Despite her energy and creativity, she found it difficult to effect meaningful change in a bureaucracy laden with checks and balances. This struggle took a personal toll, manifesting in a distressing, unexplained skin condition—a stark reminder of how professional pressures can impact personal well-being.\n“Stop waiting for the system to fix you. Take the reins of your recovery.”\nHer turning point came with the realisation that she needed to leave her leadership role and reassess her own health. It was during this period of vulnerability that Dr Jones first stumbled across the terms neuroplasticity and mind-body medicine. Just four sessions of coaching created a new awareness of her ability to overcome thoughts and feelings that were holding her back and “unlearn” long-held beliefs about her role as a doctor.\nWild-Ness has since evolved into a unique collective of health professionals, creative artists, and people with lived experience on a mission to redefine health as our ability to cope with pain and illness, whilst challenging narratives that promote dependence and push the NHS and its workforce to breaking point.\n“Healing isn’t about fixing symptoms—it’s about learning to thrive amidst life’s inevitable challenges.”\nCentral to Wild-Ness is the recognition of the profound impact of lived experiences. Dr Jones highlights inspiring cases, such as a retired headteacher who overcame chronic pain and avoided knee replacement surgery by adopting a mind-body approach. With minimal medical intervention, this patient reclaimed her quality of life by practicing techniques to promote neuroplasticity and break a cycle of fear and pain that was wrecking her life.\n“From chronic pain to reclaiming life: Learn how small, self-empowering changes can lead to massive transformations. The time for a radical change in healthcare is now.”\nWild-Ness also showcases the power of community, collaborating with small businesses to offer workshops in yoga, plant-based cooking, and nature connection, creating a local wellbeing economy while enhancing individual health. These community-driven efforts exemplify the shift from dependency on healthcare systems to self-sustaining practices that people can adopt at home.\n“The greatest prescription I can offer isn’t a drug; it’s hope and empowerment.”\nCreating momentum for radical ideas in a traditional system is not without its challenges, particularly when many colleagues feel overwhelmed by a “broken system” in which change feels hopeless. Yet, Dr Jones remains optimistic, inspired by the support of like-minded individuals and the growing interest in her work.\n“Radical ideas aren’t scary; but clinging to a broken system is.”\nThe Sustainable Healer Conference, scheduled for March 2025, will bring together health professionals, community leaders, and people with lived experience to explore new narratives about health. With a focus on collaboration and actionable change, the conference aims to inspire attendees to implement small but impactful changes in their personal lives, their clinical practice, and their local communities.\n“‘What do you want your life to look like?’ A simple question that holds the key to self-directed healing and purpose-driven living.”\nDr Jones’s message is clear: the time has come to rethink healthcare. By embracing a more realistic, sustainable model, she says we can create a system that not only treats illness and disease but also fosters resilience and wellbeing. Wild-Ness is more than a concept—it is a movement that invites everyone, from professionals to patients, to become agents of change.\nDr Katharine Jones’s journey from systemic disillusionment to a sense of hope and optimism for a sustainable NHS is a testament to the power of curiosity and collaboration. Wild-Ness seeks to empower health professionals in influencing change for the benefit of their own health and that of their patients.\nTo find out more about Wild-Ness Health and the ‘The Sustainable Healer” Conference’ click here",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_2024_11_21/content_18.html": "The ‘highlighting’ part of the mission.\nIt takes three days to craft one of Tanera Camans’ unique handmade shinty sticks. From the beautiful hickory wooden plank to the smooth and individual stick, it is a process perfected over decades to deliver peak performance for the athlete who will wield it.",
  "https_www_drewhendry_scot/https_www_drewhendry_scot/content_1.html": "Growth for Good is an initiative dedicated to showcasing how businesses and leaders can achieve meaningful, sustainable growth. By putting purpose at the heart of operations, we aim to celebrate the innovators, collaborators, and visionaries shaping a better future for their communities.\nGrowth for Good is an initiative dedicated to showcasing how businesses and leaders can achieve meaningful, sustainable growth. By putting purpose at the heart of operations, we aim to celebrate the innovators, collaborators, and visionaries shaping a better future for their communities.\nDrew’s vision extends beyond immediate success; he’s committed to creating lasting, positive change that empowers both current and future generations. Through mentorship, advocacy, and collaboration, he’s dedicated to building resilient communities and guiding leaders to achieve sustainable success.\n“My mission has always been straightforward: to recognise opportunities and connections, seek out good people, appreciate and learn from innovative ideas, effective practices, and valuable experiences, and put all of this to work.”\nDrew Hendry has dedicated his career to driving sustainable economic development that benefits businesses and communities alike. With a unique blend of experience spanning the private sector, local government, and national politics, Drew’s leadership has been instrumental in shaping positive change across the Highlands and beyond.\nThroughout his career, Drew has been guided by a simple yet powerful principle: Growth for Good. He believes that true progress happens when economic growth uplifts communities, supports young people, and fosters innovation. Now, as Chairman of teClan and as the driving force behind Growth for Good, Drew continues to focus on sustainable growth, using his experience to mentor emerging leaders and support projects that drive long-term impact.\nDrew’s journey began in the corporate world, where he held executive roles in a multinational retail company. Driven by a passion for innovation and growth, he later founded teClan, a digital marketing company based in Inverness that quickly became an industry leader. His entrepreneurial success in the private sector laid the foundation for his transition into public service, where he continued to champion the Highlands’ economic potential.\nAs Leader of the Highland Council, Drew spearheaded transformative initiatives, including securing the Inverness Region City Deal, which brought significant investment into the region to boost infrastructure, innovation, and community growth.\nAs a Member of Parliament for Inverness, Nairn, Badenoch, and Strathspey for almost a decade, Drew became a voice for the Highlands at Westminster, achieving key milestones such as making Inverness a Gigabit City to improve digital connectivity for residents and businesses alike.",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_growth-for-good-expert-series/content_14.html": "Growth inpurpose: Automate, Simplify and Empower\nAs your business grows, things can get messy fast. But scaling doesn’t have to mean drowning in detail. So, take five and let’s focus on growth that’s smart and manageable.\nHere are three simple but powerful strategies I use with clients looking to drive impact in their business: automating repetitive tasks, keeping communication clear, and putting playbooks directly in your team’s hands.\n1. Automate Busywork\nIf your team is bogged down with repetitive tasks, take action. Simple automations, executed well, can handle the routine stuff so everyone can focus on what really matters.\nThis is an issue that comes up time and time again with clients: team members spending hours on endless follow-up emails or other examples where important follow-ups simply fall off the to-do-list. To fix the issues, we set up automated sequences in their CRM to handle these reminders. Now, team members are free to step in when it’s time for an actual conversation, bringing higher value to clients and, of course, higher conversion.\nMy top tips for automating busy work:\n- Create simple workflows using tools like HubSpot, Convertkit, and ActiveCampaign – they are great for automating follow-ups and reminders, and they’re really intuitive to use.\n- Tools like Fireflies.ai or Otter.ai can join meetings, transcribe conversations, and summarise key points. This saves team members time on notetaking and makes sure nothing gets missed during important discussions.\n- Use Zapier or a similar tool, which links platforms and keeps information flowing without manual updates. Think about customer data auto-syncing from your CRM to your project management tool.\nRemember, automation isn’t about overcomplicating things; it’s about making space for the work that drives results.\n2. Simplify Communication\nNothing stalls a project faster than scattered communication. When updates are split between emails, chats, and random notes (or even bits of paper), things get lost, and people get frustrated. Centralising your team’s communication means fewer crossed wires, fewer “Where’s that document?” questions, and more focus on what matters.\nI recently helped a team bring all project updates and chat threads into Slack and Monday.com. Now, everyone knows exactly where to go for project details, cutting out confusion.\nMy top tips for simplifying communication:\n- Choose one hub and stick with it; Monday.com and Asana are excellent options, or even Notion, if you want a more bespoke build. When everyone sees tasks and timelines in one place, it stops the need for endless meetings.\n- Whether you use the chat functionality on your project software or integrate something like Slack, make sure everyone knows the communication norms and sticks to the agreed tool.\n- Keep it simple and define what each tool is for—project hubs for updates, chat for questions, and email for announcements. Clear rules make all the difference.\nRemember, centralising communication keeps everyone aligned and stops info from falling through the cracks.\n3. Put Playbooks in Your Team’s Hands\nIf there’s one thing to take away, let it be getting your playbooks in order. When team members own and update their playbooks, documentation becomes a practical tool, not just “something we have somewhere.” It keeps things consistent, reduces confusion, and makes onboarding much smoother for new hires.\nOn one project, I found entire shelves filled with ring binders – daily backup reports still being printed every day, but when I probed, they were no longer relevant to the updated business systems. Each binder represented hours of work that had once been essential but had long since lost relevance. That’s what happens when team members don’t own or update their process playbooks.\nBy giving team members ownership of their playbooks, you can ensure documentation is useful and up to date, not just “something to file away.”\nMy top tips for getting your playbooks in order:\n- Assign playbook ownership to team members who know these processes best. They’ll keep everything relevant.\n- Make refreshing playbooks a quarterly habit (or after big projects). That way, they stay accurate without adding extra work.\n- Playbooks should be easy to access. When your team can find them easily, they’re more likely to use and keep them up to date.\nRemember, when your team owns the playbooks, they stay practical, rooted in reality and trusted.\nWhy not get started by downloading our free practical tools resource list here – And if you’re interested in getting support to automate, simplify, and empower your business, get in touch with us today at hello@inpurpose.co.uk\nArticle Contributor: Jill McAlpine, Founder at inpurpose",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_2024_12_20/content_21.html": "Clare Campbell: A Rebel in the Highlands, Weaving Growth for Good\nClare Campbell is spearheading a unique entrepreneurial journey through Prickly Thistle, the weaving mill she founded in the Highlands, the only one on the mainland, Clare’s venture is not just about weaving and tartan; it’s about identity, sustainability, and creating a blueprint for community-driven change. From Numbers to Looms Born and raised in Inverness, Clare […]",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_2025_02_12/content_13.html": "Weighing in on waste\nIn the heart of Nairn, Highland Weigh is more than a zero-waste store and café—it’s a hub of community spirit. Founded by Amanda MacArthur, a former nurse turned social entrepreneur, it embodies conscious consumerism, environmental responsibility, and local support. After two decades in nursing, Amanda took the brave step to pursue something different but equally […]",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_2024_12_27/content_19.html": "“These things are a bit of a waste of time” ?\nIn this early phase of #GrowthforGood, I have had the privilege of connecting with entrepreneurs, business owners, and managers to explore their ambitions, challenges, and unique approaches to success. It has been inspiring to witness the incredible quality, innovation, and ideas coming from our community, reminding us of what we could achieve by recognising our […]",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_podcast_empowering-small-businesses-how-inpurpose-is-transforming-growth-leadership/content_17.html": "Doing it inpurpose\nIn the ever-evolving business landscape, small and medium-sized businesses are the backbone of the economy—especially in Scotland, where the entrepreneurial spirit runs deep. Yet, as many founders quickly learn, what gets them to one level of success may not be enough to take them to the next. This is where Jill McAlpine and ‘Inpurpose’ step in, helping business leaders optimise their strategy, teams, and processes to scale effectively.",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_these-things-are-a-bit-of-a-waste-of-time/content_7.html": "In this early phase of #GrowthforGood, I have had the privilege of connecting with entrepreneurs, business owners, and managers to explore their ambitions, challenges, and unique approaches to success. It has been inspiring to witness the incredible quality, innovation, and ideas coming from our community, reminding us of what we could achieve by recognising our strengths and value.\nI have also begun engaging with business support agencies and associations, with plans to expand this in the coming months. These organisations play a crucial role in strengthening both our collective and individual futures. A standout example is Highlands and Islands Enterprise (HIE), a key player in fostering growth across the region.\nRecently, during a discussion with a senior business figure, I asked whether she sent any of her staff to HIE’s (free!) development sessions. Her response surprised me:\n“I don’t think any of our team would get much out of it. These things are a bit of a waste of time.”\nCurious to see for myself if these sessions held genuine value, I attended one of HIE’s ‘Ideas for Growth’ sessions, led by Ryan Till.\nThe room was filled with a diverse group of participants—owners of long-established businesses, micro businesses, start-ups, and even an inventor looking to get his product to market. The early part of the session focused on inspiring fresh thinking about growth in today’s rapidly changing marketplace.\nWe were asked to reflect on how we consumed things twenty years ago compared to now—a reminder of how quickly the pace of change has accelerated. There was laughter when Ryan confidently asked,\n“Who in the room still uses CDs, for example?”\nA couple of us sheepishly raised our hands (I just like to actually own my music, alright?). The point was clear: Spotify and Apple now dominate the market, illustrating the importance of adaptability in the face of rapid change.\nThe session guided attendees through a business model canvas framework, covering critical areas such as products, revenue streams, customer channels, key partnerships, and overall feasibility. One of the most compelling elements was the focus on ‘Business Model Themes’—an area where businesses can unlock innovation and sustainable growth with the right strategies.\nThe discussion also featured real-life examples of local business success stories, highlighting how organisations have navigated challenges and embraced innovation to drive growth. These examples underscored the importance of strategic thinking and adaptability in a competitive market.\nImportantly, all participants were able to apply the insights to their own circumstances, coming away with practical steps to move forward, alongside the offer of further support from HIE.\nWithout revealing too much, I can confidently say the session was an invaluable experience. Whether you are just starting out or have been in business for decades, I highly recommend attending future sessions. They provide practical insights and fresh perspectives to inspire action and equip businesses to meet today’s challenges with confidence.",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_podcast_clare-campbell-a-rebel-in-the-highlands-weaving-growth-for-good/content_16.html": "Clare Campbell is spearheading a unique entrepreneurial journey through Prickly Thistle, the weaving mill she founded in the Highlands, the only one on the mainland, Clare’s venture is not just about weaving and tartan; it’s about identity, sustainability, and creating a blueprint for community-driven change.\nFrom Numbers to Looms\nBorn and raised in Inverness, Clare initially pursued a career far removed from textiles. A chartered accountant by trade, she spent over a decade solving financial puzzles in industry and practice. But in her mid-30s, a combination of existential questioning and the personal tragedy of the loss of her brother, at a young age, inspired her to pivot. With no prior experience in manufacturing or weaving, she embarked on a bold mission: reviving the lost art of Highland tartan weaving.\nHer decision wasn’t just a career change but a personal rebellion against the traditional corporate structures she had worked within. “I wanted to experiment with different business cultures and challenge the status quo,” she explained. She was particularly drawn to tartan, an emblematic fabric of Scotland, and was struck by the absence of mills in the Highland region.\nBuilding a Legacy\nLaunching Prickly Thistle wasn’t smooth sailing. Early crowdfunding attempts failed, and acquiring century-old looms from the Borders posed logistical and technical challenges. Yet, six years on, the venture boasts a team of 14 and is the first B Corp-certified weaving mill in Scotland. B Corp status aligns with Claire’s ethos of prioritising people and the planet over profit—a principle deeply rooted in her mother’s advice: “The greatest gift in the world is the one that you give.”\nIn recent years, she has opened ‘Rebel Row’ her own retail outlet in Inverness that has become a magnet for locals and visitors alike due to the quality of offering.\nAct of Ambition\nClare’s ambition is about more than business; it’s about a movement. Her next chapter involves lobbying for a Highland Tartan Act, modelled on the Harris Tweed Act of 1993. This legislation would ensure that tartan associated with the Highlands benefits the local community and environment. For Claire, this is about reclaiming cultural identity and creating long-term economic equity for Highlanders.\nShe said “I just had this kind of epiphany, of thinking, could something that is a global icon be a key to solving some acts of social and environmental justice for the Highlands? Create a blueprint in our little region which is loved. The world over, but it’s a blueprint that is going to be the best free open-source franchise ever.”\nShe passionately advocates for tartan as a vehicle for social and environmental justice. “This global icon can drive meaningful change locally,” she explained, envisioning a circular economy centred on Highland values and resources.\nAs Prickly Thistle enters its next phase, Clare has no shortage of ambition for the wider Highlands, her recently launched Highland Caim Dion Trust (HIGHLAND CAIM DION TRUST) aims to champion the ‘Tartan Act’ in order to channel investment, foster innovation and develop long term sustainability.\nKindness at the Core\nWhen asked about her core value, Clare is unequivocal: kindness. It’s a principle she strives to embed in her business and personal life. From supporting her team to engaging with her community, her approach reflects a commitment to ethical practices and a kinder, more equitable world.\nHer journey also reminds us of the power of home. She invoked the famous line: “There’s no place like home,” emphasising the importance of local roots in creating global impact.\nClare’s story is a testament to the courage it takes to challenge conventions, embrace failure, and transform a vision into reality. It’s a narrative of resilience, community, and, above all, kindness—a fitting embodiment of growth for good.\nClare spoke in more depth about the principles around the ‘Tartan Act’ and what it could mean in the ‘Growth for Good’ podcast –",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_contact/content_2.html": "Skip to content\nDrew Hendry\nAbout\nContact\nGrowth for Good\nPodcasts\nAbout\nContact\nGrowth for Good\nPodcasts\nContact\nYour name\nYour email\nYour message (optional)",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_growth-for-good/content_3.html": "Weighing in on waste\nIn the heart of Nairn, Highland Weigh is more than a zero-waste store and café—it’s a hub of community spirit. Founded by Amanda MacArthur, a\nGrowth for Good is an initiative dedicated to showcasing how businesses and leaders can achieve meaningful, sustainable growth. By putting purpose at the heart of operations, we aim to celebrate the innovators, collaborators, and visionaries shaping a better future for their communities.\nThrough insightful stories, practical advice, and real-world examples, Growth for Good is here to inspire leaders to think beyond profit, embracing growth that leaves a lasting positive impact. Join the movement and discover how you can be part of the change.\nYou can read more about this initiative in our Growth for Good blog below or get in touch to join the conversation or collaborate. Together, we can create a legacy of positive change.\nIn the heart of Nairn, Highland Weigh is more than a zero-waste store and café—it’s a hub of community spirit. Founded by Amanda MacArthur, a\nDr Katharine Jones is an experienced GP with big ideas about changing the way we think about health and healing. Her journey, spanning three decades\nIn this early phase of #GrowthforGood, I have had the privilege of connecting with entrepreneurs, business owners, and managers to explore their ambitions, challenges, and\nClare Campbell is spearheading a unique entrepreneurial journey through Prickly Thistle, the weaving mill she founded in the Highlands, the only one on the mainland,\nAs your business grows, things can get messy fast. But scaling doesn’t have to mean drowning in detail. So, take five and let’s focus on growth that’s smart and manageable.\nIt takes three days to craft one of Tanera Camans’ unique handmade shinty sticks. From the beautiful hickory wooden plank to the smooth and individual stick, it is a process perfected over decades to deliver peak performance for the athlete who will wield it.",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_the-highlighting-part-of-the-mission/content_9.html": "Tanera Camans\nNovember 21, 2024\nIt takes three days to craft one of Tanera Camans’ unique handmade shinty sticks. From the beautiful hickory wooden plank to the smooth and individual stick, it is a process perfected over decades to deliver peak performance for the athlete who will wield it. Heritage is everything when creating for Alan MacPherson and his team. He has an easy nature, perfectly fitting the rural croft environment that is his family home and the base for his business—or perhaps, more fittingly, the base for his vocation.\nHis eyes light up, and there is a marked increase in intensity when he talks about the game, the shinty community, and the sport’s history—estimated to span one thousand years. Played in all weathers, but especially through the mists of time, he passionately believes this ancient game is the true sport of Scotland. More than that, he believes the sport needs to reach more young people.\n“I think it is important that every kid in Scotland gets a chance to have a shinty stick in their hand. I’ve seen firsthand, after COVID, working with primary schools in Inverness, the huge differences in their mental health. All kids in Scotland should have the opportunity to play shinty,” Alan adds. “It’s a community sport; it gets people out across communities, speaking together.”\nDespite the bespoke nature and visible quality of his products, Alan keeps his prices exceptionally low. Incredibly, when you view the finished piece of hand-crafted art, he charges only £87 (at the time of writing) for his work. I had to ask him why.\n“It would be easy for me to make the sticks more expensive. If you look at other types of sporting equipment—cricket bats, pool cues, even ping pong bats—they can be anything up to £400. I’ve suffered a wee bit over the past few years because I’ve kept my prices too low, but I guess it’s for the passion of the sport, to get the sport growing. I’m trying to do my bit; the sport won’t grow if kids don’t have shinty sticks. I grew up in the sport, and the reason I started making sticks is because sticks just weren’t that available. Right now, it’s difficult for kids to get sticks, and we need them available at all levels of the sport.”\nWhat brought him to ‘Growth for Good’?\nAlan believes his work, and the sport itself, can be a positive influence. He highlights the benefits of the sport he promotes for mental health, community spirit, and wellbeing, and says he wants to find ways his business can help schools, groups, and communities do more. He is also acutely aware of the importance of heritage and community.\n“We are developing. When I first started, there were only two or three makers. There are a few more now. The craft was ‘critically endangered,’ but now it is just ‘endangered.’”\nAlan wants to work with others for collective business benefit, too. Discussions are already underway about possible collaborations to boost his and several other local brands that share this sense of quality and a deep affection for Scotland—its places, people, and boundless opportunities.\nYou can find Alan, online at Tanera Camans – Scotland’s Leading Shinty Stick Manufacturer",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_weighing-in-on-waste/content_10.html": "In the heart of Nairn, Highland Weigh is more than a zero-waste store and café—it’s a hub of community spirit. Founded by Amanda MacArthur, a former nurse turned social entrepreneur, it embodies conscious consumerism, environmental responsibility, and local support.\nAfter two decades in nursing, Amanda took the brave step to pursue something different but equally caring. The COVID-19 pandemic was a turning point—she was alarmed by enormous medical waste generated and frustrated by plastic piling up at home. Encouraged by those around her, she researched sustainable business models, visiting zero-waste stores across the country.\nRather than taking a daunting leap, she built Highland Weigh in small, manageable steps, ensuring a solid foundation.\nAs a social enterprise, Highland Weigh reinvests profits into its mission rather than distributing them to shareholders. This aligns with Amanda’s commitment to sustainability and community well-being.\n“You have to put the quality of your product ahead of your mission—because people might come once for the cause, but they’ll only stay for the coffee.”\nEarly on, she realised multiple revenue streams were key to success. The café enhances the shopping experience while strengthening financial sustainability. Visitors can shop consciously, enjoy locally sourced food, and drink great coffee.\n“Surround yourself with cheerleaders, because there will always be doubters.”\nFrom day one, Highland Weigh was embraced by the local community. Even during renovations, curious locals peered through the windows, eager to see what was taking shape. When the doors opened, the response was overwhelming.\n“People love the vibe—we just can’t quite define what that is!”\nCustomers frequently mention the store’s unique atmosphere. Amanda believes its appeal comes from a combination of aesthetics, a friendly team, and a passion for sustainability.\nWe’re going to last seven months just to prove this person wrong.”\nOf course, there were doubters. Amanda recalls an early barbed comment that gave them 6 months to survive, they are well past that gloomy prediction now and chances are that they’ve served him coffee on more than one occasion since.\n“Zero-waste shopping isn’t always convenient—but making a difference rarely is.”\nRunning a zero-waste business is rewarding but not without challenges. Coming from healthcare, Amanda had to quickly learn about business management, logistics, and sustainable sourcing.\nAnother hurdle is changing consumer habits. Zero-waste shopping requires a shift from convenience culture—customers bring their own containers, weigh products, and embrace a different way of shopping.\n“Every challenge is just an opportunity to solve a problem in a better way.”\nOperating in the Highlands also presents logistical challenges, particularly around delivery costs and supplies. Balancing sustainability, affordability, and product availability is an ongoing task. But Amanda remains determined:\nHighland Weigh actively supports local businesses and promotes sustainable sourcing. From locally brewed kombucha to Highland dairy products and fresh baked goods, Amanda prioritises partnerships with Highland and Scottish producers.\n“We don’t do disposable coffee cups. Period.”\nRather than offering disposable coffee cups, customers are encouraged to bring their own, borrow a reusable cup, or even try edible cups.\nWith a strong foundation and a supportive community, Amanda is focused on expanding Highland Weigh’s impact. One exciting initiative is working with local B&Bs and Airbnbs to integrate refillable cleaning products and toiletries, reducing single-use plastics in the tourism industry. She also hopes to engage larger players, including local hotels.\nAmanda knows sustainability isn’t just about business—it’s about building a network of support.\nFor those looking to support sustainable businesses, Highland Weigh offers a welcoming space to learn, shop, and connect. Whether you’re a local or a visitor, Amanda and her team invite you to experience the “vibe” for yourself—as she says:\n“Bring a container—you never know what you might need!",
  "https_www_drewhendry_scot/https_www_drewhendry_scot_podcast/content_5.html": "Empowering Small Businesses: How ‘inpurpose’ is Transforming Growth & Leadership Listen To The Episode » March 28, 2025\nClare Campbell: A Rebel in the Highlands, Weaving Growth for Good Listen To The Episode » December 20, 2024"
}