{
  "https_www_mark-jenkinson_co_uk_/https_www_mark-jenkinson_co_uk_reviewing-cumberland-boundary/content_6.html": "In April 2023, Cumbria County Council and Cumbria’s six district councils ceased to exist, being replaced by two unitary authorities – Cumberland and Westmorland and Furness – following local government reform.\nAlongside other Cumbrian MPs, I was successful in having the new councils named after the historic counties of Cumberland and Westmorland, righting a 50- year wrong for many.\nThe process to streamline local government in Cumbria however, was constrained by legislation to using the boundaries of existing districts. This has understandably left many residents, many of whom live in the pre-1974 Cumberland curtilage, aggrieved.\nThere is be a review of ward boundaries imminently, ahead of the next elections in 2027. In January 2023 I asked the Secretary of State and the Chairman of the Local Government Boundary Commission for England to ensure that residents and stakeholders are also consulted on the council boundaries. I later met with both of them.\nRead more about my request HERE.\nThe response from both was clear that the Commission would only consider a 'Principal Area Boundary Review' if requested by both councils.\nThe Commission is responsible for carrying out such Principal Area Boundary Reviews (PABRs) of the external boundary of a district or county and may undertake a PABR either at the request of the Secretary of State, at the request of a local council or on its own initiative. The Commission cannot be required by the Secretary of State or by a council to undertake a PABR. Currently, the Commission's policy is to not undertake a PABR that is not requested by all local authorities affected.\nLee Rowley MP, Parliamentary Under-Secretary of State for Local Government and Building Safety\n17th April 2023\nPlease sign my petition to the two councils to request a Principal Area Boundary Review.",
  "https_www_mark-jenkinson_co_uk_/https_www_mark-jenkinson_co_uk_cdn-cgi_l_email-protection/content_8.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_mark-jenkinson_co_uk_/https_www_mark-jenkinson_co_uk_contact/content_3.html": "Skip to main content\nMain navigation\nHome\nAbout\nNews\nOur Plan\nIn Parliament\nFighting For You\nGet Involved\nContact\nContact\nLeave this field blank\nMaryport Office\n01900 876189\n[email protected]\nPenrith Office\n01768 639112\n[email protected]\nFind me on Facebook\nFind me on Twitter\nFind me on Instagram\nFind me on LinkedIn\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_mark-jenkinson_co_uk_/https_www_mark-jenkinson_co_uk/content_1.html": "Campaigns\nLatest News\nThe Penrith and Solway Constituency\nAm I your candidate?\nEnter your postcode to confirm that Mark Jenkinson is your candidate.\nI'm Mark Jenkinson, and it has been an honour to have served as the Conservative MP for Workington since 2019.I am no longer an MP, but remain and active local campaigner. I'm here to help, so please don't hesitate to get in touch.\nEnter your postcode to confirm that Mark Jenkinson is your candidate.",
  "https_www_mark-jenkinson_co_uk_/https_www_mark-jenkinson_co_uk_join/content_4.html": "As a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.\nAs a member, you can play an active role in the Party, from attending Conservative Party Conference and taking part in local campaign groups to choosing who the candidates who’ll stand in local and parliamentary elections and voting in leadership elections.\nWe value committed members like you – join the Party today.",
  "https_www_mark-jenkinson_co_uk_/https_www_mark-jenkinson_co_uk_heritage/content_7.html": "We have some amazing historic sites in our constituency.\nThis page is to celebrate our unique heritage, and although I will never be able to cover it all, I am keen to raise the profile of as much as I can.\nWe have some amazing historic sites in our constituency.\nThis page is to celebrate our unique heritage, and although I will never be able to cover it all, I am keen to raise the profile of as much as I can.",
  "https_www_mark-jenkinson_co_uk_/https_www_mark-jenkinson_co_uk_campaigns_stopthebustraveltax/content_2.html": "Stop Labour's 50% bus fare hike.\nLabour's plans to raise bus fares from £2 to £3 mean hard-working people commuting every day will pay £520 a year more.\nSign our petition to stop this.\nThis petition will be presented to the Labour Party. We will use your contact details to update you about Labour’s tax rises.",
  "https_www_mark-jenkinson_co_uk_/https_www_mark-jenkinson_co_uk_donate/content_5.html": "Unfortunately, campaigning isn't cheap. Printing, envelopes, postage and advertising on social media are all things that we need to do in an ever-changing political world. We need to be able to react to changes in national and local politics fast - but to do that we need to have the funds.\nWe're asking you to keep your donations local. If you do wish to make a donation, please use the button below to do so via PayPal, credit or debit card or direct debit. You can also make a regular monthly donation through the same link. Alternatively, to pay by cheque or bank transfer, please contact us.\nWe appreciate all donations, no matter the size, and all donations will be put use in campaigning in the Penrith and Solway constituency.\nDonate £10 Donate £20 Donate £50 Donate £100 Donate £200+\nPOLITICAL PARTY ELECTIONS AND REFERENDUMS ACT 2000 (PPERA)\nUnder the Political Party Elections and Referendums Act 2000 (PPERA) you must be on the electoral register in the UK excluding the Channel Islands and the Isle of Man in order to make a donation of more than £500.\nIf you donate more than £7,500 to the Party, we are obliged under the Political Parties Elections and Referendums Act 2000 to report such a donation to the Electoral Commission, who will publish the fact that you have made a donation over £7,500. For more information, please see http://www.electoralcommission.org.uk/\nThe Conservative Party reserves the right to not accept a donation or application for membership."
}