{
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_about-rss/content_13.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_privacy/content_18.html": "This document outlines how Simon Eardley processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Simon Eardley\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Simon Eardley.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Simon Eardley, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Simon Eardley via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_campaigns/content_6.html": "Have your say! Saughall and Mollington - House Building and the Green Belt Survey The Government have announced big plans to reform planning law in the country to deliver housing targets, decided in Westminster. Whilst I'm not opposed in...",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_contact/content_17.html": "Skip to main content\nMain navigation\nHome\nAbout Simon\nNews\nOur Plan\nCampaigns\nContact\nContact\nLeave this field blank\nCampaign Office\nNW Cheshire Conservatives, 69 Hoole Road, Chester CH2 3NJ.\n01244 322 732\n[email protected]\nSimon on Facebook\nSimon on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_ourplan/content_2.html": "Our proximity to highly skilled jobs in advanced manufacturing and technology mean new, well-paid jobs on our doorstep. I’m using my experience working with businesses to ensure young people have a clear route into rewarding careers.\nOur Conservative Government has recruited every single one of the 20,000 extra police officers it said it would. This includes securing 322 extra police officers for Cheshire – more than at any time in the force’s history. I’m campaigning for additional resources to tackle crime and ASB hot spots.\nFrom the historic city centre of Chester to the market town of Neston, and all the communities and villages in between, we need to maximise and protect our unique heritage assets.\nOur quality of life depends on a thriving environment. As a committed environmental campaigner, I’ve always rolled up my sleeves to help deliver improvements to the places that matter to us all.\nThe relentless negativity from Labour locally means our area has missed out on vital resources from Westminster to help level up and improve things for local people.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_news_report-saughall-shotwick-park-parish-council-march-2025/content_12.html": "Cllr Simon Eardley's report, presented to Saughall & Shotwick Parish Council for their meeting on Monday 3rd March 2025, is repeated below. Should anyone have a query on the contents, please email: [email protected]\nShotwick Park Estate engagement\nParish councillors will be aware of the engagement opportunity that is underway at present, and which is due to close on 16 March 2025. I understand that delivery of the leaflet from CWaC across the parish, through volunteers, has been successfully undertaken and this is much appreciated.\nIn response to a number of queries raised, the following update was sent to me on 25/02/25 and circulated to you all (as well as being published on my Cllr Facebook account on 26/02/25):\nShare your views and ideas on enhancing the land at Shotwick Park before Sunday 16 March. A questions and answers webpage has been set up alongside the engagement to provide further details around some questions that have been asked about this phase of the project: https://participatenow.cheshirewestandchester.gov.uk/shotwick-park-questions-and-answers\nThis is a detailed and helpful Q&A in my view. I have repeated the entire contents of it at the very end of this report for ease, should for some reason you have not had an opportunity to read the points.\nSee link here for the full details: Land at Shotwick Park - CWaC Q&A | Simon Eardley\nGolden Jubilee Park\n- I submitted a query around drainage information relating to CWaC highways assets in the vicinity of the GJP to the CWaC Cllr Portal, 10/02/25. This is intended to bring clarifications and help inform further planning and options. A response has been received on this and supplied to the Clerk, the Chairman and Richard Nicholas. I await any further instruction.\n- I sent an enquiry to the CWaC Locality Officer, Sarah Dobbins, who attend the January 2025 meeting of the parish council around engagement concerning future funding opportunities for works at the Golden Jubilee Park. My note and her response of 05/02/25 as follows:\nSE note:\n“When you met with Saughall & Shotwick Park Parish Council in January regarding S106 payments, there was some discussion around possible grant funding opportunities they might be able to utilise to deliver improvements at the Golden Jubilee Park. This could be for a range of challenges or opportunities currently being considered, not least of which is drainage and improvements they would like to make in that regard. However, there is also discussion around developing a GJP ‘masterplan’ which would consider a wider vision for the park and what might / or might not be realistic and possible. There are already some ideas floating around as to what this might look like but there is to be engagement with another CWaC officer, Kirsty Howarth (Assistant Landscape Architect (Design Unit), Planning and Placemaking Service, Economy & Housing) on the subject to.\nThe purpose of this email is to alert you to wish on the part of the parish council to engage with you further around the grant possibilities and to seek your assistance at the appropriate time. The PC have some actions first (and I hope I have this in the right order…) – GJP working group to meet and brainstorm ideas for any emerging masterplan, engagement with Kirsty Howarth and then practical next steps (inc. obtaining grants).”\nSD reply:\n“I can certainly help with funding opportunities, but I do need to know what kind of scheme the Parish are looking at delivering.\nMy advice would be for there to be community engagement before any decisions are made on what the Parish want to deliver, I’m aware that an outdoor gym has been mooted but as I mentioned to Jenny these have very mixed feedback/usage so the Parish will just need to ensure it’s the right fit for the community.\nFor the engagement I would suggest a short survey with residents (this could be on something really simple on survey monkey & some paper versions) asking what people would like to see on the site, it would be wise to frame the discussion to avoid people asking for completely unrealistic things which are out of scope.\nKirsty will then be able to use some of the feedback to inform a masterplan for the site, once a draft masterplan has been done, ordinarily you’d present this back to the community for final tweaks.\nThe open space S106 can be used on drainage as long as this enables other works on the site and other works are completed as part of the project – it couldn’t solely be used on a drainage project if not other works are to happen on the site.\nCraig and I are available if the Parish need any support/advice.\nSaughall Speedwatch\nI was pleased to receive my updated training on 17 February 2025 at a session organised by Graham Haughton, alongside others, and will now play an active role in the rota that exists. I am scheduled to be part of the team holding a session on 07 March. Thanks again to Graham for his organisational work to deliver this important activity and to all those who have volunteered to be part of it and are actively engaged.\nPossible ASB use of hedge to the rear of Darlington Crescent\nI remain in touch with Cheshire Police and CWaC officers in relation to concerns regarding this location and I am aware of some recent images supplied in connection with this site. I also note it is commented upon in the report submitted by Cheshire Police for the PC meeting although I do not have anything further to report at this stage.\nParkgate Road closure – during w/c 24 February 2025\nParkgate Road, in the vicinity of Long Lane, was closed for a period during this time and caused considerable challenges. The works were entirely necessary owing to a fault identified by Scottish Power. However, the traffic challenges locally (particularly in the neighbouring parish of Mollington) were intolerable at times, not least owing to drivers acting irresponsibly by not following the well sign-posted diversion routes. I discussed this matter with the CWaC Director of Transport on 28/02/25 and remarked that it is essential for key learnings to be taken away for the future, including the need for more ‘hands on’ traffic management by the instigator of the closure.\nA reminder also that the Chester 10K takes place on Sunday 9th March 2025 and this will also result in road closures between 08:00 and 12:15, including Parkgate Road. Full details here: www.activeleisureevents.co.uk/chester-10k/road-closures\nCheshire West and Chester Council Budget 2025\nCWaC agreed its budget for 2025/26 on 20 February 2025. This meeting resulted in a 4.99% increase in council tax being approved – I voted against. For the typical ‘band D’ property, that means an annual charge now of £1978.09. During the course of the budget debate I, or other members of the political group of which I am a member, proposed the following:\n- The introduction of 20 mph zones around schools across the borough which don’t currently have this provision. After much discussion, this was finally agreed, although in the original intended format that I had proposed.\n- The introduction of a ‘Safer Routes to Schools’ officer to look at strategic challenges around ‘active travel’ to school and education institutions. The ruling administration rejected this proposal.\n- An increase to the gully cleansing budget (£225,000) and thereby an expansion of its scope. The ruling administration rejected this proposal.\n- The introduction of a ‘siding out’ budget for pavements experiencing ‘overgrowth’ from vegetation (£200,000). The ruling administration rejected this proposal.\nPlanning – proposed battery storage facility on land off Parkgate Road (25/00132/FUL - Land South of A494)\nAlthough this planning application does not fall within the Saughall & Shotwick Park Parish, it may be of interest to some residents and indeed I have been in touch with a number, particularly on Parkgate Road itself in the vicinity of where the application is. For reference, I have provisionally called it in to the CWaC Planning Committee on the following grounds:\n- Impact on the green belt (contrary to local / national planning policy).\n- Impact on the open countryside (contrary to local / national planning policy).\n- Industrialisation of a green field location.\n- Potential detrimental impact on highways amenity.\n- Potential detrimental residential amenity impact.\nPlanning – house building targets\nThese observations may be helpful in the context of your deliberations regarding a possible ‘Neighbourhood Plan’ for the parish.\nThe full implications of the Labour government’s ambition to build many more homes across the country are now becoming better understood. In simple terms the local house building target has been almost quadrupled. The total for Cheshire West and Chester, each year, is to be 1914 new homes per year - instead of the existing target of just over 500. As a result of this increase, and the speed at which the government wants it done, it may be harder to stand up to developers wanting to build on inappropriate green spaces in our local communities.\nIt is possible that the new planning guidance will give the requirements of Neighbourhood Plans much less weight with the balance in favour of the developer and Cheshire West expects to receive speculative applications from developers. This is not necessarily a reason not to undertake this work though.\nMy view is that a ‘brownfield first’ approach is best as once a green space is gone, it’s gone forever. Housing must also be delivered sustainably - where infrastructure like roads, schools, GP surgeries - are built alongside. CWaC has overachieved on its housing targets EVERY year since 2010, consistently having more houses built than other local authorities in England.\nIt is my intention to survey residents for their views on this subject in the near future.\nHyNet project – outcome of meeting held on 18 February 2025\nThis note has already been circulated to all parish councillors, but is repeated here in the context of this report.\nOn Tuesday 18th February 2025 a meeting took place between representatives of local parish councils (Backford & District, Lea-by-Backford, Mollington and Saughall & Shotwick Park were invited), myself as the borough councillor for the area and representatives working on behalf of Liverpool Bay CCS Limited, the company responsible for developing the HyNet Carbon Dioxide Pipeline. The purpose of this meeting was to receive an update on the current status of the project, the immediate next steps and commence a series of these meetings going forward to establish channels of communication with the local community. Although this meeting was limited in attendance, there will be wider community engagement and updates in the coming months.\nKey outcomes were as follows:\n- Detail was given regarding the appointment of the principal contractor for the project, United Living Infrastructure Services. We were introduced to an individual, Mike Cobble, who will be a key contact going forward. Mike’s role is Director of Major Projects.\n- United Living reiterated their commitment to ‘delivering the project safely and sustainably, with a positive impact on the community.’\n- Information was supplied around the timetable to date and next steps:\n- March 2024 – Development Consent Order awarded (planning permission, in effect)\n- Q2 2024 – Q1 2025 – Project approvals and detailed design work\n- Q2 2025 – Q3 2025 – Archaeological work, ground investigations, enabling works (accesses, land drainage)\n- Q4 2025 – Q2 2028 – Construction (with an aspiration to concentrate as much as possible during periods of good weather, i.e. the summer months)\n- Some specific issues that have been identified by the community during the consenting process are being considered as part of the detailed design work. This includes the traffic management plan and consideration to the most effective routes for construction traffic avoiding narrow lanes where possible for more suitable alternatives (such as the A41 for key access to sites along the route of the pipeline). The need to be sensitive to school traffic and opening / closing times was also mentioned. Other similar specific points were commented on.\n- Initial comment was made on potential ‘community benefit’ outcomes that might flow from the project. These include an aspiration to utilise local employment and skills where possible, use of existing local amenities for the workforce that will be present in the area for up to 2 years and the potential for a ‘Community Benefit Fund’ to be established which could leave a tangible and positive legacy in the community following the intensive project works.\n- Residents are encouraged to visit www.hynethub.co.uk and sign up to newsletter updates. This website will be a key resource for the dissemination of project updates. The email address: [email protected] can also be used to direct queries that you might have.\nThe group assembled on 18/02 will meet with the project team again in the coming months (likely June) and then quarterly thereafter (increasing in frequency if necessary). A wider community engagement opportunity will also be explored later in the year (likely early autumn).\nMiscellaneous\n- Update on this issue log (as noted in my February 2025 report): Surface deterioration, sinkage in road surface and silted gully (in the vicinity of 63 Greenway and top end of Saughall Hey). Reported on 02/02/25. Ref. CE684007064 (surface and sinkage) and CE684007064 (silted gully). In respect of the surface and sinkage, reply from CWaC Highways (05/02/25): “We have undertaken an assessment in response to your enquiry. At the time of the assessment, and in line with our safety code of practice, no safety related concerns were identified. However; we appreciate the concerns you have raised, and we will continue to monitor this matter via our highways safety inspection programme and any future enquiries. Any future safety related matters will be actioned on a priority basis.”\n- Branches down / some likely to fall outside 67 Church Road, Saughall. Reported on 09/02/25. Ref. CE686076998. CWaC have confirmed they will action.\n- Water leak at the pavement near the church car park, Park Way, Saughall. I have reported again the persistent water leak in this location which is causing a quagmire to develop. Reported on 09/02/25. Ref. CE686078346. CWaC officers have been asked to escalate this to the relevant water company for resolution.\n- Tree outside 4 Meadows Lane, on verge. Fallen branches and others in danger of falling. Tree may be diseased. Reported on 09/02/25. Ref. CE686080193. CWaC have confirmed they will action.\n- Multiple potholes – Long Lane (right hand side having left Parkgate Road and heading towards the village). 3 different locations. Reported on 09/02/25. Ref. CE686081242. Not yet actioned.\n- Grid edge potholing / deterioration – Long Lane, beyond the village sign. Reported on 09/02/25. Ref. CE686082046. Not yet actioned.\n- Hermitage Road (opposite entrance to Hermitage Court) – pothole. Reported on 09/02/25. Ref. CE686082797. Now repaired.\n- Worsley Avenue pavement – severe rutting. Reported on 09/02/25. Ref. CE686083552.\n- Possible water leak – Long Lane, Saughall (opposite Russet House). There is no obvious reason for this. Reported to CWaC for investigation, 12/02/25. Ref. CE687158285.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_map-locations/content_19.html": "Skip to main content\nMain navigation\nHome\nAbout Simon\nNews\nOur Plan\nCampaigns\nContact\nMy map",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_campaigns_levelling-up-skills-jobs/content_14.html": "Our proximity to highly skilled jobs in advanced manufacturing and technology mean new, well-paid jobs on our doorstep. I’m using my experience working with businesses to ensure young people have a clear route into rewarding careers. And I’ll organise an annual Jobs, Skills and Careers Fair to help match our best talent to exciting careers, and the security of a regular wage.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_campaigns_our-heritage/content_8.html": "From the historic city centre of Chester to the market town of Neston, and all the communities and villages in between, we need to maximise and protect our unique heritage assets. I’ll work with residents, businesses and local groups to make our area a world class destination for tourism, culture and heritage – and will always speak up on issues like the condition of our internationally important city walls.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk/content_1.html": "Find out more about my plan.\nLatest news\nOur Map\nContact\nCampaign Office\nNW Cheshire Conservatives, 69 Hoole Road, Chester CH2 3NJ.\n01244 322 732\nHi, I'm Simon Eardley, Conservative councillor for the Saughall and Mollington Ward on Cheshire West & Chester Council. I'm passionate about our area and its communities and am hard at work week in, week out, supporting residents on a range of issues and concerns.\nShare your views with Cllr Simon Eardley on Housebuilding and the Green Belt in Saughall and Mollington",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_news_comments-shotwick-park-community-engagement-exercise-march-2025/content_9.html": "Cheshire West and Chester Council has been working in partnership with Saughall & Shotwick Park Parish Council and The Mersey Forest to engage with local residents to develop ideas for the future use of land at Shotwick Park. This includes the historic parkland, woodland, grassland, streams and other habitats. An initial community engagement exercise has been undertaken (more details available here: https://participatenow.cheshirewestandchester.gov.uk/shotwick-park-engagement) which closed on Sunday 16th March 2025. In addition to the survey that was available for completion, I have also emailed the team with the following comments which I've included below.\nSubmitted by Cllr Simon Eardley, 16 March 2025:\n\"Thank you for your hard work on the community engagement around the future of the Shotwick Park Estate. I hope the results of this initial exercise are positive and that a large number of people have taken the opportunity to 'have their say'. I have completed the online survey, but wanted to take the opportunity to add these additional comments via email for your consideration.\nI strongly support the following principles, amongst other things:\n- Enhancement of the land through the creation of new woodland, better management of existing woodland and the potential positives that the creation of new community woodland has to offer the parish.\n- The maintenance of, and enhancement of, public right of way access to the land.\n- Creating space(s) which provide better access to nature for local people.\n- Improving educational understanding of the site and its features - both the natural world and historical assets such as Shotwick Castle.\nI would wish consideration to be given to the following additional points:\n- Wildflower meadows. An emphasis on native species and those particular to the area is a priority in my view. Any seed mix should be species rich and those which offer the most value to native pollinators and other native wildlife. There are examples on the site already of particular wildflowers, such as the 'Cheshire county flower' - the Cuckooflower - please be sensitive to these areas and seek to increase them.\n- Tree planting. Where possible, an emphasis on native species, of 'relevance' to the area would be good. Engaging the community in tree planting sessions in due course would be a valuable means to utilise the enthusiasm of residents to see this site develop in a positive and sustainable way. Given the volume of tree planting expected, then I'd hope this can easily be achieved.\n- 'Oaks at 80' project. I am aware of this Mersey Forest initiative which seeks to offer a permanent (hopefully!) way to mark the anniversary of the end of WW2. The village of Saughall has important and deep association with the two world wars and the historic links between the original estate family and assets in the village, such as the Vernon Institute, mark this clearly. If a suitable location could be found within the estate to have a significant 'Oaks at 80' planting scheme, that would be welcomed. More here: https://merseyforest.org.uk/our-work/oaks-at-80/. I would be willing to consider using part of my Cllr Member Budget for hardware in such a space to offer opportunities for pause and reflection (such as benches).\n- Community (fruit tree) orchard - this would be an excellent opportunity to bring the community on board and potentially offer volunteering opportunities.\n- Extending the existing allotment provision in the village. If there is demand, I would be enthusiastic to see how a small area could be given over to additional allotment space in the village, possibly managed by the parish council if needed (although I have not discussed that with them!) The current allotment site is near to Shotwick House and this project could represent an opportunity to do more in this regard.\n- PRoW access. This is an important consideration for the local community in my view, not least owing to the extensive use of the existing network of footpaths by recreational users (both within the parish and outside - including me!) I am aware that there may be other routes being used by people which are not formal PRoW and continued use of these ‘permissive’ sites is important to some. If we have scope to extend the PRoW network in some way, that would be welcome. Over time, and subject to resources, I would like to see improved ‘all-ability’ accessibility for some of the footpaths. This will be challenging in some places owing to the nature of the routes (steep banks / fields with clay based soil etc), but if we can help those with mobility challenges to have better access to, and enjoyment of the land, that would be an immense positive. At least one resident has raised this with me as a consideration and I support their perspective. Maintenance of the PRoW network has been patchy in the past, but a more structured and consistent approach to that would be good.\n- Creation of a 'Friends of' group. Engaging the community in the future of the site and offering volunteering opportunities is a key consideration. The parish council may have a role in this - and might be able to use some of their resources to support future projects from their precept resources - but they do not necessarily have to lead the work. I believe the model of the Friends of the Countess of Chester Country Park is one that could be followed here. It is essential, though, that this is constituted in a proper way with real governance and accountability and if this is brought into being, that it is delivered in a democratic manner. There is already talk of this in the parish and some people have started to consider initiatives, but this need not be rushed and starting fresh on such a project would be important so that it is inclusive of all people. This should be considered carefully.\n- The land could have an important role to play in other challenges within the parish, not least that relating to drainage and flooding. Parts of the estate are historically 'wet' (former Dee estuary land), but some infrastructure (ditches etc) have been chronically neglected over time. Maintenance of these important assets is important going forward. This includes existing ponds on the estate which may (or may not) have received good maintenance in the past. If there is scope to introduce new ponds on the estate, this should be explored in appropriate locations. There may also be locations within the estate which could offer the opportunity for radical interventions - such as the introduction of beavers in a managed way. Existing 'brooks' and water systems which cross the site, could be areas where consideration is given to this possibility. Engagement with experts on the matter would be good in due course, to explore whether this is possible. I note the Government Policy Paper on this subject (February 2025): https://www.gov.uk/government/publications/wild-release-and-management-of-beavers-in-england/wild-release-and-management-of-beavers-in-england\n- Education opportunities. The estate lends itself to strong educational interpretation, including around its historic features such as the medieval ridge and furrow areas / the 'deer park' historic landscape / Shotwick Castle and, of course, the natural environment - woodland, wildflowers etc. I would be interested to see how we can engage the primary school in the site and encourage their use of it. I would be willing to provide resources from my Cllr Member Budget towards enhanced interpretation in some form (boards, other initiatives) if possible and believe that Shotwick Castle is potentially the most exciting opportunity represented here. It clearly already has fantastic historic value as a site in itself but 'bringing it to life' in some way, through modern technology, would be a real asset for the area.\nThere are people I have within my network who may be able to offer valuable advice and support for the future of this land, including:\n- Prof. Christian Dunn (Bangor University) - an expert in wetland science and key member of the team behind the Chester Wetland Centre which is intended to be near the Countess of Chester Country Park. Christian has extensive knowledge and understanding of the value of wetlands, both preservation and creation of new, to assist with environmental objectives. Engagement with him would be helpful I believe.\n- Philip Lewis (Smithy Farm - https://www.facebook.com/smithyfarmwales/). Philip runs the Saturday Saughall Farmers Market and also has expertise in hedge laying and other traditional country activities such as scything etc. I have already passed on his details; it would be good to explore opportunities to engage him in the site in the future.\n- Chester Archaeological Society. At the November 2024 Cabinet meeting I made the following remarks which I would like to be noted in this exercise too in the context of 'wider stakeholders' - engagement with them in due course would be valuable, I believe:\n\"There is also a significant Scheduled Ancient Monument in the area, Shotwick Castle. It is located on one of the very pleasant public right of way routes.\nMay I draw your attention to the views of Chester Archaeological Society which are relevant in this context. They are on record as welcoming the creation of woodland, hedgerows, field ponds etc as part of attempts to reduce and mitigate the impacts of climate change and create recreational opportunities. However, they have also commented on the potential for such schemes to adversely affect fragile rural archaeological remains.\nAs such, they submitted comments in March 2023 on a proposed scheme of ponds and scrapes in this area and expressed concern about potential impacts on the landscape of Shotwick Castle. The report makes passing reference to this site.\nPlease can assurances be given that if new planting and habitat-creation schemes go ahead, proper consideration will be given to the potential impact on archaeology and also consideration for how archaeology and the public recreational benefits of heritage that arise from a site such as this.\"\nI look forward to learning more about the outcome of the engagement exercise and working with the team in a positive way around the project in the future.\"",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_greenbeltsurvey/content_3.html": "The Government have announced big plans to reform planning law in the country to deliver housing targets, decided in Westminster.\nWhilst I'm not opposed in principle to new development - we do need more homes - it must be in the right place, with the right infrastructure to support it.\nI'm concerned these reforms will mean more development on our precious green belt and countryside. Please use this short survey to let me know your views, so I can ensure I represent them as accurately as possible.\nMany thanks!",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_about-simon-eardley/content_10.html": "This community is my home. I was born at the Countess of Chester Hospital, raised on my family’s small dairy farm a few miles away and now live in Hoole.\nI currently work in the maritime sector for an industry body called Mersey Maritime. From 2019 until 2023 I had direct responsibility for a major national programme, delivered alongside Government through a national organisation, Maritime UK, to build organisations that develop maritime business ecosystems. These help deliver the jobs needed for the industry to address key challenges like decarbonisation.\nCurrently, I am councillor for the Saughall and Mollington Ward, elected in 2019 and re-elected in 2023 with an increased share of the vote. As a local resident and councillor, I work hard to understand the needs of our community and act to make a difference in addressing any problems faced.\nI use our shops, restaurants, healthcare and leisure facilities every single day of the week, and I share the frustration that our local representatives focus on attacking the Conservative government instead of making the case for the investment our communities desperately need.\nI will be an MP who has a plan:\n-\nworking to attract investment to support our high streets\n-\nmaking the most of our historic heritage assets in Chester and the wider area\n-\nworking with our Police and Crime Commissioner to deliver strong and visible neighbourhood policing\n-\nmaking the case for further government support and investment in health, schools and transport\n-\nMost people have no interest in politics; they want their elected representatives to be competent and focus on getting on with the job. But they also want to be represented by people who care.\nI am driven by strong values and public service, reflected in my work representing local residents as their borough councillor. Residents should see their MP getting stuck in to sort problems out. I’ll always do that.\nI am local, I am experienced, and I am motivated to give back to my local community. My overriding priority is to be a passionate advocate for Chester North and Neston, to champion its future and be a strong voice for each and every part of this constituency in Parliament.\nI also know that Government doesn't have all the answers and that, often, the solutions can be found in local organisations who are working day in, day out, on issues in the community. Where I can, I help them too:\n-\nTrustee, Cheshire DrugWatch Trust. Part of the trust leadership team delivering drugs-related education and prevention work in schools across Cheshire.\n-\nLicensed Lay Minister (Reader) in the Church of England. Leading worship (services/preaching) and supporting congregations through pastoral work.\n-\nTrustee, Mission in the Economy (MiTE). Recently appointed to this charity undertaking ‘industrial chaplaincy’ activities in the Liverpool area, as a result of my maritime expertise.\n-\nIt is important to have interests outside of political activity. I am also a member of the National Trust, English Heritage, Conservative Friends of Israel, the Prayer Book Society, and a ‘Clean Air Champion’ for the Conservative Environment Network.\nIn the coming weeks and months, I will be working to meet more of my neighbours, friends and people across the communities that make up our new constituency. I know that trust has to be earned and that people must never be taken for granted. I never have, and I never will.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_news_march-2025-updates-parish-councils/content_5.html": "Cllr Simon Eardley attends as many meetings of parish councils in the Saughall and Mollington Ward as possible. At each, he is given an opportunity to report back on issues and challenges he has been engaged with over the weeks between meetings. Below are copies of his reports to such meetings in March 2025.\nSaughall & Shotwick Park Parish Council - meeting held on Monday 3rd March 2025\nFull report available here: https://www.simoneardley.uk/news/report-saughall-shotwick-park-parish-council-march-2025\nCapenhurst & Ledsham Parish Council - meeting held on Tuesday 4th March 2025\nRectory Lane battery storage facility – planning application considered at the Planning Committee on 04 February 2025. Robustly debated (thanks to Tom Miller for speaking on behalf of the community) – tight vote (5 yes, 4 no, 2 abstain). SE (and cc’d to Cllr Clowes) has been in touch with Jonny Hill (Firstway Solar), regarding the promised 'Community Benefit Fund'. His reply as follows:\n“We’re still working through the Unilateral Undertaking with the Council so we haven’t technically received the planning permission yet as the Decision Notice is still to be issued.\nOnce the Decision Notice has been issued, we will be contacting the Distribution Network Operator (DNO) to advise them that we have planning permission. They will then in turn re-confirm the grid connection. Due to the grid connection reforms that OFGEM and NESO are currently carrying out we expect the DNO to re-confirm our connection in summer 2025.\nOnce we have the grid connection re-confirmed we will be in touch to finalise the Community Benefit Fund.”\nCWaC agreed its budget for 2025/26 on 20 February 2025.\nThis meeting resulted in a 4.99% increase in council tax being approved – I voted against. For the typical ‘band D’ property, that means an annual charge now of £1978.09. During the course of the budget debate I, or other members of the political group of which I am a member, proposed the following:\n- The introduction of 20 mph zones around schools across the borough which don’t currently have this provision. After much discussion, this was finally agreed, although in the original intended format that I had proposed.\n- The introduction of a ‘Safer Routes to Schools’ officer to look at strategic challenges around ‘active travel’ to school and education institutions. The ruling administration rejected this proposal.\n- An increase to the gully cleansing budget (£225,000) and thereby an expansion of its scope. The ruling administration rejected this proposal.\n- The introduction of a ‘siding out’ budget for pavements experiencing ‘overgrowth’ from vegetation (£200,000). The ruling administration rejected this proposal.\nI have arranged a meeting with CWaC Flood Team to review all outstanding issues across the Saughall & Mollington Ward – agreed for 28/03/25 - this includes well known challenges within the parish.\nMember Budget application – January 2025. Agreed £300 which has been received (for litter picking equipment).\nCWaC will proceed towards a ‘devolution deal’ in the coming months. Agreed that ‘we’ are to be fast-tracked and will elect a Mayor in May 2026. Precise responsibilities and scope to be agreed. Various consultations underway, including with the public in due course.\nVarious issues reported in recent times:\n- Badgers Rake Lane (Parkgate Road end) – sweeper request. Logged 03/03/25.\n- Water leak, Ledsham village (outside 1 Holly Bank Farm). Logged 16/02/25.\n- Multiple potholes, Capenhurst Lane, village (near Penfold Close). Logged 16/02/25.\n- Water leak, Capenhurst Lane (up from Capeles), village. Logged 16/02/25.\nLea-by-Backford Parish Council - meeting held on Monday 10th March 2025\n- Drainage matters – comprehensive meeting planned with CWaC officers for 28 March 2025 to review issues in various locations across the Saughall and Mollington Ward, including on Grove Road (in the vicinity of the property, Aerona, and elsewhere).\n- 25/00378/AGR | Erection of agricultural building to store machinery, produce and fodder. | Land East of Demage Lane (Between Lee Hall Farm and Lea Hall Cottages) | Lea by Backford, Chester, Cheshire. Views of parish councillors sought, although this application will be dealt with under delegated officer powers (i.e. there is no right of ‘call-in’).\n- HyNet CO2 pipeline project update. The outcome and notes for the liaison meeting held on 18th February 2025 were circulated to parish councillors on 24th February and are available at this link: www.simoneardley.uk/news/hynet-co2-pipeline-project-february-2025-update\n- CWaC agreed its budget for 2025/26 on 20 February 2025. This meeting resulted in a 4.99% increase in council tax being approved – I voted against. For the typical ‘band D’ property, that means an annual charge now of £1978.09. During the course of the budget debate I, or other members of the political group of which I am a member, proposed the following:\n- The introduction of 20 mph zones around schools across the borough which don’t currently have this provision. After much discussion, this was finally agreed, although in the original intended format that I had proposed.\n- The introduction of a ‘Safer Routes to Schools’ officer to look at strategic challenges around ‘active travel’ to school and education institutions. The ruling administration rejected this proposal.\n- An increase to the gully cleansing budget (£225,000) and thereby an expansion of its scope. The ruling administration rejected this proposal.\n- The introduction of a ‘siding out’ budget for pavements experiencing ‘overgrowth’ from vegetation (£200,000). The ruling administration rejected this proposal.\n- As requested at the January meeting of the parish council, I asked CWaC officers to issue a ‘cut back’ notice in respect of a hedge on Station Road. This was logged on 16/02/25 (ref. CE688023933). Officer has acknowledged this will be actioned.\n- Broadband in the area update – further to recent engagement with parish councils, I have received this frustrating update from the CWaC Digital Officer (10/03/25). I have also emailed the Chester North and Neston MP to ask her to look into the matter at a ‘national level’ as there is stated government ambition to improve broadband provision across the country – this MUST include rural areas.\n“The Connecting Cheshire Partnership (Cheshire East, Cheshire West & Chester, Halton and Warrington Borough Council) have been made aware by Building Digital UK (BDUK) that Freedom Fibre and BDUK have mutually agreed to terminate the contract for Cheshire (lot 17).\nWhilst the local authorities do not control or manage this project, we are in constant contact with our representatives at BDUK about this matter. BDUK have assured us that that they are already moving swiftly to put in place alternative solutions for premises that were due to be connected via this contract and remain committed to achieving full gigabit coverage across the UK by 2030. We will work with BDUK in understanding and agreeing the next steps of broadband deployment for Cheshire, Halton and Warrington, ensuring the focus on broadband remains a priority for the many premises who still desperately need better broadband connectivity.\nOur latest project information can be found via our Digital Cheshire Programme and the team are contactable via the website: www.digital-cheshire.co.uk”\nBackford & District Parish Council - meeting held on Tuesday 11th March 2025\nBT have once again initiated a consultation on the potential removal of the telephone kiosk on the village green in Backford as it has been used 16 times in the last 12 months only (i.e. an average of just over once per month). This is an issue that has been discussed before. The Parish Council have previously indicated a willingness to take the kiosk on as an asset and potentially turn it over to an alternative use. The PC have confirmed their willingness to do this again should BT be clear in their wish to stop the use of this kiosk for its originally intended purpose.\nSign on the approach to the Little Rake Lane / Rake Lane ‘difficult bend’ – logged on 16/02/25 (ref. CE688025607). Officer has reviewed, indicated they will monitor and in due course increase the depth of the concrete base.\nConcerns regarding the health of a tree on Rake Lane. This was logged on 07/09/24 (Ref. CE644799618). A CWaC Tree Team officer has now been out on site and advised on 10/03/25 as follows: “Thank you for your enquiry. To advise, I have now inspected the Oak tree and no further action is required.”\nHyNet CO2 pipeline project update. The outcome and notes for the liaison meeting held on 18th February 2025 were circulated to parish councillors on 24th February and are available at this link: www.simoneardley.uk/news/hynet-co2-pipeline-project-february-2025-update\nCWaC agreed its budget for 2025/26 on 20 February 2025. This meeting resulted in a 4.99% increase in council tax being approved – I voted against. For the typical ‘band D’ property, that means an annual charge now of £1978.09. During the course of the budget debate I, or other members of the political group of which I am a member, proposed the following:\n- The introduction of 20 mph zones around schools across the borough which don’t currently have this provision. After much discussion, this was finally agreed, although in the original intended format that I had proposed.\n- The introduction of a ‘Safer Routes to Schools’ officer to look at strategic challenges around ‘active travel’ to school and education institutions. The ruling administration rejected this proposal.\n- An increase to the gully cleansing budget (£225,000) and thereby an expansion of its scope. The ruling administration rejected this proposal.\n- The introduction of a ‘siding out’ budget for pavements experiencing ‘overgrowth’ from vegetation (£200,000). The ruling administration rejected this proposal.\nBroadband in the area update – further to recent engagement with parish councils, I have received this frustrating update from the CWaC Digital Officer (10/03/25). I have also emailed the Chester North and Neston MP to ask her to look into the matter at a ‘national level’ as there is stated government ambition to improve broadband provision across the country – this MUST include rural areas.\n“The Connecting Cheshire Partnership (Cheshire East, Cheshire West & Chester, Halton and Warrington Borough Council) have been made aware by Building Digital UK (BDUK) that Freedom Fibre and BDUK have mutually agreed to terminate the contract for Cheshire (lot 17).\nWhilst the local authorities do not control or manage this project, we are in constant contact with our representatives at BDUK about this matter. BDUK have assured us that that they are already moving swiftly to put in place alternative solutions for premises that were due to be connected via this contract and remain committed to achieving full gigabit coverage across the UK by 2030. We will work with BDUK in understanding and agreeing the next steps of broadband deployment for Cheshire, Halton and Warrington, ensuring the focus on broadband remains a priority for the many premises who still desperately need better broadband connectivity.\nOur latest project information can be found via our Digital Cheshire Programme and the team are contactable via the website: www.digital-cheshire.co.uk”\nPossibility of a vehicle activated sign on Rake Lane – response to query submitted received from CWaC as follows: “The highway service officers have advised that there is a criteria which they work to for the provision of vehicle activated signs such as you have requested for Rake Lane. They have undertaken an assessment using data they have which shows the speeds are lower than required to meet the justification for a sign. What this would mean is that should a sign be erected; it would rarely flash as although drivers may be approaching at a speed that is not appropriate for the bend, they are not exceeding the speed limit which is the level they [the sign] would be set at, so it is not appropriate for this type of sign to be put up.”\nPlanning – house building targets. These personal observations may be helpful in the context future planning / green belt issues in the parish:\nThe full implications of the Labour government’s ambition to build many more homes across the country are now becoming better understood. In simple terms the local house building target has been almost quadrupled. The total for Cheshire West and Chester, each year, is to be 1914 new homes per year - instead of the existing target of just over 500. As a result of this increase, and the speed at which the government wants it done, it may be harder to stand up to developers wanting to build on inappropriate green spaces in our local communities. It is possible that the new planning guidance will give the requirements of Neighbourhood Plans much less weight with the balance in favour of the developer and Cheshire West expects to receive speculative applications from developers. This is not necessarily a reason not to undertake this work though. My view is that a ‘brownfield first’ approach is best as once a green space is gone, it’s gone forever. Housing must also be delivered sustainably - where infrastructure like roads, schools, GP surgeries - are built alongside. CWaC has overachieved on its housing targets EVERY year since 2010, consistently having more houses built than other local authorities in England. It is my intention to survey residents for their views on this subject in the near future.\nI have received correspondence (letter and plan attached - not published on this webpage) regarding a proposed upgrade to an existing ‘base radio station [phone mast] installation’ at Backford, Chester, CH1 6PE (NGR E: 339129 N: 372705) – basically next to the M56 where it crosses the A41. It is advised that, ‘The site is needed to provide enhanced 2G and 4G coverage and capacity as well as new 5G service provision to ensure that customers experience access to the latest technologies currently available. The installation will also meet the extra demands on the network in this area as new technologies improve increasing the demand for 4G and 5G technologies.’ If you have any views on this proposal, please let me know ASAP.\nNotice has been received regarding a Planning Appeal (attached) which will be determined by means of written representations. This is in respect of ‘Land At Liverpool Road, Backford.’ Description of development: Erection of two 3 block of stables and two 2 block stables with hardstanding. Planning or Enforcement ref: 23/03838/FUL. Planning Inspector ref: APP/A0665/W/25/3360625. Planning Inspector: Appeal reference: 25/00029/REF.\nAppeal start date: 6 March 2025. Comment before: 10 April 2025.\nIf the parish council wish to make comments, or modify/withdraw any previous representation, you can do so online at: https://acp.planninginspectorate.gov.uk. Comments can also be sent to to: Claire Vicary, The Planning Inspectorate Room 3D Temple Quay House 2 The Square Bristol BS1 6PN All representations must be received by 10 April 2025.\nFollowing the January 2025 meeting of the parish council, I logged a query with CWaC Highways around the possibility of the PC using some of its financial resources to supplement (add to) the gully cleansing regime in the parish. This was logged on 11/02/25 and I have chased it further for a reply.\nChorlton Lane resurfacing works:\nAt the end of January, I received notification of a CWaC Highways order to temporarily prohibit traffic during preparation works for / a surface treatment works programme from the 10th February 2025 for a maximum of 18 months for various sites around the borough. This notice included Chorlton Lane, Chorlton-by-Backford and it is expected that any works will be completed by October 2025. Very welcome news!\nI queried the timeframes for Chorlton Lane specifically and was advised further:\n“These sites are pre-patching sites – in preparation for preventative treatments during the summer – i.e. surface dressing, micro asphalt etc. The below site you have specifically mentioned is the section in red currently, however I am evaluating the (section I’ve marked in yellow) in regard to cost and warranty liability to continue the scheme extents further – really its borderline to be able to pre-patch and surface dress. The decision I am contemplating is whether to refer it to the resurfacing programme (but it would be so far down the list it could takes years to get to) or do something in terms of preventative treatments rather than leave it to further deteriorate.”\nI have received the following further update (14/03) on this which represents progress (more of which will follow):\n“I am writing to provide you with an update on the proposed treatment works on Chorlton Lane. Essentially, we are looking at surface treatment options from its junction with Croughton Road to its junction with Little Rake Lane. Having scoped the site, surface dressing is suitable with patching up to the entrance of the fuel depot, but we will need to explore other material options from this point, due to the level of surface deterioration. We will be returning to examine the section highlighted from the entrance of the fuel depot to Little Rake Lane to determine what treatment would be most suitable along this section potentially next week. Once the site has been re-examined, we will provide an additional update on the works being carried out.”\nMollington Parish Council - meeting held on Thursday 20th March 2025\nI was away from Cheshire on the day of this meeting, so this report was submitted in writing to the parish council in advance.\nField near Crabwall Manor / Hall\nParish councillors will be aware of the development that has taken place at the field at the entrance to the driveway to Crabwall Manor / Hall. This has been a location of some concern for many months and has clearly escalated in recent weeks. The latest information I have is set out in the note I published on my councillor Facebook page recently (repeated below in italics).\nOnce the planning application that is mentioned is received, I intend to ask for it to be considered by the CWaC Planning Committee. I would appreciate the parish council giving the matter its close attention also at that point. This will also be the time when residents can ‘have their say’ in a formal way. I am in touch with several people on the matter and will keep them updated. In a communication sent to someone earlier this week, I did say the following: “I will do my best to resist this [application] through the formal mechanisms available to me as a councillor. A word of caution though, even if planning permission is not granted by the Council, there is an appeal process which in recent years has often been favourable to applicants.” This will need to be borne in mind as the issue develops.\nFurther to previous communications regarding the unauthorised development activity at a field off Parkgate Road to the right of the entrance driveway to Crabwall Hall, I can update as follows:\n- Concerns in relation to this site have been consistently logged by me with CWaC Planning Enforcement since late October 2024.\n- Further information and concerns were logged again following an intensification of activity on Friday 28th February, over the subsequent weekend and since. I asked Planning Enforcement to undertake urgent enquiries regarding the site. This was actioned on Monday 3rd March with a site visit by two officers.\n- Some indication of the intentions of the landowner have been gathered. This included a verbal intention to submit a planning application regarding the site and a timeframe for submission was given. I await further developments in that regard and will review in due course.\n- CWaC officers have confirmed to me that they are actively considering what enforcement action they may be in a position to take in relation to what has already been undertaken. I have asked to be kept informed.\n- Development without planning permission is unacceptable in my view, although not illegal. A green field, in the green belt, has been almost completely turned into a site with a hardcore surface and living accommodation is on site with no clear waste or sewerage infrastructure present. If development is sought, it should only happen with appropriate permissions is my starting point for these things.\nI will continue to keep residents informed as this matter develops.\nDrainage matters around the village\nI have arranged a comprehensive meeting with CWaC officers for 28 March 2025 to review issues in various locations across the Saughall and Mollington Ward, including on Grove Road (in the vicinity of the property, Aerona) and elsewhere. This meeting was first mooted in early January 2025 and I am very frustrated that it has taken until now to get it firmly in the diary. I will feedback on the outcome / actions that will hopefully follow from this important engagement.\nSeparate to this, it was suggested some time ago that we (the parish council and me as the borough councillor) put together a newsletter focused on the responsibilities of landowners / homeowners regarding drainage (ditches / riparian responsibilities etc) and other matters (such as hedges). This has not progressed yet owing to the pressure of other work, but it will be actioned in the coming weeks. Advice will be sought at the meeting above in respect of some of the content. I will cover the production costs of this, but would appreciate some support with delivery of the document around the parish in due course.\nTownfield Lane matters\nAs parish councillors will be aware, Parkgate Road, in the vicinity of Long Lane, was closed for a period of time recently and this caused considerable challenges. The works were entirely necessary owing to a fault identified by Scottish Power. However, the traffic challenges locally (especially on Townfield Lane) were intolerable at times, not least owing to drivers acting irresponsibly by not following the well sign-posted diversion routes. I discussed this matter with the CWaC Director of Transport on 28/02/25 and remarked that it is essential for key learnings to be taken away for the future, including the need for more ‘hands on’ traffic management by the instigator of the closure (which wasn’t CWaC in this instance).\nYou were all sent a note on 14/03/25 as below. Points 1 and 2 relate to the challenges that arose from the Parkgate Road closure. I attach images received today in relation to sweeper works that have been undertaken, further to the comments under ‘street cleansing.’ I await a further update from Highways in respect of the verge issues. Progress is gradually being made; please continue to be patient.\n- Surface cleansing\nCllr Great to catch up earlier. As I explained in our call the far side of the road is still sludge with vast amounts of water but is drying and Highways were on site cleaning drains.\nI envisaged by Tuesday it will be best condition to have another go hopefully get it back to exceptional standard.\nPlease reassure villagers this will be resolved ,and I will catch up with you next week\nPaul\nCustomer & Quality Officer\nStreet Care Services\n- Verge assessment for repairs\nNote received on 10/03/25 from CWaC Highways: “We will be inspecting for safety defects initially to ensure the safe use of the road and then consider funding for any further cosmetic works.” I have asked to be kept advised as to the outcome.\n- Water connection works\nA temporary road closure notice, effective on 20th March (maximum of 5 days, expected to last 3 days) for Severn Trent Water connection works has been received as attached. This is in the vicinity of the barn conversions at Warren Farm from what I can tell from the map. See attached for the full notice. [Not supplied here on this webpage].\nFreedom Fibre / broadband\nCllr Wells and I met with representatives of Freedom Fibre on 21st February 2025 following concerns raised about the potential location of new green cabinet infrastructure to facilitate the delivery of their ‘Fibre To The Premises’ project as part of Project Gigabit. Positive discussions took place, and we agreed a potential way forward.\nRegrettably, circumstances have now somewhat overtaken us, and you will be aware of my update issued on , repeated as below, following notification from the CWaC Digital Officer on 10/03/25. I have also emailed the Chester North and Neston MP to ask her to look into the matter at a ‘national level’ as there is stated government ambition to improve broadband provision across the country – this MUST include rural areas.\n“The Connecting Cheshire Partnership (Cheshire East, Cheshire West & Chester, Halton and Warrington Borough Council) have been made aware by Building Digital UK (BDUK) that Freedom Fibre and BDUK have mutually agreed to terminate the contract for Cheshire (lot 17).\nWhilst the local authorities do not control or manage this project, we are in constant contact with our representatives at BDUK about this matter. BDUK have assured us that that they are already moving swiftly to put in place alternative solutions for premises that were due to be connected via this contract and remain committed to achieving full gigabit coverage across the UK by 2030. We will work with BDUK in understanding and agreeing the next steps of broadband deployment for Cheshire, Halton and Warrington, ensuring the focus on broadband remains a priority for the many premises who still desperately need better broadband connectivity.\nOur latest project information can be found via our Digital Cheshire Programme and the team are contactable via the website: www.digital-cheshire.co.uk”\nCWaC Budget outcome from 20 February 2025\n[The same comments on this subject were sent to this parish council as reported elsewhere on this page to others].\nPlanning - house building targets\n[The same comments on this subject were sent to this parish council as reported elsewhere on this page to others].\nHyNet CO2 pipeline project update\nThe outcome and notes for the liaison meeting held on 18th February 2025 were circulated to parish councillors on 24th February and are available at this link: www.simoneardley.uk/news/hynet-co2-pipeline-project-february-2025-update. The next meeting of this group is likely to be held in June 2025 – it would be good if Mollington PC could ensure they are represented as this project is likely to start to gather some pace from mid-year onwards.\nMiscellaneous reports / issues\n- Parkgate Road – left-hand side footway between the canal bridge and turn for the ‘substation’ houses. Persistent water leak / mud on footway as a result. Logged on 09/03/25 (ref. CE694431631). Will likely need to be referred to a utility company.\n- Notification was received on 12 March 2025 of a ‘Provisional Tree Preservation Order’ 12 March 2025 subject to the Town and Country Planning (Tree Preservation) (England) Regulations 2012 Town and Country Planning (Trees) Regulations 2012, in the vicinity of White Hart Lodge, Townfield Lane. This is for a period of 6 months, during which time consideration will be given as to whether this should be made permanent.\n- Following an earlier meeting of the parish council, I was asked to make contact with the new headteacher at the primary school to arrange a meeting with Cllr Wells and myself. This email has been sent, and I await a confirmed date in due course.\n- Removal of 2x hawthorn trees on the green area at the entrance to Tarrant Court. I was updated recently as follows by the CWaC Tree Team regarding this: “Our contractor, Forest, have got back to me and say it is scheduled for the 17th March.” I have not had an opportunity to look at the location since 17/03 – perhaps you could let me know if these works have been completed.\nQuery – please advise (the parish council to SE) in due course\n- In relation to the removal of the Tarrant Court trees, it was discussed at a previous parish council meeting there might be a wish to plant a new tree to replace the two to be removed by CWaC as noted. Please advise whether discussions on this have progressed. Whilst it might not be suitable to plant an oak tree in this location, you might wish to look at the ‘Oaks at 80’ project being championed by the Mersey Forest: : https://merseyforest.org.uk/our-work/oaks-at-80/\nPuddington & District Parish Council - no meeting scheduled\nThis parish council is currently 'mothballed' and is not meeting, following the resignation of all parish councillors last year.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_news_april-2025-report-saughall-shotwick-park-parish-council/content_11.html": "Cllr Simon Eardley presented his April 2025 report to the meeting of Saughall & Shotwick Park Parish Council on Monday 7th April 2025. The full 'copy' is repeated below. Should any residents wish to raise any points on these issues (or others), they can drop him a line on: [email protected]\nDrainage challenges in the parish\nI met with CWaC officers from both the ‘Flood’ and ‘Highways’ teams on Friday 28th March 2025. This meeting updated me on a range of different locations around the parish and gave details of various actions that have been taken in recent months to assist with dealing with problem areas. Locations covered were Long Lane, Parkgate Road, Seahill Road, Hermitage Road, various closes off The Ridings. Whilst progress has been made, there remain a number of areas which require further interventions, largely by private landowners. It is proposed that the Flood Team officer attends a meeting with the parish council to update everyone on their work and I would like to secure a date for this meeting as soon as practical, although it might need to wait until after 1st May. Please can we consider this during the parish council meeting on 7th April. I am also in the process of drafting a short summary note on the current status of many of these challenges and will supply that to the parish council and others in due course.\nLong Lane – water leak (vicinity of Russet House)\nThis case was ‘escalated’ on 20/03/25 (as included in my March 2025 report): Possible water leak – Long Lane, Saughall (opposite Russet House). There is no obvious reason for this. Reported to CWaC for investigation, 12/02/25. Ref. CE687158285.\nI received the following update from CWaC Highways relating to this extensive and worsening issue. Repeated here: “It is a 300mm water main [leak] with a connection to Russet House. We have sent a Section 81 Notice [explanation of this below] to United Utilities about the leak. Based on experience they may be slow to act on it. As a contingency plan, we may look to divert the leaking water into the adjacent ditch course if they do not come back with a firm date for repair.\"\nA Section 81 notice is a notice served by a highway authority to a statutory undertaker (like a utility company) regarding a duty to maintain apparatus within the highway, if found defective. I've expressed my view that this needs to be resolved ASAP and asked that this point be impressed upon United Utilities. There are too many leaks like this locally which seem to take a disproportionate amount of time to get resolved.\nI also asked the question as to whether, should this contingency plan be enacted, whether or not the Council can ‘recharge’ the costs back to the utility company. The response as follows: “We can only recharge them for consequential damage to the highway arising from the leak.”\nThis location has improved in recent days as a result of the ‘diversion’ mentioned above being implemented (subject to confirmation from CWaC - it may be the utility company has implemented a fix).\n‘Shrub bed’ – rear of Darlington Crescent\nThere is a ‘redundant’ former shrub bed on the green space to the rear of Darlington Crescent / Wain Court. This was cut back by CWaC, but there are stumps etc that require removal in order that the land can be totally flat for mowing operations etc. I have been advised as follows:\n“This is on our list of works, as agreed. Given there is no funding for this work the job will be done as an ad hoc and fitted in when we have an opportunity and the machinery. The area is currently safe and the shrubs are at ground level. The wet ground did cause delays last year, but I am confident we will have the area levelled in spring.”\nThe area will be addressed in due course and I will keep a watching brief on the matter.\nShotwick Park Estate\nIt may be of interest to you to know that a planning application submitted in 2022 as follows: “22/02869/FUL Construction of footpath and car park” has been formally withdrawn. This was in relation to land at the ‘Shotwick Park Estate’ which as we now know is subject to the new CWaC controlled project.\nI look forward to hearing the reaction from parish councillors in due course following their meeting with CWaC officers regarding the outcomes from the community engagement exercise that concluded in mid-March. I received my own briefing on this on 3rd April, which included details of the future engagement which is planned but is slightly impacted by the ‘pre-election period’ rules the borough council is operating under owing to the Runcorn & Helsby parliamentary by-election. I will support officers with publicising their plans for this engagement in due course.\nSeparate to the above, I have been in some correspondence with Chester Archaeological Society regarding their interests in the overall estate from their particular and expert perspective. I understand that the CWaC project team are also in touch with them and I have offered support in terms of realising some potential projects related to Shotwick Castle (interpretation; refresh of display boards etc) in due course.\nKingswood Avenue\nI am assisting residents with a number of issues arising from the use of a property on Kingswood Avenue for residential and supervised care provision, commissioned by CWaC to a private company. The nature of the concerns raised relate to planning matters (change of use / various elements of development at the site), parking challenges and miscellaneous other issues. The Chester North and Neston MP is also aware of the challenges and has been in correspondence with CWaC officers on the location also. The planning concerns will be addressed by CWaC Planning / Planning Enforcement in due course and I will continue to liaise with residents accordingly. No action is required of the parish council at this time.\nSaughall Gardening Club / Green Waste / HWRCs\nI attended a very interesting and informative meeting of Saughall Gardening Club, at their invitation, on 17th March. They received a presentation from Tara Dumas who is the Strategic Waste Manager at CWaC which was very helpful and insightful. The focus was on all aspects of waste and recycling within the borough and I have attached the slide deck here for those who might be interested in reading what was presented.\nA reminder that the season for green waste collections is now underway. The borough council continue to offer an opt-in chargeable service costing £52.50 per bin per calendar year regardless of when you subscribe during the year. More details and a link to register is available here: www.cheshirewestandchester.gov.uk/residents/waste-and-recycling/garden-waste-collection\nDuring a meeting of a recent council committee (Places Scrutiny) that I sit on, we discussed the outcome of consultation on the future use of Household Waste and Recycling Centres (HWRCs) in the borough. Plans from the Labour administration to limit the amount of DIY waste brought to HWRC sites without charge were part of the debate. 60% of residents who responded to the consultation believed that this would have a negative impact and likely result in more flytipping, something that is a major problem in the Saughall & Mollington Ward. Soon, the Council will bring in charges - £3.70 per 50L bag after a certain amount of 'free allocation.' I asked the Cabinet Member responsible for this area of council work whether this charge will automatically increase next year - she basically said yes. I will produce further information and details around this in due course to keep residents informed. If you wish to read the paper presented to the committee in question, the material is available via this link (agenda item 9): (Public Pack)Agenda Document for Places Overview and Scrutiny Committee, 24/03/2025 17:30\nMiscellaneous\n- Flytipping – Lodge Lane – door frame and white goods in the hedge. Reported on 19/03/25. Ref. CE697781312.\n- Planning – The Woodlands, Church Road x3 planning applications. I have placed a provisional ‘call-in’ on each of the three retrospective planning applications at this location, as listed below. My reasons for doing so are on the CWaC Planning Portal. This does not mean to say that these applications will necessarily go forward to the Planning Committee for decision, but the ‘call-in’ process will allow me to have greater engagement with officers on each application.\n- Two storey and part single storey rear extension (Retrospective). Ref. No: 25/00477/FUL.\n- Reinstatement of track and construction of pond in paddock land to rear of domestic curtilage boundary (Retrospective). Ref. No: 25/00498/FUL.\n- Demolition of existing garage building and construction of new replacement garage (Retrospective). Ref. No: 25/00491/FUL.\n- Fiddlers Lane – highways repairs – notice of road closure received for 07 April 2025 (for a period of 5 days – works expected to last 1 day). Works are in vicinity of the Scout Hut.\n- Parish Council Newsletter. I am pleased that the ‘Spring newsletter’ was sent to print last week (w/c 31 March) and as far as I am aware the printed copies have now been received by the Clerk.\n- Community Speedwatch. Having recently been retrained, it was good to join the team for my first session of activity on Friday 7th March on The Ridings. More recently, I was part of the team for their session on Friday 4th April on Seahill Road (at the junction with Crofters Way). Thanks as ever to Graham Haughton and all the volunteers who undertake this important work on behalf of the community. In our hour long session, some 7 vehicles were observed in excess of the 30mph speed limit with a top speed of 41 mph.\n- Repairs have now been undertaken to areas logged at the start of February on Long Lane – various potholes between the village sign and the Parkgate Road junction (Ref. CE686081242) and the edge deterioration around a drainage grid down from the village sign (Ref. CE686082046).\nPotential ‘devolution’ for Cheshire & Warrington – Government-led consultation live until Sunday 13th April 2025.\nAs per my note to parish councillors on 28th March 2025, a reminder of the above consultation which is still live for another week or so:\nCheshire and Warrington (the council areas covered by Cheshire East, Cheshire West & Chester and Warrington) has been identified by the Government as a place to potentially establish a ‘Mayoral Combined Authority’ – in short, devolving power from Westminster to a more local level with the introduction of a directly elected Mayor.\nDevolution is intended to be about making more decisions locally – by people who know our region and its residents best. It may be that through devolution, we will have more say, more power, and more funding locally to help improve our transport, invest in more training and better jobs, support thriving town centres and prosperous rural communities.\nAt the moment, the Government is leading a consultation on the areas identified for its ‘Devolution Priority Programme.’ The consultation seeks views on the proposal to establish a Mayoral Combined Authority in Cheshire and Warrington.\n- The consultation is now open and will close at 11.59pm on Sunday 13 April.\n- The full consultation document can be found on the GOV.UK website: www.gov.uk/government/consultations/cheshire-and-warrington-devolution\n- Responses for the Cheshire and Warrington devolution consultation will be via: www.consult.communities.gov.uk/lggc/cheshire-and-warrington-devolution[1]consultation\nThis is a government-led consultation. It is not a council or locally-led consultation.\nYou can find answers to a number of FAQs on the Cheshire and Warrington devolution website: www.cheshireandwarringtondevolution.com – you may wish to view this site before responding to the consultation itself.\nProposed list of areas of competence\nAreas where Combined Authorities should have a mandate to act strategically to drive growth as well as support the shaping of public services, where strategic level coordination adds value.\n- Transport and local infrastructure\n- Skills and employment support\n- Housing and strategic planning\n- Economic development and regeneration\n- Environment and climate change\n- Health, wellbeing and public service reform\n- Public safety\nShould devolution happen in our area, it should be noted that each current unitary council will remain and retain its independence following devolution and no council will inherit any financial deficits or surpluses from partners.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_cdn-cgi_l_email-protection/content_4.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_cookies/content_16.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_campaigns_delivering-better-transport/content_7.html": "We can’t just keep talking about improving transport connections – we need to see them delivered. I’m working with colleagues in Cheshire and North Wales to secure the electrification of the Crewe to Holyhead rail line, and campaigning for better provision to and from North Wales and Merseyside into Neston. And I’m making the case for funding for local bus services.",
  "https_www_simoneardley_uk_/https_www_simoneardley_uk_campaigns_making-our-streets-safer/content_15.html": "Our Conservative Government has recruited every single one of the 20,000 extra police officers it said it would. This includes securing 322 extra police officers for Cheshire – more than at any time in the force’s history. I’m campaigning for additional resources to tackle crime and ASB hot spots. This includes a focus on neighbourhood crime, drug abuse and dealing with speeding, to keep our communities safe."
}