{
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_SouthernWater/content_27.html": "Update 16 May 2024 - Local MP Alan Mak chairs latest Southern Water Regional Forum meeting to keep up pressure on discharges reductions\nLocal MP Alan Mak has kept up the pressure on Southern Water to reduce sewage discharges by chairing the latest meeting of the Southern Water Regional Forum.\nThe Forum brings together MPs, councillors and community representatives from the region with senior management from Southern Water.\nIn 2021 Mr Mak campaigned for and helped to pass the Environment Act in Parliament which forced Southern Water to put in place plans to cut sewage discharges, and then eliminate them in normal conditions.\nThe company's Clean Rivers and Seas Plan includes an investment of £700m scheduled to take place between 2025-2030, rising to £1.5bn by 2035.\nMr Mak and fellow MPs have insisted on progress reports every year as well as organising Regional Forums throughout the year.\nAt the latest meeting Southern Water Chief Executive Lawrence Gosden said that, in the first year of a two-year storm overflow reduction plan, the company had achieved a 37% decrease in discharges despite 10 named storms and an unusually wet winter.\nSince the last Regional Forum, Southern Water has also submitted a business plan to industry regulator Ofwat that proposes £7.8bn of investment from 2025-2030 to deliver major improvements in water resilience, wastewater treatment and customer service, as well as enhancement and protection of the environment.\nMr Gosden explained that Southern Water is planning to deal with increased rainfall by improving surface water drainage rather than simply building bigger storage tanks. However, Budds Farm wastewater treatment works in Havant will have some additional storm storage capacity in place by the end of 2025 as their tanks are expanded.\nDuring storms, stormwater will now go through the Long Sea Outfall at Eastney, avoiding the coast near Langstone Harbour, and treated effluent will be discharged from Budds Farm.\nHe said this will make a big difference to water quality in Langstone Harbour and will be done over the next year.\nNick Mills from Southern Water also gave an update on the company's online Beachbuoy system, a 24/7 storm overflow tool where people can check local water quality.\nHe said a new, improved version of Beachbuoy is in development, which will work better on mobiles and feature information that is closer to real-time. After testing, there will be an expanded pilot scheme before it goes live.\nMeanwhile Southern Water is working with the University of Portsmouth on innovations such as a water quality buoy off Hayling Island.\nMr Mak said: \"I am keeping up the pressure on Southern Water to reduce discharges and keep the public informed about water quality, and the Forum welcomes their latest actions. Through the Regional Forum and my campaign work locally, I will continue to hold them to account on behalf of all residents in the Havant Constituency.\"\nUpdate 13 February 2024\nLocal MP Alan Mak backs bans on bonuses for polluting water company bosses\nThis week we saw the announcement of new government plans to crackdown on water bosses whose companies break the law. In the future, executives who oversee serious breaches of the law can expect to see their bonuses blocked by the UK’s water regulator, Ofwat.\nThis is common sense. If bosses get bonuses it should be for running their companies well. That doesn't just mean turning a profit but protecting our environment and providing us with a great service.\nTo make sure water company bosses aren't incentivised to make the wrong choices, Ofwat are taking forward a consultation into this new bonus ban. They still need to define its criteria, however early proposals include blocking bonuses where there has been a successful prosecution for a Category 1 or 2 pollution incident – such as causing significant pollution at a bathing site or conservation area – or where a company has been found guilty of serious management failings.\nThe ban would apply to all executive board members and Chief Executives and would be expected to come into effect later this year, subject to consultation. If taken forward, Ofwat would implement the measures by changing the conditions of water company licences. For water companies in England this would be done using the powers given to the regulator through the Environment Act 2021.\nI warmly welcome these measures, which will help support the campaign I am running locally to cut and then end discharges into Langstone and Chichester Harbours.\nUpdate 23 November 2023\nSouthern Water publishes plan to reduce storm overflows\nFollowing my campaign and the Government’s passage of the Environment Act in 2021 which I voted for, Southern Water are required to plan and execute schemes to cut storm overflows. This week we saw the publication of their Clean Rivers and Seas Plan which sets out their proposals for tackling the problem between 2025 and 2030.\nAs I’ve mentioned before, there is no ‘quick fix’ for preventing storm overflows. It is going to take long term investment in upgrading our sewerage network. Southern Water have recognised this challenge with a pledge to spend £700 million during the course of their latest plan (up to 2030), rising to £1.5 billion in investment by 2035.\nIf you want to see the measures they are planning in different parts of their catchment area, Southern Water have produced an interactive map which I’ve linked to here. Their prediction is that by 2030 these will reduce the number of spills across their network by 3,000 a year.\nFor Langstone Harbour, this will involve boosting the storage capacity at the Budds Farm water treatment works in Havant and bringing forward new ‘sustainable drainage’ solutions. These include installing amenities like water butts, soakaways and rain gardens, which slow the rate that rainwater enters the sewer system. This will smooth out the ‘spike’ in water levels caused by storms and make them less likely overwhelm the system. Schemes like this were effective during trials on the Isle of Wight where the introduction of water butts in one area reduced releases from one their outfalls by 70%.\nI am pleased Southern Water have fulfilled their commitment to produce a practical plan of action. We now need to keep them to their plan and ensure it delivers the environmental impact they are claiming. This is what I will continue doing through my campaign work locally.\nUpdate 10 October 2023\nContinuing my campaign to keep up the pressure on Southern Water to reduce discharges, I chaired another meeting of the Southern Water Regional Forum. This brings together local MPs, councillors and community representatives to put pressure on Southern Water.\nBy law, Southern Water must put in place plans to end sewage outflows. In 2021 I helped pass the Environment Act, which forced them - for the first time – to do this. At our last meeting I wanted to Southern Water to set a clear timetable for achieving their plan.\nSouthern Water have already been operating a set of small pilot schemes, aimed at reducing or slowing the rate of surface water entering our sewers. Too much water entering the sewers at once can overwhelm the system, and this is one of the key causes of discharges. Measures to reduce the rate of flow include soakaways, roadside swales, rain gardens in schools, real time smart control of sewer networks, highway drainage enhancements and development of public green spaces.\nAs these small schemes have proved successful, Southern Water are now rolling out a series of industrial ‘pathfinder’ pilots, to see if they work on a larger scale. If they do, they can be scaled up to cover their whole catchment area. This will involve the full implementation of their storm overflows reduction plan; an investment of £700 million scheduled to take place between 2025-2030.\nThe pathfinder pilots are due to be completed over the course of the next two years. To hold them to account, I and my fellow MPs have insisted on progress reports every year.\nSecondly, I am pleased that Southern Water have promised to address leakages caused by mechanical failures – pledging to reduce them by 80% in the next two years.\nFinally, I know many constituents make use of Southern Water’s online ‘Beachbuoy’ system to check local water quality. You may then be interested to learn that a new version of Beachbuoy currently in development. This will also include inland waterways and is intended to be easier for the public to use. The new system is scheduled to be released next March and, if you have any suggestions on how it can be improved, I recommend getting in touch with Southern Water: Contact Us to get in touch (southernwater.co.uk)\nUpdate 15 August 2023\nLocal MP Alan Mak welcomes £550m investment from Southern Water owner\nImproving water quality in our local harbours will require significant investment in local infrastructure. With construction and maintenance costs rising, Southern Water’s contribution needs to keep up if we to are to see tangible improvements in our area.\nI was pleased by Southern Water’s recent announcement that an additional £550 million is being injected into the business, of which £375 million will be used to support investment to protect the environment. This comes on top of the £1.1 billion which was invested in September 2021.\nThis new money will allow Southern Water to boost funding for its infrastructure improvements by 50% - equivalent to around £1,500 for every household in our area.\nI have long been campaigning for more investment in our sewage system, so I am glad Southern Water are continuing to take action. My work personally, along with the work of the Southern Water Regional Forum collectively which I founded, shows that if we work together we can a make a real difference\nI will continue my campaign to cut pollution and protect our harbours for future generations.\nUpdate 13 July 2023\nI welcome today’s confirmation from the Government that it is putting forward new legislation before Parliament to strengthen environmental civil sanctions by making fines on polluting water companies unlimited.\nSerious environmental crimes call for serious financial penalties. We saw this in our area with the £90 million fine imposed on Southern Water faced in 2021. However, until now, the penalties for many environmental crimes were capped at £250,000. This risked creating a situation where it was cheaper to pay the fine than to fix the problem.\nI am pleased the Government has now acted to remove the cap – meaning polluters can now face unlimited fines.\nWhat’s more, the money received from these fines will be invested back into schemes that benefit our natural environment. So, polluters will pay towards putting right the damage they’ve done.\nThis measure is part of the Government’s flagship Plan for Water. A package of reforms which will deliver £2.2 billion of accelerated investment by water companies, to spend on new infrastructure to tackle pollution and increase our water resilience – including £1.7 billion on storm overflow improvements to cut discharges by 10,000 per year.\nEnvironmental regulations need a rigorous system to enforce them, so I am pleased the Government have taken decisive action to protect our waters and ensure punishments are proportionate to the crime.\nUpdate 25 April 2023\nThe Labour Party put forward a motion for a vote today during one of their regular Opposition Day debates (debates where the Opposition can choose the subject).\nThe substantive motion put to a vote was as follows: \"That this House calls on the Government to set a target for the reduction of sewage discharges, to provide for financial penalties in relation to sewage discharges and breaches of monitoring requirements, and to carry out an impact assessment of sewage discharges.\"\nI voted in favour of the motion - and the motion was approved.\nLabour, the Liberal Democrats and the Green Party abstained (i.e. did not vote).\nThe debate also allowed the Government to re-confirm its own strategy for tackling this problem. In August 2022, the Storm Overflows Discharge Reduction Plan was launched, setting out stringent targets to protect people and the environment, backed up by up to £56 billion capital investment, which is the largest infrastructure programme in water company history. Through the Environment Act 2021, the plan’s costed and credible target to reduce storm overflows will be legally binding.\nThe Secretary of State has required all water companies to provide a plan for every storm overflow in the country by June. The Government will also introduce an enhanced and world-leading monitoring programme, requiring water companies to monitor and report, in near-real time, the impact that storm overflows and sewage treatment works have on water quality.\nUpdate 8 March 2023\nLocal MP Alan Mak MP has written to Ofwat, the water company regulator, to call for a change in regulations to ensure water company dividend policies are linked to their performance for customers and the environment.\nSouthern Water have not paid external dividends to its shareholders since 2017. However, Alan Mak has stated they should not consider doing so unless they can show measurable improvements to their environmental performance.\nCurrently water companies are only allowed to pay a dividend if doing so does not impair the company's ability to finance its activities. They must also publish information explaining how their dividend payments and policies take account of delivery for customers. Despite this, in recent reporting to Ofwat, many companies did not meet their expectations in explaining their dividend payments and/or policies.\nAlan Mak has called on Ofwat to strengthen the link between paying dividends and improved environmental performance. He believes water companies should not be paying a single penny in dividends until they have tackled pollution, cut leakage, and secured a steady supply of clean and plentiful water. The proposal is crucial to ensure better accountability on performance, and drive the outcomes that we all expect from our water company.\nAlan Mak MP said: “Local residents have been clear that they expect better from Southern Water. They must tackle and reduce discharges and improve their service to customers. This should be a precondition before they start rewarding their shareholders with dividends. I have written to Ofwat asking them to link dividend payments to environmental performance and protection.”\nThe wording of Alan's letter is as follows:\nTo: Mr David Black, Chief Executive, Ofwat\nDear David\nRe: Water company dividends\nI’m writing to support your recent consultation proposal to modify water company dividends policy to require them to be tied to company service delivery for customers and the environment.\nThe residents of the Havant Constituency and myself are clear that we expect our water company Southern Water to clean up its act, to tackle its sewage pollution and improve its service to provide clean and plentiful water. This includes making sure supplies are more resilient, cracking down on leakage and improving supply infrastructure. Linking dividends to their performance will be an important tool to ensure water companies are held to account and drive better outcomes for my constituents.\nIn the wake of the record environmental fine imposed on Southern Water in 2021, establishing a formal link between dividends and environmental protection will go a long way to assure my constituents that water companies will not profit from pollution and must continue working to reduce and then stop discharges.\nI look forward to reviewing the results of your consultation shortly.\nYours sincerely,\nAlan Mak\nUpdate 25 February 2023\nI recently chaired a meeting of local MPs, councillors and community representatives where we pushed Southern Water’s new CEO Lawrence Gosden to improve the operation of their Beachbuoy water monitoring system.\nBeachbuoy combines data from monitoring stations along the South Coast with computer modelling to create a real time picture of how discharges are affecting our harbours. This information is then made accessible online, enabling the public to understand and judge the risks posed by stormwater discharges.\nAfter raising concerns over how Beachbuoy is working Southern Water have now committed to introducing new and enhanced computer analysis, as well as improved reporting on discharges. They have also agreed to subject their new system to independent review and scrutiny from a world expert on water quality, Prof David Kay of Aberystwyth University. We’ll then have the chance to hear Prof. Kay’s verdict on the new system.\nAdditionally, Southern Water have pledged to make Beachbuoy easier to use on your mobile phone, so people can use it on the go.\nI am pleased Southern Water are taking my concerns and those of other campaigners seriously, as well as standing by their commitment to engage with local people. Any resident with thoughts or concerns about the operation of Beachbuoy should contact Southern Water to make your views known. I’ve linked to their website below:\nBeachbuoy (southernwater.co.uk)\nTracking discharges is important but - of course - our ultimate goal is to end them. It was good then to hear that Southern Water are upgrading their storm tank capacity at Budds Farm. I will continue to campaign hard on behalf of local residents.\nUpdate 18 November 2022\nI met new Southern Water CEO Lawrence Godsen, and called on him to continue Southern Water's work to reduce discharges. I met Mr Godsen at the Budds Farm wastewater treatment works in Havant where we viewed storm water tanks which will be expanded to boost local storage capacity to reduce discharges.\nOn the same day I also took part in the fourth Southern Water Regional Forum which I established. The Forum brings together local MPs, councillors and community representatives to keep up the pressure on Southern Water to reduce discharges. At the Forum I welcomed the new CEO of Southern Water and called on him to maintain the company’s work to comply with their new legal duties under the Environment Act 2021 to reduce discharges.\nMr Godsen committed to producing a plan to reduce discharges and also promised to launch a new independent review of the BeachBuoy discharge notification system. This was in response to other regional MPs and I vocalising the concerns of local residents who have said that the system is unreliable and fails to give advance warning of discharges.\nI founded the Southern Water Regional Forum to keep up the pressure on the Southern Water to cut their discharges, and chaired the Forum’s first meeting in 2021 which brought together MPs from the Solent region, local government representatives, community group representatives and representatives from Southern Water.\nSouthern Water have confirmed that they will meet the new legal duty set out in the Environment Act which was approved by Parliament last year. This makes them legally bound to produce a detailed plan for reducing discharges into Langstone and Chichester Harbours.\nThey have also confirmed that they will cut pollution incidents by 80% by 2025. Part of the work to ensure they meet this target includes the planned expansion of their stormwater tank capacity, allowing the Budds Farm plant to hold more waste water rather than releasing it into the outflow system.\nI said this to the media: “I’ve been campaigning to reduce Southern Water’s discharges for several years and I created the Forum to keep up the pressure on them. I welcome new Chief Executive Lawrence Godsen to his post and I have called on him to ensure Southern Water meet their legal obligations and develop a plan to reduce discharges.”\nUpdate 5 July 2022\nI attended the third Southern Water Regional Forum to keep up the pressure on Southern Water.\nI founded the Southern Water Regional Forum to keep up the pressure on the water company to cut their discharges, and I chaired the Forum’s inaugural meeting in November 2021. At that meeting, I secured commitments from Southern Water to cut pollution incidents by 80% by 2025, and to reduce combined sewer overflows by 80% by 2030.\nThe 3rd meeting of the Regional Forum heard representations from local MPs, Southern Water, local stakeholders and environmental groups. At the meeting, MPs discussed the Government’s Environment Act and it’s long-term impacts on the area, including more resilient ecosystems and Southern Water’s aim to be transparent with the reporting of water quality.\nAt the meeting, Mr Mak questioned Southern Water CEO Ian McAulay on the progress of ongoing works at the Budds Farm sewage processing facility in Brockhampton, where planned works will see processing capacity at the site increased by 50%. He also sought clarity on how the Beach Buoy water quality monitoring system would be deployed throughout the summer months.\nIn response, Southern Water confirmed that works were ongoing with an anticipated completion date in 2025. A more comprehensive timeline on the works will follow.\nI said this to the press: “I’ve campaigned to reduce stormwater discharges and kept up the pressure on Southern Water to follow through on this since I was elected as an MP. I am pleased that Southern Water has re-affirmed their commitment to expanding capacity at Budds Farm, which will reduce the frequency of sewage incidents and be compliant with the Government’s Environment Act.”\nAnother meeting of the Forum will be convened in the latter part of the year.\nUpdate 8 February 2022\nI welcome the Government’s announcement that the water industry regulator, OFWAT, must do more to compel water companies to curb discharges into places like Langstone and Chichester Harbours.\nOFWAT will, for the first time, require companies like Southern Water to prioritise action to protect the environment as well as significantly reduce the frequency and volume of sewage discharges from storm overflows. OFWAT will also challenge water companies to show how they will be more ambitious in protecting the environment in the future.\nEnvironment Minister Rebecca Pow made the announcement as the Government set OFWAT’s strategic priorities for the next five years. It also follows a meeting I organised where I was joined by neighbouring MPs from the Solent region. My Southern Water Regional Forum co-ordinates action from local MPs, councillors and community groups to keep up the pressure on Southern Water to reduce their discharges.\nThese new priorities for OFWAT build on the clear direction the Government has already set, such as setting up the Storm Overflows Taskforce, passing the Environment Act to put into law the obligation on water companies to produce and deliver on plans to cut sewage discharges, and taking tougher enforcement action against them, when they fall short. This includes a record £90 million fine against Southern Water.\nThe health of harbours like Langstone and Chichester are hugely important for local people, and I’ve been working hard on this issue for many years. I welcome the Government making cleaner rivers and harbours a priority and ensuring the regulator OFWAT and Southern Water focus on them too.\nUpdate 16 November 2021\nI am welcoming £18millon of investment by Southern Water into improving Storm Overflow capacity at Budds Farm that will increase capacity by 50 per cent.\nI have been campaigning for the improvements for several years in order to reduce the frequency and duration of stormwater releases in Langstone Harbour. These happen during times of heavy rainfall when the water companies release stormwater to protect homes from being flooded.\nIn Parliament, I backed the Government’s new Environment Act which places a new legal duty on water companies for the first time to reduce storm discharges.\nAs Southern Water announced the plans following the Environment Act’s passage, I visited the wastewater treatment facility in Havant to hear about the planned upgrades and meet Southern Water Chief Executive Ian McAulay.\nBudds Farm Wastewater Treatment Works serves nearly 410,000 people living in and around Havant and the wider area and treats almost 109 million litres of wastewater per day.\nThe infrastructure investment is part of a wider package of measures announced by Southern Water as it aims to meet a target of cutting pollution incidents by 80 per cent over the next four years.\nI have been campaigning for improved water quality in Langstone Harbour for several years. I created and launched the Southern Water Regional Forum to put pressure on Southern Water by bringing together MPs, community representatives, officials from the Environment Agency and local government with Southern Water’s Chief Executive to drive improvements to the Harbour.\nI therefore welcome this new investment that will make a tangible difference. There is still much more to do to ensure that stormwater releases are eliminated, and I’ll continue my campaigning to protect our harbours.\nIn its role as a sludge treatment facility (STF) Budds Farm will also be investing in expanding its capacity to store and treat sewage sludge. This is part of Southern Water’s long-term strategic plan to prepare for future population growth and start to build in future capacity. The sewage sludge treated at this site is crucial for local agriculture while this expansion will also result in build ups from smaller treatment sites becoming less likely.\nIan McAulay, Southern Water’s CEO, said: “We welcome Alan Mak MP’s visit to Budds Farm wastewater treatment works today to show him the progress we’re making to improve our wastewater treatment infrastructure. The south-east of England has a rapidly growing population, and we must ensure we can serve our customers by investing to ensure our assets are fit for future needs.\n“Along with an £18m investment in physical infrastructure we are also laser-focused on network digitization to help us monitor in real-time network interruptions.”\nUpdate 21 October 2021\nI've been campaigning to reduce Southern Water’s discharges for several years – and I continued my work this week.\nThe Government’s Environment Bill places a new legal duty on water companies to phase out discharges, and to produce a plan to do so backed up by new investment. I've been supporting the Bill in Parliament this week and will continue to do so. I expect it to become law around Christmas time.\nLocally, I came up with the idea for a Southern Water Regional Forum that brings together local MPs, councillors, community representatives, the Environment Agency, Southern Water and other stakeholders. We have to work together on a regional basis to tackle this issue.\nThis Forum keeps up the pressure on Southern Water, and it was praised for its work by the Environment Minister Rebecca Pow during the debate on the Environment Bill. You can watch the extract here: www.Facebook.com/AlanMakHavant or https://twitter.com/AlanMakMP/status/1451183140286787586\nI work especially closely with Penny Mordaunt and Gillian Keegan on this issue, and our next Forum meeting is in November.\nBy setting up the Forum and keeping up the pressure on Southern Water, we are ahead of the game when compared to other parts of the country.\nI will continue working hard on this issue and I will post updates about my work on this issue on my website: www.alanmak.org.uk/SouthernWater\nUpdate 20 October 2021\nSome residents have contacted me regarding the “abnormal situation” notice that was issued by the Environment Agency (EA) for Hayling Seafront during the period around 8-10 October 2021.\nOver the last few days I have been in contact with the EA, Southern Water, Havant Borough Council and DEFRA (the Department for the Environment, Food and Rural Affairs) to find out more, and make representations on behalf of local residents. The EA have now got back to me.\nThe EA have confirmed to me in writing that they “received an unusually high number of reports of sewage around Hayling and Southsea” last Friday and Saturday.\nThe EA added: “As a result of our investigations, both desk and field based, we believe the reports were due to natural causes (such as decaying algae) discolouring the water and causing odours and we have removed the advice against bathing in the area. We are aware of the sensitivities in many open water locations and we will continue to take informed decisions that take account of the public and environment pollution risk and any local circumstances.”\n“We therefore believe the reports of sewage are likely to have been false alarms on this occasion.”\n“Environment officers have been out on site over the weekend and found no evidence of sewage. If members of the public see any sign of pollution, please call our free incident hotline on 0800 80 70 60. We do not use social media channels to engage in discussion regarding pollution incidents…”\nI’m continuing to work hard to improve our water quality in both Chichester Harbour and Langstone Harbour. I will continue working on this issue and others at the Southern Water Regional Forum that will be held next month. I founded the Forum, and I am pleased a range of local MPs, councils and community representatives from our area, and the EA, are continuing to work together to keep up the pressure on Southern Water.\nI will post updates on my social media, and on my dedicated website page: https://www.alanmak.org.uk/SouthernWater\nUpdate 20 July 2021\nAlan has launched a new Forum alongside other MPs from Hampshire, West Sussex and the Isle of Wight to drive improvements in water quality in Langstone and Chichester Harbours and the wider Solent region.\nThese provide unique habitats for plants and wildlife, as well as being used extensively by water sports enthusiasts.\nThe MPs brought together local community representatives and officials from the Environment Agency and local government with Southern Water’s Chief Executive to discuss the water company’s plans to phase out storm water releases and improve local water quality in Langstone and Chichester Harbours and the wider Solent region. The Forum also heard from Environment Minister, Rebecca Pow, who set out the steps the Government is already taking, such as implementing a legal phase out of storm water releases, mandating improvements in the water efficiency of homes and requiring housebuilders to mitigate the effects of new developments.\nAnother live issue was the release of stormwater into Langstone and Chichester Harbours by Southern Water. During and after periods of heavy rainfall, their systems can release releases into local harbours causing concerns for the health of harbour users and the environment. MPs called on Southern Water to set out their plan to phase out releases to comply with the new legal obligations set out in the new Environment Act.\nSouthern Water’s CEO Ian McAuley said he was committed to reducing the frequency of releases, and pointed to their current work with Natural England and universities to build a new digital ‘baseline’ assessment system, expected to be up and running within a year.\nThe new baseline assessment tool will be key to accurately identifying the sources of pollution within the harbours, providing the partnership the ability to implement targeted solutions and track the impacts accordingly, to tackle the issue of pollution and protect these precious natural habitats.\nStudies are also underway to improve drainage through nature-based solutions.\nSpeaking at the Forum, Mr McAulay said: “The systems we have in place today are not the systems we need to get to where we want to be tomorrow, for the benefit of our customers and the environment. You have my full support and I really like the fact that people are talking about water quality.”\nMr Mak said: ‘I’ve been working on this issue for several years, and having proposed the creation of the Forum I’m pleased Southern Water are taking this issue seriously and working constructively to improve the health of our harbours and the wider Solent. However, the Forum’s MPs recognise there’s more work to do and we are working together to continue pressing Southern Water to improve water quality in our region”.\nThe MPs plan to follow up with another meeting of the new Forum this autumn, to track progress and press for further action.\nUpdate 9 July 2021\nAlan Mak MP has welcomed the record fine that was imposed on Southern Water for historic illegal discharges which included into Langstone Harbour.\nThe offences were discovered as part of the Environment Agency's largest ever criminal investigation. In total, the water company was fined £90million for discharges into 17 sites in Hampshire, Kent and West Sussex between 2010 and 2015.\nAlan Mak MP said: \"Southern Water deserve to be punished because their historic behaviour showed total disregard for our environment and they rightly received a record fine. The Government is passing a law to make water companies phase out discharges, and I'll continue my campaign to keep up the pressure on Southern Water to clean up their behaviour and our local waters.\"\nUpdate 8 April 2021\nSouthern Water have announced a new £5million environmental improvement fund to improve water quality at Chichester Harbour and Langstone Harbour, following Alan’s campaigning.\nThis will be spent on initiatives that deliver both nature-based solutions and environment net-gain for both harbours.\nThe full announcement can be found here: https://www.southernwater.co.uk/the-news-room/the-media-centre/2021/april/southern-water-commits-to-action-and-investment-to-improve-our-harbours\nAlan welcomed the investment, commenting: “I’ve campaigned for several years to improve water quality in Langstone and Chichester Harbours, and I look forward to continuing my work Southern Water, neighbouring MPs, community representatives and statutory agencies.\n“Southern Water will play a key role in reducing discharges and ending storm overflows, and this investment is a good first step. I look forward to their detailed plan setting out how they will meet the new legal obligations set by the Government.”\nUpdate 29 March 2021\nLocal MP Alan Mak has welcomed a Government announcement for new legislation to reduce sewage discharges from storm overflows.\nThe Havant Constituency MP has played a leading role in the national campaign to improve our coastal harbours and bathing waters. That included supporting the objectives of the Sewage (Inland Waters) Private Members Bill brought forward by Philip Dunne MP earlier this year.\nNow Alan’s campaigning work in Westminster has been successful as the Government has confirmed it will turn into law several key policies that will make our rivers and harbours cleaner. The new legislation will create three key duties to deliver some of the changes needed to improve our water environment:\n- a duty on government to publish a plan by September 2022 to reduce sewage discharges from storm overflows;\n- a duty on government to report to Parliament on progress on implementing the plan; and\n- a duty on water companies to publish data on storm overflow operation on an annual basis.\nThis builds on the work already underway by the Storm Overflows Taskforce, set up in September 2020 to bring together government, the water industry, regulators and environmental NGOs to accelerate progress in this area.\nLocally, Alan has been keeping up the pressure on Southern Water and is in the coming months launching a new regional forum. This will bring together key invited stakeholders from across our region to work with Southern Water to improve local water quality. This new forum will build on the work already achieved by Mr Mak’s Hayling Island Environment Forum.\nThe commitment by Southern Water follows the announcement of the Government’s Storm Overflows Taskforce – made up of Defra, the Environment Agency, Ofwat, Consumer Council for Water, Blueprint for Water and Water UK – which agreed to set a long-term goal of eliminating discharges from storm overflows.\nMr Mak said: “Having campaigned on this issue locally for many years, and campaigned alongside Philip Dunne MP in Parliament for a reduction in the use of storm overflows through the Sewage (Inland) Waters Bill, I am delighted that the Government is bringing forward this new legislation. These new laws will give further protection for users of Langstone Harbour and Chichester Harbour all-year round.\n“Now the Government has made this announcement, I will continue to put pressure on Southern Water to improve performance and publish their plan to end the use of storm overflows. I’m also proposing a new Regional Forum to work with them to improve our local water quality.”\nEnvironment Minister Rebecca Pow said: “Putting new commitments into law is an important step forward to cut down the water sector’s reliance on storm overflows.\n“This step is one of many – but an important one nonetheless – to provide greater protection for our water environment and the wildlife that relies on it.”\nUpdate 23 February 2021\nLocal MP Alan Mak met Southern Water CEO to press the water company on its plans to reduce discharges into Langstone and Chichester Harbours.\nAt the meeting, Southern Water has reaffirmed its commitment to meeting new Government targets to improve water quality following the meeting held with Mr Mak.\nThe Government’s Storm Overflows Taskforce – made up of Defra, the Environment Agency, Ofwat, Consumer Council for Water, Blueprint for Water and Water UK – has set a long-term goal of eliminating discharges from storm overflows. The same group has also recently been instrumental in introducing a framework for the creation of integrated Drainage and Wastewater Management Plans which are currently being developed.\nHavant Constituency MP Mr Mak has played a leading role in the national campaign to improve our coastal harbours and bathing waters. As part of those efforts, he’s launching a regional forum bring together other MPs, councils and community groups from across our region to with Southern Water to improve local water quality.\nThis new forum will build on the work already achieved by Mr Mak’s Hayling Island Environment Forum over the last two years, where Southern Water has shared the improvements it has made with its voluntary Beachbuoy spill notification system.\nDuring the meeting with Mr Mak on February 18th, Southern Water CEO Ian McAulay outlined what he described as the “holistic, cross sectoral approaches needed to enhance the health of bathing waters, rivers and water quality in harbours”.\nStormwater releases are designed to prevent homes and properties from flooding during periods of very heavy rainfall when the capacity of the system can be exceeded. However, a combination of climate change bringing significantly more periods of intense rainfall, alongside more surface water entering into combined sewer systems, has meant increasing use of these overflows, especially during the winter months. Southern Water say that The Task Force had been advised that it would take up to 25 years and around £100Bn of investment to phase out storm overflows entirely and ensure that wastewater sewage is separated from rainwater.\nOn the call with Mr Mak, Southern Water confirmed it will share the relevant key work and improvements it is making as part of its business plan. This includes reducing the amount of surface water from getting into and overloading sewer pipes, especially during times of heavy rainfall. It will also highlight the key areas where there are opportunities for more joined up approaches such as in the introduction of Drainage Management Plans.\nMr Mak said: “Having campaigned on this issue for several years, I’m keeping up the pressure on Southern Water to reduce discharges and produce a new plan explaining how they will meet the Government’s new targets. My meeting with Southern Water’s Chief Executive was encouraging and I am pleased that they have agreed to both publish a plan and also take part in a new stakeholder forum I am creating to tackle stormwater discharges into Langstone and Chichester Harbour”.\n“There is more work to be done and it remains a long-term goal to ensure that we reduce the reliance on combined sewer overflows. I look forward to seeing Southern Water’s plan to tackle this very important issue.”\nSouthern Water CEO Ian McAulay said: “We welcome the Taskforce’s overall goal to eliminate stormwater releases. This is a matter that needs to be looked at holistically, with authorities and key organisations working collaboratively to drive the change we all want.\n“It is not a problem that is going to be resolved overnight. It will need many parties working together to make the biggest amount of progress in the shortest period of time. We look forward to a clear pathway being established via the taskforce, and progressive change in legislation and governance driving ever higher standards.\n“With all that in mind, we’re delighted to be part of the regional stakeholders group being launched by Alan Mak MP, working together to help improve water quality, and ensure a resilient water future for all.”\n=============================================================================================================================================================================\nUpdate 8 February 2021\nSouthern Water’s Chief Executive Ian McAulay has responded to Alan's letter. Read the letter in full here. He’s agreed to a meeting to discuss further, and Alan plans to ask him and his team to engage with stakeholders from across our region as they set out plans to meet the new target of phasing out discharges & upgrading infrastructure.\n==========================================================================================================================================================================================\n26 January 2021\nLocal MP Alan Mak has pressured Southern Water to meet new targets set out by the Government to improve water quality and reduce stormwater discharges.\nThe Havant Constituency MP has been campaigning on the issue alongside senior backbench MP Philip Dunne, who introduced a Private Members Bill on the issue in the House of Commons. Mr Dunne, who is Chairman of the Environmental Audit Committee, praised Mr Mak for his efforts to get the Government to support the objectives of the Sewage (Inland Waters) Bill that aims to reduce the amount of stormwater discharges, including in areas such as Langstone Harbour and Chichester Harbour.\nNow a new Storm Overflows Taskforce – made up of Defra, the Environment Agency, Ofwat, Consumer Council for Water, Blueprint for Water and Water UK – has agreed to set a long-term goal to eliminate harmful discharges from storm overflows.\nStorm overflows are designed to be used during extreme weather to prevent sewers becoming overloaded with a combination of sewage and rainwater, releasing diluted wastewater rather than letting it back up into people’s homes. However, rising rainfall, leaks in pipes, insufficient rainwater storage capacity and other environmental factors has meant increasing use of these overflows, especially during the winter months.\nFollowing the announcement that a new taskforce is being created, Mr Mak is writing to Southern Water’s Chief Executive asking how they plan to eliminate storm overflows, as well as meet the recommendations that have been made. Mr Mak is meeting Southern Water’s Chief Executive next month as well Environment Minister Rebecca Pow to lobby for further investment into our local infrastructure.\nMr Mak said: “As a strong supporter of the Sewage (Inland Waters) Bill’s objectives I am delighted that the Government is taking tough action to eliminate harmful discharges from storm overflows. We have a duty to protect our natural environment, especially areas such as Langstone Harbour and Chichester Harbour, which is why I will be continuing to keep up the pressure on Southern Water to meet the targets set by the Storm Overflows Taskforce.”\nMr Mak has been engaging with Southern Water for several years on the issue, including setting-up and chairing the Hayling Island Environment Forum which brings together local stakeholders, and focuses on tackling the issue specifically in Langstone Harbour and Chichester Harbour. That has already secured several improvements including the upgrading of the Beachbouy electronic notification system to better inform Harbour users of potential pollution events as well as securing additional testing of the bathing waters at Beachlands for the 2021 summer season.\nMr Dunne added: “I know Alan Mak MP has worked on this issue for several years with energy and commitment, and I am delighted he is supporting the objectives of my Bill. Alan is one of several committed colleagues working with me to get key proposals in the Bill adopted by water companies and others to help, over time, improve water quality locally too. There are no quick, easy or cheap solutions but Alan is working hard on this issue with local stakeholders, including through the Hayling Island Environment Forum that he created, and I commend him and all those working together in this Forum for their patience, hard work and long-standing commitment.”",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_survey/content_16.html": "As your active, visible and community-focused local champion, I engage regularly with residents and attend community events throughout the year.\nI have met and corresponded with thousands of residents and I am really keen to hear about what matters to you and your family.\nI run regular surveys that help inform my work as your local champion.\nI have opened a survey in relation to each area of the Havant Constituency. Please click the relevant link below to complete a survey to share your views with me:",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_holding-page/content_24.html": "Skip to main content\nMain navigation\nHome\nAbout Alan\nResidents' Survey\nNews\nContact\nHolding Page\nTweet\nHolding Page",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_community-information-fair/content_4.html": "Supporting people and communities across the Havant Constituency remains one of my key priorities as your MP.\nEvery year I organise an annual Community Information Fair, bringing together local organisations, community groups, local & national government bodies, public service providers, sports clubs and other groups that provide activities, services or help to local people, especially to older people.\nOn Friday 4 April 2025. I held my 10th annual Havant Constituency Community Information Fair. Next year I will be organising this Fair again.\nSign up for my weekly residents' e-mail newsletter to receive information about the venue and other details when they become available: CLICK HERE TO SIGN UP\nAdmission is free, you can drop-in at any point during the Fair, and stay for as long or as little as you want.\nPlease feel free to bring family members, neighbours, colleagues and friends who are also my constituents. I am especially keen to encourage our local older people to attend the Fair, as this is a good opportunity to engage with many organisations who can offer activities, services or help locally.\nHere is some feedback from recent exhibitors:\nJulia Robinson of Hayling Island Choir said: “Thank you to Alan for inviting us to the Fair! We’ve been able to speak to lots of residents about the Choir and have had interesting people come to join us. We’re really grateful for the chance to exhibit!”\nAngharad Pike, Chair of Hayling Island Horticultural Society said: “The Fair is a great chance to engage with community stakeholders and see what’s going on around Hayling Island. We have had lots of interest today from the public. Thanks to Alan for organising the Fair”.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_campaigns_strong-economy/content_17.html": "Photo: Alan Mak meets Giles Babb, landlord of Emsworth's Blue Bell Inn pub.\nAlan Mak is leading the campaign for a strong local economy, with more local jobs, higher wages, rising living standards and growing inward investment.\nA strong economy locally and nationally is Alan's top priority and the biggest issue that local residents raise with him. Alan wants more local jobs, higher wages, rising living standards and growing inward investment. Alan and the Conservatives back hardworking people: we’ve cut income tax and frozen council tax and fuel duty. Our benefits cap stops people living off the dole.\nAlan believes that successful local businesses are at the heart of a flourishing community. He has founded the Annual Jobs, Apprenticeships and Careers Fair that seeks to help residents of the constituency match with future job opportunities. Alan regularly visits a range of local businesses, to meet owners, staff and customers, to listen to local perspectives on the economy - and continues to do so.\nAlan has sought to connect local businesses with national schemes, such as through support during the Covid-19 Pandemic and with the Government's £2 billion Kickstart employment scheme. During the Covid-19 Pandemic Alan supported government support-schemes throughout the constituency. These Conservative Government schemes allowed 12,100 people to have their job protected through the Job Retention Scheme, gave self-employed locals £13.7M worth of Government grants, paid out £31.3M in loans to local businesses as part of Bounce Back Loans, and awarded £11.5M in grants to local businesses.\nHe has also been vocal in supporting the Dunsbury Park freeport as an opportunity to bring large investment into the constituency.\nGiles Babb, landlord of Emsworth’s Blue Bell Inn pub says. “Alan’s business experience means he knows how our economy works. As a shopkeeper’s son and small business owner, he’ll speak up for hardworking people like me and help us build a successful local economy and a secure future. I’m backing Alan Mak”",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_HeroAwards/content_6.html": "Photo: Alan meeting members of his Havant Constituency Local Volunteers Network - over 400 residents signed-up to help alongside Alan\nAlan has launched his Havant Constituency Coronavirus Community Hero Awards scheme to recognise the contribution and sacrifice that many in our community have made.\nIf you know someone who has made a contribution to helping the vulnerable or those in need, please nominate them to recognise and thank them for all that they have done. It could be an individual, business, community group or voluntary body that deserves recognition.\nAlan wants to say a special thank you to everyone who has been volunteering through his Local Volunteer Network. Thanks to your commitment we have helped with shopping, picked up prescriptions, telephone befriended and completed thousands of other miscellaneous tasks for several hundred people throughout the Havant Constituency. Outside of this Network, many of you have also helped your neighbours, family and friends during this difficult time. The Coronavirus Community Hero Awards are about recognising these contributions.",
  "https_www_alanmak_org_uk_/http_www_alanmak_org_uk_stoplaboursjobstax/content_22.html": "Tweet Local MP Alan Mak has launched a petition calling on the Labour Government to scrap their £25 billion Jobs Tax. Please sign Alan's petition below. Stop Labour's Jobs Tax Current Your details Leave this field blank First name Last name Email Mobile number Postcode Address ID Address Parliamentary constituency Admin county Admin district CED Admin ward Parish I would like to be kept up-to-date by the Conservatives on future issues that matter to me: Yes There will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our Privacy Policy.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_QAHospital/content_15.html": "UPDATE: 20 MAY 2024\nI have remained engaged with the Hospital’s senior management on behalf of residents over the last year.\nI am pleased that the new building is on course to open later this year, ready for winter. Last month a “topping out” ceremony was conducted marking the completion of the overall structure of the new building. I will provide you with further details about the opening when known.\nThe new Department will feature state-of-the-art equipment and technology, as well as increased capacity to handle a greater number of patients. Some of the new features include:\n- A new resuscitation room with double the capacity of the current one, for patients needing treatment for critical conditions.\n- Two further paediatric resuscitation bays for children and increased privacy for patients with treatment in single bay rooms.\n- Faster access to radiology and diagnostic teams for scans and tests.\n- A new ambulance drop-off zone for patients, to improve the flow of patients into the ED and reduce the time patients are waiting outside in ambulances.\n- Dedicated rest areas for staff.\nI helped to launch construction of the new Emergency Department in March 2023 alongside QA’s Chief Executive, and I have maintained contact throughout the project and will continue to do so.\nA virtual video tour of the new facility is above where you can see how the design will improve care for patients.\nUPDATE: FRIDAY 20 JANUARY 2023\nLocal MP Alan Mak has joined Queen Alexandra Hospital’s Chief Executive Penny Emerit to launch construction of the hospital's new £58million Emergency Department, funded by central Government.\nThe new Emergency Department, which Mr Mak has worked alongside MP colleagues to secure funding for, will be built on the site of the former east car park. It is a major new addition to the Hospital, which serves residents from all parts of the Havant Constituency and the wider south Hampshire. The Department will feature state-of-the-art equipment and technology, as well as increased capacity to handle a greater number of patients.\nLocal MP Alan Mak said \"Having successfully campaigned in Westminster to secure £58million of Government funding for QA’s new Emergency Department, I’m delighted to help launch construction. The new facility will boost capacity and reduce the time patients spend in ED with more treatment rooms and a specially designed entrance to enable a faster turnaround of ambulances, getting them back on the road more quickly. As a result patients from the Havant Constituency and the surrounding area will receive safer and more timely care.”\nPenny Emerit, the CEO of the Portsmouth Hospitals Trust, said, “This is another major milestone in our work to improve emergency care for our community. This new facility provides a great opportunity to redesign our urgent and emergency services to further respond to the needs of our patients from across the Hampshire and South East region, including Havant. We want to ensure that we provide the best possible services for everyone we care for.”\nConstruction of the new emergency department is expected to take approximately 22 months and is set to be completed by winter 2024.\nQueen Alexandra Hospital serves the entire Havant Constituency and is committed to providing exceptional care to the community. Alan Mak MP maintains regular contact with the Hospital’s management team.\nSome of the new features of the Emergency Department include:\n- Doubling the current resus capacity from four adult bays to eight for patients needing treatment for critical conditions\n- Two further paediatric resus bays for children and increased privacy for patients with treatment in single bay rooms.\n- Faster access to radiology teams for scans and tests\n- A designated ED drop off zone with disabled car parking\n- An accredited Changing Places accessible facility\n- Dedicated rest areas for staff.\nA virtual tour of the facility is available via a fly through video to see how the design will help staff to work in a more streamlined way, continue to improve patient safety and provide the best possible care.\nUPDATE: 1 DECEMBER 2021\nLocal MP Alan Mak has visited Queen Alexandra Hospital to welcome their new Emergency Care Centre which will provide extra capacity for patients this winter. Mr Mak also visited the site of a new building under construction which will increase bed capacity and is expected to open in December 2021.\nBoth new facilities will increase the Hospital’s emergency care capacity, meaning more patients can be admitted to hospital from ambulances quickly, and then receive high quality care.\nPenny Emerit, the Chief Executive of Portsmouth Hospital Universities NHS Trust, showed Mr Mak the Emergency Care Centre, which will be holding patients whose situation is deemed urgent, but not critical. This reduces the demand for emergency care beds and frees capacity for those with critical needs.\nLocal MP Alan Mak said: “The new Emergency Care Centre is a positive new innovation which will ensure more patients are treated more quickly this winter when pressure on QA Hospital always rises. I was also pleased to see a new ward building being constructed which will add more patient beds increasing capacity at QA Hospital. I’ve campaigned for more NHS funding in Westminster, and I welcome these new facilities at our local hospital. Thanks to everyone at QA Hospital who work hard all year round, especially during winter time.”\nPenny Emerit, Chief Executive of Portsmouth Hospital Universities NHS Trust, said: “Thank you to Alan Mak MP for visiting us again. It was great to have the opportunity to look around the new Emergency Care Centre, along with our new outpatient pharmacy and ward building, which will all provide additional capacity and are key to the delivery of our winter plan. It is important that everyone receives the right care in the right place to ensure that patients are as safe as they can be.”",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_local-mp-alan-mak-welcomes-pupils-trosnant-junior-school-leigh-park-trip-parliament/content_47.html": "Local MP Alan Mak has welcomed pupils from Trosnant Junior School in Leigh Park on a trip to Parliament.\nThey were taken on a guided tour of Parliament before meeting up with Mr Mak for a question and answer session in the Education Centre.\nGroups of pupils from Trosnant Junior School visit Parliament each year and Mr Mak has also been to the school to talk to the children about life as an MP and see their work on the subject of democracy.\nHe said: “I regularly visit schools in the Havant Constituency and I was pleased to welcome Trosnant Junior School pupils to Westminster so they can see democracy in action.\n\"I think it's really important for young people to learn more about Parliament and what it does. Who knows, maybe in the future one of the pupils will be inspired to stand as a prospective Parliamentary candidate.\"",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_nominate/content_14.html": "Supporting people and communities across the Havant Constituency remains one of my key priorities as your MP.\nEvery year I organise my Havant Constituency Small Business & Community Awards to recognise local small business and individuals who go the extra mile.\nThe Awards recognise the amazing work of individuals and local organisations, and excellent local small businesses.\nIn 2024, I will be organising my 9th annual Havant Constituency Small Business & Community Awards.\nNominations are now open for the 2024 Small Business and Community Awards - complete the form below.\n- Please complete section 1 for local small businesses - they must be based in or have operations in the Havant Constituency.\n- Please complete section 2 for community groups and/or individuals - they must be based in or live in the Havant Constituency.\nSeparately, please sign up for my monthly residents' e-mail newsletter to receive information about my work locally all year round: CLICK HERE TO SIGN UP",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_About/content_7.html": "Alan was first elected on 7 May 2015 as our local MP. He was re-elected in June 2017, and re-elected again in December 2019 with the biggest ever majority and the highest vote share in the Havant Constituency's history. Alan was then re-elected in July 2024. The video above is from Alan's 2024 re-election campaign.\nIn addition to his role as our local MP, Alan is also currently serving as Shadow Secretary of State for Science, Innovation & Technology in the Shadow Cabinet.\nAlan won the Best New Conservative MP Award 2017/18 and the Conservative MP of the Year Award 2021/22 at the cross-party MP of the Year Awards hosted by the Speaker of the House of Commons in recognition of his hard work for residents all year round. Alan continues to work hard and get things done for residents all year round.\nStay in touch with Alan’s work – and share your views with Alan:\n✅ Share your views with Alan: www.AlanMak.org/Survey\n✅ Support Alan’s local campaigning: www.AlanMak.org.uk/Volunteer\nFollow Alan on social media:\n✅ Facebook: FB.com/AlanMakHavant\n✅ Instagram: @AlanMakHavant\n✅ X/Twitter: @AlanMakMP\nWorking hard and getting things done for local residents — All Year Round\nAlan's vision is for everyone across the Havant Constituency to have a secure and prosperous future. His local priorities include: a strong local economy, successful local schools and supporting our NHS.\nSince he was first elected in May 2015, Alan has been actively meeting local residents, understanding local issues, and supporting local businesses, schools and community groups in every part of our diverse constituency.\nSince 2015 Alan has launched a range of local community events and initiatives to help local residents, including organising:\n- 9 annual Jobs, Apprenticeships and Careers Fairs - helping local people find work, change career or get advice about employment;\n- 9 annual Community Information Fairs - showcasing local community groups, charities, voluntary bodies and sports clubs;\n- 9 annual Small Business & Community Awards - to support our local independent shops, small businesses and high streets; and\n- 3 annual Health & Wellbeing Fairs - to provide help and advice in relation to mental and physical health.\nLocally, Alan holds a range of unpaid, honorary ex-officio roles in the community, including with Havant Rugby Football Club (as a Vice President), Havant & Waterlooville Football Club (as Vice President); the Royal British Legion's Havant Branch (as Vice President); the Havant Borough Sports Association (as Honorary President); and the Manor Trust, Bedhampton (as Honorary Vice President).\nAlan in Westminster: Our local champion\nAlan’s main policy interests are the economy & business, including Britain's leadership of the Fourth Industrial Revolution; education & skills; and keeping Britain safe & successful in a changing world (focusing on defence & foreign policy, and Britain’s international economic competitiveness). These are all relevant across the Havant Constituency and reflect the priorities of local residents.\nAlan has spoken regularly in the Chamber of the House of Commons on issues of local importance (such as local economic regeneration) and national significance (such as UK economic policy and Britain's role in the world); and plays an active role in the legislative process (for example by scrutinising and voting on legislation).\nHe has served in a number of Government Minister and \"payroll\" positions under 4 Conservative Prime Ministers, including the following roles:\n- Parliamentary Private Secretary at the Ministry of Justice\n- Parliamentary Private Secretary at the Department for Business, Energy and Industrial Strategy\n- Parliamentary Private Secretary at the Ministry of Housing, Communities and Local Government (MHCLG);\n- Vice Chairman of the Conservative Party\n- Co-Chairman of the Conservative Party Policy Board\n- Lord Commissioner of HM Treasury\n- Exchequer Secretary to the Treasury\n- Minister at the Department for Business & Trade\n- Minister at the Cabinet Office\nHis current role is Shadow Secretary of State for Science, Innovation & Technology in the Shadow Cabinet.\nAlan has a strong interest in policy development and delivery, and his policy successes in Parliament and Westminster include:\n- Coming up with the idea for the NHS Reserves, a new Health Service reservist scheme.\n- Leading the successful campaign to ban new pagers and fax machines being used in the NHS to improve patient safety.\n- Developing the policy that become Help to Grow to help SMEs adopt technology to improve productivity.\n- Leading the successful campaign to introduce the National School Breakfast Club programme to feed hungry children across the country.\n- Identifying critical minerals as key to UK national resilience, and successfully proposing ways to improve our national resilience.\nBefore his appointment as a Government Minister, he sat on a number of important Parliamentary committees and held a variety of leading roles in Parliamentary groups. For example, the House of Commons Procedure Select Committee (which examined & backed the \"English Votes for English Laws\" policy); and the Finance Bill Committees (passing the Government's annual Budgets).\nHe is a graduate of the Armed Forces Parliamentary Scheme and completed a year's \"work experience\" with the Royal Navy. Alan is also an alumnus of a number of programmes for younger political leaders and policymakers: the US State Department's International Visitor Leadership Program (IVLP); the British-German Forum; the Franco-British Young Leaders; and the Munich Security Conference (Munich Young Leaders).\nPersonal Background\nAlan was born and grew up in York, where his parents started and ran a small family business (a small high street shop) for over 20 years. He lived above the shop, and worked in it from a young age and went on to help run it. It's where he learnt his Conservative values. Alan attended local state primary and secondary schools before securing an Assisted Place (a government scholarship introduced by Margaret Thatcher for bright students from poor backgrounds) to St. Peter’s School, York after his state secondary school was earmarked for closure. This was a life changing experience.\nAlan became the first person in his family to attend university, reading Law at Peterhouse, Cambridge University and winning the prestigious ECS Wade Prize for Administrative Law (Top of Year), before completing a post-graduate law & business diploma in Oxford, where he was a runner-up for the Oxford Leadership Prize.\nIn his spare time, Alan enjoys spending time with his family and friends; watching sports (football, rugby, tennis and hockey); films; and travelling.\nAlan is married to Cathy, and they celebrated their marriage at St. Faith's Church in Havant.\nReal Life Experience: Professional, Business & Charitable\nBefore public service, Alan had a successful business and professional career, having started & run his own small business, worked on corporate business deals in the City of London with Clifford Chance LLP, and helped manage his family's small business. He also invested in and/or advised a range of businesses, from an advertising & marketing group to technology start-ups.\nAlan has won a number of business & professional awards including from Management Today/Sky (“One to Watch” future business leader), Square Mile Magazine (Top 30 under 30) and the Guardian/Courvoisier (Future 500). He was a member of the Davos World Economic Forum’s young Global Shapers community of leaders, and a former member of business groups like the Institute of Directors and the Financial Times Non-Executive Directors’ Club. He has been awarded the Freedom of the City of London and is a Life Fellow of the Royal Society of Arts (FRSA).\nAlan was also active with community-focused charities and good causes. He served as President & Trustee of Magic Breakfast, the UK's leading school breakfast club charity which feeds thousands of hungry children (including at six schools in the Havant Constituency) and he was selected to carry the London2012 Olympic Torch. Alan founded and served as Chairman of the British Legion's Young Professionals' Branch (a network for young supporters of the Legion); served as a primary school governor for 6 years, and sat on Cambridge University's Alumni Advisory Board. He is a speaker for Speakers for Schools, a charity founded by ITV Political Editor Robert Peston that places successful business & public life leaders into state secondary schools to give careers advice and motivational talks.\nPolitical Interests\nAlan joined the Conservative Party in 2000 whilst he was a sixth form student as a grassroots rank-and-file member and campaigner in York to help William Hague’s “Save the Pound” campaign. He continued volunteering for the Party until his first election in May 2015, building a reputation for working hard, delivering results, and working collaboratively. He is a member of Party groups such as the Conservative Christian Fellowship (CCF), and a former Chairman of the Coningsby Club, an historic Conservative policy discussion group for Oxbridge Conservatives founded in 1921 whose former Chairmen include Cabinet ministers past and present such as Nigel Lawson, Michael Howard and Jeremy Hunt. Alan served on David Cameron’s Globalisation and Global Poverty Policy Group led by former Cabinet Minister Peter Lilley (and advised by Sir Bob Geldof) developing the Party's policies for international trade and aid for the 2010 election.\nAlan’s main policy interests are the economy & business including Britain's leadership of the Fourth Industrial Revolution; education & skills and social mobility; and keeping Britain safe & successful in a changing world (focusing on defence & foreign policy, and Britain’s international economic competitiveness). These are all relevant across the Havant Constituency and reflect the priorities of local residents.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_4IR/content_52.html": "Using new technology to improve our public services and the Fourth Industrial Revolution are two of Alan's main areas of interest in Parliament. Alongside publishing a number of pamphlets and articles on the subjects, Alan was the founding Chairman of the All-Party Parliamentary Group (APPG) on the Fourth Industrial Revolution (4IR).\nThis work is essential to Britain’s economic success in the post-Brexit world, and to creating the businesses and jobs of the future, that will ultimately bring prosperity to the people of Havant and the United Kingdom as a whole.\nAlan has also been exploring how new technology can improve our NHS. A major report he wrote earlier this year, published by the Centre for Policy Studies, featured ten policy recommendations that were endorsed by the Government. The report has also been backed by the Health Secretary Matt Hancock. Alan will be continuing to campaign for his key goal of a paperless NHS within the next decade.\nSome early successes have included the announcement of a new NHS App to book hospital appointments, repeat prescriptions and receive medical advice as well as a ban on the purchasing of all fax machines in the NHS.\nMore information about Alan's previous work in this area can be found through the drop-down menu on the left of this page. Following his Ministerial appointment in 2021, Alan stepped down as Chairman of the APPG 4IR, which no longer operates.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_HaylingSurvey/content_46.html": "Please CLICK HERE to complete the Hayling Island residents' survey 2024. (A new window will open)\nDon't forget to sign up for my Residents' email newsletter to receive updates about my work: www.AlanMak.org.uk/Newsletter\nI'm visible and active on Hayling Island all year round.\nListed below are some of my recent work and successes for Islanders – and I also invite you to complete a survey to share your views with me by clicking the link above!\nSome recent successes I've secured for Hayling Residents include:\n- Voting for March’s Budget which cuts tax for workers, protects the State Pension Triple Lock, freezes fuel and alcohol duty, expands Child Benefit, and invests in our NHS. Combined with January’s National Insurance tax cut, the Budget puts £900 back into the pocket of the average worker.\n- Organising my annual Community Information Fair at Hayling Community Centre, which helps local people find out about local activities and services available to them.\n- Securing £610,000 of Government money to resurface a key section of the Hayling Billy Trail, with work schedule to finish by the summer.\n- Protecting the Langstone Mill Pond and the neighbouring footpath by securing permission for protective engineering works after a 12-month campaign.\n- Boosting funding for Hampshire Police to roll-out a new Named Local Bobby Scheme, which means all Hayling Residents now have a named police officer covering their street, and access to their e-mail and mobile number so Hayling's police are more contactable than ever before.\n- Successfully securing £58million for a new Emergency Department at QA Hospital, and working with Hayling's GP surgery on future local provision.\n- Launching my Tree Planting Challenge, supported by the Woodland Trust, by planting a tree at the Station Theatre, which has encouraged others to plant more trees to improve our environment.\n- Extending the £2 single bus fare cap until the end of 2024 to make travel cheaper for Islanders.\nPhoto: Alan delivering his newsletter on Hayling Island.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_Media/content_37.html": "Alan Mak engages with range of national, regional, local and community media.\nInterview Requests\nHe is available for press, broadcast and online interviews.\nProfile Photos\nHigh resolution, print-ready photos are available for download below.\nSocial Media\nAlan's social media channels are as follows:\nTwitter: @AlanMakMP\nFacebook: www.Facebook.com/AlanMakHavant\nInstagram: www.Instagram.com/AlanMakHavant\nWebsite: www.AlanMak.org.uk\nAlan does not have TikTok or SnapChat accounts.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_annual-community-information-fair/content_51.html": "Supporting people and communities across the Havant Constituency remains one of my key priorities as your MP.\nEvery year I organise an annual Community Information Fair, bringing together local organisations, community groups, local & national government bodies, public service providers, sports clubs and other groups that provide activities, services or help to local people, especially to older people.\nOn Friday 4 April 2025. I held my 10th annual Havant Constituency Community Information Fair. Next year I will be organising this Fair again.\nSign up for my weekly residents' e-mail newsletter to receive information about the venue and other details when they become available: CLICK HERE TO SIGN UP\nAdmission is free, you can drop-in at any point during the Fair, and stay for as long or as little as you want.\nPlease feel free to bring family members, neighbours, colleagues and friends who are also my constituents. I am especially keen to encourage our local older people to attend the Fair, as this is a good opportunity to engage with many organisations who can offer activities, services or help locally.\nHere is some feedback from recent exhibitors:\nJulia Robinson of Hayling Island Choir said: “Thank you to Alan for inviting us to the Fair! We’ve been able to speak to lots of residents about the Choir and have had interesting people come to join us. We’re really grateful for the chance to exhibit!”\nAngharad Pike, Chair of Hayling Island Horticultural Society said: “The Fair is a great chance to engage with community stakeholders and see what’s going on around Hayling Island. We have had lots of interest today from the public. Thanks to Alan for organising the Fair”.",
  "https_www_alanmak_org_uk_/http_www_alanmak_org_uk_Newsletter/content_25.html": "Alan Mak is active across the Havant Constituency.\nHavant Constituency residents and others can keep up-to-date with Alan's work by signing-up for his regular e-mail newsletter.\nClick here to sign up for Alan's e-mail newsletter.\nPlease encourage your friends, family, neighbours, colleagues and others to sign-up for Alan's newsletter.\nYour e-mail address and other details will not be shared with or sold to any other organisations.\nGDPR: To view Alan's privacy notice please click here.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_JobFair/content_3.html": "Supporting local people and communities across the Havant Constituency remains my top priority as your local MP. Every year I organise an annual Jobs, Apprenticeships & Careers Fair, bringing together employers and organisations able to offer work and training opportunities with local people who are seeking employment, a change of career or career advice.\nOn Friday 19 September 2025, between 10am and 12noon, I will be organising and hosting my 10th annual Havant Constituency Jobs, Apprenticeships & Careers Fair.\nSign up for my weekly residents' e-mail newsletter to receive information about the venue and other details when they become available: CLICK HERE TO SIGN UP\nAdmission is free, you can drop-in at any point during the Fair, and stay for as long or as little as you want.\nPlease feel free to bring family members, neighbours, colleagues and friends who are also my constituents. I am especially keen to encourage our local young people and those starting out in the world of work to attend the Fair, as this is a good opportunity to engage with many employers who can offer job and apprenticeship opportunities locally.\nOur exhibitors usually include a range of local employers and national companies that have operations in the Havant Constituency. Government and statutory bodies usually attend, including Havant Job Centre Plus, Havant Borough Council and Hampshire County Council.\nSo, if you – or anyone you know – is seeking employment, considering a career change, interested in career advice, or just starting out in work seeking a first job or an apprenticeship, then please do visit my Fair.\nBelow is a short survey that Alan encourages you to complete. Resident responses are valuable for Alan's work planning the Fair.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_conservative-party-conference-2012-our-aspiration-nation-opportunity-society/content_56.html": "“I’m not here to defend privilege, I’m here to spread it”: so David Cameron confidently declared at this year’s Conservative Party Conference. The Prime Minister spoke passionately about creating an “aspiration nation”, not for the better-off but for the “want-to-be-better-off, those who strive to make a better life for themselves and their families.” This is an inspiring vision and a Conservative vision – and vision is important. Vision is the touchstone for policies that effect that real change in people’s lives.\nA number of commentators – Iain Martin and Tim Montgomerieforemost among them – have for some time been advocating this re-orientation of Conservative Party policy ahead of 2015. They have consistently argued that we should put greater emphasis on the aspirant, be they the hard working family trying to provide a better future for their children, the entrepreneur trying to start their own business or the new graduate searching for their first job. This is a question of fairness, and fairness should be enough to motivate us. But, as David Cameron also noted, it is also essential to enable Britain to compete in a globalised economy. Amidst growing global competition for talent, investment and trade from the BRICs and the Next 11 group of fast-growth economies, Cameron rightly said “don’t let anyone tell you Britain can’t make it in this world – we’re the most enterprising, buccaneering, creative, dynamic nation on earth. “ And as this year’s Conference slogan “Britain can Deliver” confidently and rightly suggests, the British people can win in a changing world, but to do so we must realise the talents and ambitions of all our people. Nobody held back, but nobody left behind either.\nSo in order to build this dynamic nation, Cameron needs to implement an agenda we have both championed for a more socially mobile society: what we call the “Opportunity Society”. Because opportunity is what we must provide. A desire to create and spread opportunity must underpin everything the Party does. This is where vision must turn into policies, and amongst the measures a second term Cameron government could implement are:\n- A Curriculum to Compete: Education is at the heart of opportunity at home, and winning the global race for success abroad. We need a Curriculum to Compete, with maths and a foreign language compulsory to 18 to ensure our children have the right tools to lead the world in science, medicine, engineering, technology and high-value manufacturing. We are delighted to see that Michael Gove has embraced similar changes with the new English Baccalaureate, and allowing Cambridge University dons to set the new maths exams is also a step in the right direction because a stronger relationship between schools and universities should be the hallmark of a future Conservative government. But it should also include Enterprise Education including financial skills. According to the financial education charity MyBnk, nearly half of 16 to 25 year olds name debt as their biggest fear and 1 in 20 teenagers believe that they do not have to pay back credit card debt. Yet financial education is still not compulsory in schools. We believe that this needs to change.\n- Excellence for all not just the few: Moreover, we need to build on the free-schools revolution by opening up access to private schools so they are not just the preserve of the moneyed elite but open to all. One option, already available in some US states, would be to allow taxpayers (individual or corporate) to claim tax credits on contributions to educational scholarships for children from lower-income families. This would create a large pool of funds, available exclusively to disadvantaged children, which their parents could access to pay school fees. A similar tax credit could also made available for personal use, allowing parents to claim tax relief on school fees and transforming the affordability of and access to private education. This would be of particular help to, for example, children with special needs who would benefit from the facilities and expertise available in the independent sector.\n- Strong families and communities: Community and the family must also play their part in any Conservative manifesto. A new Community Credit, making volunteering tax deductible for the individual, could help to create a new generation of volunteers spreading opportunity beyond the reach of the state. The 70,000 Olympic Gamesmakers who made London 2012 such a success are an inspiring example to us all of what can be achieved. Businesses and companies, large and small, must also play their part, and should be encouraged to convert meeting rooms (empty at the end of the working day) into homework clubs open to local school children, oases of quiet learning for those whose home lives are not conducive to study.\n- Bridging the Digital Divide: This crucial to levelling the educational playing field. Children with internet access achieve, on average, two grades higher than those without and 90% of UK jobs now require some level of IT competency, whilst people in online households are also 25 percent more likely to find work. We need to ensure that all children have internet access at home and at school to support and compliment their classroom learning. Digitally excluded households lose in excess of £200 a year from not shopping and paying bills online, so bridging the digital divides not only improves learning and employment outcomes, it also helps family budgets\n- Neighbourhoods and Nations: We support Dr Stephen Brien’s ideathat we should treat poor neighbourhoods like we do poor nations, with radical cuts to taxation and business regulation in these areas and real incentives for investment both internally (i.e. from the local community) and externally. This could be coupled with the introduction of micro-finance initiatives to help kick-start local business ventures and give more people a real stake in their community. TheConservative Kiva Group, which has already helped poor communities overseas, are well places to share their expertise when tackling poverty with wealth creation at home.\nThe idea of an Opportunity Society is popular with the British public too because inter-generational fairness and social mobility resonates with voters. It goes to the heart of what most people want from life and it wins elections amongst a key group of voters: the aspirational, striving workers on middle and modest incomes. According to Ipsos-MORI, at the 2010 general election, Conservatives secured 39% of the C1 (lower middle class) against 28% for Labour, and 37% of the C2 (skilled workers) vote to Labour’s 29%. Multi-election winners Margaret Thatcher (and Tony Blair) scored highly amongst C1s and C2s, usually breaking the 40% barrier. So, come 2015, the task for the Conservatives will be once again to act as the voice of strivers. The early polling is already promising: last week the Spectator’s James Forsyth reported that CCHQ’s survey of 2,000 voters showed support for the aspiration agenda, and that it appealed across the board: “not just to Basildon white van man but also to women worried about their children’s future“. Many Conservatives are now starting to take action too. Last week, 63 Conservative MPs from across the Party launchedBlue Collar Conservatives, a new initiative to attract the strivers that have traditionally formed the mainstay of our election victories.\nThese policy ideas are not a panacea. This is very much the start of a journey in policy making as we head towards the next election inspired by the simple, Conservative belief in equal opportunity for all. Everyone must do their fair share for their community – but everyone must get a fair shot in life too. We are delighted that the Party leadership has embraced our agenda for an Opportunity Society. Now it needs policies, as well as the language to communicate them to the electorate. This should be at the heart of the Conservative’s bid for re-election; we cannot afford for it for it not to be, as we build a stronger society at home, and compete abroad. Only by building an Opportunity Society can we turn the vision of an Aspiration Nation into a vote-winning reality.\nThis article was first published on Platform10 on 5 November 2012.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_category_Speeches-in-Parliament/content_29.html": "Havant MP Alan Mak backs local economy in 2015 Summer Budget debate 13th July 2015 Havant MP Alan Mak has backed Havant’s local economy and championed the constituency as a destination for businesses to relocate to during an important debate... Speeches in Parliament\nHavant MP Alan Mak praises Britain’s Armed Forces in House of Commons Defence & Security Debate 2nd July 2015 Havant MP Alan Mak praises Britain’s Armed Forces during an important debate in the House of Commons on Defence & Security issues on Thursday 2 July 2015. Speeches in Parliament",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_healthfair/content_36.html": "Supporting people and communities across the Havant Constituency remains one of my key priorities as your MP.\nFollowing the COVID-19 Pandemic, I held my first ever Havant Constituency Health and Wellbeing Fair at the Emsworth Baptist Church in 2022. The Fair was a great success, with attendees and exhibitors letting me know that they had found the opportunity to share important health information and advice with local residents very useful.\nOn Friday 20 June 2025, between 10am and 12noon, I will be organising and hosting my 4th annual Havant Constituency Health & Wellbeing Fair.\nSign up for my weekly residents' e-mail newsletter to receive information about the venue and other details when they become available: CLICK HERE TO SIGN UP\nThe Fair helps local residents find information and advice about physical and mental health, and exhibitors usually include The Emsworth and Hayling Island Primary Care Network (PCN), the Emsworth Medical Practice, and local and national providers of health and wellbeing services.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_GettingThingsDone/content_23.html": "I’m a local community champion who works hard and gets things done for residents - all year round, not just at election time.\nBelow you’ll find a summary of my key successes locally during my time as your local MP. Click here for my successes nationally and in Westminster (opens a separate web page).\n1. Supporting local residents all year round – helping with personal queries and problems\nDuring my time as your local MP, I have helped many thousands of local residents across the Havant Constituency resolve queries, overcome issues and find support & advice.\nI typically receive up to 250 e-mails, letters and other correspondence per weekday, and I work hard to help as much as I can.\nSince 2015, I have answered more than 27,000 queries about a range of issues. My work includes:\n- Campaigning on key local and national issues that matter to local people.\n- Making representations on behalf of residents to central Government departments.\n- Taking matters up with Government Ministers on behalf of residents.\n- Connecting constituents to local decision-makers such as Havant Borough Council or Hampshire County Council.\n- Referring residents to other appropriate sources of advice or organisations which can offer specialist support.\nMy aim is to help residents get results when they have had problems, and ensure the needs of people across the Havant Constituency are supported as much as possible.\n2. Supporting our local NHS – upgrading GP surgeries and QA Hospital\nI played a leading role in delivering a new GP Surgery building for residents in Emsworth and surrounding area after leading a successful 6-year campaign. My work included:\n- Organising and chairing meetings in Emsworth to drive the project forward\n- Securing £3.5M of NHS funding to pay for the new building\n- Stopping the sale of the Emsworth Victoria Cottage Hospital site in 2018 after NHS Property Services put the site up for sale\nThis enabled construction of a brilliant new facility offering access to all the primary care needs of the community under one roof.\nI have also founded the new Hayling Island Health Forum which brings together the two surgeries on the Island, NHS bodies, and our local councils to work more closely together and improve local health outcomes.\nQueen Alexandra Hospital serves everyone in the Havant Constituency, and I have consistently supported the Hospital to secure more funding and expand its patient services. See below for information about my work on the new Queen Alexandra Hospital Emergency Department.\n3. Supporting our young people – at school and during the holidays\nChildren who have had a good breakfast are better set up for a day of learning at school. I served as President and Trustee of Magic Breakfast, an award-winning national charity helping bring healthy and nutritious breakfasts to children.\nI brokered a £30,000 grant from the FatFace Foundation to enable Magic Breakfast to work with Havant Academy to set up a breakfast club. The club is open to all children at the school and is popular with pupils who get not only a breakfast but a chance to meet friends and go into the school day prepared and focussed. Around 100 pupils use the breakfast club each day.\nI also helped to secure over £430,000 of Government funding for holiday clubs for children across the Havant Constituency. The clubs offer enriching activities including arts & crafts, sports, reading, and cooking. The holiday clubs also promote a healthy lifestyle and offer children a nutritious meal during the day, and operate at local schools across the Havant Constituency.\n4. Supporting the Police – more funding and more officers\nSupporting the Police to keep our streets and communities safe is a top priority for me, and I secured more funding for Hampshire Constabulary to recruit and deploy more officers across the Havant Constituency.\nOver 725 new officers have been recruited by Hampshire Constabulary since 2020 thanks to increased funding from central Government and the Police and Crime Commissioner.\nI have worked with Police commanders to ensure those new recruits help bolster community policing across the Havant Constituency. Every street will now have a named officer covering the beat, with their name and contact details available to residents.\nGetting the Police working together with our communities makes policing more effective and keeps our streets safer. I have joined the Police on patrol around the Havant Constituency and I know how hard they work, and what a difficult job it can be at times.\n5. More funding for local schools – so our children get the best start in life\nI have served as a governor of a primary school, and I am passionate about giving children the best possible start in life so supporting our local schools is a top priority for me.\nThanks to my lobbying of central Government, our local schools have consistently received above-average funding per pupil in recent years. Every school in the Havant Constituency is receiving an additional cash funding uplift between 2023 and 2025. A typical primary school is receiving an additional £35,000 and a typical secondary school is receiving an additional £200,000.\nAdditionally, the Pupil Premium has increased by 5% in 2023/24, supporting disadvantaged pupils in every school in the Havant Constituency. This is in addition to the funding uplift which will help pupils with special educational needs or disabilities as well as those in mainstream schooling. Schools are free to decide for themselves how best to spend the additional funding, helping teachers give all our children the high-quality education they deserve.\nThroughout my time as your MP, I have campaigned for more funding for schools and worked with employers and colleges such as Havant and South Downs College to ensure young people have an opportunity to start a fulfilling and rewarding career.\n6. Helping secure £58million for a new Emergency Department at Queen Alexandra Hospital\nQueen Alexandra Hospital serves residents in every part of the Havant Constituency as well as wider south Hampshire. It is home to many specialist units as well as the main Emergency Department (ED) for the region and the Hospital is receiving millions of pounds of new investment from the Government.\nI was pleased that my campaign for new funding to allow the replacement of the previous outdated Emergency Department was successful, and thanks to £58m from the Government work is now underway building on a brand-new facility. Patients from the Havant Constituency will benefit from better care delivered more rapidly in the new Emergency Department.\nThe new ED building will relieve pressure across the Hospital. Although much of QA was rebuilt in recent decades, the Emergency Department remained in an outdated and cramped part of the hospital dating back to the 1970s. As a result, patients often faced delays or had to be moved into other units to receive treatment.\nThe new Emergency Department will transform care at Queen Alexandra Hospital and I will continue to work closely with Portsmouth Hospitals University NHS Trust to ensure residents across the Havant Constituency benefit from investment in QA by the Government.\n7. Launching my Tree Planting Challenge – improving our local environment\nI am leading a campaign to plant 1000 new trees in the Havant Constituency, inspired by the Queen’s Green Canopy project launched by Her Late Majesty Queen Elizabeth.\nPlanting more trees boosts our local environment, improves air quality, supports wildlife, and makes our surroundings more attractive.\nI have won backing from the Woodland Trust who are supplying saplings free of charge which community groups and schools can plant. They can also supply saplings to individual members of the public for a small charge.\nI was delighted to launch the Challenge on Hayling Island, planting a willow near the Station Theatre with Sir Nicholas Bacon, the Chairman of the Queen’s Green Canopy project. I welcome the large-scale Government-backed reforestation across Britain over the last 75 years. More of the country now has tree cover than at any point since the 14th century.\nThe Havant Constituency is a green and pleasant place to live, whichever community you are a part of, but we can all make it better. I am pleased to be leading this project and the trees we plant now will enhance the lives of people for generations to come.\nSince launching my Tree Planting Challenge, over 150 new trees have been planted!\n8. Securing funding for Hayling Billy Trail resurfacing\nI secured £610,000 from central Government to resurface a key section of the Hayling Billy Trail which links West Town on Hayling with Havant. As well as being a beautiful trail for recreation, with Langstone Harbour on one side and farmland the other, it is also an important route for cyclists and walkers.\nIn winter, the Trail has been subject to flooding and deep mud but resurfacing to end this is under way. The improved section will be open by summer 2024, weather permitting. The upkeep of the Trail is the responsibility of Havant Borough Council and Hampshire County Council, and I lobbied Ministers on their behalf to unlock this funding from the Department for Transport.\nPromoting sustainable transport is a priority for me as we have so many good cycle routes around the Havant Constituency, for work or pleasure. This investment in the Hayling Billy Trail will encourage people to be more active and help them enjoy the beautiful environment on and around Hayling Island.\n9. Organising 8 annual Jobs, Apprenticeships & Careers Fairs\nEvery year I organise my Jobs, Apprenticeships & Careers Fair to bring together employers, training providers, and other organisations who can help local people looking to move their careers forward.\nMy Fair helps people find new jobs, new careers, and is a source of advice for people from across the Havant Constituency about the world of work.\nAdmission is free and open to all, but I am especially keen to encourage our local young people to attend as it is a fantastic opportunity to engage with many employers who can offer training, advice, apprenticeships and job opportunities.\nMore than 600 young people from the Havant Constituency have started an apprenticeship in the last year. We have many employers in high-skill, high-wage sectors offering young people a career in our area, ensuring the strong economic growth we have seen will continue for years to come.\nPlease sign up for my newsletter for more information about this year’s Fair by clicking here.\n10. Organising 8 annual Community Information Fairs\nEvery year I organise my Community Information Fair to bring together a wide range of organisations who can offer help, support or opportunities to people across the Havant Constituency. These include local community groups, local and national Government bodies, sports clubs, charities, and voluntary groups.\nA key priority for me as your Member of Parliament is ensuring people can access the support they need to live a full and rewarding life. People could be looking for help with a specific health condition, or just looking for a new activity which helps them remain active and make new friends. This is particularly important for older people in our communities but exhibitors at my Fair have something to offer people of all ages and backgrounds.\nPlease sign up for my newsletter for more information about this year’s Fair by clicking here.\n11. Organising 8 annual Small Business & Community Awards\nThere are many great small businesses in the Havant Constituency, and every year I organise my Small Business and Community Awards to celebrate and showcase the work they are doing.\nI recently expanded the original Awards to include a Community component, so residents can nominate individuals or groups doing voluntary or charitable work in our communities to celebrate their work and to thank them for their service.\nSmall businesses are the foundation of our local economy and I helped develop the Government’s Help to Grow policy to assist small and medium enterprises (SMEs) boost their productivity by making better use of technology and best practice knowledge.\nPlease submit your nominations for this year’s Awards by clicking here.\n12. Organising 2 annual Health and Wellbeing Fairs\nSupporting people and communities across the Havant Constituency remains one of my key priorities as your MP and I look forward to hosting my third Havant Constituency Health and Wellbeing Fair in 2024.\nMy Fair helps residents find information and advice about physical and mental health, and exhibitors usually include the Emsworth and Hayling Island Primary Care Network (PCN), the Emsworth Medical Practice, and local and national providers of health and wellbeing services.\nFollowing the COVID-19 Pandemic, I held my first ever Havant Constituency Health and Wellbeing Fair at the Emsworth Baptist Church in 2022. The Fair was a great success, with attendees and exhibitors letting me know that they had found the opportunity to share important health information and advice with residents very useful. I organised the Fair again in 2023, and I will organise my third Fair in 2024.\nPlease sign up for my newsletter for more information about this year’s Fair by clicking here.\n13. Supporting our Armed Forces\nI am an active supporter of our Armed Forces, reservists, veterans and military families. The Havant Constituency has close connections to our Armed Forces, and many serving personnel and their families are at the heart of our communities.\nEvery year I mark Armed Forces Day, a national campaign to thank the men and women who make up our Armed Forces community. As a longstanding Royal British Legion volunteer, I sell Poppies every year at Havant’s Meridian Centre and at Lidl supermarket on Hayling Island. To mark the 75th Anniversary of D-Day I led a delegation of local veterans to Normandy’s beaches where I laid a wreath.\nHaving spent time with the Royal Navy, including on a NATO exercise in Norway, I’ve seen first-hand the courage and commitment of our Armed Forces and veterans, which we must repay by looking after them.\nCaring for our veterans remains a top priority for me and the Conservatives. In Parliament I’ve supported action to provide financial, health and other support for our veterans including:\n- Launching the Veterans’ ID card making it easier for veterans to apply for support.\n- Introducing the Veterans’ Railcard providing discounted train travel for veterans.\n- Adding a question on the census to identify veterans for the first time ever.\n- Creating a new Office for Veterans’ Affairs to co-ordinate support for veterans.\n- Backing the Armed Forces Covenant which ensures councils, the NHS, schools and businesses provide support to veterans and cannot discriminate against them.\nLocally, I’ve backed our defence industry which supports hundreds of jobs for local people, working closely with major employers like Lockheed Martin and Wartsila. Both Havant-based firms played a key role in delivering Britain’s aircraft carriers and the planes which fly from them. I joined Royal Navy personnel from our area on board HMS QUEEN ELIZABETH to thank them for their service.\nNationally, the Conservatives are the only party committed to properly funding our Armed Forces, with a commitment to spend 2.5% of our national income on defence. I’m proud that we are leading other NATO member countries on this essential commitment.\nI will continue to support our Armed Forces and back the UK’s role in the NATO military alliance which protects us all.\n14. Helping Havant and Waterlooville FC during the Covid pandemic\nAs a Hawks supporter and Vice President at Havant & Waterlooville FC, I know the impact the Covid pandemic had on clubs and sporting groups across the Havant Constituency. I wrote to the National League and the Department for Culture, Media and Sport to urge them to ensure fair play for the Hawks and other teams disrupted by Covid restrictions, especially during the play-off stages.\nSince the pandemic, the Hawks have continued to strengthen their offering with a new community hub at Westleigh Park which I was pleased to open in 2021. Sports clubs promote a sense of community and belonging as well as giving opportunities to people to develop their talents and be part of a team.\nThe Havant Constituency is home to many thriving sports clubs and promoting sport, whether it is competitive or recreational, is something I support keenly in my work. I am also a Vice President of Havant Rugby Club and Honorary President of the Havant Borough Sports Awards, and I keep in close touch with teams in a wide range of sports in our communities.\n15. Preventing closure of ticket offices at Havant and Emsworth railway stations\nI led the campaign to convince the rail companies to change their decision to close the ticket offices Havant and Emsworth railway stations.\nHaving staff available at railway stations is important for making transport more accessible, especially for older and more vulnerable people. Railways must be cost-effective, but it is not always easy to use ticket machines or book tickets online, especially for complex or urgent journeys. Having someone on-hand at a ticket office who is familiar with the network and the ticketing system is important for many travellers.\nI am pleased the rail companies have changed their plans and I hope residents across the Havant Constituency will feel more confident that taking the train is a convenient and safe way to travel.\n16. Protecting our environment from wastewater discharges\nProtecting and enhancing our environment is a key objective for me as your MP. I have taken the lead on this by creating and chairing a regional forum to hold Southern Water to account and to ensure the concerns of people in the Havant Constituency are addressed. The Forum brings together local MPs, councillors, and community representatives and it meets regularly.\nSouthern Water has a major treatment facility at Budd’s Farm in central Havant and it handles wastewater from across the Havant Constituency and the wider area, including Portsmouth. It is vital that Southern Water reduces the number of discharges of untreated stormwater it makes across its network, and in timer, eliminates them in normal conditions.\nSouthern Water have responded to my calls to do more with an additional £1.7 billion of work being brought forward to reduce discharges across the south-east, including expanding storage tanks at Budd’s Farm.\nMore widely, I have worked with regulatory bodies including the Environment Agency, Ministers, local and national environmental groups, and councillors to ensure our surroundings are protected and improved.\nI voted for the two new laws the Government has introduced in this Parliament: the Environment Act and the Agriculture Act. The legislation creates a new watchdog, the Office for Environmental Protection, and creates new powers for regulating water companies or other industries which have a role to play in protecting the environment. I also support the Government’s ban on bonuses for the bosses of water companies which commit serious breaches of environmental law.\n17. Supporting bus services and the £2 single bus fare cap\nPublic transport provides vital links for residents across the Havant Constituency, and I have successfully lobbied central Government to invest in support for bus services for our communities.\nThe Government has agreed to extend the £2 discounted fare until the end of 2024, helping thousands of people get out and about.\nHampshire County Council is receiving a further £3.5 million from the Government’s Bus Services Improvement Plan Plus in 2024-25. This follows the first wave of Bus Service Improvement Plan funding of £228 million for the south-east to cover the period 2022-25.\nSupporting bus services is vital for people of all ages across the Havant Constituency for work and leisure. For older people especially, good bus services are a way of keeping in touch with friends and family and accessing public services.\nI have engaged with bus companies in the Havant Constituency as well as Hampshire County Council, which is responsible for transport strategy, to ensure they are making the best use of the increased funding from the Government. The Stagecoach 23 bus service in Leigh Park and Havant is now running a 24-hour service with support from the Bus Services Improvement Plan.\nThe Government has also invested in the Havant-Bedhampton-Portsmouth-Southsea bus corridor along which key services travel. I secured £335,000 of Government funding for improvements at Bedhampton to improve the road layout and the bus stop.\n18. Supporting Stop Domestic Abuse charity (formerly Southern Domestic Abuse Service)\nSupporting vulnerable people in the Havant Constituency is a priority for me. Victims of domestic abuse in particular face challenges and their situation is often not recognised easily by family or friends. For that reason, I have supported the Havant-based Stop Domestic Abuse charity (formerly called Southern Domestic Abuse Service) throughout my time as your local MP.\nI was pleased that Stop Domestic Abuse has been awarded £75,000 this year from the Government’s Community Organisations Cost of Living Fund (CCLF) to provide support for victims of domestic abuse in Havant and South Hampshire. This is part of a £101.5 million package of support with running costs for charities and community organisations across England which are delivering front-line services.\nI have lobbied Ministers for more funding for groups like Stop Domestic Abuse and I support the annual White Ribbon Day, to mark the International Day for the Elimination of Violence Against Women. Helping local community groups and charitable organisations is a key part of my work as your Member of Parliament and I support the work Stop Domestic Abuse are doing to help victims of domestic abuse across the Havant Constituency.\n19. Protecting our communities from flooding\nThe Havant Constituency includes several coastal communities which depend on sea defences to protect them from storm flooding and rising sea levels. Through my engagement with Ministers, I have secured investment from the Government to support projects in the Havant Constituency which will protect homes and businesses against floods.\nI secured more than £4 million of funding for Havant Borough Council for work to improve sea defences at Broadmarsh and to support the South Hayling Beach Management Project, delivering improved drainage and sea defences at Eastoke and a coastal flood and erosion risk management strategy.\nAt Langstone I have worked with Havant Borough Council, Hampshire County Council, Chichester Harbour Conservancy and Coastal Partners, plus Natural England and the Environment Agency to agree a plan for the next 25 years to protect the Mill Pond and to ensure the coastal path can remain open.\nI look forward to working with the community and local and national bodies responsible for flood defence provision on other schemes which respond to future threats from flooding.\n20. Securing more funds for road safety and maintenance\nSafer roads for all who use them – motorists, cyclists, pedestrians – are a priority for me. I was pleased to secure £2.1m from the Government for a programme of works in Havant to improve links for cyclists and pedestrians between the railway station, town centre, Havant College and the Hayling Billy Trail.\nMany other roads in the Havant Constituency will receive help from the additional funding I have secured from the Department for Transport for Hampshire County Council (HCC). HCC is responsible for road maintenance in the Havant Constituency, and it is receiving an additional £8.45 million across 2023-25 for road resurfacing and pothole repair. Over the next ten years HCC will receive at least a further £13 million every year to support additional maintenance work on our local roads.\n21. Securing a key role for Havant in the new Solent Freeport\nThe Havant Constituency has a key role in the new Solent Freeport. I campaigned for the Government to approve the new Freeport as part of our post-Brexit global trading strategy. I secured £25m of seedcorn funding to begin work on the Freeport and Dunsbury Park in the Havant Constituency and it is a vital part of the overall project.\nDunsbury Park is a new 100-acre business park offering state-of-the-art facilities which has already attracted major employers like Volkswagen, BioPure and DPD. Dunsbury Park will be attractive to businesses wanting to take advantage of the Freeport and the highly skilled workforce we have in the Havant Constituency.\nThe Solent Freeport is another boost to our strong local economy, creating 30,000 jobs in the region and generating an additional £3.5 billion of gross value added (GVA) in our national economy. Freeports are an important part of our future trade with the rest of the world, driving innovation and making it easier for British companies to export to new markets.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_local-mp-alan-mak-joins-emsworth-bowling-club-celebrate-coronation-king-charles-iii/content_53.html": "Local MP Alan Mak has visited the Emsworth Bowling Club in the Havant Constituency for a special afternoon of bowling and a Coronation-themed party. The Club had organised the event to celebrate the Coronation of His Majesty King Charles III. Alan presented the Club Chairman Sue Wood with a Union Flag.\n\"I was delighted to join members of the Emsworth Bowling Club to celebrate the Coronation of King Charles III,\" said Mr Mak. \"It was a great opportunity to spend time with local residents and enjoy a fun-filled afternoon of festivities.\"\nThe event was well attended with members of the club enjoying a friendly game of bowls followed by a Coronation-themed party with tea and cake. Alan addressed the members on the significance of this the first Coronation in 70 years, and led a toast to His Majesty with \"God Save the King!\"\n\"Mr Mak's visit was fantastic for our Club,\" said Club President Sue Wood. \"We were thrilled to have him join us for our Coronation party and present us with a Union Flag. It was a wonderful occasion for all of our members.\"",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_about-rss/content_26.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_local-mp-alan-mak-celebrates-coronation-king-charles-iii-pupils-purbrook-junior-school/content_18.html": "Local MP Alan Mak has visited Purbrook Junior School to celebrate the Coronation of His Majesty King Charles III. Alan met school children, joined them for lunch, and took part in a special activity where he made a 'Coronation Cookie' with the children.\nDuring the visit, Mr Mak had the opportunity to speak with students and staff about the importance of the historic event and how it is celebrated across the country. He also presented children on the School Improvement Committee with a Union flag to mark the occasion.\n\"I was delighted to visit Purbrook Junior School and celebrate the Coronation of King Charles III with the pupils,\" said Mr Mak. \"It was a great opportunity to talk to them about the significance of this historic event and share in their excitement.\"\nMak's visit was warmly received by the school community, who were pleased to have the MP take part in their festivities. The school's headteacher, Mr Craig Williams, said, \"We were delighted to welcome Alan Mak to Purbrook Junior School and grateful for his support in celebrating this important occasion of national significance with our pupils.\"",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_Falklands/content_48.html": "UPDATE 5 JULY 2022\nLocal MP Alan Mak has led a parade and wreath laying service in central Havant to mark the 40th anniversary of the Liberation of the Falkland Islands.\nThe Havant MP came up with the idea of a parade following a meeting in Westminster, and he was joined by approximately 200 marchers, including local councillors, cadets, uniformed services and veterans from the South Atlantic Medal Association. The marchers were led by the Rose and Thistle pipes and drums.\nThe parade departed from the Ex-servicemen’s Club on Brockhampton Lane and concluded at the war memorial on West Street. Following the parade there was a short remembrance service led by the Reverend Canon Tim Schofield. There, Mr Mak was joined by Roger Spink, Member of the Legislative Assembly of the Falkland Islands.\nA longer service then took place in St. Faiths Church in central Havant.\nLocal MP Alan Mak said: “Having visited the Falklands to pay tribute to British servicemen and women involved in the Liberation, I welcomed the opportunity to honour their service and sacrifice in our parade and wreath laying.”\nRoger Spink, Legislative Assembly Member for Stanley, said \"I would like to thank Alan Mak MP for initiating a parade and wreath laying to mark the 40th anniversary of the liberation of the Falkland Islands, and for inviting me to attend. Falkland Islanders would not enjoy the freedom they have, today, were it not for those who fought so bravely to liberate the Islands in 1982. It was therefore an honour to be in Havant and to pay my respects to those who helped liberate the Islands 40 years ago.\"\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nThis year marks the 40th Anniversary of the Liberation of the Falkland Islands by British Forces. To recognise the service and sacrifice of our servicemen and women, I am organising a Parade through central Havant on Sunday 19 June 2022 from 3PM. Further details are below.\nParade and Wreath Laying - Background\nTo mark the 40th anniversary of the Liberation of the Falkland Islands, I want to pay tribute to the service and sacrifice of Havant Constituency residents who were involved in the conflict.\nThat’s why I’m organising a Parade through central Havant followed by a wreath laying. The Parade will include members of the South Atlantic Medal Association, local veterans of the Falklands Liberation, the Royal British Legion, and local community and military organisations. I have also secured the attendance of a Member of the Falkland Islands Legislative Assembly, their Parliament.\nParade Route\n- The Parade will begin at 3PM on Sunday 19 June 2022 and depart from the Ex-Servicemen’s Club on Brockhampton Lane in Havant.\n- The Parade will travel along West Street, Park Road South, Elm Lane and North Street before stopping at the War Memorial outside St. Faith’s Church at around 3.15PM. This is the same route that the Remembrance Sunday Parade takes each November.\n- There will be a Wreath Laying at the War Memorial led by me and the Mayor of Havant. Thanks to Havant Borough Council for their support.\nHaving visited the Falklands myself, I know Islanders are grateful for the support they received from the Havant Constituency in 1982 and ever since.\nLet me know you're coming\nPlease join me on the Parade route to show our continued support. Residents can position themselves at any part of the Parade route (see above for details).\nRegistration is not needed, but it helps with planning if you are able to let me know that you’re coming by completing this form: www.AlanMak.org.uk/Contact\nFree Union Flag or St. George's Flag\nI’m offering Havant Constituency residents either a free Union Flag or free St George’s Flag as part of my on-going Fly the Flag campaign.\nApply for a free flag online: www.AlanMak.org.uk/Flag\nPlease allow at least 15 working days for delivery.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_local-mp-alan-mak-vows-stand-514-businesses-havant-constituency-hit-labours-jobs-tax/content_42.html": "Local MP Alan Mak has vowed to stand by 514 businesses in the Havant Constituency that are being hit by Labour's Jobs Tax.\nThe National Insurance Jobs Tax, which came into force on April 6, will increase the rate of employers' National Insurance Contributions by 1.2 percentage points and reduce the threshold, so businesses start paying the tax sooner.\nBased on average weekly earnings, businesses that employ six people or more will pay more National Insurance following the increase.\nThis amounts to a £25 billion tax raid on businesses nationally, affecting 514 in the Havant Constituency and 76,225 in the South East.\nThe Conservatives have campaigned tirelessly against the imposition of this tax and attempted to work with the government to make smaller businesses exempt – but Labour Members of Parliament refused to back down from their tax raid.\nThe Government’s independent forecaster, the Office for Budget Responsibility (OBR), confirms this Jobs Tax will hit working people through lower wages.\nUsing their figures, it can be calculated that families will be £3,536 worse off over the life of this Parliament because the Jobs Tax will result in lower wages as it squeezes businesses’ profits.\nThe OBR also confirm the Jobs Tax increases the cost of employing someone by £800 and an average business will see their tax liability increase by £26,000.\nThis is on top of the £5bn a year cost of imposing Labour’s Employment Rights Bill.\nThe National Insurance Jobs Tax hits businesses at a time of great uncertainty in the face of tariffs and other bill rises, such as energy bills and business rates, which is why the Conservatives campaigned against it.\nMr Mak said: \"Labour’s National Insurance Jobs Tax is more than just a broken promise, it is a sledgehammer to jobs and wages in the Havant Constituency.\n\"Only the Conservatives will stand by the 514 businesses in the Havant Constituency who will face the brunt of this tax.\n\"Labour have no business experience so they do not understand it is businesses – not the government – who create jobs and wealth across the country. This tax does the opposite.\"",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_KeepWinterFuel/content_2.html": "Local MP Alan Mak launched a petition calling on the Labour Government to drop their plan to remove the Winter Fuel Payment from up to 20,000 local pensioners. Please sign Alan's petition below.\nPensioners in the Havant Constituency will lose between £200 and £300 annually to help with their heating bills during the winter, if Labour MPs back the plan.\nAlan will vote against the Labour Government's plan at every opportunity in Parliament, and is asking local residents to support his campaign if they agree that local pensioners should not be punished by having their Winter Fuel Payment taken away.\nAlan said, ““The Labour Government is wrong to scrap the Winter Fuel Payment for around 20,000 local pensioners and 10 million pensioners across the country. Please sign my petition to show your support for our local pensioners, and send a clear message to the Labour Government that they must drop their policy.\"\nUpdates:\n7 September 2024: Alan will vote against the Labour Government's plan to remove the Winter Fuel Payment from up to 20,000 local pensioners",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_category_Articles/content_33.html": "MP encourages residents to have their say over new Local Plan 2nd August 2016 Local MP Alan Mak has urged residents to respond to the public consultation on the new Havant Borough Council (HBC) Local Plan Articles\nHavant MP Alan Mak gives Maiden Speech in House of Commons 9th June 2015 Havant MP Alan Mak has given his Maiden Speech in the House of Commons.In a well-received first speech, Alan praised his predecessor David Willetts, and... Articles\nConservative Party Conference 2012: Our Aspiration Nation: An Opportunity Society 5th November 2012 At Conservative Party Conference 2012, t he Prime Minister spoke passionately about creating an “aspiration nation”, not for the better-off but for the “ want... Articles\nBuilding the Opportunity Society 8th January 2012 Whilst restoring Britain’s public finances and securing economic growth is the Coalition’s most pressing short-term priority, building the Opportunity Society... Articles",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_alan-mak-wins-prestigious-mp-year-awards/content_45.html": "Havant MP Alan Mak has been praised by the Prime Minister for his community work after being named as the Conservative Newcomer of the year at a prestigious MP Awards evening.\nThe award was presented yesterday (15 November) by the Speaker, John Bercow, at the MP of the Year Awards, organised by the Patchwork Foundation. It recognises MPs who have worked hard for their communities, especially underrepresented communities.\nIn particular, Alan was singled out for praise by the judges for organising a number of well-attended community events throughout the year, including his Jobs, Apprenticeships and Careers Fair, Older Persons Information Fair and Universities & Oxbridge Conference.\nAlan Mak MP said: “I’m honoured to win a New MP of the Year. While I’m not involved in politics to win prizes, I’m delighted to have been chosen for such a prestigious award for my work representing residents locally and in Westminster. My community events have been well supported by local people, and this Award is for our constituency not just me.”\nHe added: “With Jo Cox as one of the previous winners, it has real poignancy as this year my Havant Older Persons Information Fair supported her Commission on Loneliness’ #Happytochat campaign, tackling social isolation. I’ve also been delighted that other events I’ve organised in my first two years as MP, including my Jobs and Apprenticeships Fair and Universities Conference to encourage more young people to continue their education have been so well supported by the local community. I look forward to repeating all these events in future and continuing to work hard to for everyone living in the Havant constituency. Thank you to all the residents and community groups in my constituency who have supported me.”\nAll of the nominations for the MP of the Year Awards come from grassroots community organisations. In total more than 130 MPs were nominated across all of the major parties.\nThe Prime Minister, Theresa May, said: “I would like to congratulate Alan Mak for winning a Patchwork Foundation award and for all their efforts and hard work in encouraging young people from under-represented communities to engage in the political process. I passionately believe that how far you go in life should be about your talents and your hard work and nothing else.”\nPicture: Left to Right – Andy Bagnall (KPMG: Director of External Affairs), Mr Speaker (Patchwork Patron), Alan Mak MP & Sir Martyn Lewis (Patchwork Patron).",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_volunteer/content_11.html": "If you would like to join Alan's growing team of local volunteers and help with his local campaigning work, he would be pleased to hear from you.\nCan you help him by:\n-\nDelivering leaflets\n-\nSpeaking to friends, neighbours and residents on Alan's behalf\n-\nMake phone calls to residents on Alan's behalf\n-\nPut up a poster\n-\nPost on social media\n-\nHelp with office work/admin\n-\nDonate £5 to print leaflets\n-\nDrive residents to polling station\n-\nHelp on polling day (Thursday 4 July 2024) and in the few days leading up to polling day",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_map-locations/content_41.html": "My map\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_PlanningConsultation/content_10.html": "Photo caption: Alan Mak MP meets Housing Secretary Michael Gove\nUpdate Wednesday 16 December 2020\nAlan welcomes changes to proposed housing target formula\nLocal MP Alan Mak has welcomed the announcement by the Government that it will not be implementing its proposed new housing formula, following a consultation period.\nMr Mak opposed the proposed new formula, submitting a formal consultation response stating that it was not appropriate for the Havant Constituency and holding several in-person meetings with the Secretary of State for Housing, Communities and Local Government Robert Jenrick and Housing Minister Christopher Pincher in the House of Commons.\nIn his submission to the consultation Mr Mak recognised that the Government must deliver on its December 2019 General Election manifesto commitment to deliver more homes across the country and that it’s right that everyone, especially young people and growing families, has an opportunity to own their own home, not just live with their parents or rent indefinitely. However, Mr Mak also strongly emphasised that this must be achieved in a way that takes account of local factors and constraints, including across the Havant Constituency.\nAn updated strategy will now be introduced prioritising brownfield sites and existing urban areas especially large cities, while ensuring that constrained areas such as the Havant Constituency are not subject to a new housing target formula. The existing housing target formula – known as the “Standard Method” – will remain in place and our local planning authority Havant Borough Council will more forward with its new Local Plan for Housing based on the current Standard Method. Local councillors will continue to decide local planning applications and housing priorities.\nUnder the revised proposals, cities will be encouraged to plan for more family homes and to make the most of vacant buildings and underused land to protect green spaces. The plans will encourage more homes to be built in England’s 20 largest cities and urban centres, boosting local economies by supporting jobs in the building sector, and revitalising high streets with the footfall new residents bring. Southampton is included in the list of top 20 cities.\nHavant Constituency MP Alan Mak said: “I opposed the proposed new housing target formula because it was not appropriate for the Havant Constituency, and today’s confirmation that it will not be going ahead is welcome news. The existing formula is being retained, our local planning authority Havant Borough Council accepts it and will now move forward with their Local Plan for Housing based on the existing formula, with local councillors continuing to decide individual local planning applications and housing priorities.”\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nBelow is information documenting Alan's original response to the Government's consultation period:\nFollowing engagement with Havant Constituency residents and meetings in Westminster with the Secretary of State for Housing, Communities and Local Government and the Minister of State for Housing, local MP Alan Mak MP has submitted his response to the Government’s two recent consultations on proposed changes to the planning system. The consultations, \"Changes to the Planning System\" and \"Planning for the Future\" closed on the evenings of Thursday 1 October 2020 and Thursday 29 October 2020 respectively.\nIn his submissions Alan Mak MP recognised that the Government must deliver on its December 2019 General Election manifesto commitment to deliver more homes across the country and that it’s right that everyone, especially young people and growing families, has an opportunity to own their own home, not just live with their parents or rent indefinitely. However, Alan also strongly emphasised that this must be achieved in a way that takes account of local factors and constraints, including across the Havant Constituency.\nAlan praised Havant Borough Council (HBC) who describe themselves as a “pro-development local authority” and recognised the hard work they have put into drafting their new Local Plan, which sets out their plans for housing, development and regeneration plans locally. Alan has worked closely with the Council’s Planning Policy Manager as he drafted his own consultation responses.\nAlan said: “Young people, growing families and others across our constituency all deserve the opportunity to own their own home, and more housing is needed as demand grows but new local targets should take account of physical and environmental constraints. The first draft of the new standard method for calculating housing need is not appropriate for the Havant Constituency so I have submitted a robust but constructive response, and included ideas and suggestions for improvement. I have also submitted other suggestions for wider reform of the planning system.”\nAlan believes that physical, geographical and environmental constraints in a local authority area must be taken into account in the new standard method for calculating housing need figures and play a key role in deciding (and lowering) housing need numbers.\nIn Westminster, Alan is an active founding member of a group of Conservative MPs that has a shared desire to reform and improve the first draft of the new standard method and shape the wider planning reforms.\nYou can read his submissions by downloading them at the bottom of this page, but a summary of the key points that Alan made in his consultation responses are:\n- Retain the role of local councillors in the planning decision-making process.\n- Ensure there is on-going protection for environmentally-sensitive areas.\n- Recognise areas that have physical/geographical constraints such as Hayling Island.\n- Maintain the duty to co-operate or introduce a similar concept so local councils can share housing need with neighbouring local authorities.\n- Retain a cap on the housing need figure to prevent it from increasing too dramatically.\nIn addition to his consultation responses, Alan has also sought to clarify the following points about the first draft of the new standard method:\n- The new standard method will be used to calculate theoretical housing need in an area (based on technical factors such as affordability and population growth), NOT the ultimate housing delivery number/the number of houses actually built in reality, which is decided when local councils have taken into account a variety of constraints and other factors.\n- The projected new housing numbers that have been quoted by various pressure groups, lobbyists, planning consultancies and other organisations that you may have seen in the media are purely speculative. It would only be possible to determine the final housing need figure once (a) the consultation concludes and all the submissions have been read, (b) the new standard method is finalised, and (c) details are confirmed about how local authorities are able to mitigate against/reduce their housing need figure to take account of local factors. None of these three things has happened, and they will not be happening for some time.\n- Under the Government’s proposed new planning system, local planning authorities/local councils such as Havant Borough Council will still have a key role to play in local planning and development issues. As well as being crucial in the plan-making stage, for land that the local council designates as “renewal” land there will still be a planning application which will be considered by councils on a case-by-case basis. Similarly, local councils will hold the pen on overseeing design codes and guidance, based on genuine community involvement to reflect local quality and preferences.\nWhilst the consultations’ responses are reviewed – and pending the finalisation and introduction of any new system for calculating housing needs – local planning authorities such as Havant Borough Council will continue to play their key role in the planning process and influencing housing targets that reflect realistic delivery, including by continuing to grant or decline planning permissions.\nAny queries relating to local planning and development issues, including HBC’s new Local Plan and related projects, can and should be still addressed to HBC, including via local HBC councillors.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_local-mp-alan-mak-attends-coronation-picnic-st-thomas-becket-church-warblington/content_12.html": "Local MP Alan Mak has attended a Coronation picnic at St Thomas à Becket Church in Warblington, Havant to celebrate the Coronation of His Majesty King Charles III. The event was attended by over 50 local residents, who gathered to toast to the new King's reign and bless two new benches in the church yard.\n\"I was pleased to join Reverend Andrew Sheard and Church Warden Peter Eberle at the Coronation picnic at St Thomas à Becket Church,\" said Alan. \"It was wonderful to see so many local residents come together to celebrate this historic occasion.\"\nDuring the event, two new benches were blessed in the churchyard, one commemorating the reign of Her Late Majesty Queen Elizabeth II and another for the reign of His Majesty King Charles III. The party then sang God Save the King and toasted to His Majesty's reign. Alan also helped to decorate a special Coronation flower crown in the church yard.\n\"It was a lovely event, and it was a pleasure to help decorate the Coronation flower crown,\" said Peter Eberle, the churchwarden at St Thomas à Becket. \"The new benches in the churchyard are a fitting tribute to both Queen Elizabeth II and King Charles III, and it was great to be part of the blessing.\"",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_WinterFuelHelp/content_28.html": "Many residents have contacted me about the Government’s recent decision to end the Winter Fuel Payment (WFP) as a universal benefit for pensioners, meaning that pensioners will only be eligible for WFP if they receive Pension Credit.\nThe Winter Fuel Payment is worth between £200-£300 per pensioner, and is paid out each year in the run-up to winter to help older people with heating costs.\nIn the Havant Constituency, latest figures indicate around 20,0000 local pensioners may lose the Winter Fuel Payment unless they make a successful claim for Pension Credit in time.\nIf you, a family member, friend or neighbour are affected, or could be, here are 2 ways I can help you:\n1. Share your story with me\nPlease let me know how the removal of WFP could affect you or someone you know.\nTo share your thoughts, please contact me\n2. Claim Pension Credit\nIf you, a family member, friend, neighbour or colleague are likely to be affected, please check your/their eligibility for Pension Credit by clicking here. Claims can also be made online using the same link.\nMy office can follow up once submitted if there are delays.\nIf you would like to stay informed about my work as your MP locally and in Westminster, please follow me on social media and sign up for my regular MP e-mail newsletter via this link: www.AlanMak.org.uk/Newsletter",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_category_Local-News/content_49.html": "Local MP Alan Mak welcomes pupils from Trosnant Junior School in Leigh Park on trip to Parliament 30th April 2025 Local MP Alan Mak has welcomed pupils from Trosnant Junior School in Leigh Park on a trip to Parliament. They were taken on a guided tour of Parliament before... Local News\nLocal MP Alan Mak visits Stoke Fruit Farm on Hayling to show his continued support in fight against Labour's Family Farm Tax 24th April 2025 Local MP Alan Mak has visited Stoke Fruit Farm on Hayling to show his continued support in the fight against Labour's Family Farm Tax. He called in to see Sam... Local News\nLocal MP Alan Mak joins Hayling police patrol to support Local Bobby Scheme 22nd April 2025 Local MP Alan Mak has been on patrol on Hayling Island to find out about the success of the Local Bobby Scheme which he supported. He met up with PC Ed Mardell... Local News\nLocal MP Alan Mak continues support for Havant Rugby Club at end-of-season President's Lunch 15th April 2025 Local MP Alan Mak has continued his support for Havant Rugby Club by attending the end-of-season President's Lunch and presenting an award. Mr Mak, who is the... Local News\nLocal MP Alan Mak opens Bedhampton Bowling Club’s new playing surface and bowls the first bowl 14th April 2025 Local MP Alan Mak bowled the first bowl as he officially opened a new playing surface at Bedhampton Bowling Club. He was welcomed by Secretary Philip Gardner... Local News\nLocal MP Alan Mak visits Hayling Island’s vandalism-hit Isla Bay cafe to show his support 11th April 2025 Local MP Alan Mak has visited a vandalism-hit Hayling Island cafe to show his support. Co-owner Eray Karacan was shocked to discover that windows had been... Local News\nLocal MP Alan Mak vows to stand by 514 businesses in the Havant Constituency hit by Labour's Jobs Tax 7th April 2025 Local MP Alan Mak has vowed to stand by 514 businesses in the Havant Constituency that are being hit by Labour's Jobs Tax. The National Insurance Jobs Tax... Local News\nLocal MP Alan Mak leads celebrations as he hosts 10th annual Havant Constituency Community Information Fair on Hayling 5th April 2025 Local MP Alan Mak led the celebrations as he hosted his 10th annual Havant Constituency Community Information Fair at Hayling Island Community Centre. He made... Local News\nLocal MP Alan Mak slams ‘Rachel’s Cruel Day’ as Havant Constituency families hit by £1,191 of extra costs 1st April 2025 Local MP Alan Mak has warned that families in the Havant Constituency are in line for £1,191 of cost increases from 1 April, dubbed ‘Rachel’s Cruel Day’. It... Local News",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_cop26/content_5.html": "Alan Mak MP organised and hosted the Havant Constituency Local COP26 Environment and Climate Conference with Government Ministers and local business leaders amongst the keynote speakers.\nTimed to coincide with the United Nations’ COP26 climate summit in Glasgow, Alan wanted to make the issues relatable and relevant to local residents by focusing on the individual actions that can make a big difference locally. The Conference also highlighted good practices and case studies from our local area.\nThe Conference was held virtually and included panel discussions with senior figures from local government officials, business representatives, community groups, environmental experts, and young people. Alan also secured interviews with Environment Ministers Rebecca Pow and Zac Goldsmith, plus a message of support from President of COP26, Alok Sharma.\nTopics covered during the Conference included tackling and reducing discharges into local harbours, the work of local councils and community groups, nature and rewilding, the use of energy, infrastructure policy. The Conference also showcased work done by local schools.\nBelow is an environment survey that Alan encourages you to complete. Resident responses are valuable for Alan's work locally and in Westminster.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_SchoolFunding/content_34.html": "Since 2015, Alan has been campaigning in Parliament for more school funding, and his work has paid off locally: every local school received a cash increase to its budget in 2021-22, and every school in our constituency got a funding boost of at least 2%.\nFunding for schools increased by 3.2% nationally, and by an average of 4.2% across the Havant Constituency, as part of a national £14.4 billion investment into education between 2020 and 2023. This is the largest cash increase to school funding in over a decade. All schools in Havant received more than the national minimum of per pupil funding.\nEach Havant Constituency primary school received on average £4,891 per pupil and each secondary school received on average £6,219 per pupil. The national minimum is £4,265 per primary pupil and £5,525 per secondary pupil.\nEvery secondary school in our constituency is rated either Good or Outstanding by Ofsted, along with nearly every primary and junior school. This funding is critical to continually improve education for the next generation.\nFind out how much extra funding your local school received via the table below:",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_coronation/content_9.html": "The Coronation of HM King Charles III took place on May 6 2023. It was a unique once-in-a-generation event which was viewed by over 18 million people in the UK and another 400 million from across the globe.\nDetails for the ceremony and other activities that took place over the extended website can be found on the Royal website.\nDuring the Coronation weekend, I attended a number of local events to mark the special occasion.\nIn Havant, I was pleased to give a reading of the prayers of intercession at a special service in St. Faith's Church. I also joined Canon Tom Kennar, The Worshipful Mayor of Havant Diana Patrick, and the Mayor's Consort in the churchyard to plant a special Hawthorne sapling to mark the occasion.\nIn Emsworth, I visited the Emsworth Bowling Club who held a special day of boules, tea and cake. While there, I addressed the gathered attendees on the importance of the occassion and lead a toast to His Majesty, before presenting the Club Chairman Sue Wood with a Union Flag.\nOn Hayling Island, I attended a street party hosted by Angela Hopkins. Angela is a good friend of mine who has previously worked with me to fundraise for the Royal British Legion. I presented her with a Union Flag and gave my best wishes and thanks to those attending.\nIn Warblington, I attended a Coronation Picnic at at St Thomas à Becket Church. We toasted to His Majesty's long and prosperous reign and spent time reflecting on Her Late Majesty Queen Elizabeth.\nFinally, in Purbrook, I visited the Junior School to meet pupils at a special Coronation Lunch. I was delighted to see that the young pupils were just as excited as I am about the King's reign and we were all keen to send our best wishes his way. I gave a few short words at the beginning of the lunch, and presented members of the School Improvement Committee with a Union Flag.\nI am also offering Havant Constituents free Union and St George's Cross Flags in the lead up to the Coronation. What better way to show your appreciation for the new King than to be fly our national colours? To apply for a free flag, visit www.AlanMak.org.uk/Contact",
  "https_www_alanmak_org_uk_/http_www_alanmak_org_uk_EmsworthLibrary/content_43.html": "Photo caption: Alan with local councillors and Cllr Sean Woodward, HCC Cabinet member with responsibility for libraries\nThis page contains information in relation to Alan's successful work to keep Emsworth Library open.\nLocal MP Alan Mak has opened the newly relocated library for Emsworth at the Emsworth Community Centre after leading a successful campaign to keep it open.\nThe library has moved from its original site in the town centre to the Emsworth Community Centre on North Street after Hampshire County Council said it was due to close. Following a successful campaign by Mr Mak, the decision was made to move the library into the Community Centre. This enables the facility to retain its town centre location, as well as Hampshire County Council Services such as a full-time librarian.\nIn addition to these services being kept, the new space features a dedicated room for a new, larger children’s library, free Wi-Fi, remote printing, and a bookable public computer. The library also has a good selection of talking books and magazines, as well as stocking local newspapers.\nLocal MP Alan Mak said: “I’m delighted that the Emsworth Library has stayed open and moved to the Community Centre, where it is now well positioned to be used by more residents more than ever. I have been working hard to make sure this was possible after Hampshire County Council said the old library had to close, so I’m very pleased to see the County Council’s services retained here, along with new and modern facilities.”\nJill Millar of the Emsworth Residents Association said: “Thank you to Alan Mak for supporting the campaign to keep the library open, working with local councillors and the community. It’s fantastic to see the library open in a new building with a new children’s area- I’m looking forward to using it in the near future”.\nThe Emsworth Library can be accessed by residents for free at the Emsworth Community Centre. It is open from 9:30am to 5pm on Tuesdays, Thursdays and Fridays, and 9:30am to 1:30pm on Saturdays.\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nBelow is information documenting Alan's journey to keep Emsworth Library open:\nLocal MP Alan Mak and Emsworth councillors are urging residents to sign-up for their community campaign to keep Emsworth Library open.\nHampshire County Council (HCC) are currently consulting on the future of its Library Services around Hampshire, including Emsworth Library. HCC believe that Emsworth Library is under-used and the rent for the building that houses the Library is too high. Options for its future include reducing opening hours, greater community involvement in its operation, moving the Library to a cheaper site or complete closure.\nBoth Mr Mak and the Emsworth councillors have been in close contact with the HCC Cabinet member with responsibility for libraries, Cllr Sean Woodward, including organising a meeting to discuss the issue where they called on Cllr Woodward to keep the Library open.\nMr Mak said: “I want Emsworth Library to stay open, and I will be working with local councillors and the community to persuade Hampshire County Council to keep the Library even if it moves to a new location with cheaper rent. Libraries are about more than books – they are an important community hub. My meeting with Cllr Woodward was very constructive and I am pleased that Hampshire County Council is open to new solutions to provide library services in Emsworth.”\nMr Mak and the local councillors hope to find a solution that would involve a new town centre location but retaining services maintained by HCC on a daily basis, such as a full-time librarian. This would enable HCC to make substantial savings on rent and business rates.\nEmsworth Borough Councillor Lulu Bowerman said: “Emsworth councillors share residents’ concern and disappointment about the potential closure of our Library which is such an important facility for so many in our community. We will continue working with the local community groups, Ray Bolton our county councillor and Alan Mak MP to explore all options to maintain a County Council run library in our town.\"\nWhile the consultation is ongoing Mr Mak is also calling on residents to sign-up to his community campaign. You can do this by visiting AlanMak.org.uk/EmsworthLibrary. This will then be turned into a petition that can be presented to Cllr Woodward and other decision-makers at HCC.\nMr Mak added: “I’m asking Emsworth residents to sign-up for our Emsworth Library Campaign, helping me emphasise to Hampshire County Council that this is an subject important to many people in the community. I’ll also be sending out regular updates to those that sign-up.”\nHampshire County Councillor Ray Bolton said: “I also urge residents who care about the issue to use the Library so its usage figures rise and respond to the consultation. Currently the response to the consultation is lower from Emsworth than from other affected areas, so we need to make sure decision-makers know the strength of feeling in Emsworth.”\nCounty Councillor Bolton also asked Cllr Woodward at a Main County Council meeting on 13 February, to confirm that no decisions have been taken in relation to Libraries and that there are many options for consideration as to their future operation. Cllr Woodward in his answer, provided this confirmation to all the County Councillors.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_alans-achievements-national/content_54.html": "I combine my work as your local community champion with my role as Government Minister.\nThis allows me to come up with good ideas that benefit our area and the whole country - and then turn them into real laws and policies that make a positive difference to people's lives.\nBelow you’ll find a summary of my key successes in Westminster when I was your local MP. Click here for my successes locally (opens a separate web page).\n1. Creating the NHS Reserves – a new part of the NHS family\nI successfully campaigned for the creation of a national NHS Reserve to allow volunteers to step up to support the NHS in time of need. I introduced the law in Parliament that proposed the creation of the NHS Reserves.\nThe Covid pandemic showed how volunteers with experience of working in healthcare were prepared to return to work when the NHS faces pressures like the Covid pandemic. During the pandemic nearly 50,000 qualified professionals including retired doctors and nurses responded to the call for experienced healthcare workers in the NHS and I salute their commitment and hard work. A further 750,000 non-clinical volunteers signed up to support the work of the NHS, at vaccination clinics and in other parts of the Health Service.\nThe range of skills an NHS Reserve would draw on would include doctors, nurses, healthcare assistants, as well as non-clinical roles such as drivers, electricians, logistics specialists, IT experts and communications professionals.\nI was pleased my plan has been supported by The Times newspaper and the former Health Secretary and Chair of the Commons Health and Social Care Committee, Jeremy Hunt MP.\n2. Leading the successful campaign to ban new pagers and fax machines in the NHS\nOur NHS depends on clinicians and healthcare workers being able to access information about patients and their records securely and quickly. But despite huge advances in medicine and the introduction of new treatments in the NHS, it was being held back by reliance on 1970s-era technology such as fax machines and pagers.\nOutdated technology holds back patient care and is expensive to maintain. To make the NHS fit for the needs of modern society, I wrote an influential report, “Powerful Patients, Paperless Systems” and introduced a new law (a Bill) to Parliament to ban pagers and faxes. In my report I set out how the NHS can achieve three key targets:\n- Moving the NHS from a paper-first service to a digital-first service.\n- Building an ecosystem of innovation in the NHS so that all information transfers within it happen digitally.\n- Ensuring that the savings from innovation are ploughed back into frontline services, with support for research and development increasing in line with NHS budgets.\nI was pleased that I received support for this campaign from the Government, with fax machines being banned in the NHS from 2020.\n3. Proposed the NHS App, which helps millions of patients access NHS services and advance productivity\nI wrote a report on how the NHS can take advantage of new technology to improve patient care, “Powerful Patients, Paperless Systems” and proposed the creation of an NHS app.\nThe NHS app is now up and running, and allows patients to book appointments, order repeat prescriptions, and receive advice on accessing the right treatment for them.\n4. Developing the Help to Grow policy to help SMEs adopt technology to improve productivity\nI was raised in the world of small business, working in my family’s high street shop in York. My parents worked long, unsociable hours to keep the business going whilst bringing up a family, and I was privileged to join them from a young age serving customers from behind the counter and helping with the accounts.\nIn the Havant Constituency we have many thriving small and medium enterprises (SMEs) whose work I support and celebrate.\nAs a Treasury Minister and Co-Chair of the Conservative Party’s Policy Board, I developed a key policy to help SMEs take advantage of new technology to improve their productivity. Small firms often don’t have the time or resources to obtain the additional technology or skills they need to be more productive. Therefore, I welcomed the Help to Grow schemes introduced by the Treasury – Help to Grow Management and Help to Grow Digital. These two schemes boost SMEs with support for their training costs and for the costs of purchasing productivity-enhancing software.\nAt every Budget, Conservative Chancellors are keen to help our businesses grow and prosper. I will continue to work with business owners in the Havant Constituency and look forward to further successes like the Help to Grow schemes.\n5. Identifying critical minerals as a key national security issue\nAdvanced manufacturing industries depend on access to several critical minerals which we need to source from around the world. I have called for the creation of an alliance for critical minerals similar to the “Five Eyes” pact with Australia, Canada, New Zealand and the USA for intelligence gathering and sharing.\nCritical minerals all have unique properties which means they cannot easily be replaced in manufacturing processes. They are vital for producing components in modern consumer goods, battery technology and defence.\nCritical minerals can be difficult to mine, and processing capacity is concentrated in a relatively small number of countries. Consequently, it is important for the UK that we identify and protect our supply.\nThe UK is a leader in recycling and lean manufacturing but I have called for the establishment of a National Critical Minerals Council to bring together scientists, industry and Government to ensure that we keep this issue at the forefront of policymaking and develop our national resilience.\n6. Leading the campaign to make Britain the leader of the Fourth Industrial Revolution\nI have led work in Parliament on the Fourth Industrial Revolution (4IR), the new wave of technological change driven by computing and digital technology which is revolutionising our world. For five years I have led the campaign to make the UK a leader in the 4IR, delivering transformational benefits for industry and society.\n4IR brings together the use of data analysis, artificial intelligence, robotics, automation, and advances such as quantum computing to drive productivity increases and further innovation in our economy. Government can help by incentivizing investment and research and development (R&D) and by helping business take advantage of the new technologies where they need assistance. For small and medium enterprises (SMEs) the 4IR offers the potential to expand and develop but they are the firms least likely to have the expertise necessary to integrate 4IR techniques into their business. I was pleased that the Government followed up my suggestions to create two new Help to Grow schemes, covering financial support for management and training, and investment in software solutions which can increase productivity.\nI organised and led the first ever debate in Parliament on the Fourth Industrial Revolution and I will continue to highlight the benefits of it for businesses in the Havant Constituency and across the UK.\n7. Leading the successful campaign to secure Government funding for school breakfast clubs\nHelping children and young people get the best start in life is one of my top priorities for the Havant Constituency and the UK.\nI am a strong supporter of school breakfast clubs because they help children start the school day without being hungry, boosting children's concentration and classroom attainment.\nI served as President and Trustee of Magic Breakfast, a national charity helping bring healthy and nutritious breakfasts to children who are unable to get breakfast at home before they start their school day. It works across the country in major cities including London, Manchester, Sheffield, Birmingham, Leeds, Liverpool and Blackburn, as well as in the Havant Constituency.\nMagic Breakfast has been supported by Prime Ministers David Cameron, Theresa May, and by Boris Johnson both as Mayor of London and Prime Minister.\nIn Parliament, I have continued my support for Magic Breakfast, championing school breakfast clubs, and engaging with Ministers on issues from child poverty to support for school breakfast clubs. I am a strong supporter of the National School Breakfast Club Programme, which is funded by Government and which Magic Breakfast delivers nationally alongside another charity, and which is a direct result of my campaigning over the years.\nLocally, I brokered a £30,000 grant from the FatFace Foundation to enable Magic Breakfast to work with Havant Academy to set up a breakfast club. The club is open to all children at the school and is popular with pupils who get not only a breakfast but a chance to meet friends and go into the school day prepared and focussed. Around 100 pupils use the breakfast club each day.",
  "https_www_alanmak_org_uk_/http_www_alanmak_org_uk_news/content_40.html": "Local MP Alan Mak welcomes pupils from Trosnant Junior School in Leigh Park on trip to Parliament Wednesday, 30 April, 2025 Local MP Alan Mak has welcomed pupils from Trosnant Junior School in Leigh Park on a trip to Parliament. They were taken on a guided tour of Parliament before meeting up with Mr Mak for a question and answer session in the Education Centre. Groups of pupils from Trosnant Junior School visit Parliament each year and Mr Mak has also been to the school to talk to the children about life as an MP and... Local News\nLocal MP Alan Mak visits Stoke Fruit Farm on Hayling to show his continued support in fight against Labour's Family Farm Tax 24th April 2025 Local MP Alan Mak has visited Stoke Fruit Farm on Hayling to show his continued support in the fight against Labour's Family Farm Tax. He called in to see Sam... Local News\nLocal MP Alan Mak joins Hayling police patrol to support Local Bobby Scheme 22nd April 2025 Local MP Alan Mak has been on patrol on Hayling Island to find out about the success of the Local Bobby Scheme which he supported. He met up with PC Ed Mardell... Local News\nLocal MP Alan Mak continues support for Havant Rugby Club at end-of-season President's Lunch 15th April 2025 Local MP Alan Mak has continued his support for Havant Rugby Club by attending the end-of-season President's Lunch and presenting an award. Mr Mak, who is the... Local News\nLocal MP Alan Mak opens Bedhampton Bowling Club’s new playing surface and bowls the first bowl 14th April 2025 Local MP Alan Mak bowled the first bowl as he officially opened a new playing surface at Bedhampton Bowling Club. He was welcomed by Secretary Philip Gardner... Local News\nLocal MP Alan Mak visits Hayling Island’s vandalism-hit Isla Bay cafe to show his support 11th April 2025 Local MP Alan Mak has visited a vandalism-hit Hayling Island cafe to show his support. Co-owner Eray Karacan was shocked to discover that windows had been... Local News\nLocal MP Alan Mak says tech SMEs will play vital role in driving future economic growth and innovation 10th April 2025 Local MP Alan Mak says tech SMEs will play a vital role in driving future economic growth and innovation. The Shadow Secretary of State for Science, Innovation... Westminster News\nLocal MP Alan Mak vows to stand by 514 businesses in the Havant Constituency hit by Labour's Jobs Tax 7th April 2025 Local MP Alan Mak has vowed to stand by 514 businesses in the Havant Constituency that are being hit by Labour's Jobs Tax. The National Insurance Jobs Tax... Local News\nLocal MP Alan Mak leads celebrations as he hosts 10th annual Havant Constituency Community Information Fair on Hayling 5th April 2025 Local MP Alan Mak led the celebrations as he hosted his 10th annual Havant Constituency Community Information Fair at Hayling Island Community Centre. He made... Local News\nLocal MP Alan Mak slams ‘Rachel’s Cruel Day’ as Havant Constituency families hit by £1,191 of extra costs 1st April 2025 Local MP Alan Mak has warned that families in the Havant Constituency are in line for £1,191 of cost increases from 1 April, dubbed ‘Rachel’s Cruel Day’. It... Local News",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_JobsFair2020/content_39.html": "** Confirm on Facebook that you're coming to Alan's Fair to be in with a chance to win a free Chromebook laptop worth £200 and a bottle of House of Commons Champagne!**\nThe Havant Jobs, Apprenticeships and Careers Fair will return on Friday 13th March 2020 for a fifth year.\nOrganised by local MP Alan Mak, the popular event will see many apprenticeships and roles on offer.\nThe Fair is the perfect opportunity for anyone searching for work or looking for a career change. Representatives from dozens of industries from both the public and private sectors, ranging from the Armed Forces to care agencies and retail, will be on hand to offer jobs and advice.\nWith a large variety of exhibitors, the event will once again be taking place at Havant Leisure Centre from 10am to 2pm and is free for anybody living in the Havant constituency – which includes Havant Town, Emsworth, Hayling Island, Bedhampton, Langstone, Purbrook, Stakes, Widley and Leigh Park. Friends, family, parents and guardians of young people are also encouraged to attend.\nThe Fair is also supported by the Havant Job Centre who will be providing advice on the day.\nSpecialist workshops will also be provided on CV building, cover letter writing and job interview techniques. They are free for all local residents and will run at the below times.\n10:00am - CV Building\n11:00am - Cover Letter Writing\n12:00pm - Build Effective Presentations\nThere is still space for exhibitors, any business wishing to get involved should email [email protected]\nTo keep in touch with Alan's work locally and in Westminster, please sign up for his residents' newsletter: www.AlanMak.org.uk/Newsletter\nCompetition Rules: Everyone listed on Facebook as attending will be entered into a prize draw for a chance to win a Chromebook laptop worth £200 and a bottle of House of Commons Champagne, provided they sign in on the day of the event.\nAny business wishing to get involved should email [email protected] for more information.\nAlan Mak is active across the Havant constituency and in Parliament. Residents and others can keep up-to-date with Alan's work by signing-up for his regular e-mail newsletter.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_cookies/content_30.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_Funding/content_20.html": "This page contains a list of funding sources available to community groups, charities and small businesses in the Havant Constituency. Alan Mak MP has no influence on the decisions made by these organisations, or any affiliations with them.\nLocal Authority Funding\nPlease see below a list of Local Authority Funding sources. Local authorities are administrative bodies in local government, for example borough, city or county councils.\nHampshire and Isle of Wight Community Foundation\nThe Hampshire and Isle of Wight Community Foundation’s grant programmes support community projects for: all ages, those with disabilities, families in crisis, the homeless, those in poor health, people looking to get back in to work, those seeking protection, those looking to get healthier through sport, drama and singing, those who want to learn about the arts and local culture, and those who are isolated or lonely. Grants are awarded to smaller lesser known charities, and community groups.\nThe Hampshire and Isle of Wight Foundation is also offering a new round of funding from the 'Moneybarn Social Impact Fund' which supports local community and voluntary groups in Havant. This fund will award grants between £1,000 and £5,000 to projects and services aiming to alleviate the problems that prevent social inclusion.\nCommunity Infrastructure Levy (CIL)\nThe Community Infrastructure Levy (CIL) is a new levy that local authorities can charge on developments in their area.\nCIL income can be used to fund additional infrastructure required to support new development including roads, schools, green spaces and community facilities.\nwww.havant.gov.uk/planning-and-environment/planning-policy/community-infrastructure-levy\nHampshire County Councillor Grants\nApplications can be made by a wide variety of organisations and groups located within the administrative County of Hampshire, but the organisation or group must have a bank account, and (for grants over £5,000) provide a set of accounts and, where relevant, details of the organisation’s child/adults safeguarding policy. Applications from religious groups may be considered, but the application must show that the project will bring wider community benefit. Applications from Maintained Schools, Academies, District, Borough or City Council’s, National Park Authorities, the Police, the Fire Service and the NHS may also be considered but only when the applicant can demonstrate that the grant will support an additional community benefit and will not be used to supplement the core services or functions of that organisation.\nwww.hants.gov.uk/community/grants/grants-list/county-councillor\nPolice and Crime Commissioner's Covid-19 Keeping Communities Safer Fund:\nExisting voluntary groups, parish and town councils, schools, and informal community groups established in direct response to COVID-19 can apply for grants of £500 to support initiatives that are helping people stay safe.\nHampshire County Council - Business Hampshire\nPreviously known as 'Invest Hampshire', this service aims to showcase all that is great about Hampshire with the aim to attract new business investment into the county and, to support the grown and success of our existing local businesses, large and small.\nGovernment Funding\nBusiness Support Campaign\nThis fund is categorised into four themes, to help businesses find best what they are looking for:\n• Finance and business planning - including funding for new businesses and business growth, dealing with late payments, and equity and debt finance\n• Leadership and Talent - including mentoring schemes, help with recruiting, developing leadership skills or joining a network.\n• Innovation and Technology - including funding for innovation, adoption of new technology, intellectual property and finding partners for innovation.\n• Exporting - including support for doing business internationally and expanding online.\nNational Funding\nPlease see below a list of funding sources that are organised and awarded at a national level.\nAssociation of Charitable Foundations\nACF is the membership body for the UK foundations and grant-making charities.\nGrants Online\nUp to date UK grant funding database.\nNational Lottery Community Fund\nThe National Lottery is funding projects in the arts, sport, heritage, charity, voluntary, health, education and environmental sectors.\nPostcode Society Trust\nFor initiatives to improve the health and wellbeing of communities - including the arts and physical recreation projects - as well as those with a focus on reducing isolation, and for groups dedicated to improving and increasing access to outdoor space.\nwww.postcodesocietytrust.org.uk\nPower to Change\nThe fund is designed to support existing community businesses with grants to help them progress towards self-sufficiency. This could be through increasing trading income, securing an asset or significantly reducing revenue costs.\nwww.powertochange.org.uk/get-support\nAviva Community Fund\nThe Aviva Community Fund has been made available for new and existing charities, to apply for funding to take the next step. To this end, any projects submitted, should be to develop a new approach, product, pilot a new scheme, implement a new initiative, or expand services to a new area or beneficiary group.\nwww.avivacommunityfund.co.uk/about-us\nThe Arts Council\nSupporting thousands of individual artists, community and cultural organisations through National Lottery Project Grant.\nwww.artscouncil.org.uk/funding\nBiffa Awards\nProviding funding options for communities near landfill sites in four areas: Rebuilding Biodiversity, Community Buildings, Recreation and Partnership.\nErnst Trust\nAll grants awarded are for environmental education projects, outdoor learning and ‘learning from the land’. The Trustees would like to see applicants addressing key global concerns through educational projects which focus on issues such as (but not exclusive to): connecting with nature, climate change, environmental pollution, loss of biodiversity, farming and food production, renewable energy, mental and physical wellbeing, social justice.\nLloyds Bank Foundation\nGrants for small and local charities, investing in their work helping people overcome complex social issues across England and Wales.\nwww.lloydsbankfoundation.org.uk\nVeolia Environmental Trust\nFunding for a broad range of projects that; support biodiversity, parks and paths, and recreation facilities.\nGreggs Foundation\nThe foundation supports people in need in the heart of local communities. The Greggs Foundation prioritises organisations that support voluntary carers, people with disabilities, homeless people and older people.\nwww.greggsfoundation.org.uk/grants\nThe Co-op\nProjects need to be providing support aligned to the following criteria and must take place in 2022: access to food, mental wellbeing, young people.\nSports Funding\nPlease see below a list of funding sources exclusively for sports in the community.\nSports England Community Asset Fund:\nThis programme is dedicated to enhancing spaces in the local community that give people the opportunity to be active. This could be a park, a hall or pitch.\nwww.sportengland.org/funding/community-asset-fund\nThe Football Foundation\nFunding the development of new and refurbished grassroots sports facilities improving the quality and experience of playing sport at the grassroots level to sustain and increase participation and improve general skills levels.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_bedhampton-survey-2024/content_19.html": "Please CLICK HERE to complete the Bedhampton residents' survey 2024. (A new window will open)\nDon't forget to sign up for my Residents' email newsletter to receive updates about my work: www.AlanMak.org.uk/Newsletter\nI'm visible and active in Bedhampton all year round. Some recent successes I've secured for Bedhampton residents include:\n- Voting for March’s Budget which cuts tax for workers, protects the State Pension Triple Lock, freezes fuel and alcohol duty, expands Child Benefit, and invests in our NHS. Combined with January’s National Insurance tax cut, the Budget puts £900 back into the pocket of the average worker.\n- Boosting funding for Hampshire Police to roll-out a new Named Local Bobby Scheme, which means all Bedhampton residents now have a named police officer covering their street, and access to their e-mail and mobile number. Bedhampton’s police are more contactable than ever before.\n- Successfully securing £58 million for a new Emergency Department at Queen Alexandra Hospital, which serves everyone in Bedhampton. It’s due to open this winter.\n- Securing £300,000 of Government money for a coastal defence scheme at Broadmarsh Coastal Park which protects Bedhampton near the A27 and Chaldock Lake. The coastal wall has been replaced and the shared cycle/footpath which runs on top is now protected from erosion so Bedhampton residents can use it safely.\n- Extending the £2 single bus fare cap until the end of 2024, making travel cheaper for Bedhampton residents and visitors.\n- Serving as a Vice President of Bedhampton’s Manor Trust, a local charity that provides accommodation for older people and promotes Old Bedhampton’s heritage.\n- Supporting Havant Rugby Club in Bedhampton as their Vice-President, and attending local community events including the Bedhampton Show.\n- Organising my annual Community Information Fair for the last 8 years, which helps Bedhampton residents find out about local activities and services available to them.\n- Launching my Tree Planting Challenge, supported by the Woodland Trust, which has encouraged Bedhampton residents to plant more trees to improve our environment.\nPhoto: Alan at Bedhampton Road.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_EmsworthSurgeryWork/content_31.html": "This page contains information in relation to Alan's work on the Emsworth Victoria Cottage Hospital. To get email updates on this issue please click here.\nUpdate 7 October 2021 - Local MP Alan Mak opens new Emsworth GP Surgery building\nLocal MP Alan Mak has officially opened the new Emsworth Medical Practice today (7 October 2021) after successfully campaigning to deliver a new surgery building since 2015.\nThe new surgery building has been built on the site of the former Emsworth Victoria College Hospital in the centre of the town. Alan secured £3.5million of Government funding from NHS England that has resulted in a new, well-equipped facility for local residents. The opening of the new surgery building represents the successful conclusion of a 6-year campaign led by Alan.\nAlan Mak MP said: “After working to deliver Emsworth’s new GP surgery since 2015 alongside the local community and healthcare partners, I’m delighted Government funding has now enabled the new medical centre to open. Our new surgery will be a great asset for the local community providing excellent healthcare for local residents in an easily accessible location”.\nThe opening comes after NHS Property Services put the Emsworth Victoria College Hospital for sale in 2018, after they deemed the site to be surplus to requirements for medical use. Alan intervened to stop the sale, enabling it to be used for the new GP surgery. He has worked closely with the surgery’s GPs and community groups to deliver the new surgery since then.\nSenior GP partner at Emsworth Medical Practice Dr. Abu Chinwala thanked Alan for his work and said: “Thank you to Alan for his input over 6 years and for helping to steer this massive project through many hurdles. This a great day for Emsworth to officially open this fantastic facility.”\nThe new building has been funded by the Government through an Estates, Technology and Transformation fund grant. It included demolishing single-storey outbuildings, providing a new rear single-storey extension to the main building, installing a new lift shaft, roofing and canopy construction, complete reconfiguration of rooms, and extensive internal and external decorations.\nUpdate 27 July 2021\nGreat news – the new Emsworth Medical Practice is now open! Since 2015, Alan has been working hard to deliver a new surgery for Emsworth, and his work has included:\n- Stopping the sale of the Victoria Cottage Hospital site;\n- Successfully lobbying for over £3M of funding from the Government for the new surgery building; and\n- Chairing local meetings in Emsworth to progress the project.\nAlan said: \"Thanks to the surgery’s doctors and staff, community groups, NHS bodies, the Department of Health & Social Care, and local residents over the last 6 years. The new Emsworth Medical Practice is an asset we can all be proud of!\"\nUpdate 9 January - Alan Mak MP writes to Emsworth Residents after new surgery gets the green light\nDear Emsworth Resident,\nI am writing with an important update on my work regarding the Emsworth Victoria Cottage Hospital (EVCH) and delivering a new NHS-funded GP Surgery for Emsworth’s residents.\nAfter campaigning on this issue since first being elected in 2015, I am pleased to say that approval has now been given by NHS England for the EVCH to become the site of the new Emsworth GP Surgery. This is the final green light for the project and the NHS South Eastern Hampshire Clinical Commissioning Group (CCG) have informed me that construction will begin at the end of this month, with a new Surgery expected to open around April 2021.\nThank you to Emsworth’s residents for the support you have given me during my Emsworth Surgery Campaign that I have led with community backing. I am grateful to the Emsworth Surgery’s doctors and management team, our local Emsworth councillors, and Emsworth’s many community groups and local residents who have worked with me and the NHS CCG since 2015. This positive news is a big success story for everyone across Emsworth – delivering new, modern local infrastructure for our community that provides better healthcare for local people.\nMy work has included organising and chairing a wide range of meetings each year to keep up the momentum on this project. In July & August 2018, I stopped the sale of the EVCH site by the NHS to ensure it could be used for a new GP Surgery. I then brought together key NHS and community stakeholders to make one final (and successful) attempt to finalise an action plan that everyone could agree on – this became the blueprint for delivering the new Surgery that will benefit Emsworth and its residents for years to come.\nI also met the Health Secretary and Health Ministers in Westminster to successfully lobby for the £4.4M investment from the NHS that will be needed – and I also successfully intervened to extend the deadline for the NHS funds to be used when this was needed to keep the project alive.\nIf you know other residents – friends, family, neighbours etc – who would like to receive e-mail updates on this issue as it progresses, please ask them to sign-up online by visiting my website at: www.AlanMak.org.uk/EmsworthSurgery\nYours sincerely,\nAlan Mak MP\nYour Local Member of Parliament\nUpdate 20 December - Emsworth Victoria Cottage Hospital named as preferred site for new surgery following campaign by MP Alan Mak\nThe Emsworth Victoria Cottage Hospital (EVCH) has been named as the preferred site for the town's new doctors surgery, following the campaign work of Local MP Alan Mak.\nDoctors, the local NHS and key Emsworth area stakeholders have agreed that moving into a refurbished building on the disused hospital site in the town centre is the best current solution to meet GPs’ needs.\nGPs want to move into a new and bigger surgery to provide a sustainable service in the future and meet the health needs of an expanding local population, as their existing site is cramped and could not cope with an increase in medical services or an expanding patient population.\nIt comes just six months after the EVCH was placed on the open market for sale, something that was stopped by Alan’s efforts.\nThat included writing to the NHS, demanding the site be removed from the market, meeting NHS bosses both in Westminster and Havant. He outlined that the key site shouldn’t have been placed for sale until the location of a new surgery was decided.\nAfter winning the argument with the NHS, Alan then organised a meeting for all the local stakeholders in September attended by the NHS Property Services (owners of the building), NHS CCG, Doctors, Havant Borough Council, local community representatives and local councillors where it was decided to try to explore the option of using the EVCH.\nHowever, a key stumbling block remained in place as the deadline for receiving funding was due to expire in October.\nTaking the cause to the top of Government, he met with the Health Secretary Matt Hancock and successfully lobbied to get the deadline extended to December, allowing the project to move forward.\nAlan Mak MP said: “Just six months ago the Emsworth Victoria Cottage Hospital was being placed on the open market for sale. I stopped the sale - and now the site is the preferred location for a modern doctors surgery that will serve the entire town. This excellent outcome is testament to all of the effort from the community in supporting the goals of my campaign. While we have achieved much in the last few months, there is still a way to go and I’ll be continuing my work to ensure that the NHS CCG, Doctors and Council work together to deliver this project for the benefit of Emsworth.”\nOver the last few months, the original nine potential options for a new location were whittled down to three, following a period of public engagement with patients and residents in Emsworth and Westbourne, where the surgery has a small branch.\nRefurbishing Emsworth Victoria Cottage Hospital (EVCH) is seen as having clear advantages for both GPs and the NHS.\nThese include having enough space for expansion, being within the financial budget available for capital spend as well as being the option most favoured by stakeholders and the local community.\nThere are still a number of risks that need to be managed and mitigated before the preferred option becomes a firm plan, amongst which are agreements over leasing arrangements with the current property owners as well as other financial and legal issues. These will be agreed in principle by the NHS South Eastern Hampshire Clinical Commissioning Group ahead of the formal business case submission to NHS England, who hold the capital funding.\nFollowing feedback from the local community, the business case will include the option of keeping the Westbourne Branch Surgery open to enable the GP practice to keep its presence in north Emsworth and prepare for a new housing development at Southleigh.\nOf the other ‘short list’ options, demolishing EVCH and building a new surgery on the site or moving to a new purpose-built building at Redlands Grange are not considered viable with the current time constraints and budget available.\nA business case for the preferred option has to be submitted to NHS England by December 21 to meet the deadline to apply for the £4.4m funding currently allocated to the scheme under the national Estates and Technology Transformation Fund (ETTF). ETTF money cannot be spent on land purchase and usually only funds two-thirds of the total project costs.\nThe next steps are that a business case will be submitted to NHS England on December 21 to give NHS England enough time to review the papers before its ETTF Review Panel meets in February 2019. The outline business case will need to be agreed by the CCG in January, 2019, as any additional costs would need to be funded by the organisation.\nUpdate 7 September - MP meeting delivers progress on Emsworth Victoria Cottage Hospital future\nProgress has been made on the future of the Emsworth Victoria Cottage Hospital after a “positive” meeting organised by local MP Alan Mak yesterday (Thursday 6 September).\nThe meeting at the Emsworth Baptist Church was attended by all of the key stakeholders including the NHS Clinical Commissioning Group, who decide if the site can be used for medical and health purposes; NHS Property Services, the owners of the building; the Emsworth Medical Practice; Havant Borough Council, local councillors and community group representatives from Emsworth.\nIt was decided that the doctors and the CCG will work together to come up with a fresh proposal to use the Victoria Cottage Hospital site and continue to engage with NHS England on funding. Emsworth United, which represents the towns community groups, have pledge support to the process.\nIt comes after the MP secured a key reversal by the NHS CCG, which meant that the site was taken off the market for sale while talks take place. Mr Mak had argued that until the future of the Emsworth Medical Practice is confirmed no sale should go ahead.\nWhile the site at Redlands Grange, north of the town centre, is still under consideration by the doctors, they have confirmed that they are now willing to reconsider the EVCH as the location for their new surgery building. At the meeting the CCG reiterated that they would not list the EVCH as surplus to requirements while negotiations over a potential move there are ongoing.\nMr Mak said he was pleased with the progress that was made at the meeting and plans to host another in the coming months to maintain momentum and check progress.\nHe said: “After much work by all of those involved, I am pleased that we have come to an agreement that there is potential for the Emsworth Victoria Cottage Hospital to be the site of the town’s new surgery. I organised this meeting to open a dialogue between the doctors, community and NHS, and agree a road map for the future, so I was delighted we achieved those aims. It was a very positive meeting, and we have taken a real positive step forward.\n“However, there is still a long way to go in this process, and it will only be successful if all of the stakeholders can keep aiming towards a common goal. I will continue to work hard to facilitate discussions and deliver this aim.”\nUpdate 22 August - Alan secures NHS reversal on Emsworth Victoria Cottage Hospital\nAlan has secured a reversal from the South Eastern Hampshire Clinical Commissioning Group (CCG) to halt the sale of the Emsworth Victoria Cottage Hospital (EVCH) site.\nThe MP had questioned the process that led the CCG to conclude that the EVCH site was surplus to medical requirements in a letter to Chief Executive Maggie MacIsaac. He argued that until the future of the Emsworth Medical Practice is confirmed no sale should go ahead.\nCurrently, doctors are in negotiations over a site at Redlands Grange, north of the town centre. However, they have confirmed that they are now willing to reconsider the EVCH as the location for their new surgery building.\nIn a letter sent to Mr Mak today (22 August, see below), the CCG confirmed that they would agree to his request and have written to the owners of the building, NHS Property Services, reversing their decision to declare the site as surplus for medical requirements. This legal step ensures that for the time being, the Victoria Cottage Hospital can only be considered for use as a medical site.\nAfter receiving the news from the CCG, Alan has also immediately written to NHS Property Services (see below) asking that they remove all marketing and sale-related promotional material as soon as possible.\nAlan Mak MP said: “Since I found out without notice four weeks ago that the Emsworth Victoria Cottage Hospital site was being listed for sale I have made this issue my number one priority, devoting much time and energy. I am delighted that my efforts have been successful, and the CCG have agreed to my request and have revered their decision to declare the site as surplus for medical use. While this is an important and early success, it is only the first step in the process – and I will look to secure more progress in the coming months.”\nAlan will now be hosting a closed roundtable meeting in early September to discuss plans for future use of the site with all of the key stakeholders.\nHe added: “I hope that my meeting will be a good opportunity to both bring together all the decision-makers, underlining to them the views of the community, and agree on a road-map for the way forward.”\nAttached to the bottom of this page is also Alan's statement to the public meeting taking place in Emsworth on 22 August.\nUpdate 11 August 2018 - Alan calls on NHS to take the Emsworth Victoria Cottage Hospital site off the market\nAlan does NOT support the sale of the Emsworth Victoria Cottage Hospital (EVCH) site without the community first having the opportunity to acquire it or the doctors at the Emsworth Medical Practice having another opportunity to re-locate there. Alan is working hard on this important local issue.\nFollowing a productive meeting with Emsworth community representatives, Alan has written to the South Eastern Hampshire NHS Clinical Commissioning Group (CCG) calling on them to reverse their decision that the EVCH site is surplus to requirements for medical use. See below (or bottom of the webpage for a PDF copy).\nAlan has also written to NHS Property Services (NHSPS) calling on them to take the EVCH site off the market, and remove the “for sale” signs and other marketing materials. See below (bottom of the webpage) for a PDF copy of Alan's letter.\nTo move things forward, Alan has also spoken again to the Emsworth Medical Practice, and senior officials from the CCG and NHSPS – they have all agreed to explore the possibility of re-locating the current Emsworth Medical Practice to a new building at the EVCH site if a business case and funding structure can be agreed by all parties.\nAlan will be hosting a roundtable meeting in September 2018 with the CCG, NHSPS, local councillors and other community representatives to agree a way forward.\nAlan will post further updates on this page of his website as they become available.\nUpdate 1 August 2018 - Response from NHS Property Services\nNHS Property Services have confirmed that the sales process for the EVCH will be frozen for six months if the community expresses an interest to buy the site through the Asset of Community Value (ACV) process under the Localism Act 2011.\nNHS Property Services have also agreed to attend a meeting I will be organising in Emsworth to listen to representatives from Emsworth community organisations and our local councillors. I will now contact all relevant parties to organise the meeting.\nSee the letter to me from NHS Property Services below\n-------------------------------------------------------------------------------------------------\nAlan's letter to the NHS Property Services regarding the proposed sale of the EVCH\nAlan has called on NHS Property Services to halt their sale of Emsworth's Victoria Cottage Hospital.\nHe said that he was not given advance notification that the sale process had started, and has responded immediately by writing to the Chief Executive of NHSPS calling for the sale process to be halted to allow community groups to engage with the process.\nAlan will be organising a roundtable meeting in Emsworth for NHS officials to meet community representatives, and will keep residents updated via his website. Full letter is below:",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_cdn-cgi_l_email-protection/content_57.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_BusinessFund/content_55.html": "Note: Applications for the Havant Business Support Fund are currently closed.\nA business fund launched by Havant MP Alan Mak in partnership with the Solent Local Enterprise Partnership (LEP) has resulted in almost half a million pounds worth of investment into the local economy. In total, the investment is forecast to secure 24 jobs at the three firms awarded funding.\nLaunched in December 2016, the Havant Business Support Fund has been backed by TV Dragon and entrepreneur Theo Paphitis.\nThe business personality relaunched the Fund for its second year in 2018 during a visit to Langstone Hotel on Hayling Island to meet with local business owners.\nHe said: “I was delighted to re-launch Alan’s hugely successful Havant Business Support Fund for its second consecutive year. I know from personal experience on Dragons’ Den how valuable funding is when starting or growing a business. Alan and the Solent LEP are working together to provide vital investment into the local area and I encourage anyone interested to apply.”\nThe money spent from the Fund so far has been used to invest into capital equipment such as machinery, with funding resulting in an additional investment of over £360,000 into supported projects.\nOne of the businesses that has benefitted from the funding is New Lane based manufacturer Straightpoint. A world leading exporter of industrial weighing equipment, Straightpoint has used the money to expand its site and purchase machinery which allows it to manufacture its products from start to finish.\nGrowing at 20 percent a year, the firm has taken on three new employees and an apprentice as a direct result of the investment.\nDavid Ayling, Straightpoint CEO, said: “The money we received from the Havant Business Support Fund was absolutely vital in helping us grow locally and create jobs. The new machinery has much improved our workflow and ability to calibrate our products to a great accuracy. This is vital as our product is used with cranes and lives depend on its accuracy.”\nHavant MP Alan Mak said: “Backing our local economy and helping residents is my top priority as MP, and Straightpoint’s new jobs and growth shows why I wanted to start the Business Support Fund. With a small amount of investment into new machinery the business has created new jobs, taken on more work, and delivers more wealth into our local economy. Having run my own business I know that often the only thing holding back a good idea is the right investment, which is where my Fund can help. In the second year of the Fund, I want more residents to apply so we can turn great ideas into reality.”\nEligible businesses can apply to the Solent LEP for between £10,000 and £75,000 from the Havant Business Support Fund to contribute towards projects that will unlock additional investment, improve business productivity and support local jobs.\nAnne-Marie Mountifield, the Chief Executive of the Solent Local Enterprise Partnership, said: “The Solent LEP has invested significantly in the Havant economy through the Solent Growth Deal in recent years, with £4.5m funding unlocking the development at Dunsbury Park, and close to £700,000 invested in the Havant SME business base to create jobs in the area. This includes more than £100,000 invested through the Havant Business Support Fund to date and we are looking forward to building on that initial success by supporting more Havant based SMEs and entrepreneurs in the coming year.”",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_local-mp-alan-mak-joins-coronation-street-party-hayling/content_13.html": "Local MP Alan Mak has joined a Coronation street party on Hayling Island to celebrate the Coronation of His Majesty King Charles III. The event was attended by local residents and featured a range of activities.\nDuring the event, Alan met local resident and party organiser Angela Hopkins, who has previously worked with the MP to raise funds for the Royal British Legion. Alan presented Angela with a Union flag as well as a bottle of House of Commons Champagne. He also took the time to wish everyone at the party well.\nLocal MP Alan Mak said: \"I was pleased to attend the Coronation street party on Bosmere Road, Hayling Island and join in with the celebrations. It was wonderful to see so many local residents coming together to mark this historic occasion.”",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_Ukraine/content_8.html": "Vladimir Putin’s unprovoked attack on Ukraine has rightly horrified the world. Alan stands with the Ukrainian people and their President, whose defiance, courage and patriotism in the face of aggression is inspiring.\nIn Parliament, Alan has backed the actions taken by our Government to lead the world in supporting Ukraine by both providing military aid and isolating Russia through the imposition of sanctions aimed at crippling its economy and war machine.\nLocally, he has helped Havant-based charity Stella’s Voice find a base in the Meridian Centre (pictured above) to use as a collection point for donations from residents. He has also visited their warehouse on New Lane to thank volunteers helping to pack goods for onward transport from Havant to the Moldova/Ukraine border.\nSupport for Ukraine from local residents has been outstanding. You can continue this support by donating to Stella’s Voice here or through the Government-backed Disasters Emergency Committee fundraising appeal here.\nHampshire County Council are the lead local authority for the Government's Homes for Ukraine Scheme. If you are a resident wishing to know more about the scheme please visit the County Council's website at www.hants.gov.uk/ukraine",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_local-mp-alan-mak-visits-stoke-fruit-farm-hayling-show-his-continued-support-fight-against/content_35.html": "Local MP Alan Mak has visited Stoke Fruit Farm on Hayling to show his continued support in the fight against Labour's Family Farm Tax.\nHe called in to see Sam Wilson, whose fourth-generation family business farms 350 acres across the north of the Island.\nThey and many thousands of other farms stand to be hit by the Labour Government's unfair new inheritance tax laws, on top of increases in employers' National Insurance contributions.\nLast November Sam, together with Mary Pike from Northney Farm on Hayling, was among farmers from across the country who gathered in Westminster to make their feelings known.\nMr Mak joined them at the Westminster protest and continues to argue against Labour's Family Farm Tax and Jobs Tax.\nSam runs Stoke Fruit Farm with his sister Nette Petley and their parents Simon and Ros Wilson. Crops grown on the farm include sweetcorn, peas, pumpkins and squashes for their farm shop and other outlets.\nThe farm also produces wheat and maize and has 3,500 free-range chickens providing freshly-laid eggs each morning to be sold in the farm shop.\nIn addition Sam has a sunflower field where people can visit during the summer to pick their own sunflowers.\nBut he and many other farmers now fear the impact of the Labour Government's Farm Tax on family-run agricultural businesses.\nSam said: \"Our family has farmed on Hayling for 100 years. We've seen numerous governments and have taken the rises and the falls. But at the moment with this Labour Government it seems they're really bashing farmers.\n\"With the inheritance tax, it's really important that we focus on the detrimental effect on agriculture as a business. I don't think the consequences have been thought through.\n\"For instance, our chicken house cost £100,000. If my father died, I would have to pay £20,000 in inheritance tax to keep it in the business. That doesn't work economically and that's a real worry.\"\nMr Mak said: \"I stood beside Sam and all our farmers at the protest in Westminster and I will keep on supporting them in their fight against this unfair tax.\n\"Our farmers play a very important role as stewards of our environment, growers of our food and small businesses in our communities.\n\"They are being targeted by the Labour Government for ideological reasons and this will have a devastating impact on farming, our food security and our food prices.\n\"I urge people to sign our petition against the Farm Tax at StopTheFarmTax.com.\"",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk/content_1.html": "As your local Member of Parliament, I work hard for our community all year round.\nSign up for my newsletter and follow me on Facebook to stay in touch.\nAn estimated 20,000 pensioners across our local area will lose up to £300 in support from this autumn. Sign Alan's petition to stop Labour's decision.\nSee activity from Alan in the constituency.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_EnvironmentForum/content_38.html": "The Hayling Island Environment Forum brings together key stakeholders and community representatives to discuss important environmental issues affecting Hayling Island and the surrounding area.\nThe first Hayling Island Environment Forum focussed on Langstone Harbour’s water quality and the prevention work by local authorities to manage coastal erosion.\nMr Mak said: “I created the Hayling Island Environment Forum to bring together all the key stakeholders to focus on preserving and improving Hayling’s much-loved coast and environment.\n“I’m committed to improving our environment, and I think that my forum can be an important vehicle to bring together stakeholders and the community to facilitate work to make Hayling Island and better place to live, work or visit. I look forward to organising more of these meetings in the future on a range of environmental issues.”\nMeeting attendees include representatives from Southern Water, Portsmouth Water, Havant Borough Council, Environment Agency, Natural England, Hampshire County Council, Eastern Solent Coastal Partnership, Langstone Harbour Board and Chichester Harbour Board. Community representatives included the Hayling Island Residents Association, North East Hayling Residents Association, Surfers Against Sewage, Save Our Island and local Hayling councillors.\nThe Hayling Island Environment Forum has now become part of the Southern Water Solent Regional Forum, which Alan also founded.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_news_local-mp-alan-mak-joins-hayling-police-patrol-support-local-bobby-scheme/content_32.html": "Local MP Alan Mak has been on patrol on Hayling Island to find out about the success of the Local Bobby Scheme which he supported.\nHe met up with PC Ed Mardell, the Designated Neighbourhood Officer for Hayling, and discussed the impact of the initiative since it was introduced at the beginning of 2024.\nThe Local Bobby Scheme ensures the public have access to a named and easily contactable police officer who is also a visible presence in the community.\nThe Scheme supports Mr Mak’s objective of ensuring the police deliver local policing and reflects Hampshire Police’s transformation into a geographical service to connect the public to the police.\nA total of 99 officers across Hampshire are part of the Local Bobby Scheme, with each one assigned to a different neighbourhood.\nPC Mardell, whose father was also a police officer in Hampshire, said calls could range from criminal damage and anti-social behaviour to the occasional burglary.\nHe explained: \"I'm really enjoying being the local bobby for Hayling. I like being able to stop and chat to people and I think being a visible presence and listening goes a long way.\n\"Generally speaking this is a very safe place to live, but I would encourage people to report any issues to me. Just pick up the phone and call me when I'm on duty.\"\nMr Mak said: \"I want our police to be visible and active in the community, so I called on Hampshire Police to implement the Local Bobby Scheme.\n\"It’s clearly having an impact on Hayling and it's great that PC Mardell is now a familiar face to the local community who they can get in touch with.\n\"I urge residents to get to know him and to not hesitate to contact him if they have any concerns about crime and anti-social behaviour in the area.\"\nTo find out who your Local Bobby is and how to contact them by phone or email, go to https://hampshirealert.co.uk/Content/AllLocalAreas and type in your postcode.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_EmsworthLibrary/content_21.html": "Photo caption: Alan with local councillors and Cllr Sean Woodward, HCC Cabinet member with responsibility for libraries\nThis page contains information in relation to Alan's successful work to keep Emsworth Library open.\nLocal MP Alan Mak has opened the newly relocated library for Emsworth at the Emsworth Community Centre after leading a successful campaign to keep it open.\nThe library has moved from its original site in the town centre to the Emsworth Community Centre on North Street after Hampshire County Council said it was due to close. Following a successful campaign by Mr Mak, the decision was made to move the library into the Community Centre. This enables the facility to retain its town centre location, as well as Hampshire County Council Services such as a full-time librarian.\nIn addition to these services being kept, the new space features a dedicated room for a new, larger children’s library, free Wi-Fi, remote printing, and a bookable public computer. The library also has a good selection of talking books and magazines, as well as stocking local newspapers.\nLocal MP Alan Mak said: “I’m delighted that the Emsworth Library has stayed open and moved to the Community Centre, where it is now well positioned to be used by more residents more than ever. I have been working hard to make sure this was possible after Hampshire County Council said the old library had to close, so I’m very pleased to see the County Council’s services retained here, along with new and modern facilities.”\nJill Millar of the Emsworth Residents Association said: “Thank you to Alan Mak for supporting the campaign to keep the library open, working with local councillors and the community. It’s fantastic to see the library open in a new building with a new children’s area- I’m looking forward to using it in the near future”.\nThe Emsworth Library can be accessed by residents for free at the Emsworth Community Centre. It is open from 9:30am to 5pm on Tuesdays, Thursdays and Fridays, and 9:30am to 1:30pm on Saturdays.\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nBelow is information documenting Alan's journey to keep Emsworth Library open:\nLocal MP Alan Mak and Emsworth councillors are urging residents to sign-up for their community campaign to keep Emsworth Library open.\nHampshire County Council (HCC) are currently consulting on the future of its Library Services around Hampshire, including Emsworth Library. HCC believe that Emsworth Library is under-used and the rent for the building that houses the Library is too high. Options for its future include reducing opening hours, greater community involvement in its operation, moving the Library to a cheaper site or complete closure.\nBoth Mr Mak and the Emsworth councillors have been in close contact with the HCC Cabinet member with responsibility for libraries, Cllr Sean Woodward, including organising a meeting to discuss the issue where they called on Cllr Woodward to keep the Library open.\nMr Mak said: “I want Emsworth Library to stay open, and I will be working with local councillors and the community to persuade Hampshire County Council to keep the Library even if it moves to a new location with cheaper rent. Libraries are about more than books – they are an important community hub. My meeting with Cllr Woodward was very constructive and I am pleased that Hampshire County Council is open to new solutions to provide library services in Emsworth.”\nMr Mak and the local councillors hope to find a solution that would involve a new town centre location but retaining services maintained by HCC on a daily basis, such as a full-time librarian. This would enable HCC to make substantial savings on rent and business rates.\nEmsworth Borough Councillor Lulu Bowerman said: “Emsworth councillors share residents’ concern and disappointment about the potential closure of our Library which is such an important facility for so many in our community. We will continue working with the local community groups, Ray Bolton our county councillor and Alan Mak MP to explore all options to maintain a County Council run library in our town.\"\nWhile the consultation is ongoing Mr Mak is also calling on residents to sign-up to his community campaign. You can do this by visiting AlanMak.org.uk/EmsworthLibrary. This will then be turned into a petition that can be presented to Cllr Woodward and other decision-makers at HCC.\nMr Mak added: “I’m asking Emsworth residents to sign-up for our Emsworth Library Campaign, helping me emphasise to Hampshire County Council that this is an subject important to many people in the community. I’ll also be sending out regular updates to those that sign-up.”\nHampshire County Councillor Ray Bolton said: “I also urge residents who care about the issue to use the Library so its usage figures rise and respond to the consultation. Currently the response to the consultation is lower from Emsworth than from other affected areas, so we need to make sure decision-makers know the strength of feeling in Emsworth.”\nCounty Councillor Bolton also asked Cllr Woodward at a Main County Council meeting on 13 February, to confirm that no decisions have been taken in relation to Libraries and that there are many options for consideration as to their future operation. Cllr Woodward in his answer, provided this confirmation to all the County Councillors.",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_Tree/content_50.html": "The Challenge is currently paused for the General Election etc.\nInspired by Her Late Majesty’s Queen’s Green Canopy project, I have launched a new campaign across the Havant Constituency to get more trees planted in our area. This will improve our local environment and quality of life.\nI hope that together we can plant 1,000 trees in the Havant Constituency.\nBackground\nSupported by the Woodland Trust, the UK's largest woodland conservation charity, my Havant Constituency Tree Planting Challenge calls on residents, schools, businesses, community groups, voluntary organisations and anyone with an interest in the environment to plant trees locally. I hope that together we can plant at least 10,000 trees.\nMy Havant Constituency Tree Planting Challenge was officially launched by the planting of a willow tree near the Station Theatre on Hayling Island by me and Sir Nicholas Bacon. Sir Nicholas is Chairman of The Queen's Green Canopy, President Emeritus of the Royal Horticultural Society and a well-known and respected environmental champion. We were joined by Hayling Island’s County Councillor Lance Quantrill and a senior representative from the Woodland Trust.\nWoodland Trust senior project lead Steve Shill said: “Over the past year, communities all over the UK have really felt the impact of climate change first hand, and many are seeing the incredible benefits trees can bring to provide much needed shade, shelter, and help to prevent flooding. Last year alone The Woodland Trust gave away 1.3 million trees to schools and community groups and this year we want to give away even more.”\nHow to take part\nThere are 3 steps you need to take:\n1. GET YOUR TREES/SAPLINGS\nCommunity groups and schools\nThe Woodland Trust are supplying free tree packs to community groups who want to get involved and support people, nature and the climate in our area. You are eligible to apply for these free saplings if you are:\n- A school, nursery, college, university, or other outdoor leaning group; or\n- An established local body, club or society. This includes residents’ associations, sports club, scouts and guides.\nYou can also set up a new group for the purpose of planting trees, but it must be a not-for-profit group.\nFor further details about obtaining free tree packs from The Woodland Trust, please see this webpage.\nThe Woodland Trust decide whether they will issue a tree pack, and their decision is final. Alan Mak MP does not have any role in deciding.\nIndividuals and families\nIf you want to plant trees as an individual or do not belong to any of the above mentioned groups, you can still take part – but you will have to pay for your trees/saplings.\nYou can buy saplings from the Woodland Trust's online shop (here) or local garden centres at relatively low cost. Alan Mak MP is not able to provide any trees/saplings and is not involved with the sale of saplings by the Woodland Trust or their website contents.\nWhen selecting tree varieties, the Woodland Trust recommends thinking about the size of a tree in relation to where you’re planting and take a look at the species that thrive in that area. If planting a number of trees, you may consider a mix to ensure resilience to weather, pests and diseases.\nThe Woodland Trust website has advice about which trees work for different spaces, e.g. for small gardens they suggest wild cherry, silver birch, or rowan.\nAll trees on the Woodland Trust shop are certified as being sourced and grown in the UK & Ireland. This helps protect the UK from imported pests and diseases. Find out more information on why this is important here. When buying from local garden centres, ask whether trees have been sourced and grown in the UK.\n2. PLANT YOUR TREES/SAPLINGS\nYou as an individual – or your planting group – are solely responsible for the planting and upkeep of your trees/saplings. For the best chances of success and survival, plant your saplings in the early autumn or late winter/spring. You need to provide you own tools and related materials. Neither Alan Mak MP nor the Woodland Trust can provide tools or related materials.\nThe best time of year to plant your seedlings is November to March inclusive.\n- If you have bought your own seedlings – you can plant them wherever you want as long as you have landowner and other relevant legal permissions.\n- If the Woodland Trust supplied your seedlings – they must be planted somewhere public. Applications for seedlings from The Woodland Trust where the planting site identified is private land are unlikely to be awarded, unless there is good genuine public access to the site. For schools, trees are expected to be planted in the school grounds.\n3. LET ALAN KNOW — ADD YOUR TREES TO OUR AREA’S TOTAL\nOnce you have planted your trees, you can add them to the Havant Constituency’s total by completing this online form: www.AlanMak.org.uk/Contact\nPlease ensure you tell Alan the following information:\n- How many seedlings/trees you planted\n- What type/species of seedling\n- The location (ideally with street name etc. to enable us to visit the site if we need to)\n- Who planted them\nPlease also email us a photo of you planting the seedling/tree. Send photos to: [email protected]\nWe will add your trees to our running total and local map – and the online counter on Alan’s website!\nThanks for your support and involvement! Let’s get planting!",
  "https_www_alanmak_org_uk_/https_www_alanmak_org_uk_PrivacyNotice/content_44.html": "This relates to Alan's time as our MP, before Parliament was dissolved.\nThis privacy notice relates to the personal data processed by the Office of Alan Mak, Member of Parliament for Havant, in relation to casework and policy queries. This allows our office to comply with GDPR.\nWho is the Data Controller?\nThe Data Controller is Alan Mak, Member of Parliament for Havant.\nWhat does the Office do?\nThe office discharges the duties and functions of an elected Member of Parliament. As part of this work, we conduct constituency casework and respond to policy queries, for which we must process personal data of our constituents. We also manage a small, non-political mailing list for the purpose of sending Alan’s E-Newsletter and information about upcoming advice surgeries.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent.\nWe are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted Alan about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures.\nWe will not share the personal information of members of the Alan Mak Mailing List or those in receipt of our E-Newsletter.\nIn any case, we will not use your personal data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nUnless specifically requested by you, our office will hold data in accordance with our data retention policy.\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Therefore, we feel it is reasonable for an elected representative to hold personal data.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n- Right of access – you have the right to request a copy of the information that we hold about you.\n- Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete.\n- Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n- Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n- Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n- Right to object – you have the right to object to certain types of processing, such as direct marketing.\n- Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n- Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone. Contact details can be found here.\nPlease note that we will ask for identification should you choose to exercise any of the above rights in relation to personal data we hold."
}