{
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_plastic-pollution/content_36.html": "The Resources and Waste Strategy for England sets out the Government’s plans to reduce, reuse, and recycle more plastic and Ministers have committed to work towards all plastic packaging on the market being recyclable or reusable by 2025.\nSignificant progress has already been made to address plastic pollution, including a ban on microbeads and restricting the supply of plastic straws, plastic drink stirrers, and plastic-stemmed cotton buds. The use of single-use carrier bags in supermarkets has reduced by over 98 per cent.\nFurther, restrictions on a range of single-use plastics, including plastic plates, trays, bowls, cutlery, balloon sticks and certain types of polystyrene cups and food containers have now come into force. I understand that England uses 2.7 billion items of single-use cutlery and over 700 million single-use plates per year, but only 10 per cent are recycled. This new ban is the next step in cracking down on harmful plastic waste.\nThrough the Environment Act 2021, the Government has set a target is to halve residual waste by 2042. This refers to waste that is sent to landfill, put through incineration, or used in energy recovery in the UK or overseas. This is an intentionally broad target, which will include the most environmentally harmful materials like plastics, rather than banning a single type of material and risk producers moving to a different, more harmful material.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_support-night-time-economy/content_12.html": "I fully recognise the importance of the night-time economy and have been reassured that the Government continues to support this industry as well as the wider hospitality sector.\nAt Autumn Statement 2023, the Government announced a business rates support package worth £4.3 billion over five years to support small businesses and the high street. The small business multiplier will be frozen for a fourth consecutive year, and Retail, Hospitality and Leisure relief will be extended, ensuring the most vulnerable businesses continue to be supported. A third of properties in England have already been taken out of rates completely through Small Business Rates Relief.\nThe Government is also making full expensing permanent, representing the largest business tax cut in modern British history. This means the UK will have not just the lowest headline corporation tax rate in the G7 but also its most generous capital allowances.\nThese measures are in addition to the Energy Bill Relief Scheme, which provided £7.4 billion to businesses; the Energy Bills Discount Scheme, which provides a baseline discount on energy bills until the end of March 2024; the increased Employment Allowance of £5,000, which takes the smallest 40 per cent of businesses out of paying any National Insurance at all; and setting the Annual Investment Allowance at £1 million permanently.\nI believe this is a comprehensive package of support which is helping protect businesses such as pubs, cafes, and nightclubs.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_voter-identification/content_16.html": "A secure electoral system is vital to a healthy democracy, and the public must have confidence that our elections are secure and fit for the 21st century. I believe asking voters to bring photographic identification to their polling station is an important way of achieving this.\nIdentification to vote has been backed by the Electoral Commission and the Organisation for Security and Co-operation in Europe’s Office for Democratic Institutions and Human Rights, which state that its absence is a security risk. Without a requirement for identification at the polling station, it is harder to take out a library book or collect a parcel at a post office than it is to vote in someone else’s name.\nIn Northern Ireland voters have been required to produce personal identification before voting in polling stations since 1985, with photographic identification introduced in 2003 by the last Labour Government. Ministers at the time noted that “the Government have no intention of taking away people’s democratic right to vote. If we believed that thousands of voters would not be able to vote because of this measure, we would not be introducing it at this time.” I believe it is absolutely right that the Government stamps out the potential for voter fraud and brings the rest of the UK in line with Northern Ireland.\nShowing identification to prove who they are is something people of all walks of life already do every day. A wide range of photographic identification documents will be accepted at the polling station, and the Voter Authority Certificate was created so that anyone without identification can apply for a free new one from their local authority. I have been assured that the Government will continue to raise awareness of the Voter Authority Certificate.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_map-locations/content_25.html": "My map\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_campaigns_my-priorities-south-leicestershire/content_57.html": "- Boosting our healthy Leicestershire economy still further by promoting our local shops, post offices and public houses in our villages and towns as community assets and partnering with businesses to offer more apprenticeships to younger people.\n- Supporting our local NHS and working with doctors, nurses and health care staff to ensure a full range of health services are available for local Leicestershire residents including better services for dementia patients, carers and family.\n- Championing our local schools and colleges and backing our incredible teachers and education staff to ensure that every child is given the chance to excel and succeed in life.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_icj-and-unrwa/content_4.html": "The Government wants to see an end to the fighting in Gaza as soon as possible and is calling for an immediate pause to get aid in and hostages out, then progress towards a sustainable, permanent ceasefire, without a return to destruction, fighting and loss of life.\nI agree with the UK Government that South Africa’s case at the ICJ is not helping to achieve the goal of a sustainable ceasefire. Israel has the right to defend itself against Hamas in line with international humanitarian law (IHL) as the UK Government has made clear from the outset. I share the Government’s view that Israel’s actions in Gaza cannot be described as genocide, and believed South Africa’s decision to bring the case was wrong and provocative.\nOf course, I respect the role and independence of the ICJ. I welcome the court’s call for the immediate release of hostages and the need to get more aid into Gaza.\nOn UNRWA, I am appalled by allegations that any agency staff were involved in the 7 October attack against Israel, a heinous act of terrorism. I support the UK's decision to pause any future funding of UNRWA whilst these concerning allegations are reviewed. The United States, Germany, Australia, Italy, Canada, Finland, Switzerland and the Netherlands have all temporarily paused funding too.\nI want to make clear that the UK remains committed to getting humanitarian aid to the people in Gaza who desperately need it. The Government is getting on with aid delivery, funding multiple implementing partners including other UN agencies and international and UK NGOs. This support is helping people in Gaza get food, water, shelter and medicines.\nThe commitment to trebling aid to Gaza still stands and the UK is providing £60 million in humanitarian assistance to support partners including the British Red Cross, UNICEF, the UN World Food Programme and Egyptian Red Crescent Society to respond to critical food, fuel, water, health, shelter and security needs in Gaza.\nIndeed, the UK will continue to support the United Nations World Food Programme to deliver a new humanitarian land corridor from Jordan into Gaza. 750 tonnes of life-saving food aid arrived in the first delivery and 315 tonnes in the second delivery.\nFinally, the Government regularly reviews Israel’s capability and commitment to IHL and acts in accordance with that advice, for example when considering export licences.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_fossil-fuels-and-political-lobbying/content_9.html": "Policies pursued by the government and opposition parties should be grounded in reality and take into account the needs of businesses, charities, and think tanks. Access to legislators, however, should not be abused. Fairness and transparency must be the keystone of the system.\nThe Government has taken unprecedented measures to improve transparency since 2010. For example, last year, it outlined wide-ranging improvements in the \"Strengthening Ethics and Integrity in Central Government\" policy statement of July 2023. These include revising guidance to broaden the range of lobbying engagements declared by departments and linked reforms to the consultant lobbying framework. These measures will ensure that all lobbying activity, irrespective of which sector is being represented, will be conducted openly and in accordance with the principles expected of those in public life.\nAlso, from January 2024 onwards, meetings held between ministers and consultant lobbyists will be declared through routine quarterly transparency. This will also apply to those senior officials who are subject to meeting declarations. New transparency guidance was published in December 2023, detailing stricter minimum standards for meeting descriptions to ensure that declarations contain relevant, constructive information.\nFurthermore, the Office of the Registrar of Consultant Lobbyists (ORCL) was established under new legislation passed in 2014. The role of the ORCL is to keep and maintain a register of lobbyists and ensure that there is transparency in the work of those engaging with government ministers and senior civil servants. Lobbyists are required to declare and publish a list of their clients, and this information is made available online.\nUltimately, I believe it is reasonable for the Secretary of State and ministers for the Department of Energy Security and Net Zero to meet a wide range of stakeholders to discuss issues relating to energy security and net zero. Naturally, that will include oil and gas companies.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news/content_13.html": "Alberto Visits Local Hair Salon as Hairdressers Hit Hard by Chancellor's Tax Hikes Wednesday, 9 April, 2025 Alberto has visited a long-standing Blaby hair salon to meet with salon owner Sue Davis and discuss the mounting pressure being placed on the hairdressing industry by the Chancellor’s latest tax reforms. Local News\nAlberto Welcomes Significant Funding for Stoney Stanton Flood Alleviation Scheme 3rd April 2025 Alberto welcomes the news that the Stoney Staton Flood Alleviation Scheme has received significant funding boost. Local News\nAlberto asks Prime Minister if he agrees with sentencing for violent rapists like Colin Pitchfork 2nd April 2025 Alberto asked Prime Minister about Colin Pitchfork in Prime Ministers Questions today. The convicted double child rapist and murderer, responsible for the... Local News\nAlberto raises issue of Brain Tumour Research with Prime Minister 19th March 2025 Alberto raised the issue of the lack of funding into Brain Tumour Research. Alberto spoke at Prime Ministers Questions on the need for more research to be... Local News\nAlberto delighted with government’s decision to reject controversial rail hub plans 10th March 2025 Alberto Costa, MP for South Leicestershire and Dr Luke Evans, MP for Hinckley and Bosworth, have welcomed the government’s decision to reject plans for... Local News\nAlberto secures parliamentary debate on local government misconduct, bullying, and standards 10th March 2025 Alberto has successfully secured a debate in Parliament on bullying, harassment and standards at local government level. The debate, titled “The Effectiveness... Local News\nAlberto Launches Short Story Competition for Primary School Pupils on World Book Day 7th March 2025 On World Book Day, South Leicestershire MP, Alberto Costa, launched a Short Story Competition for primary school children across the constituency, to encourage... Local News\nAlberto calls for end to awful ‘fleecehold’ system 3rd March 2025 Alberto has called for immediate reform in the land management and property management sectors following mounting complaints from constituents. The concerns... Local News\nMicroplastic Washing Machine Filters: Cross-Party support for new law as Women’s Institute and MPs sign letter to Government 30th January 2025 This week, the All-Party Parliamentary Group (APPG) on Microplastics, the Women’s Institute (WI), and a cross-party group of MPs and peers called on the... Local News\nAlberto Calls for Urgent Action on Flooding in South Leicestershire 16th January 2025 Alberto has called on Emma Hardy, Labour's Minister for Flood Management, to address the severe flooding that has significantly impacted communities and... Local News",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_business-and-human-rights/content_11.html": "The UK was the first country to create a National Action Plan to implement the UN’s Guiding Principles on Business and Human Rights (UNGPs), widely regarded as the authoritative international framework to steer practical action by governments and businesses worldwide on this important and pressing agenda.\nThis plan sets out what is expected in regard to the conduct of UK businesses, including compliance with relevant laws and respect for human rights; treating the risk of causing human rights abuses as a legal compliance issue; adopting appropriate due diligence policies; and consulting those who could potentially be affected. The UK expects all UK businesses to respect human rights throughout their operations, in line with the UNGPs, including in regard to their supply chains.\nThe UK's Presidency of the G7 in 2021 and the resulting commitments from G7 members to tackle forced labour in global supply chains clearly demonstrates our country's commitment to ending modern slavery. I will encourage Ministers to continue these efforts going forward.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_campaigns_south-leicestershire-local-quality-life-survey-share-your-views-alberto-costa/content_19.html": "I am passionate about our villages and want to ensure that rural South Leicestershire remains a wonderful place to live. My local priorities already include making our roads safer and quieter, helping communities oppose unsustainable over-development, better policing for our rural areas, faster and more reliable broadband and doing all I can to keep our local high streets thriving. Your views matter to me so please tell me what would make our South Leicestershire communities even more special for you.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_nhs-digital-and-patient-data/content_17.html": "Technology is playing a central role in realising the NHS Long Term Plan, helping clinicians use the full range of their skills, reducing bureaucracy, stimulating research, and enabling service transformation. Technology allows people to have more control over the care they receive and more support to manage their health, to keep themselves well and better manage their conditions, while assisting carers in their vital work.\nThe Government is committed to advance the use of digital technology in health and social care while maintaining the highest standards of privacy and ethics.\nNHS Digital functions legally transferred to NHS England on 1 February 2023. NHS England is consequently responsible for ensuring it meets its obligations to protect people’s data. Data protection law will continue to apply. This means there must always be a valid, lawful basis for the collection and processing of personal information including special category information within federated data platforms and any other NHS England IT system, as defined under data protection legislation. Data protection impact assessments must be carried out and privacy notices published which explain what data is collected, analysed and shared and for what purposes.\nIn May, the Department of Health and Social Care published its guidance that sets out how NHS England will protect patient data, following the transfer of NHS Digital’s responsibilities. The guidance is available here: https://www.gov.uk/government/publications/nhs-englands-protection-of-p… is also legally required to report annually to Parliament on how well it has discharged its data functions. NHS England also makes an annual Data Security and Protection submission which demonstrates how they meet data protection obligations.\nI would like to reassure you that I have noted concerns over media reports about the awarding of contracts for the proposed Federated Data Platform (FDP), a new data tool to connect and integrate patient and other data sources from across the health system. The FDP will be procured via open competition, in line with Public Contracts Regulations 2015. The procurement process is open to all suppliers and will abide by the core principles of the 2015 Regulations, including transparency, non-discrimination, equal treatment and proportionality. These principles apply to all suppliers bidding for the FDP. The contract notice and standard selection questionnaire was published on 10 January, and stage 2 of the procurement was launched on 21 February.\nNHS England is committed to transparency on the way data is used within the FDP to ensure that patients are informed of the choice to opt out, where applicable and how to do so. It is also committed to publishing information on who is accessing data and for what purpose. There must always be a valid lawful basis for the collection and processing of personal information, with transparency about the use of data within the FDP, as defined under the applicable legislation.\nThe Government published its strategy Data Saves Lives: Reshaping Health and Social Care with Data in June last year. This set out how digital capabilities will enable health and social care to be delivered in a much faster and more effective way, and with a greater emphasis on personalised care. This strategy is supported by the Government’s Plan for Digital Health and Social Care which outlined a £2 billion investment to digitise the NHS and at least £150 million to support digital transformation in social care.\nThe Government is also enabling frontline clinicians to deliver care efficiently, effectively and safely through Electronic Patient Record (EPR) systems. By December 2023, 90 per cent of NHS trusts should have EPRs in place and 100 per cent by March 2025. In September 2022, the Government published its Our Plan for Patients strategy. This committed to using joined-up data and digital tools to increase patient choice and operational productivity. It also committed to freeing-up time to allow carers to care by using IT to reduce bureaucracy.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_fuel-duty-and-prices/content_32.html": "To support people with the cost of living, the Government is maintaining the rates of fuel duty at the current levels for a further 12 months by extending the temporary 5p cut and cancelling the planned increase in line with inflation, saving the average car driver £50 in 2024-25. This freeze represents a tax cut worth over £3.1 billion.\nThis support is being maintained at a time when many other European countries have ended their fuel duty cuts: it represents around £13 billion of support over the three years from the cut being introduced.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_diabetes-0/content_26.html": "Diabetes is a leading cause of premature mortality, doubling an individual's risk of cardiovascular disease. It costs over £10 billion every year to manage and results in over 22,000 additional deaths each year. That is why I believe it is important that high quality diabetes care is available.\nA total £5 million was provided in 2021/22 in a national recovery fund to support the recovery of routine diabetes care through innovative projects. The programme approved 28 projects with delivery in 2022/23. A further £75 million of funding is also being allocated between 2020/21 and 2023/24 for the treatment and care of people living with diabetes. NHS England continues to work to identify and develop plans to address gaps in the provision of services.\nThe Government also supports work to prevent the development of diabetes. The NHS Diabetes Prevention Programme operates to identify people who are at high risk of developing type 2 diabetes and refers them onto a nine-month, evidence-based lifestyle change programme. Latest figures in February 2023 shows a 20 per cent reduction in risk for those who are referred to the programme compared to those who are not.\nFinally, the Government has announced its intention to develop and publish a Major Conditions Strategy. The strategy will set out a strong and coherent policy agenda that sets out a shift to integrated, whole-person care. Interventions set out in the strategy will aim to alleviate pressure on the health system, as well as support the Government’s objective to increase healthy life expectancy and reduce ill-health related labour market inactivity. Diabetes is one of the six major conditions included in the strategy.\nOn 17 May, the Government launched its call for evidence for the Major Conditions Strategy which ran until 27 June. The Government is analysing responses and will respond shortly.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_puppy-smuggling-0/content_43.html": "I would like to assure constituents that Ministers are committed to cracking down on puppy smuggling and will ban the imports of young or heavily pregnant dogs, as well as dogs with mutilations, such as cropped ears or docked tails. Applying strengthened penalties will send a clear message that animal cruelty will not be tolerated and will enable our courts to take a firmer approach to cases where pets are illegally imported. I understand that the Government plans to take forward legislative measures to tackle puppy smuggling as soon as parliamentary time allows.\nThe UK has one of the most rigorous pet travel border checking regimes in the world and I am aware that every dog travelling into Great Britain on approved routes has its microchip and paperwork checked to make sure they are all properly vaccinated and are old enough to travel. In addition, the Department for Environment, Food and Rural Affairs (Defra) consulted on proposed changes to the commercial and non-commercial movements of pets into Great Britain. Defra has been carefully reviewing feedback from this consultation, and I look forward to reading a summary in due course.\nFurther, Ministers have taken action to tackle the practice of puppy farming. Following the introduction of Lucy’s Law in 2020, everyone must now buy directly from breeders or consider adopting from rescue centres, which is a major step in stopping the illegal pet trade. If an individual sells puppies or kittens without a licence, they could receive an unlimited fine or be sent to prison for up to six months.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_contact/content_2.html": "My office welcomes correspondence expressing your views. We respect those who have passionately held views. However, you will equally understand that we should all have the right to a working environment free from abuse. My office has a zero tolerance approach to abusive, aggressive or offensive correspondence – any such correspondence may be, if necessary, forwarded to the police. You will, I am sure agree, that correspondence of this nature is entirely unnecessary. All of us have the right to be treated with respect so please do keep this in mind before contacting my office.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_fairness-farming-sector/content_48.html": "I am assured that the Government wants all farmers to receive a fair price for their products and is committed to tackling cases of contractual unfairness in the agri-food supply chain. Ministers recognise that some poor practices affect producers across several agricultural sectors and have been taking action to address them, but do not believe that amending the code is the most appropriate way to do so.\nI am aware that the Groceries Code was put in place following a detailed market investigation by the Competition Commission in 2008 that found that suppliers of groceries to large supermarkets faced unfair risk that adversely affected competition. For producers that supply directly to the 14 largest retailers designated by the Competition and Markets Authority, the code already covers the issues raised in the petition.\nThe code is enforced by the Groceries Code Adjudicator (GCA). The most recent review was published in July 2023 and found that the Groceries Code Adjudicator continued to be an effective regulator. However, Ministers are aware that there are some areas not covered by the GCA, and the code does not always reflect the farmers’ indirect relationship with supermarkets.\nIn 2016, the Department for Environment, Food and Rural Affairs (Defra) highlighted its intention to target further interventions on a sector-by-sector basis. Defra took powers in the Agriculture Act to enable the introduction of statutory codes of contractual practice to protect farmers, which will apply to any business purchasing agricultural products directly from farmers. They will provide greater certainty for farmers by ensuring that clear terms and conditions are set out in contracts. Defra intends to tailor the powers to those sectors that need them, acknowledging that the problems experienced by each sector differ. Ministers recognise the need to avoid introducing broad regulation that places burdens on sectors that may not require intervention.\nI understand that the first review, in the dairy sector, was carried out in 2020, which as followed by a review of the pig supply chain in 2022. Last year, two reviews into the egg and fresh produce supply chains were launched. I look forward to reading the responses to these reviews in due course.\nI am assured that Defra will use the powers in the Agriculture Act to introduce legislation wherever it is necessary. I know that Ministers want to continue to tackle the unfair practices that still exist by working across the sector to see a thriving retail sector that keeps our supermarket shelves filled and also protects our fantastic farmers and the food that they produce.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_campaigns_delivering-better-future/content_39.html": "Without a doubt, one of the most enjoyable aspects of my role as Member of Parliament is visiting the fantastic businesses, schools and charities we have in South Leicestershire.\nI always find it incredibly beneficial to visit the vast array of organisations in South Leicestershire, to speak to business owners, employees, teachers and volunteers to hear of their experiences and of course to try and assist in any problems or issues they might have.\nI am always open to visiting new organisations or schools in the constituency, so please do feel free to contact my office at your convenience.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_cost-living-pay-rises-and-ps15hour-minimum-wage/content_29.html": "As of April 2023, millions of workers are benefitting from record increases to the National Minimum Wage and National Living Wage (NLW). The NLW, which this Government introduced in 2016, rose by 9.7 per cent to £10.42 an hour. These increases follow recommendations made to the Government by the independent Low Pay Commission in autumn 2022.\nMoreover, I strongly welcome that the Government has accepted the recommendations of the independent Pay Review Bodies in full, providing public sector workers with a consolidated wage increase of at least 6 per cent. The Government’s plan to deliver these pay rises is fully costed and will not mean reductions in frontline services. This is a fair deal that recognises the anxiety caused by cost-of-living pressures, supports recruitment and retention, and delivers one of the highest settlements in three decades.\nThe deal is also fiscally responsible, delivering pay rises that are broadly in line with the private sector. It would be neither fair nor affordable to meet unsustainable demands for pay rises well into double digits. To do so would be fiscally irresponsible, increasing national debt, passing the buck to future generations, weakening the foundations of our economy, and further fuelling inflation. I welcome that getting inflation down - the best tax cut there is - remains a top priority for the Prime Minister.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_alberto-asks-prime-minister-if-he-agrees-sentencing-violent-rapists-colin-pitchfork/content_33.html": "Alberto asked Prime Minister about Colin Pitchfork in Prime Ministers Questions today. The convicted double child rapist and murderer, responsible for the brutal rape and murder of two young women, is now facing his fifth parole hearing, prompting renewed debate over justice and public safety.\nIn a pointed question to the Prime Minister, Alberto said:\n“Double child rapist and murderer Colin Pitchfork is up for parole for the fifth time. Now, I know the Prime Minister doesn’t have any direct control, nor should he, over the Parole Board, but he does have a view, as I’ve asked all his predecessors. I now put the question to him: Does he agree with me that men who brutally rape and strangle to death young women should, as a matter of principle, spend most of their natural life in prison?”\nOn 28th March 2025 a fact-finding hearing took take place in relation to more recent allegations against Pitchfork and on 15th and 16th May 2025 a subsequent oral hearing will consider all evidence related to Pitchfork’s potential risks, including, if the recent allegations are proven, the relevant evidence.\nThe Prime Minister’s response to Mr Costa’s question: “I’ve seen many of these cases for myself firsthand when I was a prosecutor for five years, working with the police on really terrible cases, and know the impact that it has on victims. I thank him for raising it.”\nMr Costa has campaigned tirelessly to keep Colin Pitchfork behind bars due to the appalling nature of his crimes and the lasting impact it has had on his constituents. He has also questioned the legal framework - the Reconsideration Mechanism - which, at present, allows for an endless cycle of appeals to be mounted by Prisoner and Secretary of State without proper closure.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_cdn-cgi_l_email-protection/content_42.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_pip-consultation/content_10.html": "The Government is committed to redesigning the disability benefits system to ensure it is fair and compassionate, but also sustainable and fit for the future.\nAs you may know, many more working-age people are being awarded PIP for mental health conditions than when it was first introduced a decade ago. For example, there are 33,000 new monthly awards for PIP compared to the pre-pandemic level of 17,000.\nFurthermore, since PIP’s introduction, the nature of disability and ill health has changed profoundly. It is clear that with almost a quarter of the adult population reporting a disability in 2024, the Government believes a new conversation is needed about how the benefit system can best support people to live full and independent lives.\nTo address these issues, on 19 April, the Prime Minister set out his ambition to redesign the disability benefits system to ensure that support is more accurately targeted toward those who need it most.\nI am pleased that the Government is working hard to find ways of modernising the system, especially for those with the most severe disabilities and health conditions. This is why the Department for Work and Pensions is inviting a range of views from those affected on how to modernise support, including by looking at financial support being better targeted at people who have specific extra costs. It could also involve improved support of other kinds, such as physical or mental health treatment, leading to better outcomes.\nThese changes will aim to ensure that the support is better targeted towards individual needs and more closely linked to a person’s condition rather than the current “one size fits all” approach.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_live-animal-exports-0/content_15.html": "The UK has some of the highest animal welfare standards in the world which the Government continues to strengthen further.\nMy ministerial colleagues and I recognise that long journey times for slaughter and fattening pose welfare risks including stress, exhaustion and injury. I understand that the shortest direct to slaughter export journey from Great Britain to continental Europe in 2018 was a journey time of 18 hours. Most domestic journeys to slaughter in the UK are significantly shorter. In 2020, the Government carried out a consultation on ending live animal exports, and 87 per cent of respondents agreed that livestock and horses should not be exported for slaughter and fattening.\nNow that the UK is no longer in the European Union, the Government can end live animal exports, further strengthening animal welfare protections. The Animal Welfare (Livestock Exports) Bill delivers the Government’s manifesto commitment by banning the live export of cattle, sheep, goats, pigs and horses for slaughter and fattening. It will prevent unnecessary long export journeys, instead using shorter and less stressful domestic journeys. The Bill will ensure that animals are slaughtered domestically, in high welfare UK slaughterhouses and preventing the export to unknown and likely lower welfare slaughterhouse conditions. These new rules will still allow live animal exports in other circumstances, for example for breeding and competitions, provided they are transported in line with legal requirements aimed at protecting their welfare.\nWhile no animals have been exported for slaughter from Great Britain since the Government announced its intention to bring forward a ban in 2021, I know that this Bill makes this permanent. I am assured that this legislation reinforces the UK’s position as a world leader on animal welfare, boosting the value of British meat and helping to grow the economy.\nI welcome that this Bill recently completed all stages in the House of Commons and has now progressed to the House of Lords.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_local-government-funding-0/content_3.html": "Let me start by saying that I fully recognise the important and tireless efforts undertaken by local councils. They have a vital role in delivering essential public services and building stronger communities right across the country.\nThe Government has listened to councils about the pressures they are facing, including as a result of high inflation driven by the legacy of the pandemic and global instability. Ministers have recently announced an additional £600 million for local authorities, which includes £500 million to bolster social care budgets. The funding will also ensure all authorities see a minimum increase in Core Spending Power of four per cent - up from three per cent as previously announced - before taking local decisions on council tax. I am encouraged that the Government's work to halve inflation, grow the economy and reduce debt has meant it can now provide this extra funding to councils to continue providing vital services.\nThis funding builds on the more than £64 billion package already announced at the provisional Local Government Finance Settlement for 2024-25. Taken together, this means over £64.7 billion will be available to local authorities in 2024-25 - an above-inflation increase of up to £4.5 billion, or 7.5 per cent in cash terms.\nBeyond the annual Local Government Finance Settlement, local authorities receive a wide range of funding from government departments to reflect their broad responsibilities. To help increase the effectiveness and efficiency of the current funding system, the Government has published plans to simplify the funding landscape for local authorities. This includes by simplifying existing funds and putting in place a new Funding Simplification Doctrine, which came into force in January 2024, to help assess suitable distribution methodologies for new funding streams.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_electoral-commission/content_7.html": "The Electoral Commission is the independent body which oversees elections and regulates political finance in the UK. In accordance with the Political Parties, Elections and Referendums Act 2000, the Commission has a range of supervisory and investigatory powers which enable them to monitor compliance with electoral finance laws proactively and enforce suspected offences.\nThe Electoral Commission has civil sanctioning powers that apply to referendums and elections. More serious criminal matters can be and are referred to the police, and then considered by a court of law. The courts already have the power to levy unlimited fines.\nIt is important to remember that political parties are voluntary organisations and not large corporate organisations. Disproportionate regulation could discourage volunteering and undermine local democracy. Political parties and referendum participants of all colours have been fined for breaches of technical reporting requirements.\nI am assured that the Government will continue to work closely with the Electoral Commission.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_alberto-calls-end-awful-fleecehold-system/content_50.html": "The South Leicestershire MP has written to the government on behalf of Leicestershire residents who have expressed widespread frustration with companies like FirstPort and The Land Trust, which manage private estates across the constituency. Key concerns include unreasonably high service charges, lack of accountability, and the absence of mechanisms for refunding overpaid fees.\nAlberto has encouraged residents to take part in a survey that he recently launched on his website, aimed at gathering insights into the impact of land management companies on the community. The views expressed will, he says, inform his actions in holding property management companies accountable and evaluating the government’s future proposals on leaseholder reform.\nAlberto backed accelerating the transition from leasehold to commonhold, allowing leaseholders to own and control their properties outright. He argues that legal and financial barriers to commonhold must be simplified, making it easier for leaseholders to convert.\nThe benefit of this transition would be that owners’ associations could choose to hire a property management company and, if necessary, fire them for overcharging or underperforming.\nOn the move to commonhold Mr Costa said: “This would create competition and force management companies to offer fair pricing. Under the leasehold system, freeholders often own the management company, meaning they profit from high service charges. In commonhold, owners can act in their own best interests, rather than being subject to a freeholder monopoly.”\nAlberto is also calling for stronger oversight of property management companies, such as a compulsory code of conduct for property management firms to ensure fair practices and prevent exploitative fees. An independent watchdog too could oversee compliance, investigate malpractice, and ensure transparency in management fees.\nWhile the MP for South Leicestershire has backed changes to the leasehold system, in his letter to the government Mr. Costa cautioned against creating “unnecessary bureaucracy that could slow progress or burden homeowners.”\nAlberto also suggests that leaseholders should be able to call for open-market competitive tendering and transparency to prevent conflicts of interest within property management companies. He also proposes mechanisms to justify increases in communal energy bills and advocates for the introduction of a national benchmarking system for service charges, enabling residents to compare costs more easily.\nCommenting on the issue, Mr. Costa stated, \"The growing frustration among residents in my constituency cannot be ignored. The practices of some property management firms are deeply concerning, and it is time the government acted to ensure that leaseholders and homeowners are protected from unfair charges and mismanagement. These changes are crucial not only for my constituents but for homeowners across the country who are facing similar issues.\"\nENDS\nSurvey details here:\nhttps://www.albertocosta.org.uk/campaigns/land-and-property-management-companies-have-your-say",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_public-order-bill/content_20.html": "Recent protest activity from a minority of individuals utilising guerrilla tactics has caused misery to the hard-working public, disrupted businesses, interfered with emergency services, cost millions in taxpayers’ money, and put lives at risk.\nIndeed, fuel supply has been disrupted by protesters tunnelling under oil terminals and cutting the brakes on tankers, and police officers have spent hours trying to unglue people’s body parts from some of the UK’s busiest and most dangerous motorways. This includes groups like Just Stop Oil, which alone has cost the police over £5.9 million in a matter of months.\nThe Government is therefore legislating to equip the police to better manage and tackle dangerous and highly disruptive tactics, as well as prevent major transport projects and infrastructure from being targeted by protestors. This follows the Police, Crime, Sentencing and Courts (PSCS) Act, having received Royal Assent at the end of the last parliamentary session, which introduced a number of measures to enable the police to better manage protests.\nThe new Public Order Bill seeks to: introduce new criminal offences of locking-on and going equipped to lock-on; make it illegal to obstruct major transport works such as HS2; create a new criminal offence for interfering with key national infrastructure; extend stop and search powers for police to search for and seize articles related to protest-related activity; and introduce Serious Disruption Prevention Orders where a breach of the order would constitute a criminal offence.\nI am confident these new changes to public order law will put a stop to the relentless reoffending and significant disruption caused by a selfish minority of protesters which impinge on the rights of the British public to go about their daily lives in peace.\nMPs agreed to add Clause 9 - which introduces areas around abortion clinics and hospitals (buffer zones) where interference with, and intimidation or harassment of, women accessing or people providing abortion services would be an offence - to the Public Order Bill.\nMatters related to abortion are a free vote for MPs, meaning the Government does not ask members to vote a certain way. I recognise that there are very strong views from both sides of the debate on this subject. When discussing the amendment in Parliament, the Government expressed the view that this country has a proud history of allowing free speech, but the right to peaceful protest does not extend to harassment or threatening behaviour. The law already provides protection against harassment and intimidation, and the police have a range of powers to manage protests. Like all members of the public, protesters are subject to the law and suspected criminal offences must be robustly investigated and dealt with by the police.\nFollowing concerns about the tactics of protestors outside some abortion clinics, a review was instigated by Government in 2018. This review revealed that anti-abortion demonstrations take place outside a small number of facilities. In 2017 for example, 363 hospitals and clinics in England and Wales carried out abortions. Of those, 36 hospitals and clinics experienced anti-abortion demonstrations. With this in mind, the Government’s assessment was that introducing buffer zones would not be an appropriate response given the experiences of the majority of hospitals and clinics.\nI look forward to ensuring the Bill receives the thorough scrutiny it commands as it progresses through Parliament. Please be assured I will be following developments closely.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_regulation-press/content_18.html": "The majority of traditional publishers, including 95 per cent of national newspapers by circulation, are members of the Independent Press Standards Organisation (IPSO), the independent regulator for most of the newspaper and magazine industry in the UK. IPSO has made continued improvements over the years by incorporating steps recommended by the Leveson Inquiry. This was confirmed in Sir Joseph Pilling’s 2016 review, which found IPSO had made important achievements in demonstrating it was an independent and effective regulator.\nIn the years since the Leveson Inquiry, many publishers have introduced comprehensive guidance on topics including accuracy and harassment. Where participating publishers fall short of their legal standards, IPSO offers support to victims of libel, slander or malicious falsehood in the form of low-cost arbitration, which offers quick access to fair and independent redress. IPSO can also take action against publishers that do not comply with the Editors’ Code of Practice, as it has done on many occasions.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_river-management-petition/content_28.html": "I would like to assure you that my ministerial colleagues and I fully appreciate the importance of our rivers. The volume of sewage and other pollution being discharged into our waters is completely unacceptable. The Government’s Plan for Water, published earlier this year, sets out more investment, stronger regulation and tougher enforcement to tackle every source of pollution.\nAs part of the plan, over £2.2 billion of investment has been accelerated. This will be directed into vital infrastructure to improve water quality and secure future supplies, with £1.7 billion of this to tackle storm overflows. Ministers have set stringent targets for water companies to reduce storm overflows, driving the largest infrastructure programme in water company history of £56 billion over 25 years. This is a credible plan which includes front-loading action in particularly important and sensitive sites, including bathing waters.\nRegarding regulation, Ministers are driving up monitoring and transparency. Monitoring of storm overflows has increased substantially, from only 7 per cent in 2010 to 91 per cent now, and companies are on track to reach 100 per cent by the end of the year. It is precisely because of this monitoring that action can be taken to fix storm overflows and hold water companies to account. The Government is clear that water companies must not profit from environmental damage and Ofwat has been given increased powers under the Environment Act 2021 to hold them to account for poor performance. In March, Ofwat announced new powers that will enable it to take enforcement actions against water companies that do not link dividend payments to performance for both customers and the environment.\nIn July, Ministers introduced laws to remove the £250,000 cap on penalties that can be handed out by environmental regulators, as well as significantly broaden their scope to target a much wider range of offences. This will ensure that regulators have the right tools to drive compliance across a range of sectors, including water companies. Fines from water companies are being reinvested into the new Water Restoration Fund, which will deliver on-the-ground improvements to water quality and support local groups and community-led schemes which help to protect our waterways.\nFurther, the Environment Agency has launched the largest criminal investigation into unpermitted water company sewage discharges ever at over 2,200 treatment works. I am assured that Environment Agency funding is closely monitored to ensure that it can carry out its duties and functions effectively. Its funding for inspections comes directly from the permits issued to companies; enforcement is funded by government, and in the current Spending Review period, the Environment Agency’s environment RDEL (Resource) grant for 2022/23 increased to £96 million from £56 million in 2020/21.\nI am assured that these measures and others are making progress and Ministers will continue to make further improvements where necessary. Our bathing waters continue to improve, with 93 per cent classified as good or excellent in 2022 compared to 76 per cent in 2010. There is now 80 per cent less phosphorus and 85 per cent less ammonia in our rivers compared to 1990 when water was privatised.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_rooftop-solar/content_45.html": "Where appropriate, solar panels can put unused roof space to good use and are an important technology in helping to reduce carbon emissions. I would like to assure constituents that the Government is committed to widespread deployment of rooftop solar.\nI understand that the Government’s ambition for 70 gigawatts of solar capacity by 2035 will require a significant increase in both ground-mount and rooftop solar. Ministers have been clear that the extensive deployment of rooftop solar on domestic, industrial and commercial property to make effective use of available surfaces is a priority.\nThe Government has recently announced that it will expand permitted development rights to ensure more homeowners and businesses can install solar panels on their roofs without going through the planning system. The changes will mean homes with flat roofs will be able to install panels without planning permission, bringing rules in line with those for businesses. Reforms will also make it easier for solar panels to be installed in canopies above car parks, if they are over ten meters away from people’s homes. In addition, the Government will scrap current rules that require businesses to apply for planning permission if solar panels will generate more than one megawatt of electricity.\nWhile I share constituents view that rooftop solar has an important role to play in helping us decarbonise the power sector, it is worth noting that the suitability of solar panels on rooftops is limited by the type of building and its location around the country. Some roofs are not suitable for solar panels due to structural strength or the direction of the building. To help households who would like to install solar panels, VAT has been cut on energy saving materials.\nIn addition, the Government has set out plans to significantly reduce energy use in new homes and new non-domestic buildings from 2025. As a first step towards this standard, an interim uplift to energy efficiency requirements is in force and the Government anticipates most developers will comply with the requirements by installing solar panels on new buildings.\nI have been assured that the Solar Taskforce will focus on further measures to unlock the potential of rooftop solar.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_retained-eu-law-revocation-and-reform-bill-environmental-protections/content_38.html": "The European Union (Withdrawal) Act 2018 brought a large number of EU laws and regulation into our domestic law. This was called Retained EU Law (REUL), and had special status, reflecting the supremacy of EU law, European Court of Justice case law and EU legal principles. In September 2022, the Government introduced the Retained EU Law (Revocation and Reform) Bill. The Bill will abolish this special status and will enable the Government, through Parliament, to amend more easily, repeal and replace REUL.\nThe Government remains fully committed to maintaining the UK’s environmental standards and Ministers have made clear assurances at all stages of the Bill’s passage not to reduce environmental standards and protections. The Government has set stretching new targets under the Environment Act 2021, which together form one of the most ambitious environmental programmes in the world. The Environmental Improvement Plan sets out in detail how the Government will deliver on its targets and duties. This includes measures such as the Species Survival Fund to create, enhance and restore habitats, as well as plans to support a transformation in the management of 70 per cent of our countryside through incentivising farmers to adopt nature friendly farming practices. The Government is investing more than £750 million in tree planting and peatland restoration through the Nature for Climate Fund.\nFurther, the Government has driven action to improve nature globally. At the UN Nature Summit, COP15, a new Global Biodiversity Framework was agreed, with 23 targets, including to protect 30 per cent of the world’s land and ocean by 2030.\nI hope this has provided you with reassurance that my ministerial colleagues and I are fully committed to maintaining our environmental standards.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_campaigns_alberto-invites-views-local-transport-investment/content_52.html": "Tweet Complete the survey below to have your say on where you would like to see investment in local infrastructure. Transport and Infrastructure - Your priorities. Current Your details 2.1. What transport improvements would you like to see in our local area? Leave this field blank First name Last name Email Mobile number Postcode Address ID Address Parliamentary constituency Admin county Admin district CED Admin ward Parish I would like to be kept up-to-date by the Conservatives on future issues that matter to me: Yes There will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our Privacy Policy.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_palliative-care/content_24.html": "It is clear that we must ensure that people receive the most appropriate care personalised to their individual needs as they approach the end of their life.\nThe NHS Long Term Plan, prepared by the NHS and published in 2019, builds on previous commitments made by the Government to personalise care through informed conversations between healthcare professionals and dying people. Part of this is a commitment to help people to live independently for longer, as well as a promise to give more people more say about the care they receive and where they receive it, particularly towards the end of their lives. I believe empowering people with terminal conditions in this way will better enable them to access palliative care when and where they most need it.\nThe creation of the Personalised Care Institute has made training available to help staff identify and support patients and to introduce personalised care planning for everyone identified as being in their last year of life. Importantly, this enables meaningful conversations to take place and allows staff to help patients and families, address their concerns and to explain the breadth of services available in the local area.\nOn the funding of hospices, NHS England and NHS Improvement have recently provided funding to support seven strategic clinical networks to deliver palliative and end of life care. The Health and Care Act requires Integrated Care Boards (ICBs) to commission palliative care and end of life services.\nFurthermore, NHS England has actively increased its support to local commissioners to improve the accessibility, quality and sustainability of palliative and end of life care for all. This has included the publication of statutory guidance and service specifications, with further resources available on the FutureNHS Collaboration Platform.\nIn addition, NHS England has funded the establishment of a Palliative and End of Life Care Strategic Clinical Network in every NHS England region, which works closely with local commissioners regarding the development of accessible, high quality and sustainable services.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk/content_1.html": "Is Alberto your MP?\nEnter your postcode\nWelcome to my website, I'm Alberto Costa, Member of Parliament for South Leicestershire. On this website you can find updates about the work I'm doing for South Leicestershire, see the campaigns I'm working on and also find out more about me and how to get in touch.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_privacy/content_34.html": "This document outlines how Alberto Costa processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Alberto Costa\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Alberto Costa.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Alberto Costa, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Alberto Costa via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_debt-relief-low-income-countries/content_31.html": "I recognise that debt vulnerabilities are worsening, especially in low-income countries, and welcomed the timely publication of the International Development Select Committee’s report on debt relief in low-income countries..\nI understand that the Government rejected Recommendation 5 of the Committee’s report, which was that the UK Government should consult on the introduction of legislation to compel or incentivise participation of private creditors in the Common Framework, such as those proposed by the World Bank. I hope you will not mind if I now take some time to outline the reasons for this.\nThe UK has already been working with the private sector on several areas of their participation in debt treatments, and is already committed to ensuring that private sector creditors participate in debt restructurings on comparable terms.\nFurther, through HM Treasury, the UK already has ongoing engagement with private sector stakeholders to discuss debt issues, including comparable treatment. Moreover, the G20 and the Paris Club, both of which the UK is a part, have both set out as a fundamental principle under the Common Framework that private creditors are expected to participate on at least as favourable terms as bilateral creditors. The UK has repeatedly emphasised the importance of this principle, and is committed to making it work.\nThe International Monetary Fund (IMF) also identified some areas for improvement. To make progress on these, the UK established a Private Sector Working Group under its G7 presidency in 2021 to explore improvements. I understand that the group looked at a particular reform designed to enhance creditor participation and inter-creditor equity in debt restructurings, and the UK Government is now working closely with the IMF and others to promote and ensure the uptake of this.\nCurrently, the Government is concentrating on the above, rather than a legislative approach, which would be complex and could have unintended consequences in terms of access to finance for developing countries.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_campaigns_supporting-our-local-businesses/content_58.html": "I am immensely proud that South Leicestershire is a home to a wonderful array of small, independent businesses and SMEs as well as other larger organisations such as Next, Everards and Britvic.\nThis brilliant mix of businesses in the constituency provides a wealth of choice for constituents and visitors alike as consumers, but it also crucially provides valuable employment and investment to the area.\nI always strive to engage with local businesses, both large and small, alongside organisations such as the East Midlands Chamber of Commerce and the Federation of Small Business (FSB), both of whom do excellent work in support businesses in the county and the region.\nSince my election in 2015, I have been delighted to support the annual FSB-led initiative of Small Business Saturday - organised to promote the small, independent local businesses in our community.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_alberto-launches-short-story-competition-primary-school-pupils-world-book-day/content_51.html": "On World Book Day, South Leicestershire MP, Alberto Costa, launched a Short Story Competition for primary school children across the constituency, to encourage young minds to embrace creativity and develop a love for storytelling.\nAs usual, World Book Day, brought joy to young people across the country, with thousands of primary school children dressing up as their favourite fictional characters on a day that promoted the joy of reading.\nHighlighting the power of reading for pleasure, Mr. Costa emphasised that research shows it is the single most significant predictor of a child’s future success, surpassing even family background, parental education, or income.\nMr. Costa said:\n“Reading and storytelling are activities that bring great joy to young people, but they are also valuable for aiding brain development. I wound encourage all primary schools and children in South Leicestershire to get involved and take the opportunity to showcase their imagination by taking part in the Short Story Competition I’m running.”\nCompetition Details:\n- Open to: Primary school children who live or attend school in the South Leicestershire constituency\n- The Challenge: Write a short story (maximum 250 words)\n- Deadline: Friday 11 April 2025\n- Prizes: Awarded to the winner, to be announced after the Easter holidays\n- Submission: Entries should be emailed to [email protected]\nMr. Costa has also offered to visit local schools to talk about the competition and meet the winning young writer.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_alberto-raises-issue-brain-tumour-research-prime-minister/content_59.html": "Alberto raised the issue of the lack of funding into Brain Tumour Research.\nAlberto spoke at Prime Ministers Questions on the need for more research to be carried out into Brain Tumours.\nAlberto shared the heartbreaking story of Laura, whom he met at a constituency surgery last week. She spoke about the devastating loss of her six-year-old son, Taylan, to medulloblastoma - an aggressive brain tumour known as \"The Terminator\" due to its 0% survival rate.\nSpeaking after Prime Minister’s Questions, Mr Costa said:\n\"Today at PMQs, I raised the case of Taylan, who tragically lost his life to a brain tumour at just six years old. I have requested a meeting with the relevant Minister to push for greater action in preventing more young lives from being lost to this devastating disease.\"\nOver the years the statistics show that Brain Tumours kill more people under the age of 40 each year and continues to rise. Additionally, more children lose their life to Brain Tumours than to Leukaemia.\nMrs Kurtul (Laura) said \"Knowing that Alberto Costa MP raised this issue with the Prime Minister after our conversation at a recent constituency surgery about my son Taylan’s tragic passing from a brain tumour, and that he is calling for a meeting on this, means a lot me and my fellow Angel Mums.\"\nMr Costa said: \"I was deeply moved by Laura’s story. She has experienced every parent’s worst nightmare—the loss of a child to a disease with no chance of survival. We must do more to improve early diagnosis, treatment options, and ultimately find a cure. I will continue pushing for greater investment in research to give hope to families facing this devastating disease.\"",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_data-protection-act/content_41.html": "The Data Protection Act 2018 is an important piece of legislation that protects the private information of individuals and helps ensure it is used lawfully, fairly and transparently by businesses, organisations and Government. The Information Commissioner's Office is an independent regulator that upholds data privacy and rights related to information and takes action against non-compliant organisations.\nUnder the Act, which is the UK's complementary legislation to the European Union's General Data Protection Regulation (GDPR), you have the right to find out what information organisations store about you, including how it is used, have it updated or erased and stop it from being processed. If you would like to know more about your rights, please search: https://www.gov.uk/data-protection.\nYou may be interested to know that the Data Protection and Digital Information (No. 2) Bill, which was first introduced in 2022, has been improved and reintroduced. The new measures included in the Bill will introduce a simple, clear and business-friendly framework that will not be difficult or costly to implement – taking the best elements of GDPR and providing businesses with more flexibility about how they comply with the new data laws. Furthermore, it will ensure the UK's new regime maintains data adequacy with the EU, and wider international confidence in the UK’s comprehensive data protection standards. By reducing the amount of paperwork and supporting international trade without additional costs if they're already compliant, the changes will give organisations greater confidence about when they can process personal data without consent.\nI am encouraged that these data reforms are expected to unlock £4.7 billion in savings for the UK economy over the next 10 years and maintain the UK’s internationally renowned data protection standards so businesses can continue to trade freely with global partners, including the EU.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_alberto-secures-parliamentary-debate-local-government-misconduct-bullying-and-standards/content_53.html": "Alberto has successfully secured a debate in Parliament on bullying, harassment and standards at local government level. The debate, titled “The Effectiveness of the Nolan Principles in Local Government” will take place on Tuesday 11th March at 11:00am.\nThe MP insists that with proposed changes to local government structures, it is increasingly urgent that we address how bullying, misconduct, and standards are enforced at the local level.\nThe Department for Levelling Up, Housing and Communities (DLUHC) oversees local government policy and has the power to legislate on standards. However, since the abolition of the Standards Board for England under the Localism Act 2011, concerns have grown about the lack of effective mechanisms to hold local councillors accountable.\nThe 2019 report by the Committee on Standards in Public Life recommended strengthening the system, including giving councils greater powers to sanction misconduct, such as suspending councillors. Despite these recommendations, the government has yet to act. In the context of local government reform, now is the ideal time to have this debate.\nAlberto Costa Member of Parliament for South Leicestershire said:\n“Reports of misconduct within councils are increasingly widespread, and this issue demands parliamentary scrutiny. We must not sit by as more and more people are put off from getting into local government because they see it as a toxic environment.\n“As Chair of Parliament’s Standards Committee, I am concerned with how to uphold trust in all levels of government. I also see firsthand that elected representatives do, at times, fall short. At all levels of government there must be a robust and consistent framework to resolve disputes and impose sanctions for more serious breaches.”",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_campaigns_fairer-funding-leicestershire/content_56.html": "I am firmly committed to working with Leicestershire County Council to deliver fairer funding for Leicestershire.\nLeicestershire has, for a number of years, had a low level of spend relative to other local authorities, which has created pressures on spending and budgetary savings.\nAs a result of this I do recognise the need to make savings and reduce our deficit, though it is important to ensure this is done as fairly as possible. Leicestershire County Council as well as both Blaby and Harborough District Councils deliver an excellent service for the residents of South Leicestershire, despite historically being under-funded.\nThrough working closely with the council, I will seek to make the case on behalf of Leicestershire to ensure we receive the fairer funding needed to continue to deliver services for residents.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_international-health-regulations/content_49.html": "The International Health Regulations (2005) (IHR) are a key part of the global health security system to prevent, protect against, control and provide a public health response to the international spread of disease.\nThe original International Sanitary Regulations, which preceded the International Health Regulations, were adopted in 1969 and amended several times: in 1973, in 1981, and in 2005. The third edition (2005) has been amended twice – in 2014 and 2022. The revisions of the regulations illustrate their fluid nature, adapting to the health challenges that the world faces at that time. As medical knowledge changes, I believe it is only right that health regulations change too.\nRegarding the current amendments, the UK Government is eager to ensure that countries' obligations under the IHR remain fit for purpose and reflect the lessons learnt from the Covid-19 pandemic. Measures that the Government wish to see include a stronger global commitment to effective disease surveillance, early reporting of potential health threats, and transparency in sharing information. I understand that the UK continues to formulate positions during ongoing textual negotiations and has engaged other World Health Organisation member states on the matter, including through the Working Group on Amendments to the IHR (2005).",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_kept-animals-bill-cats/content_46.html": "The UK has some of the highest animal welfare standards in the world and it is only right that we continue to improve our world-leading standards.\nIn August 2021, the Government carried out a consultation on proposed restrictions to the commercial and non-commercial movement of pets into Great Britain. The consultation proposed to maintain the existing requirements for cats, as there is currently limited evidence of a significant illegal trade in cats or significant numbers of low welfare movements. I look forward to reading the Government’s response in due course.\nI am aware that the Kept Animals Bill, introduced in June 2021, was designed to implement several of the Government’s ambitions for animal welfare. This included new restrictions on pet movements into Great Britain, as well as measures to tackle pet theft. However, I am aware that the Bill’s multi-issue nature means that there has been considerable scope-creep, and the Bill risks being extended far beyond the original commitments in the Conservative Manifesto that I was elected on and the Action Plan for Animal Welfare. Therefore, the Government will now be taking forward measures in the Kept Animals Bill individually during the remainder of the Parliament.\nI am assured by my ministerial colleagues in Defra that the Government is fully committed to delivering its manifesto commitments on animal welfare and will work to maintain its strong track record on animal welfare and to deliver continued improvements, both in the course of this Parliament and beyond. I am assured that this will include continued action on pet smuggling.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_future-free-homelessness/content_8.html": "I sincerely recognise the very real costs of homelessness highlighted in the research, both to individuals and to society.\nI also completely and wholeheartedly agree that everyone deserves a safe and stable place to call home. Through the Renters (Reform) Bill, the Government will abolish Section 21 evictions which will give tenants greater security without the threat of a ‘no fault’ eviction. There is also a firm commitment to delivering more social and genuinely affordable homes, underpinned by the £11.5 billion Affordable Homes Programme (2021-26) which will deliver tens of thousands of new homes. I note that Crisis’s research draws on the particular importance of social rent, which is why you may be interested to know that the Government has proposed amending national planning guidance to make clear that local planning authorities should place greater importance on social rent.\nThe Government is investing £2 billion between 2022 and 2025 to tackle homelessness and rough sleeping, targeted to areas where it is needed most. This will work alongside the ‘Ending Rough Sleeping for Good’ strategy which puts prevention at the heart of the Government’s plans to end rough sleeping once and for all. I was encouraged to see the strategy set an ambition for no one to leave a public institution – whether that’s a prison, hospital or care – to the streets. I have been assured that the Government is committed to reducing the need for temporary accommodation by preventing homelessness before it occurs. I understand that, since 2018, over 640,000 households have been prevented from becoming homeless or supported into settled accommodation through the Homelessness Reduction Act.\nRightly, Government funding for accommodation for people facing homelessness reflects the fact that there is no one size fits all approach. There is, for example, a £10 million Night Shelter Transformation Fund to increase the availability of quality single-room provision within the night shelter sector. Meanwhile, investment in longer-term housing solutions includes a new £200 million Single Homelessness Accommodation Programme which will deliver up to 2,400 homes and wrap-around support.\nOne person without a roof over their head is one too many. While there is much more to do, I hope that this response has provided you with some assurance about the action already being taken and commitment across government to work towards a future without homelessness.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_net-zero-commitment/content_44.html": "The Government is committed to net zero by 2050 and the agreements the UK has made internationally – but doing so in a better, more proportionate way. For too many years politicians in governments of all stripes have not been honest about costs and trade offs. Instead they have taken the easy way out, saying we can have it all.\nThis realism does not mean losing our ambition or abandoning our commitments. Far from it. I am proud that Britain is leading the world on climate change. Our politics must again put the long-term interests of our country before the short-term political needs of the moment, changing the way we do politics.\nThe UK has set the most ambitious target to reduce carbon emissions by 68 per cent by 2030 compared to 1990 levels – and is the only major economy to have set a target of 77 per cent for 2035. This follows progress over the past decades to cut emissions faster than any other G7 country, with the UK having already slashed emissions by 48 per cent, compared to 41 per cent, in Germany, 23 per cent in France and no change at all in the United States. It is this over-delivery on reducing emissions that provides the space to take a more pragmatic, proportionate, and realistic approach to reaching net zero.\nI am pleased that these revised plans will ease the burden on working people, as the Government has made it clear that the plans to meet net zero will only succeed if public support is maintained. This includes: easing the transition to electric vehicles from 2030 to 2035, in line with other similar countries; giving families far more time to transition to heat pumps while significantly increasing grants to upgrade boilers; scrapping onerous energy efficiency requirements and not forcing people to make alterations; no rules on carpooling, seven different bins and more expensive meat; and supporting new oil and gas in the North Sea.\nFinally, the Government is going even further for households and investors by embracing the opportunities of the green economy to create more well paid jobs, through initiatives such as brand new funding to support green research and development, and more onshore and offshore wind with an improved auction round.\nI can assure you that the UK will remain the country with the most ambitious, stringent de-carbonisation targets in the world even after these changes are made.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_microplastic-washing-machine-filters-cross-party-support-new-law-womens-institute-and-mps-sign/content_60.html": "This week, the All-Party Parliamentary Group (APPG) on Microplastics, the Women’s Institute (WI), and a cross-party group of MPs and peers called on the Secretary of State for Environment, Food and Rural Affairs to support the Microplastic Filters (Washing Machines) Bill.\nThe Bill, introduced by Alberto, Chair of the APPG on Microplastics, in October 2024, aims to make microplastic-catching filters mandatory in all new domestic and commercial washing machines. It also seeks to raise public awareness of the harmful impact of microplastic pollution on our rivers, seas, and food chains. The Bill is due to have its second reading on Friday 7th March and this letter puts pressure on the Government to adopt the measures outlined in the Bill.\nEvery time synthetic textiles are washed, tiny microplastic fibres are released into wastewater. Once in the environment, microplastics harm biodiversity, infiltrate aquatic ecosystems, and eventually make their way into the human food chain. They also absorb toxins and harmful chemicals like PFAS, raising serious concerns about their impact on human health.\nThe urgency for action has been highlighted by the APPG on Microplastics in its 2021 report, Microplastic Policies for Government. The report outlines six practical solutions to reduce microplastic fibre leakage, drawing on input from washing machine manufacturers, filter makers, trade associations, clothing companies, and environmental groups.\nAlberto Costa MP, Chair of the All-Party Parliamentary Group on Microplastics is hopeful that the Government will take the issue seriously:\n“I am very grateful for the support of colleagues who have signed my letter drawing the Government’s attention to the critical importance of my Bill which aims to reduce the effects of microplastic pollution on the environment and our health. I hope the Government will listen to our serious concerns and look to support my Bill.”\nJeryl Stone, Chair of the National Federation of Women’s Institutes, said:\n“Microplastic pollution poses a huge risk to our environment and our health, and the WI is proud to support Alberto’s bill and the APPG. The WI has been campaigning against ocean pollution since 1927, and WI members have, since 2017, tirelessly campaigned to against microplastic pollution. We care passionately about the environment and are not afraid to take action when not enough is happening.”\nNote:\nThe Microplastic Filters (Washing Machines) Bill was tabled by Alberto Costa MP on Tuesday, 29 October 2024, under the Ten-Minute Rule. Its second reading is scheduled for 7 March 2025.\nThe All-Party Parliamentary Group on Microplastics was set up by Alberto Costa MP in 2020 and works to raise awareness of the threat of microplastic pollution in parliament and to the public. The group is chaired by Alberto Costa MP and The Women’s Institute provides the secretariat.\nIn 2021 it published the report Microplastic Policies for the Government, which outlines a series of holistic recommendations designed to eliminate the release of microplastic fibres from clothing into British waters. Key recommendations include the fitting of microfibre filters in all new domestic and commercial washing machines from 2025 and the appointment of a designated ‘Minister for Plastics Pollution’ who would have a clear remit for the control and prevention of plastic pollution. The report can be accessed here.\nThe Women’s Institute is the largest women’s organisation in the UK, with over 180,000 members in England, Wales and the Islands. Since 1915 its members have campaigned to tackle issues that matter to women in their communities.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_campaigns_supporting-sustainable-development/content_54.html": "As a Conservative MP I do of course always support the creation of further employment and investment in both the local and national economy, however it is important that this development comes in a sustainable manner; not at the expense of our local environment and local infrastructure.\nSouth Leicestershire is situated in the middle of what is referred to as the 'Golden Triangle', between the motorways of the M1, M6 and M69 meaning that most of the UK can be reached in under four hours. This of huge benefit to large logistics organisations, however it is imperative that their commercial needs are always balanced with the needs of local residents.\nI will continue to work alongside local residents to ensure that their voices are heard in relation to the Magna Park logistics park and the recently announced plans for the Hinckley National Rail Freight Interchange (HNRFI), to ensure that no decisions are made without a transparent, public process.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_alberto-calls-urgent-action-flooding-south-leicestershire/content_35.html": "Alberto has called on Emma Hardy, Labour's Minister for Flood Management, to address the severe flooding that has significantly impacted communities and families across South Leicestershire.\nIn a letter to the Minister, Alberto highlighted the devastating effects of the flooding on January 6th, which prompted a Major Incident declaration in Leicestershire. The flooding led to Fire Services rescuing residents from their homes and vehicles, and caused extensive damage to properties, schools, a Baptist church, social housing units, and villages such as Countesthorpe.\nMr Costa emphasised that many of the affected areas had already been hit hard by Storm Henk and other storms in September and October. One constituent even reported that the installation of their new kitchen had to be delayed because the property needed to be dried out yet again.\nThe letter also raised serious concerns about the adequacy of the local drainage network, particularly in the context of new developments and ongoing maintenance. Mr. Costa urged the Minister to recognise that traditional responses to flooding incidents are no longer sufficient and called for a national conversation on the issue.\nMr Costa Said:\n\"We need this national conversation because, with climate change, we will face more intense storms and rainfall, which will increasingly affect our communities.\n\"This conversation must address where and how we build homes, as well as conservation methods to mitigate the impact of flooding.\"\nMP Costa proposed several measures to tackle the issue, including preserving protections for Flood Zones 1, rethinking housing designs to withstand flooding, reintroducing beavers to help manage water flow and reduce flood risk, and urging relevant agencies to intensify efforts to dredge rivers and brooks.\nAdditionally, he called for increased investment to modernise the drainage system and recommended making water companies statutory consultees on planning applications to unlock additional funding through Section 106 agreements.\n\"It is time for an open and honest conversation and for the necessary reforms to safeguard our constituents and communities,\" concluded MP Alberto Costa. \"We need innovative solutions to ensure the foundations of our local communities are secure and not left at risk from inaction or outdated practices.\"",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_climate-change/content_22.html": "It is crucial that we recognise the importance and urgency of action needed on climate change. The UN's Intergovernmental Panel on Climate Change has concluded that the world is warming faster than anticipated, the effects of which are being seen in every single region of our planet. Immediate global action is needed to limit warming, heatwaves, heavy precipitation, droughts, and loss of Arctic Sea ice, snow cover and permafrost.\nThe UK was the first G7 country to legislate to achieve net zero by 2050, and is decarbonising faster than any G20 country. In addition, we have set ambitious climate targets in law, such as a commitment to reduce emissions by 68 per cent by 2030, and also by 78 per cent by 2035, both compared to 1990 levels. This is not at the expense of economic growth: the UK has grown its economy by 75 per cent while cutting emissions by nearly 48 per cent since 1990.\nHowever, the UK accounts for only approximately 1.2 per cent of global emissions; clearly, global action is required. When the UK took on the COP26 Presidency, in partnership with Italy, only 30 per cent of the world was covered by net zero targets. This figure is now at around 90 per cent. I am strongly encouraged by the ambitions of the Glasgow Climate Pact which calls on accelerated global efforts to phase down unabated coal power and phase out inefficient fossil fuel subsidies, while providing targeted transitional support to the poorest and most vulnerable in line with national circumstances.\nI am encouraged that the UK will produce enough offshore wind to power every home, quadrupling how much we currently produce to 50GW by 2030, and supporting up to 60,000 jobs. The Government will work with industry and aim to generate 10GW of low carbon hydrogen production capacity by 2030 for industry, transport, power and homes. In addition, the Government aims to develop the first town heated entirely by hydrogen by the end of the decade. The Government has launched a new Energy Security Strategy, which will see a significant acceleration of nuclear, with an ambition of up to 24GW by 2050 to come from what I am assured by my ministerial colleagues is a safe, clean, and reliable source of power.\nOther measures include a target to install 600,000 heat pumps every year by 2028, £1 billion funding to make our schools, hospitals and homes more energy efficient, planting 30,000 hectares of trees every year, promoting and investing in zero-emission transport and £20 million to develop clean maritime technology. The plan also includes a pledge to end the sale of new petrol and diesel cars and vans by 2030.\nThe next decade is critical; every country, government, business and citizen must unite to tackle this huge threat to our planet and humanity.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_alberto-visits-local-hair-salon-hairdressers-hit-hard-chancellors-tax-hikes/content_5.html": "Alberto has visited a long-standing Blaby hair salon to meet with salon owner Sue Davis and discuss the mounting pressure being placed on the hairdressing industry by the Chancellor’s latest tax reforms.\nSue Davis, a respected figure in the local business community, has worked in the hairdressing industry for over 30 years and has run several salons in Blaby. Her current salon remains a much-loved fixture in the town.\nDuring the visit, Mr Costa heard first-hand how the Chancellor’s tax increases are impacting small businesses like Sue’s—particularly when it comes to hiring new staff and supporting apprenticeships.\n“Hairdressers across the country are facing the increase in prices, the increase in all our taxes, affecting our ability to be able to employ young members to grow their futures and get their careers going,” Sue explained.\nThe visit comes in the wake of growing national concern from hairdressing professionals and industry bodies. A recent report warned that hairdressing apprenticeships could face extinction under Labour’s new tax proposals, with salons hit by higher costs and reduced VAT refunds.\nAlberto committed to raising these concerns in Parliament by calling on ministers to reconsider the impact of these policies on vital local businesses.\n“We want Sue Davis and good businesses like hers across the country to stay in business and keep bringing in apprenticeships.” Said Mr Costa.\nAlberto continued: “The government must stop piling pressure on small businesses with blanket tax hikes that threaten jobs, training opportunities, and the local economy.”\nSue Davis recently joined fellow hairdressers from across the UK at a protest outside Parliament, calling on Chancellor Rachel Reeves to scrap the reforms that could see many salons forced to close their doors.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_rare-conditions/content_6.html": "In 2021, the UK Rare Diseases Framework was published to set out a vision for improving outcomes for people with rare diseases. The Framework set out four priorities around delivering earlier diagnosis, increasing awareness among healthcare professionals, improving access to specialist treatment and providing co-ordinated care.\nEngland’s first rare Disease Action Plan followed in 2022, which turned the priorities of the framework into concrete actions. The Government, through work across the health care sector and with the rare diseases community, has made significant progress. However, there is still more to do. The Government has published its England Rare Diseases Action Plan 2023 to further improve the lives of those living with rare diseases. It will continue to work to reduce health inequalities faced by people living with rare diseases, lower barriers to participation in clinical research and improve the way services are commissioned in NHS England.\nThese commitments are supported by funding for ground-breaking research, including £790 million investment into Biomedical Research Centres and a £12 million UK Rare Disease Research Platform. Moving forward, the Government will continue to work closely with the delivery partners and the rare disease community to monitor progress and drive change. I will continue to follow this issue closely.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_vaping-and-e-cigarettes/content_27.html": "While e-cigarettes are not risk-free, the Government supports the use of e-cigarettes as a means to stop adults smoking and contributing towards the goal of creating the first smokefree generation.\nSome of the highest success rates of those trying to stop smoking are among adults using an e-cigarette, with evidence suggesting that an additional 70,000 people stop every year as a result of using these devices. An estimated 2.4 million vapers are former smokers, and the Government's Swap to Stop Scheme aims to provide almost one in five of all adult smokers in England with a vape kit alongside behavioural support to help them quit the habit.\nHowever, it is deeply worrying that the number of children using vapes has tripled in the past three years, with 20.5 per cent of children having tried vaping in 2023. As my colleague Andrea Leadsom - the Minister for Public Health has stated - it is completely unacceptable when businesses knowingly and deliberately encourage children to use a product that was designed for adults to quit smoking.\nResponding to the rise in the number of children vaping, the Government has proposed banning disposable vapes, new powers to restrict flavours specifically marketed at children and changing how vapes are displayed in shops. In addition, Trading Standards Officers will be able to levy \"on the spot\" fines to tackle underage tobacco and vapes sales.\nThese measures will be supported by greater enforcement activity by Trading Standards, HMRC and Border Force. We must take every step to stop the proliferation of illicit vaping products in our communities, often imported from countries such as China and breaching UK regulations on product size and nicotine strength and sold to children. A new “illicit vapes enforcement squad” – led by Trading Standards – has been established to enforce the rules on vaping and tackle illicit vapes and underage sales, with the power to remove illegal products from shops and at our borders.\nI am confident that the actions being taken by the Government will help prevent children from vaping, whilst ensuring that adult smokers are able to continue accessing a product that can help them quit.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_school-food/content_30.html": "All children should be able to enjoy healthy food at school every day and develop healthy eating habits that will stay with them throughout their lives.\nAs set out in the Requirements for School Food Regulations 2014, schools should provide children with healthy food and drink options, and ensure that children get the necessary energy and nutrition throughout the school day. These regulate the food and drink provided at both lunchtime and at other times of the school day. The standards set out that meat or poultry must be provided on three or more days each week, and milk must be available for drinking every day.\nCurrent standards provide a robust yet flexible framework to ensure that pupils receive high quality and nutritious food that builds healthy eating habits for life. The Government continues to promote compliance with the School Food Standards and will keep this under review.\nIn February 2022, the Levelling Up White Paper outlined the Government’s plan to strengthen adherence. This includes piloting work with the Foods Standards Agency, funding of up to £200,000 in a pilot Governor Training Scheme and encouraging schools to complete a statement on their websites setting out their whole school approach to food.\nSchools should therefore make reasonable adjustments for pupils with particular requirements, such as dietary and cultural needs. The Government is encouraging schools to speak to parents about their school meals provision and act reasonably to ensure it best meets the needs and beliefs of their school community.\nSchools must also provide access on their premises, at all times, to free drinking water. I would encourage schools to consider whether they are doing all they can to make free water visible and easily available.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_news_alberto-delighted-governments-decision-reject-controversial-rail-hub-plans/content_55.html": "Alberto Costa, MP for South Leicestershire and Dr Luke Evans, MP for Hinckley and Bosworth, have welcomed the government’s decision to reject plans for controversial 650,000 sq. m Hinckley National Rail Freight Interchange. Labour’s new Transport Minister Heidi Alexander announced the decision today (March 10th). Due to its scale, the proposal was considered a Nationally Significant Infrastructure Project and, as such, had bypassed local planners and gone straight to the government for the final decision.\nIn September 2024, under the previous Secretary of State, the Department for Transport said it was ‘minded to refuse’ the application, after the Planning Inspectorate’s report recommended against granting development consent. The developer, Tritax Symmetry, were given the opportunity to address some of the major shortcomings of the application and the deadline for the final decision was moved to March 2025.\nMr Costa and Dr Evans today welcomed the government’s decision having themselves expressed serious concerns about the project's environmental impact, health implications, and the strain on local infrastructure. They emphasised that the proposed development would exacerbate existing challenges in the region, which already hosts significant industrial sites such as Magna Park and several nearby rail freight interchanges.\nAlberto Costa and Dr Luke Evans, represent the two constituencies affected by the proposed development and have campaigned tirelessly against the proposals. Their concerns include the inadequate traffic modelling conducted by the applicant in respect of the M1, increased safety risk to pedestrians in Sapcote as well as environmental factors such as noise, vibration and the impact on Burbage Common. The MPs also worry that the proposal is just a fig leaf for more large-scale warehousing.\nThe MPs also highlighted overwhelming public opposition to the proposals. A survey conducted by Mr. Costa's office found that 94.5% of respondents opposed the HNRFI plans.\nAlberto Costa Member of Parliament for South Leicestershire said:\n“This is the right decision from the government. Residents, councillors and the Planning Inspectorate all recognised that the cost of the proposals outweigh any benefit. While I know the new government wants to push new development through, there was no real basis to give HNRFI the green light.\n“This decision is a huge relief for residents and a great result for everyone who has scrutinised the proposals closely and given evidence to the Planning Inspectorate and the government.\n“The local response has been incredible and in particular I would like to pay tribute to Blaby District Council for their thorough examination of the proposals. Cllr Terry Richardson, Cllr Ben Taylor, Cllr Mike Shirley, Cllr Maggie Wright and the outstanding planning team at BDC have left no stone unturned in their efforts to scrutinise Tritax’s proposal. Friends of Narborough Station and John Harrison have also been hugely significant throughout the examination process” Dr Luke Evans, Member of Parliament for Hinckley and Bosworth, said\n“What a huge success for our community! After years of this hanging over us, and all the hard work from everyone in our area, we’ve finally had confirmed what we knew all along; this project is inappropriate.\n“This will be a huge relief for many people across our area. Any perceived benefit of the Hinckley NRFI was clearly outweighed by the construction and operation of this site, and I’m so pleased to see it has been rejected.\n“The impact this would have had is so significant I am pleased the Government has finally heard the concerns from Councils, infrastructure groups, the Planning Inspectorate, environmental campaigners, the public and local MPs, and seen sense to turn down the proposal.\n“While the developers still have a chance to appeal the decision, I hope they choose not to given the strength of feeling and the substance of the Planning Inspector's report.\n\"I would personally like to say thank you again to everyone who gave their time and effort to make their objections known, I know it’s been a long road but we finally did it!\"",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_campaigns/content_14.html": "Land and Property Management Companies - Have Your Say Many residents who own their property as both leaseholders and freeholders, particularly in a new-build estates, have raised issues with their property...\nStop the Family Farm Tax Labour have broken their promise to British farmers with the Family Farm Tax. Labour's Family Farm Tax will stop farms being passed to the next generation...\nPetition: Save Leicester's New Hospitals Funding was announced by the Conservative Government in May 2023 for a new hospital at the Leicester Royal Infirmary for women's and ICU services, a midwifery...\nSouth Leicestershire local quality of life survey - share your views with Alberto Costa I am passionate about our villages and want to ensure that rural South Leicestershire remains a wonderful place to live. My local priorities already include...\nAlberto invites views on local transport investment Complete the survey below to have your say on where you would like to see investment in local infrastructure.\nMy priorities for South Leicestershire Boosting our healthy Leicestershire economy still further by promoting our local shops, post offices and public houses in our villages and towns as community assets and partnering with businesses to offer more apprenticeships to younger people.\nSupporting sustainable development As a Conservative MP I do of course always support the creation of further employment and investment in both the local and national economy, however it is important that this development comes in a sustainable manner; not at the expense of our local environment and local infrastructure.\nFairer funding for Leicestershire I am firmly committed to working with Leicestershire County Council to deliver fairer funding for Leicestershire. Leicestershire has, for a number of years, had a low level of spend relative to other local authorities, which has created pressures on spending and budgetary savings.\nSupporting our local businesses I am immensely proud that South Leicestershire is a home to a wonderful array of small, independent businesses and SMEs as well as other larger organisations such as Next, Everards and Britvic.\nDelivering a better future Without a doubt, one of the most enjoyable aspects of my role as Member of Parliament is visiting the fantastic businesses, schools and charities we have in South Leicestershire.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_abortion/content_37.html": "I completely understand what an incredibly emotive issue this is, and I appreciate the strength of feelings on both sides. It is for this reason that, as with other matters of conscience, the Government adopts a neutral stance on abortion and allows Conservative MPs to vote freely according to their moral, ethical, or religious beliefs. This is a convention which I support wholeheartedly.\nThe approach to abortion in Great Britain is set out in the Abortion Act 1967, which states that two doctors must certify that, in their opinion, a request for an abortion meets at least one and the same ground laid out in the Act. These grounds include “risk to the life of the pregnant woman”, and “substantial risk that if the child were born it would suffer from such physical or mental abnormalities as to be seriously handicapped”.\nGuidance for doctors on how to comply with the Act has been issued, which stipulates that registered medical practitioners should be able to show how they have considered the particular facts and circumstances of a case when forming their opinion. Full details can be found online at www.gov.uk/government/publications/guidance-for-doctors-on-compliance-w….\nI am aware that all independent sector abortion clinics in England have been reapproved, which will ensure that abortion services continue to be available to women across the country. I understand that all current approvals are valid until 31 July 2026.\nI know that making a decision regarding abortion can be extremely difficult, and I believe that we must do all we can to support women to make an informed decision, taking into consideration all their options, with medical professionals offering impartial advice. I will continue to do all I can to ensure plenty of information is available to women making enquiries relating to abortion including all options available to them.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_commitments-nature-and-farming/content_47.html": "I would like to assure you that claims that the Government is rowing back on commitments to our farming reforms or nature are wholly untrue.\nNow that we are outside of the European Union, the UK is free from the Common Agricultural Policy, which did little to deliver for farmers, farming or the environment. The Government was elected on a manifesto which pledged to maintain the budget for farming but spend it in a way that does better for farming and nature.\nMy ministerial colleagues and I want to support the choices that individual farmers make for their farms, boost food production and agricultural productivity. This will bolster the rural economy and support communities across the country. Ministers are rolling out new schemes which will support farmers to both produce high-quality food and enhance the natural environment.\nFurther, the Environment Act 2021 includes a commitment to halt the decline of nature by 2030. This Government will never undermine its commitments to the environment in pursuit of growth. Any reforms will rightly contribute to growing our economy in equal step with successfully meeting our commitments in the 25 Year Environment Plan and the legally binding environmental targets through this Act.\nInternationally, the UK has committed to protect 30 per cent of its land and ocean by 2030, through the Leaders Pledge for Nature, which committed to putting nature and biodiversity globally on a road to recovery by 2030.\nI am aware that the purpose of speeding up the planning system in defined Investment Zone areas is to cut back on unnecessary bureaucratic requirements and processes that slow down high-quality development. While the Government has set an intention to remove burdensome EU requirements as part of the streamlined planning process in Investment Zones, guidance provided by the Department for Levelling Up, Housing and Communities is clear that this will target requirements which “create paperwork and stall development but do not necessarily protect the environment”. I understand that key planning policies which ensure developments protect our precious natural heritage and maintain national policy on Green Belt will continue to apply.\nWe have the chance to have a farming industry that is more independent and resilient. It will be an industry that champions economic growth and increases domestic production while returning nature to the land and improving the natural assets that support food production, such as high-quality soil.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_israel-military-courts/content_23.html": "Like many, the UK is concerned about the challenges facing human rights defenders (HRDs) and organisations operating in Israel and the Occupied Palestinian Territories (OPTs). In addition, I can assure you that reports of ill-treatment of those in Israeli military detention are not something the UK takes lightly. In terms of prosecution, it is crucial that there is adequate legal due process to make sure that people's rights can be fairly heard.\nThe UK has also been clear that it has been concerned about Israel’s extensive use of administrative detention which, according to international law, should be used only when security makes this absolutely necessary rather than as routine practice and as a preventive rather than a punitive measure. Detainees should either be charged or released. I understand that the Government continues to raise these issues with the Israeli authorities at every opportunity.\nLikewise, UK officials have, in no uncertain terms, highlighted their concerns over the continued transfer of Palestinian detainees to prisons inside Israel in violation of the Fourth Geneva Convention. The UK Government will continue to call on the Israeli authorities to comply with their obligations under international law. I was encouraged to learn that the UK has funded projects providing legal aid to those, especially minors, detained and prosecuted in this manner and capacity building to local lawyers.\nIt is for reasons such as the above that Israel and the OPTs remain a human rights priority for the Foreign, Commonwealth and Development Office. The UK Government has committed to working with Israel to secure improvements to the practices surrounding children in detention in Israel, and I will be sure to follow progress on this matter closely.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_onshore-wind/content_21.html": "The United Kingdom was the first major economy to legislate for net zero carbon emissions and since 2000, the UK has decarbonised faster than any other G7 country.\nI understand onshore wind is a key part of the Government’s strategy for low-cost decarbonisation of the energy sector. Achieving net zero by 2050 will require increased deployment across a range of technologies, including onshore wind.\nIt is for this reason, as part of the new Energy Security Strategy, the Government will be consulting on developing partnerships with a limited number of supportive communities who wish to host new onshore wind infrastructure in return for guaranteed lower energy bills. In addition, onshore wind prices are down 50 per cent since 2013.\nThe Energy White Paper stated that there will need to be sustained growth in the capacity of onshore wind over the next decade alongside solar and offshore wind. Therefore, in March 2020 the Government announced that onshore wind and other established renewable technologies such as solar PV will be able to compete in the latest Contracts for Difference (CfD) allocation round. The round is now open and will aim to deliver up to double the renewable capacity of the last successful round in 2019 with £285 million a year.\nFurthermore, the Hydrogen Strategy made clear that Scotland has a key role to play in the development of a UK hydrogen economy, with the potential to produce industrial-scale quantities of hydrogen from offshore and onshore wind resources, wave and tidal power, as well as with Carbon Capture Usage and Storage. The Energy Security Strategy also indicates that there will be 12,000 jobs in the UK hydrogen industry by 2030 – 3,000 more than previously expected.",
  "https_www_albertocosta_org_uk_/https_www_albertocosta_org_uk_climate-change-cooperation/content_40.html": "I share the concerns about climate change and the effects it is having on our world and would therefore like to assure you that tackling climate change and protecting the environment for future generations is a top priority for the Government.\nYou are right that we must all work together to address climate change. Ministers engage extensively with stakeholders, NGOs and businesses about climate change and many other issues. Excellent progress has been made to strengthen global cooperation in the fight against climate change. Following COP26 in the UK in 2021, I understand that 90 per cent of the world’s economy is now following the UK’s lead by committing to net zero emissions, ending their contribution to climate change.\nFurther, biodiversity loss is a global problem that needs a global solution, and the UK played a leading role in developing an ambitious post-2020 global biodiversity framework at COP15 of the Convention on Biological Diversity in December 2022. A new deal was agreed by almost 200 countries, with a global commitment to halt and reverse biodiversity loss by 2030 and also to protect 30 per cent of land and oceans by 2030.\nThe UK was the first major economy to commit in law to reaching net zero by 2050. The British Energy Security Strategy and Net Zero Strategy set out how the UK will secure 480,000 well-paid jobs and unlock £100 billion in investment in 2030 on its path to ending its contribution to climate change by 2050. The England Trees Action Plan sets out how the UK will treble tree planting rates. The £750 million Nature for Climate Fund is the main delivery vehicle and is focussed on peat restoration, woodland creation and management.\nFinally, the Environment Act 2021 includes targets to clean up the country’s air, restore natural habitats, increase biodiversity, reduce waste and make better use of our resources. It also includes a target to halt the decline in species by 2030, as well as require new developments to improve or create habitats for nature and tackle illegal deforestation overseas."
}