{
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_local-government-reorganisation/content_3.html": "Following the publication of the Government's White Paper on English Devolution there will be local government reorganisation across Leicester, Leicestershire and Rutland.\nThese proposals will see the abolition of existing Boroughs, Districts, and the County Council's. They in turn will be replaced by Unitary Authorities across the Leicester, Leicestershire and Rutland geographic area.\nThere have been 3 bids submitted to Government for consideration:\ni. Leicester City Council's 'The Case for Change'\nii. Leicestershire County Council's 'One Council for Leicestershire'\niii. District and Borough Council's 'Big enough to deliver, Close enough to respond'\n[All three of these proposals are available for download at the bottom of this page]\nAs the Member of Parliament for Mid Leicestershire I acknowledge that this reorganisation will have a significant impact on the residents of the constituency.\nNot least because the constituency could comprise of one, two or potentially three Unitary Council's.\nI have made it clear that I believe it would be unacceptable for any existing county villages to be forced into the City Council area; particularly where there is no local consent from those it would impacted.\nGiven that the Government has refused to hold local Referenda on this important issue - I have decided to hold my own.\nYour feedback will provide crucial insights into what Mid Leicestershire residents want; and will enable me to articulate these to Government in the strongest possible way!",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk/content_1.html": "Intro Video (background video that auto-plays without sound)\nPeter Bedford\nfor Mid Leicestershire\nI'm Peter Bedford, the Conservative MP for Mid Leicestershire. Here, you can find my news, campaigns and more about me. I'm here to help, so please don't hesitate to get in touch.",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_news_peter-bedford-mp-stopping-sentencing-councils-two-tier-justice-agenda/content_7.html": "Peter Bedford MP took to the House of Commons chamber during a key debate to call out the Sentencing Council’s divisive and dangerous proposals, which he said amounted to the creation of a “two-tier justice system.”\nThe proposals in question would see pre-sentence reports potentially offered to Black, Asian and other ethnic minority offenders. These reports could result in lighter sentencing for criminals from ethnic minority groups, while white offenders in the same position would not be given the same opportunity.\nPeter didn’t hold back. “That is not equality. That is not justice. That is discrimination,” he told the House.\nSpeaking in the debate, Peter made clear that justice should never be determined by the colour of a person’s skin, their religion, or their cultural background. “Justice must not only be done but be seen to be done” he said.\nHe welcomed the Second Reading of a Bill designed to rein in the unelected and unaccountable Sentencing Council, whom he criticised for “espousing the ideology of the liberal-dinner party set” while ignoring the principle of equality under the law.\nPeter also raised the staggering cost of quangos to the British taxpayer of £64 billion a year.\nHe added that: “Parliament must be sovereign,” and that democratic institutions should “not continue to come up against a bureaucratic brick wall.”\nHe praised the Shadow Lord Chancellor for taking a stand when the Government had not. “While the Lord Chancellor let the Sentencing Council run rings around her, it has been our side of the House that has stood up for fairness and common sense.”\nPeter warned that this issue isn’t theoretical—it’s already happening. He pointed to disparities in policing and the justice system, including cases where individuals have faced harsh punishment for online comments, while serious crimes like grooming were overlooked for fear of “offending sensitivities.”\n“We are allowing ideology to replace fairness. We are replacing justice with activism,” he said. “The British people see it, they feel it, and they want it to end.”\nPeter and his Conservative colleagues have promised to continue fighting to restore a justice system based on equality—one rule for all, not different rules based on race, culture, or background.",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_news_speaking-justice-questions-peter-bedford-mp-highlighted-importance-aspiration-and-ambition/content_8.html": "In the session, Peter urged the Government to take a more joined-up approach, calling for closer collaboration between the Ministry of Justice and the Department for Education to support young people into training, apprenticeships, and meaningful employment.\nPeter asked the Minister for Justice:\n“Aspiration and ambition are drivers of social mobility and help to reduce deprivation and crime. What discussions has the Minister had with the Department for Education to increase apprenticeships and training opportunities for young people to ensure a more joined-up approach by Government in reducing youth offending throughout the UK?”\nThe Minister responded:\n“We have regular discussions with the Department for Education on these matters, and he is absolutely right. The more young people we get into training, education, and work, the less crime we should have on our streets.”\nWhile Peter welcomed the Minister’s response, he stressed the need for real action—not just warm words. He believes that to truly break the cycle of youth offending, Government must invest in long-term opportunities that give young people the skills, confidence, and ambition to build better futures.\nFor Peter, reducing crime starts with tackling its root causes—and that means giving the next generation something to aim for, and the tools to achieve it.",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_about-rss/content_4.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_news_category_Opinions/content_9.html": "Peter votes in favour of Assisted Dying 30th November 2024 Earlier today I spoke in the House of Commons and voted for the Terminally Ill Adults (end of life) Bill. I believe everyone should be given the choice at the... Opinions\nResponse to removal of Winter Fuel Allowance 25th November 2024 On Thursday 31st October 2024, Labour delivered their soul-crushing budget and removed Winter Fuel Allowances for the elderly. Over 100,000 will be pushed into... Opinions\nResponse to APR and BPR 19th November 2024 The Autumn Budget 2024 brought many broken promises, spearheaded by Labour's passion to drive this country and its hard-working residents into economic... Opinions\nPeter Bedford's response to Terminally Ill Adults (end of life) Bill 16th November 2024 Re: Assisted Dying Dear constituents, readers and followers, Thank you for your correspondence on the subject of ‘assisted dying’. I am certain that you will... Opinions\nWork and Pensions Select Committee - Question 13th November 2024 On Wednesday 13th November, I had the opportunity to question the Secretary of State during the Work and Pensions Committee meeting. I asked her about Pension... Opinions\nWinter Crime Survey 8th November 2024 In July, I was elected as your new Member of Parliament for Mid Leicestershire. Since then, many residents have contacted me about law & order; more... Opinions",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_cdn-cgi_l_email-protection/content_10.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_contact/content_2.html": "Skip to main content\nMain navigation\nHome\nAbout Peter\nNews\nParliament News\nConstituency News\nCampaigns\nLocal Government Reorganisation\nContact\nMid Leicestershire's \"Best Pub\" 2025!\nContact\nLeave this field blank\nWestminster Office\nHouse of Commons, London, SW1A 0AA\n0207 219 7498\n[email protected]\nConstituency Office\nOffice of Peter Bedford MP, 4 Cropston Road, Anstey, Leicestershire, LE7 7BJ\n0116 5077162\n[email protected]\nPeter on Facebook\nPeter on Twitter\nPeter on Instagram\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_newslettersubscribe/content_5.html": "Tweet Complete this form to join the email newsletter, delivering the latest news straight to your inbox.",
  "https_www_peterbedford_uk_/https_www_peterbedford_uk_privacy/content_6.html": "This document outlines how Peter Bedford processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Peter Bedford\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Peter Bedford.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Peter Bedford, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Peter Bedford via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}