{
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_interview_2022_01_14_western-road-cobbles/content_23.html": null,
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_about/content_13.html": "Ruth has lived and worked in and around Crookes since 1989. As a freelance musician she has been running a successful teaching business and contributing to Sheffield’s diverse music scene for over thirty years.\nPromoting democratic participation is a passion of Ruth’s. She says,\n“Everybody’s voice matters, and when residents or business owners have expertise to share, they should be involved in local decision making. Creating time to listen, and working together are vital elements of moving our city forward.”\nLeading local Health Scrutiny committees, Ruth has furthered the work she started as a health campaigner before her 2021 election.\n“I’m not afraid to ask the hard questions, I believe we can achieve better for people through scrutiny that demands action and change.“\nAcross Crookes and Crosspool, Ruth is constantly seeking opportunities to enhance the environment, fix problems, give children the best possible start in life, and support those in need.\n“As your councillor I’ve been listening to residents and working hard to improve things for our neighbourhoods—from nurturing our green spaces and local businesses, to fighting for better public transport and postal services.\nI know what matters to people, and will continue to work with you and for you to deliver for Crookes and Crosspool.”",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2022_09_22_local-councillors-press-for-clarity-on-active-neighbourhood-trial/content_22.html": "Councillors have issued a statement about the Active Neighbourhood trial currently running in Crookes and Walkley. The Labour councillors support the aims of the trial but say the implementation has been ‘unpredictable’ and ‘confusing’. At a meeting with the Council’s Head of Strategic Transport and Infrastructure (Tuesday September 27th) they will call for more clarity to be given on the trial and for local residents to have a say on how it progresses.\nJoint statement from Ruth Milsom and Minesh Parekh (Councillors for Crookes and Crosspool ward) and Tom Hunt and Ben Curran (Councillors for Walkley ward):\n“All of us want to live on streets that are safe for pedestrians, drivers and cyclists. We want streets where children are safe to play out and that aren’t busy cut-throughs. That’s why we support the aims of the Active Neighbourhood trial in Crookes and Walkley. It was set up to try out ideas for how to make streets more liveable.\n“But right from the beginning we have heard serious concerns from residents and businesses. People who like the changes, as well as people who don’t, have all told us that the initial public engagement and design process should have been better.\n“We are now three months into a six-month formal consultation period, and too many of the trial measures still haven’t been implemented.\n“Residents are frustrated with the uncertainty about what is happening and concerned about the implementation of the scheme. We share those concerns. No-one is satisfied with the current situation, whether they like the trial or not.\n“When we meet the Council’s Head of Strategic Transport and Infrastructure we will press him for clear proposals for implementation, better communications with residents, and a programme of meaningful public involvement. The trial will have better outcomes and more legitimacy if the next steps are clearly informed by local public opinion”.",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2021_11_28_just-eat-delivery-drivers/content_28.html": "A cold but determined protest took place in Sheffield today with IWGB Couriers facing off a disgraceful pay cut from employer Stuart Delivery.\nCllr Ruth Milsom stood with Olivia Blake MP, Cllr Jayne Dunn and many others to show solidarity with these brave striking workers who have no security in the disgraceful gig economy.\nSupport by donating to the strike fund: https://t.co/R8puJ876y1",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2021_11_30_access-to-food-plan-for-city-council-copy/content_30.html": "Cllr Ruth Milsom and local Labour activist Minesh Parekh wrote to First South Yorkshire and Stagecoach Yorkshire, asking them to explain what contingency plans they have in place to deal with adverse weather conditions.\n“It’s not unusual to have snow in Sheffield, and yet every time there’s a snowfall bus services tend to grind to a halt. We would like to hear from both private companies what steps they are taking to ensure Crookes and Crosspool will have bus services at the next snowfall.\nWe are also disappointed that Phil Medlicott has refused to work with Unite and give drivers a real-terms pay-rise, and through his refusal to work with drivers caused a twin loss of service by strike action and snow. Stagecoach must meet their drivers’ reasonable requests and deliver a service fit for our region.\nWhat’s clear, however, is that South Yorkshire’s private bus companies are failing to meet the needs of the people that live here. With Stagecoach currently trying to force a real-terms pay-cut onto their drivers, and First planning massive cuts to already depleted services, the only true solution to this crisis is bringing buses under municipal ownership.”",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_2024_04_05_crookes-active-travel-neighbourhood-trial-participation-and-learning/content_4.html": "In the summer of 2022 the Crookes / Walkley ‘Active Travel Neighbourhood’ trial scheme went live. In early May 2022 Ruth had appealed to the manager and chair of the SW Local Area Committee to start arrangements to host a series of open sessions that would create opportunities for residents and other stakeholders to engage in dialogue with Highways officers in charge of the scheme.\nRuth wrote:\n“I would like to arrange a series of face-to-face Q&A drop-in sessions with transport planning representatives present. I feel this will be a vital addition to the consultation process, which as far as I am aware will otherwise be in the form of a survey, alongside opportunity for consultees to make their views known by email or telephone.”\nLearning\nDuring the trial period and since, Ruth has continually made the case for the council to undertake more pro-active and thorough engagement work prior to deciding where future projects will be located and what they will entail. She has argued that understanding people’s travel habits and needs, as well as the barriers that prevent them changing their mode of transport, is vital.\nChange of approach\nIn March 2024 the Council’s Transport, Regeneration and Climate Change policy committee approved a new strategy to guide planning for future Active Travel infrastructure; this strategy embodies key learning outcomes from the Crookes / Walkley trial scheme, with a firm emphasis on early engagement with citizens, and co-production of proposals and plans.",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_category_updates/content_8.html": "Councillors welcome update on Crookes & Walkley Active Neighbourhood trial\nLocal Councillors press for clarity on Active Neighbourhood trial\nCrookes & Crosspool Councillors and Hallam MP outraged by bus companies’ cuts to service\nRuth objects to third planning application for development of Cobden View Road ‘community garden’",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk/content_1.html": "Meet Cllr Ruth Milsom\n“Everybody’s voice matters, and when residents or business owners have expertise to share, they should be involved in local decision making. Creating time to listen, and working together are vital elements of moving our city forward.”",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_2024_03_15_labour-councillors-super-charge-sheffield-s-net-zero-journey-with-new-green-investment-fund/content_7.html": null,
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_2023_11_14_on-street-electric-vehicle-chargers-to-be-installed-in-crookes-street/content_12.html": "Photo by CHUTTERSNAP on Unsplash\nAs part of its citywide roll-out of electric charging points, Sheffield City Council are soon to install double-headed fast chargers on Flodden Street, Crookes.\nIn 2019, the Council declared a climate emergency and is working towards Sheffield becoming a zero-carbon city. A key aspect of this transition is supporting the decarbonisation of residential vehicles.\nThese charging points are being delivered through grant funding received from the national Office for Zero Emission Vehicles.\nThe aim of these on-street charging points is to act as a pilot project, learn lessons for future roll-out across the city, and make it easier for people without driveways to own electric cars.\nLocations were identified based on the following criteria:\n- Areas where residents mainly rely on on-street parking\n- Where local people have already requested charging facilities\n- Where the Council expects a likely increase in charging demand\n- Where there is enough power grid capacity\nMinesh Parekh and Ruth Milsom, Labour Councillors for Crookes and Crosspool, said:\n“We’re really excited to see the journey to net-zero taking shape locally. Many Crookes homes do not have off-road parking, and we know traditional EV charging won’t be viable for them; we’re really pleased to be rolling out on-street chargers in Crookes, and for more to come throughout the city.”\nThe Council is looking to install fast chargers in locations across the city. This current round includes\n- Hope Street, Stocksbridge\n- Stainton Road, Greystones\n- Slate Street, Heeley\n- Freedom Road, Walkley\n- Upwood Road, Hillsborough\n- Bishopsholme Road, Fir Vale\n- Flodden Street, Crookes\n- Station Road, Darnall\n- Balmoral Road, Woodhouse\nThe Council also has a strategic objective to decarbonise its own fleet—and those of its contractors Amey and Veolia—of 1,145 vehicles. It aims to save 4,810 tCO2 per year through this, or 3% of the Council’s total emissions. The wider challenge to reach net-zero as a city will require residents and partners to decarbonise too.",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_enhancingbiodiversityrecord/content_17.html": "Objective: to increase biodiversity and habitat for pollinators in Crookes & Crosspool ward. It had been an election pledge of Ruth’s in 2021 - to protect green spaces and get more value from them.\nSpring 2023 - Ruth liaised with the council’s Ecology specialists and the Parks & Countryside team, and arranged for the grassy areas on council-owned land to be left to grow rather than mowed. This was also in response to a number of residents who had requested that ‘No Mow May’ be done to allow flowering plants to grow to maturity.\nA number of Bee Orchids were found in one of the grassed areas, which attracted keen interest from local ecologists, as it was the first instance of them in the west of Sheffield. This is a protected species - as all wild plants are in the UK.\nSummer 2023 - Ruth convened a group of Ecology Officers and representatives from Parks & Countryside to conduct a survey of wild plants in the un-mown grassy areas. Around ten species were identified which provide good habitat for bees, butterflies, moths and ladybirds.\nRuth listened to residents’ views and feedback, which was mixed - some liked that nature was left to flourish; others preferred the mown grass.\nSpring 2024 - a plan has been agreed, whereby most of the grassy areas will be mowed throughout the growing season, and the large area next to Blakeney Road flats will undergo cultivation as a wildflower meadow over the next couple of years.\nRuth and ward colleague Cllr Minesh Parekh secured £500 from the Local Area Committee budget (£100k) to support this project.\nAt the other end of the ward, Ruth also helped a small team from the Crosspool Forum cultivate a new patch of wildflowers at Hagg Copse, de-turfing and sowing the seed by hand.\nOther green spaces in the ward remain open to review as to how they are managed.",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_news_4/content_26.html": "Ruth Milsom\nGo to Content\nMENU\nRuth Milsom\nCLOSE\nMenu\nHome\nMeet Ruth\nRuth's Record\nNews\nContact\nQuick Links\nSheffield City Council\nSCC Record\nLabour's Action Team\nOlivia Blake MP\nCouncillor Minesh Parekh\nBack to Website\nNews\nPage 4\n#Updates\nJust Eat delivery drivers\n#PressComment\nConcern over third vaccine doses for ‘extremely vulnerable’\n#Policy\nAccess To Food Plan for city council\n#Updates\nCllr Milsom objects to revised planning application on Cobden View Road community garden\n#Updates\nCllr Ruth Milsom delivers Maiden Speech\nFilter By\nView All\n#Blog\n#PressComment\n#Updates\n#Interview\n#Policy\nFuture",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_2023_09_19_celebrations-as-popular-school-street-to-be-made-permanent/content_21.html": "On Wednesday 20 September, Sheffield Councillors will vote to make the “School Street” serving Westways Primary School permanent.\nSchool Streets are a pioneering approaching to transforming road safety and air quality outside schools, whereby car traffic to restricted outside schools, to create safer, healthier and more pleasant walking environments for school children. The School Street has been in operation for Westways Primary since the beginning of the Crookes and Walkley Active Neighbourhood in April 2022. Councillors serving on Sheffield’s Transport, Regeneration and Climate Committee are voting tomorrow to approve the measure being permanent, following a successful trial period.\nFran, whose daughter attends Westways Primary School, said:\n“I’m often walking three kids and a dog to school and the School Street gives you much more peace of mind when approaching school, before I was always worried about cars suddenly pulling in or out. It’s made a huge difference and there’s definitely less vehicle fumes on the way in.\nIt’s also really useful for kids to learn some road safety skills on the journey in a safer environment. It enables my daughter to practice crossing the road independently safely.”\nWestways’ School Street measure consists of:\n- a prohibition of motor vehicles on Mona Avenue and Mona Road, except for residents who live on those roads, on Mondays to Fridays from 8:15-9:15am and 2:45-3:45pm\n- one ways on Mona Avenue and part of Mona Road\n- No waiting at any time on parts on Mona Road\nCouncillor Ruth Milsom, at the School Street closure on Mona Avenue\nRuth Milsom, Councillor for Crookes and Crosspool, said:\n“Through this School Street our schoolchildren are gaining a safer road that’s easier to navigate, quieter, calmer, and safer. Westways’ School Street has been a success, and I’m keen to see many more rolled out across the city.”\nMinesh Parekh, Councillor for Crookes and Crosspool, said:\n“Far too many schools are on or near to roads with illegal levels of air pollution. As a society, we need to do far more can to give our children and young people a safe route to and from school. I’m really pleased that Westways’ School Street has been such a success: giving our young people a safer, calmer and less polluted environment when entering and leaving school.”",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_policy_2021_09_08_access-to-food-plan-for-city-council/content_34.html": "At Sheffield’s Full Council meeting on 8th September 2021, Councillor Ruth Milsom brought a notice of motion calling on the government to adopt the Right To Food in its National Food Strategy, and committing the city council to developing a citywide Access To Food Plan, bringing voluntary, charitable, and council partners together to maximise opportunityx, capacity and delivery to serve the tens of thousands living in poverty in Sheffield, including 1/4 of our children.\nScroll down to read the motion as carried.\n“RIGHT TO FOOD” – WORKING TOGETHER TO TACKLE FOOD POVERTY IN THE CITY AND TO DEVELOP A LOCAL FOOD ACCESS PLAN\nRESOLVED: That this Council:-\n(a) recognises that we are seeing a crisis of food poverty borne out of political choices and systemic failings from successive governments since austerity began;\n(b) believes that food poverty should never be seen as inevitable, and notes that from 1997 to 2010 poverty reduced significantly (for instance the Institute for Fiscal Studies notes that the number of children in relative poverty fell by over 1.1 million from 1997-2010), showing that with sufficient political willpower these issues can be tackled;\n(c) notes that after a decade of government-imposed austerity, child poverty and food hunger has increased significantly, and led to a precarious situation for many, even before the pandemic struck;\n(d) believes that the pandemic has exacerbated problems and pushed more people into food poverty, with perhaps the worst yet to come, and though it is hard to quantify the extent of food poverty in Sheffield we know the following:-\n(i) around 24,000 children are currently eligible for Free School Meals and therefore at risk of going hungry during the school holidays, with this number rising; and\n(ii) according to data collected by Voluntary Action Sheffield from 19 food banks, between 13th April 2020 and 8th June 2020 the number of households supported increased by just over 92% from 1144 to 2202 households; it is well acknowledged that this does not represent the full picture of emergency food aid during this time – and shows supply, not level of need, which could be much higher;\n(e) condemns the Government for the £20 per week cut to Universal Credit, which will come into effect from 6th October 2021, noting the following:-\n(i) universal credit is claimed by more than 5.5 million households across the UK;\n(ii) the Joseph Rowntree Foundation – a charity which researches poverty – states millions of households will face an income loss equivalent to £1,040 a year;\n(iii) the charity Citizens Advice has warned that a third of people on Universal Credit will end up in debt due to the reduction, which will inevitably lead to more people being reliant on food banks; and\n(iv) the 5-week wait for Universal Credit impacts people’s ability to pay bills and buy food, and believes that this wait is wholly unjustifiable and should be scrapped;\n(f) calls on the Government to address the 5-week wait for Universal Credit, using its resources to reduce this to less than one week to stop families in Sheffield falling into a debt trap that they may not get out of;\n(g) notes the plight of carers who have performed heroic efforts to look after our most vulnerable in society during the pandemic;\n(h) also calls on the Government to raise the Carer’s Allowance by £1000 a year in line with the Universal Credit uplift, and not what this Council believes to be the insultingly low 5p a day announced in April, allowing our carers, many of whom are young people, to not slide into poverty, with recent research suggesting a third struggle to make ends meet;\n(i) notes that the cross-party Overview and Scrutiny Management Committee established a working group to look at the Council’s response to Food Poverty in Sheffield, and that this first phase looked at the Council’s strategic role in relation to food poverty, and with organisations working in this space on food projects;\n(j) believes that all recommendations from the Food Poverty Working Group’s report should be adopted in full;\n(k) believes that, as noted in the Scrutiny Committee’s report, tackling food poverty requires a citywide effort, across the Council and public services, the VCF, communities and business, with a long term, structural approach to find lasting solutions and that, as such, the Council should adopt a Local Food Access Plan;\n(l) believes that this would help the Council, community organisations and other partners to work together to identify risks, assess the current response and coordinate action, with an understanding that those involved can achieve more by acting together than they could by acting separately, and helping to strengthen ‘food poverty alliances’ (the many different networks in the city working to combat\nfood poverty and hunger);\n(m) believes that tackling food poverty is not a standalone issue and is underpinned by wider socio-economic factors, and as such the development of a Food Access Plan must be part of the Council’s forthcoming Poverty Summit, which will in turn lead to the development of co-ordinated work to tackle inequality in the city;\n(n) gives its support to The Right to Food campaign, a national campaign which argues that the 11 million people in food poverty should be central to this strategy, and that ‘Right to Food’ should be enshrined into law – clarifying government’s obligations on food poverty and introducing legal avenues to hold government bodies accountable for violations;\n(o) calls for the ‘Right to Food’ to be incorporated into an amendment to the forthcoming Government White Paper in response to the National Food Strategy, and asks the Leader of the Council to write to the Government to make this case;\n(p) commits to developing a Food Strategy linking the need to reduce carbon to meet climate change targets and boosting biodiversity to protect nature, along with developing a wellbeing economy and improving health equality across the city;\n(q) notes that research evidence shows that urban agriculture provides many benefits in addition to food provision; and these include:-\nImproving human health through physical exercise and a more nutritious diet\nMental health benefits of being outside and engaging in community\nProtecting soil, improving soil quality, and maintaining carbon storage in soil\nImproving and enhancing biodiversity\nIncreasing food supply resilience against climate and economic events\nReducing food miles and food waste\nSupporting plant genetic diversity\nReducing urban heat island effects\nPaid employment and training opportunities\nCommunity empowerment\nReducing poverty\nImproving community cohesion\nFeeding urban communities sustainably\n(r) commits to working with local organisations like ShefFood, Heeley City Farm, FoodWorks, the University of Sheffield, and others, to develop a Food Strategy to support a rapid increase in urban and peri urban food production;\n(s) will seek to protect the use of greenbelt land around Sheffield for sustainable agriculture and nature;\n(t) notes that there are now 2,000 food banks across the UK, and believes that in the 6th richest country in the world this is an absolute disgrace;\n(u) notes that food bank usage has increased during the pandemic, but the preceding decade of austerity meant millions of people were already needing to rely on them – for example, 1.6 million emergency food parcels were distributed by the Trussell Trust in 2019;\n(v) believes that main reasons for referrals to food banks are changes made since 2010 to the benefit system – including payment cuts, delays to benefit payments, and punitive benefit sanctions – as well as the rise of increasingly insecure work\nand in-work poverty;\n(w) calls on the Government to commit to eradicate food bank usage within three years and reduce usage by half within 12 months; and\n(x) thanks all food banks in Sheffield for their work, and commits to doing everything we can to support them in their invaluable work for communities.",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_news_2/content_16.html": "Ruth Milsom\nGo to Content\nMENU\nRuth Milsom\nCLOSE\nMenu\nHome\nMeet Ruth\nRuth's Record\nNews\nContact\nQuick Links\nSheffield City Council\nSCC Record\nLabour's Action Team\nOlivia Blake MP\nCouncillor Minesh Parekh\nBack to Website\nNews\nPage 2\nCelebrations as popular “School Street” to be made permanent\nCrookes Councillor calls for closed sports centre to come into community use\n#Updates\nCouncillors welcome update on Crookes & Walkley Active Neighbourhood trial\n#Updates\nLocal Councillors press for clarity on Active Neighbourhood trial\n#Updates\nCrookes & Crosspool Councillors and Hallam MP outraged by bus companies’ cuts to service\nFilter By\nView All\n#Blog\n#PressComment\n#Updates\n#Interview\n#Policy\nPast\nFuture",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_record/content_11.html": "Ruth stands up for Crookes and Crosspool.\nShe’s listening to residents to create change in our area by engaging with community groups, and she is creating influence throughout the city by leading on Council initiatives from food networks to social care.",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2021_07_07_cllr-ruth-milsom-delivers-maiden-speech/content_32.html": "“I was elected to this council on a pledge to fight tooth and nail for our national health service.”\nIn her maiden speech to Sheffield City Council, Ruth challenges the Tory government about issues in Primary Care.\n“I was elected to this council on a pledge to fight tooth and nail for our national health service.”\nIn her maiden speech to Sheffield City Council, Ruth challenges the Tory government about issues in Primary Care.",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_news/content_3.html": "Ruth Milsom\nGo to Content\nMENU\nRuth Milsom\nCLOSE\nMenu\nHome\nMeet Ruth\nRuth's Record\nNews\nContact\nQuick Links\nSheffield City Council\nSCC Record\nLabour's Action Team\nOlivia Blake MP\nCouncillor Minesh Parekh\nBack to Website\nNews\nPage 1\nCrookes Active Travel Neighbourhood trial: participation and learning\nLabour Councillors super-charge Sheffield’s net zero journey with new Green Investment Fund\nSheffield Labour says NHS Dentistry in need of a rescue plan as 84.9% of dentists in Yorkshire shut door on new adult patients\nSheffield United: Councillors call on football club to let Crookes community use boarded-up sports centre\nOn-street Electric Vehicle chargers to be installed in Crookes street\nFilter By\nView All\n#Blog\n#PressComment\n#Updates\n#Interview\n#Policy\nPast",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_presscomment_2021_11_25_concern-over-third-vaccine-doses-for-extremely-vulnerable/content_33.html": null,
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_news_3/content_20.html": "Ruth Milsom\nGo to Content\nMENU\nRuth Milsom\nCLOSE\nMenu\nHome\nMeet Ruth\nRuth's Record\nNews\nContact\nQuick Links\nSheffield City Council\nSCC Record\nLabour's Action Team\nOlivia Blake MP\nCouncillor Minesh Parekh\nBack to Website\nNews\nPage 3\n#Updates\nRuth objects to third planning application for development of Cobden View Road ‘community garden’\n#Interview\nWestern Road Cobbles\n#Updates\nVisit to S6 Foodbank\n#Update\nSolidarity with UCU strikers\n#Updates\nLetter to Stagecoach and First Buses\nFilter By\nView All\n#Blog\n#PressComment\n#Updates\n#Interview\n#Policy\nPast\nFuture",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_2024_02_16_sheffield-labour-says-nhs-dentistry-in-need-of-a-rescue-plan-as-84-9-of-dentists-in-yorkshire-shut-door-on-new-adult-patients/content_2.html": "As Chair of the Health Scrutiny at Sheffield City Council, Councillor Ruth Milsom has commissioned a survey to better understand people’s real experiences of accessing dental services in Sheffield. This has been raised off the back of concerns about the impact of the lack of access to NHS dental care in the city.\nThe collapse of NHS dentistry has left millions of patients unable to get an appointment when they need one. Analysis of patient survey data suggests that last year, 4.75 million people were either told there were no appointments available or the practice wasn’t taking on new patients, when they last tried to book an appointment.\nHealthwatch England has reported horror stories of people forced to pull their own teeth out, with 1 in 10 Brits claiming to have attempted their own dental work. Studies show that untreated gum disease has links with increased risk of cardiovascular disease and stroke.\nRuth Milsom, Labour Councillor for Crookes and Crosspool ward and Chair of Sheffield City Council’s Health Scrutiny committee\nLabour’s Ruth Milsom said:\n“I have commissioned this survey to gather as much information as possible about people’s real experiences of accessing an NHS dentist.\n“We have all seen the horror stories of people extracting their own teeth in desperation. The fact that the largest cause of hospital admissions among 6- to 10-year-olds is tooth decay should be causing panic and urgent remedial action among healthcare leaders, but we’re not seeing that level of urgency.\n“This rot comes from the top. Without the right action at Government level, no local health services will be able to take all the action we need. I hope this survey data will show the Government exactly what changes we need to improve NHS Dentistry here in Sheffield.”\nThe survey can be found here: https://haveyoursay.sheffield.gov.uk/dentistry-survey\nThe British Dental Association have reported that tooth decay remains the most common reason for hospital admissions in children aged between 6 and 10 years – and that rates for children and young people living in the most deprived communities are nearly 3.5 times that of those living in the most affluent.\nVast parts of England are now ‘dental deserts’, where no dentists are available. In the South West, 99% of dentists have shut their doors to new adult patients, with just 4 practices welcoming new patients across the entire region. The government has launched a pilot in Cornwall where NHS dentistry will only be offered to children and the most vulnerable.\nCouncillor Milsom continued:\n“The lack of access to routine dental services is a tangible effect of sustained austerity. The Government should have been investing in dentistry—and many other aspects of the NHS—every year since 2010.\n“Instead, services across the healthcare system are breaking down, and people’s long-term health prospects put at risk.”\nNationally, Labour will introduce a dentistry rescue plan so that patients can get an NHS dentist again, as new analysis reveals the overwhelming majority of practices have shut their doors to new patients. Of the 489 dental surgeries that have provided a recent update in Yorkshire and the Humber, 415 are not accepting new adult patients.\nLabour is promising to take immediate action to provide care for those in most urgent need, and long-term reform to restore NHS dentistry to all who need it. The party’s plans include:\n- Funding NHS dental practices to provide 700,000 more urgent appointments, for patients in need of things like fillings and root canal.\n- Incentives for new dentists to work in areas with the greatest need, to tackle the emergence of ‘dental deserts’ where no NHS dentists are taking on new patients.\n- Supervised toothbrushing in schools for 3-5 year olds, targeted at the areas with highest childhood tooth decay\n- Reform the dental contract to rebuild the service in the long-run, so NHS dentistry is there for all who need it\nThe plans will cost £111 million a year in total and be funded by abolishing the non-dom tax status, which allows people who live and work in Britain to pay their taxes overseas.\nWes Streeting, Shadow Health and Social Care Secretary said:\n“The Conservatives have left NHS dentistry to wither on the vine, and now the service is barely worthy of the name. Patients in Sheffield are told to go without or do it themselves, with DIY dentistry now shockingly common in Tory Britain.\n“The slow death of dentistry is the Ghost of Christmas Future for the NHS, if the Conservatives are given a fifth term: those who can afford it going private and those who can’t left with a poor service for poor people.\n“Labour has a fully-costed plan to rescue NHS dentistry by gripping the immediate crisis and reforming the service in the long-term. We will provide 700,000 urgent appointments and recruit new dentists to the areas most in need, paid for by abolishing the non-dom tax status.”",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_category_updates_2/content_15.html": "Ruth Milsom\nGo to Content\nMENU\nRuth Milsom\nCLOSE\nMenu\nHome\nMeet Ruth\nRuth's Record\nNews\nContact\nQuick Links\nSheffield City Council\nSCC Record\nLabour's Action Team\nOlivia Blake MP\nCouncillor Minesh Parekh\nBack to Website\n#updates\nPage 2\nLetter to Stagecoach and First Buses\nJust Eat delivery drivers\nCllr Milsom objects to revised planning application on Cobden View Road community garden\nCllr Ruth Milsom delivers Maiden Speech\nFilter By\nView All\n#Blog\n#PressComment\n#Updates\n#Interview\n#Policy\nFuture",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2021_07_20_cllr-milsom-objects-to-revised-planning-application-on-cobden-view-road-community-garden/content_31.html": "Revised planning application 21/02711/FUL\nI have submitted an objection (read here), based on several factors which in my view make this proposed development unsuitable and not in keeping with Sheffield’s local frameworks.\n- Over-development of an already densely populated area\n- Floor area of all apartments falls short of Nationally Described Space Standards\n- Robs the northern end of the District Centre of a valuable green open space\n- Lacks any provision for car parking (in fact, the Travel Plan even suggests extending double yellow lines further down Cobden View Road)\n- Lacks sufficient secure storage for bicycles",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2022_03_31_ruth-objects-to-third-planning-application-for-development-of-cobden-view-road-community-garden/content_27.html": "“I have submitted a letter of objection regarding the latest planning application to develop the Cobden View Road / Northfield Road green site (22/00723/FUL). A copy of my letter of objection is here: https://bit.ly/CVR-CllrMilsom-object\nI’m aware that the position I am taking on this is not in keeping with everyone’s views. I stand firm, however, because for me there are fundamental flaws in the proposed development that mean it is out of kilter with national and local planning objectives.\nIn my opinion, such a development would in no way compensate for the loss of a much appreciated green ‘breathing space’ in this densely built-up part of Crookes.”",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_category_policy/content_6.html": "Ruth Milsom\nGo to Content\nMENU\nRuth Milsom\nCLOSE\nMenu\nHome\nMeet Ruth\nRuth's Record\nNews\nContact\nQuick Links\nSheffield City Council\nSCC Record\nLabour's Action Team\nOlivia Blake MP\nCouncillor Minesh Parekh\nBack to Website\n#policy\nPage 1\nAccess To Food Plan for city council\nFilter By\nView All\n#Blog\n#PressComment\n#Updates\n#Interview\n#Policy",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_category_presscomment/content_5.html": "Ruth Milsom\nGo to Content\nMENU\nRuth Milsom\nCLOSE\nMenu\nHome\nMeet Ruth\nRuth's Record\nNews\nContact\nQuick Links\nSheffield City Council\nSCC Record\nLabour's Action Team\nOlivia Blake MP\nCouncillor Minesh Parekh\nBack to Website\n#presscomment\nPage 1\nConcern over third vaccine doses for ‘extremely vulnerable’\nFilter By\nView All\n#Blog\n#PressComment\n#Updates\n#Interview\n#Policy",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_2023_09_06_crookes-councillor-calls-for-closed-sports-centre-to-come-into-community-use/content_25.html": "At today’s full council meeting, Crookes and Crosspool Councillor Ruth Milsom called on the Council to investigate bringing the disused sports ground at Weston View in Crookes into community use.\nThe Derek Dooley Sports and Community Centre, currently closed, is named after the notable footballer who took key roles at both Sheffield Wednesday and Sheffield United throughout his lifetime, including as player, manager and chairman. It is owned by Sheffield United Football Club and its community foundation.\nPhotograph of Crookes Councillor Ruth Milsom outside the Derek Dooley Sports and Community Centre.\nCouncillor Ruth Milsom tabled the following question to the Councillor Richard Williams, Liberal Democrat Chair of the Council’s Communities, Parks and Leisure policy committee:\n“What discussions, if any, have taken place with SUFC about their disused sports ground at Weston View in Crookes and ways to bring it into community use?”\nThe centre has previously been operated as a gym and community sports facility, and as recently as 2019 Sheffield United FC advertised coaching sessions for boys and girls at the centre. The same SUFC coaching provision is now being offered at the Bole Hill Recreation Ground, with the Weston View site sitting empty.\nAt the meeting, Cllr Milsom pressed Cllr Williams about the site, asking for the Council to negotiate community usage with SUFC, calling it a ‘shame’ that the site isn’t being used.\nLabour’s Ruth Milsom said:\n“It is a real shame that at Weston View there is the potential for a high-quality community facility, that is currently sat being unused. I’ve had conversations with local residents, with community organisations like the Crosspool Juniors Football Club, and know how valuable it would be if we could bring a new life to that site.\n“When it is named the Derek Dooley Sports and Community Centre, it should be open to the local community to use. I hope the Council and SUFC can come together and find a solution to bring it back to life.”\nMeurig Edwards, Chairman of Crosspool Juniors Football Club, said:\n“We are working hard to improve our facilities and we have a long-term plan to develop and improve our site at Myers Grove, but we desperately need more grounds for training and matches, within easy reach of Crosspool and surrounding areas.\n“It’s sad to say that with our current facilities we can’t meet the needs of all of our teams. Some of our matches are cancelled for lack of space to play. This is disappointing and frustrating for everyone involved. It affects our teams and players from across Sheffield and South Yorkshire who we play against.”\n“There is a real shortage of artificial and floodlit pitches which are vital for training in the darker winter months. We have seen a growth in grass roots football recently, especially in new girl’s and women’s teams. Facilities have not kept pace with this welcome increase in participation”",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2022_06_30_crookes-crosspool-councillors-and-hallam-mp-outraged-by-bus-companies-cuts-to-service/content_19.html": "Labour Councillors Minesh Parekh and Ruth Milsom, and Sheffield Hallam MP Olivia Blake, have voiced their anger at private bus companies’ plans to slash South Yorkshire’s bus services by a third.\nPrivate bus companies are set to begin removing a third of South Yorkshire’s bus network from as early as July.\nPeople in Sheffield and Rotherham are set to face withdrawal of several key bus services. This will be followed by further cuts in October when the government withdraws its covid-19 transport grants in October.\nCouncillor Ruth Milsom said:\n“In a climate emergency, we need public transport to be accessible, affordable and reliable. Our service was already on the brink and these cuts will only make it even harder for people.\n“What this makes clear is that we desperately need to move to a system of public control, as soon as possible, so that private bus companies no longer dictate what routes are offered, so timetables and fares work for people rather than shareholders.”\nCouncillor Minesh Parekh said:\n“The rules governing our buses have created a market that is fundamentally broken. Private bus companies can pick and choose which buses they want to run, and pocket every penny of profit, and then at the same time refuse any routes they don’t want to provide—and abandon our communities along the way.\n“The Tories promised to deliver a “London-style transport system” as part of its “levelling-up” agenda. These cuts—the further erosion of low-carbon transport in South Yorkshire so soon after our promised rail revolution fell apart—show that this was yet another promise they simply never intended to deliver.”\nCllr Milsom added further:\n“This demonstrates exactly how the Government is failing to deliver joined-up decision-making: on the one hand asking local authorities to implement Low Traffic schemes that ask people to reduce their car dependence, while at the same time refusing to make public transport a viable and attractive alternative to use.”\nBoth Councillors calling on the Prime Minister to make good on his promise to deliver London-style connectivity, and provide the funding needed to save South Yorkshire’s bus services.\nSheffield Hallam MP, Olivia Blake, shared their concerns:\n“In the middle of both the climate and cost-of-living crises, more cuts to our bus services are truly unconscionable, further reducing the reliability of public transport for people in Sheffield, meaning they might to have to buy or use a car or risk being cut off from jobs, friends, medical appointments and opportunities.\nThe Government promised to deliver a London-style bus network across the country, and instead they’re sitting by idly as South Yorkshire’s bus network is dismantled bit-by-bit, showing once and for all they can’t even be trusted to get us from A to B.”\nNotes:\nService changes from 24 July 2022\nSheffield\nThe following routes will have no provider:\nService 32/32a Sheffield – Firth Park – Parson Cross : Entire service will be withdrawn.\nService 135/135a Rotherham – Sheffield via Chapeltown: Early morning, evening and Saturday/Sunday services will be withdrawn.\nService 208 Whiston – Sheffield: Last evening trip from Sheffield – Whiston will be withdrawn. Sunday daytime service will be withdrawn.\nService X74 Sheffield – Tinsley Park: Some early morning and evening journeys withdrawn.\nRotherham\nThe following routes will have no provider:\nService 73: Early morning, evening, and Sunday services between Rotherham and Treeton will be withdrawn.\nService 114: Early morning and evening services between Rotherham and Herringthorpe will be withdrawn.\nService 116: Early morning, evening, and Sunday services between Rotherham, Thrybergh and Ravenfield will be withdrawn.\nService 135/135a: Early morning, evening and Saturday/Sunday services between Rotherham and Thorpe Hesley plus links to Chapeltown will be removed.\nService 208 Whiston – Sheffield: Last evening trip from Sheffield – Whiston will be withdrawn. Sunday daytime service will be withdrawn.\nService X74 Sheffield – Tinsley Park: Some early morning and evening journeys withdrawn.\nSouth Yorkshire’s bus network\nThe Department for Transport (DfT) is responsible for the national bus policy framework, ad hoc capital funding to local authorities and operators, and legislation:\nOver more than 30 years, the DfT has stated an aim to increase bus use and halt the decline that has continued since the 1950s.\nIn March 2021, the Government launched ‘Bus Back Better’ – a National Bus Strategy for England. This Strategy set out a requirement for local transport authorities to prepare and publish a Bus Service Improvement Plan (BSIP) by 31 October 2021, with the aim of making bus the mode of choice for the many.\nThe Government pledged £3 billion in funding across the country to help realise the aims of the National Bus Strategy and BSIPs.\nThe South Yorkshire Mayoral Combined Authority (SYMCA) received nothing despite lodging a bid for £434m to achieve BSIP objectives for the region including capping fares, free travel for young people, quicker journeys, more journey options, and zero emission buses to make travel cleaner and greener towards a net-zero future.\nIn March 2022, SYMCA authorised the assessment of a proposed bus franchising scheme in South Yorkshire. The notice of intention sets in motion the legally-required work to see whether a franchising model – which would bring regulation of routes, frequencies, fares, and tickets under local control – could help efforts to transform the region’s transport. Since becoming South Yorkshire’s Mayor, Oliver Coppard has appointed a Franchising Manager to oversee the process at pace.\nIn April 2022, SYMCA formally agreed an Enhanced Partnership Plan and Enhanced Partnership Scheme to deliver South Yorkshire’s BSIP. More information: https://southyorkshire-ca.gov.uk/explore/transport.\nThe Government’s Bus Recovery Grant (BRG) was set up to support commercial bus operators in England due to the ongoing impacts of coronavirus (COVID-19) on their revenue from reduced passenger numbers. BRG funding support from Government ends on 4 October 2022.\n*Source: National Audit Office https://www.nao.org.uk/wp-content/uploads/2020/10/Improving-local-bus-services-in-England-outside-London.pdf",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_category_interview/content_14.html": "Ruth Milsom\nGo to Content\nMENU\nRuth Milsom\nCLOSE\nMenu\nHome\nMeet Ruth\nRuth's Record\nNews\nContact\nQuick Links\nSheffield City Council\nSCC Record\nLabour's Action Team\nOlivia Blake MP\nCouncillor Minesh Parekh\nBack to Website\n#interview\nPage 1\nWestern Road Cobbles\nFilter By\nView All\n#Blog\n#PressComment\n#Updates\n#Interview\n#Policy",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2022_10_26_councillors-welcome-update-on-crookes-walkley-active-neighbourhood-trial/content_18.html": "In September 2022 Labour Councillors in Crookes and Crosspool and Walkley wards called on the Council’s senior transport and infrastructure officers to pause physical implementation of the Active Neighbourhood trial to allow space for meaningful communication with the public.\nAn update has now been published, along with a forward plan, and more explanation of the rationale behind the scheme and the measures within it. A letter has also been posted to residents.\nCllr Ruth Milsom said, ‘There has been a huge amount of frustration and confusion surrounding the Crookes/Walkley Active Neighbourhood trial. I’m extremely pleased that the Transport Planning team listened to us and recognised the need for clarity and communication as the scheme goes forward.’\nA new online feedback form has been added to the Connecting Sheffield update page. ‘I would encourage people to make full use of this as part of the continuing consultation on the trial,’ said Ruth; ‘we really do want everyone to have their say, whether they like the scheme or not.’\nThe remaining parts of the trial (with some changes) will be implemented by the end of November. The trial period will be extended through to March and final decisions will be made next summer. On the website there are updated maps and a table showing the dates when work will take place to complete the implementation of the trial. The website now also includes a document explaining where and why some changes to the trial have been made.\nLabour Councillors have been clear that they have never tried to stop the trial or prevent measures being introduced. Cllr Minesh Parekh said, ‘We all want to see quieter, safer streets that aren’t used as cut throughs, and with pavements that aren’t chock-a-block with cars on them. For a low-traffic neighbourhood to work, in Crookes and Walkley or anywhere in the country, it needs to be done with residents, not done to them. It’s for this reason Ruth and I pushed to hold in-person public consultation sessions with transport officers shortly after I was elected, and why I’m pleased residents are now receiving more clarity about implementation for the future of the scheme.’\nRuth and Minesh say they have been working hard behind the scenes to improve the Westways ‘School Street’ measures, as well as pushing for a solution to double parking and road safety issues on School Road. ‘Our low-traffic neighbourhood needs to be a living, breathing scheme if it’s to succeed,’ said Minesh. ‘It’s great that additional measures—including proposed double yellow lines along School Road—are now also being consulted on, as these will deter double-parking, make our streets more accessible, and I hope help support the trial to be a success.’\nThey also want to see more benefits for cyclists and people wanting to take up cycling. Ruth commented, ‘Minesh and I have been working pro-actively with representatives of the cycling community, looking at what appetite there might be for secure on-street cycle storage, and mapping out suitable locations for additional cycle parking.’\nActive Neighbourhood Trial feedback form (scroll to the bottom)\nSchool Road double yellow lines Traffic Regulation Order: consultation open until 10 November 2022; see diagram pictured below. Email all comments to traffic.regs@sheffield.gov.uk\nMinesh and Ruth can be contacted via email: minesh.parekh@councillor.sheffield.gov.uk / ruth.milsom@councillor.sheffield.gov.uk",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_2024_02_07_sheffield-united-councillors-call-on-football-club-to-let-crookes-community-use-boarded-up-sports-centre/content_10.html": null,
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_contact/content_9.html": "If you need assistance or just simply want to say hi, you can reach Ruth Milsom through any of the following ways:\n📮 By post:\nSheffield City Council\nTown Hall\nSheffield\nS1 2HH\n📱 By phone: 0114 2735380 (Town Hall)\n📧 By email: ruth.milsom@councillor.sheffield.gov.uk\n🐦 On Twitter: RuthMilsom\n💻 On Facebook: RuthMilsomLabour",
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_update_2021_12_02_solidarity-with-ucu-strikers/content_24.html": null,
  "http_www_ruthmilsomlabour_org_uk_/http_www_ruthmilsomlabour_org_uk_updates_2021_12_16_visit-to-s6-foodbank/content_29.html": null
}