{
  "https_www_swaleindependentsalliance_org_/https_www_swaleindependentsalliance_org_membership-and-donations_html/content_6.html": "Home\nK.C.C Candidates\nYour independents\nNews\nContact US\nMembership and Donations\nHome\nK.C.C Candidates\nYour independents\nNews\nContact US\nMembership and Donations",
  "https_www_swaleindependentsalliance_org_/https_www_swaleindependentsalliance_org_news_html/content_2.html": "|\nCouncillor Thomas Nundy and Councillor Elliot Jayes call for action on the fly tipping atrocities at the Eastchurch Gap. Despite the hard work of volunteers and community groups to keep Minster Beach clean, the lack of respect, in terms of both the law and the area, continues to pollute the seafront and surrounding areas, as shown in shocking footage. |",
  "https_www_swaleindependentsalliance_org_/https_www_swaleindependentsalliance_org/content_1.html": "Doing Politics Differently\nSince 2019 the Swale independents alliance has overseen the most dynamic and positive period in Swale politics for many years, always working hard to address years of under investment and actively promoting the area as a place to visit and to do business.\nWe have supported community groups, helped residents fight injustice, and have a history of delivering on the promises made during election campaigns. As independents we don't get told how to vote by national parties, we make decisions based on the ward we represent and find ways to work together for the betterment of Swale as a whole.\nWe have demonstrated that where Councillors work together, for the people they serve and not the party, they deliver far more of what the residents need and want.\nSwale Independents",
  "https_www_swaleindependentsalliance_org_/https_www_swaleindependentsalliance_org_kcc-candidates_html/content_5.html": "Your Independent Candidates for\nKent County Council\nElections\nMay 1st 2025\nDerek Carnell for Sittingbourne North |\nA retired Magistrate and trustee of the Milton Creek Country Park, Derek has what it takes when it comes to cross party collaboration and achieving the results that are best for his area. Derek, if elected, wants to push for a new Secondary School in North Sittingbourne, address local drainage issues with a new major programme and have a focus on long-term improvement due to the state of our roads. Other focuses would be making sure proper challenges were put to mass housing developments and ensuring children are provided with the best education opportunities including SEND pupils.\n|\nElliot Jayes for Isle of Sheppey |\nAn active Councillor already, Elliot has shown a tremendous commitment to doing what's best for people from the Isle of Sheppey.\nElliot is standing in the Kent County Council election because he feels the island needs an independent choice, free from the national political party's agendas, his only interest is improving the island for the better. Having lived on the island all his life, he has seen the lack of time, energy and money invested in our lovely island by Kent County Council. He sees the need for improved youth services, bus and social care service. The need for better roads, footpaths and cycle paths. The need to reverse the cut backs on library open times and the need to stop the conservative administration, giving themselves another 15% pay rise (as they did immediately after the last election). |\nTom Lee for Sittingbourne South |\nAt 59-years-old, Tom is a retired police officer with a strong commitment to honesty, integrity, and public service.\nTom has lived in Swale all of his adult life, so he understands the issues that matter most to local people. Tom is not standing for election as a stepping stone to a political career—He simply wants to serve and make a difference. If elected, he will be fully committed as he has no other job, meaning he can dedicate 100% of his time to representing you. He will always be approachable, available, and ready to listen. Tom believes that together, people can make a real difference. |\nMike Baldock for Swale West |\nAn experienced and well versed politician, Mike is the leader of the Swale Independents group. Mike fights passionately for truth and upholds the constitution, it being the heart of the democratic process.\nMike is well know by the residents of his ward, for being proactive and helpful. In his councillor role, Mike also works on his passion project, the Loneliness scheme. He recognises that loneliness and Isolation can have an incredible impact on both health and wellbeing and has put together an organisation that brings people together, when they most need it. You can find more details is you click below. If Elected into Kent County Council, Mike aims to reduce the money spent on bureaucracy and blocking local residents and make sure that it is put to delivering the changes that people really want. With the current Governments upcoming Unitary Plan, K.C.C will not exist for much longer, so getting the right people in, to do the right thing for the residents is more important than ever, now. Click below for more on Mike's Loneliness Project and his campaign. |",
  "https_www_swaleindependentsalliance_org_/https_www_swaleindependentsalliance_org_cdn-cgi_l_email-protection/content_7.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_swaleindependentsalliance_org_/https_www_swaleindependentsalliance_org_contact_html/content_3.html": "CONTACT US\nFor general enquires please email:\n[email protected]\nYou can write to us at: Swale Independents Alliance, C/O 8 WISES LANE, Sittingbourne, Kent ME10 1YN\nOr you can email your Swale independent Councillor by clicking the links below.\n|\nSwale Independents\n8 Wises Lane, Sittingbourne Kent, ME10 1YN T: 01795 471139\nE: [email protected] |",
  "https_www_swaleindependentsalliance_org_/https_www_swaleindependentsalliance_org_your-independents_html/content_4.html": "CLLR MIKE BALDOCKParty Leader\n|\nCLLR ELLIOT JAYESDeputy Party Leader\n|\nCLLR THOMAS NUNDYMinster Cliffs\n|\nCLLR DEREK CARNELLKemsley\n|\nCLLR CARRIE POLLARDMurston\n|\nCLLR SARAH STEPHENWoodstock\n|\nCLLR PAUL STEPHENWoodstock\n|"
}