{
  "http_www_barryedwards_info_/http_www_barryedwards_info_policy_html/content_5.html": "What are our guiding principles:\nSave the Country – Now Parliament has returned to being the law making body for the UK. Let’s turn Britain Green, promote self-sufficiency and buy British.\nSave our Democracy – We currently have a non-representative democracy where Lib Dem, Tory, Labour & SNP parties are taking advantage of their position and making decisions on your behalf that you don’t want. This must change?\nSave the economy – By reducing spending on non-critical items, reusing resources, recovering energy and making our way in the World, we can have more money available to improve peoples’ standard of living, so long as this does not cause impacts on well-being or the environment?\nSave the Environment – By having a consistent approach to people and resources each person in the country can have the right to live, be housed, have food, water, energy etc, providing for people in a the country that does not have unlimited resources. As mention most resource and environmental issues are effectively solved by fewer people, but to cleverly manage investment and control of waste the UK could have a serious improvement in quality of life for all and save us Billions of Pounds. To save our countryside, fisheries and the open space where you live, allowing you to have a healthier and better experience of the world around you?\nSaving Honesty – By telling you how it is. GREEN will not fudge, or try and circumvent being questioned. I started in politics to help local people, I have done this for the last 15 years, I am not about to change now. If this embarrasses the political elite, then tough, they should be honest. There is a fundamental lack of integrity within the Lib Dem, Tory and Labour party, a contempt for the voter and a lack of understand of normal society. These parties are out of touch with reality. This has to change; I am truthful, Sustainability is truthful. The fact that we change our policy, in accordance to the peoples wishes, is not a U-Turn, it is because we do what the people want and change policy accordingly.",
  "http_www_barryedwards_info_/http_www_barryedwards_info_campaigns_html/content_6.html": "Over the years I have been passionate about helping local residents. These are some of the past and present campaigns that I have led, or I am currently giving assistance.\nRichmond United Group voting to Save Twickenham Riverside in the face of the Lib Dem “luxury housing scheme”\nGrowth in Twickenham & Richmond\nThis map is the present day urban footprint, the areas in grey are the only space left and represent our parks and open spaces. If the Lib Dems, Tories and Labour want to build 42,000 houses by 2050, where can this take place without destroying all the open space?",
  "http_www_barryedwards_info_/http_www_barryedwards_info_news_html/content_4.html": "State of the UK – October 22, 2022 – updated 20/11/23\nWell it has been a long break, but the time has come to stand up and be counted again…\nBut Oh dear – What a mess!!\nIn 2020 we had Covid-19 and if that wasn’t bad enough, then in 2022 we have war in Europe after 75 years of peace, but then we had “witch-hunts” from the Conservatives on themselves and the Labour, Lib Dems and SNP starting to plan to gain power. Instead of everyone coming together in the interest of the nation, irrational self-interest has been the strategy of all these politicians. They are not working for us to provide a safe society, beautiful country and stable economy, they are fighting over an empire of dirt.\nAfter fighting for the right of the UK to remain an independent country with its own law making capacity and integrity, a vote was cast and the majority had its voice heard. I have now decided to come home to where all self-respecting people should be on the side of the planet that provide all the things we need.\nWe don’t have to be zombie consumers, buying everything offered by slick salespeople, we can make up our own mind and decide what is actually important in life. Especially as we are standing at the cross-road in politics, it’s time for some common sense, it time for good choices, it’s time for change.\nYou may think that the Greens are not ready to govern and despite being very nice people, unfortunately you would be right. It’s not just the mainstream media’s propaganda that is saying that Green are not sustainability savvy, the Greens themselves want to ban many of your needs and wants (which in fact you could still have but in a slightly different form) and some Greens even support these pressure groups gluing themselves to roads. Well, the actuality is that just stop oil are not eco-activists, they are a political pressure group. Professional environmentalist vow not do harm to the environment and that also means doing no harm to people. So, in reality this means that at present no-one in society is actually implementing planned management of resources in a way that correctly balances Society, Environment and Economics.\nI am a Chartered Environmentalist, Member of the Institute of Environmental Sciences, an International Standards Lead Auditor BS EN ISO14001:2015, I have been a professional Environmental Consultant for 25 years and have just completed an Environmental Psychology Masters. So, in my professional judgement where are we? In transition from a “use once” waste economy to a “reuse” Reconomics, where people will become far better off, because they have more resources and society doesn’t waste things anymore.\nThe tired old political elite the Conservatives, Labour, Lib Dems and SNP actually believe that economic growth is good. No, in a finite world that isn’t getting any bigger, growth just means using up all the things we need faster. Speeding up towards a resources cliff. You notice I am not talking in media terms, such as the climate crisis etc. Anthropogenic (man-made) climate change is happening, but that and the term sustainability have been hijacked by economists, stating their way is “smart growth”. Unfortunately this is a deception, there is no smart growth, it is just growth. And increasing population causes climate change, because there are even more carbon footprints.\nThe only way to live into the future is to focus on our quality of life, a clean and safe environment and having a stable economy that provides for the needs of everyone, without using everything up. That’s why the country needs the political party that has environmental experts that are capable of Environmental Management Systems (EMS) providing knowledge of managing planetary dynamics for the benefit of all.\nSo please every time you hear a story in the media about sustainability, it is just growth with another name and growth undermines stability, which means in the long run you be have plenty now and run out of everything tomorrow. You see a pound today and a pound tomorrow, is way better than one pound fifty now and nothing tomorrow.\nIt’s time to decide – same old same old boom and bust, self-interest and greed. I have chosen live well and to help the sustainability build this brighter better future, that is respectful, honorable, rational and actually will be more successful than the economic law of the jungle we have now that is capitalism.\nYes we want good strong markets, but leaving societies decisions the “unseen hand of Adam Smith” moves us towards a future without leadership. We need to manage our society, not leave it the markets, we need good decisions based on competency, we need to make better choices, we need to get rid of senseless greed and do right by each other.\nI see the need for change, we need a greener, brighter future, now is the time for proper well managed sustainability.\nIs this democracy in Action?? Don’t think so – June 20, 2017\nAt last the chance, to do what the people want, on Twickenham Riverside?\nBut Oh dear – Yet another property development!!\nIn 2010 to stop the Lib Dem “luxury housing” scheme, the residents of Twickenham voted within the “Barefoot” consultation for a peoples plan for Twickenham Riverside. Yes very curious, the results have been removed from the Council’s website, but luckily I copied them, see below. Residents then voted the Lib Dems out of office with the promise from the Conservatives, that they would do this plan.\nNow the Conservative have their own “luxury housing” scheme, sound familiar? The exhibition to present this housing scheme is from the 13th June (click this link). You can be assured it is not what was asked for, but go along and have a look to see if it compares to the peoples below results, specification, drawing and model.\nBarefoot consultation 22-24th 2010\nThe local facilities most commonly mentioned as priority are:\nQ2\nQ3\nThe most common themes to emerge from this question were as follows:\nThe riverside – many respondents (approximately 43% in total) said they would like to see the riverside improved and made into a public space, with the aim of it being a focal point for the town. Several also suggested opening up the riverside with Kings Street.\nThe next biggest theme to emerge was that of improved retail and improving the condition of the town centre in general. Several respondents commented how many people go to Richmond or Kingston to shop and thought Twickenham should have a better range of shops.\nSeveral residents were concerned about the amount of traffic in Twickenham and would like to see more pedestrian areas.\nIncrease availability of leisure facilities and open public spaces\nThe People’s Plan for Twickenham Riverside chosen\nAn opportunity to do what the people want\nModel made by Tom Tangle (deceased)\nA tribute to a real man of the people\nConclusions\nSnap General Election Thursday 8 June 2017 – April 20, 2017\nWhat a turn up “May goes for broke” asking the country to ratify – the referendum, Parliament’s vote and her as PM – act of desperation or stroke of genius? Well only the Tories will already have geared up their election machine for this, which usually takes everyone else one year to do, so advantage May 11,334,576 votes. UKIP are quite happy with the Governments performance on the referendum, so they will obviously not stand in the way of the Tories 3,881,099 votes – so combined total 15,215,675 of votes.\nAll the other parties are EUpean parties to beat the Tories, will have to gang up and the Lib Dems 2,415,862, SNP 1,454,436 would have to campaign for Labour 9,347,304 – but even they did this (which they won’t) this is not a big enough number to win the election – Total 13,217,602. So I would say the smart money today is on May, but that is only because there is not another choice. In 2022 things will be different, the people will have a choice of a party that only does the will of the people. All this political infighting will be over and Enact will do what you want – at last!!.\n“Times Move On” – So what has happened? – April 2, 2017\nBarry Edwards’s political history has evolved.\nBetween 1980 and 2006 he didn’t vote because he was ‘disillusioned’ with politics. In 2006 he stood as an Independent as got 458 votes the highest vote for an Independent in recent history. After working with the Conservatives from 2009 to 2012, standing in Teddington with 2183 votes and getting rid of the Lib Dems “Luxury Housing Scheme” on Twickenham Riverside, he left to join UKIP in 2013. Why, because the Tories may be more sensible than the Lib Dems, but there would not put people first. So what was achieved in UKIP? Well a General Election was fought in 2015 and 3069 votes was enough to cause a changing of the guard and by taking these votes off the Lib Dems, the first Conservative MP since 1979 was elected.\nIn 2016 the historic Referendum took place and although 1,514,477 Londoners said that they wished to leave the EU, 2,247,166 said they wanted to stay (a difference of 732,689 to Remain). Adding this into the rest of the country a total Turnout: 72.2% – Number of local areas declared: 382/382 – Leave: 17,410,742 (51.9%) Remain: 16,141,241 (48.1%) Total Electorate: 46,500,001. Though the 52% to 48% proportions would seem close, but from the rest of the country there was a difference of 2,200,190 extra, which when added into the figures left – 1,269,501 votes to Leave. Though some Remain campaigners have insulted democracy by continuing to try overturn and overturn this decision by UK voters, the vast majority of people wish to find out if it is true that we will be better of outside the EU.\nThis will be decided within the next 2 years, but for Barry this was a truly an inspirational experience, it was not the EU take would decide the countries fate, or the UK Parliament, it was actually the British people that decided. So he set out to make this policy for UKIP. That the people would decide and the UKIP MPs would just do the will of the people. Well this didn’t happen. They have acknowledge referenda being important in certain cases, but wish like all the other parties to keep the power squarely in the hands of politicians.\nSo ENACT was born to be the only political party that will do what people want. Yes real, true, direct democracy – demos Kratos – power to people. Our politicians are not elected in Local Authority Councils, or Parliament to decide what they think and then to vote for what their party tell them to say – are candidates seek to gain office, so they can vote for what you have told them to vote for. ENACT has no members of a party telling them what to do, their party is the people, everyone inclusive and that will not change. Over the coming months/years the other parties will try and accuse ENACT of all sorts of things, as they usually do, but rest assured, trust and judge us on what we do, not the propaganda these disgraceful politician will no doubt “peddle”.\nShow Me The Money!! February 28 2017\nThe government’s internal budget deficit may have been improving, but the UK annual current account is at its worse level for 25 years, Britain lost £97bn last year. We are losing money every month. This has taken the national debt from £800bn under Labour to almost double to 1.5 Trillion under the Lib Dem & Tories. Professor Tim Congdon says the total cost of the EU to Britain is £170 Billion per year. So are we really going to have a huge windfall of cash for the NHS and public service after leaving the EU? Please go to the Office of Budget Responsibility website, for these facts.\nOffice of National Statistics (ONS): http://www.ons.gov.uk/ons/index.html\nOffice of Budget Responsibility (OBR): http://budgetresponsibility.org.uk/\nStart researching and thinking about this issue, it will very shortly affect you and will definitely affect your children and we will be asking you, what would you do?\nThe EU – In or out? – February 25 2016\nHas the answer been under our noses all along? Do the Remain and the Leavers want the same thing?\nDO WE WANT THE COMMON MARKET?\nHave our politicians lost sight of this prize. What the new Prime Minister Teresa May must understand is that she is there to follow the will of the people. The people have spoken, we don’t want a deal based on some Norwegian or Swiss model, we want the Common Market we signed up to. If our politicians don’t deliver, then they are not Democrats and a new breed of politician will be required. The UK is no longer prepared to have remote career politicians doing whatever they, or their party, dam well like. It is time for proper Democracy and for the old political elite to go. Whether Teresa May achieves a Common Market for the UK, or not, the people have shown that they are better at making decisions than Parliament and it is now time to let the people decide on many more issues that affect their lives.\nWhy don’t Politicians tell us the Truth?\nIf you want to know the truth about the EU, look at the below\n| Treaty of Lisbon….. | 2007 |\n| Treaty of Nice. … | 2001 |\n| Treaty of Amsterdam. … | 1999 |\n| Treaty on European Union – Maastricht Treaty. … | 1993 |\n| Single European Act. … | 1986 |\n| Merger Treaty – Brussels Treaty. … | 1967 |\n| Treaties of Rome : EEC and EURATOM treaties. … | 1958 |\n| Treaty establishing the European Coal and Steel Community…. | 1952 |\nENACT askes if we should Stop Taxing our Children – February 22 2017\nENACT says – should the Lib Dems, Conservatives and Labour parties continue taxing your children, through inheritance tax.\nWithin the Lib Dems, Conservative and Labour’s current position, your children will have to pay huge sums to the Government on your property and life savings after you die. You may have worked all your life and paid the tax on your earnings to buy a home and wish to pass it to your children to provide a great start in life for them.\nHowever these parties after an allowance of £325,000 threshold per person, or combined for a married couple of £650,000, will charge your children 40% tax on the value of the rest of the estate, so effectively they will have to buy back their own home.\nUnder new strict changes to the system, if you give your home to them and continue to live in it, the 7 year rule no longer applies and they would still have to pay this tax. In both cases this would mean:\nENACT is appalled that this information has not been made available to the public in the lead up to the General Election by any of these parties’ prospective parliamentary candidates; as ENACR asks is this tax fundamental wrong.\nShould this Tax on Children across the country be stopped, ENACT thinks so, but what do you want? Figures from the Her Majesty’s Customs and Revenue; Understanding Inheritance tax (HMRC, 2014).\nMassive House-Building Plans – Still on its way January 18 2017\nBarry Edwards ENACT Parliamentary candidate for Twickenham asks, “do you want to protect open spaces in leafy London Borough such and Twickenham & Richmond. Twickenham and Richmond after a stable period of 25 years leading up to 1999, is experiencing unprecedented urban growth, see map below, and in the last 5 years this has been accelerating exponentially.\nWithin the latest data from the Office of Nation Statistics it seems that the Lib Dems, Conservatives, Labour & even the Greens are ignoring the currently projected 41,000 new homes needed in Twickenham and Richmond by 2050; which is equal to the entire size of Bushy Park, 4.1 Square Kilometres of lost open space. Where will all this new housing go??\nHistoric growth of built space – The dark areas are built land, the lighter areas are the only open spaces left in the Borough, (the large areas are Richmond, Bushy and Old Deer Parks).\nGiven the long term projected population growth, the areas that will increasing become under threat in Twickenham are: Moormead Park, Orleans Gardens, Richmond College, Cranford Way, Knellor Gardens, Twickenham Green, Radnor Gardens, Strawberry Hill Golf Club, Twickenham Golf Club (David Lloyd) Crane Park, Shacklegate Lane, Teddington Studios, Langdon Park, Broom Recreation Ground, Castle Park and a significant proportion of Bushy Park.\nThe areas that will become under threat for Richmond are: Old Deer Park, Terrace Gardens, Petersham Meadows, Hamlands, Latchmere Recreation Ground, Richmond Park Golf Course, Barns Elms, Barns Common, Roehampton Playing Fields and a significant part of Richmond Park.\nWithin the Lib Dems, Conservative and Labour’s current position, it is inevitable that all of this open space will be lost, because they have not published a housing policy which could cope with this vast need for housing. This is not a new phenomena, the Mayor’s London Plan in 2009 described London’s population as being “likely to continue its steady growth” and “unless something happens to reverse these deep seated trends, London’s population will continue to grow”. (GLA, London Plan).\nThe Conservatives were informed about the impending spiralling need for housing in October 2012 and have done nothing about it. The Lib Dems have been quoted saying “the more EU migrants the merrier” (Vince Cable, 2012) and the Labour party signed EU Directive 2004/38/EC allowing the free migration of unlimited numbers from Europe and the Greens also are not acknowledging the problem. ENACT is appalled that in the lead up to the General Election this information has not been made available to the public by any of these parties’ .\nIt is now a real and historic choice for the residents of Twickenham and Richmond at the General Election in May to stop this dramatic national change to their local way of life. There are currently proposals to build on Richmond College and Teddington studios and without an alternative, the rest of the areas listed could be under threat and built on in due course. This massive increase in population numbers will also affect the provision of future school places, health and welfare provision, jobs and Council services for local residents.\nENACT asks do we need to stop Twickenham and Richmond becoming totally urbanized; would you help ENACT to protect our local parks and open spaces by supporting ENACT.\nData from Office of National Statistics\nIf there are currently 27 million homes and a population of 63 million, then the housing stock has an average of 2.3 per dwelling. At the current 1% population growth rate, by 2085 the population of the 126 million will require 54 million homes, which also represents a doubling the built area of land in the UK\nHow this refers to Twickenham and Richmond is there are 83,000 homes and a population of 190,000. At the1% population growth rate the population will be 285,000 by 2050, so dividing this by the average dwelling rate of 2.3 per dwelling; this would be 124,000 homes, representing an increase of 41,000 homes.\nThe question must be asked of these parties; why are the Lib Dems, Conservatives, Labour and Greens allowing this to happen? Will we have to have wall to wall housing, before the damage this will cause to our Open Space and the fabric of communities is recognised?\nThe Problem with Population Growth – January 5 2017\nThe top issue affecting all aspects of life in the UK today and the top priority when making your voting choices in the General Election in May, is the ever increasing demands on resources from ever increasing numbers of people. To date, as Sir David Attenborough says “this has been a taboo subject”, but now he strongly encourages that people should talk freely about this to ensure a better standard of living for all; including a good environment, economy and social/cultural provision. Whenever a politician talks about the demands on NHS, School places, housing needs, wages, etc, in any way, their comments must be measures against the sheer number of people involved and whether this can be managed.\nThe table below shows the factors which increase population in the left column and the factors causing reduction in the right column. This has to be the principal reason deciding your vote in the General Election, or like the other political parties, you will be opening up the UK to the other factors in the right column; all of which seem a frightful prospect.\nTable Of Options\n| Increase Population (Good?) | Decrease Population (Good?) |\n|\n|\nYou see nature will choose from the right hand list unless we adjust our approach in the left hand column; because it is an inconvenient truth that as population increases resources decline for each individual in that population. Encouraging abstention, contraception, small families and having a single fair immigration policy for all countries outside the UK would be a start to solving future resource problems. Managing population will reduce the need for additional house building, building schools, roads, sewage works and pressure on the NHS. The question is will we be able to stop this population growth whilst there is still some open space and resources left, or will we wait until there are wall to wall people and the power has gone off?\nToday we still do have a choice, but not for long, because even controlled growth, just means growth!!",
  "http_www_barryedwards_info_/http_www_barryedwards_info_videos_html/content_8.html": "What is so important about Sustainability\nWell, it is common sense to do what is stable and matters to people.\nThe videos below completely prove that Sustainability is the only honest and rational political party in the UK and we know that direct public involvement with decision making is the answer. We also completely agree with Sir David Attenborough and Professor Bartlett’s views. The World is a finite resource and we need to manage it wisely, or we will harm ourselves. Sustainability disagrees with the Lib Dems, Tories, Labour view that the economy will be saved by growth. Because resources are not infinite; this is an obviously scam and growth will just use up everyone’s limited resources quicker. The UK and the other countries of the World have to learn to live within their means and have a population size that matches their ability to provide the vital needs and services of this population. This is called living off the yield of capital, not the capital itself. This is just practical and sensible. After all, how would you cope at home if the numbers of people living in your house kept on increasing, but your wages stayed the same? How would you provide more and more bedrooms, food, clothing, medicine etc etc? Of course, you couldn’t.\nWe certainly need to redesign politics and the way we live, for the good of the people, by the people.\nSo what do young people say?\nWell its like this…..\nPopulation – People & Planet\nSir David Attenborough explains, in this short twenty minute video, the realistic modern consequences of the video produced by Dr Bartlett below. ENACT have spoken to the Lib Dems, Tories, Labour and even the Greens about this and they deny that the contents of these video are credible!! They dismisses Malthus and the use of his and subsequent researchers work into understanding growth and therefore they are all committed to administering what David Attenborough describes as, an “ecological ponzi” scheme. Unfortunately Dr “ponzi” Cable through his own admission and willfulness to discredit others was rejected by voters, and it is now only these parties and the irrational economists that are maintaining this sustainability oxymoron.\nImmigration in the USA\nHow Population Dynamics works\nThe Basic Concept of Population Growth is clearly explained – In the UK this model is not being fueled by the birth rate, it is being powered mainly by EU migration, but the curve and the consequences are the same. The other political parties, the pro -EU parties are happy to allow unrestrained population growth, which will eventually lead to a crash. That crash would have devastating effects on every one of us in the UK.\nHow you are being misled\nIn the UK the Lib Dems, Conservatives, Labour and SNP are using falsehood and favouritism to make an impression on the voter, so that they vote for them. Sustainability has and will continue to maintain virtue by highlighting the truth. It is very clear that making false statement can be very convincing, because these claims can be inflated, whereas the truth is always the truth. The truth also may sometimes be unpopular because the voter cannot believe that these are real problems that need solutions.\nIt is a reality that when the voter becomes aware of this deception a point of high leverage occurs and the truthful party will ultimately win. It is time for you to find the facts and know the truth, before you vote and please do it for this election, because as the video above shows, by the next election the problems will be worse. In this case the High Leverage Point (HLP) is the relationship between population and resources. How many people there are and how much money to care for their needs. The real fact of significance is the national debt – What are we borrowing? Under Labour this was £800bn in this Parliament it has risen almost double to £1,500bn (that is £1.5 Trillion). No wonder they are using corrupted facts to misled you!! ENACT will keep telling you the truth and hopefully in the fullness of time, what’s is really happening and will be obvious to all.\nWill growth save the UK?\nThis is the most important video you will ever see. It is one hour long and does have a lot of detail, so you will have to be patient; but these are all real facts and if you remember this video every time a Lib Dem, Conservative or Labour politician, or any leader from any other country in the world mentions “Steady growth”, you will be able to fully understand what they are actually saying.\nThe Most Important Video You Will Ever See\nHousing in Richmond\nThis is a video is from the Richmond Council Leaders Questions in St Margarets on 13th February 2015. If you go to 1:22.46 (I hour 24 mins and 46sec) you will find the response to what the problem of over-population means to the Leader of Richmond Council. He highlights the serious nature of increasing population, saying London will increase, but fundamentally refuses to acknowledge that this would have any affect on the amount of housing needed, or on the open spaces in the Borough. He accused UKIP of “scare-mongering”, but he has now set himself a very high bar in the video, going on public record claiming that “no open space will be threatened by development”. Only time will tell who is right, but rest assured the Conservatives, Lib Dems, Labour and Greens will have to face up to reality at some point that increasing population does have an affect on housing, public services, school places etc, because as I understand it, they are not going to be making any new land in the Borough, any time soon.",
  "http_www_barryedwards_info_/http_www_barryedwards_info_photos_html/content_9.html": "True face of Lib Dems\nI have always been and will continue to be totally committed to the aims of Richmond United Group (RUG) and its belief in proper democracy and accountability for local politicians. However this is what the Lib Dems say, no apology has ever been issued to RUG for this outrage and no statement has been made about the Lib Dems intention to ever follow local residents' views in future. This is in fact what they are really like…\nThe Will of the People\nRichmond United Group voting to Save Twickenham Riverside in the face of the Lib Dem “luxury housing scheme”\nGrowth in Twickenham & Richmond\nThis map is the present day urban footprint, the areas in grey are the only space left and represent our parks and open spaces. If the Lib Dems, Tories and Labour want to build 42,000 houses by 2050, where can this take place without destroying all the open space?\nThe Office for National Statistics 2006 – Based on Population Projections for LBRuT\n| Authority | Projected Population | 2006-2011 | 2006-2031 | |||\n| 2006 | 2011 | 2031 | Average Increase per year | AverageAnnual Growth Rate | Average Increase per Year | |\n| 000s | 000s | 000s | 000s | % | 000s | |\n| England | 50,763.0 | 52,706.5 | 60,431.6 | 388.7 | 0.75 | 386.7 |\n| London Boroughs | 7,512.4 | 7,811.1 | 8,831.7 | 59.7 | 0.78 | 52.8 |\n| Inner London | 2,721.8 | 2,888.6 | 3,358.9 | 33.4 | 1.20 | 25.5 |\n| Outer London | 4,790.8 | 4,922.5 | 5,472.7 | 26.3 | 0.54 | 27.3 |\n| City of London | 7.8 | 8.2 | 9.7 | 0.1 | 1.01 | 0.1 |\n| Kensington & Chelsea | 178.0 | 195.4 | 240.8 | 3.5 | 1.88 | 2.5 |\n| Southwark | 269.2 | 287.9 | 335.2 | 3.7 | 1.35 | 2.6 |\n| Tower Hamlets | 212.8 | 231.4 | 278.4 | 3.7 | 1.69 | 2.6 |\n| Wandsworth | 279.0 | 295.0 | 338.3 | 3.2 | 1.12 | 2.4 |\n| Westminster | 231.9 | 260.5 | 324.9 | 5.7 | 2.35 | 3.7 |\n| Kingston upon Thames | 155.9 | 166.2 | 199.2 | 2.1 | 1.29 | 1.7 |\n| Richmond upon Thames | 179.5 | 188.6 | 218.3 | 1.8 | 0.99 | 1.6 |\n| Sutton | 184.4 | 191.4 | 221.7 | 1.4 | 0.75 | 1.5 |\n| Waltham Forest | 221.7 | 223.9 | 223.2 | 0.4 | 0.20 | 0.7 |\nUsing these figures this would give a total population figure for 2011 of 188,600 and a growth rate of 0.99% which means the population would double and all associated services housing and land building would therefore in real terms need to double every 70 years.",
  "http_www_barryedwards_info_/http_www_barryedwards_info_profile_html/content_2.html": "I am a family man and run a business within the Borough. I am a scientist, an analyst and believe in the rigorous scrutiny of information. You can be sure that all the other parties, whether they like it or not, will all agree, that I like the truth. I have tirelessly campaigned for the last 15 years to ensure the interests of local people are put first. I believe that the other parties are untrustworthy and have lost touch with people. Up to very recently I was a Conservative Council candidate for Teddington and polled very strongly increasing the Conservative vote by 51% within the 2010 local election, but I very quickly found that the promises made were not honoured.\nI played a large part in writing the Conservative manifesto in 2010 and scripted the “Putting People First” philosophy and headline, but its amazing that only a fraction of what was proposed was embarked on. I must admit that although I was disappointed by this, it was a step in the right direction compared to the Council that was “centrally controlled” by the Lib Dems. The Lib Dems do not keep the their promises anything like the Conservatives. The Conservatives try hard, but never seem to get what local people want. The Lib Dems on the other hand promise the World, in the full knowledge that they are going to do whatever they like.\nIn contrast to this I would like to just offer people a choice, work with them, learn from them and represent their views, aspirations and requirements. I believe in direct democracy and have a great deal of respect for the intelligence and wisdom of local people, because I have worked very closely and effectively with so many local groups (please see the campaigns page). I could no longer work with the Conservatives, because they couldn’t quite fulfill their intentions, but I could never work with the Lib Dems, as they never play with a straight bat.\nI joined UKIP in 2012 to have a sustainably country, a stable sovereign nation that is run from Parliament, not the EU. You may say what a strange conclusion considering the information from the media, that said remain was best. But I don’t believe the media and once I found out the reality for myself that the EU believed in global consumerism, economic growth and stated in its Treaties that it aims to have “ever closer integration of nations”, I knew that UKIP was the only group that had everyone’s interest at heart on this matter. However, as it says of the news page April 2nd, things have moved on, we are no longer under the threat of losing the UK to the EU and I am now looking for political evolution to ensure a safer, smarter more sustainable future.\nYou will find the UK is no longer safe in the hands of the Lib Dems, Conservatives, Labour or SNP. The future doesn’t have to be their way, the future could be bright and be your way, the future is safer with you and Parliament making the decisions. Just have a look at these the websites below, the first is for the World, the second is for the UK and the third is where you can verify this information. Whilst the Lib Dems, Conservatives and Labour are embarked on “playground politics”, like some silly game, exponential growth is happening every minute of every day and it is only suitably qualified and experienced environmental professionals that are technically and competently highlighting this and working on the answers.\nIn this ever increasingly competitive World sustainability brings people back to their senses, are the only responsible party wishing to discuss and solve the modern day pressures facing the UK and wish to do this with the British people. The other parties are not engaging with the issues that affect the day to day lives of the general public and therefore the only logical thing to do is to get rid of these irrational career minded politicians and vote for Sustainability.\nWorld Statistics\nUK Statistics\nhttp://www.worldometers.info/world-population/uk-population/\nUK Office Of National Statistic (verification of figures)\nThe evidence is clear from the Governments own figures, the population is rising like no other time in the history of the UK. But facing up to this and providing future solutions to this “steady growth” is clearly the only responsible thing to do. Please go to videos and see what the implications of population growth are for everyone.",
  "http_www_barryedwards_info_/http_www_barryedwards_info_index_html/content_3.html": "Council and parliamentary candidate\nWithin a Social Environmental Economics – Reconomics or Circular Economy, you can SEE a wonderful people-environment fit, where we can all have Quality of Life – QOL.\nWell, this type of balanced sustainability future-proofs life by removing economic risk which leads to a strong, stable society, making us all better-off.\nI wish that every time economic grow is mentioned by anyone, that we all consider a simple calculation. It is simple mathematics and the sums are not that hard. Its simple, a 1% population growth means that society means to doubling everything in society every 70 years to maintain the same standard of living. It would mean you need twice the hospitals, twice the schools, twice the housing, twice the jobs and twice the sewage works and if that growth increased to only 2%, then that doubling of everything would be 35 years and if that growth is just 7% that doubling is in just 10 years. This is completely unsustainable, but that’s the nonsense you are being sold. We simply cannot not get out of any problem, by increasing the problem.\nSo, it makes absolutely no sense to keep talking about economic growth as the means to a better quality of life because using that notion as route to success, does the complete opposite of what you want and just uses up all of your valuable resources quicker. That means advocating growth in any form, on its own is just irresponsible, but coupled to the consequences of ever-increasing pollution levels, is just foolishness.\nSo, any political party or organisations promoting growth are part of the problem, increasing the scale of the economic disaster for future generations. I wish every person would remember this fact about growth every time that some irrational politician suggests growth as the answer to any of society’s problems because it’s just making the problems worse.\nSo, why does sustainability work better? Because it has a vision for a better future where:\nThe Conservative, Labour, Lib Dems & SNP have been committed to economic growth for the past 50 years and despite the evidence still are, therefore they all have always failed on their promises and frankly the people of this country are fed up with it. Changing away from the old confrontational ways towards a new inclusive and totally democratic vision of politics is crucial – unfortunately people don’t realise how much power they really have!!\nCurrently there is no accountability – politicians think once they’re in power they can do whatever they want. Fundamentally the democratic system needs to move on – to liberty, safety, progress and stability – to a place where the people decide. The most important thing I have learnt from my experience in politics is that people make far better choices about their own lives than politicians. So, you do have a choice…\nMetaphorically by just stepping off the plank, you remove them\nNo if, or buts, politicians have been ignoring the “will of the people” for years, but if enough people in your community vote in enough numbers, you will actually get rid of these untrustworthy politicians. There is finally another way, just step away from all that misinformation and vote for sustainability and things will finally start to change in your favour.\nWe want a wonderful stable country and a beautiful world, where people make decisions and the politicians are there to help realise those choices.\nTHE CHANGE STARTS HERE, Sustainability works because\nSo, what else do we need to fix our broken democracy:\nThere is something not quite right when you get millions of votes and no seats, clearly we need proportional representation (PR) to correctly respect/represent the votes cast by voters; that they should reflect the number of seats.\nhttp://en.wikipedia.org/wiki/Proportional_representation\nWho Broke Britain?\nConservatives, Labour\nLib Dem, & SNP.\nSustainability will fix it.\nFairer sustainable communities.\nMore resource security.\nQuality of Life.\nA fairer society, respect for people.\nMore friendly society.\nHealthy Environment.\nTo do no harm to the world, respects the planet.\nMore beautiful world.\nStable Economy.\nNo more boom and bust, respect for financial needs.\nMore money in your pocket.\nUpcoming General Election\nI intend to support a sensible Social, Environmental and Economic balance.\nA good life for all.\nIn 2024, we have a new Blairite Labour that has become the party furthest right, the Conservatives have proven themselves to be more focused on themselves than the crucial tasks at hand. The LibDems are still getting nowhere and the socialists have hijacked the Green Party.\nWhilst there are some representatives of these parties who in isolation may have some strong and noble ideas, the truth is, that the aforementioned parties don’t have a clue how to provide sustainability. It appears they are too busy arguing with themselves, rather than finding a cohesive or successful plan designed to generally improve people’s lives.\nTo have any chance of choosing a better future, you have to reject false promises, identify facts and determine what is real. I don’t know about you, but I am fed up sailing in this ship of fools. For the past 40 years, successive political parties have failed in creating a fair or even happy country. All politicians are to blame but soon, in this election, you have a chance for a fresh start and a proper focus on the truth. So, you don’t get fooled again.\nReforming opportunities in Britain, by using Standards, makes everything better.\nCost of living - Buying British, supporting food security, and choosing self-sufficiency in energy - solar, wind, water, etc.- reduce prices. Putting UK business first.\nAccess to services has been slashed due to the level of demand. NHS, utilities, insurance, and housing (air development) are available. So why don’t we put the elderly, women and children first?\nLaw and Order - We can stop violence, such as knife crime and theft, simply by having more police focused on catching criminals.\nWomen’s rights – Of course, there should be equality for everyone, but there should be no confusion that biological sex is respected everywhere in society.\nMigration should be managed. Increasing the population makes us all poorer. The provision of public services has not improved. As a result, UK citizens, together with growing numbers of migrants, are all forced to struggle for the same GP appointments, NHS waiting lists, school places, reduced housing supply, and soaring prices. We had a stable population from 1968 to 1998, thirty years of increasing living standards. Why not just manage society, the environment, and economics to benefit the UK and the national interest? This competition for services is in no one’s interest and is caused by too many people and insufficient utilities.\nFIND IT & FIX IT\nCareful spending, reducing demand, having British/International standards and delivering good management can solve anything. As a Management Consultant and Chartered Environmentalist, there is only one rational choice: the UK needs Reform.\n5/ Immigration\n6/ NHS\n8/ Policing\n9/ Justice\n10/ Education\n11/ Benefits\n12/ Brexit\n13/ Defence\n14/ Veterans\n15/ Housing\n17/ Transport & Infrastructure\n18/ Agriculture\n19/ Fisheries",
  "http_www_barryedwards_info_/http_www_barryedwards_info/content_1.html": "Council and parliamentary candidate\nWithin a Social Environmental Economics – Reconomics or Circular Economy, you can SEE a wonderful people-environment fit, where we can all have Quality of Life – QOL.\nWell, this type of balanced sustainability future-proofs life by removing economic risk which leads to a strong, stable society, making us all better-off.\nI wish that every time economic grow is mentioned by anyone, that we all consider a simple calculation. It is simple mathematics and the sums are not that hard. Its simple, a 1% population growth means that society means to doubling everything in society every 70 years to maintain the same standard of living. It would mean you need twice the hospitals, twice the schools, twice the housing, twice the jobs and twice the sewage works and if that growth increased to only 2%, then that doubling of everything would be 35 years and if that growth is just 7% that doubling is in just 10 years. This is completely unsustainable, but that’s the nonsense you are being sold. We simply cannot not get out of any problem, by increasing the problem.\nSo, it makes absolutely no sense to keep talking about economic growth as the means to a better quality of life because using that notion as route to success, does the complete opposite of what you want and just uses up all of your valuable resources quicker. That means advocating growth in any form, on its own is just irresponsible, but coupled to the consequences of ever-increasing pollution levels, is just foolishness.\nSo, any political party or organisations promoting growth are part of the problem, increasing the scale of the economic disaster for future generations. I wish every person would remember this fact about growth every time that some irrational politician suggests growth as the answer to any of society’s problems because it’s just making the problems worse.\nSo, why does sustainability work better? Because it has a vision for a better future where:\nThe Conservative, Labour, Lib Dems & SNP have been committed to economic growth for the past 50 years and despite the evidence still are, therefore they all have always failed on their promises and frankly the people of this country are fed up with it. Changing away from the old confrontational ways towards a new inclusive and totally democratic vision of politics is crucial – unfortunately people don’t realise how much power they really have!!\nCurrently there is no accountability – politicians think once they’re in power they can do whatever they want. Fundamentally the democratic system needs to move on – to liberty, safety, progress and stability – to a place where the people decide. The most important thing I have learnt from my experience in politics is that people make far better choices about their own lives than politicians. So, you do have a choice…\nMetaphorically by just stepping off the plank, you remove them\nNo if, or buts, politicians have been ignoring the “will of the people” for years, but if enough people in your community vote in enough numbers, you will actually get rid of these untrustworthy politicians. There is finally another way, just step away from all that misinformation and vote for sustainability and things will finally start to change in your favour.\nWe want a wonderful stable country and a beautiful world, where people make decisions and the politicians are there to help realise those choices.\nTHE CHANGE STARTS HERE, Sustainability works because\nSo, what else do we need to fix our broken democracy:\nThere is something not quite right when you get millions of votes and no seats, clearly we need proportional representation (PR) to correctly respect/represent the votes cast by voters; that they should reflect the number of seats.\nhttp://en.wikipedia.org/wiki/Proportional_representation\nWho Broke Britain?\nConservatives, Labour\nLib Dem, & SNP.\nSustainability will fix it.\nFairer sustainable communities.\nMore resource security.\nQuality of Life.\nA fairer society, respect for people.\nMore friendly society.\nHealthy Environment.\nTo do no harm to the world, respects the planet.\nMore beautiful world.\nStable Economy.\nNo more boom and bust, respect for financial needs.\nMore money in your pocket.\nUpcoming General Election\nI intend to support a sensible Social, Environmental and Economic balance.\nA good life for all.\nIn 2024, we have a new Blairite Labour that has become the party furthest right, the Conservatives have proven themselves to be more focused on themselves than the crucial tasks at hand. The LibDems are still getting nowhere and the socialists have hijacked the Green Party.\nWhilst there are some representatives of these parties who in isolation may have some strong and noble ideas, the truth is, that the aforementioned parties don’t have a clue how to provide sustainability. It appears they are too busy arguing with themselves, rather than finding a cohesive or successful plan designed to generally improve people’s lives.\nTo have any chance of choosing a better future, you have to reject false promises, identify facts and determine what is real. I don’t know about you, but I am fed up sailing in this ship of fools. For the past 40 years, successive political parties have failed in creating a fair or even happy country. All politicians are to blame but soon, in this election, you have a chance for a fresh start and a proper focus on the truth. So, you don’t get fooled again.\nReforming opportunities in Britain, by using Standards, makes everything better.\nCost of living - Buying British, supporting food security, and choosing self-sufficiency in energy - solar, wind, water, etc.- reduce prices. Putting UK business first.\nAccess to services has been slashed due to the level of demand. NHS, utilities, insurance, and housing (air development) are available. So why don’t we put the elderly, women and children first?\nLaw and Order - We can stop violence, such as knife crime and theft, simply by having more police focused on catching criminals.\nWomen’s rights – Of course, there should be equality for everyone, but there should be no confusion that biological sex is respected everywhere in society.\nMigration should be managed. Increasing the population makes us all poorer. The provision of public services has not improved. As a result, UK citizens, together with growing numbers of migrants, are all forced to struggle for the same GP appointments, NHS waiting lists, school places, reduced housing supply, and soaring prices. We had a stable population from 1968 to 1998, thirty years of increasing living standards. Why not just manage society, the environment, and economics to benefit the UK and the national interest? This competition for services is in no one’s interest and is caused by too many people and insufficient utilities.\nFIND IT & FIX IT\nCareful spending, reducing demand, having British/International standards and delivering good management can solve anything. As a Management Consultant and Chartered Environmentalist, there is only one rational choice: the UK needs Reform.\n5/ Immigration\n6/ NHS\n8/ Policing\n9/ Justice\n10/ Education\n11/ Benefits\n12/ Brexit\n13/ Defence\n14/ Veterans\n15/ Housing\n17/ Transport & Infrastructure\n18/ Agriculture\n19/ Fisheries",
  "http_www_barryedwards_info_/http_www_barryedwards_info_numbers_html/content_7.html": "Living Longer and Prosper\nThere are always budget considerations when considering new policies or activities. All political parties know that at present there is a serious financial deficit initially created by Labour and currently being increased by the Conservative/Lib Dem coalition. This has to be taken into account when deciding what we can do next, how this deficit should be repaid and what other spending or cuts must be made to put the UK back on its feet. I believe that you can’t trust what the Lib Dems, Tories or Labour say, but if you must consider what they say, you have to carefully judge how the various parties will handle this deficit, what is their vision for Britain in the future and then vote accordingly.\nHow do you want to build a better UK. (savings and profits in bold)\nHow it adds up:\n- A stable population will solve most of the resource problems on the horizon for the UK. There will be less pressure on the need for future housing, NHS provision, school places etc. Instead of the Lib/Lab/Con high tax, high spend, you could have low tax, low spend.\n- By reducing the size of Government you would provide better management of resources. Tight efficient decision making allows the proper running of the country and removes arbitrary effects of the market system on Government. With a total government budget of £720bn pa, saving 1% waste from this budget should not be a challenge. This is an extra £7bn pa. can be used to help the least well-off.\n- By providing training schemes for the unemployed. Let’s put the jobs for young people first and stop unemployment.\n- There are not just 2 million officially unemployed, but 1.2 million part time workers who would like full-time work, plus half of the 2.3 million “disabled” who could, and in many cases want to work. Thus real unemployment in the UK is probably in excess of 4 million. Employing just 1 million or a quarter of these at £20,000pa would generate £20bn and £5bn-£6bn extra of tax revenue. Keeping people happy and in work actually not just saves the country money, but makes it money.\n- Make the consumer king, with simple regulation for Banks, Utilities, Phone companies, insurance, etc. A fair price for a fair service. Excess profits from poorly regulated and excessively monopolistic industries such as financial services (including banks), energy companies, water utilities, phone companies and insurance should be squeezed and returned to the consumer. These sectors account for about 15% of the economy, and excess returns could account for about 0.5% of GDP, or £8bn. The Conservatives claim they want efficient business to provide a good deal for the consumer and then allow shareholder and “fat cat” to hike extortionate price rises. Profits from service industries, transport, energy etc should be for UK companies. Making the UK £10 billion per year.\n- Now that the banks are again in profit, let’s get the money back that the banks were loaned from the Tax Payer. Making the UK 170 Billion.\n- Regulate against loan sharks, greedy shareholders, excessive Council Tax & reduce Taxation overall. The Lib Dems claim they want fairness, but together with the Labour Party & and Conservatives, they have allowed the banking crisis. A proper Bank of the UK is needed to provide lending for small business and start-ups. Making the UK 2 billion.\n- To make services like the NHS, the Buses and Trains, etc all efficient and affordable, this is just down to plain and simple good management. Efficiency savings in excess of 10 Billion.\n- The foreign aid budget could be cut from 14bm to 5bn, remove the need to borrow for this and reducing the overall total amount of foreign aid. Saving 9 billion a year.\n- Manufacturing in the UK is only 10% of GDP: in Germany it is still 20%. They have nurtured and favoured their manufacturing, we haven’t. If a pro-manufacturing recycling policy was followed, this could generate an extra 10% of GDP (an extra £160bn pa), and even more if account was taken of linkages with the rest of the economy. The only possible way to thrive is to use the Formula 1 model. Most of the Formula 1 teams, Mercedes, Ferrari, Red Bull, Williams etc etc are located in the UK. Why, because we are the most innovative and have the highest engineering standards in the World. We need to be able to develop this across all industrial and service sections and trade freely with all countries in the World, without restrictive EU rules. Making £30 billion per year.\n- Our R & D budget is only 1.7% of GDP, our competitors are 2.7%-3.0%. We need to increase this vital spending by 1.0% of GDP and make sure much more of it stays in the UK, and benefits British citizens, by stopping predatory foreign takeovers of British companies, of which there have been far too many in the past 30 years. We are also one of the most ingenious of countries in the World illustrated by the number of UK registered patents. However our intellectual property is copied by the rest of the world and its true economic value is being lost. So to stop this and increase the fortunes of the country, the UK must introduce the “Knowledge Economy” into law; a new national and global patent system. A system that protects inventors and investors in partnership with the UK Government, by the seal of the Crown. The UK could then vigorously defend its patents in the courts around the World, using UK Governments solicitors, to stop this fraud. Licenses could then be issued for these patents to other countries to do the manufacturing, making the UK Billions and securing the UK’s economic future. Making 100 billion per year.\n- Economy is for people, not the other way round. Economic growth for its own sake is pointless. Per capita incomes, the proper measure of living standards, have grown much less fast than stated GDP growth. There are real limits to growth especially in a heavily over-populated island, so with no spare land, no natural resources which are economically viable, and indigenous food supplies which only feed 60% of the population the UK must plan its own future. A reality and rationalization.\n- To have a vision for the future and plan for a better way of life for all. A place where we protect the standard of living, how we live our lives and what we can leave to our children without the exploitation from the State. A vision.\n- Most importantly to put people first, to change the current hierarchy of interests: 1) the Government, 2) big business 3) political parties are put before 4) the people. People should not be 4th they should be 1st and National and Local government should be an accountable to them. Real Democracy.\n- We have to get away from the political claims culture and focus on the truth and stop “spin-doctors” manipulating the facts gain personal, or group advantage against the interests of the general population. Returning integrity.\n- We have to get away from the economist’s delusional world where normal things don’t usually happen. We have to challenge Conservative, Labour, Lib Dem and SNP claims that growth is good; more industry, more people, more house building, more trains, more planes, more, more, more. F is for future, so where’s is this F in growth? There is no F in growth. It is a fact that growth just uses up finite resources quicker, which can only lead to increased hardship. Common sense.\n- By implementing direct digital democracy (secure digital voting on issues), the needs of the many will outweigh the needs of political parties, or shareholders. By giving the people the ability to vote using the internet on many more issues, people will get a real democracy where their voice is heard between elections and they get to decide on the matters that affect them. Increasing participation and representation.\nThe UK needs to manage its population, resources and politics to the benefit of its people, not Westminster politicians or city fat cats. Most of the pressures that the country will face in the next few years can mostly be handled by encouraging a stable population and having good leadership.\nAs for the rest, the cost of living and the quality of life. This can also be fairly easily managed by organising the economy to meet the needs of the people and this would have to be accurately costed. We can escape the current catastrophic resource path we are currently on, we have the means, all we have to do is to work towards good ends. The total budgetary improvement calculated above represents extra Billions per year (subject to final costing). This would clearly deal with the UK budget deficit completely within 4 years and provide for all additional support for the NHS, Education, Defense etc, which is needed, whilst protecting our open space and wildlife.\nIt is your choice, more of the same old same old false promises, or Voting for Sustainability, for a better UK."
}