{
  "https_patrickhurley_uk_/https_patrickhurley_uk_acceptable-behaviour-policy/content_7.html": "- Acceptable behaviour policy\n- How will we respond to unacceptable behaviour\n- Our duties under the Equality Act\nAcceptable Behaviour Policy\nI understand that people may act out of character in times of trouble or distress. There may have been upsetting or distressing circumstances leading up to a constituent approaching our office.\nHowever, I will not tolerate behaviour or actions that result in unacceptable or excessive demands on my staff. This may include actions or comments directed at a third party. We’ll give you a chance to change your behaviour before we stop helping you – unless your behaviour threatens the safety of my staff or other people.\nDefinition of Unacceptable Behaviour\nAggressive or abusive behaviour\nThis is behaviour or language (written or spoken) that could cause my staff to feel afraid, threatened or abused. This includes threatening emails, telephone calls, meetings, and comments on social media or elsewhere.\nFor example:\n- insulting or degrading or patronising language, including inappropriate banter or innuendo;\n- making serious malicious allegations that individuals have committed criminal, corrupt or perverse conduct without evidence;\n- any form of physical violence or threats of physical violence\n- derogatory racist, sexist, ageist, homophobic or transphobic remarks;\n- discriminatory comments relating to disability, perceived gender, religion, belief, or any other personal characteristic.\nViolence is not restricted to acts of aggression that may result in physical harm. It also includes behaviour or language (whether verbal or written) that may cause staff to feel offended, afraid, threatened or abused.\nUnreasonable demands and vexatious complaints\nUnacceptable demands may include:\n- Repeatedly demanding a response within an unreasonable timescale;\n- Insisting on speaking to, or refusing to speak to, a particular member of staff, when that is not possible;\n- Demanding repeated surgery appointments;\n- Making repeated and unnecessary contact during the course of us handling a case, waiting for a reply from a third party or carrying out an investigation;\n- Raising the same issue repeatedly when we’ve already helped you or we have told you we can’t help further;\n- Refusing to accept a decision when it related to issues where I have no direct authority or would be inappropriate for me to be involved (e.g. court decisions).\nUnacceptable or persistent levels of contact may include:\n- Repeated telephone calls over a short period, for example, a high number calls in one day or week;\n- Lengthy telephone calls repeating the same points;\n- High volumes of repetitive correspondence by email or post;\n- Unnecessarily or excessively copying me into emails to third parties.\nIt is not acceptable to knowingly provide us with incorrect or false information and doing so prevents my office from successfully dealing with your case.\nHarassment\nExamples include:\n- recording telephone discussions and publishing the information online or via social media\n- contacting staff using their personal details or social media presence including Facebook, Twitter or LinkedIn\n- publishing personal, sensitive or private information about staff online or on noticeboards or newsletters.\nHow will we respond to unacceptable behaviour\nI do not expect my staff to tolerate unacceptable behaviour when communicating with constituents.\nWhen this happens on the telephone, letter or email, we have the right to:\n- place callers on hold;\n- end the call;\n- not reply to an abusive letter or email.\n- In person, for example at a surgery or our office, we have the right to ask you to leave.\nBefore taking such action, we will always warn constituents that they are behaving in an unacceptable way to give them the chance to change their behaviour. However, a warning will not be given in extreme cases to protect our staff, for example, when a serious threat is made.\nWhere these circumstances arise, we will take the following steps:\n- we’ll ask constituents to modify their behaviour and explain why;\n- if the behaviour continues to be unacceptable, our employees will remove themselves from the situation. If the communication is by telephone, the caller will be told that the call will be ended;\n- we will make a record of the incident. In all cases, I or my representative will investigate the situation and decide what action to take. This could include limiting a constituent’s contact with us;\n- we’ll refer the matter to the police where a criminal offence has been threatened or committed.\nLimiting contact may include:\n- Appointing a specific point of contact for the constituent;\n- Communicating only in writing or via a representative;\n- No longer making surgery appointments for a constituent;\n- Deciding not to proceed in a case when behaviour has been unacceptable;\n- Ending all contact with a constituent.\n- Where a decision to limit contact has been made, then I will inform the constituent in writing.\nHow we will take account of our duties under the Equality Act\nI make sure that my office meets the requirements of the Equality Act 2010. This includes making sure we consider adjustments for people with protected characteristics. We understand that some people may have difficulty expressing themselves or communicating clearly and/or appropriately. We will always consider the needs and circumstances that we have been made are aware of, before deciding how best to manage the situation. This will include making reasonable adjustments.\nExamples of reasonable adjustments might include:\nHowever, this does not mean we will tolerate abusive language, violence, shouting, or other unacceptable behaviour or actions.\nIf an individual with a protected characteristic becomes the subject of a restriction under this policy, we will consider whether the restriction may affect them more than someone without that characteristic. If this is the case, we may make different arrangements so they can still receive an adequate service.",
  "https_patrickhurley_uk_/https_patrickhurley_uk_privacypolicy/content_2.html": "Introduction\nThis Privacy Policy explains how Patrick Hurley MP, the Member of Parliament for Southport, collects, uses, and protects your personal data.Patrick Hurley is committed to protecting and respecting your privacy in compliance with the General Data Protection Regulation (GDPR).\nData Controller\nPatrick Hurley MP is the Data Controller for the purposes of data protection law.\nFor Petitons: Civit is the data controller.\nHow We Collect Your Information\nWe may collect and process the following personal data about you:\n- Information you provide by filling in forms or contacting us (e.g., via email, social media, or in person) including but not limited to your name, address, contact details and enquiry details.\n- Records of correspondence and communications.\n- Information you provide when you subscribe to newsletters or other forms of communication.\n- Information from publicly available sources, if relevant to your contact or issues.\nLegal Basis for Processing\nWe process your personal data based on the following legal bases:\n- Consent: Where you have given clear consent for us to process your personal data for specific purposes.\n- Public Task: Processing is necessary for the performance of a task carried out in the public interest or in the exercise of official authority vested in the Data Controller.\n- Legal Obligation: Processing is necessary for compliance with a legal obligation.\n- Legitimate Interests: Processing is necessary for our legitimate interests or the legitimate interests of a third party, except where such interests are overridden by your interests or fundamental rights.\nHere are some examples of how we rely on legitimate interests: –\n- Constituent Service: We may process your data to understand your concerns and provide you with the best possible service as your Member of Parliament. This may involve using your contact details to respond to enquiries, keep you informed about relevant news and events, or perform casework on your behalf.\n- Campaigning (if applicable): We may share your contact information, with your consent, with the Labour Party for campaigning purposes that align with our values and your interests. You can always opt-out of such communication.\nHow We Use Your Information\nWe use your personal data for the following purposes:\n- To respond to your queries, complaints, or issues.\n- To keep you informed about news, campaigns, and events.\n- To perform casework and advocate on your behalf.\n- To engage with you in your role as a constituent.\n- Where consent is given, to share information with the Labour Party for campaigning purposes.\nSharing Your Information\nWe may share your personal data with:\n- The Labour Party, in line with their privacy policy, for campaigning purposes where you have given your consent.\n- Relevant government departments and agencies, if necessary to address your concerns.\n- Third-party service providers who perform functions on our behalf, such as IT and communication services, ensuring they comply with data protection laws.\n- Other Members of Parliament or officials if your case requires their involvement.\n- Law enforcement or other authorities if required by applicable laws.\nLabour Party Privacy Policy\nFor information on how the Labour Party collects, holds, and processes personal information, you can refer to their privacy policy.\nData Retention\nWe retain your personal data only for as long as necessary to fulfill the purposes we collected it for, including satisfying any legal, accounting, or reporting requirements.\nThe Data Retention Protocol for Members of Parliament outlines specific retention periods based on different categories of data.\nYour Rights\nUnder the GDPR, you have the following rights:\n- Right to Access: You can request access to your personal data.\n- Right to Rectification: You can request correction of your personal data if it is incomplete or inaccurate.\n- Right to Erasure: You can request the deletion of your personal data, under certain conditions.\n- Right to Restriction of Processing: You can request the restriction of processing of your personal data, under certain conditions.\n- Right to Data Portability: You can request to transfer your personal data to another organization, or to you, under certain conditions.\n- Right to Object: You can object to the processing of your personal data, under certain conditions.\nTo exercise any of these rights, please contact us using the details below.\nSecurity of Your Data\nWe take appropriate security measures to protect your personal data from unauthorised access, use, alteration, and destruction. We implement technical and organisational measures to ensure a level of security appropriate to the risks.\nContact Information\nIf you have any questions or concerns about this privacy policy or our data protection practices, or if you wish to exercise your rights, please contact: Patrick Hurley MP\n- Email: patrick.hurley.mp@parliament.uk\n- Address: House of Commons, London, SW1A 0AA\nFor more information about your data protection rights, you can also contact the Information Commissioner’s Office (ICO): Information Commissioner’s Office Wycliffe House, Water Lane, Wilmslow, Cheshire, SK9 5AF Telephone: 0303 123 1113 Website: ICO Concerns\nChanges to This Privacy Policy\nWe may update this privacy policy from time to time. Any changes will be posted on this page, and where appropriate, notified to you by email or other means. Please check back frequently to see any updates or changes to our privacy policy.\nDate of last update: 13 September 2024",
  "https_patrickhurley_uk_/https_patrickhurley_uk_2024_09_13_petition-save-smedley-hydro/content_4.html": "I am launching a petion against the proposed closure of the Smedley Hydro site by the Government Property Agency. The Smedley Hydro is one of the largest employers in our constituency, playing a crucial role in both our local community and economy. Most of the employees at this site are residents of Southport.\nThe sudden announcement regarding the site’s potential closure has left staff in uncertainty about their futures. The Smedley Hydro currently houses important government offices, including The General Register Office, HMPO, Home Office, and NHS Digital. Losing this site would mean many local employees would be forced to leave their jobs.\nFurthermore, the Smedley Hydro has been a cornerstone of government employment in Southport since the Second World War, holding significant historical value for our town.\nWe urge the Government Property Agency to explore all possible options to keep the Smedley Hydro site open and retain these vital jobs within Southport.\nPlease sign this petition to show your support for preserving the Smedley Hydro site and protecting local jobs.\nYour data will be used to keep you updated on the petition and to send you newsletters from Patrick Hurley MP with relevant updates and information. We will handle your data securely and it will not be shared without your consent.",
  "https_patrickhurley_uk_/https_patrickhurley_uk_visit-parliament/content_12.html": "Tours of Parliament\nGuided tours of Parliament take place at various times, depending on whether Parliament is in session:\nSitting Days\n- Mondays – 9.00am to 12.00pm (full tours)\n- Tuesdays & Wednesdays – 9.00am to 10.00am (full tours); 10.15am to 12.00pm (partial tours – House of Lords only)\n- Thursdays – no tours\n- Fridays – 3.30pm to 5.00pm (full tours)\nTickets for other days (including weekends and during parliamentary recesses) and for overseas visitors can be purchased via the Parliament UK website.\nMembers’ tours are free and under no circumstances should a fee be paid to anyone. They should also not be offered as raffle/auction prizes or similar.\nIf you would like to book a tour, please email me at patrick.hurley.mp@parliament.uk with details of potential dates and the number of people in your party, remembering to include your full postal address. We will then contact the Tours Office to find out whether they have any spaces available. The usual maximum number of people per group is 15, but it may be possible to split larger groups over two or more time slots.\nPlease note that the tours are very popular and often get booked up several months in advance. Early booking and flexibility regarding dates and times is therefore advantageous.\nFurther information is available on the Parliament website.\nBig Ben Tours\nThe Big Ben tours are now available and MPs are able to book a very limited number of free tickets for constituents. Please contact the office if you are interested.\nEducational Visits for Schools\nThese visits are much more specialised and as such are handled by the dedicated Houses of Parliament Education Service.\nPlease contact the Education Service Directly if you would like more information:\nPhone – 020 7219 4496\nEmail: education@parliament.uk\nTickets for Prime Minister’s Questions & Other Debates\nPrime Minister’s Questions (PMQs) takes place every Wednesday at 12.00pm when the House is sitting. Each MP is allowed to book a very limited number of tickets per month.\nTickets are in high demand, but we will always do our best to accommodate requests from constituents (though there may be a long wait!). Please contact my office via patrick.hurley.mp@parliament.uk if you are interested.\nDebates and question times other than PMQs tend to be much less busy. It is usually possible to queue for tickets on the day, but please bear in mind that this may involve quite a long wait and that any spare tickets are always allocated on a first-come, first-served basis.\nAlternatively, if there is a specific date on which you would like to visit, we may be able to obtain tickets (subject to availability). MPs may book a maximum of 6 tickets for each session.",
  "https_patrickhurley_uk_/https_patrickhurley_uk_author_phurley/content_11.html": "Rufford Parish Council has been campaigning to reduce the speed limits on Holmeswood Road for several years. A Traffic Survey was carried out in 2022 which recorded, in some cases speeds of upto 135mph. We call on Lancashire County Council to install Average Speed...\nI am launching a petion against the proposed closure of the Smedley Hydro site by the Government Property Agency. The Smedley Hydro is one of the largest employers in our constituency, playing a crucial role in both our local community and economy. Most of the...\nSouthport needs a dedicated Children’s A&E service integrated with the adult accident and emergency services. Currently, there is no dedicated A&E service for children and young people between midnight and 8:00 am, as the opening times in Ormskirk...",
  "https_patrickhurley_uk_/https_patrickhurley_uk_book-an-appointment/content_10.html": "Book an Appointment\nPatrick holds resident surgeries online, on the phone and in person. Due to new parliamentary security protocols, all appointments need to be booked in advance rather than drop-ins.\nCaseworkers can start working on your case without a face to face meeting, if you’re happy to send some information by email or chat over the phone. This avoids any delays to resolving issues that might arise from waiting for an appointment.\nTo book an appointment with Patrick or one of his caseworkers, fill in the form below and someone will be in touch to offer the earliest possible date that meets your requirements.\nSurgery Appointment Request\nKey things to include\nPlease include include key info and reference numbers to help following up on your case. Your national insurance number for tax queries or a Crime Reference Number for police enquiries.",
  "https_patrickhurley_uk_/https_patrickhurley_uk_help-support/content_8.html": "I can help constituents on various issues, such as education, the environment, health and social services, highways, transport, and housing.\nPlease remember to provide as many details as possible, including your name, address and full details of your issue.\nFollow me on social media to keep updated on my campaigns, news and Labour policies to improve our local area.\nPatrick.hurley.mp@parliament.uk\nContact me\nPatrick can primarily offer assistance with matters that Parliament and Central Government are responsible for, such as:\n- Tax problems involving the HM Revenue and Customs Department\n- Welfare issues dealt with by the Department for Work and Pensions such as benefits, tax credits and state pensions\n- Issues handled by the Home Office such as immigration and passports\n- Issues relating to the Department of Health and Social Care such as concerns about hospitals or access to treatment\n- Any issues arising from any other government departments\n- Issues with utility companies\n- Consumer issues\nPatrick can support constituents by:\n- Writing to the Minister with responsibility for the department concerned\n- Asking an official for an explanation of why a decision has been made\n- Asking for a decision to be reviewed\nIssues Patrick can’t help with\n- Legal issues and ongoing legal disputes. Please seek advice from a qualified legal professional.\n- Any issues that the Council is responsible for such as:\n- social housing,\n- rubbish/recycling collection,\n- Street cleansing & potholes\n- education; and\n- planning decisions.\nFor those issues you should contact your locally elected councillors in the first instance as they will be best placed to offer assistance.\n- Very strict rules dictate that Patrick can only offer assistance to residents and businesses located in the constituency he represents. Even if the issue you experienced happened in Southport, you will need to contact your own MP. You can check if Patrick is your MP here: FindYourMP.\nAlong with the brief details of your issue, you’ll need to provide:\n- Your full name\n- Your full postal address including post code\n- A contact telephone number and an email address if you have one\n- Your national insurance number\n- Copies of any supporting documents (please do not enclose originals)\nPatrick or his casework team will contact you to let you know what action has been taken and to advise you of the outcome of any enquiries. If you continue to be unhappy with a decision or issues raised, you may be able to refer your case to the relevant Ombudsman.\nPatrick receives many hundreds of requests for help by email, phone, letter and at his advice surgeries. Along with his caseworkers, he works to ensure that all enquiries are dealt with as quickly as possible but please allow up to 15 working days for a response. Sometimes, with very complex cases or at times of peak demand, it may take a little longer.\nIf, after that time, you have not had a response to an enquiry, please resend your email or call Patrick’s office.",
  "https_patrickhurley_uk_/https_patrickhurley_uk_petitions/content_9.html": "Notice: JavaScript is required for this content. Survey & Petitions Pathways to Work Green Paper Consultation Petition: Slow down on Holmeswood Road Petition: Save Smedley Hydro Petition to Reinstate a 24/7 Children’s A&E and Protect Adult A&E Services in Southport",
  "https_patrickhurley_uk_/https_patrickhurley_uk_2024_09_13_we-want-an-ae-in-southport/content_13.html": "Southport needs a dedicated Children’s A&E service integrated with the adult accident and emergency services. Currently, there is no dedicated A&E service for children and young people between midnight and 8:00 am, as the opening times in Ormskirk A&E were reduced in 2020 and have since closed at midnight. We need a 24-hour A&E for children, and it needs to be in Southport.\nOur town’s children and families deserve top-notch emergency healthcare around the clock. At present, families have to travel to Ormskirk or even as far as Liverpool for care, which means children in need of urgent treatment often face journeys of over 45 minutes. This situation is unacceptable.\nOur town is big enough to justify a full, functioning emergency department for both adults and children. Having a dedicated Children’s A&E would mean quicker response times, less stress for parents, and, most importantly, better health outcomes for our children.\nI encourage all residents to sign the petition and express their support for the “Shaping Care Together” consultation to keep the Adult A&E in Southport and reinstate the Children’s A&E. It’s important to ensure that our hospital services reflect the needs of our town. By signing and sharing this petition, we can unite in saying that Southport deserves a fully equipped, 24/7 emergency service for people of all ages.\nYour data will be used to keep you updated on the petition and to send you newsletters from Patrick Hurley MP with relevant updates and information. We will handle your data securely and it will not be shared without your consent.",
  "https_patrickhurley_uk_/https_patrickhurley_uk_2025_04_09_pathways-to-work-green-paper-consultation/content_3.html": "01704 617205\npatrick.hurley.mp@parliament.uk\nFacebook\nX\nInstagram\nFacebook\nX\nInstagram\nHome\nContact me\nBook an Appointment\nAcceptable Behaviour Policy\nSurvey & Petitions\nVisit Parliament\nSelect Page\nPathways to Work Green Paper Consultation\nNotice: JavaScript is required for this content.",
  "https_patrickhurley_uk_/https_patrickhurley_uk_category_petitions/content_6.html": "Rufford Parish Council has been campaigning to reduce the speed limits on Holmeswood Road for several years. A Traffic Survey was carried out in 2022 which recorded, in some cases speeds of upto 135mph. We call on Lancashire County Council to install Average Speed...\nI am launching a petion against the proposed closure of the Smedley Hydro site by the Government Property Agency. The Smedley Hydro is one of the largest employers in our constituency, playing a crucial role in both our local community and economy. Most of the...\nSouthport needs a dedicated Children’s A&E service integrated with the adult accident and emergency services. Currently, there is no dedicated A&E service for children and young people between midnight and 8:00 am, as the opening times in Ormskirk...",
  "https_patrickhurley_uk_/https_patrickhurley_uk/content_1.html": "by Patrick Hurley MP | December 4, 2024 | Petitions | 0 Comments\nRufford Parish Council has been campaigning to reduce the speed limits on Holmeswood Road for several years. A Traffic Survey was carried out in 2022 which recorded, in some cases speeds of upto 135mph. We call on Lancashire County Council to install Average Speed...",
  "https_patrickhurley_uk_/https_patrickhurley_uk_2024_12_04_petition-slow-down-on-holmeswood-road/content_5.html": "Rufford Parish Council has been campaigning to reduce the speed limits on Holmeswood Road for several years. A Traffic Survey was carried out in 2022 which recorded, in some cases speeds of upto 135mph.\nWe call on Lancashire County Council to install Average Speed Cameras on Holmeswood Road to prevent motorists breaking the speed limit and making this road safe for residents and other drivers."
}