{
  "http_www_shepwaygreenparty_com_/http_www_shepwaygreenparty_com/content_1.html": "The Green Party has become a major force for positive change in our area\nThe Green Party is a major force for positive change in Folkestone & Hythe District Council (FHDC), making it the first in Kent to be led by the Greens. We are also the lead group on Hythe Town Council and have increased our representation at Kent County Council. Our councillors represent residents in both Hythe wards, Cheriton, Hawkinge, Elham, Sellindge, Lyminge, and Stelling Minnis. Forming a minority administration with two Lib Dems, we are transforming council operations and finances. At Hythe Town Council, our majority of 12 councillors works with independents and Lib Dems to engage the community. Jenni Hawkins, elected to Kent County Council, joins four other Green councillors, advocating for initiatives like banning disposable vapes. Our journey began in Hythe West with Martin Whybrow’s election in 2013, showing the impact of Green representation.\nOur success relies on dedicated organisers, leafleters, and candidates. Join us to be part of the next chapter.\nGreens Working Hard All Year Round\nThe Looker/Hurricane: A Correction\nWe have been trying for more than a month to get the editor of The Looker and The Hurricane to correct a story in which he claimed one of our councillors wants to allow the Marsh to flood. The story was nonsense but because he won't publish a correction, we have done so here.\nAchievements For Our District Highlighted\nCllr Jim Martin, Kent's first Green council Leader, highlighted some of Folkestone & Hythe District Council's achievements since May 2023, including balancing budgets while building more council homes, attracting millions in new funding and launching a youth forum.\nBuilding a Strong Local Economy, Boosting Tourism and Heritage\nNew initiatives to capitalise on Folkestone's positive press with a district-wide tourism offer and a new strategy for protecting and enhancing local heritage assets are just part of current work within Rich Holgate's cabinet portfolio. Along with the regeneration of Folkestone town centre, these will contribute to efforts to boost the district's economy.\nOur candidates for Kent County Council elections on 1 May\nShepway Green Party is fielding a formidable roster of candidates, across all six divisions covered by Folkestone & Hythe district, at the Kent County Council (KCC) elections on 1 May. It will be the last time voters get a chance to pass judgement on how the Conservatives have run KCC before it, and the district council, are replaced by a unitary authority. This is a vital opportunity to send a great new Green team to County Hall.\nBuilding a Better Future: Our District, Our World\nThe climate crisis is global but we can all make a difference locally. Councillor Stephen Scoffham is working with those in the community committed to making a difference and now the district council has a new Green Grants scheme to boost projects large and small.\nRoy Smith to stand for Greens in Hythe West at Kent County Council elections\nRoy Smith, a local artist and teacher, has been selected to contest Hythe West in May's county council elections. He has lived in Hythe for more than 30 years. Having worked with young people all his life, he wants to be a voice for them at Kent County Council. If elected, Roy will take on the seat from Jenni Hawkins, who won it in a by-election in 2023. Green Martin Whybrow represented Hythe West at Kent County Council for eight years before standing down in 2021.\nProtecting services for residents as local government reorganisation looms large\nFolkestone & Hythe District Council will be abolished as part of local government reorganisation. Here Cllr Jim Martin, who will be the council's last leader, shares what he knows and thinks about the impending changes and how Green councillors are striving to protect services for residents, including by making a difficult decision.\nGreen Grants scheme to be launched by district council\nA new Green Grants scheme is being launched by Folkestone & Hythe District Council to support community initiatives large and small which promote climate resilience and enhance nature and wildlife. It's another way in which the Green Party's motion leading to the declaration of a climate and ecological emergency in 2019 has led to action.\nVolunteer to help get Greens elected\nThe Green Party is 99% made up of volunteers – this is how we’ve been running for over 40 years. There is so much to do to win elections, we rely on volunteers and welcome your help. Whatever skillset or ability you have, you will be an asset to us.\nTo share your details with the Party so we can get in touch to about volunteering, please complete the form below and someone from your Local Party will be in touch.\nHelping in your local community by delivering a few leaflets or chatting with voters on the doorstep will make a real difference to getting more Greens elected."
}