{
  "https_tinalouiseuk_blogspot_co_uk_/https_tinalouiseuk_blogspot_co_uk/content_1.html": "I couldn't have asked for better timing on the clear-down of the FORMER fracking site on Preston New Road... some of us are gathering there tomorrow morning to simply be happy about all this... rather than the more 'usual' meet-ups where we've had to arrive on scenes that were filled with confrontation and unpredictability. As today happens to be my birthday... I am taking tomorrow as the best of gifts.\nOn the subject of my birthday, I had planned to remove it from my Facebook profile as I always feel so awful that I don't get round to thanking people for kind wishes... I'm now happy that I didn't do that because this sea of incredibly lovely birthday messages is making me smile ...each post gifting a memory and a face that brings such joy. From those I've stood literally shoulder to shoulder with at protest, old school friends and teachers as well as close and distant family, political friends (and opponents!) and others from just about every one of the insanely numerous jobs I've had... I feel so truly blessed by the friendships my rather oddly navigated life has brought... even the fleeting ones.\nAll this being my way of saying... if I don't get round to the individual thank yous I really want to do... thank you for being part of my life's adventure\nps:\nto those I've danced with... you will remain my favourite things-in-life-to-remember x\nOn the subject of my birthday, I had planned to remove it from my Facebook profile as I always feel so awful that I don't get round to thanking people for kind wishes... I'm now happy that I didn't do that because this sea of incredibly lovely birthday messages is making me smile ...each post gifting a memory and a face that brings such joy. From those I've stood literally shoulder to shoulder with at protest, old school friends and teachers as well as close and distant family, political friends (and opponents!) and others from just about every one of the insanely numerous jobs I've had... I feel so truly blessed by the friendships my rather oddly navigated life has brought... even the fleeting ones.\nAll this being my way of saying... if I don't get round to the individual thank yous I really want to do... thank you for being part of my life's adventure\nps:\nto those I've danced with... you will remain my favourite things-in-life-to-remember x"
}