{
  "https_www_tiptontogether_info_/https_www_tiptontogether_info_pages_cookie-policy/content_2.html": "Cookies are small pieces of data (memory files) stored on your computer or device via your browser by sites you visit. As is common practice with almost all websites, this site uses cookies to improve your experience by remembering your preferences and enable other cookie-based features (e.g. analytics), either for a single visit (through a \"session cookie\") or for multiple repeat visits (using a \"persistent cookie\").\nWe use cookies for a number of different purposes.\nIn special cases, we also use cookies provided by trusted third parties like Google Analytics. Third party analytics are used to track and measure usage of this site so that we can continue to produce engaging content.\nWhen you first access the site, you may receive a message advising you that cookies and similar technologies are in use. By clicking \"accept all\", you signify that you understand and agree to the use of these technologies, as described in this Cookie Policy. By clicking \"settings\", you can choose to accept or reject specific cookies.\nYou may withdraw consent at any time. Most browsers allow you to refuse to accept cookies. You can also remove cookies from your browser settings. Be aware that disabling cookies may affect the functionality of this and many other websites you visit. Therefore, it is recommended that you do not disable cookies.\nPlease see the following links for information on how to manage, block, or delete cookies for the most popular browsers:\nMicrosoft Internet Explorer:\nhttps://support.microsoft.com/en-gb/help/17442/windows-internet-explorer-delete-manage-cookies\nGoogle Chrome:\nhttps://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DDesktop&hl=en\nMozilla Firefox:\nhttps://support.mozilla.org/en-US/kb/enable-and-disable-cookies-website-preferences\nApple Safari:\nhttps://support.apple.com/en-gb/guide/safari/sfri11471/mac\nTo find out more on how to manage and delete cookies, visit aboutcookies.org. For more details on your choices regarding use of your web browsing activity for interest-based advertising you may visit the following sites:\nWe may edit this policy from time to time. Please check this policy regularly for any changes. Our site is hosted on Strikingly Inc. They provide us with the best website builder software that allows us to create website free.\nCookies are one way we comply with GDPR guidelines. To learn more about Strikingly, the following links may be helpful: Youtube Facebook Twitter SXL",
  "https_www_tiptontogether_info_/https_www_tiptontogether_info/content_1.html": "TIPTON TOGETHER\nIt's time to give the people of Tipton the voice in local government they deserve:\nhonest, hard-working, and free from party politics.\nRead on for more information.\nClick CONNECT if we can help you or you can help us.\nTIPTON TOGETHER\nIt's time to give the people of Tipton the voice in local government they deserve:\nhonest, hard-working, and free from party politics.\nRead on for more information.\nClick CONNECT if we can help you or you can help us.\nTIPTON FACTS\nWe need to talk about Tipton\nTipton is a wonderful place to live - the Venice of the Midlands, they say in the Black Country Museum.\nOur canals tell our town's story as a proud centre of manufacturing from the Industrial Revolution. These days they are a great resource for our recreation. Maybe some of us could remember to keep them free of litter...\nTipton is very well-connected by train and by road. Every year new houses are built and hundreds come to join us as residents.\nBut there are some real challenges to living here too.\nIf you live in Tipton, your life expectancy is 9 years less than the English average.\nIn the Index of Multiple Deprivation, 90% of England is better off than Tipton in health and education.\nOur employment is in the bottom 5%, with 15 times as many Job-Seekers as the national average.\nTwice as many children in poverty as the national average.\nThe government measures an area's health with 31 indicators, like low birth-weight and obesity.\nTipton is average in 2 of these, and significantly worse than average in the other 29.\nThere aren't easy answers for why it's like this, but we deserve better from those who represent us and share out our taxes.\nEarly this year we learned that Tipton has again got nothing from the Conservative Government's Levelling-Up Fund. And Sandwell Council remains in Special Measures because of big questions about how it manages its money, or our money. So, if Westminster won't help, and Oldbury can't help, how can we fix our problems?\nMaybe if we work together, we can build a stronger community to address the challenges of living in Tipton.\nAnd pick up some litter too.\nTIPTON TOGETHER\nHere's an idea to tackle the real problems we face in Tipton, to get us to a state where we're happier, a little bit more comfortable, and more ready to trust each other.\nWe call it TIPTON TOGETHER.\nWe want to be represented in local government by people who live here and will listen to us, by Tiptonians who will work hard for Tipton.\nWe want to see all of Tipton - Tipton Green, Princes End, and Great Bridge - represented by local people:\n- who won't be satisfied with the old excuses;\n- who will work all year round to serve you, not just in the few days before an election;\nand who won't put their party allegiances before the people of Tipton.\nTipton Together began in March 2021, as soon as Covid restrictions around campaigning were lifted.\nSix weeks later Richard Jeffcoat stood as a candidate in the Tipton Green ward at the Council Election on May 6th.\nRichard came second with 1,011 votes, beating the Conservative candidate. Labour got 1,372 votes, not only their lowest total for several years, but the first time in more than a decade that they got less than 50% of the vote. No other Independent across Sandwell got as much as half Richard's vote.\nIt was an impressive result. We carried it on into the 2022 Election. We knew that, in an area where 'Labour always wins' but three-quarters of us don't bother to vote, it was going to take a few attempts, and so it has proved with campaigns in 2022 and 2023. In May 2023 Richard got 1,225 votes, he took 42% of the vote, and ensured the Conservative candidate got only 198. This year he can win.\nAt the council elections in May 2019, only 24% of us voted.\nIn May 2021, because of our campaign, we pushed that up to 28%. But:\nTHREE-QUARTERS of us chose NOT to have a say in how our council tax is spent.\nWas it because we're satisfied, wealthy, comfortable?\nOr do we think we can't make a difference, what's the point in voting?\nOur most important recent votes have been the EU Referendum and the last General Election. We live in the 8th strongest Leave-voting constituency. Sandwell as a whole voted 67% for Leave.\nBUT:\nOnly two-thirds of us voted. What did the others think?\nAt the General Election in December 2019 Shaun Bailey is to be congratulated on taking the seat for the Conservatives after decades of Labour MPs, winning 51% of the votes.\nBUT:\nOnly 53% of us voted at all. Why did nearly half of us stay silent?\nBefore the 2021 Election, Sandwell's 72 Councillors had one thing in common:\nALL of them were elected as Labour candidates.\nThe Labour Party, nationally and locally, has suffered violent change in recent years. Can we be sure that a Labour candidate will have Tipton as their focus?\nWhen Labour de-selects many candidates every year, how can a Councillor think for themselves, without fearing punishment by the Party? And, in a 12-month period up to the last election, Sandwell had 3 Leaders, making 7 in 6 years!\nAt the 2021 Election, the Conservatives locally are proud that 9 of their candidates won.\nBut can Tipton say our lives have got better during 13 years of Conservative rule in London?\nThe austerity years of Cameron and Osborne, the tensions of Theresa May's rule, last year's run of 3 Conservative Prime Ministers, and the divisive culture wars stoked by some in the current government.\nIsn't it sad that we're so angry?\nWe believe it's time to look at local politics in a different way. A Tipton resident to speak up for Tipton, without bullying from a political party or colleagues or faction. Independent, transparent, working for every community.\nRichard stands again on May 4th to speak for where he lives and pays his taxes, to represent his fellow-residents, from every community.\n- If you're Labour, Conservative, something else, or nothing,\n- if you voted Remain, or Leave, or neither,\n- if you use party loyalty to help you decide which politicians sit in London, or if you don't,\njoin us to give Tipton an Independent voice.\nRICHARD JEFFCOAT\nRichard Jeffcoat has lived in Tipton since 2017. He grew up in Edinburgh though his parents are from Birmingham. He is a musician by trade, a pianist, organist and singer, and he manages a charity that helps musicians at the start of their careers. He lives between the Black Country Museum and the Pie Factory with his schoolteacher partner, and they are between cats.\nRichard has long experience of politics. He worked as a volunteer in the office of the Birmingham Labour MP Gisela Stuart, the Co-Chair of VoteLeave. He stood for election to Sandwell Council for the Green Party in Tipton Green in May 2019, when he came second with 563 votes.\nHe is not a member of a political party.\nRichard is standing on May 2, 2024, to be the Independent Councillor for the ward he lives in.\nThis will be the fourth election he has campaigned in as an Independent, free from any party influence or clique.\nIn May 2021 he got 1,011 votes. In May 2023 he got 1,167 votes. And in May 2023 he got 1,225 votes - this was 42% of the total votes cast. In all the elections he has fought the Conservative candidate has been in third place, and last May the Conservatives got only 198 votes.\nNo Independent candidate has ever won in any ward in Sandwell since its creation in 1974. No Independent has ever achieved more than 1,000 votes, and Richard has done that three times. Last May, when Sandwell elected 24 Councillors, 12 out of the 24 elected won with fewer votes than the 1,225 who voted for Richard.\nRichard has been beaten by Labour until today, in a seat that Labour have never lost. This year, it is time that Tipton Green told Labour that their support cannot be taken for granted.\nIf you choose him on May 2, Richard pledges to listen to you and work for you, without the pressure of party allegiance or faction, to build a healthier, safer Tipton.\nRichard writes:\nI moved to Tipton six years ago, and I have lived in the West Midlands since 2003. I feel really settled here, and I want to offer my time and energy to speak out for my friends and neighbours.\nI can see the challenges for people in Tipton. Even after a generation the end of coal and steel has effects on employment and prospects. The Brexit decision may have an impact on our vital motoring and manufacturing industries. And we are still suffering from a global pandemic.\nI understand party politics. Maybe it's unavoidable when we choose our national government.But it's not working for Tipton.\nToo often round here we have seen politicians acting to serve their career, party and faction - sometimes even their personal gain.\nWe need councillors who are honest, accessible and visible. We need them to fight in the Council House for Tipton's fair share.\nI'm not going to lecture you. You don't need me to tell you what would make your lives easier.\nI want to hear from you about how we can work together to make Tipton a happier, healthier place.\nCONNECT WITH US\n- Can Richard help you as a local campaigning advocate?\n- Are you interested in our ideas and you'd like to offer some advice?\n- Could you help our campaign for May 2nd?\nGet in touch through Facebook, Twitter, phone, or email, using these links.\nOr use the form below.\nJust one thing:\nPlease be kind.\nLife is hard for all of us at the moment. Let's help each other make it better.\nEverything you share with me and all your personal contact details will be handled in the strictest confidence.\nThanks for visiting the site.\nRichard\nPromoted by Richard Jeffcoat,\nof 30 Castle Road, Tipton, DY4 8EA\nContact: 07724 867336\ncampaign@tiptontogether.info\n© 2019"
}