{
  "https_www_nicollendiweni_com_/https_www_nicollendiweni_com/content_1.html": "As a daughter of hardworking parents who sacrificed to provide opportunities, I understand the value of community and the importance of safety and security. With a degree in Criminology and International Relations, experience in both the public and private sector, and as a former District Councillor and Cabinet Member for Safer and Stronger Communities, I hope to bring a unique perspective to the role of Police Crime Commissioner for Derbyshire.\nI live in Derby and am passionate about seeing our city and county thrive. Having engaged with residents across Derby and Derbyshire, in our villages, towns, rural communities and city, I have listened to the many community safety concerns and policing priorities people have shared with me. I firmly believe that everyone should have the chance to build a better life for themselves and their families while feeling safe in their communities no matter where they live or work in our region. Cuts to our overall policing numbers have made protecting our communities a challenge for our police force, and this must change. To ensure that individuals are protected from harm, and have the necessary support when they need it, I want to see an increase in Police Officers and PCSO numbers across Derbyshire, so residents are safer and see the positive changes that come with investing in our public services.\nIt is important to me that we have more neighbourhood police, resources and the technology we need to help tackle crime in our communities, but I know that collaboration is key to achieving our goals. By working together with residents, the police force, partnership organisations, community leaders, businesses, and the government, we can build a safer and stronger community. My hope is that through a fair and holistic approach, we can reduce crime and antisocial behaviour, promote preventative initiatives, and provide support to victims and those impacted by crime.\nOur region has often been overlooked, and many communities and public services have suffered from being underfunded or cut completely. Little to no youth services available, funding for third sector organisations that support our justice system decimated and victim support reduced too. By actively engaging with the community, I will ensure that your voices are heard and that we prioritise the needs of our residents. As your Police and Crime Commissioner for Derbyshire, I am dedicated to strengthening public trust in the police and driving innovative and progressive policies that will transform lives and protect families. Though challenges may vary, but I am confident that we can address the needs and aspirations of all areas of Derbyshire, taking a strategic approach to community safety and policing.\nTogether, we can create a safer, fairer, and more inclusive future for Derbyshire.\nFor more information about a Labour government's plan for policing and how we will make our communities safer please visit HERE and for more information about the role of a Police and Crime Commissioner please visit HERE.\nAbout me\nMy Pledges\nELEVATE OUR AREA\nLEAVE NO ONE BEHIND\nPROTECT AND PROSPER US ALL\n1. PREVENT\nPrevent crime and anti-social behaviour by prioritising early intervention and diversionary activities.\n2. PROTECT\nProtect residents and provide support for victims of crime and those impacted by crime.\n3. POLICE\nIncrease police officers and PCSO numbers. Target resources and secure more funding for our force and communities.\n4. PROSECUTE\nWork with the CPS and police to improve communication, reduce delays, and bolster case file quality to drive up the charge rate.\n5. PARTNER\nHave a stronger strategic partnership approach to tackling crime through better collaboration with key organisations, criminal justice partners, schools and businesses.\n6. PRESENCE\nVisible, accessible and effective force and PCC. Putting the needs of our residents and communities first.\n7. PUBLIC TRUST\nI’m determined to restore your confidence, trust and pride in our local police service."
}