{
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_epping-forest-mp-demands-urgent-action-delayed-hospital-rebuilds/content_2.html": "Dr Neil Hudson, Member of Parliament for Epping Forest, has again urged the Labour Government to accelerate the long-awaited redevelopment of Princess Alexandra Hospital in Harlow and Whipps Cross Hospital in Leytonstone.\nBoth hospitals are essential to the communities of Epping Forest and the wider region, yet face mounting pressures from outdated facilities and growing demand.\nDespite promises made by the Labour Party prior to the 2024 General Election to timely deliver the New Hospitals Programme, the Labour Government has moved both projects into ‘Wave 2’ of its revised timetable, with construction start dates pushed back to between 2032 and 2034. This is a significant and critical delay from previous commitments.\nDr Hudson has been a consistent advocate for improving healthcare provisions locally and is an outspoken supporter of these hospital rebuild projects. He has met with Ministers and repeatedly pressed the Government to reconsider these delays, highlighting the impact on both patients and staff.\nIn the Chamber during the Debate, Epping Forest MP Dr Neil Hudson said:\n“My constituents in Epping Forest depend on the Princess Alexandra Hospital in Harlow and Whipps Cross Hospital in Leytonstone.\n“Despite clear promises made by Labour on these hospitals prior to the election, the Labour Government has now delayed the rebuilding of these two vital hospitals. Particularly galling that Whipps Cross has planning and the car park has already started.\n“Does my Honourable Friend agree with me that the Labour government should re-evaluate their priorities and crack on with delivering the rebuilds promised on Princess Alexandra and Whipps Cross?”\nSpeaking afterwards, Dr Neil Hudson MP said:\n“Princess Alexandra Hospital and Whipps Cross Hospital are lifelines to my constituents in Epping Forest and surrounding areas.\n“I urge the Labour Government to fulfil their promises and bring forward construction as soon as possible and reconsider their devastating decision to delay these critical rebuilds.\n“I will continue to hold the Government to account to deliver these vital projects.”",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_epping-forest-mp-stands-precious-green-belt/content_5.html": "In Parliament during a debate on the Green belt, Dr Neil Hudson MP raised his concerns that the Labour Government’s approach to housing could put Epping Forest’s Green Belt at risk against communities’ wishes, in the House of Commons.\nIn the debate, Dr Hudson outlined his concerns that Labour’s plans to arbitrarily reclassify some Green Belt land as Grey Belt land would impose top-down proposals against the wishes of local communities, and rip away the benefits of the Green Belt including those of the natural environment, biodiversity, and the positive impacts on wellbeing access to these areas have for local residents and visitors.\nDr Hudson has made defending Epping Forest’s Green Belt a key campaign pledge, raising it consistently as Epping Forest’s MP.\nFollowing the Debate, Dr Hudson commented:\n“We are blessed in Epping Forest with precious green belt and I will work hard to defend it. Once it’s gone it’s gone.”\n“We all understand the need for more housing, but this cannot come at the expense of the natural beauty of Epping Forest and the benefits it provides, such as to our environment, biodiversity and the mental health benefits of having access to it. I will work as hard as I can to stop Labour’s imposition of top-down regulation and damage to our precious green belt.”\nIn the Commons Debate, Dr Hudson said:\n“I congratulate my right hon. Friend and fellow Essex MP [Richard Holden, MP for Basildon and Billericay] on securing this important debate. His constituency, like mine, has precious green belt that is so important to the environment, biodiversity and our physical and mental health. I acknowledge the need for housing, but does he share my concerns about this Labour Government’s central top-down targets being imposed on communities against their wishes and, equally, their plans to reclassify some of the green belt as grey belt, thereby putting our precious green belt under immense pressure and danger?”\nYou can see Dr Hudson’s previous comments about the Green Belt here:",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_campaigns_improving-healthcare-provision-and-local-services/content_11.html": "We all depend on the NHS. I will work to protect and enhance our health services, improve access and reduce waiting times. I have helped secure a new Community Diagnostic Centre at St Margaret’s Hospital in Epping. I will work to improve GP and hospital access and will keep pressing for the redevelopments of Princess Alexandra and Whipps Cross Hospitals. I will work cross-party on the vital long-term need to provide compassionate, affordable social care for people most in need.\nMore broadly, I am passionate about securing investment in our local public services such as health, education and police.",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-stands-parliament-epping-forests-pensioners-against-labours-cutting-winter/content_34.html": "In the House of Commons, Dr Neil Hudson MP exposed the impacts of Labour’s plan to cut Winter Fuel Payments from 10 million older people across the UK, during yesterday’s Opposition Day debate held by the Conservative Party following Labour voting to cut Winter Fuel Allowance in Parliament.\nIn that debate, Dr Hudson revealed that the Labour Government have shockingly admitted to him, in their response to a Parliamentary Question he asked, that 15,744 people in Epping Forest could lose between £200 and £300 of support with their energy bills this Winter, because of Labour’s move. Many of these constituents may also be those who are just outside the Pension Credit threshold just making them ineligible for the support under the changes.\nDr Hudson also warned of the real risk to older people’s health if they are unable to heat their homes. Dr Hudson also warned of the increased risk of respiratory disease, strokes, higher blood pressure and hypothermia that older people could face if unable to stay warm this winter.\nThis speech is the latest facet of his ongoing campaign for Labour to reverse these cuts. Labour originally intended to avoid scrutiny and oversight on the move by instituting the change through secondary legislation that does not require a debate, but he ensured yesterday’s Opposition Day debate took place by signing a motion tabled by the Leader of the Opposition Rishi Sunak, with Conservative colleagues, leading to a vote in the Commons. Dr Hudson and the Conservatives voted against the cuts to Winter Fuel Payments.\nDr Hudson has also continued to ensure the move is scrutinised by submitting Written Parliamentary Questions to the Department for Work and Pensions about the measure, ensuring oversight and proper assessment of the impact the removal of Winter Fuel Payments will have on older people in Epping Forest and across the country.\nDespite the move being voted for by the Labour Government, he will continue to campaign for Winter Fuel Payments to be reinstated so older people are protected and kept warm this winter.\nFollowing the debate, Dr Hudson commented:\n“Labour’s vote to remove Winter Fuel Payments from nearly 16,000 of my constituents is heartless and quite frankly shames us as a compassionate nation. With temperatures due to drop and energy bills to rise this winter, I know many of my constituents will be very concerned with how they will keep warm this Winter. This is particularly true for my constituents who face health conditions that require them to remain inside for prolonged periods.\n“I will continue to do everything in my power as an MP to challenge this decision and call on the Government to do the right thing by those who deserve dignity and respect in retirement, by reinstating the Winter Fuel Allowance.”\nDr Hudson's speech can be viewed in full at the following links:\nParliamentlive.tv from 16:57:00: https://www.parliamentlive.tv/Event/Index/d439fb88-5c5c-48c5-a0db-c715e09f78d2?agenda=True\nHansard Transcript: https://hansard.parliament.uk/Commons/2024-09-10/debates/5A9A6942-10A6-46B4-AA27-2B9A481C9FE0/WinterFuelPayment#contribution-FB04463F-926C-4B2D-830B-52D91DA66719\nDr Hudson’s Written Parliamentary Questions and the Government’s responses can be found here:\nhttps://questions-statements.parliament.uk/written-questions/detail/2024-08-30/3220\nhttps://questions-statements.parliament.uk/written-questions/detail/2024-09-03/4046",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-joins-parkinsons-uk-parliament-support-world-parkinsons-day/content_10.html": "Epping Forest MP Dr Neil Hudson recently joined Parkinson’s UK at a special parliamentary event in Westminster to show his support for the 153,000 people living with Parkinson’s in the UK ahead of World Parkinson’s Day on 11 April.\nAt the event, Dr Hudson met with people affected by Parkinson’s to hear firsthand about the challenges they face, including access to specialist healthcare, a shortage of Parkinson’s specialists and financial difficulties.\nThe event highlighted the vital support Parkinson’s UK provides, including a helpline, local advisers, online resources, and research into new treatments. Dr Hudson pledged his support for Parkinson’s UK and its mission to improve care and support for people living with the condition.\nEpping Forest MP, Dr Neil Hudson, said:\n“It was incredibly moving to attend this event and hear directly from people living with Parkinson’s.\n“The condition has many and serious symptoms, including pain and tremor, and can make daily life incredibly challenging.\n“I appreciate the incredible work Parkinson’s UK do to support the Parkinson’s community and raise awareness of this debilitating disease.”\nLaura Cockram, Head of Campaigns at Parkinson’s UK, added:\n“We’re grateful to Dr Hudson for attending and showing their commitment to people with Parkinson’s. Too many people still face long waits for specialist care, difficulty accessing treatments, and financial struggles.\n“We urge MPs to take action in their constituencies and ensure that people with Parkinson’s receive the support they deserve.”\nParkinson's is a complex brain condition that gets worse over time. It’s the fastest growing neurological condition in the world, affecting 153,000 people in the UK. It has more than 40 symptoms, from tremor and pain to anxiety, and there is currently no cure.\nWorld Parkinson’s Day takes place on 11 April, raising awareness and ensuring that people with Parkinson’s feel seen, heard, and supported. Parkinson’s UK is the charity that’s here to support every Parkinson’s journey, every step of the way. For information and support, visit parkinsons.org.uk or call the charity’s free, confidential helpline on 0808 800 0303.",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_about-neil-hudson/content_8.html": "Dr Neil Hudson MP is the Conservative Member of Parliament for Epping Forest. Neil’s family have lived in Epping Forest for decades and Neil started his veterinary career working in and around Epping Forest. Neil’s grandfather was an RAF pilot stationed at North Weald Airfield in 1928, and Neil’s late father was a Parish Councillor in North Weald, and a member of the Board of Governors of Epping St John’s School.\nProfessionally, prior to entering politics, Neil is a veterinary surgeon by background, with specialised training and experience in Equine Medicine and has worked in large and small animal veterinary practice and academia in the UK and Australia. In 2001, Neil spent a period as a Veterinary Inspector during the 2001 Foot and Mouth Crisis. He has postgraduate qualifications in Equine Medicine and Gastroenterology and is a Fellow of the Royal College of Veterinary Surgeons and a Principal Fellow of the Higher Education Academy.\nNeil served in the 2019-2024 Parliament as a Conservative Member of Parliament for a seat now abolished following the 2023 Review of Parliamentary Constituency Boundaries in England. In Parliament, Neil has been an active member of the House of Commons Environment, Food and Rural Affairs Select Committee. Neil was the first vet elected to the House of Commons since 1884 and brings extensive real-life experience to help inform policy in areas such as education, health, science and animal welfare. Neil has campaigned on many issues such as improving mental health, public services, food security and transport links. Neil is passionate about prioritising the UK's strong global security, boosting the nation's physical and mental health, and protecting our precious green and blue spaces. In August 2024 Neil received a special honour from the RSPCA – Neil was awarded the newly-introduced Massingham Advocacy award which recognises elected officials who have demonstrated unwavering dedication and commitment to advocating for animals.\nIn November 2024 Neil was appointed by the Leader of the Opposition, Kemi Badenoch, as a Shadow DEFRA Minister (Department for Environment, Food and Rural Affairs).\nNeil is married with two sons. Outside politics, his interests include football, cricket (he played for Woodford Green Cricket Club in his student days), cycling, music (playing the piano), theatre and walking his dogs Juno and Poppy.\nNeil is passionate about standing up for the people of Epping Forest.",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_media-veterinary-mp-dr-neil-hudson-sounds-biosecurity-alarm-over-illegal-meat-imports/content_21.html": "Dr Neil Hudson MP was on BBC Radio 4's Today Programme in a news piece talking about the potential risks to our country from catastrophic animal diseases like African Swine Fever and Foot and Mouth. The news piece was shining a light on the potentially devastating impact that illegal meat imports would have on farming, animal health, our economy and our environment.\nData obtained by a Freedom of Information Act showed that the amount of illegal meat seized by Border Force has more than doubled in a year despite the number of shipments remaining the same. There is therefore concern that large-scale smuggling is being conducted by organised criminal gangs.\nThe previous Conservative Government implemented the Border Target Operating Model, which came into effect earlier this year, but with growing seizures, Dr Hudson is urging the new Government to fully fund the necessary redevelopment of the Animal and Plant Health Agency HQ to avert the risk of a critical incident for the UK's biosecurity.\nDr Hudson has long campaigned on the issue of biosecurity, having been spurred into politics following the devastating 2001 Foot and Mouth Crisis where he served as a Veterinary Inspector.\n- Dr Neil Hudson MP urges Government to Protect Food Security and Biosecurity\n- Veterinary MP, Dr Neil Hudson visits Port of Dover on parliamentary fact-finding mission\n- Veterinary MP Dr Neil Hudson urges rigorous biosecurity measures to protect farming and keep the public safe\nSpeaking afterwards, Dr Neil Hudson said:\n\"If we do not take advantage of the post-Brexit powers to fully scrutinise animal and plant products entering the country, we open the door to potentially devastating diseases such as African Swine Fever or Foot and Mouth. This would hurt animal health, our agri-food industry, food prices, our trade standing, the environment and so much more...\n\"As the first vet elected to the Commons since 1884, I was deployed during the 2001 Foot and Mouth outbreak, overseeing some of the horrendous culls that came to portray the crisis. I've seen first-hand the grim consequences of animal disease outbreaks and I'm determined that they remain consigned to the history books.\"",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_category_Reports/content_19.html": "Dr Neil Hudson MP appears on Times Radio to raise awareness for critical Marine Mammals protection report 30th June 2023 Dr Neil Hudson, MP for Penrith and The Border, Environment Food and Rural Affairs Committee Member and the only vet in the House of Commons, appeared on... Reports",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news/content_9.html": "Shadow Environment Minister pushes Government to continue Conservative achievements on tackling global deforestation Friday, 2 May, 2025 This week in the House of Commons, Shadow Environment Minister Dr Neil Hudson MP urged the Government to do more to tackle the threat deforestation creates for our planet, both in the UK and in collaboration internationally, during a Commons D ebate on the issue. Deforestation presently has damaging impacts on climate change and biodiversity, being equivalent to a nearly equal amount of carbon... Speeches in Parliament\nShadow DEFRA Minister Dr Neil Hudson MP urges Government to uphold animal welfare standards in trade deals 1st May 2025 Dr Neil Hudson, Member of Parliament for Epping Forest and Shadow DEFRA Minister, has called for urgent action to protect British farmers and uphold the UK’s... Speeches\nEpping Forest MP demands urgent action on delayed hospital rebuilds 23rd April 2025 Dr Neil Hudson, Member of Parliament for Epping Forest, has again urged the Labour Government to accelerate the long-awaited redevelopment of Princess Alexandra... Westminster News\nVeterinary Surgeon Dr Neil Hudson MP stands up for equine welfare at World Horse Welfare event 22nd April 2025 Epping Forest MP, Dr Neil Hudson, the first veterinary surgeon elected to the House of Commons since 1884, recently reaffirmed his longstanding commitment to... Westminster News\nDr Neil Hudson MP joins Parkinson’s UK in Parliament to support World Parkinson’s Day 11th April 2025 Epping Forest MP Dr Neil Hudson recently joined Parkinson’s UK at a special parliamentary event in Westminster to show his support for the 153,000 people living... Westminster News\nVeterinary MP Dr Neil Hudson shows support for responsible dog ownership 2nd April 2025 Member of Parliament for Epping Forest, Dr Neil Hudson, the first vet in the House of Commons since 1884, recently joined forces with the RSPCA at a Westminster... Westminster News\nDr Neil Hudson MP raises concerns as families in Epping Forest hit by £1,191 of extra costs due to Labour Government choices 1st April 2025 Families in Epping Forest are facing significant financial pressures this spring as multiple household bills are set to rise. Analysis shows these increases... Westminster News\nShadow DEFRA Minister pushes Government to back UK fishing rights in upcoming EU negotiations 27th March 2025 In Parliament Dr Neil Hudson MP, Shadow DEFRA Minister, urged the Government to ensure it works to defend the hard-working UK fishing industry and ‘retain... Speeches in Parliament\nDr Neil Hudson MP visits West Hatch High School in Chigwell 24th March 2025 Epping Forest MP Dr Neil Hudson visited West Hatch High School in Chigwell, meeting with students, staff, and newly appointed Headteacher Victoria Schaefer. The... Local News\nEpping Forest MP speaks out in Commons Knife Crime Debate on importance of positive role models for boys and men 21st March 2025 In the House of Commons this week, Dr Neil Hudson, MP for Epping Forest, championed the need to tackle the factors that draw young boys and men into knife crime... Westminster News",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_category_Newsletters/content_25.html": "Dr Neil Hudson MP supports fight against Prostate Cancer 24th October 2024 Member of Parliament for Epping Forest Dr Neil Hudson pledged his support for Prostate Cancer UK’s ‘Faster, Fairer, Better’ campaign to tackle inequalities in... Local NewsNewsletters",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-gives-first-speech-shadow-defra-minister-enact-conservative-disposable-vape/content_22.html": "Veterinary surgeon Dr Neil Hudson MP has been promoted to be a Shadow DEFRA Minister (Department of Environment, Food and Rural Affairs) , and this week gave his first frontbench speech to welcome in a Statutory Instrument that will prohibit the supply of disposable single-use vapes in the interests of the human health, animal health and the environment.\nDr Hudson's first Shadow Ministerial speech was fittingly the culmination of his long-fought campaign to get single-use vapes off our streets to protect children, animals and our precious environment.\nDr Hudson secured and led a key parliamentary debate on keeping children safe from the dangers of vaping in May 2023; consistently raised the issue in the Commons throughout last year; penned articles on the significance of banning disposable vapes; tabled parliamentary questions and met with a range of stakeholders from teachers and medical professionals to smoking charities and the Advertising Standards Authority.\nDr Hudson's recent comments came during a debate on the Environmental Protection (Single-use Vapes) (England) Regulations 2024, a Statutory Instrument which will ban vapes that cannot be both recharged and refilled. This is designed to stop the litter in our streets and countryside, stop the products appealing to children and safeguard global lithium supplies.\nSpeaking afterwards, Epping Forest MP Dr Neil Hudson, said:\n\"Having worked so hard for so long to improve the areas of policy I am so passionate about, it is an honour to have been appointed to this Shadow DEFRA Ministerial role by the Leader of the Opposition Kemi Badenoch.”\n\"Moreover it was so fitting that my first speech was to usher in our Conservative ban on single-use vapes that I have tirelessly campaigned for since first elected to Parliament. These seemingly innocent devices are so damaging to the health and wellbeing of our young folk, to our precious environment and even to curious animals - so good riddance!\"",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-heralds-implementation-border-checks-bolster-uks-biosecurity/content_27.html": "Today (30th April 2024) the Conservative Government has grasped a Brexit opportunity by implementing crucial changes to the way the UK imports food, animal and plant products in order to protect the nation's biosecurity.\nDr Neil Hudson MP stood up in Parliament to pay tribute to those at our borders who do so much to keep us safe from the deeply damaging implications of animal or plant disease outbreaks which could impact food production, our precious environments, animal and human public health. The Veterinary MP also championed the measures which will now check all high and medium risk goods coming into the UK from Europe.\nHaving been involved as a Veterinary Inspector on the frontline of the 2001 Foot and Mouth Crisis, Dr Hudson has worked tirelessly since his election to Parliament to make sure history does not repeat itself in this regard.\nThese checks will help identify public health issues such as salmonella, and build on existing safeguarding measures which identify diseases like African Swine Fever, which is widespread in certain countries across Europe and could be devastating to our pig farms.\nUp until now, most goods from the EU - apart from the highest risk items like live animals and high-risk plants - have been entering the UK without checks. This was always intended to be a temporary measure to allow businesses time to adapt to any incoming changes.\nNow, after having consulted with thousands of stakeholders across the UK and EU including business representative organisations and trade associations representing a broad breadth of industry, the Government is implementing checks to ensure the products we import are as safe as possible.\nDr Neil Hudson MP said:\n\"Having been involved in the frontline in the devastating culls that accompanied the 2001 Foot and Mouth Crisis, I know firsthand how critical protecting our nation's biosecurity is - not just for animal and plant health but our vital agri-food industry, economy, environment, trading relationships and human public health.\n\"Without straying into the realms of alarmism, it is clear to me that the UK continues to face biosecurity threats through the importation of animal and plant diseases. One only needs to look across to our European neighbours and see the damage being inflicted upon domestic pig and wild boar populations by African Swine Fever to know we must remain especially vigilant moving forward.\n\"That is why the global, proportional, risk-based approach that our Conservative Government's Border Target Operating Model presents is so necessary to our national resilience and I look forward to better biosecurity protection from today.\"\nIn the Chamber:\nDr Neil Hudson MP said:\n\"As a Veterinary Surgeon, I am passionate about biosecurity. I am reassured that our Conservative Government are taking this matter very seriously indeed. I thank the Animal and Plant Health Agency and everyone at our borders who do so much in this regard.\n\"Prior to leaving the EU, we did not have the opportunity systematically to check animal and plant products coming into the UK. Does my right hon. Friend agree that we now have the opportunity to strengthen our biosecurity and that the introduction of the Border Target Operating Model will protect animal, plant and, ultimately, human health in the UK moving forward?\"\nFood, Farming and Fisheries Minister, Sir Mark Spencer, replied:\n\"I pay tribute to my hon. Friend for his work in this area and his expertise in it. Moving forward, we will be in a much stronger place in terms of our phytosanitary and sanitary protections. That is the right outcome. We will continue to ensure that we are safe in the UK and that we protect our borders proportionately.\"",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_veterinary-mp-dr-neil-hudson-celebrates-campaign-win-puppy-smuggling-bill-passes-second/content_32.html": "As Shadow DEFRA Minister, Dr Neil Hudson MP gave the full support of His Majesty's Most Loyal Opposition to a Bill which aims to stamp out the immoral puppy smuggling trade that has continued to spiral since the COVID-19 pandemic.\nDr Neil Hudson, the MP for Epping Forest, was the first vet elected to the House of Commons in more than 100 years and with his expertise, has been a long-standing advocate for anti-puppy smuggling measures which also extend to ferrets and cats, as well as heavily pregnant dogs and those animals with horrific mutilations such as dogs with cropped ears and de-clawed cats.\nThe pandemic saw a huge spike in illicit imports and animal campaigners have said this only represents unscrupulous smugglers who were caught, and the presence of imported mutilated dogs in the general population shows many more have evaded authorities.\nMany of these puppies are kept in awful conditions during shipping to the UK with no care for their welfare. Imported animals can pose a biosecurity risk due to reported cases of zoonotic diseases, such as Brucella canis.\nSince the pandemic, Dr Hudson has held debates on the issue, hosted expert roundtables, invited leading animal welfare charities to Parliament, triggered a Select Committee Inquiry and led parliamentary delegations to the Border in Dover and animal rescue centres.\nThe Animal Welfare (Import of Dogs, Cats and Ferrets) Bill had its Second Reading in Parliament and from the frontbenches, Dr Neil Hudson MP said:\n\"Animal welfare unites us in humanity. As a Veterinary Surgeon, a Member of Parliament and the Shadow Environment, Food and Rural Affairs Minister, I can proudly say that His Majesty’s loyal Opposition strongly support this Bill in the interests of animal health and welfare.\"\nSpeaking afterwards, Dr Neil Hudson MP said:\n\"As a vet, MP and Shadow DEFRA Minister and frankly as an animal lover, I have been delighted with the cross-party support for this vital piece of legislation that the previous Conservative Government drafted just this year.”\n\"For too long unscrupulous smugglers have taken advantage of loop holes, lax checks and a lack of data to proliferate this grim trade that does so much to damage the lives of individual pets, as well as potentially public health and those who have been duped into housing these vulnerable animals.\n\"I'm delighted we will now finally be able clamp down on these immoral practices with tough penalties.\"",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_veterinary-mp-votes-favour-windsor-framework-highlighting-huge-progress-made-medicines-animal/content_37.html": "Dr Neil Hudson, MP for Penrith and The Border, strongly supported the Windsor Framework as it received overwhelming backing from MPs. Pointing to the myriad benefits for trade, key industries, animal health and welfare; and ultimately the people of Northern Ireland, Dr Hudson again took to the Chamber to champion the historic breakthrough.\nThe Windsor Framework was approved by 515 votes to 29 and Dr Hudson was proud to add his name to the aye column.\nThe Penrith MP is the only vet to be elected to the Commons since 1884 and has consistently used his expertise to champion animal health and welfare issues in Parliament. As such, Dr Hudson stood up in the House of Commons to quiz the Northern Ireland Secretary and his Opposition counterpart on the progress to provide long-term availability of veterinary medicines in Northern Ireland and smooth the safe movement of animals between Great Britain and Northern Ireland.\nHe previously welcomed the Windsor Framework with the Prime Minister in the Commons and specifically the significant steps made to agri-food industry issues, the movement of pets and the availability of veterinary medicines in Northern Ireland. Dr Hudson’s parliamentary question to the Prime Minister and his full response to the Windsor Framework can be found here: www.neilhudson.org.uk/news/veterinary-mp-dr-neil-hudson-welcomes-windsor-frameworks-commitment-agri-food-pet-and-medicine\nWhile significant breakthroughs were made, veterinary medicines are only available due to the extension of a grace period until 2025 and progress on the movement of animals does not include livestock or horses. Without further progress Dr Hudson is concerned that the health of animals may suffer.\nWhen quizzing Northern Ireland Secretary Chris Heaton-Harris during Northern Ireland Questions, the Minister pointed to the new chapter in our relationship with the EU, which has allowed for a closer working relationship and will allow for further steps to be made on the issues Dr Hudson raised.\nDr Hudson later raised the incredible progress made on veterinary, and sanitary and phytosanitary issues during the later Windsor Framework debate, urging the whole House to support the deal.\nSpeaking afterwards, Dr Neil Hudson, MP for Penrith and the Border, said:\n“This vote was immensely important, and I am proud to give my support to the monumental agreement. The historic steps made by the Windsor Framework should rightly be celebrated and I thank the Prime Minister for directly addressing animal health and welfare issues posed by the original protocol. The feedback from my many farming constituents and veterinary peers has been overwhelmingly positive. We need to consolidate the sensible trading, veterinary and SPS measures in the framework and move forward, restore Stormont and secure prosperity for Northern Ireland and the whole UK.”\n“We still have further to go to ensure consistency for animals across the entire United Kingdom. The Northern Irish farming and equine sectors contribute massively to the nation’s economy and smoother safe movement of animals is imperative to the sectors.\n“I thank the Minister for his answer and look forward to continuing to work with his Government to find pragmatic solutions to the questions of the animal movement and veterinary medicine availability. ”\nThe full exchange at Northern Ireland Questions:\nDr Neil Hudson, MP for Penrith and The Border, asked:\n“I strongly support the Windsor Framework and welcome the veterinary and SPS measures.\n“Can my Right Honourable Friend update the House on progress towards securing the long-term supply of veterinary medicines in Northern Ireland and also smoothing the safe movement of animals between GB and Northern Ireland to include not only pets but also farm animals and horses?”\nChris Heaton-Harris, Secretary of State for Northern Ireland, replied:\n“I thank the Honourable Gentleman for his question. He knows a great deal about this subject.\n“As he knows there is a grace period in place until the end of December 2025 on veterinary medicines. I would like to think that the new atmosphere that has been created between the United Kingdom and the European Union as we move forward has demonstrated that we can talk and negotiate about these things and we fully expect to be able to be in a position to address all of his concerns in good time.”\nDr Hudson's intervention during the Windsor Framework debate:\n\"Would the Honourable Member agree with me that the Government has made tremendous progress with this Windsor Framework in terms of veterinary and sanitary and phytosanitary measures and what has been achieved with the securing of human medicines long term and the direction of travel for securing veterinary medicines up until the grace period ends shows that what can be achieved through dialogue?\n\"And it really shows to us all that we should be strongly supporting this framework deal.\"\nWatch the proceedings in full from, here: www.parliamentlive.tv/Event/Index/0ed407e4-46bb-4f2a-9d13-125d202a02f4",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-highlights-youth-suicide-prevention-prime-ministers-questions/content_35.html": "Today in the House of Commons, Epping Forest MP Dr Neil Hudson urged Prime Minister Sir Keir Starmer to guarantee the inclusion of suicide prevention into the National Curriculum, during Prime Minister’s Questions, and secured a further meeting between the Prime Minister and the 3 Dads Walking.\nThe 3 Dads Walking, Andy Airey, Tim Owen and Mike Palmer, have been campaigning to see suicide prevention included in the Relationship, Sex and Health Education (RSHE) Curriculum in schools, following the tragic loss of their daughters, Sophie, Emily and Beth to suicide. Their story has rightly gained national attention, raising over £1million through fundraising walks, in support of the PAPYRUS Prevention of Young Suicide mental health charity, being awarded MBEs by the King, and winning the Pride of Britain Award for their efforts.\nCampaigning on this issue over the years has seen Dr Hudson join the 3 Dads on one of their fundraising walks, gaining cross-party support for a Early Day Motion calling to expand mental health first aid training in schools and colleges, and facilitating a meeting between the 3 Dads and former Prime Minister Rishi Sunak while in office, to discuss the 3 Dads Walking’s campaign and what can be done to help prevent suicide in young people.\nFollowing that meeting, the previous Government introduced new draft RSHE guidance including age-appropriate suicide prevention. A consultation was then carried out on the guidance as required, but a response to it has not been issued since it was completed in July last year.\nSuicide is the biggest killer of under-35s in the UK, so suicide prevention, delivered in an age-appropriate way, could be key to saving more young lives and breaking down the barriers to reaching young people in crisis.\nA meeting with the Prime Minister will be a further step to discuss what the current Government will do on this vital issue.\nIn Prime Minister’s Questions, Dr Hudson asked:\n“Sadly, suicide is the biggest killer of young people under 35. Andy Airey, Tim Owen and Mike Palmer are the ‘3 Dads Walking’. They each tragically lost their precious daughters Sophie, Emily and Beth to suicide, and have campaigned tirelessly for suicide prevention to be included in the school curriculum in an age-appropriate way.\nWe met with the previous Prime Minister in Downing Street and suicide prevention was added to the RSHE Curriculum Guidance for consultation last year.\nI know the Prime Minister has met the 3 Dads and supports their campaign, but progress has stalled.\nPlease, would the Prime Minister meet with me and the 3 Dads so that we can finally get this over the line, and ultimately save young lives?”\nPrime Minister, Sir Keir Starmer replied:\n“Can I thank him for steadfastly raising this really important issue, particularly during Children’s Mental Health Week? I have met the 3 Dads Walking. They are inspirational and their courage is extraordinary. As the father of young children, I don’t know how they are able to campaign in the way that they do. I am not sure I would be able to do so. So f course, I can assure him that I will meet them again and push this really important agenda forward.”\nFollowing Prime Minister’s Questions, Dr Hudson commented:\n“It was a humbling privilege to be able to use my rare PMQ chance to ask the Prime Minister about the important work and campaigning of the 3 Dads Walking, who are a real testament to all of us about the power of turning pain and tragedy into helping others.\nPutting age-appropriate suicide prevention into the school curriculum is something that will save young lives, and I really hope that further meeting the Prime Minister can be the final catalyst to make this change.”\n**************************************************************************************************************************\nFor young people dealing with thoughts of suicide or those concerned for a young person who might be, PAPYRUS operate a confidential service called HOPELINE UK which you can call (0800 068 4141), text (07860039967), or email [email protected].\nOther crisis helplines include the Samaritans (116 123), SANEline (0300 304 7000), National Suicide Prevention Helpline UK (0800 689 5652), and Campaign Against Living Miserably (0800 58 58 58).",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_cdn-cgi_l_email-protection/content_23.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_epping-forest-mp-stands-local-healthcare-against-labours-jobs-tax/content_29.html": "Dr Neil Hudson, Member of Parliament for Epping Forest, has reiterated his commitment to supporting local healthcare providers during a recent debate in the House of Commons on the Labour Government's National Insurance Contributions (Secondary Class 1 Contributions) Bill.\nDespite Labour’s manifesto pledge not to increase National Insurance, this legislation will introduce a £25 billion Jobs Tax. The Bill has been widely criticised for not exempting many essential private sector firms, charities and health and social care providers, thereby forcing GP surgeries, pharmacies, care homes, and hospices to absorb this significant tax hike.\nHealthcare organisations have raised serious concerns about the impact of this policy. The Royal College of General Practitioners has warned that the increased costs could force GP surgeries to make staff redundancies or even close their doors. Similarly, Marie Curie has highlighted the strain this additional financial burden will place on their ability to deliver vital end-of-life care services.\nIn response to these concerns, the Conservatives have successfully tabled amendments to the Bill which will protect hospices, GP surgeries, care providers, charities, transport providers for children with Special Educational Needs, and early years providers from the adverse effects of the tax increase. However, the Labour Government has voted down these amendments.\nDr Neil Hudson has been a vocal advocate for improving healthcare provision in Epping Forest. He has played a key role in securing a new Community Diagnostic Centre at St Margaret’s Hospital in Epping and continues to press the Labour Government to expedite the redevelopment of Princess Alexandra Hospital in Harlow and Whipps Cross Hospital in Leytonstone. Additionally, he is working alongside local Conservative councillors to campaign for a new GP surgery in Chigwell.\nIn the Chamber during the Debate, Epping Forest MP Dr Neil Hudson said:\n“The figures that the Minister is presenting, along with the answer that he gave to the hon. Member for Strangford, and similar to the Prime Minister, involve money going into sectors that will not mitigate the national insurance rise.\n“Will he confirm that sectors such as hospices, social care, GPs and pharmacies will have some support, rather than tell us about money that is not going to help people with regard to the Jobs Tax that is coming in?”\nExchequer Secretary to the Treasury James Murray MP replied:\n“The various organisations or services that I am talking about, whether GPs, pharmacies or organisations that provide social care, receive money from Government, and the way that those discussions take place is by considering pressures on the providers of those services in the round—that is the way the negotiations take place.\n“Direct support for employer national insurance contributions obviously applies to central Government, local government and public corporations, which is much the same way that the previous Government approached things under the health and social care levy.\n“Pressures on social care or GPs, as I have been outlining, are considered in the round in terms of their funding settlements, and as I said, the £880 million of new grant funding can be used to address a range of pressures facing adult social care.”\nSpeaking afterwards, Dr Neil Hudson MP said:\n“I am incredibly disappointed that this Labour Government has chosen to impose additional financial pressures on vital healthcare services that are already struggling under immense strain. I was really disappointed with the Minister’s response, showing that the Government do not understand the impact of their jobs tax and they are making no attempt to mitigate the consequences that health providers in Epping Forest and across the country are having to face.\n“This Jobs Tax will have devastating consequences for GP surgeries, care homes, hospices and pharmacies - services that our communities rely on every day. We Conservatives have tabled amendments to try and help mitigate the disastrous impact of this tax, however Labour sadly rejected them.\n“I will continue to fight for fair treatment for these essential providers and ensure that Epping Forest residents have access to the healthcare they deserve.”",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-rails-against-labours-ill-judged-and-heartless-family-farm-tax-first-commons/content_7.html": "Dr Neil Hudson MP stood at the Despatch Box in his new role as Shadow DEFRA Minister to warn Labour against their \"ill judged and heartless\" family farm tax that threatens British food security as well as lives and livelihoods in rural communities across the nation.\nIn the Autumn Budget, Labour announced a family farm tax that will impact thousands of rural businesses and communities across the country. This tax halves the Agricultural Property Relief, which the NFU have said \"threatens family farms\" and will \"make producing food more expensive\".\nDr Hudson is concerned that this severely risks our domestic food security by forcing farmers to sell off land to developers and investors, thus rendering prime agricultural land unproductive. This callous policy not only impacts the UK's vibrant farming communities but everyone up and down the land who will see food prices rise as we are subjected to the whims of the volatile international market.\nDr Hudson has been a longstanding advocate for farmers and has campaigned on the issue of Agricultural Property Relief non-stop since it was announced at the end of last month. Read more about Dr Hudson's work here: www.neilhudson.org.uk/news/epping-forest-mp-dr-neil-hudson-urges-government-rethink-protect-family-farms\nIn the Chamber, Dr Neil Hudson, Shadow DEFRA Minister and MP for Epping Forest, asked:\n\"Food Security is national security and underpinning this are farmers and farmland. Labour's ill judged and heartless family farm tax will put all of that at jeopardy. Family farms lost, tenant farmers not being able to stay farming, communities hollowed out, rural mental health damaged and precious food producing land lost to developers or investors.\n\"No farms, no food. No farmers, no food.\n\"Will the Government please now admit they have got this catastrophically wrong, do the right thing, reverse this farm tax and protect our country's food security?\"\nSpeaking afterwards, Dr Hudson, added:\n\"I am simply astounded at the lack of respect or understanding the incoming Government has shown for our brilliant British farmers and all of us they feed. The Minister's reply was tone-deaf and noncommittal.\n\"This misguided policy decision is a short-term cash grab at the expense of long-term food security. I promise to the farmers in Epping Forest and across the UK - we will fight this.\"\nDuring the previous Conservative Government, Dr Hudson was proud to welcome the biggest update to farming schemes since the start of the agricultural transition. This took the UK government's grant offer to £427 million to invest in farm resilience and innovation - building on the £2.4 billion annual farming budget.\nMoreover, Dr Hudson attended the first ever Farm to Fork Summit, where the Conservative Government introduced the Food Security Index, committing to grow 60 per cent of our food at home. Labour have not committed to either the Summit or the Index, threatening to remove key data from the public domain.",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-joins-more-70-parliamentarians-urging-chancellor-not-increase-cost-fuel/content_28.html": "Dr Neil Hudson, MP for Epping Forest, has joined a campaign alongside more than seventy Members of Parliament urging the Chancellor to keep the cost of fuel down at the Budget.\nIn a joint letter to Rachel Reeves, dozens of Conservative MPs tell the Chancellor to consider the impact of a rise in fuel duty on low-income families, small businesses and the logistics industry.\nFuel duty has remained frozen for the last 14 years, currently standing at 6p less than when Labour were last in power. This has benefitted Britain’s 37 million motorists and businesses. However, Dr Hudson argues it is essential the Chancellor helps to keep the cost of fuel down at the Budget.\nDr Neil Hudson, MP for Epping Forest, said:\n“The Conservatives stood by Britain’s 37 million motorists and kept fuel prices down at the Budget for 14 consecutive years. There is yet to be any indication from the Government that Labour will do the same.\n“That the prospect of a rise in fuel hangs over motorists before the Budget, which would have a huge impact on families and businesses in Epping Forest.\n“That’s why I am delighted to sign this letter with over 70 of my colleagues to demand the Chancellor does not punish motorists at the Budget and does not punish motorists, families and businesses across the United Kingdom with this cynical money grab.”\nWorking with FairFuelUK and Saqib Bhatti MBE MP, Dr Hudson claims that hiking fuel duty slows economic growth, costs jobs, stokes inflation and reduces consumer spending. Latest evidence from the Centre for Economic Business Research predicts that raising fuel duty will only bring about short-term benefits for the Treasury and the long-term impact of raising fuel duty could lead to a collapse in revenue by 60%, within five years.\nAnalysis from FairFuelUK indicates the impact on family finances if fuel duty is increase by 5p is estimated to add £160 to annual fill-up costs, whilst the average commercial van could see costs spiral by £500.\nDr Hudson also called for the Government to continue the delivery and roll-out of the Conservative Government’s PumpWatch scheme, which allowed motorists to locate the lowest forecourt pump prices. The MPs argue this would protect motorists, families, and businesses across the UK.\nDr Hudson is a long-time supporter of motorists and was instrumental in the Sunak government keeping fuel duty frozen. More here: www.neilhudson.org.uk/news/dr-neil-hudson-mp-celebrates-policy-victories-chancellor-unveils-his-budget-long-term-growth",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_parliament-dr-neil-hudson-mp-criticises-governments-policy-failure-british-indian-ocean/content_36.html": "In an embarrassing blow to Keir Starmer's Government, the new Prime Minister of Mauritius has rejected a deal to cede UK sovereignty of the British Indian Ocean Territory - which prompted an Urgent Question in the House of Commons by Shadow Foreign Secretary Priti Patel.\nSpeaking in the House of Commons on the Urgent Question, Dr Neil Hudson, the Epping Forest MP, branded it an \"ill-judged and regrettable policy decision\" which would see British sovereignty of the British Indian Ocean Territory relinquished to Mauritius.\nThe islands have been under British rule since 1814 and due to their strategic location, right in the centre of the Indian Ocean, are incredibly critical and house the UK's only military base in the Indo-Pacific.\nIf ceded to Mauritius, Dr Hudson and his Conservative colleagues highlighted the potentially devastating impact on international security with other global players - many malign actors - filling gaps left by British power. Moreover it sets a dangerous precedent for overseas territories such as the Falkland Islands and Gibraltar.\nThe initial decision was made when Parliament was not sitting, a treaty has not been published, it is not clear how much money the UK will provide Mauritius every year and there has been no assurance that malign foreign powers cannot use the islands for their own military endeavours.\nFor Dr Hudson though, this is just the most recent iteration of a pattern of government failure and a refusal to make admissions of wrongdoing.\nIn the Chamber, Dr Hudson asked the question:\n\"Yet again this new Labour Government rushed into an ill-judged and regrettable policy decision to cede the British Indian Ocean Territory to Mauritius, against expert advice and with no regard to the wishes of the Chagossians in this country and elsewhere.\n\"Like their awful policies on scrapping the Winter Fuel Payment for pensioners, the heartless Family Farm Tax and their Jobs Tax. will the Government now show some leadership, admit that they have got this wrong, scrap this deal and keep this vital territory under British control to protect UK interests, the marine environment and ultimately global security in an increasingly unstable and dangerous world?\"\nSpeaking afterwards, Dr Hudson added:\n\"I know people up and down the land are disturbed that the UK Government would even consider ceding strategic British territory. Our international standing depends in part on our military capabilities around the entire world, and so to relinquish a key naval and airbase complex with global instability as high as ever, is a deeply retrograde decision.\n\"This is just the latest in a long line of mis-steps by the new Labour administration which has repeatedly failed to judge the national mood on key issues. As I said in the Chamber it has been failure after failure - with pensioners, farmers, entrepreneurs and taxpayers paying the price.\"",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-shines-light-eppings-acclaimed-political-heritage-visit-local-museum/content_13.html": "Dr Neil Hudson, MP for Epping Forest, visited Epping Forest District Museum to highlight the team's important community outreach work and pay tribute to a new exhibition on his most notable parliamentary predecessor Sir Winston Churchill.\nDr Hudson was given a tour by the museum manager, which culminated in the museum's new permanent display on Winston Churchill.\nMarking 100 years since Churchill's election as MP for Epping, the new exhibition, 'Churchill and the District' showcases the famous Prime Minister's connection to the region, with photographs of campaign rallies in Waltham Abbey, Epping and Loughton.\nWinston Churchill was the Member of Parliament for Epping - a precursor to Dr Hudson's Epping Forest seat - from 1924 to 1945, the longest time he represented any one constituency. Dr Hudson was keen to reinforce that without the goodwill of Epping folk, electing Sir Winston, then modern European history may have been very different.\nThe exhibition was supported by the Churchill Archives Centre which provided a range of photographs for the museum's use.\nDr Neil Hudson, MP for Epping Forest, said:\n\"I cannot thank the Epping Forest District Museum team enough for both their hospitality, and indeed the incredible service they provide linking local people to their heritage and telling the stories of their past.\n\"The new permanent display on Churchill's links to, and love of, our beautiful corner of England was especially poignant. Sir Winston Churchill led from the front defending freedom and democracy while serving as MP for Epping. Without the goodwill of Epping folk, electing Sir Winston, then modern European history may have been very different indeed.\n\"I must congratulate Cllr Holly Whitbread who chairs the museum trust for putting forward the idea to celebrate Churchill's anniversary in this manner, and indeed everyone involved in producing the wonderful homage to our district’s history.\n\"The museum is a brilliant resource for local folk, and I'd highly recommend they find out more about what is available to them.\"\nIan Channell, Epping Forest District Museum Manager, said:\n\"We were delighted to welcome Dr Neil Hudson, MP for Epping Forest, to the museum. Museum staff showed Dr Hudson some of our displays, including a selection of posters by Buckhurst Hill artist Walter Spradbery (1889-1969) and our new permanent exhibit commemorating the centenary of Winston Churchill’s tenure as MP for Epping.\n\"Epping Forest District Museum tells the story of the Epping Forest District of Essex through changing exhibitions, informal and formal learning opportunities, and community engagement programs.\n\"Established as an independent charitable trust in April 2024, the museum aims to provide inspirational experiences and opportunities for people to connect with their heritage, bringing communities together and fostering local pride in our beautiful and historically rich corner of Essex.\"\nThe Epping Forest District Museum is housing in a beautiful Grade II* listed building in Waltham Abbey and has a range of exhibitions, galleries, a gift shop, and a variety of activities suitable for all ages. On top of this the team support a vibrant event schedule, school trips, and local community group engagement.\nTo find out more, visit: Home - Epping Forest District Museum Trust",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-triggers-urgent-question-commons-about-uk-governments-response-foot-and/content_20.html": "With a case of highly contagious Foot and Mouth Disease confirmed in Germany, Shadow DEFRA Minister and veterinary surgeon Dr Neil Hudson, triggered an Urgent Question in the Commons to seek urgent information from the UK Government about their response, and demanding that they fully fund our biosecurity defences or risk catastrophe being enacted to our farmers, their mental health, our economy, our food security and our international standing.\nA landmark report from the National Audit Office found that the Animal and Plant Health agency required £2.8 billion to redevelop its headquarters in Weybridge and keep the site operational and resilient. The previous Conservative Government invested £1.2 billion to initiate works, but the new Labour Government has so far committed only £200 million, rather than the £1.6 billion needed to complete works in full. This could leave the nation at serious risk of a major disease outbreak should Foot and Mouth Disease reach UK livestock populations.\nThe Urgent Question he triggered has a particularly personal element for Dr Hudson who, as the first vet elected to the House of Commons since 1884, was on the frontline of the 2001 Foot and Mouth Crisis overseeing some of the grim culls that came to symbolise the crisis.\nThe 2001 Crisis saw 6 million animals slaughtered across the UK, enacted incalculable trauma on rural populations, and cost the public and private sector approximately £13.9 billion in 2023/4 prices - highlighting just how destructive the disease would be if it were to enter the UK.\nThe recent confirmation of the disease in Germany has triggered new concerns about the UK's animal disease outbreak preparedness and Dr Hudson is continuing to hold Government to account over biosecurity preparedness.\nSpeaking afterwards Dr Neil Hudson, Shadow DEFRA Minister, veterinary surgeon, and MP for Epping Forest, said:\n\"I welcome decisive action taken by the Chief Veterinary Officer in banning German imports and all the hard work undertaken by individuals at the Animal and Plant Health Agency, but without committing to fully funding their headquarters, Ministers are leaving our biosecurity vulnerable.\n\"If, heaven forbid, Foot and Mouth were to enter the UK and infect our farm livestock the destruction would reach far beyond farmers and the countryside. The impacts of Foot and Mouth on the mental health of people involved must never be under-estimated. The disease would also impact the availability and cost of food; it would devastate our rural economy, our trade standing and our critical agri-food sector; and could even pose a risk to human public health if the APHA's capacity was stretched.\n\"This is a stark wake up call for decision makers and I will continue to urge that the Government continue the work started by the previous Government and fully redevelop our APHA HQ to protect the UK’s biosecurity in the long term.”\nThe UK's Chief Veterinary Officer, Dr Christine Middlemiss, has urged livestock keepers to exercise the upmost vigilance for signs of disease, follow scrupulous biosecurity and report any suspicion of disease immediately to the APHA. She added that her teams are in constant contact with their German counterparts and will use all available measures to limit the spread of disease.\nDr Hudson has long-campaigned to bolster the UK's animal disease capabilities. You can read more about his concerted efforts here:\n- Dr Neil Hudson MP urges Labour to continue Conservative work to protect UK biosecurity, or face the dire consequences\n- In the media: Veterinary MP Dr Neil Hudson sounds Biosecurity alarm over illegal meat imports\n- Dr Neil Hudson writes in the Daily Express urging the Chancellor to properly fund UK’s Biosecurity ahead of the Budget\n- Dr Neil Hudson MP urges Government to Protect Food Security and Biosecurity\n- Dr Neil Hudson MP calls on Labour Government to protect UK biosecurity against major animal disease threats\nDr Hudson's full intervention in the House of Commons:\n\"Thank you, Mr Speaker, and thank you for granting this question.\n\"I declare a strong personal and professional interest as a Veterinary Surgeon I supervised some of the animal culls in the 2001 outbreak, witnessing sights I never want to see again in my lifetime, Mr Speaker.\n\"The confirmation on January 10th of Foot and Mouth Disease in Germany, with subsequent slaughter and movement restrictions is sending shockwaves around Europe and the UK. We have requested this question as no statement has been provided to the House on Monday or Tuesday. My colleague, the Shadow DEFRA Secretary, is not able to be with us today as she is at the LAMMA Show in Birmingham speaking to agricultural manufacturers and farmers.\n\"In 2001, the Foot and Mouth outbreak resulted in more than 6 million animals being culled and cost £12.8 billion in today's prices. It devastated the farming community and farmers want reassurance that action is being taken to protect our borders, their livestock and their livelihoods. The mental health impacts of Foot and Mouth, Mr Speaker, cannot be overstated.\n\"Can the Minister reassure us that the announced movement restrictions are fully in place for animals and products coming to the UK from the affected area? Will the Government think about extending the ban to personal imports of meat and milk products unless accompanied by veterinary documentation? And can he update us on the work tracing possible movements of products from Germany? Also, what advice is there about movement of people and vehicles from the area in terms of fomite transmission of the virus?\n\"And heaven forbid Mr Speaker, if Foot and Mouth ever entered the United Kingdom what is the situation regarding vaccine supply and potential deployment?\n\"Finally, I want to again pay tribute the Chief Vets, the veterinary, animal officers, scientists, and officials at the Animal and Plant Health Agency who do so much to keep our country biosecure.\n\"This Foot and Mouth Disease wake-up call is yet more evidence that the Government must now commit to fully fund the redevelopment of the APHA HQ in Weybridge. I call and I urge the Government from the bottom of my heart, Mr Speaker, to fully fund that redevelopment to make sure that the burning pyres of slaughtered animals, as well as the economic and mental health devastation of Foot and Mouth disease, remain resolutely confined to the history books.\"",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk/content_1.html": "Latest News Shadow Environment Minister pushes Government to continue Conservative achievements on tackling global deforestation This week in the House of Commons, Shadow Environment Minister Dr Neil… Shadow DEFRA Minister Dr Neil Hudson MP urges Government to uphold animal welfare standards in trade deals Dr Neil Hudson, Member of Parliament for Epping Forest and Shadow DEFRA… Epping Forest MP demands urgent action on delayed hospital rebuilds Dr Neil Hudson, Member of Parliament for Epping Forest, has again urged the… Veterinary Surgeon Dr Neil Hudson MP stands up for equine welfare at World Horse Welfare event Epping Forest MP, Dr Neil Hudson, the first veterinary surgeon elected to the… Campaigns Improving Healthcare Provision and Local Services We all depend on the NHS. I will work to protect and enhance our health… Giving Every Child the Best Start in Life I am passionate about education and believe every child deserves a world class… Supporting the Economy We have amazing and diverse businesses right across Epping Forest that we all… Get in touch House of Commons, London, SW1A 0AA020 8508 6608[email protected] Am I your MP? Enter your postcode Postcode Epping Forest\nShadow Environment Minister pushes Government to continue Conservative achievements on tackling global deforestation This week in the House of Commons, Shadow Environment Minister Dr Neil…\nShadow DEFRA Minister Dr Neil Hudson MP urges Government to uphold animal welfare standards in trade deals Dr Neil Hudson, Member of Parliament for Epping Forest and Shadow DEFRA…\nEpping Forest MP demands urgent action on delayed hospital rebuilds Dr Neil Hudson, Member of Parliament for Epping Forest, has again urged the…\nVeterinary Surgeon Dr Neil Hudson MP stands up for equine welfare at World Horse Welfare event Epping Forest MP, Dr Neil Hudson, the first veterinary surgeon elected to the…\nImproving Healthcare Provision and Local Services We all depend on the NHS. I will work to protect and enhance our health…\nGiving Every Child the Best Start in Life I am passionate about education and believe every child deserves a world class…\nSupporting the Economy We have amazing and diverse businesses right across Epping Forest that we all…",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_shadow-environment-minister-pushes-government-continue-conservative-achievements-tackling/content_16.html": "This week in the House of Commons, Shadow Environment Minister Dr Neil Hudson MP urged the Government to do more to tackle the threat deforestation creates for our planet, both in the UK and in collaboration internationally, during a Commons Debate on the issue.\nDeforestation presently has damaging impacts on climate change and biodiversity, being equivalent to a nearly equal amount of carbon emissions as that produced by all vehicles combined worldwide. For animals, deforestation is a real threat to the existence of species across the animal kingdom, including orangutans, tigers and elephants.\nThe previous Conservative Government worked hard to drive global change on this crucial issue to our planet, including the delivery of the Environment Act 2021 that set out key targets for nature, and used the Act’s provisions to introduce due diligence provisions that would have sought to eliminate illegal deforestation being used in the supply chain behind commodities connected to it, including palm oil production, beef and soy.\nIt also ensured global collaboration to tackle this global challenge, securing a commitment of 141 countries, covering 90% of the world’s forest, to reverse forest loss and land degradation by 2030 during the UK’s Presidency of COP26.\nDespite this, it is currently estimated that every hour rainforest land equivalent to nearly 300 football pitches is being lost to deforestation for use of palm oil production, and the UN has found that even with a reduction in deforestation, the climate change it contributes to is making forests more susceptible to wildfires and pests.\nDr Hudson therefore pushed the Government to make haste with passing the necessary secondary legislation to tackle ‘forest-risk’ products like palm oil’s contribution to deforestation, and to set out what its priorities will be to address the issue internationally, including what funding it will commit to.\nSupporting the highest environmental and animal welfare standards at home and abroad is a core value of Dr Hudson’s approach to his Shadow Ministerial role and as a Member of Parliament. He attended COP26’s Climate Change Summit on Nature Day to support the previous Government’s commitments to reduce deforestation and carbon emissions and has pushed for the UK to defend its high environmental and animal welfare standards in all trade deals with international partners.\nHe also defended our animal welfare standards specifically in this week’s debate, highlighting the need for red line importation bans on chlorine-washed poultry, ractopamine-fed pork and hormone-treated beef and dairy, that some concerningly believe could be conceded in a government trade deal with the US.\nYou can view Dr Hudson’s contribution to the debate at the following links:\nWatch at parliamentlive.tv from 10:31:09: https://parliamentlive.tv/Event/Index/6c35caf8-e386-48ab-ac82-2de31141a169\nFollowing the debate, Dr Hudson commented:\n“Our precious Epping Forest here in our constituency brings close to home how precious our forests are for all of us, and the duty governments across the world, including ours, have to protect them.\nThe previous Conservative Government did so much to champion our environmental and animal welfare standards around the world, passing our landmark Environment Act and its ambitious targets for nature and wildlife including tackling deforestation, agreeing joint action with countries across the world and to double spending on International Climate Finance to address this problem.\nThis record demonstrates clearly that our influence can make us a force for good in the world driving positive change, which makes it all the more disappointing the current Labour Government has refused to listen to us and has failed to commit to a timetable to introduce Conservative-proposed due diligence legislation.\nI will be strident in pushing the Government to be truly ambitious in tackling global deforestation and in protecting our natural world.”",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_category_Speeches/content_26.html": "Shadow DEFRA Minister Dr Neil Hudson MP urges Government to uphold animal welfare standards in trade deals 1st May 2025 Dr Neil Hudson, Member of Parliament for Epping Forest and Shadow DEFRA Minister, has called for urgent action to protect British farmers and uphold the UK’s... Speeches\nDr Neil Hudson MP takes part in national conference on the link between animal abuse and domestic and child abuse 22nd September 2023 Dr Neil Hudson, was invited to take part as a Veterinary Surgeon, Member of Parliament and Environment, Food and Rural Affairs Select Committee Member at a... Speeches\nDr Neil Hudson MP leads parliamentary debate on keeping children safe from the dangers of vaping 2nd May 2023 Today at 5pm Dr Neil Hudson, MP for Penrith and The Border, led a parliamentary debate of the frightening rise of vaping among under-18s and how we can better... SpeechesSpeeches in ParliamentWestminster News\nVeterinary MP votes in favour of the Windsor Framework, highlighting huge progress made on medicines, animal health and welfare 22nd March 2023 Dr Neil Hudson, MP for Penrith and The Border, strongly supported the Windsor Framework as it received overwhelming backing from MPs. Pointing to the myriad... SpeechesWestminster News\nPenrith MP Dr Neil Hudson secures meeting with Prime Minister and mental health champions the ‘3 Dads Walking’ at PMQs 1st February 2023 Dr Neil Hudson, MP for Penrith and The Border, raised the plight of a local Cumbrian mental health campaigner and his group’s tireless campaigning during Prime... Local NewsSpeechesSpeeches in ParliamentWestminster News\nDr Neil Hudson MP again stands up for British farmers in trade deals 7th September 2022 In a bold and wide-ranging speech, Dr Neil Hudson again stood up for British farmers, urging the Government to renegotiate unfair trade deals with New Zealand... Speeches\nDr Neil Hudson calls for more Parliamentary scrutiny of future Trade Deals in Westminster Hall debate 22nd July 2021 Penrith and The Border MP, Dr Neil Hudson, made the case for more meaningful parliamentary scrutiny of future trade deals in a speech in Westminster Hall... Local NewsSpeechesSpeeches in ParliamentWestminster News",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_shadow-defra-minister-dr-neil-hudson-mp-urges-labour-act-extreme-weather-events-during-urgent/content_31.html": "Dr Neil Hudson MP urged Labour to act in the public interest following the grim fallout of Storm Darragh, during an Urgent Question in Parliament today (10/12/24).\nSpeaking on behalf of His Majesty's Most Loyal Opposition as Shadow DEFRA Minister, Dr Hudson, paid tribute to those who have worked tirelessly to protect people's safety, reconnect power, and get the nation moving again following winds in excess of 90mph which left people stranded without power and even tragically led to the loss of life.\nDr Hudson took to the Despatch Box to urge the new Labour administration, not to relinquish their responsibility to impacted communities and provide long-term funding to protect people from the ravages of increasingly frequent storm events.\nSpeaking afterwards, Dr Neil Hudson MP said:\n“The bravery and selflessness of those on the front line protecting lives and livelihoods cannot be questioned. But, what can be questioned is the new Labour Government's commitment to supporting those fearlessly battling the elements to keep people and property safe.”\n“Given the Chancellor is planning to review flood defence funding in the next financial year amid increasingly frequent extreme weather events and the retrograde Family Farm Tax, we cannot falter in Conservative defence of our communities hit by these weather events.”\n“I hope we will see some joined up action across Government from Ministers.”\nFrom 2019 to 2027, the Conservative Government committed a record £5.2 billion to bolster flood defences across the country - which itself followed £2.6 billion since 2015 - which included £100 million for communities that have experiences repeated flooding and £25 million for innovative nature-friendly projects to stem flooding.\nThere is significant concern that funding will continue at current levels given that in the Autumn Budget, the Chancellor wrote: \"The government is facing significant funding pressures on flood defences and farm schemes of almost £600 million in 2024-25. While the government is meeting those commitments this year, it is necessary to review these plans from 2025-26 to ensure they are affordable.\"\nDr Hudson has spoken time and again in Parliament about how the impact of flooding goes far beyond the loss of possessions or damage to property, and is an issue that impacts communities that are deeply dependent on the environment both economically but also as part of their identity.\nAs such, when sitting on the EFRA Select Committee in the last Parliament, Dr Hudson triggered a report into Rural Mental Health which specifically looked at the impact of shock events such as extreme weather and the lasting toll this takes on mental health.\nA transcript of Dr Neil Hudson MP's response for the Opposition in the Chamber:\n\"Mr Speaker, Storm Darragh has had, and continues to have, terrible impacts across the UK, and our thoughts are very much with the loved ones of those who tragically lost their lives in recent days, as well as the people whose homes and businesses have been devastated and those who continue to feel the effects of the storm.\n\"We must not forget, Mr Speaker, that for at risk communities the mental health consequences can remain long after the storms and floods have abated and the blue lights have left.\n\"We would like to pay tribute on this side of the House to the emergency services, the Environment Agency, local authorities and volunteer groups for their efforts to help people in challenging and dangerous circumstances.\n\"The Government needs to focus in the coming hours and days on ensuring that those without power are reconnected quickly and help will be given to those who have been driven out of their homes. The repair and reopening of buildings and schools, as well as the process for insurance claims so that residents can return home as soon as possible.\n\"What conversations are being had across government to ensure that this all happens? What discussions did the Honourable Lady have with ministerial colleagues across government, the Environment Agency and the Met Office before this latest storm hit?\n\"The Government's Flood Resilience Task Force was set up to improve flood preparedness. The Flood Resilience Task Force has met once and its next meeting is next year. Should it not be stood up more frequently and meet more regularly?\n\"The Last Conservative Government, Mr Speaker, committed a record 5.2 billion pounds from 2019 to 2027 to provide significantly improved flooding defences across the country. Will the new Labour Government continue that investment? The Farm Recovery Fund, initiated by the previous Conservative Government to support farmers is vital, but is there new money there now for these recent storms like Bert and Darragh?\n\"And finally Mr Speaker, can the Government confirm there is an ongoing commitment to the communities hit by these increasingly common extreme weather events?\"",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_shadow-defra-minister-dr-neil-hudson-mp-urges-government-uphold-animal-welfare-standards-trade/content_18.html": "Dr Neil Hudson, Member of Parliament for Epping Forest and Shadow DEFRA Minister, has called for urgent action to protect British farmers and uphold the UK’s world-leading animal welfare standards. Speaking at the Westminster launch of the new report, Closing the Welfare Gap: Why the UK Must Apply Its Animal Protection Standards to Imports, Dr Hudson joined leading animal welfare organisations - Animal Policy International, Compassion in World Farming and the RSPCA – to highlight the risks posed by lower-welfare imports.\nThe report warns that many animal products imported into the UK are produced using methods that are illegal here and stresses the urgent need to address this issue. With the UK Government currently pursuing an ‘economic agreement’ with the US, which is rumoured to include increased access for US-produced chicken, pork and beef to the UK market, the release of this report is especially timely.\nThe UK, celebrated for its dedication to animal welfare, has emerged as a global frontrunner in establishing some rigorous standards for farmed animal welfare.\nDr Hudson, the first veterinary surgeon in the House of Commons since 1884, a long-standing advocate for animal welfare and British agriculture, has consistently pressed for trade deals that protect UK standards. He played a key role on the Environment, Food and Rural Affairs Committee, ensuring post-Brexit trade agreements did not compromise animal welfare.\nFollowing the event, Dr Neil Hudson said:\n“This report is a stark warning of the lower animal welfare standards that exist overseas. Without urgent legislative action, British farmers who uphold higher welfare practices will be undercut by cheaper, sub-standard imports.”\n“We must ensure that every animal product sold in the UK meets the rigorous welfare standards that British consumers expect, and British farmers deliver.\n“We must maintain our clear red lines banning the imports of chlorine-washed poultry, hormone-treated beef and dairy, and ractopamine-fed pork.\n“Protecting our brilliant farmers and our animals is a moral imperative, and I call on the Government to ensure that any trade negotiations meet our animal welfare standards.”\nMandy Carter, Co-Executive Director at Animal Policy International, said:\n“The UK now faces critical choices for how best to pursue a successful trade agenda with its upcoming trade strategy. This really is a pivotal moment, and we must act now to avoid this situation getting much worse.\n\"Allowing imports with lower welfare standards creates a race to the bottom that sells out British values and farmers.\nJames West, Chief Public Affairs Manager at Compassion in World Farming, said:\n“An overwhelming 84% of British people support restricting or banning low-welfare imports that do not meet UK standards.\n“It is imperative that the Government ensures all animal products sold in the UK, whether produced domestically or imported, meet British animal welfare standards.”\nDavid Bowles, Head of Public Affairs at the RSPCA, said:\n“As discussions on any possible future trade deal between the UK and US to avoid tariffs come under the public spotlight, we remain steadfast that the striking of any deal with the US must not make concessions that allow imported animal products produced to very low welfare standards onto our supermarket shelves.\n“As well as introducing low welfare products into the UK, it would prevent a better trade deal with the EU and would undermine our own higher domestic standards - hitting the livelihoods of UK farmers hard; all while flying in the face of what many consumers want.”\nFor more information on Dr Hudson’s work to support animal health and welfare, please see: https://www.neilhudson.org.uk/campaigns/supporting-animal-health-and-welfare",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_epping-forest-mp-visits-community-diagnostic-centre-site-st-margarets-hospital/content_15.html": "Dr Neil Hudson, MP for Epping Forest, visited the construction site of the new Community Diagnostic Centre (CDC) at St Margaret’s Hospital in Epping. The CDC, part of a £2.3 billion national investment in diagnostic services initiated under the previous Conservative Government, will provide faster and more accessible diagnostic tests for local residents.\nDuring his visit, Dr Neil Hudson toured the construction site and met with representatives from the Princess Alexandra Hospital NHS Trust (PAHT) to discuss the progress of the project and the anticipated benefits for the local community. Scheduled to be completed in December 2025, with appointments commencing the following month, the CDC will offer advanced diagnostic services, including CT scans, X-rays, ultrasounds, blood tests, and MRIs. Additionally, it will feature new cardiology and respiratory equipment, aiming to reduce waiting times and improve patient outcomes by addressing diagnostic backlogs while allowing hospitals to prioritise urgent cases.\nUnder the previous Conservative Government, commitments were also made to rebuild both Princess Alexandra Hospital in Harlow and Whipps Cross Hospital in Leytonstone, as part of the New Hospitals Programme. However, both rebuilds have been delayed significantly by the Labour Government, with construction expected to start between 2032 and 2034.\nDr Neil Hudson, MP for Epping Forest, said:\n“It was great to tour the site of the new Community Diagnostic Centre and hear about the new state-of-the-art equipment they will have there. I am delighted that this project initiated and committed to by the previous Conservative Government is on track, and that under concerted pressure from me, the Labour Government agreed to continue this much-needed project.\n\"A huge thanks to everyone working so hard to deliver this amazing centre.\n“I have no doubt that the Centre will hugely benefit residents of Epping Forest and beyond by easing the pressure on our local hospitals. I very much look forward to seeing the CDC once it is completed.\n“However, I remain deeply concerned about the impact the delays to the rebuilds of Princess Alexandra Hospital in Harlow and Whipps Cross Hospital in Leytonstone will have. I will continue advocating for urgent investment in these vital projects for my constituents.”\nThom Lafferty, Chief Executive at PAHT, said:\n“I was delighted to welcome Dr Neil Hudson MP to the Community Diagnostic Centre site at St Margaret’s Hospital.\n“It was an excellent opportunity to demonstrate the fantastic benefits that the CDC will bring for our patients and the asset this will be for our community.\n“Thank you to everyone who is working on this important project to ensure that we can provide modern, integrated and outstanding care into the future.”\nDr Hudson is passionate about improving healthcare across Epping Forest and has been pressing the Labour Government to commit to developing infrastructure locally since his election:\nPictured: Thom Lafferty, Chief Executive (fifth from right); Dr Neil Hudson MP (sixth from right); Martin John, New Hospital Programme director (fifth from left); and the CDC project team.",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_cookies/content_30.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_category_Speeches-in-Parliament/content_17.html": "Shadow Environment Minister pushes Government to continue Conservative achievements on tackling global deforestation 2nd May 2025 This week in the House of Commons, Shadow Environment Minister Dr Neil Hudson MP urged the Government to do more to tackle the threat deforestation creates for... Speeches in Parliament\nShadow DEFRA Minister pushes Government to back UK fishing rights in upcoming EU negotiations 27th March 2025 In Parliament Dr Neil Hudson MP, Shadow DEFRA Minister, urged the Government to ensure it works to defend the hard-working UK fishing industry and ‘retain... Speeches in Parliament\nShadow DEFRA Minister Dr Neil Hudson MP stands up for rural mental health 21st March 2025 This week in the Chamber of the House of Commons, from the Despatch Box, Shadow Environment, Food and Rural Affairs Minister Dr Neil Hudson MP has reinforced... Speeches in Parliament\nEpping Forest MP stands up for local healthcare against Labour’s Jobs Tax 20th March 2025 Dr Neil Hudson, Member of Parliament for Epping Forest, has reiterated his commitment to supporting local healthcare providers during a recent debate in the... Speeches in Parliament\nDr Neil Hudson MP re-affirms unwavering support for Ukraine and invokes Churchill to the Prime Minister ahead of US Meeting 27th February 2025 Dr Neil Hudson, MP for Epping Forest, reaffirmed his strong support for Ukraine and its democratically elected President Volodymyr Zelenskyy during Prime... Speeches in Parliament\nShadow Water Minister Dr Neil Hudson urges Government not to ‘stand in the way’ of strengthening vital water industry regulation 12th February 2025 During Consideration of Lords Message to the Water (Special Measures) Bill this week, Shadow Water Minister Dr Neil Hudson MP urged the Government to accept the... Speeches in Parliament\nEpping Forest MP criticises Labour’s decision to cede Chagos Islands sovereignty 6th February 2025 Following conflicting reports about the financial cost of transferring sovereignty over the Chagos Islands to Mauritius, an Urgent Question was triggered in the... Speeches in Parliament\nDr Neil Hudson Highlights Youth Suicide Prevention at Prime Minister’s Questions 5th February 2025 Today in the House of Commons, Epping Forest MP Dr Neil Hudson urged Prime Minister Sir Keir Starmer to guarantee the inclusion of suicide prevention into the... Speeches in Parliament\nDr Neil Hudson MP triggers Urgent Question in the Commons about the UK Government’s Response to Foot and Mouth Disease in Germany 15th January 2025 With a case of highly contagious Foot and Mouth Disease confirmed in Germany, Shadow DEFRA Minister and veterinary surgeon Dr Neil Hudson, triggered an Urgent... Speeches in Parliament",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_campaigns_supporting-economy/content_6.html": "We have amazing and diverse businesses right across Epping Forest that we all use, enjoy and depend upon. Small businesses are vital to our local economy, providing jobs, services and opportunities to folk. In our towns and villages, they provide character and colour to our streets. I will work with local businesses and entrepreneurs and champion their cause with ministers in Government so that they have a favourable economic environment, free from red tape to allow them to grow.",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_dr-neil-hudson-mp-secures-government-commitment-new-community-diagnostic-centre-st-margarets/content_24.html": "MP for Epping Forest, Dr Neil Hudson, has successfully campaigned and secured Government commitment for the establishment of the new Community Diagnostic Centre (CDC) at St Margaret's Hospital in Epping.\nKnown as the West Essex CDC, the site will embrace new technologies and deliver vital tests, checks and scans in order to identify and treat diseases such as cancer and heart disease earlier. CDCs make medical tests quick and easy - proving pivotal in ensuring speedy diagnoses and saving lives.\nIt will be fully operational from November 2025 and may include capacity for MRI and CT scanning equipment, X-ray, audiology and endoscopy, as well as respiratory tests and phlebotomy services.\nThe previous Conservative Government rolled out the Community Diagnostic Centre Programme, which massively bolstered the nation's CDCs with 160 sites earmarked for delivering activity. This included Epping's CDC which had capital investment committed to building new premises.\nThis commitment was backed by part of a £2.3 billion investment - the largest cash investment in MRI and CT scanning capacity in the history of the NHS. However, the Labour Government put all this progress at risk with their cross-governmental Spending Review which looks set to halt major Government investments in everything from new hospitals and roads to day-to-day Departmental spending.\nSince then, Dr Hudson, has championed St Margaret's and put pressure on the new Labour administration, from the Prime Minister down, to back Conservative spending and improve patient outcomes in Epping Forest.\nAs such Dr Hudson has spoken in Parliament, tabled Parliamentary Questions, and written to Ministers consistently throughout his campaign.\nThe previous Conservative Government had also committed to rebuilds of both Whipps Cross Hospital in Leytonstone and Princess Alexandra Hospital in Harlow, and a new Community Diagnostic Centre at St Margaret’s, as part of its Hospital Rebuilding and Community Diagnostics Programmes.\nHowever, in the same letter from the Department of Health and Social Care, Ministers also confirmed to Dr Hudson that Whipps Cross and Princess Alexandra - which are both relied upon by Dr Hudson's constituents - are in scope of Labour's Spending Review which threatens funding that would have been dedicated to rebuilding their premises.\nDr Hudson has committed to holding Labour to account and delivering for local people.\nDr Neil Hudson, MP for Epping Forest, said:\n\"Early diagnosis and treatment are critical to improved patient outcomes, cutting waiting lists and reducing the pressures on our precious NHS. For an area such as ours this is exactly what we need and exactly what a new Community Diagnostic Centre in Epping will provide.\n\"We Conservatives made the largest central cash investment in MRI and CT capacity in the history of the NHS through the Community Diagnostic Centre Programme and I have fought tooth and nail to make sure Labour did not undo our progress with their ill-judged Spending Review.\n\"I'm delighted my campaigning for the Community Diagnostic Centre at St Margaret’s paid off and I will now keep pressing the Government until the site is fully operational next year.\n\"But there is still more to do - the hospital rebuilds at Whipps Cross and Princess Alexandra Hospitals have sadly fallen foul of Labour's Spending Review and could be put on ice for the foreseeable future. For the better healthcare outcomes for people in and around Epping Forest, it is so vital that these hospitals are renewed. I will keep going on this.\"\nResponding directly to Dr Neil Hudson MP following his campaigning, Karin Smyth MP, Minister of State for Health, has now confirmed in writing to the Epping Forest MP:\n\"I can confirm that the new community diagnostic centre at St Margaret’s Hospital in Epping, which is not part of the New Hospital Programme, is live and currently expected to become fully operational from November next year. The scheme funding is in place and amounts to over £19million, with over £11million available for this financial year.\"",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_epping-forest-mp-criticises-labours-decision-cede-chagos-islands-sovereignty/content_33.html": "Following conflicting reports about the financial cost of transferring sovereignty over the Chagos Islands to Mauritius, an Urgent Question was triggered in the House of Commons to address concerns about the ongoing negotiations.\nThe agreement, which would end over 200 years of British sovereignty, involves transferring the British Indian Ocean Territory to Mauritius. This includes Diego Garcia, home to a strategically vital UK-US military base in the Indo-Pacific.\nSpeaking in the House of Commons on the Urgent Question, Dr Neil Hudson criticised the Labour Government for agreeing to pay Mauritius billions of pounds while imposing higher taxes on working families and cutting winter fuel allowances for pensioners.\nDr Hudson also expressed his grave concerns about the implications this decision may have for both national and global security, as relinquishing British sovereignty could create a power vacuum, potentially exploited by hostile actors.\nIn the Chamber, Epping Forest MP Dr Hudson asked:\n“This Labour Government is making choices. Choices claiming that they have no money.\n“From taxing jobs, family businesses and family farms, cutting winter fuel payments for pensioners, to delaying much needed new hospitals like Whipps Cross and Princess Alexandra.\n“What does the Minister say to my constituents in Epping Forest who are asking, how can this Government now find billions of pounds to pay to give away British sovereign territory, and in so doing, compromising national and global security?”\nSpeaking afterwards, Dr Hudson said:\n“This ill-advised decision not only undermines our global and national security, but also comes at a time when the Labour Government have continuously claimed that they have no money.\n“My constituents in Epping Forest are rightly outraged by cuts to winter fuel payments for pensioners, increasing taxes on hard-working families and delays to NHS hospital rebuilds. Yet this Government is willing to spend billions of pounds on surrendering vital British sovereign territory.\n“I urge the Government to re-consider this regrettable decision and redirect the money towards addressing issues that matter most to the British people.”\nDr Hudson continues to highlight his concerns regarding the transfer of British Indian Ocean Territory sovereignty to Mauritius. To read more, please see:",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_parliament/content_3.html": "Today in the House of Commons, Epping Forest MP Dr Neil Hudson urged Prime Minister Sir Keir Starmer to guarantee the inclusion of suicide prevention into the National Curriculum, during Prime Minister’s Questions, and secured a further meeting between the Prime Minister and the 3 Dads Walking.The 3\nEpping Forest MP Dr Neil Hudson urged the Government to maintain the Listed Places of Worship Grant Scheme, championing the crucial support places of worship provide for his constituents, during a Parliamentary Debate this week.In that debate, Dr Hudson emphasised how valuable places of worship are\nIn Parliament during a debate on the Green belt, Dr Neil Hudson MP raised his concerns that the Labour Government’s approach to housing could put Epping Forest’s Green Belt at risk against communities’ wishes, in the House of Commons.In the debate, Dr Hudson outlined his concerns that Labour’s\nWith a case of highly contagious Foot and Mouth Disease confirmed in Germany, Shadow DEFRA Minister and veterinary surgeon Dr Neil Hudson, triggered an Urgent Question in the Commons to seek urgent information from the UK Government about their response, and demanding that they fully fund our\nShadow DEFRA Minister and Epping Forest MP, Dr Neil Hudson, has urged Labour not to revoke flood prevention, preparedness and compensation schemes enacted under the Conservatives following recent extreme weather that saw thousands across the nation stranded, without power or with damage to property\nDr Neil Hudson MP urged Labour to act in the public interest following the grim fallout of Storm Darragh, during an Urgent Question in Parliament today (10/12/24).\nDr Neil Hudson MP will be on the Conservative frontbenches today in his role as Shadow DEFRA Minister in an effort to overturn Labour's vindictive Family Farm Tax.The Epping Forest MP and veterinary surgeon is a proud advocate for Britain's vibrant farming communities, which are set to be hit by Lab\nAs Shadow DEFRA Minister, Dr Neil Hudson MP gave the full support of His Majesty's Most Loyal Opposition to a Bill which aims to stamp out the immoral puppy smuggling trade that has continued to spiral since the COVID-19 pandemic.Dr Neil Hudson, the MP for Epping Forest, was the first vet elec\nDr Neil Hudson MP stood at the Despatch Box in his new role as Shadow DEFRA Minister to warn Labour against their \"ill judged and heartless\" family farm tax that threatens British food security as well as lives and livelihoods in rural communities across the nation.In the Autumn Budget, Labour annou\nVeterinary surgeon Dr Neil Hudson MP has been promoted to be a Shadow DEFRA Minister (Department of Environment, Food and Rural Affairs) , and this week gave his first frontbench speech to welcome in a Statutory Instrument that will prohibit the supply of disposable single-use vape",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_map-locations/content_12.html": "Skip to main content\nDr Neil Hudson\nMember of Parliament for Epping Forest\nMain navigation\nAbout Neil\nNews\nMy Campaigns\nIn Parliament\nContact\nDr Neil Hudson\nMember of Parliament for Epping Forest\nMy map",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_contact/content_14.html": "Skip to main content\nDr Neil Hudson\nMember of Parliament for Epping Forest\nMain navigation\nAbout Neil\nNews\nMy Campaigns\nIn Parliament\nContact\nDr Neil Hudson\nMember of Parliament for Epping Forest\nContact\nLeave this field blank\nHouse of Commons, London, SW1A 0AA\n020 8508 6608\n[email protected]\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_epping-forest-mp-continues-fight-listed-places-worship-grant-scheme/content_38.html": "Epping Forest MP Dr Neil Hudson urged the Government to maintain the Listed Places of Worship Grant Scheme, championing the crucial support places of worship provide for his constituents, during a Parliamentary Debate this week.\nIn that debate, Dr Hudson emphasised how valuable places of worship are for the wellbeing of communities, and the social good they provide including community outreach and youth work.\nThe Listed Places of Worship Grant Scheme currently provides financial support for Listed Places of Worship with costs incurred through repairs, covering VAT on those repairs costing over £1,000.\nThe Grant Scheme began in 2001 and was extended in 2023 under the previous Conservative Government, providing five grants in Epping Forest since that extension. However, since their election, the Labour Government had provided no indication of any plans to extend the funding and omitted it from the Chancellor’s Autumn Budget last year.\nThis background led to concern among places of worship, in Epping Forest and across the country, that the Scheme could be abandoned, and vital repair projects be unaffordable if the financial support was axed.\nIn response to constituency concern, Dr Hudson has worked hard to raise the vital importance of the Listed Places of Worship Grant Scheme with Ministers since the General Election, writing to the Department for Culture, Media and Sport outlining how crucial it is the Scheme is extended,, and submitting Written Parliamentary Questions asking if the Scheme would be extended, and to outline what support it is providing for Listed Places of Worship nationwide.\nFollowing months of little information on the Scheme, on the day of the Debate triggered by the Conservatives, the Government confirmed that it would be continuing the Scheme for just a further year. However, they have slashed the amount the total amount they will spend, from £42 million spent in 2023 on claims, to £23 million for the next year, and have also set a stringent limit of £25,000 that any Listed Place of Worship can claim within a year under the scheme.\nIn that debate, Dr Hudson said:\n“The Listed Places of Worship Grant Scheme is vital for our communities. The previous Conservative Government extended it in 2023, and since 2022 five grants have been awarded in my constituency. I have been contacted by a number of places of worship that are deeply concerned about the future of the scheme. Does my hon. Friend agree that, for the sake of worship, outreach, youth work, helping vulnerable people, and community hubs, it is right for the Government to extend the scheme?”\nBradley Thomas, Conservative MP for Bromsgrove and leader of the Debate responded:\n“I wholeheartedly agree that the scheme should be extended, given all the economic and social benefits my hon. Friend touched on and the many others that Members will cite. It is a no-brainer that the Government should pursue this.”\nFollowing the Debate, Dr Hudson commented:\n“Places of worship are vital pillars at the heart of our communities in Epping Forest, providing crucial support to so many people, young and old. It is only right that institutions which support us must be supported by the Government in turn.”\n“While Labour have confirmed a short and reduced continuation of the Scheme, this is only a small crumb of comfort for Listed Places of Worship who rely on this scheme.\nOur places of worship need longer-term access to proper financial support, and I will continue to fight for this for the people in Epping Forest who enjoy and depend upon these crucial community assets.”",
  "https_www_neilhudson_org_uk_/https_www_neilhudson_org_uk_news_category_Opinions/content_4.html": "In the media: Dr Neil Hudson MP discusses national veterinary workforce shortage on Times Radio 9th May 2024 Dr Neil Hudson MP - the only vet in the House of Commons - appeared on Matt Chorley's Times Radio show to discuss shortages in the veterinary workforce. This... Opinions"
}