{
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_campaigns_making-policing-accessible/content_26.html": "I want to ensure that policing is accessible and that residents are confident that Surrey Police will always be there when you need them.\nToo often when people need to speak to someone about a crime or anti-social behaviour they feel as though they are passed from one agency or call handler to another, without any resolution.\nResidents of Surrey need to be at the heart of everything we do in Surrey Police and we've made huge strides already, but there is more that we can do, both through technology and better training to officers and staff.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_commissioner-attends-safe-drive-stay-alive/content_8.html": "Lisa Townsend, Surrey Police and Crime Commissioner, joined local leaders and school pupils at the VIP Safe Drive Stay Alive Event in Dorking on Thursday 3rd November.\nSafe Drive Stay Alive is an initiative which aims to reduce the number of young people killed and seriously injured on our roads.\nLisa said,\n\"I am delighted to see the benefit of this scheme for our young people and our wider communities.\nMy office has seen how the programme has a real (and statistically-significant) impact on the young people who watch the performance and are challenged to consider how they take responsibility for protecting themselves and others on the road. My office will continue to support the scheme with £105,000 over the next 3 years - leading to fewer young people killed or seriously injured on our roads.\nEnsuring safer Surrey roads is a key priority of my Police and Crime Plan, and a vital part of this is supporting young people to not only be safe but also to make positive choices - a focus of our work with our partners.Listening to the lived experiences of our heroic emergency services in Surrey was incredibly thought provoking and I believe we can all reflect on the powerful lessons, no matter our age or stage of driving career.\"\nMore information about the scheme can be found on the Safe Drive, Stay Alive website - https://safedrivesurrey.org.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk/content_1.html": "My Priorities\nLatest News\nContact Details\nOffice of the Police and Crime Commissioner:\nPO Box 412, Guildford, Surrey, GU3 1YJ\n01483 630 200\nFor political enquiries and messages relating to media appearances or Lisa's work around women's safety ONLY:\nI'm Lisa, your Conservative Police and Crime Commissioner for Surrey since 2021. Here you can find out about my priorities for our county, as well as what I have delivered for you and our county so far. I am always happy to help, and welcome any resident with questions or in need of help to get in touch.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_commissioner-welcomes-new-chief-constable/content_32.html": "Photo: Police and Crime Commissioner, Lisa Townsend, with Tim De Meyer, Surrey's new Chief Constable\nSurrey Police has today welcomed new Chief Constable, Tim De Meyer, who took his Oath of Office this morning at the force’s Mount Browne headquarters on his first day in post.\nFollowing a rigorous selection process, Mr De Meyer was announced as Police and Crime Commissioner Lisa Townsend’s preferred candidate in January, before his appointment was confirmed later that month.\nSurrey’s new Chief was welcomed by the Commissioner and others this morning as he started his first day in the job, during which he has also been out meeting teams of officers and staff.\nSpeaking this afternoon, Lisa said “I was delighted to welcome Tim to Surrey this morning on his first day as our new Chief Constable, and I look forward to working with him for the benefit of all Surrey residents.\n“Tim will be a brilliant leader for our force, and I know from speaking with officers across the county over the past few months that they are excited to meet him.\n“He will bring a fresh perspective to Surrey and a wealth of experience from his time at both Thames Valley Police and the Metropolitan Police.\n“As I have said many times, appointing a new Chief Constable is one of the most important responsibilities that falls to Police and Crime Commissioners, and was not a decision I took lightly.\n“I chose Tim as Surrey Police’s new leader because throughout the selection process he demonstrated passion, professionalism and energy and I am confident he has the drive needed to lead the force into an exciting future.”",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_hike-hill-amber-foundation/content_22.html": "Photo: Lisa Townsend, Police and Crime Commissioner for Surrey, at Amber's Farm Place site in Ockley.\nOn Sunday 11th June, the Amber Foundation are hosting Hike the Hill to raise funds for their work transforming young people’s lives. Walking a 10km route through the Surrey Hills, participants will climb to the top of Leith Hill, the highest point in Surrey at 294m above sea level.\nThe event will help raise funds for Amber’s work and will support bed spaces at their Farm Place site in Ockley. This location enables young people to transform their life with Amber’s support and takes them away from living on the street.\nAmber provides temporary accommodation for young people who have experienced trauma or abuse and have ended up in hostels or sleeping on sofas. Having a safe home with Amber enables young people to build their self-confidence and mental health with the support of the team at Farm Place, as well as find training and work opportunities.\n72% of young people who are supported by Amber move on into independent and safe housing and either return to education or secure a job. The support they receive whilst at Amber helps them overcome personal barriers and equips them with the skills, tools, and resilience they need to lead successful and independent lives as valued members of the community.\nA number of beds at Farm Place are supported by the Police and Crime Commissioner for Surrey, Lisa Townsend. Lisa, along with members of her team, are also supporting the event on Sunday to help raise more funds for Amber’s work.\nSpeaking ahead of the event, Lisa said “Amber’s Farm Place site was the first place I visited following my election in 2021 and I am so pleased to have supported their work from day one.\n“I am excited to support them in another way this weekend and look forward to joining members of my team – who are also incredibly passionate about Amber’s brilliant work - in the Surrey Hills.\n“The 10km route, which we hope will be in the sunshine, promises beautiful views of our county, all whilst helping to raise funds for a brilliant cause.\n“If anyone is able to make a donation, however big or small, every penny will be truly appreciated by both my team and by Amber and will go towards changing young people’s lives.”\nTo find out more about Hike the Hill, or to sponsor Lisa and her team, click here.\nTo find out more about Amber’s work, click here.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_accessibility/content_3.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_about-rss/content_17.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_commissioner-condemns-reckless-actions-protestors-m25/content_27.html": "Lisa Townsend, Surrey Police and Crime Commissioner released a statement regarding the disruptive actions of protestors on the M25 in Surrey.\nThe statement:\n\"I wholeheartedly condemn the reckless and dangerous actions of protestors who continue to cause disruption on the M25 in Surrey.\nI am a strong believer in peaceful and lawful protest. However, no matter what the cause, climbing overhead gantries on the busiest motorway in the county during the morning rush hour is dangerous in the extreme and totally unacceptable. These protestors not only put themselves in jeopardy but also risked the safety of those who were using the motorway to go about their own business and the officers called out to deal with them.\nI am proud of Surrey Police who’s swift response meant they were quickly on scene to detain those involved. Yesterday I was out with the force as they removed protestors from gantries across the M25 across Surrey. It is frustrating to see how yet again our precious police resources have had to be diverted to deal with these protesters and keep everyone safe.\nWhat we need to see now is those responsible put before the courts and given punishments that reflect the seriousness of their actions.\"\nPictures are taken by Lisa whilst out on duty with the teams responding to the protestors.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_category_Articles/content_28.html": "Getting Support for Domestic Abuse 8th March 2023 As your Police and Crime Commissioner, I want every woman and girl in Surrey to be safe and feel safe. Living with Domestic Abuse can feel isolating and lonely... Articles\nListening to Residents in Farnham and Haslemere 5th March 2023 Lisa Townsend, Police and Crime Commissioner for Surrey, recently hosted a community meeting in Farnham, joined by Sergeant Michael Knight from the local... Articles\nStatement Regarding The Serious Racially Aggravated Assault In Ashford 10th February 2023 This morning the Police and Crime Commissioner for Surrey, Lisa Townsend, released the following statement regarding the serious racially aggravated assault... ArticlesLocal News\n222 more Police Officers in Surrey! 26th January 2023 Lisa Townsend, Police and Crime Commissioner for Surrey, has welcomed the milestone of the recruitment of 222 additional officers in Surrey. Speaking on the... ArticlesLocal News\nTackling Anti-Social Behaviour with Michael Gove 25th January 2023 Lisa Townsend, Surrey Police and Crime Commissioner, joined Michael Gove MP, Secretary of State for Levelling Up, Housing and Communities and the Neighbourhood... ArticlesLocal NewsWestminster News\nMore Support for Mental Health Patients 25th January 2023 Lisa Townsend, National Mental Health Lead for Police and Crime Commissioners, has welcomed the additional support from government for mental health services... Articles\nMore Powers to Tackle Disruptive Protests 17th January 2023 Just before Christmas Lisa Townsend, Surrey Police and Crime Commissioner, joined other senior policing leaders at a meeting with the Prime Minster at 10... ArticlesWestminster News\nEllie Vesey-Thompson, Deputy PCC, talks to GB News about Police Recruitment 9th November 2022 Deputy Police and Crime Commissioner for Surrey, Ellie Vesey-Thompson, spoke to Patrick Christys on GB News last week about police recruitment in light of... Articles",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_what-police-and-crime-commissioner/content_40.html": "My Role\nAs Police and Crime Commissioner, I am elected by the residents of Surrey to hold the Chief Constable and Surrey Police Force to account.\nI represent the views of those who live and work in surrey on how our country is policed. As such, it is vitally important to me that the public's priorities are my priorities. You can find out more about my priorities in campaigns and in my Police and Crime Plan.\nAs Police and Crime Commissioner, I:\n- Set the strategic direction for policing in Surrey through the publication of the Police and Crime Plan\n- Set the budget and precept for policing in Surrey\n- Hold the Chief Constable to account for delivery of the Police and Crime Plan and for efficient and effective policing\n- Appoint, and if necessary, dismiss the Chief Constable\n- Commission services to:\n- help victims cope and recover\n- to divert people away from crime\n- to prevent crime and improving community safety in Surrey\n- Work with partners to reduce crime and improve community safety in Surrey\nHistory\nThe Police Reform and Social Responsibility Act (2011) established the role of the Police & Crime Commissioner to be a visible and accountable bridge between the Police and the public. The Chief Constable retains responsibility for delivering operational policing, whilst the Commissioner holds him to account for doing so. The Commissioner is held to account by the public and the Police and Crime Panel scrutinises the decisions of the Commissioner.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_postalvote/content_11.html": "On Thursday 2nd May, there is a county-wide election for Police and Crime Commissioner and a number of local elections happening too.\nApplications for postal voting must be submitted by 5pm on Wednesday 17th April. Most councils will accept scanned and emailed forms so there is still time to submit your application. Please visit your local council's page via the following links for more information:\n- Elmbridge Borough Council\n- Epsom and Ewell Borough Council\n- Guildford Borough Council\n- Mole Valley District Council\n- Reigate and Banstead Borough Council\n- Runnymede Borough Council\n- Spelthorne Borough Council\n- Surrey Heath Borough Council\n- Tandridge District Council\n- Waverley Borough Council\n- Woking Borough Council\nHow it works\nYour council will send postal voting forms to all registered postal voters in the two weeks before polling day.\nIf you have not received your postal vote five days before an election, you will need to contact your council's Elections team.\nYour postal voting pack will contain your ballot paper(s) and a 'Postal Voter’s Statement'.\nComplete the form as instructed and return it, in the envelope provided, before 10pm on polling day. Postal votes received after this time cannot be accepted.\nIf you don’t return it by post, you can hand in your completed and sealed postal vote pack at our elections office or at a polling station in your area.\nVoting in an election\nIf you have not received your postal voting pack five days before an election, you will need to contact your local council. They will be able to confirm if you have been set up for a postal vote and whether they can send you a replacement.\nIf you are set up to vote by post, you are unable to be issued a ballot paper at the polling station. Postal votes can only be re-issued up to 5pm on the day of an election.\nYou must let your council know in advance if you have not received your postal vote.\nCancelling a postal vote\nIf you are already set up with a postal vote and you would like to change this to vote at the polling station or vote by proxy instead, then you must cancel your postal vote by the postal vote deadline.\nYou can only cancel a postal vote by letting your council know in writing.\nOverseas voters\nIf you are living overseas and the postal service is unreliable or post takes a long time to reach you, then you can apply for a proxy vote instead.\nHow to complete a postal vote\nIf, when you have received your postal voting pack, you are unsure what to do, check out this video which gives simple step-by-step instructions.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_newsletter/content_29.html": "Sign up to my Mailing List to receive my Monthly Newsletter via the following link: http://eepurl.com/ib4o4f or via my website home page!\nThis is where you can catch up with what I've been doing both in Surrey and nationally in my role as Police and Crime Commissioner. I hope you find these newsletters informative and interesting. If there's something in particular you'd like to know more about or an event you think we should be aware of then please do get in touch!",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_commissioner-names-preferred-candidate-surrey-chief-constable/content_10.html": "Surrey Police and Crime Commissioner Lisa Townsend has named her preferred candidate to be the next Chief Constable of Surrey.\nOn the appointment, Lisa said,\n\"I am delighted to announce that following a thorough selection process which concluded yesterday, I have confirmed Tim De Meyer as my preferred candidate for the role of Surrey Police’s new Chief Constable. Tim is currently the Assistant Chief Constable for Local Policing with Thames Valley Police and his appointment will now be subject to a confirmation hearing by Surrey’s Police and Crime Panel.\nTim began his police career with the Metropolitan Police Service in 1997 and joined Thames Valley Police in 2008 where he has served at a number of senior ranks before being promoted to Assistant Chief Constable in 2017. If his appointment is confirmed, Tim will replace the outgoing Chief Constable Gavin Stephens who is set to depart the Force in April this year after successfully being elected as the next head of the National Police Chiefs Council (NPCC).\nHaving seen the passion, experience and professionalism Tim demonstrated in the selection process, I have every confidence he will be an outstanding leader who I believe will guide Surrey Police into an exciting future ahead.\"\nThe Police and Crime Panel will meet to review my proposed appointment on Tuesday 17 January at County Hall in Woodhatch.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_hearing-residents-shepperton/content_16.html": "Surrey Commissioner Lisa Townsend and Deputy Commissioner Ellie Vesey-Thompson joined residents at Shepperton Village Hall on the evening of the 21st November.\nAlongside Borough Commander Maxine Cilla, Lisa and Ellie took questions from residents relating to policing and crime in the area. Residents raised issues including burglary, 101 and anti-social behaviour.\nFollowing the meeting, Lisa said,\n\"It was great to join the residents meeting and have a constructive conversation about how we can continue to support residents on the issues raised.\nRecruitment of call handlers for our 999 and 101 services continues to be a priority for myself and the Chief Constable. I encourage residents to call 999 if they are in any doubt at all and to message using the Live Chat function on Facebook, as well as keeping up with all the work done by the local force via Spelthorne Beat (Surrey Police).\nYou can get a copy of my Police and Crime Plan through the Office of Police and Crime Commissioner for Surrey website and please don't hesitate to contact my office if you'd like to book into a surgery https://www.surrey-pcc.gov.uk/contact-us/ .\nMy surgeries are the first Friday of every month over Zoom, and you can book into them by emailing my office at [email protected].\nAll political-related queries or queries relating to my work preventing Violence Against Women and Girls should be directed to [email protected].\"",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news/content_12.html": "Lib Dems Put Politics Ahead of Community Safety Monday, 3 February, 2025 Surrey’s Police and Crime Panel met today (3rd February) to discuss the 4.3% increase to the policing element of council tax proposed by the Commissioner in consultation with the Chief Constable. Eight of the panel’s twelve councillors plus one independent member were present for the meeting with four voting in favour of the proposal, one abstaining and the four Liberal Democrat members present... Local News\nPolice and Crime Commissioner Approves Divisional Move to Leatherhead 14th August 2024 Police and Crime Commissioner for Surrey, Lisa Townsend, has approved an operational recommendation from Surrey Police to relocate the Eastern Divisional... Local News\nWorking for You to Keep Surrey Safe 19th April 2024 Police and Crime Commissioner for Surrey, Lisa Townsend, is working hard to keep our county safe and listen to residents across Surrey. Since Lisa was elected... Local News\nDiscussing Community Safety in Guildford, with Angela Richardson MP 9th April 2024 Surrey Police and Crime Commissioner, Lisa Townsend, and Member of Parliament for Guildford, Angela Richardson, have been working together to help keep... Local News\nPolice Commissioner welcomes Government crackdown on fraudsters that has helped cut fraud by 14 per cent in Surrey 15th February 2024 Police and Crime Commissioner for Surrey, Lisa Townsend, has welcomed the Conservative Government’s new long-term ‘Stop! Think Fraud’ campaign, delivering tough... Local News\nCommissioner Thanks Residents for Backing Local Policing 3rd February 2024 Following confirmation of her proposed council tax increase yesterday (Friday 2nd February 2024), Police and Crime Commissioner for Surrey, Lisa Townsend, has... Local News\nHike the Hill for the Amber Foundation 8th June 2023 On Sunday 11th June, the Amber Foundation are hosting Hike the Hill to raise funds for their work transforming young people’s lives. Walking a 10km route... Local News\nCelebrating 2 Years as Surrey's Commissioner 24th May 2023 Lisa Townsend thanks Surrey communities for putting their faith in her as she marks two years as the county’s Police and Crime Commissioner. Lisa stood for... Local News\nMore Police in Surrey than Ever Before as National 20,000 Uplift Target Achieved 26th April 2023 Police and Crime Commissioner for Surrey, Lisa Townsend, has this morning welcomed confirmation that Surrey Police has exceeded its officer uplift target... Local News\nCommissioner Welcomes New Chief Constable 3rd April 2023 Surrey Police has today welcomed new Chief Constable, Tim De Meyer, who took his Oath of Office this morning at the force’s Mount Browne headquarters on his... Local News",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_celebrating-2-years-surreys-commissioner/content_20.html": "Video: Lisa Townsend on her first two years as Police and Crime Commissioner for Surrey\nLisa Townsend thanks Surrey communities for putting their faith in her as she marks two years as the county’s Police and Crime Commissioner.\nLisa stood for election on 6th May 2021, legally becoming Police and Crime Commissioner for Surrey a week later, at midnight on Thursday 13th May. Soon after this she began developing her Police and Crime Plan for Surrey, which included conducting the widest ever public consultation the county has ever had for a Police and Crime Plan.\nAfter two years in post, Lisa explained how much she has enjoyed getting out across Surrey to meet residents and communities and understand people’s concerns about policing and community safety.\nLisa praised her team at the Office of the Police and Crime Commissioner for their work since she took office, having brought in an additional £9 million worth of funding for projects and causes across the county. Much of this includes support for victims of crime, including domestic abuse, as well as projects which aim to reduce and prevent crime in the first place.\nSpeaking about her two years, Lisa said “I have absolutely loved the last two years as Surrey’s Police and Crime Commissioner. It is a privilege to meet residents and communities across our county and work to make our brilliant county even better.\n“I am incredibly proud of my team for the huge amount of work they have put in to securing so much additional funding to help support vulnerable people and projects across Surrey. £9 million is an incredible amount of additional funding for our communities, and it is being used to fund a wide range of excellent projects looking at issues such as violence against women and girls, a topic close to my heart.\n“I look forward to the coming year as Police and Crime Commissioner, meeting more residents and continuing our work to ensure Surrey is safe and feels safe.\n“I am always keen to hear from residents and anyone who needs to contact me or my team for any reason will find a variety of ways to do so on my website.”",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_more-surrey-officers-than-ever-before/content_24.html": "Police and Crime Commissioner for Surrey, Lisa Townsend, has this morning welcomed confirmation that Surrey Police has exceeded its officer uplift target, according to official data released by the Home Office.\nAs part of the national 20,000 uplift target, Surrey Police was granted 259 additional officers, but data released this morning shows the force have recruited 395 officers since March 2019, 136 above target.\nThis brings the number of officers in Surrey Police to 2,325, the highest it’s ever been, meaning there are more officers keeping people safe across the county than ever before.\nIn March 2010, Surrey Police had 1,835 police officers, and in 2019, before Operation Uplift began, Surrey had 1,930 officers.\nA number of the extra 136 officers have been funded through the Commissioner’s Council Tax Precept, which she sets annually in consultation with residents.\nNew officers have joined the force in 44 different intakes since April 2019 over the past few years and will be based across the county. 46.4% of Surrey’s new officers are female, and 10% come from a black or ethnic minority background.\nSpeaking shortly after the Home Office data was released, Lisa said “I am so pleased that we can now confirm an additional 395 officers in Surrey, an increase of 490 since 2010.\n“Hitting this target was no mean feat, and to have exceeded it is brilliant news for Surrey residents. A much larger number of new officers had to be recruited since 2019 in order to grow the force as part of Operation Uplift whilst also back filling positions where officers have retired or left the force.\n“I know from speaking with residents across Surrey over the past two years that this will be welcome news across our county. Many of these additional officers will be joining local teams, and others will help strengthen some of our county wide teams, many of whom deal with the most challenging and serious crimes, including fraud and online harms.\n“I have been delighted to meet new intakes of officers since I became Commissioner, and to have seen many of them out with local teams following completion of their training.\n“My thanks go to all the teams within Surrey Police who have been involved in recruiting and growing our force, and to all officers and staff across the force, new and experienced, for their relentless effort and determination to keep our county safe.”",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_cookies/content_15.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_222-more-police-officers-surrey/content_39.html": "Lisa Townsend, Police and Crime Commissioner for Surrey, has welcomed the milestone of the recruitment of 222 additional officers in Surrey.\nSpeaking on the news, Lisa said \"I’m pleased that there are now 222 more officers in Surrey than there were in 2019, and that more are still to come.\n\"Surrey police have been working hard to recruit officers which has involved recruiting many more than the 222 new officers, in order to grow the overall establishment as well as replace those leaving.\"\nYou can see the full government data on the police uplift progress here.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_police-and-crime-commissioner-approves-divisional-move-leatherhead/content_13.html": "Police and Crime Commissioner for Surrey, Lisa Townsend, has approved an operational recommendation from Surrey Police to relocate the Eastern Divisional Headquarters to Cleeve Road, Leatherhead.\nThis move will provide a permanent new Eastern Headquarters for officers and staff temporarily located at Wray Park. The temporary move to Wray Park – based on a short term 2-year lease - happened in April this year and was necessitated by the discovery of Reinforced Autoclaved Aerated Concrete (RAAC) in the construction of Reigate Police Station in September 2023.\nHaving previously been on the market following the Commissioner’s decision to keep Surrey Police’s main Headquarters at Mount Browne in Guildford, the Cleeve Road site in Leatherhead was reassessed as a potential Divisional alternative. This showed the site best met the operational policing needs required of a Divisional Headquarters.\nStrongly supporting Surrey Police’s commitment to retain a physical policing presence in every District and Borough across the county, the Commissioner has also requested and approved plans for new sites in Epsom & Ewell, Tandridge, and Reigate & Banstead to be identified. These sites will house Safer Neighbourhood Teams and help retain consistency of service and coverage across Surrey.\nSpeaking following the announcement, Lisa said “This is exciting news and if we get planning approval gives us a unique opportunity to build a bespoke divisional HQ that is fit for purpose for our hard-working police teams on the east of the county.\n“The situation with RAAC at Reigate Police Station has presented us with some difficult and unexpected challenges and I would like to pay tribute to all those officers, staff and volunteers for their patience and understanding over the last year.\n“I am well aware of the importance Surrey residents place on local policing, and I want to make absolutely clear and reassure people living in Reigate and Banstead that this will not impact on local policing presence in the Borough. The Divisional Headquarters differs from a police station and houses a much wider range of policing teams whose work covers the whole Eastern area.\n\"We are in the process of identifying a suitable new location for the Reigate & Banstead Safer Neighbourhood Team, which includes local police officers and Police Community Support Officers (PCSOs), who will continue to be based within the Borough.\n“I know residents will welcome the Force’s commitment to no reduction in service or front counter numbers as we restructure our physical footprint to ensure Surrey Police is fit for the future and best placed to keep our county safe.\n“There have been some tough choices to make but I believe that Leatherhead presents us with the best option in providing both value for money for Surrey residents and an Eastern HQ that is fit for a modern police force.”\nTim Hall, Conservative County Councillor for Leatherhead and Fetcham East said \"It's tremendously good news that Surrey Police are proposing to move its Eastern Divisional Headquarters to the Cleeve Road site in our town.\n\"Leatherhead is very much at the heart of Surrey's transport network and it will allow easy access for divisional policing teams to all areas. It will also help progress the regeneration of Leatherhead and build on the community safety efforts of the police in Mole Valley and Eastern Surrey.\"",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_campaigns/content_2.html": "Ensuring Surrey Police Do What Only They Can It is important to me that we ensure that Surrey Police do what only the police can. Policing is an important part of our wider emergency services community...\nBeing a Voice for Victims I am passionate about being a strong, supportive voice for victims. The criminal justice system can be a daunting process for anyone, but for those who have...\nMaking Policing Accessible I want to ensure that policing is accessible and that residents are confident that Surrey Police will always be there when you need them. Too often when people...",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_tackling-anti-social-behaviour-michael-gove/content_37.html": "Lisa Townsend, Surrey Police and Crime Commissioner, joined Michael Gove MP, Secretary of State for Levelling Up, Housing and Communities and the Neighbourhood Watch at Number 10 on Monday 16th January for a roundtable meeting to discuss anti-social behaviour.\nWill Tanner, Mr Sunak’s Deputy Chief of Staff, Arundel and South Downs MP Nick Herbert, and Victims’ Commissioner CEO Katie Kempen, were also present among others from charities, police forces and the National Police Chiefs Council.\nThe panel discussed existing solutions, including visible policing and fixed penalty notices, as well as longer-term programmes such as the re-invigoration of Britain’s high streets.\nThe Anti-Social Behaviour Support Service and the Cuckooing Service, commissioned by the Office of the Surrey Police and Crime Commissioner, provides support for victims of Anti-social Behaviour in Surrey.\nLisa said,\n\"It is quite right that we push anti-social behaviour away from our public spaces, although my concern is that by dispersing it, we send it to residents’ front doors, giving them no safe refuge.\nI believe that in order to end anti-social behaviour, we have to tackle the underlying issues, such as trouble at home or a lack of investment in mental health treatment. This can and should be done by local authorities, schools and social workers, among others, rather than the police.\nI do not underestimate the impact this particular type of offending can have. While anti-social behaviour may appear to be a minor crime at first glance, the reality is very different, and it can have a very high impact on victims. It makes the streets feel less safe for everyone, particularly women and girls.\nWe have to take this seriously and deal with the root causes. Because every victim is different, it’s important to look at the harm caused by such offences, rather than the offence itself or the number committed.\nIn Surrey, we work closely with partners including local authorities to reduce the number of times victims are pushed between different organisations.The Community Harm Partnership is also running a series of webinars to increase awareness of anti-social behaviour and improve its response.\nForces around the country can and must do more, and I’d like to see joined-up thinking between different agencies to get to the bottom of this offence.\"\nYou can read more about the round table meeting here.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_events_feed/content_36.html": null,
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_new-year-elmbridge-beat/content_7.html": "Surrey Police and Crime Commissioner Lisa Townsend saw in the New Year with Elmbridge Beat on their New Years Eve shift.\nLisa said,\n\"It is always great to see first-hand the invaluable work of Surrey Police to ensure everyone is safe on Surrey’s roads over the festive period.\nThinking about drinking or drug driving? While we can’t be everywhere we could be anywhere and officers will stop anyone they see committing a driving offence. So, if you’re driving, check your headlights, make sure your tyres are safe and don’t even think about risking your life or that of a loved one by drinking or taking drugs and driving.Wishing you all a Happy and Prosperous 2023!\"",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_commissioner-thanks-residents-backing-local-policing/content_41.html": "Following confirmation of her proposed council tax increase yesterday (Friday 2nd February 2024), Police and Crime Commissioner for Surrey, Lisa Townsend, has thanked residents for their engagement, support, and views in completing her countywide survey on the topic.\nThe survey, launched in December, asked residents what they would be willing to pay to help provide Surrey Police with the resources it needs to deliver new Chief Constable Tim De Meyer’s plan and keep our county safe.\nOver 50% of respondents said they would be happy to pay an additional £12 or £13 per year (on a Band D property), with the £13 figure (or 4.2%) being the most popular answer amongst respondents.\nA £13 proposal was put to Surrey’s Police and Crime Panel by the Commissioner, who set out the importance of the increase in enabling Surrey Police to continue keeping our county safe and providing the Force with the means to focus on protecting people and tackling crime.\nThe Commissioner outlined how the proposed increase will help the Chief Constable deliver his pledge to crack down on anti-social behaviour and tackle pockets of lawlessness with a visible policing presence, ensuring Surrey Police relentlessly pursues offenders who are most prolific across our communities.\nWhilst the Commissioner’s proposal was confirmed, she expressed “disappointment” that some members of the Panel voted against the increase.\nSpeaking after the Panel meeting, Lisa Townsend said “I am grateful to all members of our community who took the time to complete my survey and share their thoughts on funding levels and priority areas for our police force.\n“I am incredibly conscious of the current financial pressures on households, and my decision to increase the policing element of Council Tax was not an easy one. Ultimately there are difficult decisions I must make with the best interests of our county in mind.\n“Listening to residents is an important part of my decision-making process and results showed that the majority of those who completed the survey were willing to pay a little bit more for policing in Surrey. At a time when bills are rising, this is a strong vote of confidence in and support for our brilliant officers and staff.\n“The Chief Constable and I have spoken with hundreds of residents over the past few months at our in-person and online community events, at which the Chief Constable clearly set out his vision for the Force in providing a service our residents rightly expect.\n“The plan focusses on getting tough on offenders, protecting people across the county, and fighting crime in communities across Surrey. Not only are these things that policing does best they are also the things I know residents want our police to be prioritising.\n“Communities across Surrey want and expect their police to be there when they need them, from answering calls as quickly as possible to tackling crimes which impact their everyday lives and blight our communities.\n“The Chief Constable is committed to substantially increasing the detection rate for crimes and the number of offenders put before the courts, aiming for an additional 2,000 charges to be made by March 2026. He has also pledged to ensure that calls for help from members of the public are answered more quickly, something which I am pleased we have already seen significant improvement in over recent months.\n“I was, therefore, disappointed that some members of the panel chose to act as a politically motivated block to try and prevent the proposed increase, which would have meant the force faced greater cuts, and would have inhibited the delivery of the Chief Constable’s plan for the improvements and changes that I know residents support.\n“I am grateful to the members of the panel, including those who sit as non-elected politically independent members, who understood my need to ensure the Chief Constable has the tools he needs to take the fight to criminals and protect our county.\n“Surrey Police has worked tirelessly to meet and surpass government targets for additional officer numbers in our county, and as a result Surrey now has more police officers than it has ever had before.\n“Today’s decision will mean that these officers receive the right support to achieve the Chief Constable’s plan for our county and make our communities even safer for residents and visitors.”",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_more-powers-tackle-disruptive-protests/content_21.html": "Just before Christmas Lisa Townsend, Surrey Police and Crime Commissioner, joined other senior policing leaders at a meeting with the Prime Minster at 10 Downing Street to discuss recent disruption on the M25.\nFollowing the meeting, the Government has amended the Public Order Bill to give police more powers to deal with protestors who cause serious disruption.\nOn the disruption and new measures, Lisa said\n\"I’m proud of the way Surrey Police officers and staff have handled protestors on our roads, and it is right that the government is working hard to ensure they have the powers they need going forwards.\"\n\"I’m pleased that the Prime Minister took our concerns and ideas on board and this new amendment to the Public Order Bill gives police more powers to deal with protestors causing danger and disruption to our roads and infrastructure.\"",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_more-support-mental-health-patients/content_30.html": "Lisa Townsend, National Mental Health Lead for Police and Crime Commissioners, has welcomed the additional support from government for mental health services.\nLisa said,\n\"I’ve been working with the Home Office and other government departments recently, looking at how we better improve our mental health response. We must ensure the right support is in place at the right time for those who need it, and additional measures such as these should also help reduce the non crime demand on policing.\nI will be briefing my Commissioner colleagues from across the country about these latest updates on Thursday, when we will also be discussing new ideas being implemented in police forces across England and Wales.\"",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_campaigns_being-voice-victims/content_25.html": "I am passionate about being a strong, supportive voice for victims. The criminal justice system can be a daunting process for anyone, but for those who have been the victim of a crime it can seem like an alien procedure that doesn't always put the needs of the victim at its heart. I am committed to ensuring that everyone working in the system - from police to courts, prisons and probation - are putting the victim's needs at the centre of all they do. I will continue to commission and support the services in our county that work tirelessly for victims.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_cdn-cgi_l_email-protection/content_34.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_keepingsurreysafe/content_4.html": "Police and Crime Commissioner for Surrey, Lisa Townsend, is working hard to keep our county safe and listen to residents across Surrey.\nSince Lisa was elected just 3 years ago, we now have more police officers in Surrey than ever before, keeping our communities safe and pursuing offenders.\nWith her team, Lisa has also secured more than £10m worth of additional funding to support projects and initiatives across our county to cut crime and anti-social behaviour.\nThanks to Lisa’s commitment to listening to residents and acting on their concerns, Surrey Police is taking a “back to basics” approach to policing, cutting crime and prioritising what matters to you, our residents.\nAs Police and Crime Commissioner, Lisa is delivering for Surrey residents and communities, from hiring a new Chief Constable for the county who shares her commitment to delivering for residents and pursuing offenders, to helping roll out national changes in policing such as Right Care, Right Person.\nShe has also worked closely with the government on their national crackdown on antisocial behaviour, including the banning of NOS (nitrous oxide) canisters. Lisa recently welcomed the news that another £1million of funding is coming to Surrey to help tackle crime and anti-social behaviour with a “hotspot” policing approach in locations across Surrey.\nHaving made excellent progress, Lisa knows there is still work to be done, and if re-elected on 2nd May she has committed to:\n- Ensuring Surrey Police do what only they can, investigating and solving crime, and pursuing offenders, not sitting in hospitals, or examining non-crime hate incidents.\n- Being a voice for victims, prioritising victims needs throughout the Criminal Justice System, continuing to commission and support services that support victims.\n- Making policing accessible, ensuring residents get swift answers from the right organisation, rather than being passed from agency to agency without resolution.\nIf you support our police and want to keep our county safe, please vote for Lisa Townsend on 2nd May, so she can continue working hard and delivering for residents as our Police and Crime Commissioner.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_category_Westminster-News/content_31.html": "Discussing ASB on BBC Politics Live 14th March 2023 Surrey’s Police and Crime Commissioner, Lisa Townsend, joined the BBC’s Politics Live panel last week, talking about key topics of the day with host Jo Coburn. Westminster News\nEnding Domestic Abuse Together 8th March 2023 Police and Crime Commissioner for Surrey, Lisa Townsend, recently spoke on a Women’s Aid panel discussion about the importance of local collaboration. The panel... Westminster News\nTackling Anti-Social Behaviour with Michael Gove 25th January 2023 Lisa Townsend, Surrey Police and Crime Commissioner, joined Michael Gove MP, Secretary of State for Levelling Up, Housing and Communities and the Neighbourhood... ArticlesLocal NewsWestminster News\nMore Powers to Tackle Disruptive Protests 17th January 2023 Just before Christmas Lisa Townsend, Surrey Police and Crime Commissioner, joined other senior policing leaders at a meeting with the Prime Minster at 10... ArticlesWestminster News\nMeeting in Westminster with Surrey MPs 28th November 2022 On Monday 28th November, Lisa Townsend, Surrey Police and Crime Commissioner met with Surrey MPs in Westminster to discuss local policing issues and... Westminster News",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_campaigns_ensuring-surrey-police-do-what-only-they-can/content_6.html": "It is important to me that we ensure that Surrey Police do what only the police can.\nPolicing is an important part of our wider emergency services community, but there are things that only the police can do: including investigating crime, the arrest and detention of suspects and using force including taser and when necessary, firearms. I do not believe that officers should not be sitting in hospitals for hours with someone experiencing a mental health crisis, doing the job of our medical staff or investigating non-crime hate incidents such as 'misgendering'.\nI will continue to work with the Chief Constable to make sure that policing goes back to the basics of detecting and solving crime.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_getting-support-domestic-abuse/content_38.html": "As your Police and Crime Commissioner, I want every woman and girl in Surrey to be safe and feel safe. Living with Domestic Abuse can feel isolating and lonely, but there is a wealth of support available to you across the county, including out of hours and 24/7 helplines so that you can access the support when you need it most.\nWhether you are suffering abuse yourself, or know someone who is, this page has a range of information about where to get help and support.\nDomestic Abuse is any incident of controlling, coercive or threatening behaviour, violence or abuse between those aged 16 or over who are or have been intimate partners or family members, regardless of their gender or sexuality (Source: Surrey Police).\nThe Surrey Domestic Abuse Partnership (SDAP) is a group of independent charities who work together across the whole of Surrey to offer an independent, confidential, listening service to anyone affected by domestic abuse. They are free, impartial services that can give practical help and emotional support, as well as providing information on a wide range of issues including housing, benefits, safety planning and the needs of children affected by domestic abuse.\nWhere to get help:\nIn an emergency always call 999.\nYour Sanctuary Surrey Domestic Abuse Helpline\n(County wide, plus Woking, Runnymede and Surrey Heath)\nCall between 9am and 9pm, 7 days a week - 01483 776822\nYou can also contact online via https://www.yoursanctuary.org.uk/\nI Choose Freedom\n(County wide)\nCall via the national helpline - 0808 2000 247, open 24 hours a day\nWebsite: https://www.ichoosefreedom.co.uk/\nEast Surrey Domestic Abuse Service (ESDAS)\n(Reigate and Banstead, Mole Valley, and Tandridge)\nCall between 9am and 4pm - 01737 771350\nText - 07860 039720\nEmail - [email protected] - you can email to get a referral and find out how ESDAS can support you. Secure email is also available via [email protected]\nWebsite: https://www.esdas.org.uk/\nNorth Surrey Domestic Abuse Service (NSDAS)\n(Epsom, Ewell, Elmbridge, Spelthorne)\nCall between 9am and 4pm - 01932 260690\nEmail - [email protected]\nWebsite: https://www.nsdas.org.uk/\nSouth West Surrey Domestic Abuse Outreach Service (SWSDAS)\n(Waverley and Guildford)\nCall between 9am and 4pm - 01483 898884\nEmail - [email protected]\nWebsite: https://www.swsda.org.uk/\nSurrey Police\nEmergency - 999\nNon-emergency - 101\nWebsite: https://www.surrey.police.uk/advice/advice-and-information/daa/domestic…\nYou can find out more information from Surrey Police or report online here.\nYou can find out more about what I am doing to tackle domestic abuse and violence against women and girls here.\nYou can find out more information about the Surrey Domestic Abuse Partnership here.\nYou can find out more about Surrey Against Domestic Abuse here.\n(Source: Healthy Surrey)\nPhoto by Priscilla Du Preez on Unsplash",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_police-commissioner-welcomes-government-crackdown-fraudsters-has-helped-cut-fraud-14-cent/content_19.html": "Police and Crime Commissioner for Surrey, Lisa Townsend, has welcomed the Conservative Government’s new long-term ‘Stop! Think Fraud’ campaign, delivering tough new anti-fraud messaging, raising public awareness on fraud safety advice in partnership with law enforcement, tech, banking, telecoms and third sector organisations.\nThis new campaign builds on the Government’s long-term Fraud Strategy set out by the Home Office in May 2023, committing to 52 ambitious actions to cut fraud by ten per cent by the end of this Parliament. Thanks to the Government’s long-term plan, fraud and computer misuse has fallen by 13 per cent nationally in the last year according to the latest data from the Crime Survey of England and Wales.\nOfficial data shows that the number of fraud and computer misuse incidents in Surrey had fallen from 7781 incidents to 6689 incidents in the last year, a drop of 14 per cent, an even larger drop than the national average.\nSince 2019, the Government has implemented a whole range of long-term reforms to tackle fraud by creating new national fraud squad with over 400 new investigators, banning SIM farms which are used by criminals to send thousands of scam texts and stopping cold calls for financial products so people cannot be duped by scammers.\nThe Government has also signed the world’s first Online Fraud Charter, delivering tough long-term action against fraud in partnership with 12 leading tech companies including Amazon, Facebook, Google and X (formerly Twitter).\nSpeaking about the campaign Lisa said “Fraud accounts for more than 40 per cent of crime in Surrey and can have a devastating impact on victims’ lives, with scammers often deliberately targeting vulnerable residents. I am, therefore, delighted that the Government’s crackdown on fraud has helped cut fraud referrals by 14 per cent across our county.\n“This brilliant new ‘Stop! Think Fraud’ campaign from the Government will build on the excellent progress that has already been made in Surrey, raising public awareness on fraud and how to prevent becoming victim to it, as well as building on the Conservative long-term Fraud Strategy which was announced in 2023.\nHome Secretary, James Cleverly, said “Our bold Fraud Strategy is continuing to deliver for the British people.\n“This new campaign is a powerful tool to add to our arsenal, which already includes a world-first agreement from tech firms to prevent online fraud and the rollout of a National Fraud Squad that has 400 expert investigators.\n“I encourage everyone to stop, take a moment to think about fraud, and share this messaging far and wide.”\nSecurity Minister, Tom Tugendhat, said “Fraud ruins lives. Following this advice will give people the best tips to stop fraudsters from stealing their hard-earned cash, and point them towards all the help and information on offer.\n“Our Fraud Strategy is successfully turning the tide against fraudsters. This new campaign will share the details we all need to defend ourselves and our friends.”",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_category_Local-News/content_14.html": "Lib Dems Put Politics Ahead of Community Safety 3rd February 2025 Surrey’s Police and Crime Panel met today (3rd February) to discuss the 4.3% increase to the policing element of council tax proposed by the Commissioner in... Local News\nPolice and Crime Commissioner Approves Divisional Move to Leatherhead 14th August 2024 Police and Crime Commissioner for Surrey, Lisa Townsend, has approved an operational recommendation from Surrey Police to relocate the Eastern Divisional... Local News\nWorking for You to Keep Surrey Safe 19th April 2024 Police and Crime Commissioner for Surrey, Lisa Townsend, is working hard to keep our county safe and listen to residents across Surrey. Since Lisa was elected... Local News\nDiscussing Community Safety in Guildford, with Angela Richardson MP 9th April 2024 Surrey Police and Crime Commissioner, Lisa Townsend, and Member of Parliament for Guildford, Angela Richardson, have been working together to help keep... Local News\nPolice Commissioner welcomes Government crackdown on fraudsters that has helped cut fraud by 14 per cent in Surrey 15th February 2024 Police and Crime Commissioner for Surrey, Lisa Townsend, has welcomed the Conservative Government’s new long-term ‘Stop! Think Fraud’ campaign, delivering tough... Local News\nCommissioner Thanks Residents for Backing Local Policing 3rd February 2024 Following confirmation of her proposed council tax increase yesterday (Friday 2nd February 2024), Police and Crime Commissioner for Surrey, Lisa Townsend, has... Local News\nHike the Hill for the Amber Foundation 8th June 2023 On Sunday 11th June, the Amber Foundation are hosting Hike the Hill to raise funds for their work transforming young people’s lives. Walking a 10km route... Local News\nCelebrating 2 Years as Surrey's Commissioner 24th May 2023 Lisa Townsend thanks Surrey communities for putting their faith in her as she marks two years as the county’s Police and Crime Commissioner. Lisa stood for... Local News\nMore Police in Surrey than Ever Before as National 20,000 Uplift Target Achieved 26th April 2023 Police and Crime Commissioner for Surrey, Lisa Townsend, has this morning welcomed confirmation that Surrey Police has exceeded its officer uplift target... Local News",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_discussing-community-safety-guildford-angela-richardson-mp/content_42.html": "Surrey Police and Crime Commissioner, Lisa Townsend, and Member of Parliament for Guildford, Angela Richardson, have been working together to help keep Guildford residents safe and tackle violence against women and girls across the borough.\nEnsuring that residents both are safe and feel safe, is a goal that Lisa and Angela share, and they have been committed to delivering this since Lisa was first elected three years ago.\nReflecting on what they have delivered so far, Lisa and Angela recently caught up to discuss some of the projects taking place across Guildford. This includes a number of measures, from improved CCTV and lighting to extra patrols, that are being delivered thanks to nearly £1million of funding that Lisa secured from the Home Office’s Safer Street’s fund.\nLisa also shared some of the proactive work being done by Surrey Police around the night-time economy, and proactive approaches to identifying perpetrators and safeguarding those enjoying a night out.\nBoth acknowledge the work still to be done, and Angela expressed her disappointment in Guildford Borough Council’s failure to apply for Purple Flag status this year. She explained that Guildford has been proud to be a Purple Flag town – a status awarded to acknowledge excellent standards in management and safety of the night time economy within a town - for a number of years, particularly as a university town.\nAngela also spoke about the decision taken to close public toilets across the town, which she explained leaves women without a safe single sex space to go to the toilet on a night out.\nSpeaking recently about their work together, Lisa said “It’s been an absolute pleasure to work with Angela to improve safety of all residents, and particularly women and girls across the Guildford Borough.\n“Angela shares my strong commitment to ensuring all residents both are safe in real terms, and also feel safe, which can often be two quite different things.\n“I am pleased that the projects we are already delivering have had such great benefits for the town and wider area, and I know from speaking with residents that the many new officers that have recently been recruited are starting to make a real difference on the streets and in our communities.\n“Surrey Police has more officers than ever before, and it’s brilliant to know that this is making a difference and improving residents’ feelings of safety.\n“I look forward to continuing to work with Angela to make further improvements across the Guildford borough, and we both know there is more to be done!”",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_privacy/content_33.html": "This document outlines how Lisa Townsend processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Lisa Townsend\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Lisa Townsend.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Lisa Townsend, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Lisa Townsend via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_my-achievements/content_18.html": "I am committed to ensuring Surrey residents are safe and feel safe, putting residents’ voices first, and championing excellent neighbourhood policing. Over the past 3 years, I have helped secure:\n- More police in Surrey than ever before, keeping our communities safe and pursuing offenders.\n- More than £10m extra funding to support projects across the county to cut crime and anti-social behaviour.\n- A ‘back to basics’ approach for Surrey Police, cutting crime and prioritising what matters most to residents.\nI have a proven track record of delivering for Surrey residents and communities. From hiring a new Chief Constable for the county who shares my commitment to delivering for residents and pursuing offenders, to helping roll out national changes in policing such as Right Care Right Person.\nMy Police and Crime Plan was the most widely consulted Police and Crime Plan in Surrey’s history and includes 5 key priorities:\n- Preventing violence against women and girls.\n- Protecting people from harm in Surrey.\n- Working with Surrey communities so that they feel safe.\n- Strengthening relationships between Surrey Police and Surrey residents.\n- Ensuring safer Surrey roads.\nTo help you understand the work I have done to help deliver these priorities, I have outlined some of my top achievements in each of the 5 areas below, as well as some information about how I am helping to deliver Right Care, Right Person.\nTackling Violence Against Women and Girls\n- Securing £1m of funding from the Home Office’s ‘What Works’ fund to deliver fully funded teacher training courses across the county. These courses are empowering PSHE teachers to deliver lessons that foster resilience and self-confidence in children and young people, tackling behaviour associated with violence against women and girls from a young age.\n- Developing a countywide ‘Perpetrator Hub’, that tackles the root causes of violence against women and girls, and brings the focus squarely onto the perpetrator and their behaviour, rather than that of the victim.\n- Ensuring a full force-wide re-vetting of all Surrey officers and staff and a continued monitoring of management of misconduct allegations. This included me leading by example and undergoing a full re-vetting herself to highlight the importance of this process.\nProtecting People from Harm in Surrey\n- Implementing Surrey’s first countywide anti-social behaviour survey, to improve understanding of both the scale and impact of the issue in Surrey. This lead to further focus groups and ongoing work to improve the response to ASB.\n- Highlighting the level of fraud occurring both nationally and in Surrey, helping our vulnerable residents know how to spot the signs and protect themselves from falling victim to fraudsters.\n- Being a champion for victims across our county, convening partners from a variety of agencies to discuss, plan, and ultimately deliver improvements to the care that victims of crime receive in Surrey.\nWorking with Communities So That They Feel Safe\n- Securing additional funding through the Government’s ‘Safer Streets’ funding rounds for projects in Epsom, Sunbury Cross, Addlestone, Tandridge, Woking, Walton, Redhill and Guildford.\n- Providing £58,000 of funding for the policing aspect of the upcoming Clear, Hold, Build project. This is a Government initiative that involves partnership working with the aim of making areas safer by tackling organised crime, improving confidence in the police, and developing community resillience.\n- Working with retailers and Surrey Police to help combat shoplifting in communities across our county, and supporting the police commitment to urgently attend shoplifting scenes where violence has been committed against workers.\nStrengthening Relationships Between Surrey Police and Surrey Residents\n- Overseeing significant improvements in both 101 and 999 call performance, with wait times now at their lowest levels in the Force’s history, so that residents can be confident that Surrey Police will always be there when they need them.\n- Regularly hosting or attending residents meetings in all areas of the county, giving residents the opportunity to share concerns and ask questions of their Police and Crime Commissioner.\n- Delivering a ‘Policing Your Community’ roadshow, allowing residents the chance to meet our new Chief Constable, hear his plans for the future of Surrey Police, and speak to their Borough Commander about local issues.\n- Hosting monthly surgery sessions, so that residents who need help from the Commissioner have direct access and those who simply wish to ask questions have the opportunity to do so.\n- Introducing Surrey’s first policing Youth Commission, overseen by the Deputy Police and Crime Commissioner, to ensure that the voice of the next generation is at the heart of policing and community safety in Surrey.\nEnsuring Safer Surrey Roads\n- Welcoming and supporting Surrey Police’s dedicated Vanguard team. This team works in addition to Surrey’s dedication Roads Policing Unit to help reduce deaths and serious injuries on our roads. Vanguard focus on tackling the ‘Fatal 5’ offences of inappropriate speed, careless driving, driving under the influence of drugs or alcohol, distracted driving (such as using a mobile phone, and not wearing a seatbelt.\n- Leading the national transport portfolio on behalf of all Police and Crime Commissioners, to ensure Surrey’s voice is at the heart of national policy.\n- Supporting Surrey Police’s response to M25 protests, including raising at a national level challenges around the Crown Prosecution Service’s response and the impact this had on both road safety and policing demand across the county.\nRight Care Right Person\nAs the national Police and Crime Commissioner portfolio lead for Mental Health, I have also played a key role in the planning and roll out of the Right Care, Right Person initiative. There are two key ambitions behind this model:\n1. To ensure that those in mental health crisis receive the most appropriate care from the best placed person and services.\n2. To reduce demand on policing for non crime related incidents.\nA person in crisis should not end up in the back of a police car. The focus must be on the individual at risk and prioritising their needs by providing them with the right care from the right person.\nIt is estimated that this will save around 1 million hours of police time each year, allowing police to focus on the jobs only police can do, such as preventing and detecting crime.\nThis roll out has not been rushed, and close work with partners is ongoing as these changes are implemented. Where there is a threat to life or risk of serious injury, police will continue to respond and assist.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_about-me/content_23.html": "I have lived in Surrey with my husband, Ben, for over 14 years and was first elected as your Police and Crime Commissioner in 2021.\nIt is an honour and privilege to represent you, which is why I am standing this year in the hope to continue as your Commissioner. I love where we live, and I want our county to be as safe, secure, and enjoyable as possible for all residents. I know the importance of putting local people and their priorities at the heart of policing.\nMy priorities which feed in to my Police and Crime Plan, are based on the issues residents across the county have repeatedly raised with me, and include: tackling anti-social behaviour, improving visible policing, cracking down on county lines, improving road safety and enforcement, setting local policing priorities, and holding the police to account. I am also committed to tackling violence against women and improving protection for children.\nI am proud of the achievements I have delivered in each of these areas since you elected me in 2021, you can find out more about these here.\nSurrey is a wonderful and safe place to live, but I know that there is more to be done. The most important thing for me to do is to continue to listen to you and deliver your priorities for our county, but you can read about my other priorities for Surrey here.\nMy background\nI have experience working in both the public and private sector. Throughout my career I have managed diverse teams and multi-million-pound budgets. I have two law degrees and, following university, spent over ten years in Parliament where I worked for a number of MPs, representing and supporting residents. Whilst there I also worked alongside charities including Mind and Rethink, as well as the Centre for Mental Health, supporting the All-Party Parliamentary Group for Mental Health in developing policies to put forward to government to improve mental health provision, including parity of esteem.\nWhilst I do not have a background in policing - Surrey Police are quite rightly the experts in operational policing - I bring value to the police and the residents of Surrey through my proven track record of holding people of all levels to account and experience in community campaigning, communications, mentoring and management. Through my wider volunteering and working background, I have developed good links outside of Surrey, including with PCCs in other forces whose support is invaluable, as well as key representatives and officials in Westminster.",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_my-priorities/content_35.html": "Since you elected me 3 years ago, I have worked hard to keep Surrey safe, helping secure more police officers for our county than ever before and investing in projects to support communities. I have spoken with many of you and have prioritised championing your voice and concerns.\nSurrey Police is now larger than ever, helped by funding from the Government Uplift programme, and I recruited a new Chief Constable to lead the Force who shares my commitment to a \"back to basics\" approach to policing.\nIn 3 years, my team and I have also secured more than £10m of additional funding for our county. This has been spent supporting community projects across Surrey, including Safer Streets projects tackling anti-social behaviour and county-wide teacher training around violence against women and girls.\nIn the last year alone, Surrey Police has made incredible improvements, from fulfilling recruitment targets to achieving record performance for 101 and 999 wait times.\nI am proud that, as I come to the end of my first term as your Commissioner, Surrey is:\n- The 4th safest county in the country.\n- The safest county in the South East (by some distance).\n- The safest county of those who share a border with the Metropolitan Police area.\n- The safest county in the country for homicide.\n- The 3rd safest county in the country for both knife crime and violent crime.\nBut there is more to be done, which is why I want to be re-elected as your Police and Crime Commissioner to continue building on the improvements I have driven within Surrey Police, listening to you, and supporting our communities.\nIf you re-elect me on 2nd May, I will prioritise:\n- Ensuring Surrey Police do what only they can. Investigating and solving crime, and pursuing offenders, not sitting in hospitals, or examining non-crime hate incidents.\n- Being a voice for victims. Prioritising victims needs throughout the Criminal Justice System, continuing to commission and support services that support victims.\n- Making policing accessible. Ensuring residents get swift answers from the right organisation, rather than being passed from agency to agency without resolution.\nIf you would like to find out any more about my work as your Police and Crime Commissioner, please get in touch!",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_contact/content_9.html": "Please note that all queries submitted via the contact form are sent to [email protected]. If you are contacting Lisa in her capacity as Police and Crime Commissioner for Surrey, please email [email protected].\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_lisatownsend_org_uk_/https_www_lisatownsend_org_uk_news_lib-dems-put-politics-ahead-community-safety/content_5.html": "Surrey’s Police and Crime Panel met today (3rd February) to discuss the 4.3% increase to the policing element of council tax proposed by the Commissioner in consultation with the Chief Constable.\nEight of the panel’s twelve councillors plus one independent member were present for the meeting with four voting in favour of the proposal, one abstaining and the four Liberal Democrat members present voting against.\nSpeaking after the vote, Lisa said “I was incredibly disappointed to see panel members attempt to politicise this decision which is so important for the continued safety of our county, particularly as this went against the view of the majority of residents who responded.\n\"I am really grateful to the more than 3,200 residents who took the time to complete my survey on this year’s precept levels, and for the considerable support for policing in Surrey as evidenced by the majority vote to support our police force.\"\nAs the panel had insufficient votes to veto the proposal, it will still come into effect, which the Commissioner says will ensure policing teams across Surrey have the funding they need to tackle crimes and issues that matter to residents.\nShe added “Surrey Police is one of the fastest improving forces in the country, and I am pleased that today’s outcome means that this momentum can continue over the coming year. Over the last 12 months, the charge rate across the force has more than doubled, 2,500 more arrests have been made and an additional 3,500 offences have been prosecuted.\n“I am also pleased that there have been dramatic improvements when it comes to tackling offences such as burglary, shop theft, child abuse and rape, all of which are issues that I know matter a great deal to residents.\"\nThe Commissioner’s new Police and Crime Plan, which has been developed in consultation with residents and stakeholders from across the county, will soon be launched. The Plan includes a strong focus on a ‘back to basics’ approach to policing which the Commissioner says is based on what the Surrey public want and will see Surrey Police “concentrate on what policing does best…fighting crime, getting tough on offenders, and protecting people”.\nSpeaking about the Plan, the Commissioner said “I want to ensure Surrey Police has the tools it needs to keep us safe and to deliver for residents, including the priorities included in my new Police and Crime Plan.\n“The new Plan, together with council tax funds, will help Surrey Police continue on the improvements it has already made.\n“Not all improvements that are needed across our county are down to policing. For example, I know that extended delays in the Criminal Justice System are causing long waiting periods for victims awaiting their cases to come to court.\n“This is a concern that was highlighted by a range of residents and partners throughout the consultation for my plan, with partners in particular concerned about additional pressures on services with reduced government or local authority funding.\n“That is why I am pleased that Surrey Police and I agreed to use a small proportion of this year’s precept to fund vital and life-changing victim support services and prevention work across the county.”\nWith this increase the policing element of council tax in Surrey will now be £337.57 for a Band D property, which is an increase of £1.16 per month or £14 annually (approximately 4.3% across all bands).\nHowever, even with this increase, alongside their commitment to continued improvement, over the next 4 years, Surrey Police need to deliver approximately £18 million in savings. The Commissioner has reaffirmed her commitment to continue working closely with the Force to ensure this is achieved and that Surrey Police “provide the best possible value for money for the Surrey taxpayer”.\nWhen talking about deciding on the level to recommend, Lisa said “Asking the public for more money in the current financial climate is one of the toughest calls I have to make as Police and Crime Commissioner for this county, and it is not a decision I take lightly.\n“But I know from speaking to residents at our recent Policing Your Community events how much they value that visible policing presence and getting a swift and effective police response when they need it.\n“This was echoed in the comments made in our council tax survey, in which 59% of respondents who took part said they would be willing to pay the increase to support our policing teams over the next year.\n“I want to thank everyone who took part and shared their views – they are invaluable for shaping our policing strategies going forward.\n“Today’s decision will mean our officers and staff will be properly supported to continue to take the fight to criminals and deliver on the priorities in that Plan to make our communities even safer for Surrey residents.”"
}