{
  "https_meldawkins_org/https_meldawkins_org/content_1.html": "Welcome to WordPress! This is a sample post. Edit or delete it to take the first step in your blogging journey. To add more content here, click the small plus icon at the top left corner. There, you will find an existing selection of WordPress blocks and patterns, something to suit your every need for content creation. And don’t forget to check out the List View: click the icon a few spots to the right of the plus icon and you’ll get a tidy, easy-to-view list of the blocks and patterns in your post.\nBlog\n-\nBeyond the Obstacle\nWelcome to WordPress! This is a sample post. Edit or delete it to take the first step in your blogging journey. To add more content here, click the small plus icon at the top left corner. There, you will find an existing selection of WordPress blocks and patterns, something to suit your every need for content creation. And don’t forget to check out the List View: click the icon a few spots to the right of the plus icon and you’ll get a tidy, easy-to-view list of the blocks and patterns in your post.",
  "https_meldawkins_org/https_meldawkins_org_about/content_2.html": "I believe everyone deserves the best chance and a good start in life. As a special education needs music teacher, I’ve seen first hand what an impact learning can have on young people. After 14 years of Tory rule, our systems are broken. Our NHS, our schools, our special educational needs, social care services, our public transport, our social housing, the list goes on.\nPeople working on the frontline in these sectors know what needs doing, I want to stand up for the things that matter to you. The pandemic showed us how much stronger we are together as a community, looking out for our neighbours. We all recognised how important our public services are, how much we should make sure we pay people properly and treat them fairly.\nI am a Councillor for Kent County Council and a district Councillor in Canterbury. I sit on the cabinet as the portfolio holder for Climate Change and Biodiversity, speaking up for the environment, our green spaces and nature.I chair the Open Space and Biodiversity Working Group to develop, monitor and review a Nature Recovery Action Plan for the district.\nAs the shadow cabinet member for Environment at Kent County Council, I’m passionate about raising awareness of sustainable solutions to reach net zero. Our environment is our future and I believe that we can provide the jobs, homes and community resources we need with green policies.\nMusic is a universal language. As someone who grew up with 50% hearing loss, who wears hearing aids, I’ve been able to use music in my working life as a professional saxophonist and then working with children with special education needs. Equality and helping everyone achieve their best is vital – I’ve seen first hand with my family how disability and mental health can have an impact if we don’t support people and give them a chance.\nI’ve had a busy career, out in the real world, I’ve been involved in performing, released an album, and worked as the Head of Music in a school for young people with autism. And recently I ran ‘Bradstock’, a school and community festival involving children and young people, and bringing families together, and building youngsters’ confidence.\nI want to use my experience in local government, and in the community, in Parliament. We need more control locally over what happens in our community. And a better working relationship between what people need locally and the decisions taken in Westminster. Councils and communities are hamstrung by bureaucracy, poor funding and bidding against other local authorities to get the money they need. This has to change. If we had more control locally, we could work faster, more efficiently and do the things local people want.\nI got involved in politics because I was tired of having to fight for my family to get the support and care they needed and deserved. My hearing impairment reminds me everyday to listen – it’s the most crucial skill of a politician and I am here to listen to you in the community and represent your needs."
}