{
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_05_01_the-end-of-democracy-in-the-uk/content_5.html": "Tonight I witnessed the end of Democracy in the UK. Ed Miliband has just pushed Scotland towards Independence. To hear the leader of the Labour party say he would rather lose the election than work with a group of MPs elected by people of this country(UK) is something I thought I would never hear.\nTonight we have witnessed the end of democracy in this country and the true feelings Westminster has towards Scotland and its people. We have for years seen the South East of England prosper as the rest of the UK suffer and now with the Conservatives and austerity, the poor and disabled are being attacked as the government try to save money instead of investing and protect the people of this country.\nThe Green Party has shown how this country should be run, with like minded parties working together for the betterment of it’s people, the powerful Westminster parties are only happy when you vote for them, when Scotland votes Labour MP’s they obey the party whip meaning they don’t represent the people who voted them in, hence why now the people of Scotland are turning to the SNP. They know an SNP MP will give them a voice, after decades of silence. People who voted no in the referendum are now voting SNP, not for independence but to be heard.\nI am standing the two leading parties are, the Lib Dems and the Conservative. So in reality whoever you vote for you are voting for a Conservative government. If the Lib Dems really believed in a fair and equal society they would never have sat back and allowed Ian Duncan Smith to bring in benefit sanctions that have cost the lives of people of this country while the richest 1000 double their wealth and don’t forget it was Labour who brought in the bedroom tax.\nWith less than a week to go and as many as 50% of people not decided on who to vote for, I ask, if you believe in the UK and you do not wish to see it ripped apart then do what the people of Scotland have done, turn on the powers of Westminster and vote for a party that will work together with like minded parties. Vote for a party that will not sit by and watch people rely on food banks, work in low paid jobs and live in private rented houses that cost the tax payers 50% more than social housing. A party that will build social housing not sell them off, a party that welcomes the benefits that immigration bring not blame it for the short sightedness and lack of investment by previous governments and the greed of bankers.\nThe Conservatives talk about cutting the welfare state but it is low paid jobs that mean we need working tax credits, it is a lack of social housing that means we pay 50% more to private landlords. No more spin, see what is really happening in this country and vote for change, vote for the common good, vote Green.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_11_20_under-25s-need-to-start-voting-if-they-want-to-be-treated-fairly/content_4.html": "An overwhelming majority of people believe under-25s should be paid the same rate of living wage as older workers and should not have their housing benefit cut, according to a Survation poll for The Huffington Post UK.\nYou could be 18 married with 2 kids and expected to live on less money than someone aged 25 and in the same situation, how is this fair?\nAt this time the unfair treatment of under 25s means U25s get lower ESA, JSA and a lower rate of pay.\nJSA:\n18 to 24 up to £57.90\n25 or over up to £73.10\nESA:\nYou’ll normally get the assessment rate for 13 weeks after your claim. This will be:\nup to £57.90 a week if you’re aged under 25\nup to £73.10 a week if you’re aged 25 or over\nAfter that, if you’re entitled to ESA, you’ll be placed in one of 2 groups and will receive:\nup to £102.15 a week if you’re in the work-related activity group\nup to £109.30 a week if you’re in the support group\nIt is proposed they won’t get housing benefit. Stuck living with your parents due to low wages and high house prices and a lack of social houses. (When parents are already struggling they now have to struggle to support their ‘kids’. The real problem is under 25’s who are living away from parents and have been working. If they lose their job for whatever reason, they will only get HB for 6 months)\nYou can’t get working tax credits until 25 or over, if you don’t have kids. Under 25’s receive working tax credits ONLY if they have children.\nThe National Minimum Wage rate per hour depends on your age and whether you’re an apprentice – you must be at least school leaving age to get it.\n21 and over 18 to 20 Under 18 Apprentice*\n2015 (current rate) £6.70 £5.30 £3.87 £3.30\nAn apprentice now includes working in a coffee shop cleaning tables. Sorry, that is not an apprenticeship; that is a part time job where you should be on at least the minimum wage.\nNational living wage:\nFrom April 2016, the national living wage will be £7.20 an hour for workers aged 25 and older. The minimum wage will still apply for workers aged 24 and under.\nSo you leave school at 18 and you get £5:30 an hour, someone aged 25 starts at the same time as you and gets £7:20 for doing the same job! Is that fair or is it age discrimination?\nDavid Cameron has suggested that the Government reviews its benefits policy for U25’s. He has has also suggested benefits paid to people under the age of 25 could be cut in an effort to reduce long-term worklessness. Perhaps if they were paid the same rate of pay as over 25’s they wouldn’t be on benefits.\nIn his speech to the Conservative conference in October 2015, the Prime Minister promised to “nag and push and guide” young people away from a life on the dole. Surely giving someone u25 a higher wage will mean they can support themselves and their families instead of demonising them.\nNow, in many Government jobs like the Police, Prison Service and local government, they have an increment system. This is where you start a job on say £14,000pa and after 5 years you are guaranteed to be on £16000pa. The pay is then based on your experience in that job. Why can’t they do that with every job? You start a job on £7:20ph but after 5 years you will be on £9ph, no matter what age you are. Now your employer can start an employee anywhere in between that pay rate depending on experience, so I am not saying everyone should be paid the minimum wage far from it. The minimum wage has now become the acceptable wage, this was not its intent. How do u know this?\nGeorge Osbourne also announced in his budget that automatic entitlement to housing benefit will be scrapped for 18-21-year-olds.\nWhy is this happening? U25’s do not vote. The Government can take away your benefits and pay you lower wages because you will not vote and remove them from power. OAPs on the other hand are protected because they do vote. They vote to protect their pensions and other benefits like the winter fuel allowance.\nIf you are under 25 or have a family member who is u25 please ask them not only to vote, but to think about who and what they are voting for.\nIf you want to be treated fairly then you must use your vote and then the Government will listen, only then will they listen to you.\nMake sure you don’t lose your vote register online here\nIf you wish to join the Green Party you can do so here\nDear Mr Hamilton,\nI’m a supporter of the Green party and was impressed by your performance in the 2015 election debate (at Thornbury Baptist church), however I am very concerned about the possibility of your standing splitting the vote and allowing the conservatives to win again. I am especially concerned since the UKIP candidate decided not to stand in order to give Lake Hall an increased chance of winning.\nI realise it is a lot to ask, but have you considered not standing/campaigning in order to give the liberal democrat party candidate the best chance of beating the conservatives in Thornbury and Yate?\nBest Regards,\nMichael\nLikeLike",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_author_achean/content_21.html": "As we hurtle towards the most unpredictable general election anyone can remember I’d like to welcome you to my site as the prospective parliamentary candidate for the Green Party in Thornbury and Yate. Right now we’re shaking down the features and finding out what works and what needs to work better, but please check back frequently and I’ll endeavour to keep you up to date on the latest from the campaign trail.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_campaign-trail/content_13.html": "Outside tonights husting at the Thornbury Parish church with Grandparents for a safer earth.\nInside where climate change and the environment was a hot topic.\nOn Thursday I attended the hustings at Zion church in Frampton Cotterell.\nI attended the FSB Hustings last night to listen to local small businesses and residents questions about what I would do as your Green MP to improve the local economy and environment.\nOpportunities to meet your candidate.\nI will be attending the following Hustings in Thornbury and Yate:\n- Federation of Small Business in the Armadillo, Yate on 14th of April at 19:30\n- Zion United Church, Frampton Cotterell on April 16th at 19.30.\n- Thornbury Baptist Church Centre, Thornbury on 21st of April at 19:30\n- Cranleigh Court Chapel, Yate on 23rd of April at 19:30\n“There is no perfect way but there is a better way”.\nKnock, knock\nThis week saw the start of our canvassing as we chat to people on the door step and inform them that the Green party will be standing in Thornbury and Yate in the election this May.\nWe will be putting leaflets through doors and chatting to people about their thoughts of the coming election.\nMop Fair\nI decided to pop down to the Mop Fair in Chipping Sodbury on Saturday 21st of March. Dropping off leaflets for people to read and talking about local issues. I was surprised that the fair is very modern with fair rides, I was expecting it to be more 13th century themed. One local shop owner asked what we could do about the lose of trade due to the fair being held in the middle of the town. People can’t see his shop due to a large lorry being parked outside of his shop.\nTrade is down considerably and one shop actually closes for the 2 days fair because of the down turn in trade.\nThis is something that should be discussed with the local council before next years Mop Fair.\nFairtrade fair, at the Swan hotel.\nIain Hamilton (Green Party), Russ Martin (UKiP), Luke Hall (Conservative), Steve Webb (Liberal Democrats), Hadleigh Roberts (Labour), the Mayor of Thornbury attended the Fairtrade fair at the Swan Hotel in Thornbury to listen to a Fairtrade farmer from Nicaragua, on Saturday the 28 February 2015.\nThis was my first official event as the Green party prospective candidate, I had a very welcome response and people were delighted to hear that there will be a Green candidate for Thornbury and Yate.\nThis proved a great opportunity to meet with people who are concerned about finding workable, durable and sustainable solutions in which the UK can play an important role in ensuring fair trade internationally.\nThe participant from Nicaragua is a coffee and cocoa producer who detailed how Fairtrade helped when her coffee trees were affected by infection. She also noted the extra work the farmers have to do, planting trees, to stop the soil washing away due to the increase in bad weather and climate change. Fairtrade is also engaging in awareness-raising and campaigning initiatives, including encouraging Tesco to change their banana suppliers to Fairtrade suppliers.\nCandidate’s message:\nAfter the Fairtrade event, I proceeded quickly to attend in the Thornbury and Yate local event as part of the nationwide 38 Degrees petition to save our NHS from the Transatlantic Trade and Investment Partnership (TTiP) proposal. 38 degrees cannot promote any political party but I am more than happy to promote them when they are fighting to save our NHS.\nIn a week when two former Foreign Secretaries were filmed in what looked to be cash for access, greater fear has arisen among people for the future of their cherished NHS as creeping privatisation takes hold.\nThe Green party and Labour have both proposed forbidding MPs from having a second job. However, an admittedly weak Labour-lead motion to do so was defeated by the coalition who voted against it by 287 to 219.\nWith 48 Tory (15%), 13 Labour (5%), and 8 Lib Dems (14%) MPs – and approximately 15% of the coalition’s MPs – having stakes in private healthcare firms, is it any wonder why they are privatising it?\nPoliticians cannot be allowed to use their place in Parliament to serve themselves and their outside interests. To paraphrase Aneurin Bevan, the stalwart champion of the NHS, the politician’s primary role is to advocate for his or her constituents. With second jobs, politicians fail at the first hurdle to respect this cherished principle. This has only strengthened my drive and resolve to ensure that this change be made.\nE: tygp_iain@aol.com\nT: @tygreenparty\nF: https://www.facebook.com/IainHamiltonThornburyandYateGreenParty\nW: https://iainhamiltontandy.wordpress.com/",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_04_19_not-fit-for-purpose-the-uks-low-level-radioactive-waste-strategy/content_8.html": "Not Fit for Purpose – The UK’s Low Level Radioactive Waste Strategy.\nvia Not Fit for Purpose – The UK’s Low Level Radioactive Waste Strategy.\nNot Fit for Purpose – The UK’s Low Level Radioactive Waste Strategy.\nvia Not Fit for Purpose – The UK’s Low Level Radioactive Waste Strategy.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_contact/content_12.html": "Please feel free to message me here. If you want to let me know about something that affects your community or just to subscribe to the Thornbury and Yate Green Party Newsletter, just use the form below.\nPlease feel free to message me here. If you want to let me know about something that affects your community or just to subscribe to the Thornbury and Yate Green Party Newsletter, just use the form below.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_01_12_new-website/content_22.html": "As we hurtle towards the most unpredictable general election anyone can remember I’d like to welcome you to my site as the prospective parliamentary candidate for the Green Party in Thornbury and Yate. Right now we’re shaking down the features and finding out what works and what needs to work better, but please check back frequently and I’ll endeavour to keep you up to date on the latest from the campaign trail.\nWhen Clause 4 went, so did I. Now I’m a Green. Keep up the good work!\nLikeLiked by 1 person\nThank you for your support.\nLikeLiked by 1 person",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_tag_iain-hamilton/content_24.html": "As we hurtle towards the most unpredictable general election anyone can remember I’d like to welcome you to my site as the prospective parliamentary candidate for the Green Party in Thornbury and Yate. Right now we’re shaking down the features and finding out what works and what needs to work better, but please check back frequently and I’ll endeavour to keep you up to date on the latest from the campaign trail.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_page_2/content_14.html": "As we hurtle towards the most unpredictable general election anyone can remember I’d like to welcome you to my site as the prospective parliamentary candidate for the Green Party in Thornbury and Yate. Right now we’re shaking down the features and finding out what works and what needs to work better, but please check back frequently and I’ll endeavour to keep you up to date on the latest from the campaign trail.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_05_06_britain-for-the-love-of-god-please-stop-david-cameron/content_17.html": "Britain: For the Love of God, Please Stop David Cameron Britain: For the Love of God, Please Stop David Cameron. via Britain: For the Love of God, Please Stop David Cameron. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Related Standard",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_02_08_fear-of-the-greens/content_16.html": "As the Green party grow we will be used by the other parties as a weapon of fear. I saw it during the recent Referendum in Scotland when fear won the debate. The Green party face a similar assault. In this election just for once I would like to see people vote for what they want and not what they fear. Tactical voting has kept the Tory and Labour party in control for far too long and business has too much say over policies. The more Green MP’s you have fighting for social justice the better this country will be for everyone who lives here.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_04_23_the-firefighter-letter/content_10.html": "The firefighter letter. The firefighter letter.. via The firefighter letter.. Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like Loading... Related Standard",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com/content_1.html": "An overwhelming majority of people believe under-25s should be paid the same rate of living wage as older workers and should not have their housing benefit cut, according to a Survation poll for The Huffington Post UK.\nYou could be 18 married with 2 kids and expected to live on less money than someone aged 25 and in the same situation, how is this fair?\nAt this time the unfair treatment of under 25s means U25s get lower ESA, JSA and a lower rate of pay.\nJSA:\n18 to 24 up to £57.90\n25 or over up to £73.10\nESA:\nYou’ll normally get the assessment rate for 13 weeks after your claim. This will be:\nup to £57.90 a week if you’re aged under 25\nup to £73.10 a week if you’re aged 25 or over\nAfter that, if you’re entitled to ESA, you’ll be placed in one of 2 groups and will receive:\nup to £102.15 a week if you’re in the work-related activity group\nup to £109.30 a week if you’re in the support group\nIt is proposed they won’t get housing benefit. Stuck living with your parents due to low wages and high house prices and a lack of social houses. (When parents are already struggling they now have to struggle to support their ‘kids’. The real problem is under 25’s who are living away from parents and have been working. If they lose their job for whatever reason, they will only get HB for 6 months)\nYou can’t get working tax credits until 25 or over, if you don’t have kids. Under 25’s receive working tax credits ONLY if they have children.\nThe National Minimum Wage rate per hour depends on your age and whether you’re an apprentice – you must be at least school leaving age to get it.\n21 and over 18 to 20 Under 18 Apprentice*\n2015 (current rate) £6.70 £5.30 £3.87 £3.30\nAn apprentice now includes working in a coffee shop cleaning tables. Sorry, that is not an apprenticeship; that is a part time job where you should be on at least the minimum wage.\nNational living wage:\nFrom April 2016, the national living wage will be £7.20 an hour for workers aged 25 and older. The minimum wage will still apply for workers aged 24 and under.\nSo you leave school at 18 and you get £5:30 an hour, someone aged 25 starts at the same time as you and gets £7:20 for doing the same job! Is that fair or is it age discrimination?\nDavid Cameron has suggested that the Government reviews its benefits policy for U25’s. He has has also suggested benefits paid to people under the age of 25 could be cut in an effort to reduce long-term worklessness. Perhaps if they were paid the same rate of pay as over 25’s they wouldn’t be on benefits.\nIn his speech to the Conservative conference in October 2015, the Prime Minister promised to “nag and push and guide” young people away from a life on the dole. Surely giving someone u25 a higher wage will mean they can support themselves and their families instead of demonising them.\nNow, in many Government jobs like the Police, Prison Service and local government, they have an increment system. This is where you start a job on say £14,000pa and after 5 years you are guaranteed to be on £16000pa. The pay is then based on your experience in that job. Why can’t they do that with every job? You start a job on £7:20ph but after 5 years you will be on £9ph, no matter what age you are. Now your employer can start an employee anywhere in between that pay rate depending on experience, so I am not saying everyone should be paid the minimum wage far from it. The minimum wage has now become the acceptable wage, this was not its intent. How do u know this?\nGeorge Osbourne also announced in his budget that automatic entitlement to housing benefit will be scrapped for 18-21-year-olds.\nWhy is this happening? U25’s do not vote. The Government can take away your benefits and pay you lower wages because you will not vote and remove them from power. OAPs on the other hand are protected because they do vote. They vote to protect their pensions and other benefits like the winter fuel allowance.\nIf you are under 25 or have a family member who is u25 please ask them not only to vote, but to think about who and what they are voting for.\nIf you want to be treated fairly then you must use your vote and then the Government will listen, only then will they listen to you.\nMake sure you don’t lose your vote register online here\nIf you wish to join the Green Party you can do so here",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_author_tygpiain/content_7.html": "An overwhelming majority of people believe under-25s should be paid the same rate of living wage as older workers and should not have their housing benefit cut, according to a Survation poll for The Huffington Post UK.\nYou could be 18 married with 2 kids and expected to live on less money than someone aged 25 and in the same situation, how is this fair?\nAt this time the unfair treatment of under 25s means U25s get lower ESA, JSA and a lower rate of pay.\nJSA:\n18 to 24 up to £57.90\n25 or over up to £73.10\nESA:\nYou’ll normally get the assessment rate for 13 weeks after your claim. This will be:\nup to £57.90 a week if you’re aged under 25\nup to £73.10 a week if you’re aged 25 or over\nAfter that, if you’re entitled to ESA, you’ll be placed in one of 2 groups and will receive:\nup to £102.15 a week if you’re in the work-related activity group\nup to £109.30 a week if you’re in the support group\nIt is proposed they won’t get housing benefit. Stuck living with your parents due to low wages and high house prices and a lack of social houses. (When parents are already struggling they now have to struggle to support their ‘kids’. The real problem is under 25’s who are living away from parents and have been working. If they lose their job for whatever reason, they will only get HB for 6 months)\nYou can’t get working tax credits until 25 or over, if you don’t have kids. Under 25’s receive working tax credits ONLY if they have children.\nThe National Minimum Wage rate per hour depends on your age and whether you’re an apprentice – you must be at least school leaving age to get it.\n21 and over 18 to 20 Under 18 Apprentice*\n2015 (current rate) £6.70 £5.30 £3.87 £3.30\nAn apprentice now includes working in a coffee shop cleaning tables. Sorry, that is not an apprenticeship; that is a part time job where you should be on at least the minimum wage.\nNational living wage:\nFrom April 2016, the national living wage will be £7.20 an hour for workers aged 25 and older. The minimum wage will still apply for workers aged 24 and under.\nSo you leave school at 18 and you get £5:30 an hour, someone aged 25 starts at the same time as you and gets £7:20 for doing the same job! Is that fair or is it age discrimination?\nDavid Cameron has suggested that the Government reviews its benefits policy for U25’s. He has has also suggested benefits paid to people under the age of 25 could be cut in an effort to reduce long-term worklessness. Perhaps if they were paid the same rate of pay as over 25’s they wouldn’t be on benefits.\nIn his speech to the Conservative conference in October 2015, the Prime Minister promised to “nag and push and guide” young people away from a life on the dole. Surely giving someone u25 a higher wage will mean they can support themselves and their families instead of demonising them.\nNow, in many Government jobs like the Police, Prison Service and local government, they have an increment system. This is where you start a job on say £14,000pa and after 5 years you are guaranteed to be on £16000pa. The pay is then based on your experience in that job. Why can’t they do that with every job? You start a job on £7:20ph but after 5 years you will be on £9ph, no matter what age you are. Now your employer can start an employee anywhere in between that pay rate depending on experience, so I am not saying everyone should be paid the minimum wage far from it. The minimum wage has now become the acceptable wage, this was not its intent. How do u know this?\nGeorge Osbourne also announced in his budget that automatic entitlement to housing benefit will be scrapped for 18-21-year-olds.\nWhy is this happening? U25’s do not vote. The Government can take away your benefits and pay you lower wages because you will not vote and remove them from power. OAPs on the other hand are protected because they do vote. They vote to protect their pensions and other benefits like the winter fuel allowance.\nIf you are under 25 or have a family member who is u25 please ask them not only to vote, but to think about who and what they are voting for.\nIf you want to be treated fairly then you must use your vote and then the Government will listen, only then will they listen to you.\nMake sure you don’t lose your vote register online here\nIf you wish to join the Green Party you can do so here",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_03_04_are-the-greens-the-new-labour/content_2.html": "In a week where Natalie Bennett had a poor radio interview that propelled the Green Party into the limelight again after weeks of little attention: was it however really a bad thing?\nOutside the media, the response on the ground has been constructive. Many have noted that this illustrates the welcomed difficulties of the meteoric rise of the Green Party, that we are truly a party of ordinary people, for the ordinary people. Others noted that she has since redeemed herself in subsequent interviews, which has showed tremendous character, something behind which we can all rally.\nThe interview has come in stark contrast to other events as, in the past couple of weeks, it was revealed that two former foreign secretaries were filmed in what seemed to be cash for access. There has been once again a revisit to the fear many had hoped had been left behind, that being corporations, persons of wealth and special interest groups with close access to politicians are able to influence policy. Greater fear has therefore understandably arisen among people for the future of their cherished NHS as creeping privatisation takes hold.\nThis problem is large part due to the lack of restrictions desired among the electorate on MPs’ second jobs. he Green party and Labour have both proposed forbidding MPs from having a second job. However, an admittedly weak Labour-lead motion to do so was defeated by the coalition who voted against it by 287 to 219.\nWith 48 Tory (15%), 13 Labour (5%), and 8 Lib Dems (14%) MPs – and approximately 15% of the coalition’s MPs – having stakes in private healthcare firms, many people are asking themselves, ‘is it any wonder that the NHS is being slowly privatised?’\nPoliticians cannot be allowed to use their place in Parliament to serve themselves and their outside interests. To paraphrase Aneurin Bevan, the stalwart champion of the NHS, the politician’s primary role is to advocate for his or her constituents. With second jobs, politicians fail at the first hurdle to respect this cherished principle so central to democracy. This has only strengthened my drive and resolve to ensure that this change be made.\n‘People who like money too much ought to be kicked out of politics’, Uruguayan President José Mujica told CNN en Español in an interview posted online Wednesday.\n“We invented this thing called representative democracy, where we say the majority is who decides,” Mujica said in the interview. “So it seems to me that we [heads of state] should live like the majority and not like the minority.” This will undoubtedly resonate with many people who feel that their loss of living standards fails to be matched equally by that of politicians – who will be getting an 11% pay rise – bankers, CEOs, and the like.\nAs Labour move closer to the Conservatives, so much so that there is even talk of them forming a giant coalition if neither receives an overall majority, many are asking, are the Green Party becoming the party of the people? Does the Green Party provide the pluralism in British politics where the hues of red, blue and yellow all seem to have turned a collective black?\nUltimately it is up to the electorate to decide this – who else? But as your prospective Green Party candidate, I look forward to putting forward the solutions to these problems as voted upon by Green Party members, not large donors.\nRichard Stein has stated “Last week, after over 30 years of being a Labour party member, I left – and joined the Green party. The events of that week were the final straw for me. It had already become clear that the Labour party was never going to recover from the poison of Blairism and return to being the radical campaigning force for social change it once was.”",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_tag_thornbury-and-yate/content_19.html": "As we hurtle towards the most unpredictable general election anyone can remember I’d like to welcome you to my site as the prospective parliamentary candidate for the Green Party in Thornbury and Yate. Right now we’re shaking down the features and finding out what works and what needs to work better, but please check back frequently and I’ll endeavour to keep you up to date on the latest from the campaign trail.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_03_10_my-commitment-to-my-community/content_15.html": "I have just returned from a great Green Party conference in Liverpool this weekend. It was great to see so many people of all ages and backgrounds believing in the common good.\nPeople are now beginning to realise that the two party politics of the past is not fit for purpose, the present or the future.\nA vote for Green, is a vote for a fair and equal society and proportional representation. A vote for Green will give you an MP who votes for you and what you believe in, not what the party whip tells them to vote for.\nListening to Caroline Lucas talk about what happens in the House of Commons, or rather what doesn’t happen a lot of the time, made me realise, more than ever, that our community deserves an MP who will campaign for them and not big business, an MP that will fight fracking, an MP that will vote to end the bedroom tax, an MP that will fight to bring the railways back into public hands and improve public transport.\nThe government is looking to find a permanent solution for underground nuclear waste storage . The proposed dump site would store the waste for tens of thousands of years! I will fight to end Nuclear power. It supplies less than 20% of our power supply. We can replace this by investing in and by using renewables.\nNo reactors have been built since the 1980s, as accidents, spiralling decommissioning costs and the problem of nuclear waste, causes concern. The time to invest in renewables is now.\nOur public services are being cut to the bone while the wealthiest are receiving tax cuts. Corporation tax is at the lowest level for years and is now the same for large and small businesses. This makes it difficult for small business to compete.\nIn Wales, suicide rates are up 30% and yet we continue to cut vital services. Food prices up 22%, wages down 7%, 50% of all new jobs are self employed and yet 80% of self employed are living in poverty.\nI will follow Caroline Lucas’s example. I confirm that if I am elected as your MP and MP’s are awarded the 11% increase they are expecting in May, I will give every penny of this 11% raise to local charities within my community(£7600).",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_national-issues-2/content_11.html": "Structures for destroying the NHS\nIn 2012 the secretary of state’s legal duty to provide NHS services was severed and the structures for destroying the NHS were put in place. Today, with the general election around the corner, we are presenting a cross-party bill in parliament to stand up for the NHS we are all so proud of. The NHS that was such a defining part of our identity during the stunning opening of the 2012 London Olympics. The NHS that was ranked as one of the best health services in the world in a 2014 study.\nOur much-loved service is in danger. Thousands of jobs have been axed, including more than 4,000 senior nurses. More than 50 of the 230 NHS walk-in centres have been closed and 66 A&E and maternity units have been shut or downgraded. On top of this, the future mandated by the 2012 act is one where all hospitals in England that we think of as NHS hospitals only have to be 51% NHS – and 49% non-NHS. Why would anyone pay if they could get exactly the same on the NHS? This is setting up a queue-jumping service for the better-off.\nThe Hinchingbrooke fiasco shows privatisation is no answer to NHS woes.\nThe private sector is circling – there is, after all, a very tempting prize to be picked off – an annual NHS budget of £120bn. Private health firms already pocket £18m a day – that’s £6bn in the last year – from the NHS budget. More than 170 GP surgeries are run by corporations. Today, if you call 999 it could be a private ambulance crew that comes to treat you. Based on the trends that these figures show, private firms are on course to net £9bn of the NHS contracts that are up for grabs. The direction of travel is plain to see.\nThe inescapable truth is that the private sector is camping out on the lawn of the NHS, cherry picking. Even Norman Tebbit pointed out the dangers of this, and wondered how young NHS surgeons would learn if the private sector had nicked all the easy stuff. This is a problem that is getting worse, but it is not new. Private hospitals’ share of NHS-funded patients grew rapidly between 2006 and 2011. By 2010-11 private companies performed 17% of hip replacements, 17% of hernia repairs and handled 8% of patients’ first attendances in relation to orthopaedics or trauma, such as a broken limb.\nBut we know the private sector avoids the chronic long-term, complex conditions and, when it does try and take over, it fails – Hinchingbrooke hospital being the latest example. Last week, Michael Sheen rightly made a blistering NHS speech calling on anyone with any political power or influence to stand up and to fight for the equality, fairness and compassion that our NHS was founded on. The bill we present today, to reinstate the NHS, is an attempt to do just that. It is the culmination of months of hard work and consultation by campaigners, grassroots keep-our-NHS-public groups and health experts, led by Prof Allyson Pollock and barrister Peter Roderick.\nThat’s why our bill is guided by the principles of the National Health Service Act 1946, and reinstates the secretary of state’s duty to provide services throughout England. As it stands, without this duty and with the other 2012 changes it is now legal for NHS England to be whittled down to a core service. We are on the precipice. This is because, under the 2012 act, the list of services that foundation trusts must provide after April 2016 will be reduced.\nThe NHS must be the provider if it is to avoid being reduced to a set of bidding wars that leaves its heart hollowed out\nSenior health service managers from the NHS Confederation are already warning we may need “hotel fees” for hospital stays. Unless we act now, services will be restricted, people will go without care or will end up with private health insurance, charges or co-payments. The NHS reinstatement bill would put a stop to this once and for all, while also stopping costly market mechanisms that are frittering away NHS money that could be spent on patient care. Administering the artificial “marketplace” that has been created over the last 25 years is hugely wasteful.\nThe NHS must be the provider if our health service is to have coherence and avoid being reduced to a set of contracts and bidding wars that leaves its heart hollowed out and resources wasted. In March 2010, just before the last general election, the respected health select committee found that running the NHS as a “market” cost the NHS 14% of its budget a year.\nIn the pre-market late-80s, the NHS spent only 5% of its budget on administration. On that basis we are wasting 9% of a £120bn budget. That’s more than £10bn down the tubes. The committee concluded its report by saying that “after 20 years of costly failure, the purchaser/provider split may need to be abolished”. They were right then and the case remains ever more urgent today. As we present our bill, today also happens to be NHS Change Day celebrating the solidarity and co-operation in the NHS. Our bill is drafted to enable a grassroots, bottom-up reinstatement of a public NHS, guided by exactly those people sharing ideas and best practice today. Scotland has done it, so why can’t we?\nA national service has to be about whole systems, not isolated institutions. In 1946, Bevan and those who fought for and created our NHS did so following six years of toil and unimaginable sacrifice. What the founders of our NHS achieved was radical and far-reaching and they did it in the face of strong opposition. So can we.\nThe NHS bill 2015 is co-sponsored by Caroline Lucas, MP for Brighton Pavilion (Green), and Andrew George, MP for St Ives (Liberal Democrat).\nMaking public transport public\nWe believe that public transport should be run in the interests of passengers, not to make a quick profit for shareholders.\nThe privatisation of Britain’s transport network has done a huge disservice to passengers: driving up prices whilst creating a race to the bottom in service provision.\nIt’s clear that passengers are not getting a fair ride.\nWe will:\n- Return the railways to public hands to stop profits being put before passengers.\n- Introduce an immediate cut in fares of 10% to give passengers a much-needed financial break.\n- Promote walking and cycling to help reduce pollution and improve people’s health.\n– See more at: https://www.greenparty.org.uk/we-stand-for/better-transport.html#sthash.8Qy58x3o.dpuf\nQuality Education, No Tuition Fees\nWe want every young person to have access to a quality education, no matter what their family’s income.\nThat’s why we are opposed to the government’s privatisation and commercialisation of schools, colleges, and universities which is making access to a good education dependent on financial privilege.\nWe will:\n- Scrap university tuition fees.\n- Promote a comprehensive system of local schools offering mixed ability teaching staffed by qualified teachers.\n- Bring Academies and Free Schools into the Local Authority system.\n– See more at: https://www.greenparty.org.uk/we-stand-for/free-education.html#sthash.x9KXGrFB.dpuf\nFossil free, affordable energy\nThe traditional Westminster parties are failing to act as guardians of our planet.\nThey are putting our homes at risk of flooding and watching as native species are driven to extinction by temperature rises. Meanwhile they back the big corporations who are doing the most damage, allowing them to frack our countryside and pollute our air and waterways with their toxic waste.\nWe will:\n- Take serious action on climate change by working with other countries to ensure global temperatures do not rise beyond 2 degrees.\n- Phase out fossil-fuel based energy generation and nuclear power.\n- Invest in a public programme of renewable generation, flood defences and building insulation.\n– See more at: https://www.greenparty.org.uk/we-stand-for/safe-climate.html#sthash.hdXul8mt.dpuf\nSecure, affordable housing for everyone\nWe all want where we live to feel like home, to feel safe and secure.\nThe Coalition has made this more difficult by pushing through the hated bedroom tax for social tenants, allowing landlords free reign to raise rents faster than inflation, and failing to invest in the supply of housing so that homes are over-priced and out of reach for many.\nWe will:\n- Abolish the cruel and unfair bedroom tax.\n- Build 500,000 social rented homes by 2020 and bring empty homes back into use to ensure everyone has access to an affordable place to live.\n- Cap rent and introduce longer tenancies to provide greater protection for renters.\n– See more at: https://www.greenparty.org.uk/we-stand-for/decent-homes.html#sthash.WpeUCa3p.dpuf\nAn economy that works for all\nBritain is one of the wealthiest nations in the world but this wealth isn’t being shared fairly.\nWe currently have an economic system that prioritises growth in company profits over the wellbeing of society. This has seen money concentrated in the hands of a wealthy few; leaving the rest of us to suffer at the hands of the Coalition’s austerity agenda.\nWe believe there is a positive alternative to this mix of one-sided growth and austerity: an economy that works for everyone.\nWe will:\n- End austerity and restore the public sector, creating over one million good jobs that pay at least a living wage.\n- Pay for this with a new wealth tax on the top 1%, a Robin Hood Tax on the banks and the closure of tax loopholes.\n- Increase the minimum wage to reach a living wage of £10 an hour by 2020.\n– See more at: https://www.greenparty.org.uk/we-stand-for/fair-economy.html#sthash.Smgesus0.dpuf\nTaking back our health service\nWe know how important it is to have a health service that can provide the best possible care for you and your loved ones when you need it.\nWe don’t believe that the public’s health should ever be up for auction. That’s why we are completely opposed to the Conservatives’, Labour’s, and Liberal Democrats’ policies of introducing market forces and competition into the NHS – a process which is placing the interests of corporate profits ahead of the nation’s wellbeing.\nWe will:\n- Fight for a publicly funded, publicly provided health service free at the point of use.\n- End the creeping privatisation of the NHS and repeal the Health and Social Care Act 2012.\n- Make mental health a much higher priority with resources to match this status.\n– See more at: https://www.greenparty.org.uk/we-stand-for/public-nhs.html#sthash.FMPmxeXo.dpuf\nSupport the tax dodging bill\nThis is an extremely important issue that successive governments have failed to deal with. Only last week, Boris Johnson was reported in the media as having said that Boots’ Monaco-based Chairman Stefano Pessina had a “duty” to his shareholders to find ways of paying the lowest amount of tax possible.\nSince Boots went private, it has avoided paying £1 billion in tax according to some estimates. This sort of money could go on healthcare, education, the NHS and many other causes of utmost importance to the British public.\nThe loss of such revenue, which should be the duty of all, is having drastic effects on our society. An unacceptable number of hard-working, tax-paying people who played no role in the economic crisis are paying the price for the mistakes of a few.\nThey are disproportionately suffering because their access to social support has been cut to the bone. We cannot continue as a society where the rules of our social contract are adhered to by the many, and reneged upon by the few.\nI would therefore like to state unequivocally that I fully support not only this campaign, but the actual realisation of its goals irrespective of whether I am elected to Parliament or not.\nThe UK is “failing the environment” by falling behind on its renewable energy targets\nRecently released EU statistics revealed that renewable energy made up 5.1% of the UK’s total gross energy consumption in 2013, an increase of just 4% since 2004, and without a dramatic increase in renewable energy, the figures suggest that the UK is unlikely to meet its 2020 renewable energy target of 15%.\nOnly Luxembourg, Malta and the Netherlands had smaller proportions of renewable energy than Britain. Sweden was found to be the most renewable-friendly EU member state, with over half of its energy coming from renewable sources.\nBaroness Jenny Jones, a Green Party politician in the UK and a member of the House of Lords, says the figures are unsurprising given the current government’s energy policy.\n“The UK’s share of energy from renewables is woeful, but not altogether surprising given the prime minister’s and the mayor of London’s enthusiasm for fracking and a new generation of nuclear,” says Baroness Jones.\nShe adds that for the UK to have a sustainable future, the government must shift its focus to renewable sources such as solar, tidal and wind energy. “Maintaining fossil fuel interests is redundant and ultimately self-defeating,” she says.\nGreen Party energy spokesman Andrew Cooper adds: “It’s derisory. It shows that the [so-called] greenest government ever is anything but and that UK energy policy is failing the environment.”\nHowever, a spokesperson for the Department of Energy and Climate Change (DEEC) said that Britain could still hit its targets. “The UK is making good progress towards the EU 2020 target on renewables. The UK was in line with the first EU interim renewable energy target for 2011/12 and is firmly on course for the next one in 2014/15.”\nThe DEEC spokesperson added that around £50bn of investment in renewable projects was expected by 2020 and that the UK government was supporting the development of advanced biofuels, which are produced from biomass and have low CO2 emissions, with £25m of funding.\nThe UK recently fell to its lowest position in 12 years on Ernst & Young’s, renewable energy country attractiveness index, which ranks nations on their ability to gain investment for renewable projects. The report said that confusion over the UK’s contract for difference scheme, in which which green energy providers bid for the the lowest guaranteed price they would accept for power they supplied to the national grid, had affected investor confidence.\nIn the Netherlands, the renewable share of total energy consumption was 4.5% in 2013. The country’s target for 2020 is 14%. A spokesperson for Henk Kampf, the Netherlands’ minister of economic affairs, says that the government believes it will meet its 14% target by 2020, but didn’t indicate how they would do this.\nAs well as being one of only three EU members to meet their 2020 targets already, Sweden is the only state to reach the 10% renewable share of transport fuels.\nThe Swedish minister for energy, Ibrahim Baylan, said that the country’s long-term ambition was to become 100% renewable.\nBaylan said: “We have such different circumstances for renewable energy, so each country has to find their solutions. But I think the key to success for all is to take a holistic approach to energy – to simultaneously watch the supply and distribution of energy as well as the demand and markets to get effective solutions.”\nhttp://www.newsweek.com/uk-falling-woefully-behind-renewable-energy-target-313124\nStructures for Destoying the NHS\nIn 2012 the secretary of state’s legal duty to provide NHS services was severed and the structures for destroying the NHS were put in place. Today, with the general election around the corner, we are presenting a cross-party bill in parliament to stand up for the NHS we are all so proud of. The NHS that was such a defining part of our identity during the stunning opening of the 2012 London Olympics. The NHS that was ranked as one of the best health services in the world in a 2014 study.\nOur much-loved service is in danger. Thousands of jobs have been axed, including more than 4,000 senior nurses. More than 50 of the 230 NHS walk-in centres have been closed and 66 A&E and maternity units have been shut or downgraded. On top of this, the future mandated by the 2012 act is one where all hospitals in England that we think of as NHS hospitals only have to be 51% NHS – and 49% non-NHS. Why would anyone pay if they could get exactly the same on the NHS? This is setting up a queue-jumping service for the better-off.\nThe Hinchingbrooke fiasco shows privatisation is no answer to NHS woes\nTom Clark\nTom Clark Read more\nThe private sector is circling – there is, after all, a very tempting prize to be picked off – an annual NHS budget of £120bn. Private health firms already pocket £18m a day – that’s £6bn in the last year – from the NHS budget. More than 170 GP surgeries are run by corporations. Today, if you call 999 it could be a private ambulance crew that comes to treat you. Based on the trends that these figures show, private firms are on course to net £9bn of the NHS contracts that are up for grabs. The direction of travel is plain to see.\nThe inescapable truth is that the private sector is camping out on the lawn of the NHS, cherry picking. Even Norman Tebbit pointed out the dangers of this, and wondered how young NHS surgeons would learn if the private sector had nicked all the easy stuff. This is a problem that is getting worse, but it is not new. Private hospitals’ share of NHS-funded patients grew rapidly between 2006 and 2011. By 2010-11 private companies performed 17% of hip replacements, 17% of hernia repairs and handled 8% of patients’ first attendances in relation to orthopaedics or trauma, such as a broken limb.\nBut we know the private sector avoids the chronic long-term, complex conditions and, when it does try and take over, it fails – Hinchingbrooke hospital being the latest example. Last week, Michael Sheen rightly made a blistering NHS speech calling on anyone with any political power or influence to stand up and to fight for the equality, fairness and compassion that our NHS was founded on. The bill we present today, to reinstate the NHS, is an attempt to do just that. It is the culmination of months of hard work and consultation by campaigners, grassroots keep-our-NHS-public groups and health experts, led by Prof Allyson Pollock and barrister Peter Roderick.\nThat’s why our bill is guided by the principles of the National Health Service Act 1946, and reinstates the secretary of state’s duty to provide services throughout England. As it stands, without this duty and with the other 2012 changes it is now legal for NHS England to be whittled down to a core service. We are on the precipice. This is because, under the 2012 act, the list of services that foundation trusts must provide after April 2016 will be reduced.\nThe NHS must be the provider if it is to avoid being reduced to a set of bidding wars that leaves its heart hollowed out\nSenior health service managers from the NHS Confederation are already warning we may need “hotel fees” for hospital stays. Unless we act now, services will be restricted, people will go without care or will end up with private health insurance, charges or co-payments. The NHS reinstatement bill would put a stop to this once and for all, while also stopping costly market mechanisms that are frittering away NHS money that could be spent on patient care. Administering the artificial “marketplace” that has been created over the last 25 years is hugely wasteful.\nThe NHS must be the provider if our health service is to have coherence and avoid being reduced to a set of contracts and bidding wars that leaves its heart hollowed out and resources wasted. In March 2010, just before the last general election, the respected health select committee found that running the NHS as a “market” cost the NHS 14% of its budget a year.\nIn the pre-market late-80s, the NHS spent only 5% of its budget on administration. On that basis we are wasting 9% of a £120bn budget. That’s more than £10bn down the tubes. The committee concluded its report by saying that “after 20 years of costly failure, the purchaser/provider split may need to be abolished”. They were right then and the case remains ever more urgent today. As we present our bill, today also happens to be NHS Change Day celebrating the solidarity and co-operation in the NHS. Our bill is drafted to enable a grassroots, bottom-up reinstatement of a public NHS, guided by exactly those people sharing ideas and best practice today. Scotland has done it, so why can’t we?\nA national service has to be about whole systems, not isolated institutions. In 1946, Bevan and those who fought for and created our NHS did so following six years of toil and unimaginable sacrifice. What the founders of our NHS achieved was radical and far-reaching and they did it in the face of strong opposition. So can we.\nThe NHS bill 2015 is co-sponsored by Caroline Lucas, MP for Brighton Pavilion (Green), and Andrew George, MP for St Ives (Liberal Democrat).",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_07_09_the-social-housing-crisis/content_3.html": "The social housing crisis.\nCouncil housing in Britain emerged in 1919 as a result of tenants, unions, and socialist and Labour groups and organisations demanding ‘municipal’ housing. Housing that would sweep away the appalling slums and ‘rookeries’ meant that in 1919 in many cities and towns 200 infants out of every 1000 died at birth or in their first year. (Today the figure is around 7 in every 1000).\nFred Knee, secretary of the Workers National Housing Council in the 1890’s, said: “It is not the housing of the poor, but the housing of the people by the people themselves, that we must work for – not the herding into slums for the benefit of private enterprise, not the crowding into barracks in order to provide interest for municipal bondholders, but by a feasible honest system and plan.”\nIn the late 70’s private landlords had all but gone. Since the Housing and Town Planning Act 1919 the number of council houses had steadily risen for over fifty years and council tenants could only buy their home with the permission of their local authority. The Conservative party under Margaret Thatcher had promised in their manifesto for the general election of 1979 to give council house tenants the ‘legal right to buy their The Conservatives soon abandoned support for council housing and switched to their traditional support for private rents. Between 1953 and 1957 they started to take away council subsidies, encouraged sales and ended many rent controls in the private rented sector – the effect was Rachmanism. (The exploitation and intimidation of tenants by unscrupulous landlords.)\nIn 1959 Conservatives in Camden trebled rents on their pre-war estates and doubled rents on more recent houses. Thirty-five tenants groups protested and 2000 tenants went on rent strike.\nRacism flourished with a ‘black tax’ in the private rented sector with rents up to four times ‘white tenants’ rents. By 1964, white tenants were 26 times more likely to get a council tenancy than black tenants.\nIn 1951 45% of people rented privately 18% were in council homes. Labour councils continued to build and to resist the pressure to put up their rents. By 1960 home ownership (45%) and council housing (27%) was reducing private landlords (26%). The Tories had reduced national council building completions to only 10,000 by 1961.\nHome ownership grew from 55% of the population in 1980 to 64% in 1987. By the time Margaret Thatcher left office in 1990 it was 67%. 1.5 million council houses were sold by 1990, by 1995 it was 2.1 million and as a result of the Right to Buy the Treasury received £28 billion. Proponents of the Right to Buy argue that it gave working-class council tenants opportunities to get on the property ladder which they would not otherwise had had without the Act.\nTony Belton, a Labour councillor in South West London claimed that: “Speculators have made millions out of exploiting public assets.” In March 2013 the Daily Mirror reported that Charles Gow, the son of Mrs. Thatcher’s housing minister, Ian Gow, bought 40 of the 120 former council flats in one housing project in Roehampton, in South West London.\nBy 2013, some tenants who had purchased their council flats sold them later to speculators, investors or property companies. By 2013, a one-bedroom council flat that sold for £50,000 in the early 1990s, for example, had a market price of £250,000. A tight housing market led to increased rent as construction of new homes decreased.\nSo in 1919 council houses were built to house the people and to stop private enterprise from benefiting, and yet now we have seen a massive decline in the amount of social houses being built and rents sore as private enterprise profits.\nWhy have we gone back in time to the 1900’s? The gap between the richest and the poorest is also at the same levels as it was in Victorian times, why?\nOur Government complains about the cost of housing benefit but where I live housing benefit is £95 per week for a two bedroom social housing house (10% of houses in South Gloucestershire) but it is £145 per week if you rent privately. So having so many private landlords (15% of houses in South Gloucestershire) has caused the huge housing benefit budget. Therefore, instead of building more social houses and reducing the housing benefit budget bill, what does this government do?\nThey want to increase social housing rent to market value. George Osborne has decided that we should all pay more, Whitehall sources say social housing tenants on higher incomes benefit by an average of £3,500 a year from reduced rent.\nSo while the Chancellor will confirm the end of inheritance tax on family homes worth up to £1million, and is under mounting pressure from Tory MPs to further cut the top rate of tax from 45p to 40p.\nThe Chancellor is also expected to slash in-work tax credits – mainly child tax credit – as he moves to save £12billion. Firms will be encouraged to raise wages to make up the shortfall, and the Government has abolished targets to cut child poverty and campaigners fear cutting child tax credits will hit the poor hardest.\nYou have to ask yourself vote next?\n‘I think the gov use the word ‘subsidise’ to make it sound like social housing tenants are all a bunch of welfare-grabbing scrounges’ was a quote from a friend of mine.\nSo is social housing really subsidised? There is some very small scale subsidy of new homes for housing associations – and councils can borrow a limited amount of money at a more favourable rate to build. But both of this is pretty negligible in the grand scale of things. We have not seen councils rushing to borrow/build and what is left of the housing association grant will be gone shortly.\nCouncils also used to get a small grant from the government if the cost of maintaining the homes was greater than a certain proportion of their income but I am not sure if the push towards developing and maintaining homes at what the government deemed to be a ‘Decent Homes’ level ended this, as if councils could not meet this standard they were encouraged to go down the transfer route to become either a housing association or an Arms Length Management Association (ALMO). So not really, all house building subsidy for housing associations will end in 2017.\nIn terms of how much housing associations charge for rent, this is set by a government formula (based on the average blue collar wage for an area/market rent) and governments have been encouraging councils and housing associations to charge the same rent for the same size property in the same area (this convergence, which saw some rents rise and others fall, had largely, but not totally, happened by 2012 and has now been abandoned). So they now have ‘standard’ rents, based on the formula above – and the so-called affordable rents (which they have to use if they take the grant) which is 80% of the local market rent.\nWhen the Government say that the welfare state is 54% of our overall budget and we must reduce it: remember that the 54% includes pensions (21%) and healthcare (18%), it is not all benefits and tax credits, the Government are very good at saying something but leaving it open to your interpretation.\nWhen they say welfare state, many think of jobseekers or the unemployed, but it also includes tax credits. Tax credits, which top up the wages of people on low incomes, were a flagship policy introduced by Gordon Brown when he was Chancellor. They now cost about £30bn a year.\nIf we had a living wage the welfare state costs would come done on their own, no housing benefit or tax credits for millions.\nThis Government talks about getting people back to work or owning your own home. All feel good factors that make people feel good about doing their bit towards society but people’s health is suffering as they do not feel good as a result of being labelled a scrounger or buying their own home and then the pressure of losing it as wages stagnate.\nThe Conservatives are the masters at saying one thing and doing another: they blame the poor and the sick for the mistakes of the rich and wealthy.\nA returning Tory government, with a right wing agenda, which included forcing ‘fair (private market) rents’ on council tenants. – Ted Health, 1970.\nSound familiar? George Osbourne 2015.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_tag_thornbury-yate/content_20.html": "As we hurtle towards the most unpredictable general election anyone can remember I’d like to welcome you to my site as the prospective parliamentary candidate for the Green Party in Thornbury and Yate. Right now we’re shaking down the features and finding out what works and what needs to work better, but please check back frequently and I’ll endeavour to keep you up to date on the latest from the campaign trail.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_2015_04_06_are-we-better-off-after-5-years-of-austerity/content_9.html": "The coalition promised to get rid of the deficit – they haven’t.\nThere are currently 1.2 million people on the social housing waiting-list. And yet the government, through its right-to-buy scheme, is destroying the social housing stock, collectively costing us £600m per year so that we can prop up a failing housing market.\nThe national debt has doubled as George Osborne has borrowed half a trillion pounds. Rather than addressing the spiralling debt, he has opted to give tax breaks to the wealthiest and to hedge funds which, coupled with stagnated wages, has resulted in the sharp drop in tax receipts.\nFurthermore we have seen an attack on the welfare system like never before which belies the fact that pensions make up 46%, and Job Seekers Allowance a mere 3%.\nFor comparison, benefit fraud (which includes ‘errors’ as well as intentional fraud) accounts for less than 1% of the UK benefits bill according to the Citizens Advice Bureau. Far more is lost through tax evasion and avoidance, but the government cut the HMRC staff dealing with this. Need I say more?\nFew seem to be worried about where the Tories have borrowed the £400 billion from and doubled our national debt.\nAs a society we really need to ask ourselves: is getting rid of the national debt worth risking the lives of those most vulnerable – pensioners, disabled, sick, unemployed – in our society? Is there a better way in which we can reduce the debt without risking such people?\nI also include soldiers who have risked their live fighting for our country; but many of whom now find themselves homeless in our streets or subjected to benefit sanctions. How can anyone who risks their life fighting for our country return home and be left homeless and hungry is beyond me.\nWe need to stop HS2 (over £100 billion), stop the £15 billion spending on new motorways, stop subsidies to nuclear energy and Fracking, cut this government’s waste and implement a fairer tax system. What about the £30b of National Insurance surplus funds that the Coalition refused to spend either on welfare for the vulnerable or to reduce the national debt?\nIn another indication of what a future Tory government will be like, Osbourne recently announced that they will look to cut the welfare state by another £30 billion each year for the next 3 years(without specifying how, what and where), which will leave a surplus of £12 billion,(deficit is £78b) why? Could it be because they need that to fix up Westminster?\nYou cannot fight the system from outside, you can only try and change it from within. The more Green Party MPs we have with help from other progressive parties such as Plaid Cymru and SNP, the more we can change.\nGreen Party MPs will try and change it for the benefit of the people and not the bankers and corporations who have had their bail outs – now it is time for ours.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_tag_green-party/content_23.html": "As we hurtle towards the most unpredictable general election anyone can remember I’d like to welcome you to my site as the prospective parliamentary candidate for the Green Party in Thornbury and Yate. Right now we’re shaking down the features and finding out what works and what needs to work better, but please check back frequently and I’ll endeavour to keep you up to date on the latest from the campaign trail.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_local-issues-2/content_6.html": "Now the election has gone.\nYour local Thornbury and Yate Green party wants to be involved in any local issues you feel we can help you with. We can work with our local community to raise local issues and support other groups within Thornbury and Yate.\nIf you are involved with a local group and feel that we can help please get in touch and we can work together to help each other.\nHOUSING within South Glos\nDecades of failed housing policies have left a legacy of mounting shortages, unaffordability and deteriorating quality for millions, not least in South Gloucestershire. According to campaign groups, trade bodies, national organisations, local authorities and housing organisations, the UK needs more decent, affordable homes, across all tenures – circa 245,000 per year for the next ten years – and they are calling on the next government to address this as a matter of priority. The Green Party of England and Wales (GPEW) is strongly committed to addressing this issue.\nLoss of Social Housing – there is not enough housing being built and rising rental prices is putting unbearable strain on social housing. It is a real, UK-wide social housing crisis. The Right to Buy scheme enabled secure tenants of council housing to purchase their homes at a heavily discounted price was understandably popular tenants; but the majority of capital released had to be paid to the Treasury, resulting in a massive net loss of 17,000 social rented homes, with little income to replace these.\nAs your local Green Party Candidate I will commit to:\n- Removing councils’ borrowing caps to enable the building of 500,000 social housing (It is predicted that £300m from the housing benefit bill will be saved as people move out of private rented homes into more affordable socially rented homes)\nAccommodation Shortage – according to the Joint Strategic Needs Assessment, Staple Hill, Kingswood, Patchway, Filton, Cadbury Heath and Yate/Dodington are classed as ‘priority neighbourhoods’ within South Gloucestershire. Whilst 23,365 houses have been planned to be built by 2017, there will not be enough built to provide for all those in need of affordable and social housing.\nIn South Gloucestershire, there are currently 10,073 live applications on the Housing Register as of March 2012. Around one in nine children and young people live in poverty (defined as household income less than half the national average).\nThe shortage of accommodation has been compounded by changes to the provision of social benefits under the coalition. For example, the Bedroom Tax is requiring tenants who can least afford it to pay for their ‘spare’ bedroom, which might not be spare to them, nor did they initially have a choice in the first place. This is leaving them with few places to relocate. Housing insecurity has also risen for other renters in the private sector.\nAs your local Green Party Candidate I will commit to:\n- Reviewing the Joint Strategic Needs Assessment for the South Gloucestershire area.\n- Ending the ‘Right to Buy’ policy\n- Investing £19.5bn over the course of the next parliament (from money taken from the buy-to-let interest relief currently paid to private landlords)\n- Extended tenancies\nAffordability – many UK residents – especially the young – now find it increasingly difficult to buy a home or rent accommodation due to rising prices (renting can be more expensive than buying per month expenditure), stagnant or falling wages, punitive interest rates on saving accounts and an inability to save for deposits as increasing proportions of wages go on housing,\nThe combination of higher housing costs and lower incomes has contributed to an extra 3.1 million people being put into poverty after paying their housing costs. The housing benefit bill has risen by 150% over the last 21 years and in the last 5 years the proportion of housing benefit claimants in work has more than doubled to 22.5%. Planned welfare reform is likely to increase this poverty.\nIn South Gloucestershire, 27% of households receive one or more social benefits compared to the national average of 21% (Housing Stock Condition Survey 2012), whilst the average house price is £176,031 compared to the national average of £162,08. This has resulted in more and more people registering for social housing that is not being currently built.\nAs your local Green Party Candidate I will commit to:\n- Making empty houses available for use (2,100 homes in the private sector are currently empty – 2% of private housing)\n- Establishing rent controls and caps to help renters and requiring landlords to possess a licence\n- Bringing in the living wage with the long term goal of the Citizens’ Income to ensure people have the financial means to afford accommodation\n- Legislating for better rental conditions and ensuring existing legislation concerning minimum standards of rental accommodation are enforced.\nOthers:\n- Transitioning to a low carbon economy based on renewable energy sources\n- Abolishing the Bedroom Tax\n- Increasing public spending to about 45% GDP (Germany already gives 45% of its GDP to public spending; Denmark spends 58%)\n- Campaigning for a shift in perspective on housing by reducing the current aspiration for owning\n- Opposing zero-hour contracts to ensure job security\n- Bringing in a new Higher Council Tax for more expensive homes, and a higher rate for empty homes\nGreen light for £5 million redevelopment of village housing\nA multi-million pound project to redevelop 450 homes in South Gloucestershire is set to begin after receiving planning permission for the first phase.\nMerlin has been given the go-ahead to build 39 homes in Coalpit Heath to replace 18 non-traditional properties and a rank of garages. The properties are in Newlands Avenue and Oldlands Avenue and were built after the Second World War as a quick solution to the housing shortage. But they are now suffering from a number of issues including damp and draughts.\nThe 39 properties are the first of up to 850 new homes Merlin plans to build over the next eight years to replace 450 non-traditional properties.\nProject Manager Sally Gilbert said: “We’re thrilled to have been given the go-ahead to start building these much-needed new homes. These stunning new homes will provide brand-new affordable housing in the village. We’ve already demolished most of the existing properties so we’re hoping to get the building work started as soon as possible, so that the residents can move into their new homes next spring.\n“We’re also pleased to announce that we’ve appointed affordable housing specialists Lovell to build the first homes in the programme. They have a great track record of working with housing associations delivering projects like this and we were really impressed with their commitment to customer service as well as the quality of the homes that they build.\n“This is just the start of a huge programme of redevelopment, which is the biggest project we’ve ever undertaken. We’ve also just received permission to redevelop 18 properties in Iron Acton as well and will be starting work on this site next year.”\nThe £5.2m first phase of the redevelopment programme will see the 18 existing properties replaced with a mixture of one and two bedroom flats, two and three bedroom houses and a two bedroom bungalow, specially designed for a wheelchair user.\nPart of the funding for this phase of the project is coming from the Homes and Communities Agency, which awarded Merlin £2.4m under its Affordable Homes Programme.\nMerlin also recently submitted applications to redevelop two final sites in Coalpit Heath in Newlands Avenue and the block of garages in Coalville Road. In total the housing association is planning to build 84 new homes in the village in the next two years.\nNew houses proposed in Olveston\nIt appears this proposal has been going for some time and is in the very early stages.\n”The Olveston Parish Vision Group has discovered, through questionnaire responses from Olveston parish residents, that local people are identifying a need for affordable housing in the parish. 355 questionnaires were returned, a response rate of 43% of households in the parish. Of these respondents, 72% said there was great or some need for more houses for first time buyers, 54% would like to see provision of affordable housing and 61% said they would like to see specific housing provided for elderly people.”\nI have 3 links for you to find information:\nhttps://consultations.southglos.gov.uk/consult.ti/CoreStrategy/viewCompoundDoc?partid=444020\nClick to access hca%20affordable%20homes%20programme%202015-18.pdf\nhttp://www.olveston.com/community-land-trust\nStage one was the Parish survey which identified a need for housing in Olveston. Stage 2 is a housing need survey which has not been carried out as yet. Unless there is land within the boundaries of Olveston any new houses will need to be built outside the settlement boundary, this would require:\nPOLICY CS19 – RURAL HOUSING EXCEPTION SITES\nSmall scale proposals for permanent affordable housing to meet an identified local need will be permitted as an exception on sites within or adjoining the settlement boundaries of villages defined on the Proposals Map, or on sites that are well related to villages that have defined settlement boundaries.\nProposals should be supported or initiated by the appropriate parish council.\nPermission will be subject to conditions, or a legal obligation will be negotiated, to ensure such housing is reserved in perpetuity for those in local affordable housing need.\nI must also add that if the site is allowed to be built, stage one will only be open to those who have a connection to the local area, so ideal if you have children who wish to live close to you when they move out. It will then cascade out through local areas.\nI hope you find this information useful and inform others in Olveston of these facts.",
  "https_iainhamiltontandy_wordpress_com_/https_iainhamiltontandy_wordpress_com_about-me/content_18.html": "My name is Iain Hamilton and I live in Thornbury.\nI was proud to stand as your Green Party parliamentary candidate. I believe in honest politics. If you have attended any of the hustings we have had over the election campaign you will know, I speak from the heart and not afraid to speak my mind.\nI do not trust politicians to do what is best for the people, that is why I decided to stand for parliament. I trust myself.\nPeople are now beginning to realise that the ‘two party politics’ of the past is not fit for purpose, the present or the future. Reform is coming both to the Commons and the Lords.\nThe Green party is a party of the many, not the few. A Green vote is a vote for a fairer government, not a government of big business. I want to protect our NHS, the young and the old, stop privatisation of public services, stop fracking, TTiP and improve our public transport.\nOur community deserves an MP who will campaign to end the unfair attacks on the poorest in our community. End the bedroom tax and benefit sanctions, I will support those trying to find work, not demonise them. I will fight for a living wage, not a minimum wage. I want an end to austerity!\nOur public services are being cut to the bone while the wealthiest are receiving tax cuts. The richest 1000 have doubled their wealth in the last 10 years. Corporation tax is at the lowest level for years and is now the same for large and small businesses. This makes it difficult for small business to compete.\nWithin hours of the Conservatives winning the general election Teresa May said that the Snoopers charter was back on the table as the Lib Dems had blocked it. This week they have proposals drawn up include;\n- Withdrawing Housing Benefit from the under 25 age group,\n- Reducing Housing Benefit by a flat 10% cut across all claims,\n- Freezing benefit rates for three years and limiting claims payments to a maximum of three children.\n- A cut in the benefits cap from £26,000 to £23,000 was highlighted in the election campaign as one of the first changes the new Government will do.\n- Under occupancy / “the bedroom tax” may be extended.\n- The removal of the OAP bus pass.\n- Over-75s would also have to fork out £145 for TV licences.\n- End the winter fuel allowance for OAP’s.\nMr Duncan Smith’s move finally destroyed any claim the party had to being caring Conservatives, it flies in the face of David Cameron’s election pledge to rule out cuts to pensioner benefits. Mr Duncan Smith, whose flagship Universal Credit policy is in chaos, said the Government was discussing whether to put OAP payments into a wider Whitehall cap on welfare spending.\nThe Green party will continue to stand up to these Tory attacks and and ask why not raise taxes just a little to help clear the debt that the rich created?"
}