{
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk_news_category_Opinions/content_3.html": "My Three Vital Questions For The Leadership Candidates 6th August 2024 Just over a month ago, both Conservative seats in Southend turned red for the first time ever. As the penultimate Conservative MP to join the last parliament, I... Opinions\nA clear win for Birbalsingh and a victory for common sense 21st April 2024 This article was commissioned by GB News on 19th April 2024. I recently wrote about how to bring back respect to our schools. As I put pen to paper, the person... Opinions\nLabour’s Unashamed Hypocrisy Is Laid Bare By Rayner’s Tax Troubles 12th April 2024 You reap what you sow. In a week where the Labour Party have outlined their plans to crack down on tax dodgers, Angela Rayner and the Labour party are starting... Opinions\nBringing back respect in our schools 8th March 2024 This article was commissioned by GB News on 8th March 2024. Respect is an overused word nowadays, it’s often bandied around in terms of people keen on asserting... Opinions\nNobody wants to admit the scale of the Islamist extremist threat to our democracy 25th February 2024 This article was written for the Sunday Telegraph on 25th February 2024. In 2021, Sir David Amess was stabbed to death by an Islamist extremist who targeted him... Opinions\nKeeping our children safe from online harm. Bridging the gap between now and the online safety bill. 20th February 2024 Whose job is it to protect our children from online harm? That is the sixty-four-thousand-dollar question. Is it the tech companies? Schools? The Government... Opinions\nNext Prime Minister Survey 12th July 2022 We now need a new Prime Minister and Leader of the Conservative Party. It is now in my fellow Conservative Members of Parliament's hands in which two candidates... Opinions\nAnna aims to make Southend City of Culture 2029 and needs your help 28th June 2022 Anna is aiming to make Southend the City of Culture for 2029. City of Culture status gets awarded every four years, and the successful bidder hosts cultural... Opinions\nLet's continue Sir David Amess's work 20th December 2021 Southend West needs a local champion to build on Sir David Amess’s legacy. And I have a plan to do just that - putting our area first. Sir David fought for... Opinions",
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk_news_rise-far-left-britain-should-we-be-worried/content_6.html": "This article was commissioned by GB News on 22 March 2024.\nFar-left politics in the United Kingdom have existed since at least the 1840s, with at least one historian has identified the existence of a 'far left' in England as early as the 1640s. But is the far left on the rise in Britain?\nNo. The far left remains as irrelevant as they always have been, but what has changed is that they are becoming increasingly vocal and increasingly aggressive. It started with groups like Just Stop Oil, Extinction Rebellion, Greenpeace and Black Lives Matter, who attempt to mask their more sinister intentions with a cloak of social justice, are becoming more vocal and more prolific. But they are still on the fringe of politics in Britain and show no signs of changing.\nWe have all seen the acts of these groups, XR activists have created all kinds of public disruption, including blocking road access for ambulances in the heart of London, and disrupting commuter journeys in the capital. Greenpeace have scaled the Prime Ministers house, and Just Stop Oil are obsessed with destroying art. The anti-democratic behaviour and disrespect for the rule of law, displayed by these groups has a huge part to play in undermining important social causes such as environmental protection.\nBut with the current situation in Gaza there is now a dangerous and volatile alliance between fringe far left and Islamist groups at pro-Palestine marches across the UK, creating a melting pot of extremism. The Government’s own independent adviser on political violence and disruption, Lord Walney, has called on ministers to tackle this growing threat because they truly do threaten our democracy.\nAnd what is done at these protests to prevent the extremists? Nothing. While the debate went on in Parliament on the SNPs ceasefire motion, protesters gathered outside chanting From the River to the Sea and even projecting those words onto the walls of Parliament. Those words have been described by the Campaign Against Anti-Semitism as “genocidal language” and while they chanted it unrepentantly, they were watched on by dozens of police officers who stood by and let it happen.\nBut what is also clear is that the far left has no real electoral ambitions. Yes, George Galloway has won election to Parliament under “shock” circumstances three times now, but the reality is that the man is not far left, he is an out and out populist, promising the voters what they want to hear and when he fails to deliver and gets voted out, he will drift off back into the ether. The real far left have no desire to maintain our democratic institutions, they are more than willing to break the law, intimidate MPs and hijack legitimate protests in order to get their way.\nBut do they really need to aim for elected office when the “soft left” Labour Party are more than willing to serve as their whipping boys? A number of their elected representatives seem perfectly\nhappy to condone or even endorse the actions of these groups emboldening them and giving them political cover to continue. You just have to look at Starmer’s decision to restore the whip to Andy McDonald to see that the party has not changed under his leadership. Time and time again they will side with the far left for fear of being accused of turning their backs on social justice, but that is simply not a sustainable position. These groups should be isolated, denied the chance to gain political respectability and prevented from infiltrating legitimate causes for their own ends. The Prime Minister made this clear in his speech on the steps of Downing Street, and it is only by keeping him in Downing Street that we will stop Starmer letting the far left take residence through the back door.",
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk_news_and-were/content_8.html": "Today, Friday 24th May 2024, I officially launched my General Election campaign with the backing of my fantastic team of supporters.\nI genuinely enjoy getting out and about, meeting people, learning more about this beautiful seaside city, and listening to what residents have to say about where we live. I've been here to help you all in my two years as your MP and if you re-elect me, I'll continue to do just that.\nIt's a delight to have a strong team who are equally enthusiastic about pounding the pavements - come rain or shine - and getting out our message of my pledge to continue to make Southend safer, healthier and wealthier.\nIf you see us, please come and say hello! If you'd like to join us, please drop us a line via our website: www.southendwestconservatives.com",
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk/content_1.html": "😁 On Tuesday, May 5th 2022, I made my maiden speech to the House of Commons! 🗣️\nI spoke about Southend's history, Sir David's legacy in causes like The Endometriosis Foundation and Dogs Trust, my passion for education, the importance of our healthcare Southend University Hospital NHS Foundation Trust, my belief in equality of opportunity for all in schools like Westcliff High School for Girls (where my mother went!), Southend’s nation-leading charities like The Music Man Project Essex & Prost8UK and our brilliant local businesses like tappdcocktails 🥂😁 all of which I made sure to mention in my speech!\nI've considered it a privilege to be the Member of Parliament for Southend West when I was first elected in 2022 but as I made my speech it really hit home: to be able to stand up, pay tribute to Sir David Amess and celebrate everything that's incredible about our city was just amazing! 😊\nMaking this speech meant I could take part in debates, table motions and much more! I am committed to getting on with the job of making Southend safer, healthier and wealthier for all! 🙌",
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk_news_statement-thanks/content_2.html": "I would like to thank everyone in Southend West & Leigh who has contacted me since Friday or supported me over the last two and a half years. It has been a huge privilege to serve our new City in Parliament and to uphold and honour Sir David’s legacy. I would like to congratulate David Burton-Sampson on becoming the next member of Parliament for Southend West & Leigh, it is one of the best jobs in the world.\nI am proud of what we have achieved together. The work we’ve done will benefit the people of Southend West & Leigh for years to come.\nA much-needed, new A&E is under construction at the Hospital along with two new operating theatres, a new endoscopy suite and a new LINAC radiotherapy machine for targeted cancer therapy. Both Kingsdown and Blenheim Primary schools will be substantially up-graded, hugely benefitting children with special educational needs and local families. A new clam fishery will start-up in the Estuary in October providing extra income and opportunities for our fishermen, along with £15 million of improvements to Old Leigh Port.\nWe’ve also got £104 million of investment coming to reduce storm overflows and clean up our waters.\nFinally, our pets will be better protected under my Pet Abduction Act and changing the law to outlaw nitrous oxide and zombie knives will make our sea-front safer.\nI am proud to have played my part in delivering these things for our City, as well as always being on hand to help and support Southend United Football Club whenever needed.\nHowever, the people of Southend & Leigh have now clearly chosen to go in a different direction and I wish David Burton-Sampson every success in representing our City in Parliament.\nI would like to say an enormous thank you to my family for all their amazing support, particularly my husband Edward, and also to my wonderful team, who have given everything (more than can ever be described) to Southend West & Leigh over the last 2 and a half years. I would also like to thank my agent, Owen Cartey, and my Association for working tirelessly, not just the last 6 weeks, but all the year round.\nFinally, a heartfelt thank you to all Conservative and non-Conservative voters who took the trouble to go and vote for me yesterday. It is truly humbling and thank you again for the opportunity to serve.\nI look forward to seeing you all soon and I fully intend to continue standing up for local people, against injustice and for Conservative principles of freedom, fairness, aspiration and opportunity.",
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk_news_my-op-eds/content_4.html": "Many people have contacted me and asked for my opinions on some of the current issues and topics facing society today. As such, I thought it would be sensible to put all the various Op-Ed's I have written in one place to ensure readers can find them all with ease.\nNational Service:\nWhy I support bringing back National Service | Anna Firth\nMichaela Birbalsingh and Common Sense:\nA clear win for Birbalsingh and a victory for common sense | Anna Firth\nAngela Rayners Taxes:\nLabour’s Unashamed Hypocrisy Is Laid Bare By Rayner’s Tax Troubles | Anna Firth\nRise of the Far Left in Britain:\nRise of the far-left in Britain - should we be worried? | Anna Firth\nBringing Back Respect in Our Schools:\nBringing back respect in our schools | Anna Firth\nNobody Wants to Admit the Scale of the Islamist Extremist Threat to Our Democracy:\nNobody wants to admit the scale of the Islamist extremist threat to our democracy | Anna Firth\nBridging the Gap Between Now and the Online Safety Bill:",
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk_news_nobody-wants-admit-scale-islamist-extremist-threat-our-democracy/content_5.html": "This article was written for the Sunday Telegraph on 25th February 2024.\nIn 2021, Sir David Amess was stabbed to death by an Islamist extremist who targeted him because of the way he’d voted in the Commons on the war in Syria. I was elected as Sir David’s successor two years ago this month, and not a day goes by when I don’t think of how he was brutally murdered simply for doing his job.\nMike Freer, MP for Finchley and Golders Green, recently announced that he was stepping down, fed up and frightened due to Islamist extremists regularly targeting him and his loved ones. His office was firebombed. Chillingly, Mike narrowly missed falling victim to Sir David’s killer, who went looking for him first.\nA lot of lovely sentiments have been expressed about both of these events, but has enough actually been done to tackle the fact that many, many Islamist fundamentalists with bad intentions live and walk among us? No, it hasn’t.\nWe seem afraid. Afraid to be seen as racist, or Islamophobic, even when we simply seek to save lives by speaking the truth. On Wednesday, in the House of Commons, the scale of this problem became crystal clear. If people at home felt bemused and upset by what happened, then they weren’t alone. I, too, could not believe what I was seeing.\nI was made aware that the Leader of the Opposition, Sir Keir Starmer, had met the Speaker to “urge” him to allow a vote on the Labour amendment to the SNP motion calling for a ceasefire in Gaza. Starmer apparently did this so that Labour MPs could “safely” vote in a way that wouldn’t “upset” their constituents and would allegedly “spare” them and their families from being threatened and intimidated.\nHow Starmer went about “urging” the Speaker is unknown. But the circumstances were extraordinary enough to prompt a letter from the Clerk of the House, Tom Goldsmith, to the Speaker pointing out that “long-established conventions are not being followed in this case”.\nAt best this was a subversion of democracy that undermined the integrity of Parliament. At worst it was naked appeasement and a deliberate act of bowing to the mob who were protesting loudly outside and projecting anti-Semitic slogans onto Big Ben. I would like to see a law passed immediately to ban any unauthorised projections onto the buildings of Parliament.\nBut how has this mob, which includes Islamists and far-Left activists, become so powerful that its actions made MPs afraid to vote with their consciences? Why was the Speaker, Sir Lindsay Hoyle, so willing to compromise himself and his reputation like this?\nThe events of Wednesday have certainly changed how I feel about doing my job as an MP. My office overlooks Whitehall and, on Wednesday, I could hear and see the protesters as they marched and grew in number and volume. I’d spoken in the SNP’s ceasefire debate and had stated my opinion that we cannot possibly vote for a ceasefire and leave the remaining Israeli hostages in the hands of Hamas. Seeing the baying mob outside made me feel wary of leaving the safety of my office.\nI’d also come up against such attempted intimidation in my constituency. Shortly after the Hamas attacks of October 7, I went to my local synagogue to express my sympathies to the Southend Jewish community and to ask if I could do anything to help. I was welcomed warmly and my offer of help was appreciated.\nI also have a mosque in my constituency, so a few weeks later I reached out to see if I could do anything to support them, especially in terms of organising humanitarian help for the innocent people of Gaza. I was invited inside and offered a seat before being surrounded by a number of men and one woman. She immediately started shouting, jabbing her finger in my face and demanding to know “how many babies had to die to satisfy my blood lust”. My aide, who was with me, suggested that we leave.\nA few days later, there was an anti-war in the Middle East march in Southend with dolls covered in fake blood scattered on the pavement, under people holding placards saying “Anna Firth kills babies”. I was horrified. A police officer stood by and watched but did nothing. When I saw Met Commander Sir Mark Rowley a week later in the Commons, he agreed that this was intimidation and explained that the police do have powers to intervene and stop people inciting violence like this. So why didn’t they?\nIf this is happening in a fairly centre-Right southern city like Southend, I can only imagine what some of my other Parliamentary colleagues must be going through. Even though I disagree with what Starmer and Sir Lindsay did, I understand the Speaker’s wish to try to protect MPs from threats and violence and I have accepted Sir Lindsay’s apology. But protecting MPs is a job for the police.\nI was always taught to stand up to bullies, not to give in, and never, ever to let myself be intimidated. It’s hard, though, when the threat is real and nobody wants to admit where it’s coming from. If you can’t name it, you can’t protect yourself from it.\nI agree with my friend and colleague Robert Jenrick, the former immigration minister, who described Wednesday as a “dark day in our democracy”. I also support his call to stop Islamist extremists from intimidating MPs. Home Secretary James Cleverly is spot on when he says that the only thing MPs should fear is the ballot box. As we saw with my predecessor Sir David, it’s only a short hop from violent rhetoric to deadly action.\nAnna Firth is the Conservative MP for Southend West",
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk_my-plan/content_9.html": "When I became your MP, I pledged to continue Sir David’s legacy which was one of care for the people of Southend West. I have worked hard to build on his wonderful example of what a good constituency MP should look like and deliver for local people in Southend West.\nI am so proud of our City and all that we have achieved. I am looking forward to highlighting the work I have done on your behalf and continuing my positive vision to create a city of opportunity for everyone.\nHere are my key achievements in just two years as your MP:\nSafer\n• In the past few days my Private Members Bill to criminalise pet abduction has passed into law. I see this very much as continuing Sir David’s crusade to improve animal welfare.\n• Our children need protection from spending too much time online. I’ve led the charge to ban mobile phones in schools to help keep our children safe and improve their wellbeing and learning outcomes, and overall life chances.\n• I’ve made it my priority to get knives off our streets. Working with local police, I’ve secured two state-of-the-art knife arches which are being deployed at crime hotspots to detect offensive weapons before they can be used. I’ve succeeded in persuading the government to close a loophole in the law to ban ‘zombie knives’. I’ve arranged for the ‘Knife Angel’ statue to come to Southend for the month of July to help young people understand the very serious consequences of carrying a knife.\n• Nitrous Oxide is mistakenly perceived by some as being a ‘harmless high’ – but it isn’t. I pushed ministers to ban this dangerous drug to keep our young people safe and to drive out anti-social behaviour.\nHealthier\n• I’ve secured £118m for our local NHS, including an upgraded A&E providing more space for patients and speeding up ambulance handover times. This additional funding will also provide a LINAC machine for improved cancer care, expanded surgical facilities, 48 more beds and a modern endoscopy unit, cutting waiting times for surgery with over 5,000 extra operations being carried out a year.\n• My ground-breaking ‘sewage summits’ have resulted in Anglian Water committing to reducing the use of storm overflows, five years ahead of government targets, and investing £104m in better surface water management to make our bathing water and beaches safer. As a direct result of my lobbying, bathing water in Southend is now being tested all year round and information on discharges is available online in real time.\n• I’ve helped schools like Kingsdown and Blenheim Primary to obtain funding for rebuilding programmes, providing a healthier and safer environment for children in which to learn.\nWealthier\n• I’ve supported the expansion of apprenticeships to encourage young people to make a career in key areas of the local economy.\n• To make our city even more attractive for residents, investors and visitors, I helped secure a multi-million pound levelling up investment. This will improve Leigh Port, speed up the refurbishment of Cliffs Pavilion and the greening of the seafront. It will create jobs and boost local businesses.\n• The first new fishery in the Thames Estuary in centuries is now in the pipeline following my successful lobbying of Ministers. Trial harvesting of Manila clams will start this year to source these highly valuable shellfish. Jobs in our fishing industry will be safeguarded and local restaurants and businesses will benefit.\n• Local transport is crucial to many in Southend West & Leigh so I held a ‘transport summit’ with bus companies, user groups and the Local Transport Minister. I’m delighted that as a result, the 21A bus has been reinstated and the No.3 bus rerouted. Along with new trains on both Greater Anglia and c2c, contactless and planned new lifts at Chalkwell Station, our city will be better connected for residents and visitors.\n.",
  "https_www_annafirth_org_uk_/https_www_annafirth_org_uk_news/content_7.html": "The Prevent Programme is not fit for purpose Thursday, 23 January, 2025 The heinous Southport stabbing last July by a wicked 18-year-old quite rightly rocked the country. Nothing is as evil as the mindless massacre of innocent children, but the relentless focus on knives being sold on Amazon to minors online, is not the key issue. Stronger laws around the purchasing of knives, particularly to minors, are obviously needed and while in Parliament I spent a great deal of... Articles\nMy Three Vital Questions For The Leadership Candidates 6th August 2024 Just over a month ago, both Conservative seats in Southend turned red for the first time ever. As the penultimate Conservative MP to join the last parliament, I... Opinions\nStatement of Thanks 9th July 2024 I would like to thank everyone in Southend West & Leigh who has contacted me since Friday or supported me over the last two and a half years. It has been a huge... Articles\nMy Op-Eds 5th June 2024 Many people have contacted me and asked for my opinions on some of the current issues and topics facing society today. As such, I thought it would be sensible... Local News\nSpeaking at the 33rd Charter Anniversary for the Lions Club of Leigh-on-Sea 2nd June 2024 On Sunday 2nd June 2024, I was absolutely delighted to attend the 33rd Charter Anniversary of The Lions Club of Leigh on Sea. The ceremony and lunch took place... Local News\nHelping Doris Parfitt celebrate her 100th birthday 28th May 2024 On Tuesday 28th May 2024, I was delighted to drop in to the 100th birthday party celebrations of Catherine Miller House resident, Doris Parfitt. Doris was born... Local News\nWhy I support bringing back National Service 26th May 2024 This article was published by GB News on Sunday 26th May 2024. It seems fitting that as we approach the 80th anniversary of D-Day, Rishi Sunak has pledged to... Westminster News\nHelping our churches continue their good work 24th May 2024 On Friday 24th May, I spent a lovely morning with Colin Baldwin, the priest at St Cedd's and St Stephen's churches, part of a lively and growing community here... Local News\nAnd we're off! 24th May 2024 Today, Friday 24th May 2024, I officially launched my General Election campaign with the backing of my fantastic team of supporters. I genuinely enjoy getting... Local News\nGeneral Election 2024 22nd May 2024 The Prime Minister has announced the General Election and we will go to the polls on Thursday 4th July 2024. While I have been the Member of Parliament for... Westminster News"
}