{
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_nhs-live-well-hub-visit/content_24.html": "29 March 2025\nNHS Live Well Hub visit\nLocal MP James Cleverly visited the NHS Live Well Hub in Braintree last week to meet with the senior leadership team at Provide (the community interest company that runs the Hub) and paediatric consultants working at the Hub.\nJames said:\n“We discussed neurodiversity and children’s services, as well as the vital role they play in supporting the NHS and local service delivery.”\nThe state-of-the-art faculty is in the heart of Braintree and also houses a GP practice.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_back-british-farming/content_28.html": "18 January 2025\nBack British Farming\nJames Cleverly meets farmers in north Essex to talk about inheritance tax on family farms and food security.\nJames Cleverly said:\n“The Government’s tax policies are an attack on rural Britain, an attack on farmers, and ultimately an attack on our food security.\n“Scrap the tax and back British farmers.”",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com_gallery/content_14.html": "Pagination Current page 1 Page 2 Page 3 Page 4 Page 5 Page 6 Page 7 Page 8 Page 9 Next page Next › Last page Last »",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_james-cleverly-backs-defence-boost-and-calls-government-honour-promises-ukraine/content_22.html": "Former Foreign Secretary James Cleverly backs calls to boost defence spending to send a message to friends and foes alike, and he calls on the Foreign Secretary to ensure we honour the unconditional promises made to Ukraine at the onset of the Russian invasion.\nMr James Cleverly (Braintree) (Con)\nWe need to recognise that the environment in which we operate has changed fundamentally, and therefore our response must change fundamentally. I very much echo the calls of my right hon. Friend the Member for Witham (Priti Patel) to increase defence spending now, because we have to send a message to our friends and foes alike that we take defence seriously. I urge the Foreign Secretary to remember the commitments we made to the Ukrainian people when this full-scale invasion took place. Our support to them was not contingent on the support of others; it was absolute, and we should make good on that commitment, because we said things that encouraged the Ukrainians to put their sons and daughters in harm’s way. They have stood up their end of the bargain, and we should stand up ours.\nThe Secretary of State for Foreign, Commonwealth and Development Affairs (Mr David Lammy)\nThe right hon. Gentleman is right: we have been Ukraine’s foremost friend, and we will continue to do that. We have a key role to play, because of our special relationship with the United States. We understand here in Europe that, yes, we want this war to end, but we want an enduring peace. We have got a long memory in relation to the Soviet Union and tsarist history, and that guides us on how we secure that peace.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_james-cleverly-questions-governments-resolve-coming-civil-service-cuts-battle/content_17.html": "With the Chancellor’s Spring Statement savings predicated on cutting a whole tranche of civil servants, James Cleverly asks how we can have any confidence that the Government will be able to stand up to the civil service unions.\nMr James Cleverly (Braintree) (Con)\nThe Transport Secretary failed to stand up to the transport unions, the Health and Social Care Secretary failed to stand up to the health unions, and the Work and Pensions Secretary failed to stand up to the Back Benchers of her own party. The Chancellor’s savings are predicated on getting rid of a whole tranche of civil servants. How can we have any confidence that she or the Prime Minister will stand up to the civil service unions?\nThe Chancellor of the Exchequer (Rachel Reeves)\nToday, as part of the transformation fund, we have set aside £150 million next year for redundancy costs for a voluntary exit settlement, which shows how serious we are about reducing the size of the civil service, after it increased to record levels under the Conservative party.\nHansard",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_rural-crime-summit/content_34.html": "12 December 2024\nRural Crime Summit\nOn Friday James Cleverly attended the Essex Rural Crime Summit, led by PFCC Roger Hirst and Deputy Chief Constable of Essex Police, Andy Prophet.\nThe Summit was attended by representatives from Parish, District, and County Council, along with landowners and farmers - and presentations given by the Rural Engagement Team, the Fire Service and reporting management and call handling from Essex Police.\nJames said:\n“I was updated on progress and ongoing challenges including; hare coursing, unauthorised encampments, plant and equipment theft, and fly tipping as well as unique issues of reporting rural crime.\n“There is more to do, but it’s clear that Essex Police are working hard to tackle Rural Crime and are bringing it down.”",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_january-update/content_32.html": "What happened in January\nBig votes on Brexit.\nAs part of the EU Withdrawal Act the House of Commons voted on the draft Withdrawal Agreement on the 15th of January. As someone who campaigned and voted to Leave the European Union, and having witnessed repeated attempts by MPs in the House of Commons to thwart Brexit, I took the view that backing the Prime Minister’s withdrawal agreement was the most likely way of delivering on the referendum result.\nThe House of Commons voted against the draft Withdrawal Agreement which means that the PM has to bring forward an alternative plan. The Commons held a series of votes on the 29th January which tested the support for a number of possible options, these included attempts to delay our exit date (I voted against and the proposals were defeated), that the UK should not leave the EU without a deal (I voted against but the majority voted to support the non-binding recommendation), and that the Withdrawal Agreement would be agreed to if the Backstop was amended (I voted in favour and the proposal was successful).\nThe PM is now negotiating with the EU to try and secure changes to the Backstop, any changes that she is able to secure will be made public and voted upon on the 14th February.\nThe House of Commons Library has produced a useful guide to help understand these unprecedented set of events. https://commonslibrary.parliament.uk/…/a-meaningful-vote-c…/\nNot just Brexit\nThere is more to politics than Brexit and I have continued to push for improvements to the rail service from Braintree. At the start of the month I wrote to the rail minister to make sure the commitments made by Greater Anglia in their franchise agreement are adhered to. (Copy of the letter here: https://www.facebook.com/283560961748679/posts/1712160192222075/ )\nI also took part in a debate about GA’s performance and the roll-out of a better compensation scheme when delays do happen. ( https://www.cleverly4braintree.com/…/james-cleverly-calls-r… )\nEmployment GrowthThe latest employment figures show that the UK has 32.53 million people in work, the highest figure ever. I am pleased that our part of Essex is contributing to those great figures when I visited Oadby Plastics Ltd who are expanding and will be employing dozens of people locally. https://www.facebook.com/283560961748679/posts/1724763364295091/\nOther issues\nFly tipping has been raised with me in a number of meetings and I’ve communicated these concerns to Government. I’m pleased about these new fines for fly-tipping. https://www.facebook.com/283560961748679/posts/1710265479078213/\nI met students from St Andrew’s Primary School on their visit to parliament. https://www.halsteadgazette.co.uk/…/17380154.braintree-mp-…/\nI wrote to ministers before Christmas about homelessness support and I’ve received their reply. https://www.facebook.com/283560961748679/posts/1742744419163652/\nAdvice Surgeries\nI hold regular advice surgeries around the constituency, if you need help with an issue and would like to meet to discuss it please get in contact via email so we can make arrangements.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_sir-james-cleverly-reiterates-importance-honouring-our-commitments-ukraine/content_15.html": "Following the Government statement on the talks held in London on the war in Ukraine, former Foreign Secretary Sir James Cleverly highlights the importance of standing by the commitments that we have made to Ukraine, and calls on the Government to convey that message to the United States of America.\nSir James Cleverly (Braintree) (Con)\nOur international relationships the world over are dependent on partner countries’ confidence that we will stick by our word, and that our allies will do likewise. Will the Secretary of State, the right hon. Member for Tottenham (Mr Lammy), convey that message to the United States of America? The world—friends and foes alike—is looking at our willingness to stick by the commitments that we have made to Ukraine. If we renege on those commitments, every single relationship around the world will be undermined.\nThe Minister of State, Foreign, Commonwealth and Development Office (Stephen Doughty)\nI thank the former Foreign Secretary for his comments, his continued support, and his engagement with me on these important issues when I was in opposition. The Government and I have been absolutely clear: our support is iron-clad, not only now, but for 100 years into the future. I was able to convey our support and our unity on this issue to a bipartisan delegation from the US House Foreign Affairs Committee yesterday. It was an excellent and productive discussion. There is strong unity on these issues. We need to continue to work together, across Europe and in our transatlantic and global alliances, to deter and defend against the threat from Russia, as well as other threats that we face together.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_brexit-getting-it-done-only-start/content_35.html": "5 February 2020\nBrexit: Getting it done is only the start\nAt 11pm tonight we will leave the European Union and put into effect the decision taken by the British people back in 2016. It has taken far too long to get here and it’s been far harder than it should have been. But today, more than ever, I am proud to be chairman of the party that not only listens to what people want, but also – crucially — delivers.\nGet Brexit done. You might have heard this a few times during the general election campaign. And today it is a promise we fulfil. After three long years of delay, it took the prime minister less than 100 days to renegotiate the Withdrawal Agreement.",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com_cookies/content_25.html": "We want to make this website as easy to use and helpful as possible. This sometimes involves placing small amounts of information on your computer. These are called 'cookies'.\nThese cookies cannot be used to identify you personally and are only used to improve the service offered to users of this website.\nYou can manage or disable these small files yourself in your web browser, but some features of the website may not function as a result. To learn more about cookies visit AllAboutCookies.org.\nThe cookies we use\nThe open source platform and content management system on which this website is built uses the following cookies:\n|\nDrupal |\nSESS |\nLogs the current session, Expires 21 days from the session date. |\n|\n|\n|\nhas_js |\nLogs whether or not you have javascript enabled. Expires at end of session. |\n|\n|\n|\nDrupal.tableDrag.showWeight |\nThis cookie determines whether a numeric weight is shown when a table is dragged. Expires 1 year from the session date. |\n|\n|\nGoogle Analytics |\n_gat _ga _gid |\nThese cookies are used to collect information about how visitors use this website. We use the information to compile reports and to help us improve the website. The cookies collect information in an anonymous form, including the number of visitors to the website, where visitors have come to the site from and the pages they visited |\n|\n|\nCookie control |\nCookiecontrol |\nThis cookie is set when you accept cookies from this site. Expires 2 months from the session date. |\nThird Party cookies\nSome third-party services used on this website also use cookies. These are not controlled by us, but are controlled by the service provider:\nGoogleMaps",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_james-cleverly-visits-restoration-work-st-marys-church-stebbing/content_4.html": "22 March 2025\nJames Cleverly visits the restoration work at St Mary’s Church at Stebbing\nLocal MP James Cleverly visited the restoration work currently underway at St Mary’s Church at Stebbing to learn of the massive impact of the Government’s changes to the rules for VAT on refurbishment of Listed Place of Worship.\nIt means that, mid project, St Mary’s Stebbing have got to raise an extra £140,000 - just for the increased tax bill.\nJames has written to the Government calling on them to reverse this change, at least for projects that have already started.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_labour-might-well-paint-welcome-people-smugglers-white-cliffs-dover/content_39.html": "James Cleverly, Shadow Home Secretary, writes for The Telegraph.\nLabour’s first week in government in 14 years is a sign of things to come, and it should worry the British people. The steps they have taken in the Home Office alone are proof of what is ahead – chaos, obfuscation and open borders.\nDuring the election, Labour talked tough but lacked substance – making just enough noises to get over the line and then deal with the problem later. But their “Ming vase” migration strategy will smash into smithereens across this Parliament, with the first cracks already showing in office.\nWeek one of Labour in the Home Office was chaos. Labour ministers disagreed in public about visa liberalisation, rejoining the EU and free movement. Sir Patrick Vallance, whom I have a huge amount of respect for, will have to learn quickly that the Labour hierarchy don’t want you to know what they really think behind closed doors.\nData published this week show visa applications are falling rapidly, and with it, so will net migration, thanks to action we took when I was home secretary. We introduced a series of visa curbs that meant around 300,000 people who came here last year would be ineligible this year. It was the biggest ever cut to migration.\nWe raised the salary threshold to get a work visa, we stopped students from bringing their dependants, we stopped health-care workers from bringing their dependants, and we said that family members coming to the UK had to be able to support themselves. These decisions were firm but fair and are already having the desired effect. Net migration is on track to halve in the next 12 months.\nLabour may well claim this progress as their success, but don’t be fooled. There are many politicians out there who want to talk about migration, sound tough, describe a situation, but very few are willing to do what is necessary and right for the British public.\nAnd the picture isn’t any better on illegal migration. Yvette Cooper managed to cause a diplomatic incident from the Home Office on day one, by scrapping the Rwanda policy.\nAstoundingly, our new Home Secretary did not appear to have the courtesy to tell the Rwandans, a Commonwealth country, with whom we had signed a binding treaty and enjoyed an excellent working relationship. They were providing a valuable service to the UK, as part of a real development partnership, but that has now been thrown away along with £270m of taxpayer money, for nothing.\nWithout a deterrent and by granting an effective amnesty to 100,000 asylum seekers, Labour might as well be painting “welcome, people smugglers” on the white cliffs of Dover. When we said they didn’t have a plan, we meant it – and the consequences are already crystal clear.\nDespite terrible weather this week, almost 500 asylum seekers crossed the channel in small boats, cramming more and more people into each boat, and four people tragically lost their lives. There is a human cost to the failure to stop this crisis. It’s a moral imperative that we stop the boats and stop the loss of life in the Channel.\nThe whole purpose of the deterrent is to break the business model of the people-smuggling gangs and stop people making the perilous journey, but Labour’s ideological approach will have the opposite effect. Labour should be listening to the National Crime Agency, which says we need a deterrent, before activist groups such as Care4Calais.\nThe Conservative Party must continue to advocate real control and bold solutions to stop the boats. We should not be squeamish and shy away from that philosophy – it is the right one and it is shared by the British people. But we need to win back their trust on our ability to deliver it.\nWe must get our house in order so we can be the credible alternative the British people will sorely need after a Labour government, especially if their first week is anything to go by.\nThat starts with proper opposition. Over the coming years, we need to hold a magnifying glass to the Labour Party on immigration because we know that they don’t have the ability or desire to control our borders. And we must be unwavering in our commitment to it, to differentiate ourselves from them by proving that we are the only serious party interested in reducing the amount of net migration and stopping illegal immigration while Labour flounder in power.\nThat is exactly what I intend to do.",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com/content_1.html": "Local MP James Cleverly visited the restoration work currently underway at St Mary’s Church at Stebbing to learn of the massive impact of the Government’s changes to the rules for VAT on refurbishment of Listed Place of Worship.\nFollowing the Government statement on the talks held in London on the war in Ukraine, former Foreign Secretary Sir James Cleverly highlights the importance of standing by the commitments that we have made to Ukraine, and calls on the Government to convey that message to the United States of America.\nWith the Chancellor’s Spring Statement savings predicated on cutting a whole tranche of civil servants, James Cleverly asks how we can have any confidence that the Government will be able to stand up to the civil service unions.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_right-die-must-not-become-duty-says-former-home-secretary/content_37.html": "27 January 2025\n‘Right to die’ must not become a duty, says former home secretary\nJames Cleverly writes for The Times. The right to die must not become the duty to die. The state should not assist someone to end their life if they do so because they feel they are a burden.\nJames Cleverly is seeking to amend Kim Leadbeater’s assisted dying bill, which he says lacks strong protections for vulnerable people who feel they are a burden.",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com_parliament/content_3.html": "Following the Government statement on the talks held in London on the war in Ukraine, former Foreign Secretary Sir James Cleverly highlights the importance of standing by the commitments that we have made to Ukraine, and calls on the Government to convey that message to the United States of America.\nSir James served as Shadow Home Secretary from the General Election in July 2024 until November 2024. James had served as Home Secretary since November 2023. Prior to that, he had served as Secretary of State for Foreign, Commonwealth and Development Affairs since September 2022, having previously served as Secretary of State for Education, Minister for Europe at the Foreign, Commonwealth & Development Office (FCDO), Minister for Middle East and North Africa and as joint Minister of State in the Foreign & Commonwealth Office and the Department for International Development.\nWith the Chancellor’s Spring Statement savings predicated on cutting a whole tranche of civil servants, James Cleverly asks how we can have any confidence that the Government will be able to stand up to the civil service unions.\nFormer Home Secretary James Cleverly criticises the Government for scrapping legislation aimed at tackling illegal immigration without first introducing any alternative. He urges Ministers to bring forward serious proposals to reduce the number of small boat arrivals, which have gone up by over 30% since this Government took office.\nJames Cleverly highlights the importance of early diagnosis and treatment of breast cancer and asks what the Government are doing to encourage greater awareness of the full range of breast cancer symptoms, and to encourage women to get early diagnosis and treatment.\nFollowing the Prime Minister’s statement on securing a lasting peace in Ukraine, former Foreign Secretary James Cleverly congratulates the PM on his efforts over the weekend. He calls for a fundamental “gear shift” on defence spending and offers his support when tackling the difficult decisions about balancing defence spending against domestic expenditure.\nFormer Foreign Secretary James Cleverly backs calls to boost defence spending to send a message to friends and foes alike, and he calls on the Foreign Secretary to ensure we honour the unconditional promises made to Ukraine at the onset of the Russian invasion.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_putin-attacks-ukraine-britain-and-our-allies-will-not-be-silent/content_33.html": "Foreign Secretary James Cleverly writes for The Express.\nWhen our Ambassador in Ukraine visited a Kyiv market recently, she discovered even the socks on sale had joined the struggle against Russia's invasion. Melinda Simmons found countless pairs emblazoned with choice insults aimed at Vladimir Putin, while others carried the simple phrase: \"British Intelligence\".\nThis was a wry tribute to British Defence Intelligence, which has won a large following in Ukraine by publishing its daily assessment of Russia's invasion. The scene provided yet more evidence of how Ukraine's heroic people are defying Vladimir Putin's onslaught as free countries unite in their support.\nThese were also the themes of the meeting of G7 Foreign Ministers that I have just attended in the German city of Munster: standing up to the aggressor and standing united.\nWe all know Putin has suffered one defeat after another in Ukraine. Now he is taking revenge by firing cruise missiles and suicide drones at Ukrainian cities, depriving millions of electricity and often water.\nMeanwhile, he is doing his best to drive up and destabilise global food and energy prices. By resorting to these cynical tactics, Putin has made his war everybody's business.\nHis exploitation of the Grain Initiative, which allowed 100,000 tonnes of Ukrainian food to be exported every day, is a case in point.\nLast Saturday, Putin said he was suspending Russia's participation in the initiative. By Wednesday, he was back in again.\nHe created uncertainty and risked the progress made for desperately hungry people.\nPutin's tactics are not only abhorrent futile because Britain and our allies are going to stand with Ukraine whatever he does.\nMy fellow G7 foreign ministers were steadfast in our support. As an alliance of friends, we are determined to show strategic endurance and press on until Ukraine prevails.\nIn Germany, I met the Foreign Ministers of Ghana and Kenya to discuss global hunger and our shared efforts to tackle climate change, respond to humanitarian crises and strengthen the production and trade of food across the African continent.\nPutin is also trying to destabilise the countries of the western Balkans.\nAt an earlier summit in Berlin, I met our friends in that region and discussed how Britain can support their efforts to reduce reliance on Russian energy and strengthen cyber security.\nBritain will always be an honest and reliable partner, steadfast in our defence of freedom, democracy and development.\nAs Putin attacks Ukraine, using tactics that leave the world’s most vulnerable people further exposed to the global food crisis, we will not be silent, and nor will our friends among the free nations.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_holocaust-memorial-day-1/content_29.html": "27 January 2025\nHolocaust Memorial Day\nToday James Cleverly signed the Holocaust Educational Trust’s Book of Commitment.\nToday is Holocaust Memorial Day and marks the 80th anniversary of the liberation of the Nazi concentration and death camp, Auschwitz-Birkenau.\nJames said:\n“By remembering the systematic mass murder during the Holocaust we hope to prevent other such atrocities.”",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com_articles/content_20.html": "Articles\nI can unite the Conservatives and overturn Starmer’s loveless landslide\nJames Cleverly writes for The Telegraph.\nThe Conservative Party has been the most effective and successful political organisation on the planet. We have formed the government more than any other party in the United Kingdom and consistently delivered for our country thanks to a reputation for good governance, pragmatism and competence.\nJanuary Update\nAs part of the EU Withdrawal Act the House of Commons voted on the draft Withdrawal Agreement on the 15th of January. As someone who campaigned and voted to Leave the European Union, and having witnessed repeated attempts by MPs in the House of Commons to thwart Brexit, I took the view that backing the Prime Minister’s withdrawal agreement was the most likely way of delivering on the referendum result.",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com_news/content_7.html": "Local MP James Cleverly visited the NHS Live Well Hub in Braintree last week to meet with the senior leadership team at Provide (the community interest company that runs the Hub) and paediatric consultants working at the Hub.\nNews\nImage\nJames Cleverly visits the restoration work at St Mary’s Church at Stebbing\n22 March 2025\nLocal MP James Cleverly visited the restoration work currently underway at St Mary’s Church at Stebbing to learn of the massive impact of the Government’s changes to the rules for VAT on refurbishment of Listed Place of Worship.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_contact/content_27.html": "Contact\nWrite to me:\nThe Rt Hon Sir James Cleverly TD VR MP\nHouse of Commons\nLondon, SW1A 0AA\nEmail me about policy and local issues at:\njames.cleverly.mp@parliament.uk\nEmail me for assistance at:\nBraintreeMPHelpline@parliament.uk\nProtecting your data:\nMy office will not use your personal data in any way that goes beyond your reasonable expectations in contacting me. Please see my Privacy Notice",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_james-cleverly-meets-pcc-discuss-police-funding/content_13.html": "James Cleverly met with Essex Police and Crime Commissioner Roger Hirst to discuss the cost pressures on Essex Police and the Government’s financial mismanagement.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_james-cleverly-presses-foreign-secretary-restoring-uks-global-credibility-after-aid-cuts/content_8.html": "James Cleverly questions the Foreign Secretary on efforts to re-establish the Foreign Office’s credibility on the world stage following cuts to the overseas aid budget.\nMr James Cleverly (Braintree) (Con)\nIn February, the Foreign Secretary rightly criticised America’s aid cuts. Two weeks later, he was humiliated by his own Prime Minister when his departmental budget was smashed to bits. What is he doing to re-establish his and his Department’s credibility on the world stage, so we can once again have genuine influence internationally?\nThe Secretary of State for Foreign, Commonwealth and Development Affairs (Mr David Lammy)\nI say to the right hon. Gentleman that this Government have not made an ideological decision to cut aid, and he knows that. There are other Governments around the world making ideological decisions to cut aid. This Government did not make the decision that the last Government made to switch off aid overnight. We are ensuring that there are no cliff edges. He will know—and I know he knows this—that investing in hard power also saves lives and acts as a deterrence in our own country and across much of the world.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_james-cleverly-urges-government-act-rising-small-boat-crossings/content_16.html": "Former Home Secretary James Cleverly criticises the Government for scrapping legislation aimed at tackling illegal immigration without first introducing any alternative. He urges Ministers to bring forward serious proposals to reduce the number of small boat arrivals, which have gone up by over 30% since this Government took office.\nMr James Cleverly (Braintree) (Con)\nWhen in opposition, the Labour party talked tough about what it would do when it entered government. As my right hon. Friend the shadow Home Secretary has said, though, small boat arrivals and hotel use are both up, and asylum seekers are being waved through the system just to make the Minister’s numbers look good. This all reeks of arrogance and complacency, and we are now seeing the real-world impacts; for example, Wethersfield in my constituency has seen the number of asylum seeker users go up. While Labour talked tough before the election, it took things off the statute books before it replaced them with anything else, so when will the Minister actually come to the House with serious proposals to reduce the number of small boat arrivals, which have gone up by over 30% on her Government’s watch?\nThe Minister for Border Security and Asylum (Dame Angela Eagle)\nThe right hon. Gentleman says that Wethersfield is now getting more people, but it is still not holding the numbers that his Government planned for it to hold when it was opened, so that is rather an odd argument for him to make. If he was serious about reducing the problems at our borders, I would have thought that he would want to support the counter-terrorism-style powers in the Border Security, Asylum and Immigration Bill, but it seems that he is not.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_privacy/content_38.html": "Privacy and Cookies\nThis privacy notice relates to the personal data processed by the Office of James Cleverly MP in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is James Cleverly.\nWhat does the office do?\nWe conduct casework and respond to policy queries, for which we must process people's personal data. We also manage a small, non-political mailing list for the purpose of sending James' newsletter and information about upcoming advice surgeries.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent. We are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted James about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you such as local authorities, government agencies, public bodies, health trusts, regulators and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures. We will not share the personal information of members of James’ mailing list or those in receipt of our newsletters. In any case, we will not use your data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Unless specifically requested by you, we feel it is reasonable that our office will hold your personal data for the duration of James’ time as representative for the Braintree Constituency. Following an election, if unsuccessful, all records will be destroyed within one calendar month of the election.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page. Please note that we will ask for identification (passport, driving license, utility bill from the last 3 months) should you choose to exercise any of the above rights in relation to personal data we hold. Complaints In the event that you wish to make a complaint about how your personal data is being processed by this office, or how your complaint has been handled, you have the right to lodge a complaint directly with the Information Commissioner’s Office www.ico.org.uk\nThe Rt Hon James Cleverly MP\nHouse of Commons\nLondon, SW1A 0AA\nEmail me at:",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com_contact/content_19.html": "Contact\nWrite to me:\nThe Rt Hon Sir James Cleverly TD VR MP\nHouse of Commons\nLondon, SW1A 0AA\nEmail me about policy and local issues at:\njames.cleverly.mp@parliament.uk\nEmail me for assistance at:\nBraintreeMPHelpline@parliament.uk\nProtecting your data:\nMy office will not use your personal data in any way that goes beyond your reasonable expectations in contacting me. Please see my Privacy Notice",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_i-can-unite-conservatives-and-overturn-starmers-loveless-landslide/content_30.html": "James Cleverly writes for The Telegraph.\nThe Conservative Party has been the most effective and successful political organisation on the planet. We have formed the government more than any other party in the United Kingdom and consistently delivered for our country thanks to a reputation for good governance, pragmatism and competence.\nBut the last election showed us that we had lost the trust of voters. They questioned our motives, our ability, and our commitment to delivering for them. That must change.\nOver the next Parliament, we must not descend into the infighting, navel-gazing and the internecine manoeuvrings at Westminster that plagued us in government.\nIn opposition we must be unified and disciplined, resolute in the job of holding the Labour Party to account on their promises. We must raise our standards and show we are willing to take action when we fall short. And we must reconnect with our members and voters.\nWe need to be a government in waiting. We are not a pressure group or a think tank. Sacrificing pragmatic government in the national interest on the altar of ideological purity is not Conservative. We must ditch the self-indulgent infighting and be ready to deliver when the next chance comes.\nThis will take dedication, discipline and focus. It starts with choosing the right leader and then backing and supporting them fully, whoever it is.\nI am putting myself forward to be that leader because I can unite the Conservative Party and overturn Starmer’s loveless landslide.\nAs Foreign Secretary I promoted the UK’s interests on the world stage, lobbied internationally to boost support to Ukraine, and I led the UK’s response to Hamas’ brutal terrorist attack on Israel, supporting our ally when voices on the Left told us to abandon them.\nAs Home Secretary I took action to cut net migration by half next year after years of increases, negotiated a treaty with Rwanda and passed the Safety of Rwanda Act.\nAnd as chairman of the Conservative Party, I helped get our campaigning machine in shape so Boris could deliver the best election result we have seen since Thatcher, securing Brexit and defeating the Corbynistas. I know what it takes to unite, deliver, and win.\nWe need to rediscover confidence that our core values are shared by the British public and present an offer of unity, security, and prosperity. That should be our USP against a behemothic Labour Party, ravaged with ideological incoherence and factional division.\nVoters will soon see that Labour don’t share their values and don’t have answers to their problems. Their landslide is a sandcastle – built on the back of our failures rather than enthusiasm for a big, high-tax state.\nStarmer is beatable. As they wrestle with the reality of government, their honeymoon period will quickly draw to a close.\nBut to take advantage of Labour’s inevitable failure, we cannot go chasing after one set of voters at the expense of another, we must have broad appeal. This is how we have won elections before, as we did in 2019, and it will be how we do it again.\nWe are the natural home of Reform voters who want tough action to control our borders. We are the natural home of Liberal Democrat voters who care about their rural communities. And we are the natural home of the Labour voter who wants to see real economic growth, public services improve and their pay go further. We also need to motivate those who stayed at home to get out and vote for us again.\nOver the course of my career, from the Army Reserves to starting my own business, serving on the London Assembly and in two of the Great Offices of State, I have been expressly thinking about what this country needs.\nBeyond the obvious that we need to be ramping up defence spending to 3 per cent of GDP as soon as possible, we need to rediscover a national sense of purpose and self-reliance, centred on a British economic dream of aspiration. Stimulation by deregulation rather than subsidy.\nMillions more homes closer to jobs, with densification in urban areas, protecting the green belt from urban sprawl. Families much better supported to care for each other. And lower taxes, with a smaller state. We need to support businesses, not the state, to grow the economy. Starmer’s stifling statism will tax us into oblivion.\nWe need to get back to winning ways, above all, for the British people. Nobody should strive to be the leader of the opposition. I strive to be prime minister.\nAnd my fellow Conservative colleagues must strive not to be shadow ministers, but in government, making decisions around the Cabinet table once again.\nI am best placed to get us there.",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com_privacy/content_11.html": "Privacy and Cookies\nThis privacy notice relates to the personal data processed by the Office of James Cleverly MP in relation to casework and policy queries.\nWho is the Data Controller?\nThe Data Controller is James Cleverly.\nWhat does the office do?\nWe conduct casework and respond to policy queries, for which we must process people's personal data. We also manage a small, non-political mailing list for the purpose of sending James' newsletter and information about upcoming advice surgeries.\nHow do we process data?\nThis office processes constituents’ data under the lawful basis of public task. In instances where this lawful basis is not sufficient and explicit consent is required, a member of the office will contact you to establish your consent. We are committed to ensuring that the information we collect and use is appropriate for this purpose, and does not constitute an invasion of your privacy.\nWill we share your data with anyone else?\nIf you have contacted James about a personal or policy issue, we may pass your personal data on to a third-party in the course of dealing with you such as local authorities, government agencies, public bodies, health trusts, regulators and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended. When they no longer need your data to fulfil this service, they will dispose of the details in line with our procedures. We will not share the personal information of members of James’ mailing list or those in receipt of our newsletters. In any case, we will not use your data in a way that goes beyond your reasonable expectations in contacting us.\nFor how long will you keep my personal data?\nCasework and policy queries are often revisited to provide the best service and representation for constituents, from whom we may continue to receive correspondence. Unless specifically requested by you, we feel it is reasonable that our office will hold your personal data for the duration of James’ time as representative for the Braintree Constituency. Following an election, if unsuccessful, all records will be destroyed within one calendar month of the election.\nWhat rights do I have to my personal data?\nAt any point while we are in possession of or processing your personal data, you, the data subject, have the following rights:\n• Right of access – you have the right to request a copy of the information that we hold about you.\n• Right of rectification – you have a right to correct data that we hold about you that is inaccurate or incomplete\n• Right to be forgotten – in certain circumstances you can ask for the data we hold about you to be erased from our records.\n• Right to restriction of processing – where certain conditions apply to have a right to restrict the processing.\n• Right of portability – you have the right to have the data we hold about you transferred to another organisation.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\nHow can I contact somebody about my privacy?\nYou can get in touch with our office by letter, email or telephone using the details at the foot of this page. Please note that we will ask for identification (passport, driving license, utility bill from the last 3 months) should you choose to exercise any of the above rights in relation to personal data we hold. Complaints In the event that you wish to make a complaint about how your personal data is being processed by this office, or how your complaint has been handled, you have the right to lodge a complaint directly with the Information Commissioner’s Office www.ico.org.uk\nThe Rt Hon James Cleverly MP\nHouse of Commons\nLondon, SW1A 0AA\nEmail me at:",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_brexit-withdrawal-agreement/content_36.html": "James Cleverly writes in the SundayExpress: ‘Let’s not snatch defeat from the jaws of victory.’\nIn the winter of 2015, then Prime Minister David Cameron went to the EU with his negotiation checklist.\nI looked at what he was asking for and know that it didn't represent the fundamental change in the EU-UK relationship that I wanted to see. I wanted to see the UK stop spending hundreds of millions of pounds a week on the EU, I wanted to see us set our immigration policy in the UK, I wanted British lawmakers making our laws and being held to account by the electorate for them. I also wanted to see the UK set its own trade policy for the first time in decades.\nSo, I campaigned for the UK to leave the EU.\nNearly three years later, after a referendum in which the country voted to leave, and following a general election which confirmed the country's desire to do so, we have a deal which delivers on the leave vote.\nTime and time again, voters told me on the doorstep that we should take back control.\nAnd that is what the Prime Minister's deal does.\nWe are taking back control of our money, meaning no more vast sums being paid to the EU.\nWe will have control of our borders again, ending free movement.\nAnd crucially, and more importantly to many, we will have control of our laws, ending the jurisdiction of the European Court of Justice.\nI have no doubt that if this deal was presented as our Leave option at the start of the referendum campaign it would have received huge support.\nWhich is why so many of the people who were instrumental in the Vote Leave campaign support it.\nI am also greatly worried that if we don't deliver this deal that Brexit could be delayed, distorted, or even stopped.\nSince the Brexit vote, Labour have obfuscated and tried to pretend that they support Brexit. Now the mask slips.\nLabour shadow chancellor John McDonnell has this week confirmed that Labour considers a second referendum \"inevitable\".\nDon't be fooled. This is not a party being dragged kicking and screaming to this conclusion.\nThis is the preferred outcome for a party that is desperate to get its hands on the levers of power by any means necessary.\nThey believe they can secure more support taking an anti-Brexit stance than by honouring the outcome of the referendum.\nIt's cynical but it might work, if we don't seal the deal now.\nOn Monday, April 1 next year, I want the Prime Minister to stand at the despatch box and be able to say: \"As of 11pm on the 29th of March, the United Kingdom has formally left the European Union.\"\nVoting against this deal risks that.\nLet's not snatch defeat from the jaws of victory.\nLet's get on with the job we've been instructed by the British people to do. Let's deliver Brexit.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_visit-mid-essex-initial-teacher-training/content_12.html": "15 May 2024\nVisit to Mid Essex Initial Teacher Training\nJames visited Mid Essex ITT which is based at Notley High School & Braintree Sixth Form and is judged “Outstanding” by Ofsted. Many of the teachers go on to work in our local schools.\nJames said:\n“It was great to visit Mid Essex Initial Teacher Training on Friday.\n“We spoke about recruitment and retention of teachers and the key role that teachers play in our communities.”",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_james-cleverly-calls-3-gdp-defence-spending-strengthen-uk-influence/content_10.html": "25 February 2025\nJames Cleverly calls for 3% GDP on defence spending to strengthen UK influence\nJames Cleverly urges the Government to commit to spending 3% of GDP on defence, to put the UK in a strong position to encourage European allies to boost their own defence budgets.\nMr James Cleverly (Braintree) (Con)\nAs I am sure those on the Treasury Bench know, soft power and diplomacy are most effective when they are backed up by hard power. When will the Government commit to spending 3% of GDP on defence, to make sure that we have a real voice at the international table to encourage European countries to increase their defence spending?\nThe Secretary of State for Foreign, Commonwealth and Development Affairs (Mr David Lammy)\nWhy did the right hon. Gentleman not decide to do that? The Conservatives left it to this Government to get back to 2.5%, which we last had under a Labour Government. The right hon. Gentleman should have done it, and we are going to do it.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_dementia-friendly-halstead/content_31.html": "14 March 2025\nDementia Friendly Halstead\nJames Cleverly attended a meeting of the Halstead Rotary Club at the Halstead Men’s Shed today.\nKeith Brownlie, President of Halstead Rotary Club, and Halstead’s Mayor, Andy Munday, shared the fantastic work, outreach, and fundraising efforts being done to make Halstead a Dementia Friendly Community.\nRaising awareness and understanding of dementia is key to ensuring that those living with it can continue to lead fulfilling lives on their own terms.\nAfter the meeting, James had the chance to explore the new workshop at the Men’s Shed and admire the impressive work being created there. A great example of community spirit in action!",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_cleverly-urges-gear-shift-defence-spending/content_21.html": "Following the Prime Minister’s statement on securing a lasting peace in Ukraine, former Foreign Secretary James Cleverly congratulates the PM on his efforts over the weekend. He calls for a fundamental “gear shift” on defence spending and offers his support when tackling the difficult decisions about balancing defence spending against domestic expenditure.\nMr James Cleverly (Braintree) (Con)\nI find myself in the strange and rather uncomfortable position of very much agreeing with the Prime Minister on everything he has said today. While I often take great delight in criticism of the Government, the Prime Minister did not really put a foot wrong this weekend.\nHowever, he does need to go further. The small increase in defence spending that he announced was welcome, but fundamentally, we need a gear shift on this. I echo the point made by my right hon. Friend the Leader of the Opposition that when—and it will be when, not if—he has to make some really difficult decisions about balancing defence spending against domestic expenditure, we will not try to play politics. We will support him, because we need to send a message now to our friends in Ukraine and to potential aggressors around the world that we take our defence, the defence of our values, and the defence of our friends seriously.\nThe Prime Minister (Keir Starmer)\nI thank the right hon. Gentleman for the unity across the House, and he is absolutely right. It sends a message to those who want to challenge our values when they see this House united, whether on Ukraine or defence spending. We have to face this era with confidence and with unity across this House, wherever we can. It has been good to have him agreeing with me—we should do this more often.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_groundbreaking-new-community-diagnostic-centre/content_26.html": "16 February 2025\nGroundbreaking of the new Community Diagnostic Centre\nOn Friday James Cleverly attended the groundbreaking of the new Community Diagnostic Centre (CDC) at Braintree Hospital.\nJames said:\n“The CDC was a commitment made by the Conservative government before the election and I visited the site in March of last year to announce the funding.\n“I look forward to the opening ceremony later this year.”",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_sunday-express/content_40.html": "James Cleverly writes for the Sunday Express: The people have spoken: we must get on with Brexit.\nClick here for article in the Sundays Express",
  "http_www_cleverly4braintree_com_/http_www_cleverly4braintree_com_about/content_18.html": "I was born in Lewisham Hospital, my mother worked as a midwife at the hospital where I was born and my father worked to build up a successful small business. Seeing how hard both my parents worked showed me the importance of supporting both businesses and the public sector.\nI spent much of my childhood with family in Chelmsford and when I left school I followed family tradition and joined the army. That ambition was cut short by injury, so I went back into education and got a business degree and joined the Territorial Army.\nAt university I met my wife Susie and we now have two lovely, lively sons Freddy and Rupert. My career was in magazine and digital publishing and I worked on a number of market leading titles before setting up my own company. I understand how tough it is running a small business but also how rewarding it can be, I want to see business grow and make sure people can get good quality local jobs.\nI still serve in the TA and in 2004 I was called up to support mobilised TA soldiers and make sure they were able to get their jobs back when they came home from Iraq. I’m proud to say that every soldier who wanted to return to their old job was able to.\nIn 2012 Boris Johnson appointed me to the Chairmanship of the London Fire Authority. I worked with senior officers to implement reforms to the London Fire Brigade that both saved money and improved performance. I am passionate about making sure that the public services that we all rely upon are on a sound financial footing fit for the future.\nI served as Home Secretary from November 2023 until July 2024 and as Shadow Home Secretary from then until November 2024. I served as Secretary of State for Foreign, Commonwealth & Development Affairs from September 2022 until November 2023, having previously served as Secretary of State for Education, Minister for Europe at the Foreign, Commonwealth & Development Office (FCDO), Minister for Middle East and North Africa and as joint Minister of State in the Foreign & Commonwealth Office and the Department for International Development.\nhttps://www.gov.uk/government/people/james-cleverly\nVolunteering\nFor almost 20 years I have been an officer in the Territorial Army, rising to the rank of Lieutenant Colonel and currently part of Central Volunteers HQ Royal Artillery, working as a Staff Officer in 1st (UK) Armoured Division, and until 2005 was the Officer Commanding 266 (Parachute) Battery Royal Artillery (Volunteers).\nI am the President of the fundraising group for the Ulysses Trust which supports cadets and members of the reserve forces to undertake challenging adventurous and community-related activities.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_public-space-protection-order-braintree-town-centre-consultation/content_23.html": "Public drinking is an issue which has been raised with James and he has, in response, discussed the matter with Roger Hirst the Essex Police, Fire, and Crime Commissioner.\nEssex Police are working with Braintree District Council to put in place a Public Spaces Protection Order for Braintree town centre following reports of anti-social behaviour.\nThe proposed order focuses on addressing issues such as aggressive and threatening behaviour, and the consumption of alcohol in public.\nBraintree District Council is currently holding a 28-day public consultation, which allows you to share your own experiences of anti-social behaviour in Braintree Town Centre and your thoughts on the proposed order.\nI strongly encourage my constituents to take part and you can do so by following this link:\nhttps://www.braintree.gov.uk/xfp/form/677?utm_medium=email&utm_name=&utm_source=govdelivery",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_world-suicide-prevention-day-changing-narrative-suicide/content_5.html": "Today is World Suicide Prevention Day. A day to raise awareness of how we can ensure fewer people die by suicide and spread the message that suicides are preventable.\nRecently I met with a number of constituents affected by suicide. They have each chosen to become involved in making improvements, supporting others, and preventing other suicides.\nSuicides can be prevented, whether by talking about our feelings, with early interventions at schools, or improving accessibility for those reaching for support.\nChanging the Narrative on Suicide aims to raise awareness about the importance of changing the way we talk about and perceive this complex issue.\nMental Health must have parity of esteem with physical health. We speak about fitter healthier bodies and it’s time we looked at how we can keep fit and healthy minds.\nSuicide is a major public health concern affects people of all ages, backgrounds, and circumstances. Every loss through suicide is a tragedy that has a lasting impact on families, friends, and communities.\nAs part of the campaign, the International Association for Suicide Prevention (IASP) is issuing a call to action: “Start the Conversation.” This call encourages individuals, communities, organisations, and governments to engage in open, honest discussions about mental health and suicide.\nBy starting conversations, people can check in with a friend or loved one, share personal stories and advocate for mental health resources and support services.\nI have just begun this very conversation with a number of constituents.\nEvery conversation, no matter how small, contributes to a more supportive and understanding society.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_james-cleverly-questions-government-uk-mauritius-deal/content_6.html": "Speaking in a debate on the multi-billion pound cost of the UK-Mauritius deal, James Cleverly seeks clarification of the claim repeatedly made by the Government that if we do not pay, someone else will.\nMr James Cleverly (Braintree) (Con)\nI genuinely appreciate the opportunity that the Minister has given me to speak about this matter, but I want to clarify a point. She has said this a couple of times now, and I want to understand. She keeps saying that if we do not pay, someone else will. Who would be the recipient of that payment, given that the Chagos islands are British sovereign territory? Is she suggesting that another country would pay us? Why would another country pay Mauritius? The Chagos islands do not belong to Mauritius.\nThe Minister for Development (Anneliese Dodds)\nI know that the right hon. Gentleman understands full well that this is because of the legal uncertainty that is created by the current situation. That has been recognised time and again. It was the reason his Government engaged in 11 rounds of negotiations, and it is why there is this problem. I am surprised that Conservative Members are so unconcerned about the contestation that we see in that part of the world, and the need for our country’s interests to be put first.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_parliament_james-cleverly-calls-greater-awareness-and-early-diagnosis-breast-cancer/content_9.html": "James Cleverly highlights the importance of early diagnosis and treatment of breast cancer and asks what the Government are doing to encourage greater awareness of the full range of breast cancer symptoms, and to encourage women to get early diagnosis and treatment.\nMr James Cleverly (Braintree) (Con)\nEarly diagnosis and treatment of breast cancer can make a huge difference to the women involved, and, of course, to the prognosis and the cost to the state of health provision. I welcome the reference in the cancer plan to early diagnosis, but what specifically will the Government do to encourage greater awareness of the full range of breast cancer symptoms, and to encourage women to get early diagnosis and treatment for better outcomes?\nThe Minister for Secondary Care (Karin Smyth)\nI thank the right hon. Gentleman for that question and for the work he has supported on behalf of his wife to raise awareness. Screening access and uptake are shockingly low across the country right now, and looking at that is a key part of what we need to do to ensure that women come forward for the screening test. The AI work will support the faster response time so that we can get women treated more quickly, and will absolutely form part of what we need to do in the coming years.",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_praise-our-local-shops/content_41.html": "James Cleverly writes for the Braintree & Witham Times.\nHigh street shops have had a tough time during the pandemic. I’m proud that financial support from both central and local governments have helped businesses across Braintree, Halstead and beyond to stay afloat. Local businesses are the life-blood of our towns and villages. They create jobs, drive our local economy and are a visible sign of a healthy local community. This is something I am passionate about, so this month’s column is a love letter to our independent high street shops.\nFeeling peckish on a stroll through Braintree? How about a coffee from Toast, or a shake from Shake Express, afternoon tea at the Glass House or something delicious from Baby Bakes? If you want to delight someone special, perhaps flowers from Fleurtations or Bernard Chapman or a gift from Fever Accessories, some vinyl records or pop-culture collectibles from Blast, or even a string of sausages from Beaumont’s butchers (it might be more their thing). The options for dinner and drinks are now boosted by Number 92, Mosaic and the Chop House, along with our core of pubs and bars.\nHalstead was featured in the Daily Telegraph as a triumph with 73 per cent of the shops now being independent. An afternoon can be happily lost exploring homeware at Evans, Willow and Grey or Ispirato Interiors. A new spring outfit from Anouk, or Ruby and Violet, or Hardys menswear, or perhaps Black Valley Tattoo for something more permanent. There is also Retroformers or Toy Crazy for games, toys, models and other indoor pastimes, the wonderful Lobb’s Cycles for outdoor fun and the new Puppy Care Emporium which now fills the prominent position at the top of the hill.\nI can’t name all the great shops we have on our doorstep and please flag the ones I’ve missed out.\nBraintree and Halstead are packed full of fantastic, interesting independent local shops.\nIf we don’t use them, we’ll lose them",
  "http_www_cleverly4braintree_com_/https_www_cleverly4braintree_com_news_james-cleverly-visits-maycast-nokes-precision-engineering-ltd/content_2.html": "18 March 2025\nJames Cleverly visits Maycast-Nokes Precision Engineering Ltd\nJames Cleverly visits Maycast-Nokes Precision Engineering Ltd for a tour of their cast metal production facility to see their mix of ancient technology and cutting edge technology producing metal casting for the automotive and aeronautical industries."
}