{
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_teams_ulv/content_11.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_donate/content_5.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the windowYour local Lib Dem team are working hard across the constituency but we need your help to win! The cost of printing 1,000 A3 leaflets is around £100. What ever you can give will be a huge help! With your help, we really can win in Morecambe & Lunesdale.\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_new-hospital/content_24.html": "Fund a New Hospital for Lancaster and Morecambe\nWe need a new hospital for Lancaster and Morecambe\nLancaster and Morecambe Lib Dems are fighting to make sure that the Conservative Government funds a new state-of-the-art hospital in our area.\nSince 2020, your local Lib Dem team have fought and won to protect the Royal Lancaster Infirmary from closure and being replaced by a “super hospital” near Preston!\nOver 9,000 people backed Lib Dem petitions opposing the merger of the Royal Lancaster Infirmary and Royal Preston Hospital. This sent a clear message to the Department of Health that a single site was not the right solution as people would have been forced to travel further.\nNow the Lib Dems are fighting to make sure that we get the new hospital we need in our area.\nFund a New Hospital for Lancaster and Morecambe\nWe need a new hospital in Lancaster and Morecambe",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news_page-2/content_21.html": "Ambulance delays: Heart attack victims in Lancaster and Morecambe waiting nearly 30 minutes for help\nPotential heart attack and stroke victims in Lancaster and Morecambe are waiting an average of 29 minutes for an ambulance to arrive, shocking new figures have revealed.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_teams_ULV/content_18.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_teams_poulton/content_6.html": "Poulton Liberal Democrats\nWorking hard for you all year round!\nCouncillor Paul Hart\nMorecambe Town Councillor for Polulton\nContact\nEMAIL:\nhartp177@gmail.com\nTELEPHONE:\n07944 856279\nJohn Livermore\nLocal Business owner and campaigner\nContact\nEMAIL:\nTELEPHONE:\n07500 908590",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news_article_ambulance-delays/content_10.html": "Ambulance delays: Heart attack victims in Lancaster and Morecambe waiting nearly 30 minutes for help\nPotential heart attack and stroke victims in Lancaster and Morecambe are waiting an average of 29 minutes for an ambulance to arrive, shocking new figures have revealed.\nThe data was obtained through a Freedom of Information request by the Liberal Democrats, who are calling for urgent action to tackle local ambulance delays.\nThe figures show that the NHS target of 18 minutes for Category 2 ambulance calls, which covers urgent incidents like strokes and potential heart attacks, is being badly missed in Lancaster and Morecambe.\nAmbulance delays have also significantly worsened in recent years, with the average response time increasing by over 75% for Category 2 calls since 2019.\nThe average response time for Category 1 calls, which are the most urgent and life-threatening, was 8 and half minutes, up 16.21% since 2019.\nJake Perkins is backing the Liberal Democrat’s five point plan to support local ambulance services, which would see a paramedic recruitment campaign and improvements in social care to reduce pressures on hospital beds.\nLocal campaigner Jake Perkins said:\n“Behind these figures are devastating stories of pensioners left stranded for hours, or families in Lancaster and Morecmabe watching a loved one die before a paramedic could reach them.\n“Paramedics on the frontline do an incredible job day in day out, looking after people in their time of need. But our overstretched local NHS services are collapsing under the strain of years of neglect under this Conservative government.\n“The Liberal Democrats have provided a clear plan to tackle these shocking delays and make sure ambulances reach people on time in an emergency. That means addressing workforce shortages, fixing the social care crisis and ending the shortage of hospital beds, all of which are leaving patients in ambulances stuck outside A&E for hours.”\nAmbulance Crisis - Liberal Democrat 5 Point Winter Plan\n- Launch a campaign to retain, recruit and train paramedics and other ambulance service staff. Like all health and care services, it needs to be properly staffed.\n- Bring forward a fully funded programme to get people who are medically well enough discharged from hospital and set up with appropriate social care and support. This will allow people to leave hospital sooner and make more space available for new arrivals. The Government’s current attempt at this through the Adult Social Care Discharge Fund is not good enough, as the funds will come from existing NHS budgets putting even more pressure on other services. It will also not be deployed in full until January next year.\n- In addition to getting people out of hospital so that they get care in a more comfortable setting, the number of beds in hospitals needs to be increased to end excessive handover delays for ambulances, caused by a lack of bed capacity. Any new beds must come with increases in staff to care for those extra patients.\n- Expand mental health support services to get people the appropriate care they need and reduce the number of call outs for ambulances for mental health reasons. Learning from hospitals that have set up ‘emergency mental health departments’, will not only to get people more appropriate care but relieve pressure on A&Es and ambulances.\n- Pass Daisy Cooper MP’s Ambulance Waiting Times Bill into law that would require accessible, localised reports of ambulance response times to be published.[2] This would ensure that ‘hot spots’ with some of the longest waiting times can be identified routinely. 12 hour waits at A&E should also be published from arrival at hospital rather than the ‘decision to admit’ as is current practice, so that the true scale of the problem is clear for all to see.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news_page-1/content_28.html": "Ambulance delays: Heart attack victims in Lancaster and Morecambe waiting nearly 30 minutes for help\nPotential heart attack and stroke victims in Lancaster and Morecambe are waiting an average of 29 minutes for an ambulance to arrive, shocking new figures have revealed.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news_page-3/content_22.html": "Ambulance delays: Heart attack victims in Lancaster and Morecambe waiting nearly 30 minutes for help\nPotential heart attack and stroke victims in Lancaster and Morecambe are waiting an average of 29 minutes for an ambulance to arrive, shocking new figures have revealed.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_stop-sewage/content_26.html": "Stop Sewage Dumping in the River Lune and Morecambe Bay\nSewage hitting the headlines\nUnited Utilities have been in the press for dumping sewage in our rivers and water ways.\n\"Sewage overflows are threatening public health and wildlife at beauty spots... with the worst leak lasting for 8,500 hours, experts warn.\"\nThe Daily Mail, Nov 2021\n\"Swimmers in sea at Morecambe and Heysham Complain of raw sewage floating past.\"\nThe Lancaster Gurdian, Aug 2022\n\"The longest sewage dump event into shellfish water last year took place at Morecambe Bay by United Utilities - lasting 5,000 hours.\"\nBeyond Radio, Aug 2022\nStop dumping in the River Lune and Morecambe Bay\nThe Lib Dems have been kicking up a stink about water companies dumping sewage into our rivers. United Utilities discharged sewage for 8,490 hours or 353 days into the River Lune, Sedbergh in 2020 - this was the worst in the UK. They have been able to continue in 2021, at Hornby they discharged 1,599 hours into the River Wenning which flowed into the Lune. The Conservatives have let United Utilities and other water companies rake in profits and continue to dump in our waterways. If you’re fed up of water companies getting a free pass on dumping sewage in our rivers.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_teams_bare/content_2.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk/content_1.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news_article_harbour-result/content_20.html": "Lib Dem Jake Perkins narrowly misses out\nIn the recent Harbour By- Election Lib Dem candidate Jake Perkins fell short by 77 votes losing to Labour.\nJake said, “I want to thank everyone who went out and voted - it’s important to make sure that your voice is heard. It was really great to have such a positive responses from so many people locally - rest assured that we will continue working hard for you.\n“I wish Cllr Pattinson the best in her new post. I’m proud that the Lib Dems ran an honest and positive campaign, that showed our record of action in the area, our positive vision for the West End and gave voters that truth about what goes on at Council.”\nThe Results were: Jake Perkins (Lib Dems) 479, Labour 555 [Elected], Conservatives 124.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_search/content_9.html": "Potential heart attack and stroke victims in Lancaster and Morecambe are waiting an average of 29 minutes for an ambulance to arrive, shocking new figures have revealed.\nBack British Farmers Will you join the Lib Dems backing British farmers? \"We need to support our farmers - their way of life is under threat and the govermnet is doing nothing to protect them.…\nGet Involved As Liberal Democrats, we rely on volunteers to fight and fund our campaigns. With your support we can make a huge difference to our communities. donate\nThe Lib Dems have been kicking up a stink about water companies dumping sewage into our rivers and waterways.\nLocal Lib Dems are demanding for the Conservative Government funds a new state-of-the-art hospital in our area.\nFund a New Hospital for Lancaster and Morecambe We need a new hospital for Lancaster and Morecambe Since 2020, your local Lib Dem team have fought and won to protect the Royal…\nStop Sewage Dumping in the River Lune and Morecambe Bay Sewage hitting the headlines \"Sewage overflows are threatening public health and wildlife at beauty spots... with the worst leak lasting for…\nPoulton Liberal Democrats Councillor Paul Hart Morecambe Town Councillor for Polulton Contact EMAIL: hartp177@gmail.com TELEPHONE: 07944 856279 John Livermore Local Business owner and…",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news_article_united-utilities-dirty-secret/content_27.html": "United Utilities’ Dirty Secret\nThe Lib Dems have been kicking up a stink about water companies dumping sewage into our rivers and waterways.\nUnited Utilities discharged sewage for 8,490 hours or 353 days into the River Lune, Sedbergh in 2020 - this was the worst in the UK. They have been able to continue in 2021, at Hornby they discharged 1,599 hours into the River Wenning which flowed into the Lune.\nLast year it was revealed that United Utilities discharged sewage for 8,490 hours or 353 days into the River Lune, Sedbergh in 2020 - this was the worst in the UK. They have been able to continue in 2021 and 2022, where it’s come out that 5,000 hours of sewage has been dumped into Morecambe Bay.\nLib Dem Councillor Joyce Pritichard said, “The whole thing stinks to high hell, the Conservatives have let United Utilities and other water companies rake in profits and continue to dump in our waterways. It’s undermining the hard work that local people have put in to tidy up our town and puts off tourists from thinking of Morecambe as a resort they want to visit. Action needs to be taken!”\nThe Conservatives have let United Utilities and other water companies rake in profits and continue to dump in our waterways.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_teams/content_7.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_teams_llv/content_19.html": "Lower Lune Valley Liberal Democrats\nWorking hard for you all year round!\nCouncillor Joyce Pritchard\nLancaster City Councillor for Lower Lune Valley\nMayor of Lancaster, 2022-2023\nContact\nEMAIL:\nTELEPHONE:\n07791 640016\nPeter Jackson\nLocal Business owner and campaigner\nContact\nEMAIL:\nTELEPHONE:\n07867 527918",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_join/content_17.html": "Our terms of membership\nWhat our Constitution says:\n\"Membership of the Party or participation in its Registered Supporter Scheme is open to all persons who agree with its fundamental values and objectives without discrimination as to race, ethnicity, caste, heritage, class, religion or belief, age, disability, sex, gender identity or sexual orientation.\"\n\"Members or Registered Supporters of the Liberal Democrats must treat others with respect and must not bully, harass, or intimidate any Party member or Registered Supporter, member of staff employed to support Liberal Democrats, Party volunteer, or member of the public. Such behaviour will be considered to be bringing the Party into disrepute.\"\n\"Members or Registered Supporters of the Liberal Democrats must abide by the Party’s data protection rules as laid out in the Member’s Data Protection Code.\"\n- Article 3.1, Federal Constitution of the Liberal Democrats\nClose the windowPolitical Party Elections and Referendums Act 2000 (PPERA)\nUnder the Political Party Elections and Referendums Act 2000 (PPERA) you must be on the electoral register in the UK excluding the Channel Islands and the Isle of Man in order to make a donation or subscription payment of more than £500.\nIf you make a donation or subscription payment of more than £7,500 to the Party, we are obliged under the Political Parties Elections and Referendums Act 2000 to report such a donation to the Electoral Commission, who will publish the fact that you have made a donation over £7,500. For more information, please see http://www.electoralcommission.org.uk.\nClose the windowYour Membership\nAll applications for membership will be subject to acceptance by the relevant local party.\nAs a member of the Liberal Democrats, you will be a member of a State Party (English, Scottish, or Welsh), a local party, and the Federal Liberal Democrats.\nAll members must abide by rules laid out in the joint Constitutions of the Liberal Democrats. Failure to abide by rules laid out in these documents may lead to sanctions against members up to and including expulsion from the Party.\nClose the windowQuestions\nIf you have any questions about the Party or your membership, you can get in touch with our Customer Services team on 0207 022 0988, or at help@libdems.org.uk.\nClose the windowThis policy was last updated on the 2nd May 2018\nIntroduction\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\n- How we may collect personal data about you\n- How we may use your personal data\n- Why the Party is allowed to use your information in this way\n- The circumstances under which we may share your personal data or disclose it to others\n- Additional details about cookies and technical information\n- Data retention policies\n- Your rights over personal data\n- How to contact us\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nThe Party may collect personal data from you via means such as:\n- In person, when you speak to one of our representatives or volunteers\n- Through a telephone call, either where you call us or we call you\n- On paper, such as if you return a printed survey or a reply slip on a leaflet\n- Digitally, such as if you fill in a form on a website or interact with the party online\n- When you offer or ask about volunteering, or take part in party activities\n- When you enter into a transaction with the party, such as donating, joining, purchasing a product or paying for an event\n- Indirectly from other public records or sources, including the full electoral register which the party is legally entitled to\n- On social media platforms, where you have made the information public, or you have made the information available in a social media forum run by the Party\nWe may collect personal data about you such as:\n- Name\n- Contact details (e.g. email address, address, telephone / mobile number)\n- Date of birth\n- Future communication preferences\n- Information about your financial transactions with the Party\n- Racial or ethnic origin\n- Family details\n- Political opinions\n- Religious or other beliefs\n- Other demographic information\n- Information about your home (e.g. whether it is a flat or house)\n- Issues you raise\n- Topics you are interested in\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\n- Your IP address\n- Your device, browser or operating system\n- Details of the links that you click and the content that you view\n- Your username or social media handle\n- Any other information you share when using third party sites (e.g. sending a tweet or using the Like function on Facebook) We may also place one or more cookies on your device. For further details on this, see below.\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\n- Lifestyle and social circumstance\n- Goods or services purchased\n- Charities you support\nHow we may use your personal data\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\n- Contact you to canvass for political support\n- Understand your views and issues important to you\n- Process surveys you have participated in\n- Tell you about policies, campaigns or individuals that may be of interest to you\n- Respond to queries that you raise with us\n- Administer offers or applications to volunteer for the party or to become, remain or cease being a member of or candidate for the party\n- Conduct fundraising activities, including checking your eligibility to donate\n- Manage our sites and services\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nWhy the Party is allowed to use your information in this way\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe circumstances under which we may share your personal data or disclose it to others\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nAdditional details about cookies and technical information\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\n- Improving your experience of visiting the site, including providing personalised content\n- Gathering information you have submitted via the site\n- Processing requests for information or action that you have made through the site\n- Processing login requests\n- Enabling your activity in one place to be used to decide on what information, if any, to present to you in other places\n- Gathered statistical information about the usage of the site\n- Ensuring the smooth operation of online services\n- Remembering whether or not you have been shown a cookie notification message on an earlier visit to the site\n- To make sure online adverts you may receive from us are relevant to your interests.\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nData retention policies\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYour rights over personal data\nYou have legal rights over any of your personal data that we hold.\nRight of access\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nRight to rectification and erasure\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nRight to restrict processing\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nRight to opt out of processing relating to your political opinions\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nRight to portability\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nRight to stop receiving communications\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nSMS Messages\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nPost and Telephone\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nOnline Advertising\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nGeneral\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nExercising your rights\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nHow to contact us\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news/content_12.html": "Ambulance delays: Heart attack victims in Lancaster and Morecambe waiting nearly 30 minutes for help\nPotential heart attack and stroke victims in Lancaster and Morecambe are waiting an average of 29 minutes for an ambulance to arrive, shocking new figures have revealed.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_teams_silverdale/content_15.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news_page-4/content_25.html": "Ambulance delays: Heart attack victims in Lancaster and Morecambe waiting nearly 30 minutes for help\nPotential heart attack and stroke victims in Lancaster and Morecambe are waiting an average of 29 minutes for an ambulance to arrive, shocking new figures have revealed.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_get-involved_volunteer/content_8.html": "Become a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_teams_west-end/content_3.html": "West End Liberal Democrats\nWorking hard for you all year round!\nCouncillor Catherine Pilling\nMorecambe Town Councillor for Harbour\nContact\nEMAIL:\nTELEPHONE:\n07817 317 481\nCouncillor Jim Pilling\nMorecambe Town Councillor for Lune Drive\nContact\nEMAIL:\nTELEPHONE:\n07970 904022\nJake Perkins\nLocal Campainger for the West End\nContact\nEMAIL:\nTELEPHONE:\n07480 064565",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_campaigns/content_13.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_sign-up-for-updates/content_4.html": "The Liberal Democrats may use the information you provide, including your political opinions, to further our objectives and share it with our elected representatives. Any data we gather will be used in accordance with our privacy policy:\nlibdems.org.uk/privacy. You can exercise your rights and withdraw your consent to future communications by contacting us:\ndata.protection@libdems.org.uk or: DPO, Lib Dems, 1 Vincent Square, SW1P 2PN.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_get-involved/content_14.html": "Join as a concessionary member\nDiscounted membership for people who currently receive state benefits. Become a member starting at just 50p a month.\nAs a member you can:\n- ✔ Decide our party policy.\n- ✔ Stand for election and choose our candidates.\n- ✔ Vote in future Liberal Democrat leadership elections.\nJoin now ▶",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_backfarmers/content_23.html": "Back British Farmers\nWill you join the Lib Dems backing British farmers?\nFarmers in the Lune Valley and across the whole district are struggling because the Conservatives have let them down.\n\"We need to support our farmers - their way of life is under threat and the govermnet is doing nothing to protect them. That's why the Liberal Democrats are committed to supporting farmers in our area. You can do that by signing our petition but also by buying local produce. There are so many fantastic local producers you can support.\"\nCllr Ross Hunter, Upper Lune Valley\nBack British Farmers\nFarmers across the country are worried about their future. They’re worried that the UK will be flooded with poor quality food that undercuts the food they produce to high environmental and animal welfare standards. The Conservatives have sold out our farmers.",
  "https_www_lancsmorelibdems_org_uk_/https_www_lancsmorelibdems_org_uk_news_article_lib-dems-demand-funding-for-new-hospital/content_16.html": "Lib Dems demand funding for new Hospital\nLocal Lib Dems are demanding for the Conservative Government funds a new state-of-the-art hospital in our area.\nSince 2020, your local Lib Dem team have fought and won to protect the Royal Lancaster Infirmary from closure and being replaced by a “super hospital” near Preston! Over 9,000 people backed Lib Dem petitions opposing the merger of the Royal Lancaster Infirmary and Royal Preston Hospital. This sent a clear message to the Department of Health that a single site was not the right solution as people We need a new hospital for Lancaster and Morecambe.\nNow that the “super hospital” is off the table, Lancaster and Morecambe Lib Dems are fighting to make sure that the Conservative Government funds a new state-of-the-art hospital in our area.\nLocal Campaigner, Jake Perkins said \"We need a new hospital in our area. The RLI just isn't fit for purpose, and we have the opportunity to build a brand new state-of the-art hospital that we deserve. Your local Lib Dems will continue to protect our hospital and secure investment in our local health services!\"\n\"We've launched a petition calling on the Conservatives to fund the new hospital in Lancaster and Morecambe we deserve!\""
}