{
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_profiles_darren-selkus-2024/content_31.html": "A proud resident of Hertsmere, refuses to be just another cog in the political machine. Disillusioned by the empty promises and lack of accountability from mainstream politicians, he has taken on the role of Reform UK Branch Chair for Hertsmere with a fierce determination to challenge the status quo.\nDarren's journey into politics was catalyzed by the aftermath of the 2016 Brexit referendum, where he witnessed the disregard for the democratic process first hand. This spurred him to join the Brexit Party and eventually become the Prospective Parliamentary Candidate for Epping Forest. Since then, his passion for reform and accountability has only grown stronger.\nHis platform is bold and unapologetic. Darren advocates for a smaller state where individuals have more control over their lives. He is opposed to the Net Zero agenda, viewing it as economically damaging and environmentally ineffective. Darren is committed to reducing taxes, fostering economic growth, and implementing sensible immigration policies. Furthermore, he aims to overhaul public services, including the NHS, to ensure they are efficient and accessible to all.\nhttps://www.facebook.com/DarrenSelkus2020\nHe proposes the creation of a new Department for Efficiency and Accountability (DEA) and is eager to play a key role in its establishment. The DEA would tackle waste, inefficiency, and bureaucracy in the public sector, ensuring taxpayer money is spent effectively to fix our failing public services and provide the quality services the British people deserve.\nFor Darren, politics is not about personal gain; it's about making a tangible difference in the lives of ordinary people. In the General Election on the 4th July he stood in Hertsmere as the Reform UK Parliamentary Candidate against Sir Oliver Dowden MP increasing his vote share by seven times from the Council Election just a year previous.\nIn a political landscape marred by apathy and disillusionment, Darren Selkus stands out as a beacon of hope for those yearning for real change. With his unwavering dedication, military discipline, and business acumen, he is poised to challenge the entrenched interests and truly represent the voices of Hertsmere. As he aptly puts it, \"If you want change, you have to change your vote.\" And Darren Selkus is here to lead that change.\nChair Reform UK Hertsmere\nTelephone: 07513 839952",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_privacy-policy/content_19.html": "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.\nWe use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.\nInterpretation and Definitions\nInterpretation\nThe words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.\nDefinitions\nFor the purposes of this Privacy Policy:\n-\nAccount means a unique account created for You to access our Service or parts of our Service.\n-\nCompany (referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to reformuk-herts.uk.\n-\nCookies are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses.\n-\nCountry refers to: United Kingdom\n-\nDevice means any device that can access the Service such as a computer, a cellphone or a digital tablet.\n-\nPersonal Data is any information that relates to an identified or identifiable individual.\n-\nService refers to the Website.\n-\nService Provider means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used.\n-\nUsage Data refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).\n-\nWebsite refers to reformuk-herts.uk, accessible from https://reformuk-herts.uk\n-\nYou means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.\nCollecting and Using Your Personal Data\nTypes of Data Collected\nPersonal Data\nWhile using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:\n-\nEmail address\n-\nFirst name and last name\n-\nPhone number\n-\nAddress, State, Province, ZIP/Postal code, City\n-\nUsage Data\nUsage Data\nUsage Data is collected automatically when using the Service.\nUsage Data may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.\nWhen You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.\nWe may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.\nTracking Technologies and Cookies\nWe use Cookies and similar tracking technologies to track the activity on Our Service and store certain information. Tracking technologies used are beacons, tags, and scripts to collect and track information and to improve and analyze Our Service. The technologies We use may include:\n- Cookies or Browser Cookies. A cookie is a small file placed on Your Device. You can instruct Your browser to refuse all Cookies or to indicate when a Cookie is being sent. However, if You do not accept Cookies, You may not be able to use some parts of our Service. Unless you have adjusted Your browser setting so that it will refuse Cookies, our Service may use Cookies.\n- Flash Cookies. Certain features of our Service may use local stored objects (or Flash Cookies) to collect and store information about Your preferences or Your activity on our Service. Flash Cookies are not managed by the same browser settings as those used for Browser Cookies. For more information on how You can delete Flash Cookies, please read \"Where can I change the settings for disabling, or deleting local shared objects?\" available at https://helpx.adobe.com/flash-player/kb/disable-local-shared-objects-flash.html#main_Where_can_I_change_the_settings_for_disabling__or_deleting_local_shared_objects_\n- Web Beacons. Certain sections of our Service and our emails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an email and for other related website statistics (for example, recording the popularity of a certain section and verifying system and server integrity).\nCookies can be \"Persistent\" or \"Session\" Cookies. Persistent Cookies remain on Your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your web browser. Learn more about cookies on the Free Privacy Policy website article.\nWe use both Session and Persistent Cookies for the purposes set out below:\n-\nNecessary / Essential Cookies\nType: Session Cookies\nAdministered by: Us\nPurpose: These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts. Without these Cookies, the services that You have asked for cannot be provided, and We only use these Cookies to provide You with those services.\n-\nCookies Policy / Notice Acceptance Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies identify if users have accepted the use of cookies on the Website.\n-\nFunctionality Cookies\nType: Persistent Cookies\nAdministered by: Us\nPurpose: These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference. The purpose of these Cookies is to provide You with a more personal experience and to avoid You having to re-enter your preferences every time You use the Website.\nFor more information about the cookies we use and your choices regarding cookies, please visit our Cookies Policy or the Cookies section of our Privacy Policy.\nUse of Your Personal Data\nThe Company may use Personal Data for the following purposes:\n-\nTo provide and maintain our Service, including to monitor the usage of our Service.\n-\nTo manage Your Account: to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user.\n-\nFor the performance of a contract: the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.\n-\nTo contact You: To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.\n-\nTo provide You with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.\n-\nTo manage Your requests: To attend and manage Your requests to Us.\nRetention of Your Personal Data\nThe Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy. We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.\nThe Company will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.\nTransfer of Your Personal Data\nYour information, including Personal Data, is processed at the Company's operating offices and in any other places where the parties involved in the processing are located. It means that this information may be transferred to — and maintained on — computers located outside of Your state, province, country or other governmental jurisdiction where the data protection laws may differ than those from Your jurisdiction.\nYour consent to this Privacy Policy followed by Your submission of such information represents Your agreement to that transfer.\nWe will take all steps reasonably necessary to ensure that Your data is treated securely and in accordance with this Privacy Policy and no transfer of Your Personal Data will take place to an organization or a country unless there are adequate controls in place including the security of Your data and other personal information.\nDisclosure of Your Personal Data\nLaw enforcement\nUnder certain circumstances, the Company may be required to disclose Your Personal Data if required to do so by law or in response to valid requests by public authorities (e.g. a court or a government agency).\nOther legal requirements\nThe Company may disclose Your Personal Data in the good faith belief that such action is necessary to:\n- Comply with a legal obligation\n- Protect and defend the rights or property of the Company\n- Prevent or investigate possible wrongdoing in connection with the Service\n- Protect the personal safety of Users of the Service or the public\n- Protect against legal liability\nProfiling\nReformUK-herts.uk aims to create and maintain a profile for each registered voter in the UK. We will do this by merging the Electoral Register(s) with other data that may be lawfully available to us. For more detailed information about this type of processing, you may wish to read the ICO Draft framework code of practice for the use of personal data in political campaigning. If you wish, you can ask us not to maintain a profile in your name using the contact details above and we will take steps to remove you from our systems.\nReform UK will respect the wishes of the people and aim to fully comply with the Information Commissioner’s Office (ICO), in particular the specified requirements for Political Parties set out by the ICO in the report, titled Democracy Disrupted, dated 11 July 18.\nSecurity of Your Personal Data\nThe security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.\nChildren's Privacy\nOur Service does not address anyone under the age of 15. We do not knowingly collect personally identifiable information from anyone under the age of 15. If You are a parent or guardian and You are aware that Your child has provided Us with Personal Data, please contact Us. If We become aware that We have collected Personal Data from anyone under the age of 15 without verification of parental consent, We take steps to remove that information from Our servers.\nIf We need to rely on consent as a legal basis for processing Your information and Your country requires consent from a parent, We may require Your parent's consent before We collect and use that information.\nLinks to Other Websites\nOur Service may contain links to other websites that are not operated by Us. If You click on a third party link, You will be directed to that third party's site. We strongly advise You to review the Privacy Policy of every site You visit.\nWe have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.\nChanges to this Privacy Policy\nWe may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.\nWe will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.\nYou are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.\nContact Us\nIf you have any questions about this Privacy Policy, You can contact us:\n-\nBy email:\nThis email address is being protected from spambots. You need JavaScript enabled to view it. -\nBy visiting this page on our website: https://reformuk-herts.uk/contact",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_policies_reform-economic-policy/content_9.html": "To succeed faster growth is vital. Higher growth rates are the only way to better wages and more tax revenues that can be invested in better healthcare and other public services. Our bold economic vision frees up over 6 million people from paying Income Tax and frees up over 1.2 million small businesses and self-employed from paying Corporation Tax. We would also aim to remove a raft of other stifling taxes in a responsible, timely way. This will generate much faster growth than seen in recent decades. We must also stop wasting taxpayers’ money.\nThe Government has increased taxes to the highest level in 70 years with more taxes to come. Medium-term growth is expected to be the lowest for 60 years. This means lower wages and less money to invest in health and other public services. Inflation is at the highest level for over 30 years and productivity is at the lowest for 20 years, with 1 in 8 people of working age on out of work benefits, totalling well over 5 million.\nThe combined works of Harry Potter are fun but dwarfed by our tax code of some 20,000 pages, the most complex in the world. This stifles growth and creates an industry of unproductive tax avoidance.\nSmart money and smart people will not invest in the UK nor come to the UK in a mobile world if they think we are uncompetitive in tax terms.\nReform UK is the only party that stands for cutting taxes and simplifying taxes to create higher growth, better wages and better healthcare.\nReform UK will also oppose the creation of a Central Bank Digital Currency (CBDC) and all attempts to turn Britain into a cashless society.\nStimulus Plan\n- Free up 6 million people from paying Income Tax by lifting the minimum threshold to £20,000 from £12,571 p.a. This amounts to 1 in 5 taxpayers. Basic Income Tax rate stays at 20%.\n- The less well-off benefit proportionately the most, saving £1,500 p.a. @£20,000 salary, circa £30 per week.\n- Free up 1.2 million SMEs from paying Corporation Tax (over 80% of companies) by lifting the minimum profit threshold to £100,000.\n- Reduce the cost of living by lowering consumer taxes, which will reduce inflation whilst stimulating growth:\n- scrap vat on energy bills, saves £100's / year per household\n- Scrap environmental levies = saves £160 / year per household.\n- Lower fuel duty by 20p / litre = saves £240 / year per driver.\n- Lower VAT from 20% to 18% = saves £300 / year per household.\n- Funded by cost savings totalling approximately £85 billion:\n- Reduce wasteful Government spending: £5 in £100 = £50 billion per year.\n- Enable over 1 million out of the over 5 million on out of work benefits back into jobs: saves circa £15-20 billion per year. Some 1.5 million more people are on benefits than pre-Covid, so a return just to 2019 levels is eminently realistic.\n- Tax the Renewable Energy industry the full amount of the circa £11 billion in subsidies they currently receive under old contracts; they claim it is cheaper than other energy forms, so they no longer need taxpayer support.\n- Remove vast swathes of unnecessary regulations that hinder growth.\nAll figures are approximate and based on estimates.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_policies_reform-uk-education-policy/content_15.html": "On education let's invest more wisely in young people, university students are being ripped off with high fees often for just online learning many degree courses could be done 2 years not 3 which would save thousands of pounds.\nWe would scrap interest rates on student loans and extend the capital repayment period, which will improve the debt recovery rate.\nWe would introduce a new workable apprenticeship scheme. We have to be honest that many young people would be better off learning whilst in work, rather than accruing debt at university.\nOur schools and pupils need better technology to give them the best chances as we help prepare them for life. Covid has changed so much. Our children learn best in school and never again must we shut them, forcing children to learn from home for weeks on end.\nSchools must focus on the basics of teaching every child to read and write.\nTeachers must be free to teach pupils how to think, not what to think, without fear of the woke police or religious persecution.\nWe must keep divisive woke ideologies such as Critical Race Theory (CRT) and gender ideology out of the classroom. Sex education should also always be age-appropriate.\nThere are only 2 sexes and 2 genders, and it is a safeguarding issue to confuse children by suggesting otherwise.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_hb-council-candidates/content_7.html": "Bridgewater\nFred Philpott\nI grew up in in Harrow, Middlesex, leaving school at 15 with no qualifications to become a solider. In my seven years in the ranks, I was stationed in Wales, Sussex, Kent, Germany, Singapore and Hong Kong. The Army was great and allowed me to get educated with qualifications which gained me a place at King’s College, London, from where my law degree allowed me to become a barrister; a profession in which I still work.\nMy wife, Liz, and I have lived in Redbourn for over 35 years but are very much in contact with Flamstead and the surrounding villages.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_hertsmere_english-devolution-white-paper-hertsmeres-response/content_27.html": "Joint statement from Leader of Hertsmere Borough Council, Cllr Jeremy Newmark and Chief Executive, Sajida Bijle – Responding to the English Devolution White Paper\n“We have noted the content of the White Paper in which the Government announces that it will ‘facilitate a programme of local government reorganisation for two-tier areas’ and will be inviting proposals for reorganisation from all these areas on how new unitary councils could be created.\nAs the county of Hertfordshire operates a two-tier system of local government we will be carefully considering what this means for our communities in Hertsmere and the services we provide, and for local government structures in Hertfordshire more widely.\nWe will also be talking to our partners from across the borough and the county about what potential options and opportunities the proposals could bring for this area. We will be working through the Herts Growth Board to assess the economic implications of reorganisation. Collectively we will push the Government to ensure we have an active say in how future changes take shape and to strongly make the case against creating vast, remote council areas with weak links to their communities.\nAs always, our priority remains delivering excellent services to our residents and businesses and putting our communities at the heart of everything we do, and supporting our people to do that as effectively and efficiently as possible.\nThrough all our discussions and future planning, we will remain committed to ensuring that any reorganisation is done in a way that enhances our local democracy and local services in Hertsmere.”",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_policies_reform-uk-energy-policy/content_22.html": "Reform our Energy Strategy:\nWe all care about the environment and want cleaner air, and we can do this in a strategic, affordable way.\nYet the Westminster Net Zero plan is making us all net poorer whilst creating more emissions overall as it outsources them overseas. It is therefore net stupid. It is adding huge extra costs to us all as consumers and to our businesses. This will send hundreds of thousands of British jobs to China and elsewhere. Our energy plan will use our own energy treasure under our feet, and create thousands of British jobs, by making our industries competitive again. It will save consumers considerable amounts of money on their bills every year. We would also nationalise 50% of key utility companies to stop consumers being ripped off with the other 50% being owned by British pension funds for British pensioners\nTOTALLY UNNECESSARY\n- Have vast resources energy treasure in UK under our feet and under our seas - owned by us all\n- North Sea oil & gas, onshore shale gas, coal\n- Could have been totally self reliant (like 1980s to 2000s) thus barely exposed to this global energy crisis\n- Must correct but will take 5-10 years",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_b-council-candidates/content_28.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nCouncil Candidates\nGroup by\nNone\nWard\nImage\nFull Name\nAbout Me\nClear filters\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_policies/content_4.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nPolicies\nOur Contract with You\nRead more …\nSpending Policy\nRead more …\nInstitutions Policy\nRead more …\nImmigration Policy\nRead more …\nLaw & Order Policy\nRead more …\nHealthcare Policy\nRead more …\nEducation Policy\nRead more …\nDefence Policy\nRead more …\nEnergy Policy\nRead more …\nEconomic Policy\nRead more …\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_herts-county-council-draft-budget-for-2025/content_10.html": "We have published our draft budget for the next financial year. The Integrated Plan outlines how we will spend more than £1.1 billion on public services that touch the lives of all residents at every milestone, while also working to protect people in Hertfordshire who need the most support.\nThe proposals for the coming budget year outline increased investment of £128 million compared to 2024/25 to protect, maintain and improve services.\nHighlights from the proposed 2025/26 budget include:\n- Nearly half a billion pounds will be spent supporting 30,000 adults to live well for longer, including an additional £30 million investment to support those providing care, ensuring that caring staff receive a living wage and to offset the increased National Insurance costs. £26m of additional investment will be spent to ensure that the council can meet the expected increase in demand from those requiring care.\n- Just over quarter of a billion pounds will be spent on children’s services, including £28m of additional investment to ensure we can continue to support Children Looked After and children with disabilities.\n- A further £2.8m of funding on top of the previous £7m investment will be made towards our SEND improvement programme ‘Making SEND Everyone’s Business’.\n- £100m will be spent on highways maintenance works to keep Hertfordshire moving, an increase of £6m from the previous year\n- Funding will be made available to improve flood protection and investigations.\n- New Prevention and Health Inequalities Fund of £3.4m to support residents to stay healthy and well and address health inequalities in Hertfordshire over the next three years.\n- Creating a new Carers Hub to allow carers to access greater levels of support\n- Further investment in a Domestic Abuse One Stop Shop to enhance support for people at medium and standard risk\nIn common with councils across the country, the budget has been set in an extremely challenging financial context with increasing demand for services and costs likely to rise over the next twelve months if inflation continues its upward trend and the impact of the introduction of higher employer National Insurance contributions is felt.\nRichard Roberts, Leader of the Council\nWe are now seeking your views on the proposed budget, complete our budget survey by Wednesday 5 February.\nTo reduce the burden placed on taxpayers, we will continue to drive down our own internal costs with plans to deliver £42 million savings by the end of the 2025/26 financial year, which is on top of £46 million savings agreed last year.\nDespite this, the current proposal presents a headline budget that requires the use of £3m of reserves in addition to having to raise Council Tax by 4.99 per cent (including 2 per cent to support Adult Social Care) in April.\nFrom keeping Hertfordshire moving to helping residents who need the most support, we will be spending over a billion pounds delivering services across Hertfordshire and focussing on what really matters to you. The current economic outlook for the country and changes recently made by the government, means that our own costs will rise in 2025, but rather than rest on our laurels, we are working hard to bring these under control so that as little of these additional costs are passed onto you. Years of prudent financial planning have put us in a good position, but once again we are going to have to access our reserves and make significant savings to balance the budget.\nPlease Visit Hertfordshire County Council for more information",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk/content_2.html": "Time for Change? - Time for Reform?\nAfter the MAY local elections, a raft of new councillors will be taking their seats in council chambers across the county. Many will have dreams of rejuvenating town centres, and ‘delivering’ for residents - if their pre-election leaflets are anything to go by.\nIt is that time in the political cycle that leaflets are pushed through the letter box telling you how bad the last council have been and how dreadful they have made residents lives.\nRupert Lowe: British farming should be a global success story\nWe shouldn't just be scrapping the inheritance tax assault on farmers, the entire approach to British agriculture needs to change.\nHertfordshire's Social Care and Children’s Care\nThree-quarters of your council tax money is spent on social care and children’s care. Next council year, £478 million will be spent on adult care across Hertfordshire and £257 million will be spent on children’s care.\nWe’ve hit our £28,000 target to fully fund Saba Poursaeedi’s legal fight for free speech!\n🎉We did it! Thanks to your incredible generosity, we’ve hit our £28,000 target to fully fund Saba Poursaeedi’s legal fight for free speech!\nHerts County Council Draft Budget for 2025\nWe have published our draft budget for the next financial year. The Integrated Plan outlines how we will spend more than £1.1 billion on public services that touch the lives of all residents at every milestone, while also working to protect people in Hertfordshire who need the most support.\nHertfordshire County Council buying NEW Offices despite having to save £42 Million\nHertfordshire County Council councillors have approved a motion on the 15th January to purchase New offices in Hemel Hempsted for a multi million pound deal and at the same meeting they were presented with budget plans that will require £42m of savings.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_sa-council-candidates/content_25.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nCouncil Candidates\nGroup by\nNone\nWard\nImage\nFull Name\nAbout Me\nClear filters\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_profiles_eleanor-jackson/content_26.html": "Eleanor Jackson is a lifelong resident of London Colney and went to school in St Albans. A Civil Engineer with 6+ years of experience working on projects including the Luton DART and Brent Cross West station, and an Incorporated Engineer member of the Institute of Civil Engineers (ICE).\nAfter being disillusioned by the failures of both the Local and County Councils, generalised tick-box agendas being pushed on St Albans targeting the greenbelt and stalling local services, and the noticeable decline in the benefits that St Albans residents are receiving in return for their ever-increasing council tax payments, Eleanor decided to get involved and push for the change she wanted to see.\n“St Albans is an area rich in history and green spaces, which must be protected to uphold its character. Consecutive councils have proved themselves to be secretive and inefficient, with St Albans District Council (SADC) failing to audit their books in the last four years, and Hertfordshire County Council relying on reserves to balance their spending. The current model and attitudes within the Councils is not working. St Albans residents deserve transparency, value for their money, and to have their concerns better represented when substantial changes are being imposed on their doorstep.”",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_contact/content_6.html": "If you've got something to say we would love to hear it.\nWhether it is feedback an idea or a chat just get in touch............",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_hertsmere_joint-statement-on-local-government-reform/content_29.html": "The Leader of Hertsmere Borough Council, Cllr Jeremy Newmark, who is also Chair of Herts Growth Board, has issued this joint statement alongside the other district and borough council leaders in Hertfordshire:\n\"Following the publication of the Devolution White Paper, and subsequent statements by the leader of Hertfordshire County Council, we would like to make it clear that we do not support the creation of one unitary council for Hertfordshire.\nOur county is diverse and made up of over 1.2 million residents across urban, suburban, and rural areas. Any reform of local government in Hertfordshire should follow a period of proper consultation with residents, businesses, elected representatives and stakeholders. Looking at the evidence, we should decide collectively what is best for our area. A single unitary council for the county risks diminishing local representation, with decision-making that is remote from the communities we serve.\nWe do not support postponing the county council elections scheduled for May 2025. The Government has indicated that this will only happen in priority areas who have clear and agreed plans. This is not the case in Hertfordshire, so we cannot be in the first phase of these reforms.\nWe recognise that the Government’s white paper sets a clear direction of travel. As Hertfordshire’s district and borough council leaders, we want to work collaboratively with others to agree how we respond to this. Any changes must be carefully considered, transparent, and inclusive, ensuring that residents and businesses are fully engaged in shaping the future governance of Hertfordshire.\nOur objective must be to get this right for our residents and businesses. That cannot be achieved if we make rushed decisions that have not been given the serious consideration that they deserve.\"\n20 December 2024\nhertsmere.gov.uk",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_policies_reform-uk-institutions-policy/content_21.html": "Reform the BBC\nBloated, wasteful and obligatory. The licence fee needs abolishing. People should be free to choose.\nReform the unelected, crony-filled House of Lords:\nRecent abuse has been offensive — a former Prime Minister ennobling his brother, mates and personal donors by making them peers is indefensible. A properly representative second House is needed.\nReform the Civil Service\nBetter leadership, more accountability, and greater welcome of successful people from the private sector to come in and serve the nation.\nReform the voting system\nTo make it more representative. Smaller parties mean more choice, new ideas, and better debate. Proportional representation is essential",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_branch-team_form_8/content_33.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nBranch Team\nBranch Team\nImages should be max 400px wide\ncreated\nid\nConstituency\nImage\nFirst Name\nLast Name\nFull Name\nPosition\nSave\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_weve-hit-our-gbp28-000-target-to-fully-fund-saba-poursaeedis-legal-fight-for-free-speech/content_3.html": "🎉We did it! Thanks to your incredible generosity, we’ve hit our £28,000 target to fully fund Saba Poursaeedi’s legal fight for free speech!\nA huge thank you to the 1,145 people who donated — your support sends a powerful message: political discrimination at work will not go unchallenged. Former housing officer @ReformSaba lost his job over his links to @reformparty_uk and for reposting a cartoon from The Telegraph — a satirical piece by award-winning cartoonist Matt Pritchett, known for his light-hearted humour.\nHightown Housing Association claimed that Reform UK’s policies on immigration, net zero, and housing were “in direct conflict” with its own values.” It also condemned the cartoon as “racist” — even though it simply mocked the UAE, an authoritarian state with a grim record on women’s rights and press freedom, buying a British newspaper.\nThis is a political witch hunt. One in five Britons say they’ll vote Reform at the next election — should supporting a mainstream party really cost someone their job? Especially when Hightown has no issue employing Labour Party organisers.\nNow, thanks to you, Saba can take his case to the Employment Tribunal and fight for justice. @HightownHA, Hi! We're ready if you are.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_broxbourne/content_5.html": "In a significant political shift within Hertfordshire's local government, two Conservative councillors have defected to Reform UK, marking a new chapter for the borough.\nIn a significant political shift within Hertfordshire's local government, two Conservative councillors have defected to Reform UK, marking a new chapter for the borough.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_hertsmere/content_20.html": "Joint statement from Leader of Hertsmere Borough Council, Cllr Jeremy Newmark and Chief Executive, Sajida Bijle – Responding to the English Devolution White Paper\nChelmsford ReformUK Conference 2025\nMy speech to the Chelmsford conference. A full to capacity crowd turned up to be part of the growing movement of 'The People's Army'.\nA fun packed day with many speakers entertaining the crowds.\nThe Leader of Hertsmere Borough Council, Cllr Jeremy Newmark, who is also Chair of Herts Growth Board, has issued this joint statement alongside the other district and borough council leaders in Hertfordshire:\nCommunity groups and voluntary organisations in Hertsmere are being encouraged to apply for a grant of up to £500 for events taking place on the weekend of the Coronation.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_st-albans_addressing-the-district-council-s-budget-and-priorities/content_14.html": "The announcement of a £2.9million budget gap for the next financial year is troubling news for our district. Whilst the Council’s five-year plan, built around five key priorities, offers a forward-looking vision, many residents are left questioning its practicality and immediate relevance to their daily lives.\nThe priorities – combating the climate emergency, providing more social housing, enhancing the cultural offer, and promoting equality are ambitious, however, with council tax set to rise by 2.99%, the pressing question is whether this additional financial burden on residents will result in tangible improvements to services?\nConcerns about dwindling local services are legitimate. Residents feel the pinch as they see their tax bills grow yet experience fewer benefits. Projects like climate initiatives, whilst vital for long-term sustainability, raise questions about immediate costs. What specific measures are being proposed, what benefits will they promote, and what additional charges might residents face? Transparency here is crucial.\nSocial housing is another key focus, but it warrants scrutiny. Are the systems for allocation robust enough? Instances of subletting and concerns about fairness in the queue for housing – especially with questions around priority given to new arrivals versus long-standing residents – spark heated debate. Without detailed answers, scepticism will continue to grow.\nIt is vital for the Council to bridge this communication gap. Residents deserve transparency about where their money is going, how priorities are being balanced, and what immediate improvements, if any, they can expect. Until these questions are addressed, it is challenging to hold the Council accountable or ensure these plans translate into meaningful results for the community.\nThis is not just about managing a budget; it is about trust. The Council must recognize that maintaining public confidence is as important as balancing the books. Clear answers and visible action are the first steps toward a stronger, more united district.\nAuthor: Donah Dewar",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_hitchin_street-stall-in-hitchin/content_17.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nHitchin\n< itemprop=\"headline\"> Street Stall in Hitchin >\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_st-albans/content_12.html": "The announcement of a £2.9million budget gap for the next financial year is troubling news for our district. Whilst the Council’s five-year plan, built around five key priorities, offers a forward-looking vision, many residents are left questioning its practicality and immediate relevance to their daily lives.\nIn the last six-weeks St Albans have had a surge in membership, with numbers increasing by 120%.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_hertford/content_1.html": "There are no articles in this category. If subcategories display on this page, they may have articles.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_policies_reform-uk-defence/content_18.html": "The United Kingdom has a long tradition of some of the finest, best trained and bravest Armed Forces in the world. We must ensure this continues in the face of ever changing threats, as shown by the war in Ukraine, the energy war and cyber warfare to name but a few.\nIt is vital that our Armed Forces have the people, training and best equipment to achieve this. Reform is needed to ensure more efficient joined up thinking and decision making, specially with regard to procurement of equipment; this is an area where the Ministry of Defence’s track record has sometimes let down Armed Forces personnel.\nReform is needed to our military covenant with our service personnel. A fully funded, comprehensive Office for Veteran Affairs is essential.\nLet’s properly protect our troops and veterans from unwarranted, never-ending legal claims.\nLet’s invest in properly equipping and housing our armed forces.\nLet’s invest in training our brave people for new jobs when they leave the services.\nLet’s provide the support they deserve in healthcare and mental health.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_harpenden-berkhamsted_reform-candidate-sackreform-candidate-sacked-by-housing-association-for-reposting-racist-matt-cartoond-by-housing-association-for-reposting-racist-matt-cartoon/content_16.html": "Saba Poursaeedi suing for political discrimination after he says he was fired over links to the party and for sharing Telegraph drawing\nA housing officer was sacked for being a Reform UK candidate and reposting a Matt cartoon from The Telegraph, according to legal documents obtained by this newspaper.\nSaba Poursaeedi, a father of two, is suing one of Britain’s biggest housing associations for political discrimination after he was allegedly fired over his links to the Right-wing party.\nHis bosses even cited his decision to repost a Matt cartoon from The Telegraph as grounds for his unsuitability for the £37,000 a year job.\nMr Poursaeedi was dismissed as a resident involvement officer after the charitable housing association told him Reform’s policies on immigration, net zero and housing were “in direct conflict” with its own “values”.\nHightown Housing Association has denied Mr Poursaeedi was sacked for his political views but has admitted his position with Reform was not compatible with “a customer-facing role”.\nHightown held up as evidence a “racist cartoon from The Telegraph newspaper”, which Mr Poursaeedi had retweeted.\nMatt Pritchett’s cartoon published in January last year depicts a housewife wearing a burka in a sideswipe at the prospect of Abu Dhabi purchasing The Telegraph amid concerns over human rights violations in the Gulf State.\nThere has never been any previous suggestion the cartoon was racist while Matt, the award-winning Telegraph cartoonist, is widely recognised for his gentle perspective on British life.\nMr Poursaeedi claims he was also refused a second job as a damp and mould inspector because of his links to the right-wing party led by Nigel Farage.\nMr Poursaeedi told The Telegraph: “I was politically purged. I want this to go through the courts because I want Hightown to be presented with a court judgment that says, ‘you were wrong’.”\nMr Poursaeedi, 36, whose father is Iranian, said: “Everybody is feeling this noose around their neck in terms of what they can and can’t say. I find what’s happened to me so absurd, so insane. This is their mentality and you can’t quite believe it.”\nMr Farage told The Telegraph: “The levels of prejudice in our public, private and charitable sectors against anybody with patriotic views - like this man losing his job - are staggering. Hopefully, the UK will follow America where woke is dying very quickly.”\nHe said the case had similarities with his ordeal at the hands of Coutts, the private bank owned by NatWest, which decided to shut down his account after compiling a dossier on his political views.\nToby Young, the founder of the Free Speech Union, the campaign group funding Mr Poursaeedi’s legal claim, said: “Saba has been subjected to a political witch hunt. Being an organiser for Reform, a party that one in five Britons say they’ll vote for at the next election, should not be a reason to deprive someone of their livelihood.\n“It’s particularly egregious when you factor in that Hightown doesn’t have a problem with employing Labour Party organisers.\nHightown should be encouraging its employees to get involved in democratic politics, not punishing them for it.”\nMr Poursaeedi, from Hemel Hempstead, Hertfordshire, began working for Hightown in October 2023 working part-time as maternity cover on a salary of a little over £15,000.\nIn February last year, he applied for and subsequently got a permanent job as a resident involvement officer on a £37,000 salary. On March 12, he voluntarily disclosed he was Reform’s prospective parliamentary candidate for the Harpenden and Berkhamsted constituency as well as the party’s county co-ordinator, a voluntary role carried out for free.\nTwo weeks later, on March 26, Mr Poursaeedi passed his probationary period for his maternity cover role with “glowing” praise - his manager wrote: “He has done himself and the team proud” - only to be told hours later that the permanent job of resident involvement officer had been “withdrawn”.\n‘I couldn’t breathe. I was completely speechless’\nIn filings with the employment tribunal, lawyers for Mr Poursaeedi said he was requested to attend a meeting with Hightown’s director of housing Natalie Sturrock and its head of human resources Kerry Demner.\nAccording to the legal claim, Ms Sturrock informed him that “his activities and public profile with the political party, Reform, gave rise to a conflict of interest with the work he would be doing as a Resident Involvement Officer”.\nAccording to his legal case, Ms Sturrock “claimed that the policies that the claimant would be campaigning for would be in direct conflict with Hightown’s values”.\nShe then went on to give three examples. According to the legal case, Ms Sturrock said that Reform’s anti-immigration policies were incompatible with Hightown’s, which “houses immigrants and supports refugees”; that Reform’s plan to “scrap net zero policies” was in direct contravention of Hightown’s desire to be a net zero company; while on the green belt “Reform wants to preserve it, whereas Hightown wants to build on it”, Ms Sturrock allegedly told Mr Poursaeedi.\nOf the meeting, Mr Poursaeedi said: “I couldn’t breathe. I was completely speechless. My world fell apart. I was completely blindsided. While the job was on the table I had financial stability and the chance of earning some proper money. And then it was all gone. I felt like I was being crushed.\n“I was incredibly emotional. I was breaking down in tears.”\nIn Hightown’s legal defence, the housing association disclosed that the day before the meeting, Ms Sturrock had “identified several comments” that Mr Poursaeedi had made on his X account that included “retweeting comments that England had been destroyed by mass immigration” and “reposting a racist cartoon from the Telegraph newspaper”.\nThe defence document does not identify the specific cartoon but Mr Poursaeedi said he had only retweeted one Telegraph cartoon - the Matt cartoon published in January. The cartoon had originally been tweeted out by Paul Embery, a trade union activist and political commentator.\nIn the cartoon, printed at a time when controversy surrounded attempts by an Abu Dhabi-backed investment fund to buy The Telegraph amid fears the United Arab Emirates would use the newspaper to wield influence, the husband says to his wife, dressed in a burka, “Don’t worry, darling. If the UAE buys The Telegraph I doubt the cartoons will change.”\nMr Poursaeedi said: “It’s just a very, very funny cartoon. I just remember laughing my head off.” he said it had particularly resonated because he had spent some of his childhood in Iran and recalled flights from Tehran back to London where as soon as the plane took off he could recall “women removing their hijabs”.\nAccording to the legal documents, Hightown informed Mr Poursaeedi that he was “now only eligible to apply for roles that were not ‘public-facing’.”\nOn April 4, Ms Demner, the HR head, wrote to Mr Poursaeedi confirming the offer of the job had been withdrawn because “we have been unable to approve your declaration of interest”.\nAfter the job offer was withdrawn, Mr Poursaeedi applied for a number of other jobs with Hightown, needing the money with a toddler and his wife heavily pregnant with their second child.\nHe discovered his role with Reform meant he was even unsuitable for a job as a damp and mould inspector with Hightown. Mr Poursaeedi said the housing association “took him to one side and told him that because of ‘your Reform affiliations’ the role of damp and mould inspector is also off limits”.\nMr Poursaeedi said: “They seemed to think it might cause some distress to tenants if they found out I was a member of Reform.” He added: “You could be a paedophile and probably get the job of damp and mould inspector. But it wasn’t available to people like me who are members of Reform. All I could do was just laugh. I just thought that this keeps getting more and more ludicrous.”\nFor one job that Mr Poursaeedi considered applying for, Ms Demner told him in an email sent on March 28 last year that if he applied, “it would be unlikely to be approved”. She added: “... this is due to it being a customer-facing role and the potential that the residents may feel uncomfortable with the support if they were aware of the political associations.”\n‘I felt like vermin, like some kind of untouchable’\nMr Poursaeedi launched his legal action because his “philosophical beliefs” are “protected” under the Equality Act. In his legal claim, he said he was the victim of “belief discrimination” over his views, which include “prioritising economic freedom, national sovereignty and environmental conservation”.\nHis lawyers accused Hightown of discrimination because they “treated him and his beliefs as inferior and unworthy of respect in a democracy”. Mr Poursaeedi’s lawyers also accused Hightown of harassment by “creating an intimidating, hostile, degrading, humiliating or offensive environment for him”.\nHis lawyers said that Hightown’s head of governance and its company secretary Trudi Kleanthous had stood as a Labour Party councillor in a local ward in 2019 and was a Labour ward representative in Dunstable. Mr Pursaeedi accused the housing association of operating “double standards”.\nMr Poursaeedi, a former Labour party member who was born in the UK but lived briefly in Iran when his parents were struggling financially in London in the early 1990s, said his dismissal had shaken his faith in the UK.\n“This is not the country it was ten years ago,” he said. “I used to be in the Labour Party and even ran for the Labour Party in 2021 as a local councillor. But like a lot of people who were Labour and are now Reform, all I ever wanted was a better deal for working people. That’s it.”\nHe said of his treatment by Hightown: “I felt like vermin, like I was some kind of untouchable.”\nHe is demanding in the region of £100,000 in compensation but wants vindication in the courts.\nHe says he is “one of the lucky ones” because he discovered his political affiliation had led to his dismissal from his job. He believes there are dozens of people who have lost their jobs because of their Reform links but have never been told explicitly.\n‘Not treated less favourably’ than Labour candidate\nHightown, which employs more than 1,000 staff and manages over 9,000 homes in Hertfordshire, Buckinghamshire and Berkshire, declined to comment when approached by The Telegraph because the legal case remained ongoing.\nIn its defence, laid out in a 27-page document lodged in October, Hightown’s lawyers said Mr Poursaeedi’s links to Reform “did not create any conflict of interest” when applying for his first job as part of the recruitment team because it was “not customer facing”.\nIt said that a search of Twitter had found that Mr Poursaeedi had retweeted a series of comments about immigration, including one in December 2023 which said that “the taxes you pay are being used to house immigrants in social housing. You should be outraged about this”.\nIn its defence, Hightown said it “denies that the claimant was unfairly dismissed for a reason related to the Claimant’s political opinion and/ or affiliations”.\nThe housing association said since his offer of the job of resident involvement officer was “conditional” he was therefore never actually employed in that role and so could not be dismissed from it. The housing association said in any event it denied the “principal reason for any dismissal” was linked to his “political opinions and/or affiliations”.\nIt also denied any claim of harassment or claim for discrimination. It said that Mr Poursaeedi was “not treated less favourably” than Ms Kleanthous, the company secretary who had stood as a Labour candidate in 2019.\nRobert Mendick The Telegraph Chief Reporter 10 January 2025 1:00pm GMT\nsource: https://archive.ph/hmHJl#selection-3529.5-3537.32",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_policies_reform-uk-immigration-policy/content_23.html": "A responsible government has a duty to protect our borders. We must know who is coming in and who is going out of the country, at our airports and ports. Again, this is basic common sense.\nLet’s welcome those who have high level skills and talents that we need —such as doctors, engineers, software developers, scientists and surgeons — in tightly controlled numbers that meet our requirements.\nNet zero immigration means that the number legally allowed to enter to live and work in the UK each year should equal the number emigrating, so the overall population remains approximately the same. Some 400,000 people leave every year so there is plenty of scope for bringing in the skills and people we need.\nThis policy will mean wages for lower paid will rise, it will help young British workers and so help to significantly reduce the number of people on out of work benefits. It will reduce pressure on affordable housing and public services, given that we already have a record high population. We want these valuable people to come and work in the UK legally, and play by the rules, respecting our values.\nIllegal immigration is unacceptable and those entering illegally must not be granted asylum in the UK. Reform UK is the only party committed to stopping the boats. We must adopt the tactics used by Australia when they stopped the boats.\nWe must declare a national security threat, leave the European Convention on Human Rights (ECHR), and use existing legislation robustly to stop this illegal trade. We must also use offshore processing centres as Australia did.\nWe must also create a new Department f Immigration staffed with people who believe in the task at hand, to protect our borders. The Home Office is simply not fit for purpose\nEveryone must know that no-one coming via these illegal routes will not be allowed to stay in the UK.\nCases must be determined in just a few weeks and people returned to where they came from. The vast majority of the claimants are economic migrants or from Albania under the oversight of their criminal gangs.\nThe cost to the taxpayer is already billions every year and the impact on local communities around the country is very significant. However most people who are concerned are afraid to speak out on this issue for fear of being labelled or smeared.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_branch-team/content_32.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nBranch Team\nAdd\nGroup by\nNone\nImage\nFull Name\nPosition\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_profiles_john-burmicz/content_13.html": "My name is John Stefan Burmicz.\nI live in Sawbridgeworth in Hertfordshire. I have lived here for 27 years. I have been a Councillor both locally and for East Herts District. I have also been privileged to be Mayor of Sawbridgeworth, 2019 to 2020. I am privileged to have been selected as Spokesperson for Hertford and Stortford.\nAfter being forced into a Siberian Gulag in 1939 and subsequent liberation from Siberia in 1941, my father made the trip mainly on foot through Kazakhstan, Uzbekistan and what was then Persia to Palestine where he enlisted (underage) with the Army. He served both in the Karpathian Lancers attached to the British 8th army in both North Africa and Italy, where he was wounded out at Monte Casino. From there, owing mainly to his ability to fix radio receivers for the RAF and being good at Maths (a talent that has bypassed me), his RAK colleagues got him a transfer to the RAF here in the UK and was adopted as a Navigator in 301 Squadron, Bombers.\nMy mother was a fashion designer and worked with Susan Small in the pre-war years. Her specialities were cocktail dresses and ball gowns! She was from North London. She was evacuated to East Finchley following the tragic death of her two brothers (my uncles) during the Blitz in the Angel, Islington, where they had small factories producing artificial horizons for the RAF and theodolites for the RN.\nFrom all of this background of triumph over adversity, I think that I have always had the guts and determination to succeed in what I truly believe.\nI believe that this great country of ours has lost its way in the world and although we still stand for the rights of free speech and personal dignity, some of the many other contributions to world advancement have been forgotten.\nThe pride that we have lost in this great country is mainly down to apologists and weakness on so many fronts; from being the first country to fight against slavery to the world leadership in aeronautical engineering and advancement, we have thrown away our good name and it is time to re-think how we present ourselves on the world stage.\nWe are suffering an invasion of illegal immigrants which has to stop. We cannot rely on our European neighbours to help in this matter. As was the case so often in History, we are on our own and will have to act on our own. We are and have always been willing to be of assistance to those who are really in need, but the current situation is unsustainable, but only Reform has the determination to deal with this thorny issue.\nI have fought locally against crazy housing developments locally, but we have to take a stand nationally against unbridled house construction that does not seem to have been located sensibly or with any infrastructure in mind. We have this locally here in Hertfordshire as I am sure many other people do too.\nCommon sense seems to have been thrown away with the bath water. We have a great message to deliver but somehow we are stifled by the established media who are in reality scared of our message. This is evident at every turn of the page of current affairs. I firmly believe that sense will ultimately prevail.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_policies_reform-uk-government-spending-policy/content_24.html": "Every day we see examples of wasteful, bad or unnecessary spending of our money by councils, public services or the Government.\nTens of billions of pounds of our money is wasted every year. This also acts as a brake on our growth rate.\nReform UK knows that with better leadership, better buying, better decisions, this waste of our money can be cut right back, without affecting front line services.\nThis needs real reform of the civil service — with more accountability — for quality performance. It needs more successful private sector people coming into the civil service to use their skills to help get better value for the Government.\nLet’s make it part of our moral duty to society — to give something back.\nOne of the worst areas of wasteful government spending is ineffective foreign aid. Our civil servants struggle to give away the billions of pounds each year, so they end up giving money to the EU and other global bodies to help spend it. We would reduce the foreign aid budget by 50%, down to a still generous 0.35% of GDP.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_profiles_broxbourne/content_8.html": "Hamish Richmond Haddow is an enthusiastic advocate for traditional British conservative values, shaped by a lifetime of diverse experiences and a deep sense of right and wrong.\nBorn 1970, in Salisbury, Rhodesia (now Harare, Zimbabwe), and changes in the family situation and living in multiple places in three countries characterized Hamish’s childhood. After his parents divorced in 1974, his mother brought him and his sister back to England, settling in Bearsted, Kent. Hamish cherished his time in England but, at age 10, moved back to Cape Town, South Africa, to join his father, who had established a dental practice there.\nIn Cape Town, Hamish attended SACS (South African College High School). He thrived, excelling in academics and sports. On retirement his dad moved the family to a farm near Harare, purchased after winning the Zimbabwe lottery. Hamish completed his secondary schooling at St. George’s College in Harare. He attended college in Cape Town, graduating with a degree in business.\nLiving under racial segregation in South Africa and Rhodesia gave Hamish a clear perspective on freedom, fairness, and the power of faith and family. He saw first hand how communities oppressed by unjust systems found strength in unity and moral clarity. These lessons, combined with the values instilled by his British grandparents, shaped his commitment to family values and conservative principles of unity, responsibility, and standing up for what is right.\nIn 2015, Hamish returned to Britain with his wife and children, eager to pass on the values of faith, liberty, and responsibility. Dismayed and upset to see these principles abandoned and working-class communities burdened by unchecked immigration, failing services, and rising crime. Realizing, a need for urgent change and dedicated to restoring Britain’s strength drove him into politics joining Reform UK to work towards restoring Britain’s legacy of liberty, innovation, conservative values, and community strength.\nWhen not engaged in public service, Hamish enjoys spending time with his family and drawing on his love for rugby and chess to mentor the next generation.\nHis unwavering dedication to his community and country continues to guide his mission: to build a brighter future while honouring the greatness of Britain’s past.",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_profiles_hitchen/content_30.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nMarion Mason\nProfile to follow\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents",
  "https_reformuk-herts_uk_herts-wards_hertford/https_reformuk-herts_uk_herts-wards_hitchin/content_11.html": "Home\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents\nHitchin\nStreet Stall in Hitchin\nHome\nGet Involved\nContact\nYour Area\nBroxbourne\nHarpenden & Berkhamsted\nHemel Hempstead\nHertford & Stortford\nHertsmere\nHitchin\nNorth East Herts\nSouth West Herts\nSt Albans\nStevenage\nWatford\nWelwyn Hatfield\nPolicies\nLogin\nEvents"
}