{
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_map-locations/content_32.html": "Skip to main content\nMain navigation\nHome\nAbout Stephen\nNews\nContact\nSign up!\nSurvey\nVolunteer for Stephen Kerr\nMy Map",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_strengthening-your-voice/content_27.html": "Over the next financial year, the Scottish Government will spend a record £58.7 billion of taxpayers’ money. On the 4th of December the Cabinet Secretary for Finance delivered the budget. She spoke for thirty minutes. That’s a rate of spend of almost £2 billion per minute.\nAt the end of the 30-minute statement the principal opposition spokesperson was granted 3 minutes to comment and ask a question. There followed one hour of questions. After a 2pm start, the parliamentary day was drawing to a close by 4.30pm.\nMost people would expect our politicians to spend at least a full day at this stage, discussing the key components of the new budget and the ramifications of the suggested tax changes. But this is the Scottish Parliament, so they moved on to a pressing members’ business debate about Scots language at the Open University. Because that’s what happens on a Wednesday.\nSix weeks are likely to pass between the budget statement and the first formal consideration of its content in the chamber. When debate eventually happens, it will be the usual procession of reading of scripted speeches. Debating it is not.\nMembers do not get enough time to speak. Not to develop an argument. They are actively discouraged from taking the interventions which would create debate and interest because if they did, precious time is taken away from their already teeny window.\nThis needs to change.\nWe must start transforming our Scottish Parliament into the place it has the potential to be and the place the electorate deserve.\nDebating and asking questions are the principal functions of MSPs in the chamber. But both are stymied by moribund procedure, insufficient spontaneity or topicality and regular episodes of cravenly obsequious kow-towing from the government benches.\nWe have settled for mediocrity.\nThe procedures, formulated with the best intentions, have been found in practice, to be deficient.\nSo, it’s up to the members of the parliament, whether for self or national interest, to change this.\nWe need more theatre and drama. But parliamentary question sessions to ministers are a soulless and near content-less experience. And because they are dedicated solely to answering formal questions lodged by members a week in advance, there’s absolutely no scope for topicality. It is quite possible for an important topic which, say, has broken in the past seven days be completely ignored because it doesn’t fit into the subject matter of any of the lodged questions on the order paper.\nFirst Minister’s Questions is deeply frustrating for backbenchers. Why should party leaders have the right to ask spontaneous topical questions but other members rarely if ever get to do the same? And why should the Presiding Officer, well-intended as she is, be the sole arbiter of what subjects are raised in FMQs? It’s just all\ntoo stale and generally unwatchable.\nThis may all sound like an insider’s view on an insider’s issue but consider that the Scottish Parliament is meant to be the cockpit of the nation, answerable to the nation, the place where everything that matters to how Scotland works is considered. And then ask in all honestly if that is what we have actually created?\nOur parliament should be a confident, steely institution that the Executive fears to cross. What we have is a lame surrender-poodle that does what it is told and never barks or bites, not even when it is seriously neglected.\n60 minutes to ask questions about a newly unveiled £60 billion budget? And a budget statement leaked in advance to a national tabloid? That shows how little regard the SNP Government has for the parliament.\nThe members of that parliament should be up in arms. But instead, they stick to the script, watch the clock, and loyally discharge their share of the cumulative 10 hours spent in the parliamentary chamber each week. The result is an Executive that is wildly out of control and a country that is weaker for a shameful lack of democratic oversight.\nThe Scottish Parliament needs to be reformed.\nIf this set of MSPs want to leave a valuable legacy for our successors, it is now or never. I dare my colleagues to join the debate to upgrade how we do things in our parliament.\nI’m in.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_how-snp-score-pr-wins-your-money/content_22.html": "The SNP are all for show. Their purpose in Government is not to make Scotland a better place to live, it’s to remain popular and in Government for long enough to gain a second independence referendum. They are a PR outfit masquerading as a political party, spinning their failures as the fault of Westminster and amplifying tiny wins to make it look like they are serving Scotland well.\nI’ll now give examples of three areas where the SNP are spending your money to help this PR campaign.\nFirstly, International Aid. This subject has reached the headlines several times in the past month, amid a debate over what the UK’s contribution should be. Regardless of which side you fall on, I think you’ll agree it should be higher than 0.006% of GDP. Yet this is the contribution of the Scottish Government through their International Development Fund. The total spend is marked as £10million – a significant sum for a local council, but nothing in terms of international aid.\nIf the SNP truly believed our international aid contributions are too low, or that money wasn’t going to the right place, they could always offer to work with the UK Govt.\nAs an update while writing, which I believe better highlights the PR nature of this fund, the SNP boasted of increasing it to £15 million while Foreign aid was in the news in Westminster. To compare again, the UK Government spent £176 million in Somalia alone in 2019.\nThe next example is the Scottish Saltire Fund. Worth a hefty £3million, the Fund is designed to support Scottish research collaboration with EU countries.\n£3 million sounds like a lot, and the Scottish Government says “hundreds of European research and innovation projects will benefit”. However, it is worth considering that 1,283 grants were made to UK-based projects in 2019/20 from Horizon, totalling £6.1bn of investment. If split evenly this would be £4.6 million per project.\nThe Scottish Government’s own press release admits that Scotland won £650million for research funding through the Horizon 2020 programme. With the UK’s membership of Horizon confirmed until at least 2027 as a result of work by the UK Government, the £3million in these terms is small potatoes.\nThe Scottish Saltire Fund, which is advertised by the Scottish Government as “repairing research links with the EU following the damaging impact of Brexit”, has all the hallmarks of another SNP PR device: a paltry sum of money, a political point to be made, a good press release written.\nLastly is the Scottish Government’s boldly-named Arctic Connections Fund. This fund promises the sum of £70,000 to “help Scottish organisations and communities collaborate with partners in the Arctic”. The maximum any one organisation can claim is £10,000.\nhttps://www.gov.scot/publications/arctic-connections-fund-form-and-guid…\nOf all the policies mentioned here, this must be the best example of the SNP using a token amount of taxpayers’ money to generate the press releases they think will boost support for separation. To compare, the UK Government’s NGO the National Environment Research Council has an Arctic research fund worth £16 million ongoing from St. Andrews University in Fife.\nThere’s plenty more the UK Govt is doing in the Arctic too. You can read it all here: https://www.gov.uk/government/publications/beyond-the-ice-uk-policy-towards-the-arctic\nThe sum of all these policies is to push the idea of a Scottish Government which is ready to take on global responsibilities, by spending money in reserved areas. In my view, it is highly inappropriate to use taxpayers money to do so, especially when there is so much work being done in the UK Government to these ends. There are plenty of projects that are devolved that could use more investment, for example ask a local Councillor how much difference £3million would make.\nThe Scottish Government should stop playing the PR game and get on with the day job.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-fail-learn-lessons-education-stephen-kerr-msp/content_65.html": "As run in the Falkirk Herald 26/8/2021\nThe Scottish Government must help our pupils recover from almost a year of lost education. Although schools and teachers have tried to fill the gap with online lessons, we can’t act as if this is an adequate substitute for physical lessons, and of course the relationships pupils build at school.\nNo matter what happens in the future, we must do all we can to avoid any future school closures.\nThe current priority is to ensure next year’s students are able to sit exams, so we do not have to rely on algorithms or predictions to give pupils their grades. We also must make sure that disadvantaged pupils across Scotland are supported as the gap has widened between the richest and poorest. As exam results for the most well off continue to improve, those in poorer areas are slipping. As the Convenor for the education, children and young people committee scrutinising the Scottish Government, I will make these issues my personal priority.\nThe Scottish Government is more concerned about injecting politics into schools. I personally do not believe 12-year old children should be asked to wear masks for hours on end without any knowledge on how it affects a young person’s growing body. I additionally directly oppose the Scottish Government’s new guidance which tells parents their children as young as 4 should be able to, without Parental knowledge, “explore their gender”, by dressing differently, using different pronouns or names, or using the other toilets or changing rooms.\nParents need to be in charge of making decisions for their children, not the Scottish Government. The role of the Government is to provide the best opportunities for pupils to learn, grow, and achieve. It’s not their role to act as a parent.\nI would have thought the SNP would have learned from their failed “Named persons scheme”, which was found to breach human rights laws in terms of a breach of privacy and family life. Clearly they still have lessons to learn.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_feed/content_15.html": null,
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_privacy/content_3.html": "This document outlines how Stephen Kerr processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Stephen Kerr\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Stephen Kerr.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Stephen Kerr, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Stephen Kerr via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_everything-you-need-know-king-charles-iiis-coronation/content_40.html": "Anticipation is growing for the coronation of King Charles III, the first coronation of a British monarch since 1953.\nAs a country proud of its traditions, Britain is now the only European country that still has the tradition of a coronation. This ceremony is a rare opportunity for the people of the United Kingdom to reflect on the relationship between themselves, the monarchy and the country’s religious lineage.\nAfter a monarch draws their last breath, their heir immediately becomes the new monarch. But very rarely is there an immediate coronation ceremony, as the country enters a period of mourning and reflection. It also gives the British people time to adjust to our new monarch and allows for the planning of good-old British pomp and ceremony. Those watching the coronation will not be disappointed on that front.\nThe coronation has remained largely the same ceremony since the Norman invasion of 1066, though speaking as a Scot, there has been one large, symbolic change. In 1296, King Edward I of England came up to Scotland and stole the Stone of Destiny (which legend proclaims as Jacob’s pillow) and brought it to London. It was incorporated into a chair specifically made for coronations — the Coronation Chair — and has been used in every English/British coronation since.\nIn November 1996, the Stone of Destiny was returned to Scotland and is now located at Edinburgh Castle, beside the Scottish Crown Jewels. But as part of the agreement, the stone will only leave Scotland to go down to Westminster Abbey for the coronation of the monarch. Thus, what was previously seen as a symbol of oppression will now, for the first time, become a symbol of the voluntary union between Scotland and England.\nAs the role of the king or queen has changed over the centuries, so has their coronation oath. Currently the new monarch takes an oath to uphold the laws of the country according to the customs and traditions of its peoples and to defend religion in the United Kingdom. The king is the supreme governor of the Church of England, but he has also stated his desire to be a defender of all faiths and none.\nThe Coronation Day begins with a procession from Buckingham Palace to Westminster Abbey for the ceremony itself. The king will be presented to the people on each side of the abbey for them to recognize him as king. The recognition provides legitimacy to the right to rule and establishes a relationship between them.\nThe king will take upon himself responsibilities and make promises before being anointed and crowned. He verbally swears an oath and then signs a written version as a contract between him and his people. The coronation oath has varied over the centuries to reflect the states in the Commonwealth and the varying religious struggles in Britain. King Charles III will swear to preserve the laws made by the people in each of his realms in the Commonwealth. He will also swear to administer the law in justice and mercy in his judgements. Finally, he will swear to maintain the laws of God and protect faith throughout his Kingdoms. Charles is king of the United Kingdom, Antigua and Barbuda, Australia, Bahamas, Belize, Canada, Grenada, Jamaica, New Zealand, Papua New Guinea, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, Solomon Islands, and Tuvalu.\nThe king will don new robes for the next part of the ceremony. He will then receive the Eucharist before being anointed, known as the sacrament of unction. It is one of the rarest sacraments of the Church of England and was considered too sacred to display on television when Queen Elizabeth was crowned. In the same vein, it will not be shown at this coronation either. The anointing olive oil is from Jerusalem. Priests mix in additional herbs and spices, using the same secret recipe over the centuries. When the king is anointed, they place the oil on his head, hands and chest in the shape of a cross. The beautiful words of the blessing recall the ancient origins of the anointing:\n“Be thy head anointed with holy oil: as kings and prophets were anointed. And as Solomon was anointed king by Zadok the priest and Nathan the Prophet, so be you anointed, blessed and consecrated King over the Peoples, whom the Lord thy God hath given thee to rule and govern.”\nAfter the anointing, senior members of each order of peerage will then pay homage to King Charles III as a show of loyalty. This includes princes, dukes, and other inherited titles descending from feudal roots.\nThe coronation being first a religious ceremony is very important. The king promises to follow God and to defend faith, and this moment in the ceremony is a timely reminder of the need for keeping God at the forefront of society. The covenant between God and the nation harkens back to the Israelites who were God’s covenant people.\nThe anointing is an outer cleansing, symbolic of the inner one needed to follow God. A reminder for everyone to follow God and love others as themselves seems to be ever needed in deeply divided times.\nThis is an opportunity for the monarchy to renew their contract with their people throughout the world and to promise to serve them faithfully. Many political philosophers discuss a social contract between government and the governed. It is good to see the embodiment of this idea in the coronation. The people will obey the laws and serve the king, while he will enforce them justly and serve the people. Too often people forget government is a two-way street and respect from both the government and governed are required.\nMindful that the United States fought to be independent and particularly free from a king, and that the monarchy is increasingly a symbol, may I suggest the coronation can serve as a powerful reminder of the foundational ideas that make government work and of a societal need to rely on God, to rely on each other, and on the importance of honest, good and wise leaders.\nStephen Kerr is a member of the Scottish Parliament and a former member of the United Kingdom Parliament. Written for - https://www.deseret.com/opinion/2023/5/2/23699655/king-charles-iii-coro…;",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_surveyfalkirk/content_5.html": "Tweet Take my survey to let us know your thoughts about the SNP's plans to cut school hours in Falkirk. State of Falkirk District Current School Hours Survey Your details Leave this field blank Do you support the SNP's plans to cut the number of school hours per week in Falkirk Council? Yes No Unsure Other… Enter other… Do you think that cutting school hours will have a positive or negative impact on education? Positive Negative Unsure Do you think schools finishing at lunch time on a Friday will support parents in work? Yes No Unsure Additional Comments",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_how-sturgeons-departure-will-affect-union/content_24.html": "Many Scots would have felt an immense sense of relief at the news of Nicola Sturgeon’s resignation, with some even having a dram or two to celebrate. These feelings are understandable, though those who believe that Scotland is empowered by being part of our United Kingdom, and that our United Kingdom is empowered by Scotland’s place in the Union, must not rest on our laurels.\nWe must continue to make the economic and social case for our Union, and articulate with passion, and precision, how being part of Britain protects, and enhances, what we love about Scotland.\nUnder Nicola Sturgeon’s leadership, the SNP has caused untold harm to Scotland. Prioritising separatist interests over the national interest, the SNP have postponed much needed reform to the provision of education and healthcare to avoid upsetting parts of its diverse coalition of supporters. The SNP are a single-issue campaign masquerading as a government, and it shows.\nBut if we are being honest, there is an argument that we may have inadvertently aided and abetted the SNP. By focusing so tightly on the ‘Unionist’ part of our name, and by highlighting that a vote for us was a vote against a second referendum – a tactic that helped the Scottish Conservatives cement ourselves as the second biggest party of Scottish politics – we may have unintentionally helped keep the SNP’s pro-separation coalition together.\nRegardless of who becomes the new SNP leader, they will almost certainly continue the “don’t rock the boat” approach of both Alex Salmond and Nicola Sturgeon. We, in turn, must be more strategic and more focussed in our opposition, explaining how the SNP’s approach of avoiding the serious business of government has left our public services worse off. We must be relentless in this pursuit.\n“If you have an important point to make, don’t try to be subtle or clever. Use a pile driver. Hit the point once. Then come back and hit it again. Then hit it a third time.”\nThis is the advice that Sir Winston Churchill gave the Prince of Wales in 1919, and I couldn’t agree more. The SNP have presided over a litany of failures in healthcare, education, and policing, and we must be unabated in our efforts to raise awareness amongst the Scottish public of these failures.\nWe cannot trust Scottish Labour to do this as over the past few months, they have shown that they have the backbone of an invertebrate jelly when standing up to the SNP. Despite numerous Labour MSPs voicing concerns over the Gender Reform Bill, Anas Sarwar whipped his MSPs to vote with the SNP. And at last year’s council election, at least 25 Labour candidates had either backed a second referendum or separation itself.\nWhilst it is only the Scottish Conservatives that have a strong, consistent, record of standing up to the SNP, though we can do better, we must also do more to earn the trust of the people of Scotland.\nFirst, we must recognise and work with the grain that most Scots will always identify primarily as Scottish rather than British, and that this trend existed well before the start of the devolution era. Yes, Scottish Conservatives are proud Scots and we stand four-square for the United Kingdom. Now we must assert a vision of Scotland as it could be with a Conservative First Minister and a Conservative Cabinet – an ambitious platform which will strike a chord with the aspirations of Scots across all parts of our nation and all demographics. Focussing on our unionism has taken the Conservatives to second place, now it is for us to spell out how our love of Scotland translates into a plan for bettering the life-chances of our compatriots.\nWe must show that we are interested in conserving the things we love about Scotland, as implied by our name. We must develop policies that show how the Scottish Conservatives will conserve and enhance Scotland’s landscape, history, culture, and food & drink. In fact, everything about Scotland that makes us proud to be Scots.\nScotland benefits from her place in the United Kingdom and our distinctive Scottishness helps add colour and benefit to the entire Union.=\nScotch Whisky is worth £6bn in export sales to the UK economy and is a brand recognisable to consumers right across the globe. Scotch Whisky benefits from the strength of Britain’s global economic standing, while everyone benefits from the prestige as well as the revenue from these iconic products. In turn this means that jobs and enterprise are supported in some of the most remote and rural parts of Scotland. This is the very embodiment of the symbiotic relationship where the things that make us proud to be Scottish are an intrinsic part of the diverse tapestry of Britain.\nAnother weakness that we have seen in our defence of the Union is the attitude that it is a “Scottish” problem, but this could not be further from the truth. Our United Kingdom is made up of a family of four nations: England, Scotland, Wales, and Northern Ireland. The argument for our United Kingdom must be made from every corner of every nation.\nThe conflation of the UK Government with English-only affairs is an additional weakness. When the Prime Minister of our United Kingdom speaks but is not addressing the whole country, as we saw numerous times during our response to COVID, it gives the false impression that the UK Government is somehow remote to everyday realities of Scots. This perspective must change and addressing English devolution could be part of a solution.\nNicola Sturgeon’s legacy in Scottish politics should be that she was a successful politician at winning elections but whose instincts as a nationalist were always to reach for tribal and divisive tactics to win. Rather than attempt to reconcile the different interests of the Scottish people, she was only too ready to state how much she “detests the Tories” to shore-up her base. She revelled in division. It is unsurprising, therefore, that she leaves office with the nation’s opinion of her highly polarised. Her time in office is best characterised as heavy on the language of confrontation and light on achieving anything of note.\nIt is my hope, though not my expectation, that the next First Minister of Scotland will drop this divisive narrative and focus on promoting the common good.\nNicola Sturgeon’s departure is the 21st century equivalent of waving the white flag. It is an admission of defeat. Scotland will not be leaving the United Kingdom in the immediate future.\nBut we cannot think that this is victory. Ultimately, on its own, it changes very little.\nChurchill wrote during the Great War: “You cannot afford to indulge even for the shortest period of time in resting on your oars. You must continually drive the vast machine forward at its utmost speed. To lose momentum is not merely to stop, but to fall.”\nSturgeon’s resignation is an opportunity for us to grab the initiative. To show how the Union supports the conservation of the things we love in Scotland, aligning our message to how the people of our nation identify.\nIf we do this successfully, it will have a much more significant impact, in a positive sense, on the future of our United Kingdom.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Senedd-News/content_49.html": "Kenya with Malaria No More 29th August 2018 Over recess, I had the privilege of being a guest of Malaria No More on a trip to Kenya. My experience was profound. I saw for myself the devastating impact of... Senedd News",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_events_feed/content_47.html": null,
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-failures-put-public-safety-risk/content_10.html": "Public safety is at risk due to the SNP’s failure to support police. Officer numbers are at their lowest since 2007, stress-related absences are soaring, and shift safety standards are ignored. The SNP has created a crisis in policing, made worse by police industrial action as Scotland hosts Interpol in Glasgow.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_truecall-device-blocks-nuisance-calls/content_60.html": "From the Trading Standards Service, Stirling Council\nTrueCall\nEvery day consumers receive thousands of unwanted marketing calls. For the majority the calls are quickly ended with no financial detriment or other harm befalling the telephone owner.\nFor some householders, particularly the vulnerable, these calls can result in physical, mental or financial harm. In their rush to get to the telephone some householders trip or fall ending up in A&E, for some the constant ringing can cause distress and for a significant number the householder can fall victim to a scam giving out personal details and agreeing to contracts that they neither need or want.\nIn 2014 Trading Standards Scotland based in COSLA offered every Local Authority Trading Standards Service ten TrueCall devices for their local residents. Locally Stirling and Clackmannanshire Councils Joint Trading Standards Service subsequently purchased a further 30 devices and have been given a further five devices by COSLA this year. Across Scotland an average of 55 calls are blocked each month per device – locally that is around 65 calls blocked per device per month.\nA TrueCall device looks like an answering machine and is plugged into the main telephone socket whilst the householders telephone is plugged into the TrueCall device. It requires a power source and the householder to subscribe to “caller display” from the telephone contract provider – this is now a free service from all Telecoms providers. The devices remain the property of Stirling & Clackmannanshire Councils and can be reused when the householder moves to stay with a relative or into a home.\nAll trusted telephone numbers are programmed for the device ie family, friends, doctors, dentists, vets, ministers etc – these can subsequently be added to, amended or removed as necessary.\nAny trusted number gets through without anyone noticing any difference. If an unknown number dials then depending on the settings applied to the device one of two responses happens. With the tightest settings any unknown caller is told that the person only wishes to speak with friends and family members but if the caller has a legitimate reason to speak with them then they should call “Pat on 01234 567890”, Pat being a son/niece or other trusted person) can then assess whether to add them to the trusted list or if a message should be passed on. With the less secure setting 97/98% of callers hang up when told to do so, the remaining callers can get through to speak with the householder so this setting only works where all householders are able to make informed.\nWe have a supply of devices available. You can help identify who would benefit from such a device. If you have a local constituent suffering from memory issues or who is susceptible to providing personal details to callers or agreeing to contracts without thinking or if you are visiting a local householder and they are experiencing a number of telephone calls or if they complain about doing so please ask if you can refer them to Trading Standards. We can be contacted on 01786 443322 or by emailing [email protected]\nAuthor & Project Lead: Brian Wilson\nContact Details: 01786 233650",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_sturgeons-cop-merry-go-round/content_58.html": "One thing has surely been made clear to all over the duration of COP: for the SNP it’s politics first, and their politics starts and ends with breaking up the United Kingdom with Indyref2.\nBefore the event had even started, Nicola Sturgeon was seen posing on the front page of Vogue for a 1-to-1 interview. I suppose she is more comfortable in the pages on Vogue than on the streets of her constituency.\nWhen the whistle blew to start the show, right out of the gates Nicola Sturgeon threw herself in front of every camera going, giving no fewer than three interview with UK TV in a morning, where the highlight was her claiming she would “put politics aside” in an interview with Kay Burley, only to state minutes later that “Boris Johnson must not play to a domestic gallery”.\nNot only did she contradict herself, the hypocrisy here will be obvious to all.\nThis statement was shortly followed by the announcement that the Scottish Government would give £1 million to help resolve global climate change. A pittance of a fraction of the funds required, yet the purpose was not to actually help tackle climate change, it was to buy a headline for the SNP in a busy media period.\nWhen headlines aren’t available, the SNP are less keen, as can be seen by their cutting of £9million from Agri-Environmental schemes over the last 3 years. I suppose Scottish farming doesn’t make good press for the First Minister.\nIn the next days, Sturgeon chased world leaders for meetings and photographs; the only world leader she seemed less eager to broadcast her meeting with was the UK PM; despite her earlier claim she wanted to work with him.\nI can go on, as there’s plenty of examples; from Sturgeon’s meeting with Greta Thunberg and demand that “the next few days can’t be comfortable for world leaders” (she didn’t tell Greta about her missed environmental targets or funding cuts), to berating world leaders for failing to meet previous targets (again, see above).\nNicola Sturgeon is the First Minister of Scotland, but it is becoming increasingly clear that she wishes to hold a more international role. She is bored of having to answer questions about the NHS in Scotland, and thinks the genuine issues raised by the Scottish Parliament are beneath her. She can’t even be bothered to remember her own backbenchers’ names.\nThe Scottish Parliament holds such fantastic potential to improve the everyday lives of Scots. Yet the SNP are using only the powers that they think will give them, and their project to break up the UK, more positive PR. It’s why they have over 50 taxpayer paid press people on their books.\nI will work to expose this fact. Scotland deserves more than PR, and a First Minister who long ago gave up on the Scottish Parliament as a way to satisfy her ego. The Scottish Conservatives Members of the Scottish Parliament represent people from across Scotland’s demographic spectrum, and our only wish is to get into power to use Scotland’s parliament to make our communities better places to live.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_strong-families-strong-scotland/content_16.html": "Family, in all shapes and sizes, is the backbone of a prosperous society. We must do more to support families across Scotland.\nFamily, in all shapes and sizes, is the backbone of a prosperous society. We must do more to support families across Scotland.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Articles/content_20.html": "Strengthening Your Voice 2nd January 2025 Over the next financial year, the Scottish Government will spend a record £58.7 billion of taxpayers’ money. On the 4 th of December the Cabinet Secretary for... Articles\nMatheson iPad debacle is the tip of the iceberg in Scottish Government’s culture of evasiveness - Daily Telegraph 17th November 2023 The way the Scottish Parliament has been set-up and operates, effectively shelters ministers from criticism and scrutiny. Read my full article in the Daily... Articles\nHumza Yousaf must restore credibility by getting Greens out of government - Falkirk Herald 5th October 2023 When the SNP admitted the Scottish Greens into their Government, I said it was a national embarrassment to Scotland. The Greens are not a party of harmless... Articles\nHistoric Environment Scotland (Site Closures) 5th May 2023 Stephen Kerr (Central Scotland) (Con) I congratulate Sharon Dowey on securing the debate, and I associate myself with the words that she expressed. I also... Articles\nThe BBC provides us with a window to showcase the diversity of Britain 23rd March 2023 Stephen Kerr (Central Scotland) (Con) I congratulate Jenny Minto on her speech and on securing support for the motion. The BBC is indeed a precious British... Articles\nA Wellbeing Economy needs to be a Prosperous Economy 22nd March 2023 What can I say about the motion? I know that we are all being terribly nice to John Swinney this afternoon, but I have to say that he has put together a... Articles\nScotland flourishes when the opportunities of our young people are maximised 21st March 2023 Stephen Kerr (Central Scotland) (Con) These past few weeks have been chaotic for the Scottish National Party. The veil of pretence of the past couple of decades... Articles\nHow the SNP score PR wins with your money 2nd August 2021 The SNP are all for show. Their purpose in Government is not to make Scotland a better place to live, it’s to remain popular and in Government for long enough... Articles\nOur Unity Runs Deep – How Positive and Uplifting arguments will save the Union 7th June 2021 Like so many other Scots, Britain is in my blood. My mother is English, I have Welsh relatives, I have a son and daughter in law from Northern Ireland and a... Articles",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_my-response-peoples-vote-campaign/content_45.html": "People’s vote policy\nThe “People’s vote” campaign is calling for a “Final Say” on our membership of the European Union. The people behind this campaign believe that 2 years on from the 2016 referendum, we need to vote again with a ballot that includes an option to stay in the EU, making it essentially a second vote in 2 years on our membership of the EU.\nI have been contacted by many people asking me to support this campaign instead of supporting the Government's deal.\nI do not and will never support this campaign. Below I expand on reasons why.\nFirstly, as a democrat I believe Parliament has a duty to carry out the wishes of the UK electorate. In 2016 we asked the British people what direction they wanted their country to take. We set out in advance the parameters of the vote, making it clear that whichever option gained a majority of votes would be considered the winner.\nOver 33 million people voted in that referendum on a turnout of 72%, the highest UK-wide turnout since 1992. Every single individual voted expecting the Government to honour the result, whatever it would be. They were right to expect this, as the Government had pledged to do so.\nThe Government cannot renege on this pledge and expect to get away with it. Millions of people would quite rightly see a serious misjustice and would become entirely disillusioned towards mainstream politics. This would likely lead to the election of the first populist to stick their head over the parapet and would destroy voter trust in Parliament for at least a generation.\nVoting for a second time in 2 years on EU membership is NOT democracy. It would be a failure of democracy.\nSecondly, as a Unionist the idea of holding a second referendum on a constitutional crisis alarms me. Like the vast majority of Scottish voters, I bear the bruises from two divisive referendums in 5 years, and I am keen to avoid further division in our society.\nThe fact is the “People’s Vote” would open the door to a second independence referendum. We in the UK Parliament cannot call “Indyref2” undemocratic if we had just agreed to hold a second referendum on a different subject.\nI fully understand that many in Stirling voted to remain in the EU in 2016, and that many support the idea of a second referendum. However, largely the spirit seems to be \"Just get on with it\".\nMy message is be careful what you wish for. The “People’s Vote” would cause serious damage to our democracy.\nYou may disagree with the result, but we are committed to leaving the EU and realising the benefits that can be gained by doing so. Our children will vote for Governments that control all of our laws and policies, we will expand our horizons to free trade agreements with Japan, the USA, New Zealand and more, and we will tailor an immigration policy to benefit UK workers while maintaining the flow of skilled workers into jobs we cannot currently fill.\nThis is the manifesto I was elected on, and this is what I will do.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_results-constituent-survey-spring-2023/content_70.html": "My office recently conducted a survey among constituents to better understand their needs and concerns. We have received 788 responses and are grateful for the feedback and issues raised.\nWe asked respondents to rate on a scale of very good to very poor how they felt about Healthcare, Education, Law and Order, The Scottish Government, and Falkirk Council.\nHere are the results:\nThe responses signal a strong disapproval with the direction our nation is heading under the SNP.\nIn Healthcare over half of respondents felt the NHS was “Poor” or “Very Poor,” and nearly everyone had strong feelings either way with few no opinion responses. The Scottish government faired similarly with strong opinions mostly in the negative. Most felt that the government was neglecting the people's real priorities.\nFalkirk council received the least “Very Good” responses, with many people expressing strong displeasure at SNP plans to close school pools closures, and their failure to tackle other local issues.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-push-ahead-overseas-offices-spending/content_55.html": "The Scottish Government have confirmed in a written question that they are committed to opening a new Overseas Office in Warsaw before 2026.\nThis is despite John Swinney saying that \"hard choices would need to be made\" on spending, while announcing tens of millions of pounds worth of cuts to Education and Employment.\nPrevious questions have revealed that the total cost of the Scottish Government's overseas office network has reached £9 million, with individual offices costing between £567,000 and £2.2 million.\nThe cost of the Warsaw office is likely to reach above £500,000.\nStephen Kerr MSP said:\n\"The SNP tell us hard choices are to be made. Well they're clearly making them; cutting vital services like education, and the support for employment and getting people back into work. All the while putting money into this project, which seems to be a fairly transparent attempt at promoting Indyref2 abroad. We have seen no other genuine reason for these offices existing.\nWith Scottish taxes set to be the highest in the UK, Nicola Sturgeon has made her choice, and chooses to promote herself and Indyref2 instead of helping the Scottish people.\"\nThe question:\nStephen Kerr (Central Scotland) (Scottish Conservative and Unionist Party): To ask the Scottish Government what the projected cost is of the planned Scottish\nGovernment office in Warsaw, when it anticipates that the office will open, and what the process will be for hiring staff for the office.\nS6W-10260\nAngus Robertson: The new Scottish Government Office in Warsaw will be opened within the lifetime of this Parliament.\nThe office will be staffed by Civil Servants and Country Based Staff. Civil Servants are appointed to represent Scotland in our international offices by a recruitment panel that includes the posts’ line manager. Appointees can be recruited from existing roles within the Scottish Government or from wider UK Government departments. The Country Based Staff are recruited using the Foreign, Commonwealth & Development Office recruitment processes in each country.\nCosts and staffing levels for the office will be finalised under future Scottish Government Budgets, in line with our priorities and within our budgetary limits.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_attack-my-religion-national-newspaper/content_21.html": "I have written to the Editor of \"The National\" newspaper, following an article about me.\nWhile it is only fair that all MPs come in for criticism in the press, the National in its article \"Heaven help us with these Scottish Tory MPs and their Unionism\" unleashed a brazen attack on my religion.\nIf such an attack was made on Roman Catholicism, Judaism, or Islam by another publication, the National would be first in line to condemn it.\nI hope that after further consideration and thought the National will offer an apology to the many thousands of Scottish adherents of The Church of Jesus Christ of Latter-day Saints.\nThe article can be viewed here: https://bit.ly/2to2Jbz\nBelow is the letter written to Callum Baird, editor of the National.\nDear Mr Baird,\nI thought it best to write to you directly about the column you published in your newspaper on 28 January 2019. Your columnist, Shona Craven, wrote several things about The Church of Jesus Christ of Latter-day Saints in a way I feel is unacceptable. The sarcastic and belittling language used about a minority faith group, followed by thousands of fellow Scots and millions around the world, is highly offensive.\nI would be interested in how you square publication of the article by your Community Editor with article 12(i) of the Editor’s code which states:\n“The press must avoid prejudicial or pejorative reference to an individual's, race, colour, religion, sex, gender identity, sexual orientation or to any physical or mental illness or disability.”\nThe pejorative way that your article mentions The Church of Jesus Christ of Latter-day Saints and its teachings and the prejudicial references made in the article about the Church’s adherents is a clear violation of this code.\nI see that your paper also carried a recent article about anti-Semitism and International Holocaust Memorial Day. I spoke in the House of Commons debate to commemorate it. It is worth noting that hatred starts with the everyday sleights levelled at any group of people, whether they be faith groups or any other group. I feel passionately about this subject because I am indeed a member of a faith group that has a long history of persecution and misrepresentation. Happily, those dark days are largely behind us, but the lessons learned are deeply ingrained and any suggestion of intolerance or persecution of any minority religious group or minority group of any kind is anathema to me.\nIt is fair for your columnists to attack my viewpoint on any issue (and they do with hearty frequency) but attacking people because of their adherence to a faith or to ridicule and demean their religious views is surely never appropriate. Imagine for a moment if your columnist had attacked me for my adherence to Islam or Roman Catholicism or Judaism. It would be rightly condemned as unacceptable. What is it about The Church of Jesus Christ of Latter-day Saints and its members that makes it acceptable to hold them up for ridicule?\nI would hope that after further consideration of this article you might feel some regret for running it in your newspaper and that you might apologise, not to me, but to The Church of Jesus Christ of Latter-day Saints and the members of the Church for the offense caused.\nSincerely,\nStephen Kerr\nMP For Stirling\nCopied to –\nDonald Martin, Editor-in-Chief, Newsquest Scotland\nHenry Faure Walker, Chief Executive Officer. Newsquest Media Group Ltd.\nRobert Dickey, President and Chief Executive Officer, Gannett Co. Inc.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_stephen-kerr-mp-calls-abolish-visa-fees-commonwealth-servicemen-and-women/content_66.html": "The MP for Stirling has added his name to a cross party group of MP’s who have written to Home Secretary Sajid Javid calling for the abolition of visa fees for Commonwealth servicemen and women in the British armed forces.\nCurrently Commonwealth citizens serving in the UK armed forces have the right to apply for Indefinite Leave to Remain (ILR) after four years’ service if they choose to stay in the UK. However application costs have risen considerably in recent years, meaning it would currently cost almost £10,000 in visa fees for a service leaver to settle in the UK with a spouse and two children.\nThis has created a situation where Commonwealth citizens are often forced to choose between leaving the UK or remaining here and splitting up their family. The Royal British Legion, which has raised awareness of this issue through their ‘Stop the Service Charge’ campaign, say they provided £36,000 in grants for visa fees last year alone.\nThe letter, which has been signed by more than 130 different MPs from 8 different parties, calls on the Home Secretary to recognise those who have served in the UK armed forces by abolishing visa costs for them and their families.\nStephen Kerr said :-\n“These men and women sign up to join the UK’s Armed Forces putting their life on the line for our country. The current visa fees charged is just not fair and can split up families. Having served the UK, Commonwealth service personnel should have the right to apply to stay here without having to pay fees so high that some veterans are being pushed into poverty. I would very much like to hear of anyone in the constituency that has been faced with having to pay these fees.”\nCharles Byrne, Director General at The Royal British Legion, said, “Charging exorbitant fees to those who have sacrificed so much to serve our country is no way to thank Commonwealth service leavers. We are pleased so many MPs across the House and from different parties agree with our Stop the Service Charge campaign, and that Stephen is joining the call to have these fees waived. We hope the Government will listen to these serious concerns.”",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Holyrood-News/content_53.html": "Kerr takes on Shadow Education brief 27th September 2022 In a mini-reshuffle of the Scottish Conservative MSP group, Central Scotland region MSP Stephen Kerr has taken up the role of Shadow Cabinet Secretary for... Holyrood News\nCrime data doesn't match reality 31st August 2022 Stephen Kerr MSP has raised concerns about the most recent crime data released by police Scotland, and has questioned if SNP cuts have made the police unable to... Holyrood News\nSturgeon fails to meet with Alcohol & drugs partnerships since being elected 6th January 2022 It has been revealed that since being elected in May 2021, Nicola Sturgeon has failed to personally meet with any of Scotland's 31 Alcohol and Drug Partnerships... Holyrood News\nSNP spend £2.25m of your money on just 290 EU students 30th November 2021 The SNP have turned wasting taxpayers' money into a fine art. £2.25 MILLION will be spent on bringing just 290 students from the EU to study in Scotland, under... Holyrood News\nRoad safety in Falkirk 18th November 2021 Today, I moved a motion in the Scottish Parliament on Road Safety in Falkirk, following many local residents raising concerns about speeding cars in their... Holyrood News\nGreens abandon yet another pledge 18th November 2021 From the Scottish Green party manifesto, Apr 2021: INTERNATIONAL FREQUENT FLYER LEVY As demand has grown, emissions from international aviation in Scotland have... Holyrood News\nSturgeon's COP merry-go-round 8th November 2021 One thing has surely been made clear to all over the duration of COP: for the SNP it’s politics first, and their politics starts and ends with breaking up the... Holyrood News\nMSP Calls for return to face-to-face GP appointments 24th September 2021 Central Scotland Region MSP Stephen Kerr is calling on the SNP Government to set a target date for the return of more normal, face-to-face GP services. The call... Holyrood News\nCentral Scotland MSP shocked at lack of GP info 14th September 2021 Scottish Conservative MSP Stephen Kerr has today urged Health Secretary Humza Yousaf to get to grips with the lack of centralisation of data in Scotland’s GP... Holyrood News",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_united-we-will-not-cower-terrorism/content_50.html": "Tweet Wednesday, 9 October, 2024 Speeches My reflections on the Brighton Bombings, which occurred 40 years ago.\nSNP and Labour Net Plans are a dangerous fantasy Wednesday, 22 January, 2025 The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade—they impose. Anti-business. Harmful to communities. This won’t work.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-trouble-over-indyref2-question/content_46.html": "The Indyref2 question in the Bill being presented to the Supreme Court by the Scottish Government’s lawyers has not been tested by the Electoral Commission.\nIn a response to a Written Question from Stephen Kerr MSP, Minister for the Constitution Angus Robertson said:\n“In early 2020, the Scottish Government asked the Electoral Commission to re-test the referendum question used in 2014. Work on this was paused due to the COVID-19 pandemic.\nWe have announced our intention to hold an independence referendum on 19 October 2023, and the Lord Advocate has made a reference to the Supreme Court.\nWe will undertake the necessary preparations for a referendum, including on question testing, at the appropriate time.”\nStephen Kerr MSP said:\n“The SNP’s lack of attention to the detail in their Bill which they have submitted to the highest court in the land is indicative of their true aim. Their goal isn’t to get this Bill passed, it is to get it rejected, and use that rejection to blame the English for blocking a referendum.\nIf you submit a Bill to the Supreme Court for judgement, you’d expect it to be the Bill you were going to present to the Scottish Parliament.\nAll the civil servant work going in to create lengthy but equally empty documents on breaking Scotland off from the UK is being wasted, it’s a façade. The entire rigmarole is set up to give Nicola Sturgeon the message “They are stopping Indyref2, vote for us.\nWe could be working on health, education, the justice system, ferries; but instead, we’re being forced through this waste of time debate. And all just to give the SNP an election line.”",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_comment-supreme-court-ruling/content_37.html": "I would like to start off by saying that the Prime Minister and the Government will fully respect and abide by the judgement of the Supreme Court. The Court, in a landmark ruling, has now set out clearly the guidelines any Government must meet in the routine action of proroguing Parliament. Future Governments will be able to act accordingly.\nNow we have this clarification of the rules from the Supreme Court, the past precedent which made the Prime Minister’s prorogation valid is no longer the case. This ruling has changed our understanding of the constitution which previously saw Parliament prorogued almost on a yearly basis for varying lengths of time over the centuries without legal challenge.\nAlthough this news will no doubt dominate the headlines and Parliament will now return, the aim of the Prime Minister will not change. He wants to get us a deal with the EU and leave on or before October the 31st, so we can get Brexit delivered and move on from this impasse. I’ve voted for a deal three times before and I’m eager to get the chance to do so again.\nIt is vital we uphold results of referendums, whether it be the referendum on Scottish Independence or on EU membership. We must not disregard decisions of referendums. When people have been told they are making the decision by Parliament, Parliamentarians must stand by that.\nIn the Prime Minister’s words, we’re going to get on with it!",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_exposing-snp-failures-path-fix-scotlands-social-care-crisis/content_17.html": "Tweet Wednesday, 27 November, 2024 Speeches The SNP's National Care Service aims to centralise power, not improve social care. To fix social care, we must scrap these plans and prioritise real solutions.\nSNP and Labour Net Plans are a dangerous fantasy Wednesday, 22 January, 2025 The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade—they impose. Anti-business. Harmful to communities. This won’t work.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Written-Questions-News/content_18.html": "Kerr welcomes International Students policy 11th September 2019 Stephen Kerr MP has welcomed the UK Government's announcement that International students graduating will be able to stay for 2 extra years after their course... Written Questions News\nMy Response to the People's Vote campaign 29th November 2018 People’s vote policy The “People’s vote” campaign is calling for a “Final Say” on our membership of the European Union. The people behind this campaign believe... Written Questions News",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-putting-public-safety-risk/content_19.html": "It's unbelievable. The SNP have not invested enough into prisons for the past 17 years. There solution to fix this problem? Release criminals who haven't served their whole punishment! And it won't be SNP ministers who feel the brunt of this decision. It will be hardworking Scots!",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-double-whammy-falkirk-residents/content_67.html": "Falkirk residents are facing a double whammy of reduced services and increased Council tax from the SNP Falkirk Council administration and the SNP Government in Holyrood.\nIn their recent budget, the SNP both cut funding for Councils, and allowed Councils to increase Council tax to cover the funding gap. Taxpayers are facing a further squeeze on their wallets.\nAt Falkirk Council, the SNP have been eroding local services, cutting back on the number of lollipop ladies, and maintaining the least-collected bin service in Scotland. Meanwhile, roads are going unrepaired and community halls are under the threat of closure.\nThis means you're paying more, and getting less.\nFalkirk does have an alternative to SNP mismanagement: The Falkirk Conservatives are campaigning hard across the district and are now the main competitors to the SNP here. Labour have fallen away and are increasingly invisible in Falkirk. Keep an eye out for our campaign in your area, which will be focused on local issues.\nWe will work hard for your support, and every vote for the Falkirk Conservatives is a vote for a fair deal for the taxpayer.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_volunteer-stephen-kerr/content_44.html": "I am campaigning to win the new seat of Angus and Perthshire Glens as your Scottish Conservative candidate.\nCampaigning activities include:\nLeafletting - delivery of election material to people's houses\nCanvassing- Speaking to people on their doorstep to ask for their thoughts on the General Election\nPhone Canvassing- Phoning target electors to ask for their thoughts on the General Election.\nOur local campaign manager is Matthew Watt. If you can help the campaign, please email him on m[email protected]",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_forth-valley-ae-waiting-times-hit-6-year-low/content_63.html": "Central Scotland MSP, Stephen Kerr, has said the situation across the Forth Valley NHS area has reached a critical point and must be addressed by the Scottish Government.\nMr Kerr’s call comes after the latest A&E waiting times across Scotland hit their lowest level in six years. Nationally Only 76% of patients were seen within four hours at A&E departments.\nThe latest weekly statistics show that across the Forth Valley Health Board area only 65.6% of people attending A&E were seen within four hours.\nThat is worse than the previous weeks figures ( 75.7% ) and continues a trend of failing to meet the SNP Governments own target of 95% being seen within four hours.\nMr Kerr says SNP Health Secretary Humza Yousaf needs to work with frontline staff in at NHS Forth Valley to ensure that people across Falkirk are getting the attention within the timescales required.\nThe Scottish Conservatives would invest an extra £600m in the NHS to specifically tackle waiting times, which would be led by a dedicated team of clinicians.\nCommenting, Stephen Kerr MSP said:\n“The situation in our NHS area has reached a critical point. Patients from all over Falkirk are waiting hours on end in our A&E departments to be seen. That simply cannot continue.\nTargets are being missed week after week. Our dedicated frontline staff are being completely overwhelmed and not supported by the Scottish Government.\nThe Scottish Conservatives would support our NHS by investing a further £600 million to specifically tackle waiting times. That would allow services in the Forth Valley to recover from the pandemic, and ensure patients would be seen as quickly as possible at A&E.”\nNotes:\nAyrshire And Arran 78.6% patients seen (15 Aug); 76% (8 Aug)\nBorders 69.1% (Aug 15); 73.7 (8 August)\nDumfries and Galloway 81.2% (Aug 15), 83.8% (8 Aug)\nFife 79% (Aug 15) 86.8% (8 Aug)\nForth Valley 65.6% (Aug 15); 74.7% (8 Aug)\nGrampian 75.8% (Aug 15); 82% (8 Aug)\nGreater Glasgow and Clyde 74.9% (Aug 15); 75.8% (Aug 8)\nHighland 84.4% (Aug 15) 84% (Aug 8)\nLanarkshire 67.8% (Aug 15); 67.5% (Aug 8)\nLothian 76.5% (Aug 15) 71.3% (Aug 8)\nOrkney 90.7% (Aug 15); 98.5 (Aug 8)\nShetland 95.7% (Aug 15); 97.5% (Aug 8)\nTayside 92.3% (Aug 15); 92% (Aug 8)\nWestern Isles 94.1% (Aug 15); 99% (Aug 8)",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_European-News/content_48.html": "Glasgow chosen as UK host city for major UN climate change conference 12th August 2019 Stirling’s MP, Stephen Kerr, has welcomed the news that Glasgow has been chosen as the UK city to host the UN Climate Change conference, COP26, in 2020. Should... European News\nSupporting our NATO allies over Nordstream 2 19th March 2018 I have signed a letter to Foreign Secretary Boris Johnson, highlighting the Geopolitical threat of Nordstream 2. Nordstream is a proposed Natural Gas pipe which... European News",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_latest-indyref2-offering-analysed/content_54.html": "On Monday, First Minister Nicola Sturgeon took to the stage once again for the third instalment of a series of books setting out what a separated Scotland would look like post Indyref2. The subject of this one was the economy.\nIn advance, we had been told that unlike the first two books, this one contained solid data backing up the arguments being made by Scottish Nationalists. We were to be told plans for currency, pensions, and the England/Scotland border. What we were told fell short of even the lowest expectations.\nIn a speech high on jargon and buzzwords and promises of a greener, a fairer, a stronger Scotland, of actual data and hard facts we saw none. However, we did hear the vague plans on currency and on the borders.\nOn the currency, we were told that the plan was to retain the Pound Sterling for a period (no length specified) before moving to a new “Scottish Pound”, backed by a Scottish Central Bank.\nThis is the entirety of the detail offered, and it asks more questions than it answers. Firstly, how would the Scottish Central Bank acquire the financial heft to back a new currency? It’s not as simple as printing new banknotes and sending them out, a new currency must have a huge amount of reserve capital. No acknowledgement of this was made by the First Minister.\nSecondly, the spectre of a hard border with England was raised. Gratefully, the First Minister confirmed what we knew had to be the case, that a Scotland in the EU would require a “hard border” with England, that’s a border which has checks on trade and potentially more.\nIn terms of detail on this policy, we were offered the idea that checks would only be performed on the two main roads, the M6 and A1. No mention of other roads, which would assumedly become smugglers’ paradise. We were also told that improvements in technology would make checks redundant. Very similar to what we were told about the Northern Irish border during Brexit, and we know how that went.\nA hard border with England would be ruinous for Scotland. 60% of all Scotland’s exports are with the rest of the UK. More will be exported through English ports. Setting up a hard border imperils this trade. The Scotland/England border is far more financially significant than the Northern Ireland/Republic of Ireland border and therefore more difficult to manage if a hard border.\nLastly, the First Minister offered comment on pensions. Thankfully, she put to bed a theory shamefully propagated by SNP Ministers that the UK would pay for an Independent Scotland’s pensions. This is not the case. The First Minister confirmed that Scotland would need to find the money.\nThere was no other detail offered.\nThe most concerning thing about the whole document was a dearth of any detail whatsoever, no numbers, no spreadsheets, nothing. Instead the First Minister offered a vague promise to avoid austerity. This is not something she can promise. The fact is as things stand Scotland is running a budget deficit of well over 10%. This would likely widen if we left the UK. To close this deficit, it would be tax rises and spending cuts.\nEven Scottish Nationalists have spoken out.\nRobin McAlpine, of the Nationalist Common Weal think tank, said:\n“You can pick your reason for getting off this mad, mad bus. It could be because you think a government should have some form of lender of last resort to save it in a crisis. It could be because you’re not keen on austerity. It could even be that you’re not keen on not being told how much austerity is proposed.\nIt might be because you realise they have no economic plan for Scotland. It could be because you believe climate change is real and that we need to invest more than one per cent of GDP in it over the next decade. It might be because they’ve failed to come up with any answers for trade or borders.”\n(read his full comments here: https://robinmcalpine.org/this-paper-answers-nothing-this-government-has-no-answers/)\nFormer SNP MSP Alex Neil said that the proposal had to be looked at again, and Nationalist Economist Richard Murphy said: “quite literally no country can do what this plan published by Sturgeon this morning suggests. Using sterling would economically ruin an independent Scotland”\nConvenor of the Scottish Currency Group Tim Rideout described parts of the plan as “Economically illiterate”.\nThe SNP genuinely want us to hold a referendum next year to rip the UK apart. The least they could do is provide a case. Apart from vague promises and fluffy ideas of a greener, cleaner, fairer, etc Scotland, we have nothing. This is what the SNP and Nicola Sturgeon have been doing instead of working on the NHS crisis including record A&E wait times, putting Indyref over police numbers, putting separation ahead of education.\nThe result is a weaker Scotland. I will always hold the Scottish Government to account for these failures.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_our-unity-runs-deep-how-positive-and-uplifting-arguments-will-save-union/content_59.html": "Like so many other Scots, Britain is in my blood. My mother is English, I have Welsh relatives, I have a son and daughter in law from Northern Ireland and a Daughter in law from England. I was born, raised and live in Scotland. I love Scotland.\nSome argue that it is only an Act of Parliament or a treaty that binds our United Kingdom together, but this is false. My family, like the family of so many others, proves it. We share national institutions. The NHS, the BBC and our Armed Forces are British institutions respected the world over and that are etched firmly onto all of our hearts.\nNationalists want us to make a choice between being Scottish and being British. I reject this choice. I am proud to be Scottish and British. The identities are not a contradiction, they are complimentary. Any other interpretation drives wedges between people, between me and my grandchildren. Why are the nationalists intent on making strangers of our friends? Why do they wish to strip millions of their identity?\nI will be supporting the Scottish National Team at the Euros coming up and Team GB at the Tokyo Olympic Games. Supporting both is a natural expression of who I am. Millions of Scots, Welsh, Northern Irish and English citizens share the same view, supporting our own teams whether they are representing our home nation or the United Kingdom as a whole.\nFor me, Britain is about more than a flag or a point painted on a map. It is about a spirit of sharing and cooperation between our four nations. Within Britain we pool our resources in solidarity. The successes are sweeter and the failures easier to bear because we do so together and our struggles as individuals, families, communities, towns, regions and nations are shared by all in a common bond. Captain Sir Tom Moore demonstrated this solidarity during the pandemic and his example is one to follow.\nWe have been and still are in the unknown. Daily routines are coming back to life and there is hope for the future as we emerge from the covid crisis. None of the nations of the UK got everything right, but when we pulled together we achieved a great deal. The furlough scheme and the vaccine procurement led the world and we should be very proud of what we achieved together.\nIt was the solidarity of the Union that brought us this. Despite the collapse in economic activity during the pandemic, millions of jobs have been saved thanks to the furlough scheme backed by the UK Treasury. In Scotland alone, almost one million workers received this support. The solidarity between taxpayers in all parts of the UK supports this and the future growth of our shared economy is enough to guarantee stability and the ability to pay for this into the future. Would independent nations in Scotland, Wales, Northern Ireland and England be able to afford the same? The SNP cannot say so, they don’t even have a plan for what currency we would use in Scotland.\nThe vaccine roll-out should be a template for how Scotland should work together with the rest of the UK. I made this point to John Swinney in one of my first contributions to the Scottish Parliament. Even he had to concede that this demonstrated the benefits of Scotland’s two governments working together.\nBritain has the highest rate of vaccines distributed per head of population in the G20 and no part of the UK is left behind. Our approach has been to show solidarity with each other and that is why vaccines are rolled out everywhere.\nThis is not about having a UK government that commands and controls, instead it is about institutions that bring people together. The UK parliament and Government which taxpayers pay for and voters vote for in Scotland, Wales, England and Northern Ireland must be interested in the affairs of all of us. It must be about working together. There do not currently exist good mechanisms for inter-governmental cooperation within the UK and not enough is done to encourage cooperation and solidarity at all levels of government. The “Devolve and forget” mentality of Whitehall where they simply hand off responsibility to the Devolved Administrations and then show no interest further down the line is the perfect environment for nationalism to thrive.\nWe know how this happened. When Tony Blair, Gordon Brown and Donald Dewar set up the Scottish Parliament in 1999 they envisaged that inter-governmental coordination would happen through the internal workings of the Labour Party. They did not foresee the time when different parties would be in government in all parts of the devolution landscape. With Labour at Cardiff Bay, SNP at Holyrood and Conservatives at Westminster we need structured ways for leaders to cooperate. We urgently need these formal structures in place.\nWe need these structures as we move out of the pandemic. The new UK internal market act is key to protecting and enhancing domestic trade within the United Kingdom. We should never forget how important this is to Scottish Business. Having no barriers to trade within the UK helps rebuild our economy.\nThe SNP want barriers though. Even without EU membership there would still be a necessity for an independent Scotland with different regulations to have border posts at Gretna. Tariffs, quotas and different regulations would be one thing, but these seem almost easy to bear when compared to the heartbreaking division of closing a border that has been open for hundreds of years.\nOpposition to insular and divisive nationalism cannot be left to a purely Scottish debate. Opposing the SNP, Sinn Fein and Plaid Cymru is best done by British people across the whole UK making the positive case for Britain. All of Britain would be diminished by the loss of any part of it. Whether it be the manufacturer in Wales whose products are on the shelf in Aberdeen, the hill farmer in Argyll sending his Lambs to be fattened on Herefordshire Grass or the Artist in London planning a show at the Edinburgh Fringe the exchanges and bonds within Britain run deep.\nWe are seen by the world as a force for good. The UK Aid symbol is seen around the world as a symbol of our generosity and commitment to solving global problems. I saw this myself when I visited Kenya as the UK did its bit to combat tropical diseases. The UK is a global leader on climate change, hosting COP26 in Glasgow later this year.\nWe are all part of this, Scotland, England, Wales and Northern Ireland. We can all take pride in these shared endeavours. Solidarity within Britain means we can fight a virus that threatens our lives and ways of life. Unity gives us the ability to affect change on a global scale.\nWe have to counter nationalism with these positive and uplifting arguments. The UK Government must be visible and actively promote partnerships between the different parts of Britain. It must demonstrate how citizens in all parts of the UK play a part in this and what it does for them. Our arguments are not the answer to a formula based on dry economics or fiscal transfers. It is that emotional attachment to the solidarity and unity that we feel with our fellow men and women who we share our country with. They are our customers, our helpers, our friends, our relatives. Together we can achieve so much more and write a positive future that is united.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_stone-destiny-powerful-symbol-commitment-uk-stephen-kerr-msp/content_36.html": "Britain will once again be on the world stage as we celebrate the coronation of King Charles III on 6 May. The global audience will be of similar size to the figures we saw for the funeral of Her late Majesty the Queen, showing the soft power that the Royal Family has for our United Kingdom.\nOne of the most memorable parts of the poignant events that took place after the death of our late Queen was the drive from Balmoral to Edinburgh. With the world’s eyes on these events, people were invited – many for the first time – to witness the natural beauty of Scotland. A sign of the British union recognising and empowering Scotland’s unique identity.\nEven though the Coronation is in London, through symbolism and history, Scotland will continue to be at the centre of events.\nIn 1296, the Stone of Destiny – used for the coronation of Scottish Kings for centuries – was stolen by the English King, Edward I, after he invaded Scotland. He then erected a specific throne for English monarchs to sit on for their coronations – the coronation chair – and placed the Stone of Destiny within it.\nThe Stone of Destiny officially returned to Scotland in 1996, though it did spend three months in Scotland in the 1950s after a group of students broke into Westminster Abbey on Christmas day and stole the stone. But for the coronation, the Stone will return to Westminster Abbey, and continue the tradition of being used for every coronation of a British monarch.\nTo me, this symbolises the changing nature of the relationship between England and Scotland throughout history. The stealing of the stone highlights a history of mistrust, and the suppression of Scottish identity.\nThe returning of the stone to Scotland shows how attitudes have changed for the better, recognising Scotland’s unique history, traditions, and identity.\nAnd the voluntary returning of the Stone of Destiny for the coronation is a symbol of Scotland’s voluntary commitment to being part of our United Kingdom.\nOn 6 May, some may simply see the King sit on a chair which contains a big stone, but for me, it will add another layer to over 700 years of Scottish history.\nWritten for the Falkirk Herald -",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_wellbeing-economy-needs-be-prosperous-economy/content_23.html": "What can I say about the motion? I know that we are all being terribly nice to John Swinney this afternoon, but I have to say that he has put together a collection of words that is almost wholly meaningless. Let us be frank—this is just a filler debate. It is a filler debate so that the SNP and the Greens can indulge themselves in some constitutional rants about separation and breaking up the United Kingdom. Paul McLennan did not disappoint—that is the theme that he set.\nThe debate is intended to cheer up members of the SNP—and, my goodness, they need a bit of cheering up. It is all about killing time until the stairheid rammy of the SNP leadership contest is finished. Given how well the candidates have been trashing the SNP’s record in government, who would still want to lead it?\nThe amendment in the name of my friend Liz Smith is a reconnection with reality—the reality that we need to rescue Scotland’s economy from the “mediocrity” of Nicola Sturgeon and the SNP. Those are Kate Forbes’s words, not mine. It is ironic that we are debating a motion from the acting finance secretary on his last ministerial appearance in the chamber when the actual finance secretary is busy traducing his legacy.\nA wellbeing economy needs to be a prosperous economy. I always hoped that John Swinney would learn that a nation cannot tax itself to prosperity, but I fear that he leaves government unrepentant on that matter. Kate Forbes wants to talk about entrepreneurship and jobs; she wants economic growth. Some SNP members might agree with Kate Forbes, as Scotland continues to grow at a rate well below that at which the rest of the UK is growing, but they must not tell that to Patrick Harvie or Lorna Slater, whose whole effort in government is targeted at stopping economic growth. [Interruption.] I agree with my friend Graham Simpson that they do a good job.\nTo them, economic growth is all about stuff—and I say that they are right. By “stuff”, I mean jobs, increasing wages, better job security, rising profitability, higher national productivity, a growing tax base and investment in our public services. That is the very stuff that they are committed to halting, opposing and destroying.\nWellbeing is, in many ways, indefinable. I find that all the things that really matter to me in my life and that contribute to my personal and family wellbeing are hard or imprecise to measure: love, contentment, comfort, security and peace of mind. Those things and many others make people feel happy. Wellbeing is about much more than happiness. It is about being able to cope when things are not going as well as they could be. As Liz Smith said, it is about resilience. It is about independence—personal independence.\nAlthough I am not of the view that the Government is the answer to all our problems, there is work that can be done, especially in helping our young people. Young people need skills that lead to personal fulfilment. They can get those skills by learning an instrument or taking part in sport, dance, creative writing, drama or art. Too often, we think about those subjects like central planners sitting in an office deciding how many bagpipe players or footballers Scotland needs, using an equation to balance art against science. That misses the fundamental point about education. Education is not only about employment; it is about learning skills that help young people to find fulfilment.\nI commend the member for his glorious attempt to build consensus across the chamber this afternoon. He is talking about education. I am a strong believer in early years education and the opportunity that that provides to turn young people’s lives around and give them a good foundation. What more could the two Governments—the UK Government and the Scottish Government—do to try to make that more of a reality today?\nI agree with Willie Rennie on both points that he made. My middle initial is C for consensus, and I try to build consensus. His second point was about the importance of the early years. The early years are a very important point in the beginning of the education journey for every single soul.\nI return to my premise about learning skills that help young people to find fulfilment. I am talking about the guitar in the loft, the hung-up football boots or, if you will forgive the parallel, Deputy Presiding Officer, a fine cheese, laid down for a future of maturing until it is there to help us through a tough time. Similarly, life skills such as cooking or managing finances help our young people to stand on their own two feet.\nHow does cutting mental health funding for colleges help any of that? How will cutting subject choice help?\nWill the member take an intervention?\nThe member is coming to a conclusion.\nEdmund Burke said:\n“If we command our wealth, we shall be rich and free; if our wealth commands us, we are poor indeed.”\nIntergenerational poverty is a curse, and I, along with everyone else here, want to break that cycle. Helping people to access employment and gain lasting financial security is a way of lifting that curse. The pride that goes with having a good job that allows one to provide for oneself and one’s family is so important as to override all other considerations when addressing worklessness. Work builds confidence and, when families provide for themselves, they are stronger. Child poverty is solved by addressing the worklessness of households.\nI will conclude by simply saying, Deputy Presiding Officer, that the motion speaks volumes about the SNP’s attitude to government. This is a Government of idealogues who put ideology ahead of wellbeing.\nYou need to conclude, Mr Kerr.\nWe can hope for a future in which the Government enables wellbeing, but with these two parties in charge, that is never going to happen.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Reports/content_14.html": "ENERGY BILLS: UK Government support for householders and businesses 22nd September 2022 HOUSEHOLDS: The UK Government has announced that it will cap energy bills at £2,500 a year for the next two years. From 1 October, a new ‘Energy Price Guarantee... Reports\nTruecall: a device that blocks nuisance calls 13th November 2018 From the Trading Standards Service, Stirling Council TrueCall Every day consumers receive thousands of unwanted marketing calls. For the majority the calls are... Reports",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_about-rss/content_6.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-and-labour-net-plans-are-dangerous-fantasy/content_7.html": "Tweet Wednesday, 22 January, 2025 Speeches The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade—they impose. Anti-business. Harmful to communities. This won’t work.\nSupport Our Armed Forces and Veterans Tuesday, 14 January, 2025 Unless you have served in our armed forces, we cannot comprehend the physical and mental toll. We must support our armed forces and veterans.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_kerr-welcomes-international-students-policy/content_42.html": "Stephen Kerr MP has welcomed the UK Government's announcement that International students graduating will be able to stay for 2 extra years after their course, without any extra visa required.\nThe policy is focused on retaining talent, while keeping our strict immigration laws. The move will apply to Int. students who have completed a course at any institution which has undertaken immigration checks.\nUniversities such as Stirling University have in the past raised the loss of potential, as talented students who have spent years in the UK learning, building relationships, and adapting to the local culture have to leave after their course. International students pay up to £50,000 to take a course in the UK.\nStephen Kerr said:-\n“This is a very welcome announcement from the UK Government. The higher education sector in both England and Scotland has, for some time, been arguing very strongly for changes to be made and this announcement will address many of their main concerns. I am delighted that the Government has listened to these concerns and those raised by MPs, including myself.\n“The success of our universities depends on their ability to attract the very best students and staff. The current policies are too restrictive. There was evidence that international post-graduates and staff were finding it difficult, if not impossible, to complete their studies. That was hampering the ability of our institutions to be at the cutting edge of the knowledge exchange and was undermining major research projects.\nSearching for a post-graduation job and starting your career can take time. The extension of the Visa period will enable many more successful overseas students to do that, keeping their talents here in the UK.\nThis is very good news for the Scottish economy and our excellent universities.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_historic-environment-scotland-site-closures/content_68.html": "Stephen Kerr (Central Scotland) (Con)\nI congratulate Sharon Dowey on securing the debate, and I associate myself with the words that she expressed. I also associate myself with the words of Fiona Hyslop; I very much agree with her in hoping, as she just expressed, that Linlithgow palace will be open to visitors again soon.\nIn this country, we have a wonderful history, from the wars of independence and the Jacobite rebellions to being at the forefront of the industrial revolution and the enlightenment, and the defence and liberation of the free world during the world wars. This is our story, and we can take pride in retelling that story from whichever perspective we choose to tell it. I am a Scottish unionist, and I believe that it is very important that we celebrate Scotland’s history, whether it is before or after the act of union of 1707, the 316th anniversary of which was just earlier this week.\nIf I may express my personal feelings—I have said this before and I will take this opportunity to say it again—I find it frustrating in Scottish politics that there are some people, although not necessarily in this Parliament, who would consign to the margins of the Scottish political spectrum those of us who believe in being Scottish and British, in the sense that they say that we are not true Scots. I am a true Scot. I love Scotland and I take a great deal of pride in our nation and draw a great deal of passion from it. That combination of Scottishness and Britishness is an enhancement. I think that I heard the former First Minister say last summer that she identified as both Scottish and British, and I think that that is a very welcome thing to hear members of the Scottish National Party say, because it will blunt some of the anger and vile hatred that some of us experience.\nWhether one believes, as I do, that Scotland is empowered by being in the union or whether one does not, it is important that members of this Parliament are perturbed by and interested in the condition of Scotland’s historic sites—the symbols of Scotland’s cultural independence. All of us who believe in Scotland’s nationhood would like priority to be given to the accessibility and safeguarding of the key sites that shape our Scottish identity. I ask Angus Robertson to explain to Parliament fully why it is that, after so long, Arbroath abbey—the site of one of the proud moments of Scotland’s emergence of a nation with an identity: the signing in 1320 of the declaration of Arbroath, a document of worldwide importance—is still closed. We have heard Fiona Hyslop talk about Linlithgow palace, and it is important that we receive reassurances from Angus Robertson that it will open soon. What is the delay? When can we expect that magnificent site—the birthplace of Mary, Queen of Scots—to reopen?\nThose are just two of the sites managed by Historic Environment Scotland that are currently closed—as Sharon Dowey said earlier, there are 47 of them. For a nation to have a greater sense of its own identity, the places where that identity was forged and continues to be shaped must be accessible to all of us. We must learn lessons from what has happened to some of these historic sites in terms of their upkeep and maintenance. Deep down, we must resolve, collectively, to support the Scottish Government to ensure that there are appropriate levels of investment and care in relation to those sites of historic Scottish heritage.\nPeople who love Scotland feel compelled, as I do, to preserve those things that make us the nation that we are, and these historic sites are one of those things.\nI am a Scottish Conservative; I am interested in conserving. I hope that we hear from Angus Robertson exactly the steps that will be taken to open up all of these historic sites, which have been closed for too long.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Local-News/content_41.html": "Results from Constituent Survey - Spring 2023 10th May 2023 My office recently conducted a survey among constituents to better understand their needs and concerns. We have received 788 responses and are grateful for the... Local News\nStephen Kerr MSP backs freeport bid 5th October 2022 Scottish Conservative politicians for the Falkirk District Stephen Kerr MSP and Cllr James Bundy have thrown their support behind a bid which would bring a... Local News\nSNP to push ahead with Overseas Offices spending 26th September 2022 The Scottish Government have confirmed in a written question that they are committed to opening a new Overseas Office in Warsaw before 2026. This is despite... Local News\nPolice numbers collapse in the Forth Valley 9th August 2022 Police numbers have dropped below 600 in the Forth Valley as the force is seeing increased departures due to retirement, and struggling to make up the numbers... Local News\nKerr backs Scottish Canals 7th July 2022 MSP Stephen Kerr has pledged to support Scottish Canals at the Scottish Parliament, following a meeting held at the Falkirk Wheel this week. Scottish Canals... Local News\nSNP cuts close Raploch Forth Valley College 23rd May 2022 In August 2021, Forth Valley College was projected to receive a funding increase of 4%. They were to receive a higher increase as they are already considered to... Local News\nSNP cut lollipop lady numbers in Falkirk 17th January 2022 An FOI from the Scottish Conservatives has revealed that the number of Lollipop ladies employed by Falkirk Council has dropped dramatically in recent years... Local News\nSNP Double Whammy for Falkirk Residents 11th January 2022 Falkirk residents are facing a double whammy of reduced services and increased Council tax from the SNP Falkirk Council administration and the SNP Government in... Local News\nForth Valley A&E waiting times hit 6-year low 31st August 2021 Central Scotland MSP, Stephen Kerr, has said the situation across the Forth Valley NHS area has reached a critical point and must be addressed by the Scottish... Local News",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_support-our-armed-forces-and-veterans/content_25.html": "Tweet Tuesday, 14 January, 2025 Speeches Unless you have served in our armed forces, we cannot comprehend the physical and mental toll. We must support our armed forces and veterans.\nSNP and Labour Net Plans are a dangerous fantasy Wednesday, 22 January, 2025 The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade—they impose. Anti-business. Harmful to communities. This won’t work.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-slash-opportunities-scotlands-future/content_57.html": "A Scotland where every child has the chance to pursue their dreams—a Scotland full of hope and prosperity. That's my vision. But the SNP has other ideas, taking an axe to Scottish education and cutting the ladder of opportunity for our next generation. They should be ashamed.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_energy-bills-uk-government-support-householders-and-businesses/content_28.html": "HOUSEHOLDS:\nThe UK Government has announced that it will cap energy bills at £2,500 a year for the next two years. From 1 October, a new ‘Energy Price Guarantee’ will mean a typical UK household will now pay no more than an average of £2,500 a year on their energy bill for the next two years.\nBased on current energy prices, this will save the average household £1,000 a year.\nAdditionally, a £400 grant for every household, paid in 6 instalments from October. 8 million of the poorest households will get a total of £1200, of which £326 was received in July with a second instalment in Autumn, with the £400 grant paid in instalments as mentioned.\nIF ON A PRE-PAYMENT METER: you get the £400 grant, plus redeemable vouchers OR automatic credit at your top-up point. You should have received information on this from your energy supplier, if not you should contact them directly.\nIF OFF THE GRID: You will receive the £400 grant, plus the UK Government is ensuring your local supplier (e.g the park owner) passes additional support on to you.\nBUSINESSES:\nThe UK Government have announced a cap on wholesale energy prices, which will halve businesses’ predicted energy bills this winter.\nThis includes all UK businesses, the voluntary sector and the public sector, including schools and hospitals.\nIt will apply to fixed contracts agreed on or after 1 April 2022, as well as to deemed, variable and flexible tariffs and contracts. It will apply to energy usage from 1 October 2022 to 31 March 2023, running for an initial six-month period for all non-domestic energy users. The savings will be first seen in October bills, which are typically received in November.\nAdditional information can be found here: Government outlines plans to help cut energy bills for businesses - GOV.UK (www.gov.uk)",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_kerr-tries-out-bolt-mobility-scooters/content_51.html": "Stirling MP Stephen Kerr has met with new tech company, Bolt Mobility, where he learned more about a new product aimed at taking cars off the road and reducing pollution and congestion in city centres.\nThe electric scooters and bikes made by Bolt Mobility are designed to be safe and usable for all, and also good for the environment. A journey made by electric bike is a journey not made by car or bus.\nThe company is backed by Olympian and worlds fastest man Usain Bolt. The scooters and bikes have already been successfully launched in cities across the USA and recently in Paris. Under present legislation the scooters are illegal in the UK for use on roads and pavements. The event in Parliament was to introduce MPs to the product and begin the debate about legislation could be changed while maintaining safety.\nThe MP talked with Co-Founder of Bolt Mobility Sarah Haynes, who told Stephen they want to put these electric scooters and bikes on the streets of the UK, and are asking pedestrians and drivers if they would feel safe with more of them on the road.\nStephen Kerr MP said:\nThese bikes could make a real difference to the lives of people who aren’t as mobile as they used to be, keeping people active for longer. They'll also mean less journeys by car and therefore a lower Carbon Dioxide output. Of course, there is also the potential impact on drivers and pedestrians of an increase in bikes and scooters on our roads. It is extremely important we have a thorough debate about how these benefits can be realised while keeping safety as the top priority. I would welcome people’s thoughts on this!",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_challenging-snps-anti-business-agenda/content_35.html": "The UK should be pushing for free trade. We need a deal with the U.S., and with Trump back, now is the time to get it. We should also dive into the Trans-Pacific agreement in December. But the SNP and Labour’s anti-business, anti-growth agenda will make us miss these chances, hurting Scottish businesses.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Speeches/content_43.html": "SNP and Labour Net Plans are a dangerous fantasy 22nd January 2025 The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade—they impose. Anti-business. Harmful to communities. This won’t work. Speeches\nSupport Our Armed Forces and Veterans 14th January 2025 Unless you have served in our armed forces, we cannot comprehend the physical and mental toll. We must support our armed forces and veterans. Speeches\nExposing SNP Failures: A Path to Fix Scotland's Social Care Crisis 27th November 2024 The SNP's National Care Service aims to centralise power, not improve social care. To fix social care, we must scrap these plans and prioritise real solutions. Speeches\nChallenging the Leftist Consensus on the Miners' Strike 27th November 2024 Speaking in Parliament, I highlight that Arthur Scargill abused his position to try and bring down a democratically-elected Government. Speeches\nSNP Putting Public Safety at Risk 21st November 2024 It's unbelievable. The SNP have not invested enough into prisons for the past 17 years. There solution to fix this problem? Release criminals who haven't served... Speeches\nChallenging the SNP’s Anti-Business Agenda 12th November 2024 The UK should be pushing for free trade. We need a deal with the U.S., and with Trump back, now is the time to get it. We should also dive into the Trans... Speeches\nUnited, We will not Cower to Terrorism 9th October 2024 My reflections on the Brighton Bombings, which occurred 40 years ago. Speeches\nOutrage as SNP's Failed Policy Leads to Soaring Rail Fares in Scotland! 12th September 2024 The price of your train is going up thanks to SNP mismanagement! Speeches\nThe SNP plan to jeopardise Scottish Jobs! 10th September 2024 The UK Single Market empowers Scottish businesses to thrive, job creation, and strengthens communities. Families enjoy lower prices and more choice. Paired with... Speeches",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_bbc-provides-us-window-showcase-diversity-britain/content_33.html": "Stephen Kerr (Central Scotland) (Con)\nI congratulate Jenny Minto on her speech and on securing support for the motion. The BBC is indeed a precious British institution that sets itself high standards. It often meets those standards, but not always, and that is to be expected given that the BBC’s output is so broad and varied, including the output of BBC Scotland.\nThe BBC is a gift that we share with the whole world, and the brand is sound: it stands for something. All over the world, people listen to and watch BBC broadcasts, including those originating in Scotland. People put a tremendous amount of trust in what the BBC says. They listen to podcasts of BBC productions on global streaming platforms such as Netflix and Amazon Prime Video. The BBC is a British institution but it is also a global institution, and it promotes our Britishness and our Scottishness, not in an in-your-face way, but in a reassuring and steady way.\nThe BBC provides us with a window on the world, and also provides a window on Britain for the rest of the world—with all of our diversity and richness of tradition. The images of Scotland as our late queen was brought from Balmoral to Hollywood last September were broadcast all over the world, and they told their own story of Scotland’s beauty, her people’s generosity and Queen Elizabeth’s love of Scotland.\nI absolutely believe in the concept of public sector broadcasting. I believe that the BBC has played, does play and will continue to play a central role in the life of our nation. However, I regularly question its leadership and their priorities. I cannot believe that the BBC bosses really think it is a bright idea to abolish the BBC Singers, all to save £1.5 million. I would say, “Come on, BBC. It’s not good enough.” Then, there was all that fuss about Gary Lineker’s tweets. Who cares about what Gary Lineker thinks? He is paid rather handsomely—roughly 15 times the salary of the cabinet secretary—to talk about football on the telly. That is it.\nRegarding the business model, I understand that it might be tempting for those in the hierarchy to resist change—“If ain’t broke, why fix it?”, as the saying goes. However, that is complacent thinking. As the world and society change, the BBC must change with them. Yes, it can be guided by the past, but we should not be entrenched in the past. The idea of a tax on TV viewing seems to me to be something that does not quite belong in the 21st century and I do not believe that it will endure. Therefore, alternative funding models need to be explored. I am open to consideration of all the alternatives, with all the flexibilities that could come with those changes, including the BBC leveraging its global brand to secure its income and pre-eminence.\nThe BBC must be bold in embracing not only the future, but the present. Coming, therefore, to my main item—the big ticket, as it were—I really do not feel that BBC Scotland, as a public service broadcaster, is giving adequate coverage to the proceedings of this Parliament. I have said that before and I will say it again, because I genuinely believe it. Why does the BBC Scotland channel not broadcast the proceedings of this chamber live and uninterrupted? People should not have to navigate the internet to find the live broadcast of Scotland’s Parliament; they should just be able to switch on their telly. Between midnight and 7 pm, BBC Scotland broadcasts a message reading “This is BBC Scotland”. Why can BBC Scotland not take the live feed from the Parliament and distribute it as a public service? That would let more people engage with their Parliament; it would make it easier for people to tune in. That, I believe, is the responsibility of a national broadcaster or public service broadcaster, and I do not understand why that does not happen.\nOver its 100 years in Scotland, the BBC has shown that it can and does produce high-quality programmes for TV, radio and podcasts. I want the BBC to prosper. I want its influence across the planet to be enhanced over the next 100 years, promoting the values of decency, democracy and individual liberty, and to have nation truly speak peace unto nation.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Speeches-in-Parliament/content_39.html": "SNP Failures Put Public Safety At Risk 6th November 2024 Public safety is at risk due to the SNP’s failure to support police. Officer numbers are at their lowest since 2007, stress-related absences are soaring, and... Speeches in Parliament\nStrong Families, Strong Scotland 5th November 2024 Family, in all shapes and sizes, is the backbone of a prosperous society. We must do more to support families across Scotland. Speeches in Parliament\nSNP slash opportunities for Scotland's future 30th October 2024 A Scotland where every child has the chance to pursue their dreams—a Scotland full of hope and prosperity. That's my vision. But the SNP has other ideas, taking... Speeches in Parliament\nWe must be Prepared to Defend Ourselves 26th September 2024 Scotland and the rest of Britain must continue to support Ukraine. If we don't, we will give Putin the impression that he can continue his unprovoked aggression... Speeches in Parliament\nThe SNP are all talk, but no action! 17th September 2024 In the arena of the Scottish Parliament, the SNP say endless words, but the outcome of their governance is no action, no hope, and no joy. . Speeches in Parliament\nMichael Matheson must resign 28th May 2024 Michael Matheson claimed £11k from the taxpayers for personal reasons. He misled Parliament whilst claiming this money. In any other job you would be sacked... Speeches in Parliament\nSNP EU hypocrisy exposed 23rd May 2024 In the SNP's Europe's Day debate, I highlighted areas where the SNP reject the EU's lead. For a party that constantly moans about not being part of the EU, they... Speeches in Parliament\nSNP's Net-Zero Illusion 14th May 2024 We need a pragmatic path to Net-Zero. Enough of the SNP's attention-grabbing promises. Let's focus on realistic targets! Speeches in Parliament\nSNP Slammed for Damaging College Cuts 9th May 2024 We should be supporting Scotland's colleges; yet, the SNP's track record implies they have a differing opinion... Speeches in Parliament",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_msp-calls-return-face-face-gp-appointments/content_56.html": "Central Scotland Region MSP Stephen Kerr is calling on the SNP Government to set a target date for the return of more normal, face-to-face GP services.\nThe call comes after the Scottish Conservatives led a debate in the Scottish Parliament urging SNP Ministers to commit to outlining when patients will routinely be able to see their GP face-to-face for appointments. The SNP-Green Government and other parties voted against the Scottish Conservative motion.\nMr Kerr has thanked GPs across Falkirk for going above and beyond during the pandemic but says they are completely overwhelmed and this is having a knock-on effect on other health services in the area including ambulance wait times and A&E services. The MSP further commented that the SNP Government have been warned for years about a lack of funding for GP services in the Falkirk area, but failed to take any action.\nStephen Kerr said :\n“The refusal of the SNP-Green Government to back a swifter return to face-to-face GP appointments is extremely disappointing. The SNP cannot use Covid as an excuse. They were warned for years about how our GPs were overwhelmed and underfunded, but they failed to take any action.\nGPs across Falkirk have gone above and beyond during the pandemic to support patients but they are at breaking point. The SNP’s mismanagement of the health service over the last 14 years is failing GPs as they try to recover from the pandemic and get back to seeing more patients in person. Refusing to set a target date and provide the support desperately needed is letting down GPs and their patients as well as Ambulance and A&E services.\nAs we head towards winter, these pressures will only worsen. I will be continuing to hold the SNP Government to account, and push for a return of more face-to-face appointments between patients and their GP.”",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_michael-matheson-must-resign/content_61.html": "Michael Matheson claimed £11k from the taxpayers for personal reasons. He misled Parliament whilst claiming this money. In any other job you would be sacked immediately for doing this. He must resign.\nMichael Matheson claimed £11k from the taxpayers for personal reasons. He misled Parliament whilst claiming this money. In any other job you would be sacked immediately for doing this. He must resign.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_sign/content_26.html": "Tweet Sign up for my mailing list to receive regular emails on news, campaigns, and plans from my work in Holyrood holding the SNP to account. I promise not to bombard you with emails.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk/content_1.html": "Latest News SNP and Labour Net Plans are a dangerous fantasy The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade… Support Our Armed Forces and Veterans Unless you have served in our armed forces, we cannot comprehend the physical… Strengthening Your Voice Over the next financial year, the Scottish Government will spend a record £58.7… Central Scotland Follow me on Facebook\nSNP and Labour Net Plans are a dangerous fantasy The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade…\nSupport Our Armed Forces and Veterans Unless you have served in our armed forces, we cannot comprehend the physical…\nStrengthening Your Voice Over the next financial year, the Scottish Government will spend a record £58.7…",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_scotland-flourishes-when-opportunities-our-young-people-are-maximised/content_69.html": "Stephen Kerr (Central Scotland) (Con)\nThese past few weeks have been chaotic for the Scottish National Party. The veil of pretence of the past couple of decades has been ripped away. It has been like the scene in “The Wizard of Oz” when all is revealed, and the people of Scotland are left saying, “We can see you.”\nA week from now, we will have a new leader of the SNP, so this could well be the last time I have the pleasure of speaking in a debate opposing Shirley-Anne Somerville in her role as the Cabinet Secretary for Education and Skills—who knows? We have had our differences, but, although she is a political opponent, she is not and has never been my enemy. Regardless of what transpires next week, and in all sincerity, I offer my best wishes to her personally.\nExtending this conciliatory tone, I am pleased to say that there is a great deal of consensus that can be struck around this important subject that we are debating if we push aside the usual dollop of hubris in the Government’s motion and in the cabinet secretary’s speech. We will support the Government’s motion and Labour’s amendment, and I hope that the Government will support both of the amendments.\nScotland flourishes when the opportunities of our young people are maximised. For their futures and for all our futures, we need to address the significant challenges that our nation faces: the need for better productivity, the need for skills to take advantage of automation, artificial intelligence, the transition to net zero, and an increasingly volatile global situation. That is why we should consider the report “Choice, Attainment and Positive Destinations: Exploring the impact of curriculum policy change on young people”, which was published recently by the University of Stirling and the Nuffield Foundation. It speaks to a need to ensure that Scotland’s young people get the broadest possible general education covering the broadest possible range of subjects. We cannot afford to narrow their choices, because we need the talent of every single child regardless. That is why the shortages—already highlighted—of science, technology, engineering and mathematics teachers must be addressed. We need to do everything we can to attract people with specialist skill sets into the teaching profession. We need inspirational teachers to lift the gaze of our young people and to show them a world of possibilities.\nThe Scottish Government’s social research report “The Impact of Scotland’s Developing Young Workforce Strategy on Education”, which was published last week, speaks well on the need to move beyond the attainment of qualifications and to focus on meta skills. A big part of my leadership role in business before I was elected to public office was about building talent. It was about the recruitment and retention of talented people. Employers are always on the lookout for people with skills in team working, group leadership, thinking outside the box and problem solving. There is a real cost to businesses when they cannot recruit skilled people. There is the cost of recruitment itself, but there is also the opportunity cost of lost productivity that is down to poorly skilled workers and missed business opportunities.\nWe need businesses to be engaged in our schools—that is clear—and we do our young people a grave disservice when we fail to properly expose them to the real world of work. We fail them because we do not allow them to see the vast possibilities that exist for them. We fail them when we do not help them to understand that the world of work is crying out for people who have their talents, skills and passions.\nThat is why we need to expose our children and young people to the world of work, and I cannot see why we cannot do that from the earliest years. Play is a very effective way to make that introduction. We can give our young people a vision of their possibilities, reinforce that vision by bringing them into contact with a whole variety of businesses, sectors, roles and career choices throughout their years of broad general education, and then help them to be personally equipped with the confidence, resilience and skill sets that they need to take advantage of the opportunities that exist.\nBusinesses can and must make that investment in our classrooms. There is no doubt that it is in their best interests to do that, but we must be sure that, when businesses make the investment—when they prepare to provide support—they do not come up against a brick wall and there are not barriers to their getting into schools. Although there are examples of schools opening their doors to the local business community and interacting with all kinds of businesses and organisations, there are also places where none of that happens. That must change. There cannot be a postcode lottery in matters as important as these.\nThe social research paper that I mentioned finds that a barrier to curriculum-based work-related learning is that teachers feel overburdened as it is and they lack the confidence and resources that they need to build work-related learning into their lessons. Therefore, we need to support our teachers and help them to make that possible, because it is the kind of innovative approach that shows what Scotland’s educational experience should be. It needs more support and it needs to be rolled out across the country, so that all our young people can benefit. We need wider recognition of the importance of sound career guidance from secondary 3 onwards. I welcome the work that is being done in the area, but I want us to go further.\nWe also need to recognise the importance of personal mentoring, especially in the senior phase. That should not be a tick-box exercise. We should draw on all available talent from across the community—from businesses, professional bodies and organisations in the area. I have nothing but praise for all those who are already mentoring young people across Scotland, very often in a voluntary capacity. Let us overinvest in helping young people to see what their options are and in helping them to get to the places they want to get to.\nWe will all be winners when we help young people to win, but there is a disparity that is holding us back. Traditional, ingrained attitudes towards technical subjects and technical and professional qualifications are holding us back. Too many people still believe that there is a best pathway for a child that involves passing highers and advanced highers and then going to university. For some young people that is the best path, but there are other paths that are just as good.\nEmma Harper (South Scotland) (SNP)\nWhat you are talking about is making me think about what is happening locally in Dumfries and Galloway, where businesses—Jas P Wilson in Dalbeattie is one of them—are engaging with schools and the kids are being valued for choosing whatever path they want, which might not be university; it might be vocational skills. Would you agree that there is work being done out there that is exactly what you have been on your feet, gaun on aboot for the past few minutes?\nThrough the chair, please, Ms Harper.\nApologies, Presiding Officer.\nEmma Harper is right in saying that there is, indeed, some really good work going on, but it is not equally distributed across Scotland and there are gaps. Filling those gaps should be a priority. [Inaudible.]—possible educational experience. As long as we hold on to the old out-of-date ideas about the value of different pathways that are available to young people, we will hold ourselves back as an economy and a society.\nStuart McMillan (Greenock and Inverclyde) (SNP)\nSimilar to my colleague Emma Harper, I notice that a lot of great work is taking place in Inverclyde—my party does not control Inverclyde Council. Will Stephen Kerr name the local authority areas where there is a problem that he would like to be fixed?\nI will not do that, for obvious reasons. That is not the purpose, and it is not a good use of my time.\nIn the spirit of consensus, and just in case this is our last debate, I welcome Stephen Kerr’s remarks on the matter. I encourage him, if he has not done so already, to read the interim report by Professor Louise Hayward, which is trying to get to how we see not just one right or successful way through school, but a myriad of ways. We must reform to be able to capture that in its widest sense.\nI agree with the cabinet secretary in respect of Louise Hayward’s work. I look forward to the full report coming out in, I think, May.\nI challenge the Government that, if it truly wants to ensure parity of esteem—I think that we all do—it has to start with parity of funding. We should fully fund our young people’s choices, whether they go to university, to college or into an apprenticeship. That would go a long way towards addressing the funding issues that our colleges have. That is the real world, and I hope that the minister who responds to the debate will not seek to deny that there is a financial challenge.\nI am making an appeal to social justice and the common good, because the issue is equality of opportunity. That is what is needed. Regardless of who somebody is, what their background is or what postcode they live in, they can achieve what they want to achieve, be what they want to be and do what they want to do. That is what being a young Scot should mean.\nThat is the philosophy on the Conservative benches, and we will support all measures to make it a reality for every young person in Scotland. When we invest in our young people, we invest in the future of our nation. To have a Scottish education system that is worthy of its heritage and of the young people that it serves, we must build a system of education that offers diverse opportunities to engage with work, different ways of learning and the possibilities that the future holds.\nI urge all members to support the amendment in my name.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_kerr-urges-prime-minister-act-over-whisky-tariff/content_34.html": "The MP for Stirling has called on the Prime Minister to intercede personally to try and prevent the imposition of new tariffs on Single Malt Whisky and a range of other goods that are due to start on 18 October.\nThe United States of America have been given permission to impose tariffs of $7.5bn on goods imported from the European Union from the 18th October. This was after the World Trade Organisation judged that some countries in the EU had unlawfully been subsidising Airbus for years. The U.S. Government has fought a fifteen year legal battle to prove that the European plane manufacturer, Airbus, was subsidised against WTO rules and this affected the ability of Boeing to compete fairly.\nTrade officials from the United States of America have stated that a tariff of 10% would be imposed on aircraft and 25% of agriculture and other items. This will result in a 25% tariff being imposed on single malt Scotch Whisky. Other items such as biscuits, cashmere and books will also be affected. The EU have threatened to increase their tariffs on goods from the United States of America in retaliation despite being found to be at fault.\nThe UK Government is seeking confirmation from the World Trade Organisation that the UK has always complied fully with the rules and that we should be exempt from these tariffs as it was other European countries that have acted wrongly.\nThe Stirling area has two of the most important and globally recognised distilleries – Deanston and Glengoyne , both who have significant exports to the USA.\nStephen Kerr has written directly to the Prime Minister asking him to personally intercede with the President to try and get UK businesses exempted\nIn response to the news, Stephen Kerr MP said:\n“This is highly disappointing news for a key Scottish industry. The United States of America is the biggest export market for Scotch Whisky, but introducing these tariffs will have a negative impact, including to the two local distilleries. It is fundamentally unfair that they should be punished due to the actions of the EU. There are many other small businesses that export the other items included that will also be badly affected. I have urged the PM to talk directly to the President urgently.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news/content_8.html": "SNP and Labour Net Plans are a dangerous fantasy Wednesday, 22 January, 2025 The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade—they impose. Anti-business. Harmful to communities. This won’t work. Speeches\nSupport Our Armed Forces and Veterans 14th January 2025 Unless you have served in our armed forces, we cannot comprehend the physical and mental toll. We must support our armed forces and veterans. Speeches\nStrengthening Your Voice 2nd January 2025 Over the next financial year, the Scottish Government will spend a record £58.7 billion of taxpayers’ money. On the 4 th of December the Cabinet Secretary for... Articles\nExposing SNP Failures: A Path to Fix Scotland's Social Care Crisis 27th November 2024 The SNP's National Care Service aims to centralise power, not improve social care. To fix social care, we must scrap these plans and prioritise real solutions. Speeches\nChallenging the Leftist Consensus on the Miners' Strike 27th November 2024 Speaking in Parliament, I highlight that Arthur Scargill abused his position to try and bring down a democratically-elected Government. Speeches\nSNP Putting Public Safety at Risk 21st November 2024 It's unbelievable. The SNP have not invested enough into prisons for the past 17 years. There solution to fix this problem? Release criminals who haven't served... Speeches\nChallenging the SNP’s Anti-Business Agenda 12th November 2024 The UK should be pushing for free trade. We need a deal with the U.S., and with Trump back, now is the time to get it. We should also dive into the Trans... Speeches\nSNP Failures Put Public Safety At Risk 6th November 2024 Public safety is at risk due to the SNP’s failure to support police. Officer numbers are at their lowest since 2007, stress-related absences are soaring, and... Speeches in Parliament\nStrong Families, Strong Scotland 5th November 2024 Family, in all shapes and sizes, is the backbone of a prosperous society. We must do more to support families across Scotland. Speeches in Parliament\nSNP slash opportunities for Scotland's future 30th October 2024 A Scotland where every child has the chance to pursue their dreams—a Scotland full of hope and prosperity. That's my vision. But the SNP has other ideas, taking... Speeches in Parliament",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-plan-jeopardise-scottish-jobs/content_52.html": "The UK Single Market empowers Scottish businesses to thrive, job creation, and strengthens communities. Families enjoy lower prices and more choice. Paired with Scottish innovation, it's the backbone of Scotland’s success and a gateway to even greater heights!",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_challenging-leftist-consensus-miners-strike/content_38.html": "Tweet Wednesday, 27 November, 2024 Speeches Speaking in Parliament, I highlight that Arthur Scargill abused his position to try and bring down a democratically-elected Government.\nSNP and Labour Net Plans are a dangerous fantasy Wednesday, 22 January, 2025 The SNP and Labour's Net Zero plans? A dangerous fantasy. They don’t persuade—they impose. Anti-business. Harmful to communities. This won’t work.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_supporting-our-nato-allies-over-nordstream-2/content_73.html": "I have signed a letter to Foreign Secretary Boris Johnson, highlighting the Geopolitical threat of Nordstream 2. Nordstream is a proposed Natural Gas pipe which will link Russia to Germany, bypassing countries in Central and Eastern Europe including Poland and Ukraine.\nThe letter also highlights an upcoming Parliamentary Debate on the issue, in which MPs will have the ability to ask the Prime Minister to call for the pipeline to be blocked.\nIt is my view, along with that of other politicians in the UK and abroad such as Polish Prime Minister Mateusz Morawiecki and former US Secretary of State Rex Tillerson, that this pipeline has the potential to risk the energy security and defence of the UK’s allies. It could also seriously impact our own country.\nThere is very clear reasoning behind this thinking. By building this new pipeline, Russia will be able to send gas to Germany without it passing through Poland and Ukraine. Poland and Ukraine currently ferry billions of cubic metres of Russian gas per year through to Western and Central Europe, giving them considerable influence.\nWith the ability to pipe gas to Western Europe without going through Poland and Ukraine, Russia may be able to blackmail and increase it’s influence over these nations. Ukraine stands to lose 2 billion euros in yearly gas transit fees, which would hit the country financially. Former USA Sec. of State Rex Tillerson has added that the pipeline would threaten European energy security, as it could increase European dependency on Russian gas. These are all issues that I find deeply concerning for the stability of Europe.\nIt is an issue which can directly affect the UK, and Central Scotland. Grangemouth is a major employer in the Central Belt, and sustains 2,000 jobs in Stirling directly or indirectly. Our energy security and the security of the plant needs us to be vigilant against the threat of Russian influence in the energy market. The price of Gas also of course affects energy consumers, hitting the most vulnerable hardest.\nI am therefore taking the position that the UK needs to stand with Poland, Ukraine, and other European nations at this time, and call on Germany to block Nordstream 2.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_jubilee-showed-us-best-britain/content_29.html": "The long jubilee weekend to many was a time of rest and respite; who doesn’t like time off, especially when the sun makes a rare foray from behind its usual cloud cover?\nWhat it was to me, and I know to millions of people across Scotland, and thousands across Falkirk, was a celebration of 70 years of service from HM the Queen.\nWhat a 70 years. When the Queen was crowned, Winston Churchill was Prime Minister. Think about how much our country has changed over that time, what crises have risen, how society has altered, shifted, moved from the end of the industrial era to the age of Information.\nNo matter what the change or the occasion, our Queen has been there as a leading light of our nation. She has been throughout this time a person we look up to for inspiration and guidance, an incomparable beacon of dignity in public service.\nFor never forget that she is a public servant. Long gone are the days of tyrants and warlords, today’s Monarchy fits exactly in modern Britain as a warm recollection of our history and traditions, while also being the world’s best advertisement for the United Kingdom. I do not exaggerate; even in the Republic of Ireland a recent poll put the Queen’s popularity above any of their current politicians.\nAlthough the Queen has so recently suffered a great personal tragedy, the loss of her husband of 73 years Prince Philip, she has never wavered from her commitment to our country. The “Keep Calm and Carry On” napkins, mugs, and posters sold from the tat vendors around Westminster must be inspired by her will and fortitude.\nI was delighted to see the events in Falkirk District to celebrate the Queen and her service. From Polmont to Shieldhill to Grangemouth people of all ages rallied round cake and tea, a coming together you can only ever see in Britain.\nAlthough the bunting is now down and the cucumber and cress resigned to memory; our Queen continues to service- and long may she reign over us!\nMy Falkirk Herald column, 16/06/2022",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_contact/content_9.html": "Please get in touch if you have any concerns.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_cdn-cgi_l_email-protection/content_13.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_greens-abandon-yet-another-pledge/content_64.html": "From the Scottish Green party manifesto, Apr 2021:\nINTERNATIONAL FREQUENT FLYER LEVY\nAs demand has grown, emissions from international aviation in Scotland have almost doubled since 1990, largely driven by leisure travel by the wealthy.\n70% of all UK flights are made by the top 15%. The Scottish Greens will replace air passenger duty with a frequent flyer levy, as recommended by the Committee on Climate Change, once we emerge from the pandemic.\nEvery passenger in Scotland will pay nothing for their first return flight in a 12-month period, with the levy incrementally rising for each additional flight after that.\nThis would not apply to domestic flights linking the Highlands and Islands to the rest of the country.\nLink: https://greens.scot/ourfuture/fair-taxes\nFrom the Scottish Government (which includes the Scottish Greens), Nov 2021\nQuestion ref. S6W-04106\nAsked by: Stephen Kerr, Central Scotland, Scottish Conservative and Unionist Party\nDate lodged: 1 November 2021\nQuestion\nTo ask the Scottish Government whether it is considering a frequent flyer levy, which would incrementally increase the cost of flights if a passenger takes multiple flights in a 12-month period.\nCurrent status: Answered by Tom Arthur on 15 November 2021\nAnswer\nAPD is currently set by the UK Government, with introduction of ADT in Scotland deferred to allow the issues raised in relation to the Highlands and Islands exemption to be resolved.\nThe Scottish Government has no plans to introduce a frequent-flier levy. This option was ruled out in the context of a consultation on Air Departure Tax (ADT), on the grounds that it would be disproportionately resource-intensive to administer. The same issues remain now.\nThe current system of Air Passenger Duty (APD) has the effect of charging tax for each flight purchased, but without the need for recording the number of flights an individual has taken.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Westminster-News/content_30.html": "SNP in trouble over Indyref2 question 22nd August 2022 The Indyref2 question in the Bill being presented to the Supreme Court by the Scottish Government’s lawyers has not been tested by the Electoral Commission. In... Westminster News\nKerr comments on Brexit votes 23rd October 2019 The Prime Minister should be congratulated for getting a deal that has, finally, received support from the House of Commons. That is a significant achievement... Westminster News\nKerr urges Prime Minister to act over Whisky tariff 7th October 2019 The MP for Stirling has called on the Prime Minister to intercede personally to try and prevent the imposition of new tariffs on Single Malt Whisky and a range... Westminster News\nOn civility in politics 26th September 2019 I have long talked about the need for more civility in our politics. The conduct of members on both sides of the House of Commons yesterday was appalling. This... Westminster News\nComment on the Supreme Court ruling 24th September 2019 I would like to start off by saying that the Prime Minister and the Government will fully respect and abide by the judgement of the Supreme Court. The Court, in... Westminster News\nStirling MP backs support for persecuted Christians 3rd September 2019 Stephen Kerr MP for Stirling has welcomed the news that the UK Government will be fully accepting the recommendations of the Bishop of Truro's report into... Westminster News\nMP RAISES AWARENESS OF RECALL ON TUMBLE DRYERS AND SAFE USE 21st August 2019 Last year there were 47 fires caused by Tumble Dryers in Scottish Homes. Westminster News\nStephen Kerr MP calls to abolish visa fees for Commonwealth servicemen and women 23rd July 2019 The MP for Stirling has added his name to a cross party group of MP’s who have written to Home Secretary Sajid Javid calling for the abolition of visa fees for... Westminster News\nKerr tries out Bolt Mobility Scooters 25th June 2019 Stirling MP Stephen Kerr has met with new tech company, Bolt Mobility, where he learned more about a new product aimed at improving the mobility of elderly and... Westminster News",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_accessibility/content_2.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_stirling-mp-backs-support-persecuted-christians/content_62.html": "Stephen Kerr MP for Stirling has welcomed the news that the UK Government will be fully accepting the recommendations of the Bishop of Truro's report into overseas persecution of Christians.\nThe report found that, of all religions worldwide, Christians were the most persecuted. The attacks are especially concerning in the Middle East.\nPrompted by a written Question from Stephen Kerr asking how implementation was proceeding, the Government responded saying:\n\"The Government has accepted all the recommendations of the Bishop of Truro’s report and work is underway to take them forward. We have established an implementation team, and have allocated £200,000 this year for research into concrete actions the UK can take in countries mentioned in the Report. My ministerial colleague, Lord Ahmad of Wimbledon, will oversee the recommendations’ implementation.\"\nStephen Kerr MP said:\n\" I am a firm believer in the Freedom of Religion and Belief. Individuals need to be free to follow the faith of their choice, or remain agnostic as they so choose. It is disgraceful how there is still so much faith-based persecution going on worldwide.\nI am very pleased that this Government has taken action, and I will follow this issue as it continues to proceed through Parliament\"",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_chinese-communist-party-security-threat/content_31.html": "Presiding Officer,\nThe security threat that the Chinese Communist Party poses to our way of life has not received enough attention by Britain’s parliaments or media, and thus, I am thankful for Alex Cole-Hamilton for bringing forward this important debate.\nWith the world’s eyes fixed on pathetic Putin and the crooked Kremlin after their illegal invasion of Ukraine, the suspicious activities of the Chinese Communist Party continue to avoid the headlines.\nBut failing to address these threats would be a catastrophic strategic mistake by our United Kingdom. We must wake up to the threat posed by President Xi’s government and start taking action to defend ourselves now, and equally as important, explain articulately and concisely why we must do so to the Scottish public.\nThere are many fields where the Chinese Communist Party are aiming to undermine British society but due to time constraints, I will focus on two areas: technology and higher education.\nIn spring 2021, Western Governments united to condemn Chinese Community Party backed cyber-attacks, designed to enable large-scale espionage, and identify individuals through data.\nIn Britain, some of these attacks were focused on government agencies and critical national infrastructure.\nIn the summer of 2020, the UK Government took the right step of banning Huawei from our 5G network, concluding that Huawei’s involvement was an unmanageable security risk. This ultimately was the right decision, but the UK Government took too long to come to this sensible conclusion.\nLooking from the outside, it also appears that the UK Government took this decision to follow in the footsteps of the USA. Whilst it is important to work closely with our allies, we must be proactive in our response to security threats, as we have demonstrated we can be in Ukraine.\nWe cannot put ourselves in a position where we are dependent on the United States, or any other country or organisation.\nThen there is TikTok, a popular app amongst young people which poses a potentially great security risk to individuals and our country.\nWith allegations that data collected by TikTok is shared with the Chinese Communist Party, we must urge everyone, with a full understanding that this could make us incredibly unpopular, to remove this app from their phone.\nWe must defend the freedom of our Higher Education institutions, especially universities who are becoming increasingly dependent on Chinese Communist Party funding.\nWe have seen reports of Chinese students in the UK being spied on by the Chinese Communist Party; espionage attempts, including efforts to steal sensitive information from British universities; and the opening of Confucius Institutes, Chinese Communist Party funded bodies to promote their propaganda.\nIs this what we really want at our universities?\nResponding to the threats of the Chinese Communist Party are mostly reserved matters, but there are some steps we can take in this Parliament.\nThe proper funding of Scottish universities is one of these steps, as well as establishing frameworks which safeguards Scottish institutions from foreign-government influences.\nWe all have a responsibility to take steps to stand up to the Chinese Communist Party, but the most important of these, in the short-term at least, is explaining to the Scottish public why we must do so.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_cookies/content_11.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-are-all-talk-no-action/content_71.html": "In the arena of the Scottish Parliament, the SNP say endless words, but the outcome of their governance is no action, no hope, and no joy. .\nIn the arena of the Scottish Parliament, the SNP say endless words, but the outcome of their governance is no action, no hope, and no joy. .",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_about-stephen-kerr/content_4.html": "Stephen Kerr is the Conservative Member of the Scottish Parliament (MSP) for Central Scotland. He is currently a member of the Constitution, Europe, External Affairs, and Culture Committee in Holyrood.\nStephen Kerr has lived in Stirling, with his wife Yvonne since 1982. He has four children.\nStephen Kerr was born in Dundee in 1960. He was raised on a council estate in Forfar, Angus. His father was a butcher to trade and worked for the local branch of the Coop. His mother was a shop assistant. He attended a local primary school and later, Forfar Academy and left school at 16 to work as a bank junior. After returning from a two year period of church voluntary service in London, Stephen graduated from Stirling University with a honours degree in Business.\nHis career has largely been spent working in business, mainly in sales and marketing. His role immediately prior to his election involved heading the sales teams for an international company (Kimberly Clark) in the UK, Ireland and France.\nHe stood previously as a Conservative candidate in the 2005 and 2015 General Elections and was finally successful in 2017 where he was sent to Parliament in Westminster to represent the Stirling Constituency. As an MP he spoke up for Stirling and Scotland, helped people throughout the constituency and served on the Business Energy and Industrial Strategy Select Committee.\nAs MSP he intends to force the Scottish Government to focus on domestic issues instead of constitutional ones. He wants to expose over-spending, reduce Scottish Government influence on third sector organisations, and push Holyrood to be the devolved Government it was created to be.",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_snp-cuts-close-raploch-forth-valley-college/content_72.html": "In August 2021, Forth Valley College was projected to receive a funding increase of 4%. They were to receive a higher increase as they are already considered to be underfunded.\nThe funding increase was also to cover the cost of digital learning and mental health support, as specific funding for these was not to continue. It would also cover full funding for foundation apprenticeships.\nHowever, the funding award they received awarded no extra money. The college says that factoring in inflation, public sector pay, this is a real terms cut of 8%.\nBecause of this they are closing their Raploch campus. The Raploch is one of the most deprived areas of Scotland.\n42 full time equivalent jobs will also be lost.\nStephen Kerr MSP said:\n“It appears that the SNP have made the headlines they wanted by announcing funding for digital learning and mental health support in 2020, because now they’re pulling it out of Forth Valley. Because of this, and a failure to provide proper funding, Forth Valley College now faces a 8% real terms cut.\nNicola Sturgeon is letting down Scotland’s education system. This cannot be allowed to continue.”",
  "https_www_stephenkerr_org_uk_/https_www_stephenkerr_org_uk_news_category_Opinions/content_12.html": "Everything you need to know before King Charles III’s coronation 3rd May 2023 Anticipation is growing for the coronation of King Charles III, the first coronation of a British monarch since 1953. As a country proud of its traditions... Opinions\nStone of Destiny is a powerful symbol of commitment to UK - Stephen Kerr MSP 13th April 2023 Britain will once again be on the world stage as we celebrate the coronation of King Charles III on 6 May. The global audience will be of similar size to the... Opinions\nChinese Communist Party Security Threat 24th February 2023 Presiding Officer, The security threat that the Chinese Communist Party poses to our way of life has not received enough attention by Britain’s parliaments or... Opinions\nHow Sturgeon's departure will affect the Union 24th February 2023 Many Scots would have felt an immense sense of relief at the news of Nicola Sturgeon’s resignation, with some even having a dram or two to celebrate. These... Opinions\nThe latest Indyref2 offering analysed 19th October 2022 On Monday, First Minister Nicola Sturgeon took to the stage once again for the third instalment of a series of books setting out what a separated Scotland would... Opinions\nThe Jubilee showed us the Best of Britain 16th June 2022 The long jubilee weekend to many was a time of rest and respite; who doesn’t like time off, especially when the sun makes a rare foray from behind its usual... Opinions\nSNP fail to learn lessons on Education: Stephen Kerr MSP 30th August 2021 As run in the Falkirk Herald 26/8/2021 The Scottish Government must help our pupils recover from almost a year of lost education. Although schools and teachers... Opinions\nAn attack on my religion by a national newspaper. 14th February 2019 I have written to the Editor of \"The National\" newspaper, following an article about me. Opinions"
}