{
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_torridge-and-tavistock/content_9.html": "Making up one of the largest constituencies in England in terms of geographical size, Torridge and Tavistock is a beautiful mix of hills, valleys, coastlines and moorland. The constituency stretches from Bideford along the North Devon coast to Hartland, and in the south from Dartmeet across Dartmoor to Tavistock and the Bere Peninsula aside the Tamar Valley. The constituency contains part of Dartmoor and is made up of market towns such as Holsworthy and Great Torrington, as well as the aforementioned Stannary Town of Tavistock and the ‘Little White Town’ of Bideford, which nestles on the banks of the River Torridge near Northam and the romantically named village of Westward Ho!.\nPolitics in both Torridge and Tavistock has always been a competitive affair, with Conservatives and Liberals vying for popularity. Past MPs for the area include Lord John Russell, a reforming Victorian Prime Minister, Michael Heseltine, Jeremy Thorpe served Bideford, and for a brief while Mark Bonham Carter scored an early by-election victory for the Liberals in the old Torrington constituency before being unseated at the next election by Percy Brown for the Conservatives. Conservative MP Sir Peter Mills is remembered with great affection for his qualities of being an honest, hardworking local MP, whilst turncoat Baroness Nicholson became notorious for her defection from Conservative to Liberal Democrat. Between 1997 and 2005 the seat was held by Lib Dem John Burnett, who retired in 2005. Geoffrey Cox was subsequently elected MP in 2005 and re-elected in 2010.\nThis is a rural constituency with rural issues. Population sparsity works against fair funding for local services, which are consistently under funded by government on a per-capita basis in comparison with the national average or particularly Labour dominated areas. The on-going depression in agriculture continues to alter the face of the local communities and means less reliance on the traditional means of earning a living, whilst more and more people look towards Barnstaple, Exeter and Plymouth for a job.\nHowever, the quality of life in the constituency would be considered by many to be good. There is less crime and unemployment than in many areas, and the people are traditionally welcoming and friendly. There are a great many interesting and enjoyable places to visit and the rat race can be left far behind as you walk across the moor, stroll on a magnificent sandy beach or enjoy a Devonshire Tea with clotted cream!",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news_category_Local-News/content_16.html": "Sir Geoffrey Cox visits Bishop of Exeter and Parishioners on the day before Christmas Eve. 23rd December 2024 Sir Geoffrey met with the Bishop of Exeter and local parishioners to discuss the future of Petrockstowe Church. Sir Geoffrey was pleased to meet with the Right... Local News\nSir Geoffrey Cox is pleased that X-ray services are available at Tavistock Hospital once again 12th August 2024 Following a period of disruption, the NHS University Hospitals Plymouth Trust has announced that an interim X-ray service will be operational by early August... Local News\nSir Geoffrey Cox standing again in Torridge and Tavistock 30th May 2024 The Torridge and Tavistock constituency's Conservative candidate, Sir Geoffrey Cox, has officially confirmed he is standing again in the coming general election... Local News\nMy September and October Newsletter 6th November 2023 Another warm welcome to my regular e-newsletter where you can read what I have been doing as your local Member of Parliament for Torridge and West Devon. This... Local News\nGovernment to Fund New Tavistock to Plymouth Rail Link 16th October 2023 I am delighted that the Prime Minister has announced the Government has approved the reopening of the Tavistock to Plymouth Railway line with a new station to... Local News\nOn the Xlinks Solar Project 14th December 2022 \"Many residents of the Alverdiscott area have been writing to me to express their grave concerns about the inadequacy of the consultation, and the information... Local News\nGeoffrey to Consult on Calling in any Planning Application by TDC for Housing Development on South Street Car Park in Great Torrington 1st December 2022 Geoffrey has written to Torridge District Council about a recent feasibility study on whether to use part of South Street Car Park for housing development. He... Local News\nGeoffrey opens new rent-to-buy affordable housing 25th November 2022 Today, Geoffrey opened new rent-to-buy affordable housing in Lifton, and welcomed residents to their new homes. Having \"cut the ribbon\" at number 4, and planted... Local News\nAppledore Shipyard Part of £1.6 Billion MoD Contract 16th November 2022 Geoffrey has hailed the selection by the MOD of a consortium, including Appledore Shipyard and Harland & Wolff, as preferred bidder to build three Fleet Support... Local News",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_about-sir-geoffrey-cox/content_11.html": "Geoffrey has been the Member of Parliament for Torridge and Tavistock since he was first elected in 2005. He was returned for a sixth time in the 2024 General Election.\nHe and his wife, Jeanie, have lived in West Devon for many years and are well known in the community. His three children were brought up here, attending local schools. His father went to school in Tavistock and his family have been Devonians for generations. Geoffrey is President of Tavistock AFC, a Patron of a local mental health charity and Vice President of the North Devon Hospice. He has a special interest in learning disabilities and mental health and supports charities, community causes and sports clubs all over the constituency.\nGeoffrey has held regular and frequent advice surgeries in Bideford, Torrington, Holsworthy and Tavistock and since 2019 has personally helped over 4,000 constituents with their individual cases and held more than 800 surgery appointments.\n____________________________________________________________\nGeoffrey is determined to continue serving and protecting our communities and to support a new Conservative Government committed to a sound economic plan that relies on responsibly costed public policy, investment in the skills of local people and rising wages.\nGeoffrey’s priorities for Torridge and Tavistock include:\n- Local action for local people - Helping over 4000 constituents and holding over 800 surgery appointments since 2019.\n- Delivering major new investments in our communities - Securing over £60 million of direct public investment into our communities.\n- Backing our rural economy - Championing a living, working countryside with farms and small businesses at its heart.\n- Improving our infrastructure - Turbocharging rural broadband connectivity and new rail and road links to serve our market towns and villages.\n- Guaranteeing the Pensions Triple-Lock+ - Keeping the Triple Lock and ensuring it is never taxed by increasing pensioners' tax allowances.\n- Keeping Britain secure in an uncertain world - Increasing defence expenditure to 2.5% of GDP, reinforcing our Armed Forces in a world of heightened insecurity.\n- Keeping a strong economy - With inflation back lower than the EU and US, alongside growth joint highest in the G7, Geoffrey will support keeping a tight hold on the nation's finances and reducing the tax burden on working families.\n__________________________________________________________________\n\"On behalf of the North Devon Fishermen’s Association, we would like to pass on our grateful thanks for all that Geoffrey Cox has done for the fishing industry of North Devon. When we have called upon him, he has always responded. He has always supported our cause.\" John Balls. Chair. NDFA.\n\"When a friend suggested that we got an appointment with Geoffrey Cox to help us obtain an ASD assessment for our daughter, we didn’t really think it would help much but this couldn’t have been further from the truth. We were amazed by the support offered by Geoffrey and his team. His empathy, experience and advice made a huge difference to our situation. As a result, our daughter received a diagnosis within weeks and the process has now been improved for other families on the ASD pathway in Devon.” Mr. & Mrs. B. Bideford.\n“After battling with CAMHS for too long to get the help my child desperately needed, Geoffrey responded to my request straight away and really took the time to understand the problems we had been having trying to make health service and social service professionals listen. His influence got my child that help, and things are finally improving. Geoffrey has probably been the single most important influence on whether my child has a happy and successful adult life, and I will be forever grateful for that.” J.D. Tavistock.\n\"In my own experience, Geoffrey works hard to help the business community here in Torridge. He really understands the issues and makes sure those in government take action. As a local businessman, it is reassuring to have Geoffrey as our Member of Parliament.\" Andy Lobato, CMT Group, Great Torrington.",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk/content_1.html": "Geoffrey Cox on Facebook Geoffrey Cox on Twitter Is Sir Geoffrey your MP? Enter your postcode Postcode Stay up to date Leave this field blank Stay informed on the latest news. Your email First name Last name Postcode Address ID Address 1 Volunteer for us In which of these ways can you help us? Delivering a few leaflets locally now and again Helping with office and admin tasks Making calls to voters and volunteers Joining our canvassing team to knock on doors Potentially standing to be a local Conservative Councillor Becoming a Digital Ambassador By agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our Data Protection and Privacy Policy",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news_writing-telegraph-sir-geoffrey-argues-speaker-altered-procedures-and-made-mockery-parliament/content_17.html": "By Sir Geoffrey Cox\nBy deciding that Labour should be able to present its amendment, and that its amendment should be voted upon first, Labour was allowed to take over the opposition day debate allocated to the Scottish National Party and effectively set aside the SNP motion demanding an immediate ceasefire in Gaza.\nThere are two possible explanations for Mr Speaker’s decision to abandon the long-standing convention that only the Government should be able to move an amendment to an opposition day motion.\nThis convention ensures the party moving the motion of its choice on opposition day (which each opposition party is allocated), is guaranteed to have it voted upon, unless the Government carries its amendment, thus expressing the will of the House.\nFirst, he did it to assist his former party leader get out of a bind. It is said that around 100 Labour MPs might have voted in favour of the SNP motion. Secondly, he did it, as he himself says, in a misguided attempt to protect certain mainly Labour MPs from the intimidation that they said would otherwise have followed if they had voted against the SNP motion.\nEither reason is unacceptable. If the former, it is an abuse of his office. If the latter, it is an abject surrender to intolerance and tyranny; it meekly offers up the House of Commons as able to be influenced by external threats.\nThe Speaker has accepted he made a serious error of judgment but the real question is, who induced him into this error? Who persuaded Mr Speaker that he should change the procedures of the House of Commons and permit those mainly Labour MPs to avoid the question the SNP, subject only to the Government’s amendment, was entitled on that day to ask MPs to decide. He says to protect them from intimidation and violence?\nWe know that shortly before the decision was taken, the Leader of the Opposition met him in his rooms. There, he pressed the case on the Speaker. We can imagine how the arguments went.\nMPs should be allowed to vote for a range of views and not be artificially confined to binary formulations that did not accord with their sense of the issues; feelings were running high out there; MPs (the Speaker’s old colleagues) were being regularly threatened in the constituencies outside the House of Commons. The long-standing convention was outdated and needed to be changed. The Speaker had a duty to protect them.\nThus, insidiously, poison was administered. A speaker of the House of Commons of the United Kingdom weakly capitulated before the spectre of intimidation of MPs made fearful by external threats and apparently too afraid to vote with their consciences. He altered the procedures to save them from it, at the expense of another party’s right, and made a mockery of the Parliament and the people he serves.\nWhat message does it send to the enemies of democracy around the world, if they see that the very seat of democracy in the United Kingdom can be so easily moved by such threats?\nI am not calling for Lindsay Hoyle to go. He is mortified and realises he got this judgment wrong. But the one who urged the ignominious surrender, for no doubt purely coincidental party advantage, and was seen to have mouthed, “thank you”, as he passed the Speaker’s chair a few minutes later, was none other than Sir Keir, who in less than a year will ask that same people and Parliament to entrust him with the security of the nation.",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news_geoffrey-speaks-support-local-farmers/content_20.html": "On 23 February 2022, Geoffrey held a Westminster Hall debate on Food and Farming in Devon and Cornwall.\nGeoffrey said:\n“I supported the departure of this country from the European Union. I believed in every fibre of my being that the freedoms it would permit our nation, if seized and enacted, would bring great benefits, not only to the farmers of our country but to our country as a whole. I do not believe the people of this country would fail to understand the need of British farming for skilled labour. I do not think that was the objection of the millions who voted for Brexit. They would understand a policy of flexibility.\n“There is no need for us to maintain, with adamantine stubbornness, a policy that leads to labour shortages in British farming. So I agree with my hon. Friend the Member for Newton Abbot completely. Nowhere is this uncertainty felt more keenly than in Devon, where 13% of the economy of the county consists of food production, almost twice the national average. No one seriously argued that an area-based direct payment scheme, such as the one we have, should be retained. Agricultural support should be aimed, as far as possible, at those who look after and promote the wellbeing of the land, or who genuinely make their livelihoods from it.”\nYou can read a transcript of the debate here, or watch the debate here.",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_contact/content_4.html": "Skip to main content\nMain navigation\nHome\nAbout Geoffrey\nNews\nIn Parliament\nContact\nContact\nLeave this field blank\nOffice Address\nThe Rt Hon Sir Geoffrey Cox KC, Lockyer House, Paddons Row, Tavistock, PL19 0HF\n01822 612925\n[email protected]\nGeoffrey Cox on Facebook\nGeoffrey Cox on Twitter\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.\nVolunteer for us\nIn which of these ways can you help us?\nDelivering a few leaflets locally now and again\nHelping with office and admin tasks\nMaking calls to voters and volunteers\nJoining our canvassing team to knock on doors\nPotentially standing to be a local Conservative Councillor\nBecoming a Digital Ambassador\nBy agreeing to volunteer for us, you also agree to us contacting you about volunteering. For more information, please see our\nData Protection and Privacy Policy",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news_sir-geoffrey-seeks-assurances-new-government-future-hmp-dartmoor/content_15.html": "22/07/2024\nSir Geoffrey has sought assurances from the new Labour Government that it will keep Dartmoor Prison open and that it has a long-term future under Labour.\nSir Geoffrey, who fought off an attempt by the Prison Service to close the prison in 2019, was in close dialogue with the former Conservative Government about its future until the general election and now has written to the Secretary of State for Justice, Shabana Mahmood MP, questioning the decision to cease its use \"temporarily\".\nThe MP said: \"We are led to believe that this closure is temporary, but I am puzzled why, in the light of the shortage of prison places, the Government has given in to demands to evacuate the prison because of radon gas. That problem has been known for several years, mitigating measures were being taken, and the Conservative Government did not accept the health and safety executive's suggestion that the gas infringed the legal standards of exposure or was a substantial risk to prisoners.\nI am seeking urgent explanations and assurances that the necessary action will be taken to reopen the prison as soon as possible. When I visited last year, I found a well-run prison and a dedicated staff. It makes no sense at all for this prison to be closed without the most compelling reasons and it is vital for the staff and their families that the uncertainty is removed soon.\"",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_events_feed/content_8.html": null,
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_westminster-trips/content_13.html": "Free guided tours of Parliament are available to constituents. The walking tour of the Palace of Westminster includes -\n- Westminster Hall, the ancient hall at the heart of the Palace where Parliament first sat and where many historic events have taken place\n- The House of Commons, including the Speaker's Chair and the famous green benches and the 'lobbies' where MPs actually vote\n- The House of Lords, including the Royal Throne\n- The Queen's Robing Room, Royal Gallery and many other fascinating parts of the Palace of Westminster\nPlease note that tours are very popular and places are limited so generally have to be booked about six months in advance.\nPlease contact us to enquire about a visit to Westminster.",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_cdn-cgi_l_email-protection/content_22.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_parliament/content_10.html": "Tweet Here you can find the latest that Sir Geoffrey has been up to in Parliament (provided by theyworkforyou):\nPost Boxes: Housing Estates | Department for Business and Trade | Written Answers To ask the Secretary of State for Business and Trade, whether his Department has considered providing access to post boxes in new housing de\nHospitals: Torridge and Tavistock | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, with reference to his oral statement of 20 January 2025 on New Hospital Programme\nNorth Devon Hospital | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what assessment his Department has made of the potential impact of the new timetab\nNorth Devon Hospital | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, what steps he plans to take to ensure the provision of (a) safe and (b) effective\nNorth Devon Hospital | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, with reference to his oral statement of 20 January 2025 on New Hospital Programme\nRailways: Plymouth | Department for Transport | Written Answers To ask the Secretary of State for Transport, what she has recently consulted with relevant stakeholders on the future of the Tavistock to Pl\nRailways: Plymouth | Department for Transport | Written Answers To ask the Secretary of State for Transport, if she will make it her policy to provide one per cent of the funding required for the Tavistoc\nRailways: Plymouth | Department for Transport | Written Answers To ask the Secretary of State for Transport, when her Department plans to conclude the review of the Tavistock to Plymouth railway project.\nInheritance Tax Relief: Farms - [Sir Edward Leigh in the Chair] | Westminster Hall debates This is a flagrant reversal of the promises that were made.\nListed Places of Worship Scheme - [Matt Western in the Chair] | Westminster Hall debates It would be an act of cultural, social and spiritual mutilation not to continue with this scheme, which is why I do not think that the Minis",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_privacy/content_7.html": "This document outlines how Sir Geoffrey Cox KC, Member of Parliament for Torridge and Tavistock processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Sir Geoffrey Cox KC, Member of Parliament for Torridge and Tavistock\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Sir Geoffrey Cox KC, Member of Parliament for Torridge and Tavistock.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Sir Geoffrey Cox KC, Member of Parliament for Torridge and Tavistock, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Sir Geoffrey Cox KC, Member of Parliament for Torridge and Tavistock via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news_category_Articles/content_19.html": "A Statement from The Rt Hon Sir Geoffrey Cox KC MP 9th September 2022 “Our local communities in Torridge and West Devon, as the whole of our nation, will be deeply moved and saddened by the death of Her Majesty, the Queen. She was... Articles\nGeoffrey welcomes campaign to boost take-up of pension credit in Torridge and West Devon 16th May 2022 Geoffrey has welcomed a new Conservative campaign to boost the take-up of Pension Credit in Torridge and West Devon as part of wider support with the cost of... Articles\nGeoffrey speaks in support of local farmers 3rd March 2022 On 23 February 2022, Geoffrey held a Westminster Hall debate on Food and Farming in Devon and Cornwall. Geoffrey said: “I supported the departure of this... Articles\nGeoffrey calls for urgent action on pig farms 14th October 2021 Geoffrey is calling for urgent action to deal with the crisis on pig farms across the country. He has been contacted by pig farmers in Devon who are unable to... Articles\nGeoffrey supports local bid to Government’s new Levelling Up Fund 7th June 2021 Geoffrey attended a site visit and meeting on Friday, 4 June 2021, in Bideford, ahead of Torridge District Council’s bid to the Government’s £4.8 billion... Articles",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news_feed/content_6.html": null,
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news_category_Newsletters/content_14.html": "My Quarterly E-Newsletter 5th April 2024 Good afternoon! Another warm welcome to my regular e-newsletter where you can read what I have been doing as your local Member of Parliament for Torridge and... Newsletters",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news/content_12.html": "SIr Geoffrey Cox today spoke in the Westminster Hall Debate about Listed Places of Worship Wednesday, 22 January, 2025 Sir Geoffrey Cox today attended and spoke in the Westminster Hall Debate, brought forward by Bradley Thomas, regarding the Listed Places of Worship Grant Scheme. This scheme provides grants that cover the VAT on repairs over £1000 for listed places of worship, and is currently funded until March 2025. Within his speech Sir Geoffrey raised concerns about the sustainability local parish churches and... Speeches in Parliament\nSir Geoffrey keeps up the tradition with a Christmas reading for Chopper's Political Podcast. 25th December 2024 This Christmas Sir Geoffrey read Sir John Betjeman's \"Christmas\" and Robert Frost's \"Stopping by Woods on a Snowy Evening\", said to be Jack Kennedy's favourite... Speeches\nSir Geoffrey Cox visits Bishop of Exeter and Parishioners on the day before Christmas Eve. 23rd December 2024 Sir Geoffrey met with the Bishop of Exeter and local parishioners to discuss the future of Petrockstowe Church. Sir Geoffrey was pleased to meet with the Right... Local News\nSir Geoffrey Cox meets with Devon Farmers at the NFU Mass Lobby 19th November 2024 Today, Sir Geoffrey met with farmers from across Devon along with tens of thousands from every corner of Rural Britain to explain with discipline and dignity to... Westminster News\nSir Geoffrey Cox is pleased that X-ray services are available at Tavistock Hospital once again 12th August 2024 Following a period of disruption, the NHS University Hospitals Plymouth Trust has announced that an interim X-ray service will be operational by early August... Local News\nSir Geoffrey secures assurance on Appledore Shipyard from DBT 24th July 2024 July 24, 2024 Sir Geoffrey met with the Minister of State for Business and Trade, Sarah Jones MP, to seek reassurances that the new Government will continue... Westminster News\nSir Geoffrey seeks assurances from the new government on the future of HMP Dartmoor 22nd July 2024 22/07/2024 Sir Geoffrey has sought assurances from the new Labour Government that it will keep Dartmoor Prison open and that it has a long-term future under... Westminster News\nSir Geoffrey Cox standing again in Torridge and Tavistock 30th May 2024 The Torridge and Tavistock constituency's Conservative candidate, Sir Geoffrey Cox, has officially confirmed he is standing again in the coming general election... Local News\nMy Quarterly E-Newsletter 5th April 2024 Good afternoon! Another warm welcome to my regular e-newsletter where you can read what I have been doing as your local Member of Parliament for Torridge and... Newsletters\nWriting in the Telegraph, Sir Geoffrey argues the Speaker \"altered the procedures and made a mockery of the Parliament and the people he serves.\" 22nd February 2024 By Sir Geoffrey Cox By deciding that Labour should be able to present its amendment, and that its amendment should be voted upon first, Labour was allowed to... Westminster News",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_school-visits/content_18.html": "Every year, MPs welcome hundreds of schoolchildren to Parliament and I am always tries to meet visitors from the constituency to talk about the politics and history of Westminster, the work of an MP and about local issues.\nIf you would like to book a tour of the Palace of Westminster, please contact my office.\nTours can be booked for groups of 20 people and repeated tours from the same school are acceptable. Unfortunately, I cannot meet travel costs.\nFor more details, such as the best times to arrange a tour of Parliament, please visit www.parliament.uk/visiting/visiting-and-tours/ukvisitors . Please be aware that tours do need to be booked months in advance.\nThere are also free educational visits which, in addition to a tour of the Palace, offer children and students the chance to learn more about Parliament through interactive workshops. There is also a travel subsidy available to state schools which could cover up to 75% of your travel costs.\nAll bookings are made by phone, one school term in advance, on a given date. To make a booking for an educational visit, please visit www.parliament.uk/education/visiting-parliament .",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_news_government-fund-new-tavistock-plymouth-rail-link/content_21.html": "I am delighted that the Prime Minister has announced the Government has approved the reopening of the Tavistock to Plymouth Railway line with a new station to be built in Tavistock.\nThis project has been developed over many years, with discussions starting in 2005 and West Devon Borough Council (WDBC) giving its support for a new Railway Station in Tavistock to serve a reopened line in its Core Strategy of 2011. In July 2014, Devon County Council’s (DCC) Cabinet Committee approved the scheme to be taken through the development consent process and to develop a network of trails linking Tavistock to the Tamar Trails Centre. In 2019, I strongly supported the inclusion in the Conservative Manifesto of the pledge to set up a fund for reopening some branch lines closed in the 1960s after the Beeching Report. In January 2020, the Government announced the creation of a £500 million “Restoring Your Railway” Fund for that purpose.\nThis has been a long-held ambition for which many of us have fought for many years. My thanks to all those who have helped in this fight. This news follows the reopening of the Dartmoor Line, closed in 1968, represents £40.5 million of government funding and the construction of a new Railway station and transport hub at Okehampton, £13.4 million. The investment is the result of our winning Levelling Up bid. It will revolutionise transport communications in and for West Devon and the benefits to our communities will be huge.\nIn October 2021, we persuaded the Chancellor to grant £50,000 to help prepare the Strategic Business Case for the Secretary of State, which was submitted to him in December 2022. Throughout all this time, we have had to keep up a constant and determined dialogue with the Government to press the case for this link as well as the reopening of the Dartmoor Line from Okehampton to Exeter. Since December last year, while we have awaited the verdict, I have maintained close contact with transport ministers, and it is a source of great satisfaction on behalf of all those who have worked so hard for this outcome, that the minister confirmed to me the Government will finance the reinstatement of this line.\nThe Minister’s letter to me and that of the CEO of WDBC can be found above. I am deeply grateful to all those who have helped in the campaign to get this decision over the line, including the Peninsula Rail Group, DCC and WDBC under successive leaders, who had the foresight in 2011 to begin to plan for it. I shall be meeting Network Rail as soon as possible to discuss the next stages of the project.\nMy father used to recall travelling to school by train to Tavistock during the war, so I am delighted that trains will run once again to our town for the first time since 1968!",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_cookies/content_2.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_geoffreycox_co_uk_/https_www_geoffreycox_co_uk_accessibility/content_5.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S"
}