{
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot_contact/content_5.html": "Kirsten Oswald SNP candidate for East Renfrewshire\nEmail: kirsten4eastren@gmail.com\nHome\nNews\nContact\nMore\nGet in touch:\nkirsten4eastren@gmail.com",
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot_post_sky-news-appearance/content_7.html": "Sky News appearanceKirstenMay 28, 20241 min readIf you elect an SNP MP you’ll always get someone who is focussed on putting the interests of all our communities in Scotland first.On 4th July, vote SNP in East Renfrewshire.",
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot/content_1.html": "top of page\nI am not currently an MP, as Parliament has been dissolved until after the General Election.\n441971314_854196163186048_4695633963448979869_n\n441505602_854196296519368_4816827514285851719_n\n441971314_854196163186048_4695633963448979869_n\n1/7\nKeep up to date with Kirsten on Facebook and Instagram:\nbottom of page",
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot_post_canvassing-in-eaglesham-1/content_8.html": "Canvassing in EagleshamKirstenMay 29, 20241 min readBig thanks to everyone we spoke to in Eaglesham this evening. Grateful for the positive conversations on the doors. On 4th July, vote Scottish National Party (SNP) in East Renfrewshire.",
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot_post_visit-to-eaglesham/content_4.html": "Visit to Eaglesham\n- Kirsten\n- May 28, 2024\n- 1 min read\nRainy in Eaglesham, today, but great conversations with local residents. Thanks very much to those I’ve spoken to and I’ll be back out in Eaglesham later. Sorry the sound quality is not the best - blame the weather!",
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot_news/content_2.html": "top of page\nCanvassing in Eaglesham\nBig thanks to everyone we spoke to in Eaglesham this evening. Grateful for the positive conversations on the doors. On 4th July, vote...\nKirsten\nMay 29, 20241 min read\nScotland didn't vote for Brexit\nThe Tories refused to consider Scottish Government proposals set out in \"Scotland's Place in Europe\" The UK parties simply don't want to...\nKirsten\nMay 29, 20241 min read\nBeautiful in Busby\nGreat to be out in Busby knocking on doors. Fantastic to get such a positive response. Big thanks to those we spoke to. On 4th July, vote...\nKirsten\nMay 29, 20241 min read\nSky News appearance\nIf you elect an SNP MP you’ll always get someone who is focussed on putting the interests of all our communities in Scotland first. On...\nKirsten\nMay 28, 20241 min read\nVisit to Eaglesham\nRainy in Eaglesham, today, but great conversations with local residents. Thanks very much to those I’ve spoken to and I’ll be back out in...\nKirsten\nMay 28, 20241 min read\nEDMs in the mail\nBig batch of Early Day Motions into the mail this morning, celebrating the achievements of Jewish Care Scotland, Busby Lawn Tennis Club,...\nKirsten\nMay 27, 20241 min read\nbottom of page",
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot_post_beautiful-in-busby/content_9.html": "Beautiful in BusbyKirstenMay 29, 20241 min readGreat to be out in Busby knocking on doors. Fantastic to get such a positive response. Big thanks to those we spoke to.On 4th July, vote SNP.",
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot_post_scotland-didn-t-vote-for-brexit/content_3.html": "Scotland didn't vote for Brexit\n- Kirsten\n- May 29, 2024\n- 1 min read\nThe Tories refused to consider Scottish Government proposals set out in \"Scotland's Place in Europe\"\nThe UK parties simply don't want to talk about how damaging Brexit is\nScotland's best future is independence in Europe\nOn 4th July, #voteSNP",
  "https_www_kirstenoswaldmp_scot/https_www_kirstenoswaldmp_scot_post_edms-in-the-mail/content_6.html": "EDMs in the mail\n- Kirsten\n- May 27, 2024\n- 1 min read\nBig batch of Early Day Motions into the mail this morning, celebrating the achievements of Jewish Care Scotland, Busby Lawn Tennis Club, Phoenix Flames Cheerleaders, 205th Glasgow - Eaglesham - Boys' Brigade Company, and Dunterlie Foodshare."
}