{
  "https_satvirkaur_info_/https_satvirkaur_info_mp-volunteers-at-southamptons-toy-appeal/content_61.html": "The Christmas Toy Appeal, which is run by Southampton City Council and volunteers, is now in its 36th year, and I had the absolute pleasure of spending a morning helping out.\nThe annual drive for toy donations is now well under way and donations have poured in from across Southampton. But when the Toy Appeal is providing gifts for more than 7,000 young people all over the city, there is always a need for more.\nThe volunteers are led by Colin McPherson, a social worker with Southampton City Council. Colin has run the Toy Appeal for more than twenty years, and his dedication to helping and supporting young people has been unwavering. There are so many children who wake up on Christmas Day with a present to open and that’s because of him, and everyone who volunteers and donates.\nThere’s still time to give, and the appeal is especially looking for gifts for older children and teenagers. Remember, new toys only please! All the toys and gifts are for children or young people whose families are struggling this Christmas, including over 200 families currently living in temporary accommodation. Gifts can be donated at a selection of drop-off points across the city, including West Quay and our city’s libraries.\nPlease donate if you can, it makes an enormous difference to these youngsters, as a gift from the toy appeal might be the only present they get this year. Every year people give so generously, and it’s this sort of unbeatable community spirit that makes me so proud to be from Southampton.\nHead to Support the Southampton Toy Appeal for more info. Donations are being accepted until the 20th of December.",
  "https_satvirkaur_info_/https_satvirkaur_info_satvir-labour-list-biden/content_102.html": "Categories Press Satvir on Labour List: On Biden’s inauguration Post author By Satvir Post date 20/01/2022 No Comments on Satvir on Labour List: On Biden’s inauguration Read my Labour List piece on Biden’s inauguration here. ← Satvir on Labour List: On the housing record of Labour councils → My work on Housing Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment.",
  "https_satvirkaur_info_/https_satvirkaur_info_values/content_5.html": "My politics have been shaped by my upbringing, my family, and my life experiences.\nI have a strong belief in people, communities and our potential.\nWhile the world we live in is not equal, we all should work together to make it fairer. In my experience, ‘equal opportunities’ doesn’t always mean equal access to those opportunities, and as such I am a firm believer that when you lift our poorest and most vulnerable out of poverty, it lifts and benefits everyone in society.\nJust like my parents did for me, I think we all want and should work to provide a better life and planet for our children and the next generation.\nSouthampton and its people have given me so much, and I feel honoured to be in a position, first in local government and now as the parliamentary candidate, to give something back. It’s why I work tirelessly to create a place where we can all enjoy living, working, and raising our children. A city recognised, admired and respected nationally and internationally with as bright a future as it has a proud past.\nTo make this a reality, we need a national and local long-term vision for Southampton and the UK.\n- Economically it means prioritising long-term investment in education, skills and infrastructure to keep us better connected. It means supporting future sectors, while focusing on a green and sustainable future.\n- Politically it means working with communities rather than just for communities. For too long we have had top-down and quick-fix politics, rather than a politics that truly listens to our communities and considers the way we make decisions.\n- Socially it means real, sustained action to deal with long-standing social issues such as health inequalities, mental illness, and the housing crisis, while at the same time creating the dynamic, innovative and connected communities we need for the future.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_no-limits/content_27.html": "I am so pleased to share news that No Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_lloyds-shirley/content_34.html": "I would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.",
  "https_satvirkaur_info_/https_satvirkaur_info_author_sk99_74s/content_12.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.\nAs the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nI would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.\nI am so pleased to share news thatNo Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.\nHaving heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.\nLabour is delivering on our promise to roll out free breakfast clubs to all primary school children, starting with 750 early adopter schools beginning in April this year.\nDetails of early adopter schools were announced earlier his week and I am absolutely delighted that a school in Southampton Test will be taking part in the first wave.\nA massive congratulations to Bevois Town Primary on their successful application!\nThe government has chosen Bevois Town as one of the first to offer free, daily breakfast clubs as part of our landmark scheme that will ensure children are school-ready and parents are better off.\nWith growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\n2881fa4f-7a94-4236-97d5-81af02f0b991\nd86b1d52-1d7f-479a-a0d6-f76526dd935f\n126894b4-26c6-449c-bf75-f374745a4f45\nc14f20c5-6979-4c24-973c-abc43d6c6b00\ndd96b18b-14fa-46d7-a160-4fc9e0bb827e\n4e5937d3-76ea-449b-9dc2-4c1b1575957c\n6a07d194-9a59-41bf-b182-435b64cc5e9e\n3ebcd818-e37e-43ff-83e2-60d996474c91\n94d671eb-7735-4312-9b19-fc0949794af4\n235c2720-0577-47c6-93e7-767419a9069b\n464ec279-44cb-4172-a84b-1f3e2f92198d\ndda9913f-80a7-4db6-a314-4a64a2341a67\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nThe Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.\nI was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.\nA new year brings new change, and there’s a big one on the horizon- devolution. It’s something that has been spoken about for more than a decade but never delivered within our region. I’m pleased that under this new Labour Government, it could finally become a reality. Everyone talks about Southampton’s huge potential, and this will offer a really exciting opportunity to help deliver it. It’s why I’ve been backing this throughout, both when I was in local government and now in Westminster, speaking to Ministers about how Southampton can benefit from it. In a nutshell it means more powers and more money for our city and region.\nI believe that more decisions about our area should be made more locally, by communities that they will impact, rather than always coming from Whitehall, which can often have a top down, one size fits all approach. This government believes that local people, whether you live or work here, better understand the unique challenges and aspirations of our communities.\nThis will be the biggest local government reorganisation in a generation, and local councils in the Solent region, including Southampton, have now submitted a formal request to be included in the Government’s Devolution Priority Programme. This is now being reviewed, and we will hopefully have further updates soon.",
  "https_satvirkaur_info_/https_satvirkaur_info_campaign-lloyds-shirley/content_54.html": "I am deeply concerned by the news that Lloyds Bank plans to close their Shirley Southampton branch in early 2025.\nI have written to the the Chief Executive of Lloyds to share my concerns and have launched a petition in opposition to the closure.\nI have written to the the Chief Executive of Lloyds to share my concerns and have launched a petition in opposition to the closure.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_charity/content_25.html": "The Christmas Toy Appeal, which is run by Southampton City Council and volunteers, is now in its 36th year, and I had the absolute pleasure of spending a morning helping out.\nThe annual drive for toy donations is now well under way and donations have poured in from across Southampton. But when the Toy Appeal is providing gifts for more than 7,000 young people all over the city, there is always a need for more.\nThe volunteers are led by Colin McPherson, a social worker with Southampton City Council. Colin has run the Toy Appeal for more than twenty years, and his dedication to helping and supporting young people has been unwavering. There are so many children who wake up on Christmas Day with a present to open and that’s because of him, and everyone who volunteers and donates.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_sinclair-primary/content_46.html": "As the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nThat’s why I was absolutely delighted to hear about the fantastic achievements of pupils from the Learning Federation Partnership of Schools in the recent National Reading Champions Quiz.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_andrew-gwynne/content_78.html": "I was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_childrens-wellbeing-and-schools-bill/content_76.html": "Labour is delivering on our promise to roll out free breakfast clubs to all primary school children, starting with 750 early adopter schools beginning in April this year.\nDetails of early adopter schools were announced earlier his week and I am absolutely delighted that a school in Southampton Test will be taking part in the first wave.\nA massive congratulations to Bevois Town Primary on their successful application!\nThe government has chosen Bevois Town as one of the first to offer free, daily breakfast clubs as part of our landmark scheme that will ensure children are school-ready and parents are better off.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_mental-health/content_29.html": "I am so pleased to share news that No Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.",
  "https_satvirkaur_info_/https_satvirkaur_info_category_news/content_6.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_public-health-grant/content_8.html": "The Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_funding-boost/content_15.html": "I am so pleased to share news that No Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.",
  "https_satvirkaur_info_/https_satvirkaur_info_general-election-4-july/content_91.html": "For many people I speak to, the General Election announcement on Wednesday was something they were desperately waiting for.\nI’m Southampton born and bred, and it’s been heartbreaking to see families I know struggling after 14 years of Conservative chaos and failure. Britain is broken and Southampton deserves better.\nLabour are offering a real alternative with a costed plan, but change is only possible if people vote for it. This will be a once in a generation General Election, and Labour are the only Party that can beat the Tories. Every vote matters, so let’s not waste it.\nI’ll be working hard and spending all my time now until Thursday 4th July putting Labour’s case to the people of Southampton Test.\nLet’s get Britain’s future back!",
  "https_satvirkaur_info_/https_satvirkaur_info_satvir-kaur-mp-local-heroes-spitfire/content_95.html": "Satvir Kaur, Member of Parliament for Southampton Test, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War, and looking to find the living relatives of these local war heroes.\nThe PRU, which was tasked to provide up-to-date intelligence to strategically plan the Allied actions in the war, was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London. Among those who served, and died, in the PRU were Southampton born Leonard Grieb and John Merrifield.\nFlying Spitfires and Mosquitos, the intelligence the unit gathered was used by all the armed forces, giving same day intelligence on enemy activity. John Merifield, born while living on Hill Lane, is recognised as one of the finest Mosquito and PRU pilots in the Second World War having carried out 160 operational sorties and was the man responsible for discovering the German secret weapon plant at Peenemunde.\nFlight Sergeant Leonard Charles Grieb was born in Southampton in 1922 and lived on St. James Road in Shirley. Joining the RAF in 1940 he trained as a navigator and joined 140 Photographic Reconnaissance Squadron flying Wellington aircraft. In 1943 he married local girl Vera Rosinthal in Southampton before returning to his unit which was then posted to the continent following D-Day.\nThe intelligence provided by the PRU was used in the Cabinet War Rooms – now the ‘Churchill War Rooms’ located underneath the Treasury – and was instrumental in the planning of major operations; D-Day and the Dambusters Raid.\nDue to the clandestine nature of their operations – they flew solo operations, unarmed and unarmored – the death rate was nearly fifty percent. However, despite having one of the lowest survival rates of the war – life expectancy in the PRU was around two and a half months – there is no national memorial to the PRU.\nSupporting the campaign for a national memorial is the Member of Parliament for Southampton Test, Satvir Kaur. She said: “I am delighted to support this fantastic campaign to commemorate those who served in the Photographic Reconnaissance Units. There is no national memorial to the PRU, and we want the integral work they did to be recognised at a national level.\n“This includes Southampton’s Leonard Grieb and John Merifield, who served admirably under exceptionally difficult conditions, with both tragically losing their lives while serving their country.\n“I look forward to working with the Spitfire AA810 Project to establish this memorial and I look forward to being able to pay my respects there once it is completed.”\nIf there is anyone related to Leonard Grieb or John Merifield, or if anyone know someone who served in the PRU during the war, please go the Spitfire AA810 Project website (www.spitfireaa810.co.uk), or get in touch with Tony Hoskins, Tony@spitfireaa810.co.uk.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_national-literacy-trust/content_77.html": "As the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nThat’s why I was absolutely delighted to hear about the fantastic achievements of pupils from the Learning Federation Partnership of Schools in the recent National Reading Champions Quiz.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_rmg/content_37.html": "Having heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_assisted-dying/content_100.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_parliamentary-candidate/content_109.html": "I am hugely grateful to Labour members in Southampton Test for selecting me to be their next Parliamentary Candidate, standing in place of Alan Whitehead when he retires as our MP at the next general election. I know I have big shoes to fill.\nIt was wonderful to get the opportunity to meet with so many old and new faces at the selection whilst setting out my stall, and I am honoured that the members’ decision went in my favour. I can’t wait to work with everyone during the campaign and beyond.\nNow that I have been selected as your candidate, the real work begins. The first priority for us in Test has to be retaining the seat after Alan Whitehead stands down. Following that, members have my commitment that I will work tirelessly and with integrity to represent our city and progressive policies in Parliament, just as Alan has. I will do it with my own personal passion and energy.\nI have always believed we are stronger together and would love to hear from you as a local member about what matters most to you. Please get in touch.",
  "https_satvirkaur_info_/https_satvirkaur_info_we-did-it/content_4.html": "WE DID IT! I am delighted that Labour took back control of Southampton City Council at the local elections in May 2022 and I can’t wait to get to work as your new Leader.\nWe are eager and ready to start delivering for all our communities and I personally want to say a huge thank you for everyone’s support.\nOver the last 12 months, we refocused our campaign and set out a new vision for Southampton. We spoke to over 30,000 voters and listened to their concerns.\nA New Vision For Southampton\nLabour will ensure that every pound the council spends works for you, making Southampton and its neighbourhoods places to be proud of, where individuals and families can grow and prosper in a safer, greener and more affordable city.\nWe won’t waste public money on fixing private roads, but will invest in our communities with cleaner streets, improved pavements and greater enforcement on dangerous parking and fly-tipping. We will restore the investment into our district centres which the Tories slashed, ensuring no neighbourhood is left behind.\nEveryone deserves to feel safe in their home and local area and Labour’s £1.5m Safer Neighbourhoods Fund will help communities feel safer, prevent crime and tackle anti-social behaviour.\nLabour takes the climate crisis seriously, and we will invest in our green spaces, improve recycling and make our homes more energy efficient to keep bills low.\nAbove all we know the cost of living crisis affects everyone, and one-off loans won’t touch the sides. Labour will build more desperately needed council homes, make Southampton a Living Wage City and focus on local jobs and training for young people. We want better travel options, and will make public transport cheaper and more accessible, particularly for families, with a new family travel card.\nThanks to you\nListening to you throughout the year has helped shape our New Vision for Southampton.\nAs the new Labour Leader of the council I look forward to working with you all to deliver the change we have been fighting so hard for.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_national-reading-champions-quiz/content_18.html": "As the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nThat’s why I was absolutely delighted to hear about the fantastic achievements of pupils from the Learning Federation Partnership of Schools in the recent National Reading Champions Quiz.",
  "https_satvirkaur_info_/https_satvirkaur_info_reading-champions-quiz-southampton/content_50.html": "As the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nThat’s why I was absolutely delighted to hear about the fantastic achievements of pupils from the Learning Federation Partnership of Schools in the recent National Reading Champions Quiz.\nHosted by the National Literacy Trust, this exciting competition brought together schools from across the South East, including Surrey, Kent, and Sussex, to put their literary knowledge to the test. The event was a true celebration of reading, with Year 5 and Year 6 pupils showcasing their passion for children’s literature through quick-fire questions, anagram challenges, and true/false rounds. What made this even more impressive was that many of the competing schools were secondary level – yet our brilliant primary school pupils held their own and did Southampton proud!\nI am thrilled to share the incredible results achieved by our local Test schools:\n- Holy Family Catholic Primary School – 13th place\n- Mansel Park Primary & Nursery School – 19th place\n- Sinclair Primary & Nursery School – 26th place\nA special mention must go to Mansel Park Primary & Nursery School, who were awarded the Participation Award for their outstanding sportsmanship and team spirit. This recognition highlights their commitment to values such as positivity, determination, resilience, and perseverance – qualities that will serve them well both inside and outside the classroom.\nThe dedication of pupils, teachers, and school leaders to fostering a love of reading is truly inspiring. As a former governor and Chair of Governors of local schools, I know how much effort goes into nurturing children’s learning. As Executive Headteacher & Co-Headteacher of Mansel Park, Gerida Montague and Paul Lodge, so perfectly put it:\n“Participating in the National Reading Champions Quiz was an incredible experience for our pupils. We are immensely proud of their hard work, enthusiasm, and the sportsmanship they displayed. This award reflects not only their dedication but also the strong values we promote at Mansel Park. Reading is a vital skill, and seeing our students engage with literature so passionately is truly rewarding. We are also grateful to the National Literacy Trust for organising such a fantastic event that inspires a love of reading among young learners.”\nI couldn’t agree more. Reading is a gateway to opportunity – it expands minds, fuels creativity, and builds confidence. Seeing our young people take on challenges like this with such enthusiasm makes me incredibly proud. I will always champion opportunities that inspire children to dream big and achieve their full potential.\nI’m also pleased that this Government implemented a range of measures to support reading for pleasure. The English Hubs programme supports the teaching of phonics, early language development and reading for pleasure, with a further £23 million committed for the 2024/25 academic year to support this work. Southampton Test’s nearest English Hub is Springhill English Hub. Further information on Springhill English Hub can be found here.\nIt’s also great that more widely Labour has invested £2.3bn in our education system, and is rolling out free breakfast clubs in all primary schools, to ensure that all children come to school ready to learn. All of these measures will make sure children of all backgrounds have the best possible start in life.\nCongratulations once again to all the pupils, teachers, and schools who took part – Southampton is so proud of you!",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_petition/content_32.html": "I would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.",
  "https_satvirkaur_info_/https_satvirkaur_info_satvir-labour-list-housing/content_74.html": "Click here to read my Labour List piece on how Labour councils are setting an example for government with their record on housing.\nCategories\nClick here to read my Labour List piece on how Labour councils are setting an example for government with their record on housing.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_spitfire-aa810-project/content_45.html": "Satvir Kaur, Member of Parliament for Southampton Test, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War, and looking to find the living relatives of these local war heroes.\nThe PRU, which was tasked to provide up-to-date intelligence to strategically plan the Allied actions in the war, was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London. Among those who served, and died, in the PRU were Southampton born Leonard Grieb and John Merrifield.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_free-breakfast-club/content_10.html": "Labour is delivering on our promise to roll out free breakfast clubs to all primary school children, starting with 750 early adopter schools beginning in April this year.\nDetails of early adopter schools were announced earlier his week and I am absolutely delighted that a school in Southampton Test will be taking part in the first wave.\nA massive congratulations to Bevois Town Primary on their successful application!\nThe government has chosen Bevois Town as one of the first to offer free, daily breakfast clubs as part of our landmark scheme that will ensure children are school-ready and parents are better off.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_southampton-solent-university/content_72.html": "Last week I had the honour of organising a dinner to celebrate my predecessor Dr Alan Whitehead. Alan first came into my life when I was 18, and it all started with a birthday card. I received the card from my local MP, which not only wished me a happy birthday, but reminded me that I was old enough to vote.\nCategories",
  "https_satvirkaur_info_/https_satvirkaur_info_news_page_3/content_80.html": "Southampton is my home. It’s where I was born, grew up, and have always lived. It is heartbreaking to see families I know struggling under the Conservatives.\nI am standing to be the next MP for Southampton Test because we can’t go on like this. If we want meaningful change, we need a change of government, and we need that new government to be Labour.\nVote Labour on Thursday 4th July.\nSpecial thanks to Southampton film company City Eye for producing this film for me.",
  "https_satvirkaur_info_/https_satvirkaur_info_celebrating-alan-whitehead/content_96.html": "Last week I had the honour of organising a dinner to celebrate my predecessor Dr Alan Whitehead. Alan first came into my life when I was 18, and it all started with a birthday card. I received the card from my local MP, which not only wished me a happy birthday, but reminded me that I was old enough to vote.\nIt was a wonderful evening where politicians past and present, along with many key stakeholders from the city, came together to thank Alan for his whopping 27 years of service as an MP and to celebrate his nearly 40 years of public service in Southampton.\nAlan’s journey began in 1980 when he became a city councillor, later becoming leader of the council when Labour took control in 1984. He held this position until 1992. Elected to Parliament in 1997, Alan played a crucial role in steering the Climate Change Bill through the Commons and served on several committees, including the Standards and Privileges Select Committee. He was also the chairman of the All-Party Parliamentary Group on Poland. A true pioneer, Alan was an early advocate for renewable energy, even becoming the first MP to install a wind turbine on his constituency home in Highfield.\nAlan’s work in the energy sector was recognised throughout the evening, with many congratulating him for his promotion of green initiatives. He served as Shadow Minister for Energy Security from 2015 to 2024 and held various government roles, including Parliamentary Under Secretary of State for Transport, Local Government, and Regions from 2001 to 2002.\nHowever, it was here in Southampton Test where Alan’s impact was most deeply felt. His grassroots campaigning and the constant support he gave to his constituents made him a much liked, and respected MP.\nA dedicated Saints fan, Alan expressed his gratitude to everyone who came out to support him, saying: “I’m touched by everyone’s kind words. I am proud to have been able to represent the people of Southampton in Parliament for all this time, and I’m profoundly grateful for all the support they have given me to do the job.”\nIn January 2023, Alan announced he would stand down, saying: “I have been your MP for some 23 years now, and between us we have managed to hold Southampton Test as a red beacon for Labour in seven elections over those years.”\nAlan Whitehead is a legend! He has always championed Southampton, and his love for this great city and its people has always been truly inspiring. He has said that serving the people of the city was the honour of his life, and that happy honour is now mine, I’ve got big shoes to fill. I also want to personally say thank you to him for his guidance and unwavering support over the years.",
  "https_satvirkaur_info_/https_satvirkaur_info_category_press/content_56.html": "Satvir Kaur, Member of Parliament for Southampton Test, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War, and looking to find the living relatives of these local war heroes.\nThe PRU, which was tasked to provide up-to-date intelligence to strategically plan the Allied actions in the war, was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London. Among those who served, and died, in the PRU were Southampton born Leonard Grieb and John Merrifield.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_letter/content_70.html": "Having heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_wwii/content_48.html": "Satvir Kaur, Member of Parliament for Southampton Test, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War, and looking to find the living relatives of these local war heroes.\nThe PRU, which was tasked to provide up-to-date intelligence to strategically plan the Allied actions in the war, was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London. Among those who served, and died, in the PRU were Southampton born Leonard Grieb and John Merrifield.",
  "https_satvirkaur_info_/https_satvirkaur_info_author_sk99_74s_page_3/content_57.html": "Southampton is my home. It’s where I was born, grew up, and have always lived. It is heartbreaking to see families I know struggling under the Conservatives.\nI am standing to be the next MP for Southampton Test because we can’t go on like this. If we want meaningful change, we need a change of government, and we need that new government to be Labour.\nVote Labour on Thursday 4th July.\nSpecial thanks to Southampton film company City Eye for producing this film for me.",
  "https_satvirkaur_info_/https_satvirkaur_info_southampton-renaissance-prospectus-launch/content_67.html": "With growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nDiscover the Prospectus for Change here: southamptonrenaissance.com",
  "https_satvirkaur_info_/https_satvirkaur_info_category_info_page_2/content_108.html": "Southampton is my home. It’s where I was born, grew up, and have always lived. It is heartbreaking to see families I know struggling under the Conservatives.\nI am standing to be the next MP for Southampton Test because we can’t go on like this. If we want meaningful change, we need a change of government, and we need that new government to be Labour.\nVote Labour on Thursday 4th July.\nSpecial thanks to Southampton film company City Eye for producing this film for me.",
  "https_satvirkaur_info_/https_satvirkaur_info_news_page_4/content_49.html": "Read my Labour List piece on Biden’s inauguration here.\nClick here to read my Labour List piece on how Labour councils are setting an example for government with their record on housing.\nRead my Labour List piece on Biden’s inauguration here.\nClick here to read my Labour List piece on how Labour councils are setting an example for government with their record on housing.",
  "https_satvirkaur_info_/https_satvirkaur_info_bevois-town-breakfast-club/content_11.html": "Labour is delivering on our promise to roll out free breakfast clubs to all primary school children, starting with 750 early adopter schools beginning in April this year.\nDetails of early adopter schools were announced earlier his week and I am absolutely delighted that a school in Southampton Test will be taking part in the first wave.\nA massive congratulations to Bevois Town Primary on their successful application!\nThe government has chosen Bevois Town as one of the first to offer free, daily breakfast clubs as part of our landmark scheme that will ensure children are school-ready and parents are better off.\nAs the school is in an area of particular need, I was pleased to support their bid, writing to the Department for Education on their behalf after they told me about their application.\nLabour’s Children’s Wellbeing and Schools Bill, which I voted for last month, legislated to create these clubs and also to put a cap on the number of branded uniform items schools can require. The Bill will save some families over £500 per child, per year.\nThe breakfast club at Bevois Town is a testament to the school and the Labour government’s dedication to improving children’s attendance, attainment, wellbeing, behaviour and readiness for school.\nEvidence shows that breakfast clubs can boost children’s reading, writing, and maths attainment by an average of two months’ additional progress.\nAt the same time, the club will save local families on the cost of sending children to school while providing a valuable source of childcare for working parents at the beginning of the day.\nTaken together, Labour’s breakfast clubs will boost parents’ work choices and children’s life chances. They will also help us bear down on the levels of child poverty in Southampton, left far too high by the Conservatives.\nI am so proud to have a pioneer of this really important policy here in Test and wish Bevois Town all the very best with their new club!",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_financial-exclusion/content_40.html": "I would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.",
  "https_satvirkaur_info_/https_satvirkaur_info_canvassing-round-up/content_66.html": "Week in week out, Southampton Labour teams and I hit the doorsteps across the city and chat to residents. We call round regularly to hear people’s views, tackle problems, offer assistance, and also encourage people to get out and use their vote!\nTalking to other Southampton residents has always been one of my favourite parts of politics, ever since I first joined the Labour Party. I genuinely love going out canvassing to meet as many as possible and I find it is the best way to speak to people whose voices might otherwise go unheard.\nWhile people may not always be aware of all the latest political twists and turns, one thing we all have in common is the fact that we care about our our families, our homes, our jobs and our neighbourhoods. We care about our quality of life and, when bad political decisions start to impact these things, people want to stand up and make their voices heard.\nMore and more, this is the current state of affairs. People on the doorstep, who have previously been less interested in politics, have realised the damage that 14 years of Tory government has done to this country and they are now determined to do something about it.\nWith the cost of living crisis and every public service on its knees, there is a general feeling that we cannot go on like this and that the situation has become completely desperate. Many people feel that our future as a country now depends on getting the Tories out of office and returning Labour to government.\nIf you feel the same and want to get involved with campaigning for Labour locally, visit: volunteer.labour.org.uk/get-started",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_pru/content_106.html": "Satvir Kaur, Member of Parliament for Southampton Test, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War, and looking to find the living relatives of these local war heroes.\nThe PRU, which was tasked to provide up-to-date intelligence to strategically plan the Allied actions in the war, was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London. Among those who served, and died, in the PRU were Southampton born Leonard Grieb and John Merrifield.",
  "https_satvirkaur_info_/https_satvirkaur_info_southamptons-unwelcome-christmas-tradition/content_26.html": "It’s that time of year, and while many of us are gearing up for Christmas, this past week I’ve been busy with one of Southampton’s most unwelcome Christmas traditions! The water supply disappearing. Southern Water caused utter chaos and concern when their water supply to thousands of homes stopped due to an issue that arose while cleaning and updating the Testwood Water Supply Works in Totton.\nSouthern Water’s handling of it, has been quite frankly appalling. The lack of water stations in Southampton, the confused communication from the Southern Water team, and even when these minimal water stations were set up, there was confusion over when they opened and closed, as well as only being able to access them with a car. Once they were “up and running” they ran out of water, leaving many stranded having waited hours. Those that could not get to a water station, and particularly the vulnerable (who were meant to be on a priority list for Southern Water to hand deliver to their homes!) – were left in limbo, waiting for water they were promised, that never came or came too late. At one point there were more than 20,000 people on that list.\nMyself and my team heard the most desperate and heartbreaking stories. Single mum’s with disabled children, older people with complex medical conditions, those recently recovering from surgery with nothing to have their medication with. Schools were forced to close, leaving parents stranded, businesses lost out during their busiest time of year, and even Southampton General Hospital was affected. It simply is not good enough! I shared people’s anger and frustration – and we tried to help and support as many as we could that reached out to us. We know Southern Water’s emergency number was found wanting! So we stepped in and advocated for as many people as possible to make sure Southern Water was delivering. My team, with support from the amazing local Labour councillors and volunteers, were hand delivering water to those that Southern Water failed to get to. Huge thanks to everyone that played a role to help us reach as many as we could. Also a huge thanks to those that helped neighbours and loved ones during this time.\nTo add insult to injury, some finally received their emergency water supply after the water finally came back a couple of days later! Simply unacceptable.\nI have shared all your experiences directly with Southern Water and will be holding them to account.\nPeople are rightly upset, frustrated and have questions.\nWe have been here before, yet Southern Water’s handling of the situation was so poor! I want to make sure lessons are learned, so if this happens again, water supply delivery is simpler and easier for everyone. For example, why can’t Southern Water deliver to every household affected, getting through entire affected streets and homes much quicker and efficiently? Why was communication so poor? Unless you have social media, it was impossible to know what was going on? Southern Water needs to be held to account.\nI’ll also be pushing for people to be compensated, especially if you’re a business that has been forced to close due to Southern Water’s failure. If you wanted to find out how to do this, please get in touch with Southern Water directly, the simplest way is to call them on 0330 303 0223. If you need my support, please email me at satvir.kaur.mp@parliament.uk.\nAll this while Southern Water announced price increases, which are much higher than other suppliers. I’ll be questioning Southern Water about this too! For too long we’ve been badly let down by water companies like Southern Water, who instead of investing in our crumbling infrastructure have been paying their bosses millions. This has to stop. I’m pleased the new Labour government are finally putting an end to bosses being able to pay themselves bonuses while we all experience a shockingly poor service. It’s right that the government will be reviewing the sector, and working to transform the way our water system works. There will be tougher new measures so water companies can be held to account and simply can’t get away with what we experienced last week! The system is broken, and I’ll keep working hard to make sure it’s fit for purpose once more. People shouldn’t be paying more for a service that is failing them, we deserve more.\nIf you had any more questions or concerns about this issue or anything else, please do not hesitate to contact me on satvir.Kaur.mp@parliament.uk or call me on 02382 546 357.",
  "https_satvirkaur_info_/https_satvirkaur_info_video-intro-keir-starmer-conference/content_86.html": "At Labour conference last week, I was given the enormous honour of introducing Keir Starmer ahead of his keynote leader’s speech.\nWatch the video above to see what I had to say to delegates.\nAt Labour conference last week, I was given the enormous honour of introducing Keir Starmer ahead of his keynote leader’s speech.\nWatch the video above to see what I had to say to delegates.",
  "https_satvirkaur_info_/https_satvirkaur_info_in-parliament/content_38.html": "My record in Parliament\nFor everything you need to know about what I have been up to Parliament, including my Voting Record, Spoken Contributions, Written Questions and Registered Interests, please visit my page on Parliament.uk or click below.\nMy expenses\nThe Independent Parliamentary Standards Authority (IPSA) is the independent body that regulates and administers the business costs and decides the pay and pensions of MPs and their staff.\nThe expense and allowance claims for individual MPs are published regularly and can be viewed on the IPSA website. You can access details of my claims here or via the button below.",
  "https_satvirkaur_info_/https_satvirkaur_info_rmg-letter/content_62.html": "Having heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.\nWith changes to the Leasehold and Freehold Reform Act, I am pleased that the Labour Government is to give leaseholders more rights, including:\n- Making it easier for leaseholders to buy their freehold or extend their lease without waiting two years from purchase.\n- Homeowners will be able to take over management of their building, get more transparency on costs, and challenge unfair service charges.\nAdditionally, the government is working on a Leasehold and Commonhold Reform Bill, with measures to tackle unregulated ground rents and strengthen leaseholder rights planned. Labour have also committed to ending the feudal leasehold system once and for all.\nIf you’re a leaseholder currently struggling with your property management company please do get in contact.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_satvir-kaur_page_2/content_110.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_thank-you-lloyds-petition/content_101.html": "I would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.\nBelow are the steps I’ve taken to ensure Shirley branch users still have access to vital services.\nAdditional support we’ve secured during this transition:\n- Lloyds have assured me that every single vulnerable customer will be contacted and set up with meetings to discuss their options for alternative services.\n- In cases where necessary, Lloyds has pledged to offer additional support, including accompanying customers to the local post office.\n- An automated deposit service will be installed so bank users can still deposit cash and cash cheques. Importantly, Lloyds has confirmed that the Shirley branch will not close until these alternative provisions are in place.\n- Lloyds has introduced initiatives to assist customers with digital training. They will offer free digital training and provide a tablet device with a monthly data allowance to those who need it, provided they meet the relevant criteria.\nOnce again, thank you to all who supported the petition. While the closure is disappointing, our campaign has resulted in important commitments from Lloyds to support the community and ensure vital services are still available. The closure of the Lloyds branch in Shirley represents a growing risk of financial exclusion for these groups, I still believe in face-to-face services and the government is putting in more measures to ensure we don’t lose more branches.\nI will continue to work hard to ensure that no one is left without the services they rely on. Please do get in touch with me if you have any further queries or concerns over the closure.\nIf there is ever anything else I can do to help you, whether you have a specific issue or questions around policy please do not hesitate to contact me.\nYou can email me at satvir.kaur.mp@parliament.uk or call 02382 546 357.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_southampton-test/content_44.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.\nAs the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nI would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.\nI am so pleased to share news thatNo Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.\nLabour is delivering on our promise to roll out free breakfast clubs to all primary school children, starting with 750 early adopter schools beginning in April this year.\nDetails of early adopter schools were announced earlier his week and I am absolutely delighted that a school in Southampton Test will be taking part in the first wave.\nA massive congratulations to Bevois Town Primary on their successful application!\nThe government has chosen Bevois Town as one of the first to offer free, daily breakfast clubs as part of our landmark scheme that will ensure children are school-ready and parents are better off.\nWith growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\n2881fa4f-7a94-4236-97d5-81af02f0b991\nd86b1d52-1d7f-479a-a0d6-f76526dd935f\n126894b4-26c6-449c-bf75-f374745a4f45\nc14f20c5-6979-4c24-973c-abc43d6c6b00\ndd96b18b-14fa-46d7-a160-4fc9e0bb827e\n4e5937d3-76ea-449b-9dc2-4c1b1575957c\n6a07d194-9a59-41bf-b182-435b64cc5e9e\n3ebcd818-e37e-43ff-83e2-60d996474c91\n94d671eb-7735-4312-9b19-fc0949794af4\n235c2720-0577-47c6-93e7-767419a9069b\n464ec279-44cb-4172-a84b-1f3e2f92198d\ndda9913f-80a7-4db6-a314-4a64a2341a67\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nThe Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.\nI was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.\nA new year brings new change, and there’s a big one on the horizon- devolution. It’s something that has been spoken about for more than a decade but never delivered within our region. I’m pleased that under this new Labour Government, it could finally become a reality. Everyone talks about Southampton’s huge potential, and this will offer a really exciting opportunity to help deliver it. It’s why I’ve been backing this throughout, both when I was in local government and now in Westminster, speaking to Ministers about how Southampton can benefit from it. In a nutshell it means more powers and more money for our city and region.\nI believe that more decisions about our area should be made more locally, by communities that they will impact, rather than always coming from Whitehall, which can often have a top down, one size fits all approach. This government believes that local people, whether you live or work here, better understand the unique challenges and aspirations of our communities.\nThis will be the biggest local government reorganisation in a generation, and local councils in the Solent region, including Southampton, have now submitted a formal request to be included in the Government’s Devolution Priority Programme. This is now being reviewed, and we will hopefully have further updates soon.\nIt’s that time of year, and while many of us are gearing up for Christmas, this past week I’ve been busy with one of Southampton’s most unwelcome Christmas traditions! The water supply disappearing. Southern Water caused utter chaos and concern when their water supply to thousands of homes stopped due to an issue that arose while cleaning and updating the Testwood Water Supply Works in Totton.\nSouthern Water’s handling of it, has been quite frankly appalling. The lack of water stations in Southampton, the confused communication from the Southern Water team, and even when these minimal water stations were set up, there was confusion over when they opened and closed, as well as only being able to access them with a car. Once they were “up and running” they ran out of water, leaving many stranded having waited hours. Those that could not get to a water station, and particularly the vulnerable (who were meant to be on a priority list for Southern Water to hand deliver to their homes!) – were left in limbo, waiting for water they were promised, that never came or came too late. At one point there were more than 20,000 people on that list.",
  "https_satvirkaur_info_/https_satvirkaur_info_housing/content_87.html": "When I was the Cabinet Member for Homes and Culture, my portfolio included everything from homelessness, council and social housing, to the private rented sector in Southampton.\nHomes are more than bricks and mortar. Homes are about the people that live in them, their quality of life, and the sense of community and stability that high quality housing creates. Whether you rent or own, all homes need to be safe, secure, and affordable to live in.\nFor too long housing has been treated as a commodity, rather than a human right intrinsically linked to better life outcomes, impacting your health, employment and education. Therefore, to truly improve people’s lives, we must fix the current housing crisis which local authorities are at the front line of.\nAs a member of Labour’s National Housing Group, I promoted the good work that we were doing in Southampton, and still act to influence national policy to help bring about the change we need within the sector.\nInitiatives and projects\nThe initiatives I worked on in my cabinet role, included:\n- Tackling fuel poverty and launching the Southampton Healthy Homes programme, which works to identify and address energy efficiency in homes that are expensive to heat.\n- Building much needed quality council homes in Southampton. Began delivering on Labour’s commitment of 1000 new council homes by 2025, given to people based on need, including a focus on more supported and extra care homes to help with a growing adult social care demand. This project was stopped by the incoming Conservative council. However, if Labour were to take back control of the council, council home building will remain a top priority.\n- Reducing homelessness by using modern methods of construction to build quality temporary accommodation, while working on preventative measures so local families don’t risk becoming homeless.\n- Decent neighbourhood programmes that improve and enrich communities, giving local people an opportunity to co-design and have a stake in the future of their area.\n- Bringing derelict buildings within our neighbourhoods back into community use.\n- Introducing licensing schemes within the private rented sector to ensure all tenants are living in homes that are safe and secure, to stop tenants being victims of rogue landlords.",
  "https_satvirkaur_info_/https_satvirkaur_info_health-plan-consultation/content_20.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.\nThe event was in a packed-out room- from NHS staff, wider local healthcare professionals, and Southampton City Council’s public health team to carers, local community organisations, and individuals with lived experience. It was a powerful mix of insight, passion and purpose – all aimed at shaping the NHS 10-Year Plan with real voices from our city.\nWe were joined by Alasdair Snell, Managing Director for the Southampton and South West division at Hampshire and Isle of Wight Healthcare NHS Foundation Trust, who spoke about the need to bring both communities and staff into the planning and future delivery of care.\nHe said, “It was great to come together as a health and care community to contribute to important conversations around how we in HIOWH, alongside other healthcare organisations, primary care, our communities and partners, can bring people fully into shaping and driving forward the future of the NHS together across Southampton and wider.\n“There was a shared passion, ambition and consensus to drive forward the prevention agenda, enabling and supporting our communities to lead their healthiest and most resilient lives possible and provide care and support closer to home.”\nThe workshop focused on the three key pillars– a move towards making better use of technology, bringing care closer to communities, and putting prevention at the heart of our healthcare model. Conversations were honest, constructive and at times emotional – exactly what’s needed if we’re to make lasting change.\nIt was important to me to hear directly from those working on the frontline, as well as local residentswith real experience of the NHS – both the good and the challenging. I’ve taken away many important questions, insights, and suggestions, which I’ll be sharing with my parliamentary colleagues.\nAfter the workshop, I had the opportunity to visit the South of England Rehabilitation Centre (SERC), just a short walk away. I was hugely impressed by the state-of-the-art facilities – including two 25-bed wards over two floors, an expanded gymnasium, a beautiful accessible courtyard, and an Assisted Daily Living suite. It was heartening to see how these thoughtful design features are helping prepare patients for independent life beyond hospital. I’m so proud to have this in Southampton. We need more purpose-built facilities with patients in mind.\nI’m so pleased Southampton’s voices will be part of shaping our government plans. Thank you to everyone who got involved, who shared their stories and experiences, and suggested what more we can do together.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_10-year-plan/content_75.html": "I am so pleased to share news that No Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.",
  "https_satvirkaur_info_/https_satvirkaur_info_author_sk99_74s_page_4/content_19.html": "Read my Labour List piece on Biden’s inauguration here.\nAuthor: Satvir\nClick here to read my Labour List piece on how Labour councils are setting an example for government with their record on housing.\nRead my Labour List piece on Biden’s inauguration here.\nClick here to read my Labour List piece on how Labour councils are setting an example for government with their record on housing.",
  "https_satvirkaur_info_/https_satvirkaur_info_author_sk99_74s_page_2/content_22.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_safeguarding-issues-at-st-annes-catholic-school/content_60.html": "Troubling to hear the news from Hampshire and Isle of Wight Constabulary today, that the former Headteacher of St Anne’s Catholic School has been charged with alleged non-recent sexual abuse. This is in addition to four former teachers who currently remain under investigation following similar reports of non-recent child sexual abuse at the school.\nThis news will of course be deeply shocking and upsetting for staff, children and the wider school’s community. As a former pupil of St Anne’s myself, I share this feeling of disbelief and concern. Every parent should feel that their child is safe at school and children should be safe with their teachers, rather than become victims.\nI would like to thank Hampshire and Isle of Wight Constabulary for their thorough and robust investigation into this case and their on going support for victims. I will continue to work with them, Southampton City Council and other institutions to help prevent this from happening again in the future.\nMore needs to be done to protect our young people, particularly women and girls. I am pleased by the measures this new government has recently announced to help ensure necessary safeguards are in place in and out of schools and I shall continue to advocate for these.\nI also strongly encourage anyone who is concerned, has questions, or has been a victim of child sexual abuse to contact the police on 101 where you can speak with a police officer in confidence or by submitting information online by going to:\nhttps://mipp.police.uk/operation/44HC23M03-PO1.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_prospectus-launch/content_53.html": "With growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nDiscover the Prospectus for Change here: southamptonrenaissance.com",
  "https_satvirkaur_info_/https_satvirkaur_info_culture/content_14.html": "I grew up believing the world of art and culture wasn’t for people like me.\nIt was only after taking on the Culture portfolio, in my former role as Cabinet Member for Homes and Culture at Southampton City Council, that I realised I had grown up with so much culture, but had just not defined it as such. I want to ensure that everyone’s culture is valued, celebrated and brings people together.\nMore than just ‘art for arts sake’, I believe culture plays an invaluable role in growing the local economy, helping to address social needs and giving us a sense of pride and belonging in Southampton.\nLikewise with sport and leisure, we will only be able to tackle inequalities within health and wellbeing if we invest more and make these services more accessible to everyone.\nWhen I was a Cabinet Member, I launched Southampton’s bid to become UK City of Culture 2025, for which we are now finalists. The City of Culture journey has the ability to transform Southampton, create opportunities for local people and to help us reach our full potential on a national and international platform.\nBeing a board member of Arts Council England has further aided me in influencing regional and national policy within this sector.\nInitiatives and projects\nI am proud of the initiatives I worked on in my cabinet role, including:\n- Transforming Southampton’s Libraries Service so that, unlike other areas in the country, no Southampton libraries have had to close and have instead been recognised as community hubs.\n- Helping launch an arts programme within the Council’s youth teams, in partnership with John Hansard Gallery, which resulted in a reduction in youth reoffending in the city. The project is now used as an example of best practice nationally.\n- Growing Southampton’s tourism and visitor economy. Maximising our transport links as the busiest cruise port in Europe, leading projects to help make Southampton a destination city.\n- Protecting and evolving Southampton’s rich heritage, so that future generations can learn from our past.\n- Using Southampton’s open spaces to make Southampton a place where something is always happening. From street parties to big music festivals, we put events at the heart of what the city is known for.\n- Redeveloping Southampton’s Outdoor Sports Centre to not only improve health inequalities, but to help local people reach their sporting potential and to help us become a regional leisure hub drawing in visitors and investment.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_bank/content_41.html": "I am deeply concerned by the news that Lloyds Bank plans to close their Shirley Southampton branch in early 2025.\nI have written to the the Chief Executive of Lloyds to share my concerns and have launched a petition in opposition to the closure.\nI have written to the the Chief Executive of Lloyds to share my concerns and have launched a petition in opposition to the closure.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_second-world-war/content_98.html": "Satvir Kaur, Member of Parliament for Southampton Test, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War, and looking to find the living relatives of these local war heroes.\nThe PRU, which was tasked to provide up-to-date intelligence to strategically plan the Allied actions in the war, was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London. Among those who served, and died, in the PRU were Southampton born Leonard Grieb and John Merrifield.",
  "https_satvirkaur_info_/https_satvirkaur_info_new-year-new-opportunities/content_94.html": "A new year brings new change, and there’s a big one on the horizon- devolution. It’s something that has been spoken about for more than a decade but never delivered within our region. I’m pleased that under this new Labour Government, it could finally become a reality. Everyone talks about Southampton’s huge potential, and this will offer a really exciting opportunity to help deliver it. It’s why I’ve been backing this throughout, both when I was in local government and now in Westminster, speaking to Ministers about how Southampton can benefit from it. In a nutshell it means more powers and more money for our city and region.\nI believe that more decisions about our area should be made more locally, by communities that they will impact, rather than always coming from Whitehall, which can often have a top down, one size fits all approach. This government believes that local people, whether you live or work here, better understand the unique challenges and aspirations of our communities.\nThis will be the biggest local government reorganisation in a generation, and local councils in the Solent region, including Southampton, have now submitted a formal request to be included in the Government’s Devolution Priority Programme. This is now being reviewed, and we will hopefully have further updates soon.\nThere are over 2 million residents represented by the Solent councils and more than 90,000 businesses. As a region we truly are a national, and international economic powerhouse, and so much of that power is generated right here in our city. We are at the forefront of driving innovation and productivity, and this process will mean we get more decision-making powers and extra funding which can go towards infrastructure, housing, and employment initiatives. We want to let the world know that Southampton is a fantastic place for investment and that the opportunities for those who live and work here are huge. There’s still a way to go, but we believe our regions potential can be unlocked through this Government’s devolution programme.\nSpeaking of the power of grass roots action, I recently had the absolute pleasure of visiting Bevois Town Primary School, where I spent the morning with the fantastic pupils hearing about the incredible work being done by the school. The school’s Pupil Parliament is already taking an active role in advocating for important initiatives, things that can have a real impact on their school, their wider community, and of course, their friends. One initiative they are championing is the introduction of Labour’s free breakfast club scheme. A huge well done to those pupils for getting stuck in! As someone that grew up in the same area as the children I spoke to, which happens to be one of the most deprived areas not only in Southampton, but the UK, I know the difference a breakfast club would make to schools like Bevois Town Primary.\nIt’s great to see this Labour government putting families in Southampton first. This new pilot will be rolled out from April 2025, and will include 750 schools from across the country. The programme is hoping to help ensure children start each school day ready to learn. Providing a healthy breakfast has been proven to improve attendance, behaviour, and attainment, setting children up for success both academically and socially. But it goes further than that, as this is a scheme that helps support parents and carers too.\nThese breakfast clubs will provide food to children before school, giving them a great start to the day. But the benefits go beyond just academic success. Breakfast clubs provide a safe space for children to socialise and engage with their peers before class, while offering parents and carers greater flexibility in their childcare arrangements. Most importantly, they help families struggling with the cost of living by providing one less expense.\nWe’re also doing more to support families who are at the beginning of their journey, helping parents to give their children the best start in life. I was delighted to see that Southampton has received nearly £1.3million from the government through the family hubs and the Start for Life programme.\nThe funding is part of a £126 million boost for families, aiming to provide support from pregnancy and beyond. We know that the first 2 years of a child’s life lay the building blocks for their physical and emotional wellbeing into adulthood. That’s why we are investing in early years, as part of our Plan for Change, to improve access to services in deprived areas to ensure no one is left behind.\nIn Westminster the Renters’ Rights Bill will now head to the House of Lords after being voted through this week. We’re making amazing progress with this crucial Bill and it’s well on the way to becoming law giving greater rights to renters. I’m particularly excited because it will ban no-fault evictions, which is the number one cause of homelessness in our city, it will protect tenants from dangerous damp and mould, and it will limit the amount of rent landlords can demand in advance. This Bill was one of the first things I spoke on in Parliament, and making sure everyone has a safe, secure, affordable home in Southampton remains a top priority for me.\nFinally, I would love to hear from you. I’m holding weekly surgeries and please do keep a look out for an invitation to come along to a coffee morning, I’m holding these regularly across the constituency. In the meantime, if you have any questions or if there is an issue that I can help with then please do not hesitate to contact me on satvir.Kaur.mp@parliament.uk or call me on 02382 546 357.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_mp_page_2/content_112.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_no-limits-funding/content_59.html": "I am so pleased to share news that No Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.\nThe Early Support Hubs provide accessible, drop-in mental health services to help prevent more serious conditions from developing, without the need for referrals or doctor’s appointments. These services are aimed at supporting young people by addressing mental health issues early, before they become more severe.\nEveryone knows someone who has been affected by mental health struggles and many, very sadly, will have lost a loved one to mental health crisis. Poor mental health has been a growing problem in our city, especially among young people, and I’ve always been determined to do all I can to help tackle it. So, it’s great to see No Limits receive this additional government funding, which will allow them to continue and expand their vital work, supporting those in need within our communities. They are an incredible local charity that has helped thousands of young people in Southampton for decades.\nThe £58,000 will help No Limits deliver essential mental health and wellbeing services, providing young people with the support they need to overcome challenges in their everyday lives. In the coming year, Early Support Hubs like No Limits South are set to deliver 10,000 additional interventions, including group sessions, individual counselling appointments, therapies, and specialist support.\nAlice Mooney, Head of Services at No Limits, said that “the early intervention provided by Early Support Hubs, across a wide range of issues, can play a vital role in supporting young people’s mental health. We have been providing this support for over 30 years and are delighted to have received this funding from government, as part of its 10-Year Health Plan.”\nThis funding is a vital step towards providing more comprehensive support for our young people, helping to ensure that no one falls through the cracks. It’s more than just mental health support – but about supporting young people in all aspects of their lives too.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_toy-appeal/content_92.html": "The Christmas Toy Appeal, which is run by Southampton City Council and volunteers, is now in its 36th year, and I had the absolute pleasure of spending a morning helping out.\nThe annual drive for toy donations is now well under way and donations have poured in from across Southampton. But when the Toy Appeal is providing gifts for more than 7,000 young people all over the city, there is always a need for more.\nThe volunteers are led by Colin McPherson, a social worker with Southampton City Council. Colin has run the Toy Appeal for more than twenty years, and his dedication to helping and supporting young people has been unwavering. There are so many children who wake up on Christmas Day with a present to open and that’s because of him, and everyone who volunteers and donates.",
  "https_satvirkaur_info_/https_satvirkaur_info_in-common-satvir-profile/content_71.html": "Read In Common‘s profile of me here, written following Labour’s local election success and after I became leader of Southampton City Council in May 2022.\nCategories\nRead In Common‘s profile of me here, written following Labour’s local election success and after I became leader of Southampton City Council in May 2022.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_closure/content_63.html": "I would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_water/content_73.html": "It’s that time of year, and while many of us are gearing up for Christmas, this past week I’ve been busy with one of Southampton’s most unwelcome Christmas traditions! The water supply disappearing. Southern Water caused utter chaos and concern when their water supply to thousands of homes stopped due to an issue that arose while cleaning and updating the Testwood Water Supply Works in Totton.\nSouthern Water’s handling of it, has been quite frankly appalling. The lack of water stations in Southampton, the confused communication from the Southern Water team, and even when these minimal water stations were set up, there was confusion over when they opened and closed, as well as only being able to access them with a car. Once they were “up and running” they ran out of water, leaving many stranded having waited hours. Those that could not get to a water station, and particularly the vulnerable (who were meant to be on a priority list for Southern Water to hand deliver to their homes!) – were left in limbo, waiting for water they were promised, that never came or came too late. At one point there were more than 20,000 people on that list.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_young-people/content_85.html": "I am so pleased to share news that No Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_southampton_page_2/content_105.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_mp/content_79.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.\nAs the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nI would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.\nI am so pleased to share news thatNo Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.\nHaving heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.\nWith growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\n2881fa4f-7a94-4236-97d5-81af02f0b991\nd86b1d52-1d7f-479a-a0d6-f76526dd935f\n126894b4-26c6-449c-bf75-f374745a4f45\nc14f20c5-6979-4c24-973c-abc43d6c6b00\ndd96b18b-14fa-46d7-a160-4fc9e0bb827e\n4e5937d3-76ea-449b-9dc2-4c1b1575957c\n6a07d194-9a59-41bf-b182-435b64cc5e9e\n3ebcd818-e37e-43ff-83e2-60d996474c91\n94d671eb-7735-4312-9b19-fc0949794af4\n235c2720-0577-47c6-93e7-767419a9069b\n464ec279-44cb-4172-a84b-1f3e2f92198d\ndda9913f-80a7-4db6-a314-4a64a2341a67\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nThe Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.\nI was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.\nA new year brings new change, and there’s a big one on the horizon- devolution. It’s something that has been spoken about for more than a decade but never delivered within our region. I’m pleased that under this new Labour Government, it could finally become a reality. Everyone talks about Southampton’s huge potential, and this will offer a really exciting opportunity to help deliver it. It’s why I’ve been backing this throughout, both when I was in local government and now in Westminster, speaking to Ministers about how Southampton can benefit from it. In a nutshell it means more powers and more money for our city and region.\nI believe that more decisions about our area should be made more locally, by communities that they will impact, rather than always coming from Whitehall, which can often have a top down, one size fits all approach. This government believes that local people, whether you live or work here, better understand the unique challenges and aspirations of our communities.\nThis will be the biggest local government reorganisation in a generation, and local councils in the Solent region, including Southampton, have now submitted a formal request to be included in the Government’s Devolution Priority Programme. This is now being reviewed, and we will hopefully have further updates soon.\nIt’s that time of year, and while many of us are gearing up for Christmas, this past week I’ve been busy with one of Southampton’s most unwelcome Christmas traditions! The water supply disappearing. Southern Water caused utter chaos and concern when their water supply to thousands of homes stopped due to an issue that arose while cleaning and updating the Testwood Water Supply Works in Totton.\nSouthern Water’s handling of it, has been quite frankly appalling. The lack of water stations in Southampton, the confused communication from the Southern Water team, and even when these minimal water stations were set up, there was confusion over when they opened and closed, as well as only being able to access them with a car. Once they were “up and running” they ran out of water, leaving many stranded having waited hours. Those that could not get to a water station, and particularly the vulnerable (who were meant to be on a priority list for Southern Water to hand deliver to their homes!) – were left in limbo, waiting for water they were promised, that never came or came too late. At one point there were more than 20,000 people on that list.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_renaissance-board/content_68.html": "With growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nDiscover the Prospectus for Change here: southamptonrenaissance.com",
  "https_satvirkaur_info_/https_satvirkaur_info_category_news_page_2/content_93.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_public-health/content_16.html": "The Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.",
  "https_satvirkaur_info_/https_satvirkaur_info_candidate-vide/content_82.html": "Southampton is my home. It’s where I was born, grew up, and have always lived. It is heartbreaking to see families I know struggling under the Conservatives.\nI am standing to be the next MP for Southampton Test because we can’t go on like this. If we want meaningful change, we need a change of government, and we need that new government to be Labour.\nVote Labour on Thursday 4th July.\nSpecial thanks to Southampton film company City Eye for producing this film for me.",
  "https_satvirkaur_info_/https_satvirkaur_info_about-satvir-kaur/content_3.html": "I love Southampton, but there is still so much we can all do to improve our great city.\nBorn and bred Southampton, I’ve seen the change we can make, working together to build on the achievements of previous generations.\nGrowing up in Southampton\nI have lived in Southampton all my life. I grew up on free school meals in the inner city, was educated here, and am immensely proud to have graduated from both the University of Southampton and Solent University, first in History and Politics and then in Law.\nI’ve never forgotten my roots. My home was in Newtown, where my family still live. Growing up in one of the most deprived areas in the city came with its challenges but I loved it. I learned the importance of community, relying on good public services such as libraries and youth centres, and I discovered there is real strength in our diversity.\nI have carried that early experience throughout my life. Every child needs opportunities and a thriving community to live a life of joy, fulfilment and dignity. That must start with education. Education is the most important opportunity there is. My life was changed by attending St Anne’s, a good local state school where I was Head Girl. I believe we never stop learning, and should always try to grow our knowledge, understanding, skills and empathy. I have tried to live this throughout my life in politics.\nEmployment and experience\nMy previous jobs have given me experience that I carry through to my politics. I have worked for a charity and in a major publishing company, but the most important lessons were the ones I learnt as the daughter of a market trader, and then helping with the family fabric business.\nI learnt the economic and social importance of small business and local highstreets, and how hard we all had to work to keep the business afloat. And sometimes, having a market trader’s shout is pretty useful for debating against the Tories.\nPolitical work\nI joined the Labour Party because I wanted to make a real difference to my community and the city I love and, in 2011, I was elected to Southampton City Council in Shirley, a then-safe Tory ward. We have built a great local campaign team which responds to residents’ needs and gets our message out there.\nAs councillor for Shirley ward and cabinet member within the city for over a decade, I saw first-hand the difference Labour values and policies made to Shirley and our city and it was an honour to help deliver these. From setting up initiatives to tackle poverty and inequalities, protecting and building community infrastructure, to ensuring we all have a home that is safe, secure and affordable. We achieved so much, but I know much more needs to be done.\nI was also responsible for launching the bid for Southampton to become UK City of Culture 2025, a competition in which we were finalists. It was a process that transformed our city and created a sense of belonging and pride.\nDuring the brief period of Conservative control in Southampton following the 2021 local elections, I became Leader of the Labour Group and Opposition in the city. Whilst in this role I continued to help put Southampton on the map and influenced national policy in a variety of areas.\nLeading the Council\nWith Labour taking back control of the Council in the 2022 Local Elections, I returned as the new Labour Leader – the first person of colour to lead Southampton City Council and the first female Sikh leader in the country.\nIt was a huge personal privilege to become Leader. My Labour team of councillors and I were incredibly grateful to local residents for putting their trust in us to lead the city again. We were determined to make every pound the council spent work for you, creating a family city that was safer, greener, and more affordable and, most of all, we wanted to put pride back into our neighbourhoods.\nParliamentary Candidate for Southampton Test in 4 July 2024 General Election\nIn the summer of 2022, I was enormously grateful to Labour members in Southampton Test for selecting me to be their next Parliamentary Candidate, standing in place of Alan Whitehead following his decision to retire.\nMember of Parliament for Southampton Test\nAt the General Election of Thursday 4th July 2024, Labour retained Southampton Test and I was elected the new Member of Parliament. I am truly humbled, and it is the greatest honour of my life to take office.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_leaseholders/content_31.html": "Having heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.",
  "https_satvirkaur_info_/https_satvirkaur_info_privacy-policy/content_2.html": "Last updated: 18/10/2024\nSatvir Kaur’s office (“us”, “we”, or “our”) operates the Satvir Kaur website (the “Service”).\nThis page informs you of our policies regarding the collection, use and disclosure of Personal Information when you use our Service.\nWe will not use or share your information with anyone except as described in this Privacy Policy (see also ‘Signing Petitions’ below).\nWe use your Personal Information for providing and improving the Service. By using the Service, you agree to the collection and use of information in accordance with this policy.\nInformation Collection And Use\nWhile using our Service, we may ask you to provide us with certain personally identifiable information that can be used to contact or identify you. Personally identifiable information (“Personal Information”) may include, but is not limited to:\n- Name\n- Address\n- Email address\n- Phone number\nSigning Petitions\nIf you sign one of our petitions, we will share your name and postcode with the third-party petitioned, solely for the purposes of the petition only. We may also write to you via email or via post to update you about with news about the petition. By signing a petition, you consent to your data being shared in this way.\nLog Data\nWe collect information that your browser sends whenever you visit our Service (“Log Data”). This Log Data may include information such as your computer’s Internet Protocol (“IP”) address, browser type, browser version, the pages of our Service that you visit, the time and date of your visit, the time spent on those pages and other statistics.\nCookies\nCookies are files with small amount of data, which may include an anonymous unique identifier. Cookies are sent to your browser from a web site and stored on your computer’s hard drive.\nWe use “cookies” to collect information. You can instruct your browser to refuse all cookies or to indicate when a cookie is being sent. However, if you do not accept cookies, you may not be able to use some portions of our Service.\nService Providers\nWe may employ third party companies and individuals to facilitate our Service, to provide the Service on our behalf, to perform Service-related services or to assist us in analyzing how our Service is used.\nThese third parties have access to your Personal Information only to perform these tasks on our behalf and are obligated not to disclose or use it for any other purpose.\nSecurity\nThe security of your Personal Information is important to us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Information, we cannot guarantee its absolute security.\nLinks To Other Sites\nOur Service may contain links to other sites that are not operated by us. If you click on a third party link, you will be directed to that third party’s site. We strongly advise you to review the Privacy Policy of every site you visit.\nWe have no control over, and assume no responsibility for the content, privacy policies or practices of any third party sites or services.\nChildren’s Privacy\nOur Service does not address anyone under the age of 18 (“Children”).\nWe do not knowingly collect personally identifiable information from children under 18. If you are a parent or guardian and you are aware that your child has provided us with Personal Information, please contact us. If we discover that a child under 18 has provided us with Personal Information, we will delete such information from our servers immediately.\nCompliance With Laws\nWe will disclose your Personal Information where required to do so by law.\nChanges To This Privacy Policy\nWe may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.\nYou are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.\nContact Us\nIf you have any questions about this Privacy Policy, please contact us.",
  "https_satvirkaur_info_/https_satvirkaur_info_contact-satvir/content_84.html": "Please note, strict Parliamentary rules say that MPs can only help their own constituents. Please visit this website and enter your postcode to check if I am your MP.\nIf you are one of my constituents, please make sure you have included your full name, address and contact details in your correspondence.\nContact Details\nPostal Address:\nSatvir Kaur MP\nHouse of Commons\nLondon\nSW1A 0AA\nEmail:\nsatvir.kaur.mp@parliament.uk\nPhone:\n02382 546 357",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_david-french/content_89.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_holy-family-catholic-primary-school/content_69.html": "As the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nThat’s why I was absolutely delighted to hear about the fantastic achievements of pupils from the Learning Federation Partnership of Schools in the recent National Reading Champions Quiz.",
  "https_satvirkaur_info_/https_satvirkaur_info_news_page_2/content_111.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_politician/content_36.html": "Last week I had the honour of organising a dinner to celebrate my predecessor Dr Alan Whitehead. Alan first came into my life when I was 18, and it all started with a birthday card. I received the card from my local MP, which not only wished me a happy birthday, but reminded me that I was old enough to vote.\nCategories",
  "https_satvirkaur_info_/https_satvirkaur_info_assisted-dying-statement/content_97.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_sepsis/content_51.html": "I was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.",
  "https_satvirkaur_info_/https_satvirkaur_info_category_news_page_3/content_52.html": "Week in week out, Southampton Labour teams and I hit the doorsteps across the city and chat to residents. We call round regularly to hear people’s views, tackle problems, offer assistance, and also encourage people to get out and use their vote!\nTalking to other Southampton residents has always been one of my favourite parts of politics, ever since I first joined the Labour Party. I genuinely love going out canvassing to meet as many as possible and I find it is the best way to speak to people whose voices might otherwise go unheard.",
  "https_satvirkaur_info_/https_satvirkaur_info_my-first-ever-christmas-card-competition-and-we-have-a-winner/content_81.html": "I was delighted to visit a very Christmassy Newlands Primary School in Millbrook this week to present the winner of this year’s Christmas Card Competition with their prize. After being elected in July, I knew that running this competition was something I really wanted to do, so this is especially exciting for me. Each year we’ll pick a different school in the constituency to take part, and thank you to Newlands Primary School for being the first.\nThe winner was year 1 student, Laila Weller. Laila’s artwork really stood out to me as it features a wonderful handprint of a Christmas tree which is so festive. Laila is just five-years-old, and her creativity brilliant, well done Laila!\nIt was a really tough decision, as there were over 80 entries submitted from the children at the school.\nI got to stop and chat with the whole class, and speak with the Head Teacher, Mrs Karen Mellor too. Mrs Mellor spoke of her pride at the students’ efforts. She said: “The children at Newlands Primary were excited to be asked to enter a competition to design a Christmas card for Satvir. We have many budding artists, and there were over 80 entries to choose from. Well done to everyone who entered, and thank you to Miss Burt, our new Art Leader, who inspired the children to take part.”\nSouthampton is a city known for the arts and has a fantastic cultural offering. We want to encourage our young people to be part of that and get involved with the arts. So I was very pleased when so many children were interested in taking part.\nA huge thanks to all of the children who entered, and to the school for helping us run the competition. And a very Merry Christmas to everyone in Southampton Test!",
  "https_satvirkaur_info_/https_satvirkaur_info/content_1.html": "WhatsApp Image 2021-02-13 at 10.54.11\nThank you, Southampton\nWhatsApp Image 2021-02-13 at 10.54.11\nStanding up for what is right\neda73fee-3847-4bd7-b481-9af76d885dd9\nBuilding a better future\nWhatsApp Image 2024-05-30 at 14.13.51\nSouthampton born and bred\nWhatsApp Image 2021-02-13 at 15.18.11\nLeading the way\nSONY_ILCE-7RM4A_145436416-145677211_609-1\nWorking with you\nWhatsApp Image 2021-02-13 at 17.50.51 (1)\nPart of the Community\nSatvir Kaur MP\nLabour Member of Parliament for Southampton Test",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_early-support-hubs/content_83.html": "I am so pleased to share news that No Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_terminally-ill-adults-end-of-life-bill-2024/content_103.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_southampton-test_page_2/content_55.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_high-street-banks/content_23.html": "I would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_member-of-parliament/content_64.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_how-i-can-help/content_21.html": "As your Member of Parliament, there are different things I can do to represent and help you.\nPlease note: I can only help people in Southampton Test\nDue to strict parliamentary protocol, I can only help people that live in my constituency, Southampton Test. Please enter your postcode here to check that you live in Southampton Test. Please also provide your full name and full postal address including postcode when you contact me.\nI have a problem and need assistance. Can you help?\nA big part of the job of an MP is helping constituents who are in difficulty.\nOn behalf of my constituents, I can contact Government departments, agencies, local councils, utility companies, housing associations and many more in order to raise issues, chase up enquiries and advocate for people.\nIf you require help with an issue to do with benefits, housing, education, asylum and immigration, health, or something else, please do get in touch and me and my team will be able to assist you.\nHow can I tell you how I feel about a particular policy? Can you help me with a question about policy?\nIf you have an opinion you want to share or a question about policy, I would love to hear from you and will always respond to your concerns.\nDepending on what you want to know or say, I will also write to the relevant Government minister on your behalf to share your opinion or to seek clarity on a particular point. I can also ask Written and Oral Questions in Parliament.\nI want to make you aware of something going on in Southampton Test. How do I go about doing that?\nI love talking all things Southampton and want to hear from you about anything, good or bad, that you want to raise in the constituency.\nWhether you have a brilliant local project you want to make me aware of, or if there is an issue in the constituency you want to raise, I want to know about it.\nI would rather speak to you in person. How do I go about booking a surgery appointment?\nIf you would like to speak to me directly about any or all of the above, you can book to meet me at a surgery appointment.\nI hold regular surgeries for constituents in need and I am always happy to chat and listen to your concerns.\nYou can book an appointment by contacting my office.\nI want to speak to you about something else not listed here. Is that OK?\nIf you are in any doubt about what I can and cannot help you with, please contact my office who will be able to advise you. MPs have an area of responsibility that we have to work within, so some things will fall outside of that, but please ask if you are not sure.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_southampton/content_65.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.\nAs the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nI am so pleased to share news thatNo Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.\nHaving heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.\nWith growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\n2881fa4f-7a94-4236-97d5-81af02f0b991\nd86b1d52-1d7f-479a-a0d6-f76526dd935f\n126894b4-26c6-449c-bf75-f374745a4f45\nc14f20c5-6979-4c24-973c-abc43d6c6b00\ndd96b18b-14fa-46d7-a160-4fc9e0bb827e\n4e5937d3-76ea-449b-9dc2-4c1b1575957c\n6a07d194-9a59-41bf-b182-435b64cc5e9e\n3ebcd818-e37e-43ff-83e2-60d996474c91\n94d671eb-7735-4312-9b19-fc0949794af4\n235c2720-0577-47c6-93e7-767419a9069b\n464ec279-44cb-4172-a84b-1f3e2f92198d\ndda9913f-80a7-4db6-a314-4a64a2341a67\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nThe Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.\nI was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.\nA new year brings new change, and there’s a big one on the horizon- devolution. It’s something that has been spoken about for more than a decade but never delivered within our region. I’m pleased that under this new Labour Government, it could finally become a reality. Everyone talks about Southampton’s huge potential, and this will offer a really exciting opportunity to help deliver it. It’s why I’ve been backing this throughout, both when I was in local government and now in Westminster, speaking to Ministers about how Southampton can benefit from it. In a nutshell it means more powers and more money for our city and region.\nI believe that more decisions about our area should be made more locally, by communities that they will impact, rather than always coming from Whitehall, which can often have a top down, one size fits all approach. This government believes that local people, whether you live or work here, better understand the unique challenges and aspirations of our communities.\nThis will be the biggest local government reorganisation in a generation, and local councils in the Solent region, including Southampton, have now submitted a formal request to be included in the Government’s Devolution Priority Programme. This is now being reviewed, and we will hopefully have further updates soon.\nIt’s that time of year, and while many of us are gearing up for Christmas, this past week I’ve been busy with one of Southampton’s most unwelcome Christmas traditions! The water supply disappearing. Southern Water caused utter chaos and concern when their water supply to thousands of homes stopped due to an issue that arose while cleaning and updating the Testwood Water Supply Works in Totton.\nSouthern Water’s handling of it, has been quite frankly appalling. The lack of water stations in Southampton, the confused communication from the Southern Water team, and even when these minimal water stations were set up, there was confusion over when they opened and closed, as well as only being able to access them with a car. Once they were “up and running” they ran out of water, leaving many stranded having waited hours. Those that could not get to a water station, and particularly the vulnerable (who were meant to be on a priority list for Southern Water to hand deliver to their homes!) – were left in limbo, waiting for water they were promised, that never came or came too late. At one point there were more than 20,000 people on that list.\nI was delighted to visit a very Christmassy Newlands Primary School in Millbrook this week to present the winner of this year’s Christmas Card Competition with their prize. After being elected in July, I knew that running this competition was something I really wanted to do, so this is especially exciting for me. Each year we’ll pick a different school in the constituency to take part, and thank you to Newlands Primary School for being the first.\nThe winner was year 1 student, Laila Weller. Laila’s artwork really stood out to me as it features a wonderful handprint of a Christmas tree which is so festive. Laila is just five-years-old, and her creativity brilliant, well done Laila!",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_nhs/content_24.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.\nI am so pleased to share news thatNo Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.\nThe Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.\nI was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_consultation/content_33.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_reading-champions/content_7.html": "As the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nThat’s why I was absolutely delighted to hear about the fantastic achievements of pupils from the Learning Federation Partnership of Schools in the recent National Reading Champions Quiz.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_alan-whitehead/content_42.html": "Last week I had the honour of organising a dinner to celebrate my predecessor Dr Alan Whitehead. Alan first came into my life when I was 18, and it all started with a birthday card. I received the card from my local MP, which not only wished me a happy birthday, but reminded me that I was old enough to vote.\nCategories",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_alasdair-snell/content_13.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.",
  "https_satvirkaur_info_/https_satvirkaur_info_news/content_35.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.\nAs the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nI would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.\nI am so pleased to share news thatNo Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.\nHaving heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.\nLabour is delivering on our promise to roll out free breakfast clubs to all primary school children, starting with 750 early adopter schools beginning in April this year.\nDetails of early adopter schools were announced earlier his week and I am absolutely delighted that a school in Southampton Test will be taking part in the first wave.\nA massive congratulations to Bevois Town Primary on their successful application!\nThe government has chosen Bevois Town as one of the first to offer free, daily breakfast clubs as part of our landmark scheme that will ensure children are school-ready and parents are better off.\nWith growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\n2881fa4f-7a94-4236-97d5-81af02f0b991\nd86b1d52-1d7f-479a-a0d6-f76526dd935f\n126894b4-26c6-449c-bf75-f374745a4f45\nc14f20c5-6979-4c24-973c-abc43d6c6b00\ndd96b18b-14fa-46d7-a160-4fc9e0bb827e\n4e5937d3-76ea-449b-9dc2-4c1b1575957c\n6a07d194-9a59-41bf-b182-435b64cc5e9e\n3ebcd818-e37e-43ff-83e2-60d996474c91\n94d671eb-7735-4312-9b19-fc0949794af4\n235c2720-0577-47c6-93e7-767419a9069b\n464ec279-44cb-4172-a84b-1f3e2f92198d\ndda9913f-80a7-4db6-a314-4a64a2341a67\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nThe Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.\nI was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.\nA new year brings new change, and there’s a big one on the horizon- devolution. It’s something that has been spoken about for more than a decade but never delivered within our region. I’m pleased that under this new Labour Government, it could finally become a reality. Everyone talks about Southampton’s huge potential, and this will offer a really exciting opportunity to help deliver it. It’s why I’ve been backing this throughout, both when I was in local government and now in Westminster, speaking to Ministers about how Southampton can benefit from it. In a nutshell it means more powers and more money for our city and region.\nI believe that more decisions about our area should be made more locally, by communities that they will impact, rather than always coming from Whitehall, which can often have a top down, one size fits all approach. This government believes that local people, whether you live or work here, better understand the unique challenges and aspirations of our communities.\nThis will be the biggest local government reorganisation in a generation, and local councils in the Solent region, including Southampton, have now submitted a formal request to be included in the Government’s Devolution Priority Programme. This is now being reviewed, and we will hopefully have further updates soon.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_remembrance/content_47.html": "Satvir Kaur, Member of Parliament for Southampton Test, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War, and looking to find the living relatives of these local war heroes.\nThe PRU, which was tasked to provide up-to-date intelligence to strategically plan the Allied actions in the war, was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London. Among those who served, and died, in the PRU were Southampton born Leonard Grieb and John Merrifield.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_southern-water/content_90.html": "It’s that time of year, and while many of us are gearing up for Christmas, this past week I’ve been busy with one of Southampton’s most unwelcome Christmas traditions! The water supply disappearing. Southern Water caused utter chaos and concern when their water supply to thousands of homes stopped due to an issue that arose while cleaning and updating the Testwood Water Supply Works in Totton.\nSouthern Water’s handling of it, has been quite frankly appalling. The lack of water stations in Southampton, the confused communication from the Southern Water team, and even when these minimal water stations were set up, there was confusion over when they opened and closed, as well as only being able to access them with a car. Once they were “up and running” they ran out of water, leaving many stranded having waited hours. Those that could not get to a water station, and particularly the vulnerable (who were meant to be on a priority list for Southern Water to hand deliver to their homes!) – were left in limbo, waiting for water they were promised, that never came or came too late. At one point there were more than 20,000 people on that list.",
  "https_satvirkaur_info_/https_satvirkaur_info_sepsis-constituent-story/content_17.html": "I was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.\nWhat is sepsis?\nI was shocked to hear that sepsis kills an estimated 48,000 people a year in the UK. According to NHS England, sepsis claims more lives than lung cancer and is the second biggest killer after cardiovascular disease. The UK Sepsis Trust states that sepsis causes 5 deaths every hour in the UK.\nSepsis happens as a result of the immune system overreacting to an infection in your body, with the immune system beginning to attack the organs and tissues. It can lead to septic shock and, without proper treatment, can lead to organ failure, tissue damage and death. About 40% of sepsis survivors experience life-changing effects to their physical or mental health, such as limb amputation.\nSepsis requires urgent hospital treatment and is treated through antibiotics. It is hugely concerning that the number of deaths in England and Wales where sepsis was the underlying cause has risen from 2,630 in 2018 to 4,276 in 2023, an increase of 63%.\nThe risk of sepsis developing can be prevented by keeping open wounds clean, taking antibiotics correctly if prescribed, and washing hands regularly. Sepsis is life-threatening and it can be hard to spot as there are lots of possible symptoms, and these symptoms can be similar to other conditions, including flu or a chest infection.\nIn Parliament\nIn Parliament, MPs have raised awareness of sepsis through debates and questions. A particularly powerful account was given by Conservative MP Craig Mackinlay, who revealed that he had all his limbs amputated because of the condition, with doctors at one point giving him only a 5% chance of survival.\nIn a desperately sad and now well-known story, 13-year-old Martha Mills died in 2021 after developing sepsis in hospital, where she had been admitted with a pancreatic injury after falling off her bike. This tragic case led to ‘Martha’s Rule’ coming into force, allowing patients, families, and carers to request an urgent review if they are concerned about a patient’s condition. It also significantly raised public awareness of the dangers of sepsis.\nWhat I’m doing\nAfter hearing my constituent’s story, I wrote to the Government to ask what it being done nationally to help. I was pleased with the response from Minister Andrew Gwynne, who said that the Government is focused on improving the clinical awareness and recognition of sepsis by healthcare professionals, so that unwell and deteriorating patients are identified more promptly and started on life-saving treatment sooner.\nThe Minister went on to say that that NHS England has launched several training programmes aimed at improving the diagnosis and early management of sepsis. This should really help the situation on the ground in hospitals.\nI have also written to the local NHS Trust about what they are doing to help reduce sepsis and to raise awareness.\nI’ll continue to push for more action on sepsis awareness and for more research to be undertaken so that, ultimately, we can ensure less people suffer from it.\nSymptoms of sepsis\nPlease see below for the NHS list of sepsis symptoms, so that you can protect yourself and and your loved ones.\nCall 999 or go to A&E if a baby or young child has any of these symptoms of sepsis:\n- blue, grey, pale or blotchy skin, lips or tongue – on brown or black skin, this may be easier to see on the palms of the hands or soles of the feet\n- a rash that does not fade when you roll a glass over it, the same as meningitis\n- difficulty breathing (you may notice grunting noises or their stomach sucking under their ribcage), breathlessness or breathing very fast\n- a weak, high-pitched cry that’s not like their normal cry\n- not responding like they normally do, or not interested in feeding or normal activities\n- being sleepier than normal or difficult to wake\nCall 999 or go to A&E if an adult or older child has any of these symptoms of sepsis:\n- acting confused, slurred speech or not making sense\n- blue, grey, pale or blotchy skin, lips or tongue – on brown or black skin, this may be easier to see on the palms of the hands or soles of the feet\n- a rash that does not fade when you roll a glass over it, the same as meningitis\n- difficulty breathing, breathlessness or breathing very fast\nFor more information about the condition, there are several excellent charities with lots of resources available, including UK Sepsis Trust and Sepsis Research FEAT.\nGet in touch\nIf you have any questions or concerns about this issue or anything else, or perhaps you have your own story to share, please do not hesitate to contact me on satvir.kaur.mp@parliament.uk or call me on 02382 546 357.",
  "https_satvirkaur_info_/https_satvirkaur_info_category_info/content_39.html": "As you may know, the second reading of the Terminally Ill Adults (End of Life) Bill 2024-25 is scheduled to take place this Friday, November 29th. This is not a Government Bill, and MPs will vote on the Bill as a matter of conscience and will not be whipped. This means that MPs will be free to vote based on their position, rather than having to vote with their party.\nIt is a hugely important subject and people on both sides of the debate have strongly held beliefs, often based on personal and sensitive experiences or faith.\nI will be attending the debate and, after a great deal of research, consideration, and listening to a wide-range of constituents’ views, I have decided to vote against the Bill.\nI want to take the time to explain why I have made this decision. From my own personal experience of supporting a loved one, in pain and with no prospect of getting better, I empathise hugely for those who think that people should be given the option to avoid such suffering.\nWhile I may agree with the principle of assisted dying, and the strengths of the many important and legitimate arguments in favour, I am not yet sufficiently satisfied that the Bill provides strong enough safeguards against misapplication. Until it does, I cannot in good conscience support it. Until I can, with total confidence, be reassured that the most vulnerable people in our society are fully protected, I will not be able to vote for this Bill.\nAnother important factor that has influenced my decision is that I believe assisted dying should never become an alternative to high-quality palliative care. This should be a genuine option and choice for people, and with the current state of the NHS, it is sadly not. People deserve dignity in dying and should always receive the best care, however they decide to approach the end of life.\nThe sad reality is that, currently, access to good palliative care in the UK is a postcode lottery and too often dependant on individuals having a loved one to advocate for them. I don’t believe the Bill sufficiently protects those with disabilities, or poorer families who can’t afford or access palliative care. I also remain concerned that this Bill in its current state does not safeguard enough against coercion, or people feeling like a burden.\nI may consider voting for this in future if all my concerns are addressed, as I agree with the principle of giving people a choice. However, as a legislator, it’s right and fitting that I vote on this Bill as it stands in front of me right now, and in the current circumstances – not what it might or could evolve into in future. With this in mind, any assisted dying legislation must be totally and completely water-tight for me to vote in favour. I do not feel we have reached this point yet. As it currently stands, I believe the practicalities of implementing this Bill do not satisfy necessary safeguarding needs.\nI have hugely valued hearing the varied perspectives of my constituents on this critical issue, and the arguments put forward on both sides have really informed my deliberations. Thank you to all who have taken the time to contact me.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_mansel-park-primary/content_99.html": "As the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nThat’s why I was absolutely delighted to hear about the fantastic achievements of pupils from the Learning Federation Partnership of Schools in the recent National Reading Champions Quiz.",
  "https_satvirkaur_info_/https_satvirkaur_info_maiden-speech/content_107.html": "It was an honour to give my Maiden Speech in Parliament today on my favourite topic… Southampton!\nSouthampton has made me who I am. It’s the place I was born and bred and have always lived! You are the very best of me and I am the product of every opportunity you have given me.\nEvery day, in the mother of all Parliaments and beyond, I will champion our great city, fight for it and work tirelessly to help us reach our enormous potential.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_photographic-reconnaissance-units/content_104.html": "Satvir Kaur, Member of Parliament for Southampton Test, has joined the campaign to commemorate the brave pilots and navigators of the Photographic Reconnaissance Units (PRU), who served during the Second World War, and looking to find the living relatives of these local war heroes.\nThe PRU, which was tasked to provide up-to-date intelligence to strategically plan the Allied actions in the war, was formed on the 24th of September 1939 and throughout the Second World War it operated highly dangerous, clandestine photographic reconnaissance operations over all theatres of operation, and captured more than 26 million images of enemy operations and installations during the war.\nThe ‘Spitfire AA810 Project’ has therefore led the campaign to establish such a memorial in central London. Among those who served, and died, in the PRU were Southampton born Leonard Grieb and John Merrifield.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_satvir-kaur/content_28.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.\nAs the MP for Southampton Test, I have the privilege of meeting and hearing about the achievements of so many talented young people of all ages across our city. Whether in schools, at community events, or in Parliament, I always want to champion the incredible potential of our children and encourage them to aim high.\nSouthampton gave me so much growing up as a child from the inner city on free school meals, and I want to ensure that this new generation are supported too.\nI would like to thank everyone who signed the petition to keep the Lloyds banking branch on Shirley Road open. While it is disappointing that the bank branch will sadly close its doors for the final time on May 7, 2025, your support has played a crucial role in highlighting the importance of this vital service on Shirley High Street.\nThanks to the pressure from the petition, Lloyds has assured me that it will step up to ensure the community receives the necessary support during the closure, alongside installing a cash access solution so that residents can still deposit cash and cash cheques.\nOver 400 residents have expressed their backing for the campaign to save the branch, and I am incredibly grateful for this. I have been holding regular meetings with Lloyds to challenge them and the banking group’s data to ensure that they have considered the needs of all Shirley bank’s customers. As well as urging the banking group to consider a banking hub, an option that Lloyds has repeatedly refused.\nI am so pleased to share news thatNo Limits, an incredible youth services charity in Southampton, has been awarded £58,000 in new government funding to support young people in the city.\nThe funding is part of a wider Labour Government initiative to improve the mental health of young people across England, with a focus on early intervention and specialist support. No Limits is one of 24 Early Support Hubs across the country set to receive a share of £7 million allocated to mental health services for young people.\nHaving heard heart-breaking stories from a number of resident groups in Southampton, I have joined a group of MPs working together to stand up for leaseholders.\nAs part of this work, I have signed a joint letter to property management company RMG demanding better for residents. Sadly, too many leaseholders and renters continue to face substandard living conditions, all while paying sky-high service fees for work that either doesn’t get completed or is poorly done.\nI have been holding landlords and property management companies accountable for constituents, and I will keep pushing for change. From calling out bad landlords and freeholders in Parliament and achieving rent freezes for Compass Point in Redbridge, to holding Abri to account and securing an action plan for residents in Portswood, I’m fighting hard on this issue.\nWith growth being the government’s central mission and this region being placed on the priority programme for devolution, we have a once in a generation opportunity to finally stop talking about Southampton’s huge potential and start delivering on it.\nIt’s was great to officially welcome investors and partners last week to Southampton’s Renaissance Vision and Prospectus Launch.\n2881fa4f-7a94-4236-97d5-81af02f0b991\nd86b1d52-1d7f-479a-a0d6-f76526dd935f\n126894b4-26c6-449c-bf75-f374745a4f45\nc14f20c5-6979-4c24-973c-abc43d6c6b00\ndd96b18b-14fa-46d7-a160-4fc9e0bb827e\n4e5937d3-76ea-449b-9dc2-4c1b1575957c\n6a07d194-9a59-41bf-b182-435b64cc5e9e\n3ebcd818-e37e-43ff-83e2-60d996474c91\n94d671eb-7735-4312-9b19-fc0949794af4\n235c2720-0577-47c6-93e7-767419a9069b\n464ec279-44cb-4172-a84b-1f3e2f92198d\ndda9913f-80a7-4db6-a314-4a64a2341a67\nI’m proud to have played my role in setting up and currently chairing Southampton Renaissance, that brings together key city institutions, everyone in the same boat rowing in the same direction.\nFrom growing our globally important maritime sector, to cementing us as a destination city, to being at the heart of innovation and creating the jobs of the future – Southampton is open for business, and I’m pleased so many are looking to invest and become invested in our amazing city and incredible people.\nThe Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.\nI was concerned to hear from a constituent recently about her experience with sepsis. She fell ill with sepsis in Spring last year and is, devastatingly, still suffering from the effects. She tells me that her life has altered dramatically.\nShe needs a CPAP machine to breathe at night and will need to use it for the rest of her life. She has post-sepsis syndrome, where she has extreme fatigue and is unable to return to her previous job. Apparently 40% of people who develop sepsis are estimated to suffer physical, cognitive and/or psychological after-effects, so she is one of many suffering in silence.\nShe tells me that people often think nothing is wrong with her as she ‘looks fine’, but post-sepsis syndrome includes extreme fatigue and a number of physiological and physical symptoms. Muscle pain, poor sleep, short-term memory loss and arrhythmia (when the heart beats in an irregular rhythm) are all symptoms that can last well beyond the acute phase of the illness. For my constituent, the lack of understanding about her condition from others leaves her feeling even more fatigued and misunderstood.\nSepsis is one of the least well-known medical conditions, and the number one cause of preventable death in the world. It’s tricky to diagnose and can manifest in different ways depending on a number of factors, part of the reason why it’s so hard to spot. But, having heard about the horrendous experience of my constituent, I’ve been making myself more aware of the condition and wanted to share what I’ve learned.\nA new year brings new change, and there’s a big one on the horizon- devolution. It’s something that has been spoken about for more than a decade but never delivered within our region. I’m pleased that under this new Labour Government, it could finally become a reality. Everyone talks about Southampton’s huge potential, and this will offer a really exciting opportunity to help deliver it. It’s why I’ve been backing this throughout, both when I was in local government and now in Westminster, speaking to Ministers about how Southampton can benefit from it. In a nutshell it means more powers and more money for our city and region.\nI believe that more decisions about our area should be made more locally, by communities that they will impact, rather than always coming from Whitehall, which can often have a top down, one size fits all approach. This government believes that local people, whether you live or work here, better understand the unique challenges and aspirations of our communities.\nThis will be the biggest local government reorganisation in a generation, and local councils in the Solent region, including Southampton, have now submitted a formal request to be included in the Government’s Devolution Priority Programme. This is now being reviewed, and we will hopefully have further updates soon.\nIt’s that time of year, and while many of us are gearing up for Christmas, this past week I’ve been busy with one of Southampton’s most unwelcome Christmas traditions! The water supply disappearing. Southern Water caused utter chaos and concern when their water supply to thousands of homes stopped due to an issue that arose while cleaning and updating the Testwood Water Supply Works in Totton.\nSouthern Water’s handling of it, has been quite frankly appalling. The lack of water stations in Southampton, the confused communication from the Southern Water team, and even when these minimal water stations were set up, there was confusion over when they opened and closed, as well as only being able to access them with a car. Once they were “up and running” they ran out of water, leaving many stranded having waited hours. Those that could not get to a water station, and particularly the vulnerable (who were meant to be on a priority list for Southern Water to hand deliver to their homes!) – were left in limbo, waiting for water they were promised, that never came or came too late. At one point there were more than 20,000 people on that list.",
  "https_satvirkaur_info_/https_satvirkaur_info_labour-win-back-control/content_88.html": "WE DID IT! I am delighted that Labour took back control of Southampton City Council at the local elections in May 2022 and I can’t wait to get to work as your new Leader.\nWe are eager and ready to start delivering for all our communities and I personally want to say a huge thank you for everyone’s support.\nOver the last 12 months, we refocused our campaign and set out a new vision for Southampton. We spoke to over 30,000 voters and listened to their concerns.\nA New Vision For Southampton\nLabour will ensure that every pound the council spends works for you, making Southampton and its neighbourhoods places to be proud of, where individuals and families can grow and prosper in a safer, greener and more affordable city.\nWe won’t waste public money on fixing private roads, but will invest in our communities with cleaner streets, improved pavements and greater enforcement on dangerous parking and fly-tipping. We will restore the investment into our district centres which the Tories slashed, ensuring no neighbourhood is left behind.\nEveryone deserves to feel safe in their home and local area and Labour’s £1.5m Safer Neighbourhoods Fund will help communities feel safer, prevent crime and tackle anti-social behaviour.\nLabour takes the climate crisis seriously, and we will invest in our green spaces, improve recycling and make our homes more energy efficient to keep bills low.\nAbove all we know the cost of living crisis affects everyone, and one-off loans won’t touch the sides. Labour will build more desperately needed council homes, make Southampton a Living Wage City and focus on local jobs and training for young people. We want better travel options, and will make public transport cheaper and more accessible, particularly for families, with a new family travel card.\nThanks to you\nListening to you throughout the year has helped shape our New Vision for Southampton.\nAs the new Labour Leader of the council I look forward to working with you all to deliver the change we have been fighting so hard for.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_labour-government/content_43.html": "The Government launched Change NHS to hear your views, experiences, and ideas, which will shape a new 10 Year Health Plan for England. Since then, the biggest-ever conversation about the future of the NHS, with over 220,000 contributions from the public and health and care staff, has taken place.\nI was proud to host a workshop at Oakley Road in Southampton, bringing together colleagues from Hampshire and Isle of Wight Healthcare NHS Foundation Trust’s Southampton and South West (SSW) division, along with our incredible local community, to hear how we can best protect and future-proof the NHS for everyone who works in it and uses it right here in Southampton.",
  "https_satvirkaur_info_/https_satvirkaur_info_tag_bevois-town-primary-school/content_9.html": "Labour is delivering on our promise to roll out free breakfast clubs to all primary school children, starting with 750 early adopter schools beginning in April this year.\nDetails of early adopter schools were announced earlier his week and I am absolutely delighted that a school in Southampton Test will be taking part in the first wave.\nA massive congratulations to Bevois Town Primary on their successful application!\nThe government has chosen Bevois Town as one of the first to offer free, daily breakfast clubs as part of our landmark scheme that will ensure children are school-ready and parents are better off.",
  "https_satvirkaur_info_/https_satvirkaur_info_public-health-funding-southampton/content_30.html": "The Labour Government is increasing funding for public health services in Southampton, as part of a £200 million national funding boost to the Public Health Grant – the biggest real-terms increase after nearly a decade of reduced spending under the Conservatives.\nAs part of Labour’s plans to improve health outcomes across the country and build healthier communities, local public health services will be given more money to deliver prevention programmes, tailored to their residents.\nSouthampton City Council will receive more than £20 million to help drive key health services, from help to stop smoking to addiction recovery and children’s health, and to help fund family and school nurses, sexual health clinics and other public services in the local area.\nThe Government is currently running a national conversation to help build a health service fit for the future and shape a new 10 Year Health Plan for England. The plan will set out how we can focus on preventing sickness, not just treating it, with the investment announced in line with this aim.\nAfter nearly a decade of cuts under the Tories, I am delighted that Labour continues to deliver on our promise to improve health outcomes across the country as part of our Plan for Change.\nThis funding will help drive key health services in our community, prevent people from falling into ill health, and relieve pressure on the NHS. I’m so pleased that this Labour Government is delivering for our community in Southampton Test.",
  "https_satvirkaur_info_/https_satvirkaur_info_labour-manifesto/content_113.html": "I’m really proud of Labour’s manifesto for change, launched yesterday as we marked the half-way point of this General Election campaign.\nCategories\nI’m really proud of Labour’s manifesto for change, launched yesterday as we marked the half-way point of this General Election campaign.",
  "https_satvirkaur_info_/https_satvirkaur_info_vote-labour-this-thursday/content_58.html": "Election Week is finally here. Our country, and Southampton, is at a turning point.\nWe owe it to ourselves, our communities and future generations to get the job done and consign this Conservative Government to history. To finally turn the page on their Tory failure and chaos, and to offer hope and change with a new Labour Government.\nIf we form a government, Labour will start a process of renewal, to rebuild our country, and I will work my socks off to make sure Southampton gets a good slice of the pie.\nIf you want change, you have to vote for it\nBut, before we get there, we need to get out and vote! If you want a better future and if you want change – you have to go out and vote for it.\nWe cannot leave anything up to chance. We cannot risk waking up on Friday to another five years of the Tories when we could wake up to a summer of change.\nMake a plan\nMake a plan to vote on Thursday. Find your Polling Station. Put your photo ID in your wallet and remember to bring it with you to vote.\nDo you want to vote tactically to keep the Tories out? All the tactical voting websites point to the same answer: Vote Labour.\nThe smaller parties can’t win here and they can promise you the moon on a stick because they know there is no chance their policies will be tested in government. Don’t waste your vote and risk a Tory win.\nVote Labour\nSouthampton is my home. It’s where I was born, grew up and have always lived. I know people in our city are hugely ambitious for themselves, their families and Britain’s future. If I’m your MP, I will be with you all the way.\nA better future is possible – but only if we vote for it.\nVote for change. Vote Labour!"
}