{
  "http_jakewelsh_blogspot_co_uk_/http_jakewelsh_blogspot_co_uk/content_1.html": "The first time I really ever heard much detail about the high speed rail project known as HS2 was about a decade ago when it was discussed at a Green Party conference. Being a fairly new member of the party, I tended to just agree and support Green Party policies. I bought into overly simple arguments against HS2. As the years have passed I've listened to other arguments and dived a bit deeper into HS2 and it has changed my view from somewhat opposing HS2 to somewhat supporting HS2. Let me explain why here.\nStarting Assumptions\nBefore we begin there are some assumptions I hold when looking at these issues. Namely:\n- We are in a climate emergency and rapidly need to reduce global greenhouse gas emissions.\n- Personal car travel and flights are 2 of the biggest contributors towards greenhouse gas emissions when it comes to transport and therefore reducing flights and car journeys is a very helpful step for lowing greenhouse gas emissions.\n- Travel poverty is one of the biggest and most underestimated forms of poverty.\n- Demand for travel will remain high in the future decades, even if a small portion of the population start to work from home.\n- People will travel by car and by plane if public transport options are unreliable, expensive and inconvenient. Improvements to public transport lead to people leaving their car at home and traveling by public transport instead.\n- Rail (light and heavy) tends to be one of the quickest and most reliable forms of public transport.\nAll of these assumptions lead to my grand assumption that investing in improving rail links between towns and cities across the UK will both bring hundreds of thousands of people out of transport poverty and it will take hundreds of thousands of cars off the road which will play a vital role in the fight against climate change. Those are assumptions I have always held, even before HS2 was ever thought up. Feel free to disagree with my assumptions, but I hold these assumptions based on the evidence I have seen.\nWhat I got wrong about HS2\nThere were a number of things I used to believe about the HS2 project, which I no longer believe. I used to believe the purpose of HS2 was to provide quicker routes between London and other major cities in the UK to benefit predominantly wealthy business executives. Manchester to London is already a fairly quick route, why does it need to be 20 minutes quicker I thought? Wouldn't it be better to spend that money on improving local and regional lines across the county? I believed some of the figures about how destructive building HS2 would be. I have since changed my mind on all of these over-simplified arguments against HS2 after looking into the issue further.\nHS2 and the need to improve the rail network in the North\nOne of the biggest misconceptions about HS2 is that the benefit of the line will be focussed on London as it allows quicker access into the capital. In fact, many believe that the whole purpose of HS2 is to give rich business executives a quicker route to central London. But this over-simplistic take on HS2 misses out the real purpose and benefit of HS2.\nHS2 is about freeing up capacity for local and regional services by removing long distance trains that only stop at major cities off the track that they share with local and regional lines so that those lines receive a massive increase in capacity. High speed trains require that all other trains get out of the way so sharing the same track massively reduces capacity. This is particularly noticeable around bottlenecks in major city stations such as Manchester Piccadilly, Birmingham New Street and Leeds. Both Birmingham and Leeds are getting brand new stations serving HS2 which will only accelerate the effect of freeing up capacity on existing lines.\nI accept and support that other things need to happen to improve local and regional routes everywhere such as electrification of more lines and opening new lines where it makes sense. But that does nothing to solve the bottlenecks which restrict frequencies of trains, only new track will achieve this. At any rate, we can do all of these things at the same time. The only thing stopping us is political will.\nWho will use the HS2 line?\nAnother big misconception about HS2 is that it will only benefit rich business executives will use HS2 to get into London quicker. This in fact is just not the case. The majority of long distance rail trips in the UK are for personal trips not business trips. Students going home to their family. People going to visit their friends. Football fans traveling to see their team play an away match. People spending a weekend in London while catching a show or a concert. Leisure trips to places all over the UK. This is the bulk of what the HS2 line itself will actually be used for. These are trips that are far too often done by car when they could easily be done by rail instead.\nSo the question of who will benefit from actually using the line isn't predominantly rich business people. It is predominantly working class and middle class people from all over England, including many working class people in London. We need to stop thinking of London as a place full of wealthy individuals who have more resources privilege and influence than the rest of us. The people of London are very similar to the people of Birmingham or Leeds or Glasgow. London is a diverse city with massive working class communities. HS2 has the potential to bring thousands of working class Londoners out of transport poverty.\nHS2's impact on rail fares\nThere can be no doubt that since the privatisation of rail in the 1990s that the cost of train tickets in the UK has gone up and up every single year. The affordability of rail is a major barrier for a lot of people to traveling by rail. Anti-HS2 campaigners argue that HS2 will be unaffordable as current rail tickets are, but that's not taking a look at the bigger picture.\nThere are many policies that we can change that would impact rail fares such as re-nationalise the railways, and we should absolutely do that. But one thing thing has a big impact on rail fares is the limited capacity on busy commuter lines. If the trains are full during peak times, then the government and rail companies can get away with charging more for tickets. As capacity increases, more frequent trains can run on these commuter lines and that means more seats to fill. Ticket prices will then fall in order to fill these extra seats. This is what HS2 can achieve due to the extra capacity created on many different lines up and down the country, particularly at bottlenecks around major cities. So while we continue to argue and fight for the re-nationalisation of the railways and for government to lower ticket prices, HS2 will cause a lowering of ticket prices by increasing the supply of rail services in the UK.\nWhat about the impact on flights?\nHS2 currently plans to create 3 brand new stations at or near to airports. Manchester Airport is to get a second train station for HS2 while the HS2 station Birmingham Exchange will have a shuttlebus to Birmingham International Airport and the East Midlands Hub being 10km away from East Midlands airport has proposals for future rail links between the airport and the HS2 station. There have also been now abandoned plans to have spur of HS2 go off to Heathrow Airport from London.\nFor me these airport stations are the modt controversial part of HS2 and if it was down to me I would scrap the airport links. However, I have heard some arguments that these stations are a good thing for a few reasons.\nInternational travel will return in a post-pandemic world. It won't quite be as frequent as it used to be and technology will reduce the need for international business trips. We can be fairly sure that the majority of international travel will continue to take place via flying. HS2 will reduce some flights between the Midlands, the North and other areas of the UK and mainland Europe. This is because HS2's final destination of London Euston is less than a 15 minute walk to St Pancras International station where HS1/the Eurostar goes to Paris onto Brussels. This makes it much quicker to travel from say Manchester or Leeds to Paris via trains. It will be a limited effect and it will depend on both the pricing of tickets and the ease of travel to Europe as post-Brexit talks with the EU change rules for UK citizens, and also vice versa. But the possibility will still be there to get a train in Manchester and then be in Spain or Italy or Germany on the same day. If the cost is the same or lower than flying it will become a much more attractive proposal to travel by rail instead of plane.\nHS2 and other future high speed lines in Britain will really have a large impact on the number of domestic flights here in the UK. In the pre-pandemic more than one 5th of passengers flying from a UK airport was doing so to another UK airport. There were hundreds of domestic flights a day in the UK. HS2 and future high speed lines will reduce this massively for 2 main reasons.\nFirstly, people traveling long distance in the UK will find it more reliable and accessible to travel by rail than by air. The people who do travel between cities within the UK rather the taking a train do so for 2 reasons, for cost and for speed. HS2 addresses both cost and speed. Instead of someone traveling to say Manchester Airport, going through boarding and waiting for a flight to Heathrow , that flught taking an hour and then taking a train from Heathrow to Central London, that person could walk onto a scheduled HS2 train at Manchester Piccadilly and arrive at London Euston an hour and 15 minutes later, right I Central London. If HS2 links up with future high speed lines to Glasgow and Edinburgh or high speed lines south to Bristol or even Exeter then this impact then the impact on reducing domestic flights will be much greater. Pre-pandemic there were around 170 flights a day between London and Glasgow or Edinburgh and high speed can make these flights redundant.\nThe other reason why HS2 will impact on domestic flights will be reducing connecting flights. If someone travels to London from America, they could find it cheaper or quicker to fly to Manchester and then fly from Manchester to London. Instead, this person could catch a train from the HS2 station at Manchester Airport and get to Central London quicker than catching a connecting flight from Manchester to London and then travelling to Central London from that airport.\nBut won't having more stations at more airports make flying in general more accessible? Well, yes it will, but not enough to have a significant impact on the number of people who take flights. People taking international flights would still be taking them regardless of HS2 being built. What it will do is change how people travel to these airports.\nAlong with these new HS2 stations at or near these airports, there are connected plans to expand existing light rail and bus networks to serve these new HS2 stations and better serve the airport. The predominant method of traveling to airports for international travellers is either by car or by taxi. With improvements to rail, light rail and bus connections it will mean a lot more people leave their cars at home and not bother with taxis. There is also scope to add cycle routes around the airports as well.\nThis will also make a huge difference for local workers and residents. Tens of thousands of people work at or next to airports in the UK many of whom are low paid workers, working in restaurants or hotels or retail or as cleaners. Tens of thousands of people also live very close to airports. Improving public transport links to airports will allow many people to leave their car at home and bring people out of transport poverty. I personally have noticed this with the Manchester Airport line of the Manchester Metrolink tram network being used by thousands of local residents and workers employed in connection to the airport. This tram line will be getting an extension to the new Manchester Interchange HS2 station, and then looping around the rest of Wythenshawe (the area of Manchester which the line runs through) to create a loop covering a much larger area including stopping at the local hospital.\nNorthern Powerhouse Rail and future high speed lines\nOnce HS2 is completed the next planned high speed rail line to open will be Northern Powerhouse Rail (NPR) otherwise know as HS3. This is a planned high speed line firstly from Liverpool to Manchester, and then from Manchester to Leeds. There are other plans connected with NPR such as using the HS2 line from Crewe to create a new high speed line to London but from Liverpool and upgrading the line between Manchester and Sheffield and onwards to Hull.\nNPR proposals haven't been finalised but they rely on HS2 infrastructure in 2 main locations. Firstly, the Liverpool to Manchester leg of NPR uses HS2 tracks and stations starting somewhere between Crewe and Manchester Interchange/Airport. NPR will then use HS2 infrastructure all the way to Manchester Piccadilly. Secondly, the NPR proposal to create a London to Liverpool high speed line relies on HS2 infrastructure between London and Crewe. This will then use NPR infrastructure on the way to the final station at Liverpool Lime Street. NPR will use the HS2 station at Manchester Airport (Manchester Interchange) and may well use the HS2 platforms at Manchester Piccadilly. The most likely proposal between Manchester and Liverpool stops at Warrington, but there is a proposal for NPR to stop at Crewe in which case it could share the HS2 platforms at Crewe. In short, Northern Powerhouse Rail will massively benefit from both using HS2 infrastructure and from the connections with HS2.\nNorthern Powerhouse Rail will have a similar impact as HS2 on freeing up capacity on existing lines. It will take the express lines between Liverpool and Manchester, and between Manchester and Leeds off the existing track shared with local commuter trains that stop at all the stations between the cities and put the trains on new track. A big difference though is that many people do commute daily between these cities and therefore quicker rail links will make a real difference when people are deciding to commute by rail or by car. Plus it will have another impact on lowering ticket prices by increasing capacity. Trains traveling from Liverpool to Leeds will take roughly 51 minutes instead of 1 hour and 46 minutes that they take at the moment. Those trains will also be 6 times an hour instead of the current 4 times an hour.\nOther future high speed rail lines could really benefit from HS2. In fact, many could not work without HS2. High speed lines from Aberdeen, Glasgow and Edinburgh to cities in the south like London will use HS2 track. High speed lines from Bristol or Exeter to Newcastle or even to Scotland will use large parts of HS2 between Birmingham and Leeds (or possibly a new line through York instead of Leeds). This extended network of high speed lines will only further add to the transport revolution that HS2 begins. Domestic flights will be mostly killed off if we could get a train from Aberdeen to London in maybe 3 hours instead of the current 7 hours it takes.\nWhat about the environmental destruction in building HS2?\nI'd be slated quite heavily if I didn't address most people's biggest concern with HS2, the impact that building the line will have on the environment. This obviously is a big concern and one that we should try to address. Nobody wants to see trees cut down or any loss to biodiversity. Every decision about where the route will be should take this into account. Whilst some of the route is already being built upon, there's a lot of the route that work hasn't been started on and it would be possible to alter the route to avoid certain areas. Every decision comes with consequences though. Avoiding a woodland somewhere might result in needing to knock down some houses elsewhere. Alternatively, making the route so that it avoids all trees and all buildings may just make the line extremely impractical and so winding that it negates all the speed benefits from the line and therefore the demand for long distance rail trips might just carry on the existing overcrowded routes.\nBut the environmental impact of building the line was never my biggest concern, it was about allocation of funds to different parts of the rail network. In order to build any infrastructure project destruction of some kind needs to take place. For me it's all about asking do the benefits outweigh the negative impacts? Will we be in a worse place or a better place if it's built? Can we achieve the same result but for less destruction? Is the destruction as bad as it's claimed?\nWhen I think about what I consider to be the alternative to upgrading and modernising our railways it is without a shadow of a doubt road building. We cannot get away from the fact that people want and need to travel and will continue to do so. If we don't improve public transport then the demand for driving and road building will continue as the main mode of travel. Building new motorways and roads will, like HS2, lead to woodlands being destroyed.\nAs it stands, about one 10,000th of the UK's ancient woodland is set to be destroyed by HS2 being built. HS2 will plant more trees than will be cut down (although ancient trees do far more good for soaking up CO2 than new young trees). There have been plans to build cycle infrastructure alongside parts of the HS2 routes, although some of this has been scaled back due to cost. I have come to the conclusion that HS2 has done what it can to easily reduce it's impact on the environment, that the alternative is to build more roads and that building HS2 will reduce the amount of greenhouse gas emissions by taking tens of thousands of cars off the roads each year.\nIn Conclusion\nHS2 is coming, whether we like it or not. Opposing HS2 will not stop that or have much impact on how it is to be built or be operated. A high speed rail network that links in with existing conventional rail across the country will bring about a public transport revolution that is much needed. It can take part at the same time as upgrading existing rail lines or building new lines. The money can be found to fund all of it. We just need the political will in this country and it can happen.\nI believe that HS2 will bring tens of thousands of people out of transport poverty and that it will take tens of thousands of cars off the road. I believe strongly that this will be of a better benefit to the environment than not building it, despite the destruction involved in building HS2. Transport modal shift needs to happen and we need to get people out of their cars and off planes, and rail is one of the only ways to achieve this. HS2 and further improvements to the rail network will allow people to live further away from their work place and therefore will reduce the housing crisis in major cities.\nHS2 isn't an issue I'm willing to die on. There's lots of other things that can be done to bring about a similar public transport revolution without building HS2 but all scenarios benefit from HS2 being built. All attempts at improving rail connectivity would only just benefit from having HS2. We absolutely need a public transport revolution in the UK and it is vital to invest in the rail network in order to achieve that. HS2 will only be a positive part of that.\nSo I've joined a group called Greens 4 HS2 who campaign to change the Green Party policy to support the development of HS2. Check out our website here:\nhttps://hs2.green/"
}