{
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_pmqs-we-need-action-not-just-words-to-tackle-the-scourge-of-spiking-says-judith/content_88.html": "PMQs: “We Need Action, Not Just Words, to Tackle the Scourge of Spiking” – says Judith\n- judithcumminsmp\n- Mar 6, 2024\n- 2 min read\nJudith has today called on the Prime Minister to take further action to protect victims of spiking and bring perpetrators to justice.\nCurrently, just 1 in 400 cases of spiking that are reported to the police result in a criminal charge.\nSuccessful prosecution relies on having sufficient evidence to mount a case but, for spiking victims, that vital forensic evidence is often not captured quickly enough.\nQuestioning Prime Minister Rishi Sunak at PMQs today, Judith highlighted that there was no consistent policy to provide testing for victims of spiking when they arrive in hospital:\n“The NHS does not have a uniform policy for the screening of suspected victims of spiking at A&E. We can pass all the laws we want in this place, but to achieve justice, this forensic evidence is vital.”\n“Will the Prime Minister commit to ensuring that hospital emergency departments have a statutory obligation to take forensic samples from these victims?”\nResponding, Prime Minister Rishi Sunak agreed that spiking is an ‘appalling and violating crime’ saying: “We want to make sure that the existing laws recognise the threat that spiking poses. I’ll make sure that we look into the issue that she raises and write back to her.”\nWhile some drugs used in spiking can remain detectable for several days, others can leave the body within 12 hours, or even sooner.\nSpeaking afterwards, Judith highlighted the importance of speed in supporting survivors:\n“The very nature of the horrific crime of spiking means that essential forensic evidence can leave the body in the matter of hours. The sooner this evidence is collected, the better the chance that the vile perpetrators of this crime can be prosecuted with the full force of the law.”\nJudith added: “We need a clear pathway that supports people from the very moment spiking is suspected to ensure they get the justice they deserve. We need action, not words to tackle the scourge of spiking.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_editorial-in-ukraine-i-saw-the-human-cost-of-this-war/content_22.html": null,
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_comment-next-closure-worrying-and-difficult-news-for-staff/content_44.html": "Comment: Next closure worrying and difficult news for staff\n- judithcumminsmp\n- Nov 17, 2023\n- 1 min read\nResponding, Judith said:\n\"This is worrying and difficult news for staff at Next Distribution’s facility on Toftshaw Lane.\"\n\"I have been in contact with Next Distribution and USDAW, the recognised trade union representing workers on the site, and I will continue to support staff as consultations continue.\"\n\"Affected workers need reassurance that they will get the help they need to access other roles within the business or the support to find new jobs elsewhere.\"",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_contact/content_11.html": "How to Contact Judith\nI work hard to represent all constituents within Bradford South. I run regular surgeries within Bradford South, which you can request by contacting me directly. If you would like to get in contact with me, please complete the following steps:\n1. Check that I am your MP by clicking here\n2. Please read our Privacy Policy by clicking here\n3. Please use the below contact form, or contact details, to send me a message.\nGeneral Contact Details\nEmail:\njudith.cummins.mp@parliament.uk\nTel (Constituency Office):\n+44 (0) 1274 924280\nPost:\n26-28 Church Bank,\nBradford\nBD1 4DZ\nContact your local Labour Councillor\nHere you can find your local Labour Party Councillors within the constituency of Bradford South, organised by wards.\nTo view councillors across Bradford City Council, click here.\nGreat Horton Councillors\nCouncillor Joanne Dodds\nTelephone(Res): 01274 576624\nTelephone(Bus): 01274 432276\nEmail: joanne.dodds@bradford.gov.uk\nQueensbury Councillors\nRoyds Councillors\nWibsey Councillors\nCouncillor Ralph Berry\nTelephone(Res): 01274 770869\nMobile Phone: 07976 382993\nEmail: ralph.berry@bradford.gov.uk\nWyke Councillors\nCouncillor Tom Hughes\nMobile Phone: 07484 412630\nEmail: tom.hughes@bradford.gov.uk",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-supports-small-businesses-in-bradford/content_51.html": "Judith supports Small Businesses in Bradford\n- judithcumminsmp\n- Dec 5, 2023\n- 1 min read\nJudith is encouraging people in Bradford to ‘shop local’ and celebrate the contribution that small businesses make by taking part in the 10th Small Business Saturday last weekend.\nSmall Business Saturday aims to bring a boost to local shops, garden centres and cafes right across the country. In recent years, it has had some success with consumer spending on Small Business Saturday being boosted to over £1 billion.\nJudith Cummins MP said: “I’m backing our local businesses, because running a small business is never easy. The cost of living has both reduced consumer spending and hiked energy costs to pile even more pressure on business owners.”\n“I thank them for the vital contribution they make to our local economy.\n“There are lots of great businesses in Bradford South like Tong Garden Centre and the fantastic businesses and volunteers who organised Wibsey’s Christmas Market.\nSmall Business Saturday is a fantastic way of raising awareness and giving our local shops the long term boost they need.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-cummins-mp-presses-secretary-of-state-for-position-on-nato-fighter-jet-coalition/content_61.html": "Judith presses Secretary of State for position on NATO ‘Fighter Jet Coalition’\n- judithcumminsmp\n- Jan 31, 2023\n- 2 min read\nUpdated: Dec 5, 2023\nJudith Cummins MP has called on the Government to work with NATO allies to ensure a long-term strategy is in place to support Ukraine in its fight against Putin’s illegal invasion.\nSpeaking in Parliament, Judith recalled her experiences in Ukraine, where she joined a humanitarian mission, and visited the newly-liberated Kharkiv region with a Ukrainian volunteer unit:\n“During my visit, Ukrainian officials were very clear about their need for increased military support.”\nFollowing the German Chancellor’s statement on Sunday rejecting the idea of sending German fighter jets to Ukraine, Judith pressed the Secretary of State for the UK’s position:\n“With the US reportedly discussing the creation of a ‘fighter jet coalition’ with Ukraine, and the German Chancellor currently ruling out sending German fighter jets to Ukraine, what assessment has the Government made regarding such a coalition with our NATO allies?”\nResponding, Defence Secretary Ben Wallace MP did not rule out such a coalition, saying: “we will keep our minds open all the time on what it is possible to do next”.\nCross-party support has meant that the United Kingdom has led the way in its material and diplomatic support of Ukraine. Most recently, the UK announced it would send fourteen Challenger 2 main battle tanks and other resources to Ukraine. This was followed by similar pledges from the United States, Germany and other NATO countries. However, this represents only fraction of support that President Zelenskyy has said Ukraine needs in the form of tanks, aircraft and weapons to continue to defend itself against Russian aggression.\nSpeaking afterwards, Judith said:\n“I have seen the resolve of the people of Ukraine in the face of Putin’s atrocities. The UK must continue to provide the necessary military support to enable Ukraine to face off Russian aggression.\nThe United Kingdom and its NATO allies must develop a long-term, strategic plan to ensure it is able to provide sustained military and humanitarian assistance to Ukraine throughout 2023 and beyond.\nThis is not only necessary to protect the people of Ukraine; this conflict is having huge impact right here in the UK, as soaring gas and energy prices continue to worsen the cost-of-living crisis.\nThe United Kingdom must continue to play its part”\nhttps://twitter.com/JudithCummins/status/1620365880533340160",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_wibsey/content_74.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith supports Small Businesses in Bradford\nBusiness\nDec 5, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-challenges-secretary-of-state-on-low-spiking-conviction-rates/content_116.html": "Judith challenges Secretary of State on low spiking conviction rates\n- judithcumminsmp\n- Mar 6, 2023\n- 1 min read\nUpdated: Dec 5, 2023\nJudith has spoken in Parliament after recently published figures showed that – between September 2021 and 2022 – there were 4,924 reports of spiking-related offences in the UK.\nBetween November 2017 and November 2021, however, the Ministry of Justice recorded just 40 convictions for such offences.\nIn January, a Home Office Minister confirmed\nthat the Government did not consider there to be “any gap in the law”, adding that spiking was adequately covered in legislation by several other offences.\nJudith asked the Secretary of State:\n“Does he agree with the Home Office Minister’s assessment that there are no gaps in the law relating to spiking, and if so, how can this low conviction rate be explained?”\nJustice Secretary, Dominic Raab, responded: “I think the challenge is less gaps in the law, and more evidential difficulties in bringing prosecutions.”\nJudith added:\n“The issue for the Government is that they are accepting that as the law stands, this terrible crime of spiking and subsequent criminality stemming from it is simply not getting prosecuted, let alone resulting in a conviction.\n“A stand-alone offence under law for spiking would enable more prosecutions and convictions.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_cost-of-living/content_85.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith attacks 'car-insurance rip-off'\nLocal News\nNov 30, 2023\n1 min read\nEditorial: This country needs a change\nLocal News\nNov 13, 2023\n3 min read\n\"A Conservative summer of job cuts\" - Judith tells Parliament\nBusiness\nSep 5, 2023\n2 min read\nEditorial: People work harder than ever - yet see less for it\nLocal News\nSep 4, 2023\n3 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_bradford-bulls/content_131.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith backs the Bulls after best season in years\nLocal News\nOct 27, 2023\n1 min read\nLevelling Up: Bradford left behind by this Government once again\nLocal News\nJan 19, 2023\n2 min read\nJudith wants Bradford at the centre of the next Rugby League World Cup\nLocal News\nOct 26, 2022\n2 min read\nJudith pushes Govt to commit to levelling up and regeneration in Bradford\nBusiness\nOct 21, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_rugby-league/content_134.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith backs the Bulls after best season in years\nLocal News\nOct 27, 2023\n1 min read\nLevelling Up: Bradford left behind by this Government once again\nLocal News\nJan 19, 2023\n2 min read\nJudith wants Bradford at the centre of the next Rugby League World Cup\nLocal News\nOct 26, 2022\n2 min read\nJudith invites Chancellor to meet to take forward £50m Bradford South regeneration bid\nBusiness\nOct 12, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-unites-mps-in-joint-letter-to-save-community-pharmacies/content_95.html": "Judith unites MPs in joint letter to save Community Pharmacies\n- judithcumminsmp\n- Jan 4, 2024\n- 2 min read\nJudith has written to Pharmacy Minister Dame Andrea Leadsom MP with the backing of 20 MPs from across the political spectrum to commit to making changes to support community pharmacies and the patients who use them across the UK.\nYou can read the full letter below:\nDear Minister\nAs Members of Parliament, we would like to raise our concern over the unprecedented pressures facing community pharmacies in England.\nSince 2015, core pharmacy funding has reduced by 30% in real terms, which has resulted in many pharmacies in our constituencies operating at a loss. These pressures have been compounded by inflationary pressures including on workforce and energy costs and medicine supply challenges.\nUnlike other sectors, community pharmacies cannot pass increasing costs onto their customers, as NHS funding accounts for 90% of their income.\nRecent figures from the NHS estimate that since October 2016, approximately 1,400 pharmacies have closed permanently, with many more withdrawing services, or reducing their opening hours. Evidence suggests that these closures have been occurring in areas with the highest levels of deprivation and need, and that other pharmacies are struggling to fill the gaps.\nWe are greatly encouraged that pharmacies will have a greater role to play in primary care through the Pharmacy First service. It will be beneficial to make greater use of pharmacists' professional skills to deliver more clinical services to patients closer to their home, and in doing so, relieve pressure elsewhere in the NHS.\nTo support the community pharmacy sector in the face of these pressures, we call for your urgent consideration of three measures:\nA commitment to working with the sector to create a fair and fit-for-purpose core funding model that ensures sustainability and properly rewards pharmacies for what they do.\nEffectively implement and develop the Pharmacy First service to allow patients to have walk-in consultations for minor conditions, providing accessible care and easing pressure on general practice\nBuild on other clinical service areas such as vaccinations, women's health, and long-term conditions management. Pharmacy can do much more contribute to key NHS priority areas and to help to deliver greater access for patients to health support.\nYours sincerely\nJudith Cummins MP\nVirendra Sharma MP\nDame Diane Johnson MP\nSir George Howarth\nDerek Twigg MP\nMohammad Yasin MP\nWera Hobhouse MP\nHelen Morgan MP\nSally-Ann Hart MP\nPeter Aldous MP\nDame Priti Patel MP\nDerek Thomas MP\nSir Peter Bottomley MP\nGreg Smith MP\nSteve Double MP\nDame Andrea Jenkyns MP\nRobin Walker MP\nSir Julian Lewis MP\nSelaine Saxby MP\nLia Nici MP",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-challenges-government-over-cost-of-food/content_102.html": "Judith challenges government over cost of food\n- judithcumminsmp\n- May 25, 2023\n- 1 min read\nUpdated: Dec 5, 2023\nJudith Cummins MP (Bradford South) has challenged the Government to lower costs of a family shop following news that basic ingredients like sugar had risen by nearly 50%.\nQuestioning the Government in Parliament, Judith asked:\n‘Sugar prices have risen a massive 47% in the past year, and industry experts predict it will rise again this autumn due to the high energy costs of extracting and refining sugar.’\n‘Will the Minister outline what steps the Government is undertaking to support the food and drinks sector throughout this period of extreme inflationary pressure, so that these costs are not yet again passed on to consumers?’\nResponding, the Minister acknowledged the pressures the industry was facing:\n‘We are very keen to help and support with new technology, with investment in genetic technologies to improve sugar beet yields, and we will continue to have those conversations.’\n‘We are very much aware of the pressures on global sugar prices which is why we need a thriving and productive sugar market here in the UK.’\nSpeaking afterwards, Judith said:\n‘We are in a period of high inflation, and the Government must act now to address this, so my constituents don’t have to struggle to feed their families.’\nhttps://twitter.com/JudithCummins/status/1661694568385900544",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_west-yorkshire-mayor/content_100.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith hosts street walk with Deputy Mayor Alison Lowe\nCrime & ASB\nSep 20, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_government-must-act-now-to-support-energy-intensive-businesses-and-protect-families-from-winter-b/content_90.html": "Government must act now to support energy intensive businesses and protect families\n- judithcumminsmp\n- Jun 9, 2022\n- 2 min read\nUpdated: Dec 5, 2023\nThis week in Parliament, Judith called on the Government to take immediate action to protect families and businesses from skyrocketing energy costs. Recent reports have warned that millions of families face blackouts this winter, while some businesses have seen a five-fold increase in their energy bills. Unlike consumers, business energy costs are not subject to an energy price cap.\nSpeaking in Business, Energy and Industrial Strategy questions, Judith said:\n“Two weeks ago, we found out that we have a huge surplus of natural gas but nowhere to store it, followed shortly by an announcement that as many as six million households will face power cuts this winter because of gas shortages.\nCan the minister give a guarantee here today that this Government can keep the lights on for both households and for industry this winter? A business in my constituency told me that their energy bills have soared from £7 million to £35 million – so what support is the government giving to energy intensive industries?”\nResponding, Business, Energy and Industrial Strategy Minister Greg Hands MP said the “Government is actively looking at storage” but that “the scenario she painted is an extreme scenario.”\nCommenting afterwards, Judith said:\n“The Minister said the scenario of skyrocketing energy costs I gave ‘was extreme’, but in fact it is the everyday reality for thousands of businesses and millions of families up and down the country who are worried about their jobs and their homes. These are real jobs in a real company and government should be able to answer a straightforward question for those key industries.”\nJudith added:\n“Hearing that ample gas supply is arriving at our ports only to be turned away due to lack of storage while energy bills are through the roof is nothing short of a disgrace. Last autumn, I raised our lack of gas storage and self-sufficiency directly with the Secretary of State and he reassured me that “the reason we are less reliant on storage is we have a wider source of energy supply”. Now, this has proved insufficient, the Government should have listened and acted on my concerns at that time. We need to urgently bolster the country’s strategic gas reserves while offering meaningful support to our energy intensive industries.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_editorial-to-stop-the-rot-in-nhs-dentistry-we-must-look-back-to-its-founding-principles-1/content_111.html": "Editorial: To Stop the Rot in NHS dentistry we must look back to its founding principles\n- judithcumminsmp\n- May 19, 2023\n- 3 min read\nUpdated: Dec 5, 2023\nThis column first appeared in the Telegraph & Argus on Weds 17 May 2023\nJust a few weeks ago, the country celebrated the Coronation of King Charles III. It was an event that reflected changing times, bringing together different communities from across the nation and Commonwealth, and representatives of all faiths and none. But the real spirit of the coronation weekend wasn’t in Westminster Abbey, nor on the balcony at Buckingham palace, it was in the people who came together to support each other and celebrate together.\nAll across Bradford and the country, in every neighbourhood, residents held street parties, and community and faith groups opened their doors for galas and garden parties. Those community connections were just as important as what was happening in London.\nWhen Queen Elizabeth ascended to the throne seventy years ago, it was also a time of great change for the country. Just a decade earlier, renowned social reformer Sir William Beveridge argued that despite all the turmoil faced by Britain in the midst of the Second World War, it was time to create ‘freedom from want’ across British society. With passion and vision, he put forward a revolutionary idea that now sits at the core of British identity – our National Health Service, which a Labour government put in place in 1948.\nAlmost eight decades have passed, and the UK is again facing challenging times at home and abroad. Following more than a decade of Conservative austerity, and now with an unprecedented cost of living crisis, families from all backgrounds are struggling to pay bills, put food on the table, and access the healthcare services they need.\nWe have all faced the struggle of getting a GP appointment – on hold at 8am in the hope we can secure a desperately needed appointment. In thirteen years of Conservative government, hundreds of pharmacies have closed, and 2,000 GPs have been cut.\nAnd while pharmacies can deal with many of the most common issues, lack of access to GP appointments forces people to wait until their symptoms become severe. GPs themselves are now under-resourced to meet the needs of their patients.\nThe bottom line is that we need more doctors and nurses so that patients come first. Whether it’s a face-to-face appointment or over the phone, this needs to be a patient-led choice.\nSadly, NHS Dentistry fares no better. A shocking 98% of dental practices in Bradford do not accept new NHS patients, and 80% of dentists in England are not taking on new child NHS patients. This situation is a rotten expression of a government that has run out of energy and ideas.\nDespite cross-party support for reforming NHS dentistry being clear throughout a debate I recently led in Parliament, the government continues to bury its head in the sand. When I challenged the Prime Minister on the matter, he dismissed my concerns out of hand, ignoring the lived experience of the 6 million people who tried and failed to get a dental appointment last year.\nWith the system so obviously broken, and the Conservative government so clearly out-of-touch, what could a future Labour government do to restore NHS dentistry?\nA founding principle of the NHS was a shift from people only seeking treatment when the pain is unbearable, to a service with regular check-ups to spot problems early. The answer, as true in 2023 as it was in the early reign of Queen Elizabeth II, is that NHS dentistry must be based on prevention.\nInvestment must be targeted towards the areas that need it most, like Bradford. By making dental care a priority at all levels of healthcare, dentists would be better positioned to help treat the causes, not the symptoms, of dental decay.\nWe could also resurrect NHS School dentistry. In 2022, tooth decay was the single most common reason for hospital admission of children between the ages of 6 and 10. By integrating dental care into schools, we can protect our children’s teeth before any serious damage occurs.\nThis Conservative government repeats well-rehearsed lines about ‘sensible’ finances. It is now plain to see that Conservative mismanagement has left our GP, hospital, and dental services in chaos.\nBut we know doing it right can make all the difference. In my own Bradford South constituency in 2017, I worked with the Telegraph & Argus and Government ministers on a ‘Stop-the-Rot’ campaign that reinvested £250,000 into local dental services over three years. With this targeted lump sum, 3,000 new NHS dental appointments were made available to people right across my constituency.\nWe have already proved that targeted investment is possible. This will be the sensible future option for this country’s finances.\nThe solutions to these crises exist. The country is crying out for a government willing to enact the necessary changes.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_season-joy-families-struggle/content_112.html": "Editorial: A season of joy - but families are still struggling\n- judithcumminsmp\n- Dec 20, 2022\n- 3 min read\nUpdated: Dec 6, 2023\nThis column was first published in Bradford's Telegraph & Argus on Weds 14 December 2022\nAs the year draws to a close, this is the first festive season in three years where families and friends can truly come together and celebrate. It is our first restriction-free Christmas since 2019. For that reason alone, it should be a time of joy for people in Bradford of all faiths and none.\nYet, none of us is under any illusion that this will be an easy Christmas. Families in my constituency and across the country are struggling to keep their heads above the water with the runaway cost of living, soaring prices of essential food and unmanageable winter energy prices.\nIt is shocking that, according to a recent survey, almost half of families in Bradford are worried about affording gifts this Christmas, and over a quarter say they cannot afford to celebrate Christmas this year at all.\nIn autumn, the Government’s disastrous mini-budget blew a £30 billion hole in the economy that crashed the pound, weakened pensions and added hundreds of pounds a month to mortgage bills that will burden many families for years to come. But that is just one example of the last twelve years of Conservative mismanagement of our economy that means people are working harder and earning less. The Government has shown time and again that it is not looking out for working families. Just look at our NHS.\nI constantly hear from residents who struggle to get a GP appointment and, even when they do, it is often a telephone consultation. At many practices, face-to-face appointments are still not back to the levels they were before the pandemic. Irregular phone check-ups are no replacement for examining someone in person and leaves patients at risk of misdiagnosis or a missed diagnosis.\nI have repeatedly raised in Parliament the shortage of GPs and the problems people have getting face-to-face appointments. But on top of over a decade of underinvestment in the NHS, rising demand and declining GP numbers mean that the NHS is struggling to cope.\nThe Government has also shown that it hasn’t much interest in looking out for the North either.\nTime and again we were promised new, high speed, electrified rail infrastructure through Northern Powerhouse Rail with a stop in Bradford. I challenged the Deputy Prime Minister and Chancellor directly on their commitment to this and neither would offer me the guarantee the North needs. Lack of investment is holding back our region and the ‘make do’ revamp of existing lines just doesn’t cut it.\nMeanwhile, Labour has a long-term plan to get our economy growing again, powered by the talent and effort of working people and business, creating good jobs, insulating homes and helping high streets thrive again by fixing unfair business rates.\nAnd as we go into the New Year, there is cause for optimism in Bradford:\nIt was a proud moment in May when Bradford was announced to be the UK City of Culture 2025 and work is well underway to build up to our year in the limelight. I am also eagerly supporting news of the once-in-a-generation levelling up bid centred on Odsal that will spur on investment in Bradford - bringing hundreds of jobs and over a billion pounds of social value to the city. If successful, these will boost regeneration in Bradford for decades to come. I am hosting a Ministerial visit to Odsal in the New Year precisely to showcase what Bradford South and the city has to offer. When given the opportunity it deserves, Bradford is ready to seize it.\nFinally, in sport, the FIFA World Cup is well underway, and I commiserate with the England team on their knockout last Saturday against France. Let’s hope for success in the 2024 European Championship. The football world cup follows hot on the heels of the Rugby League World Cup that was hosted right here across the north of England, and saw our fantastic wheelchair team crowned world champions.\nHowever you choose to celebrate the festive season, I wish you and your families a safe and merry Christmas, and a happy and peaceful New Year.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_editorial-people-work-harder-than-ever-yet-see-less-for-it/content_115.html": "Editorial: People work harder than ever - yet see less for it\n- judithcumminsmp\n- Sep 4, 2023\n- 3 min read\nUpdated: Dec 5, 2023\nFirst published in the Telegraph & Argus on 2 Sept 2023.\nSummer is a wonderful time for Members of Parliament to get out and about in their constituencies. This summer, I have had hundreds of conversations with my constituents on the doorstep, hearing about their hopes and dreams for the future, the ambitions they have for their families, and the concerns that cause worry day after day.\nFor many young people, September is a time of exciting new opportunities and a future of possibilities, especially after the tense summer wait for GCSE and A-level results. Thousands of students in Bradford will be moving on to secondary school and making new friends, heading to college or university, or joining the world of work. To everyone taking that bold next step after the challenges you have faced over the last few years, I wish you the very best as you start the next chapter of your lives.\nYet, for so many constituents I have spoken to, this hope to see their children succeed is tempered by the profound worry they have for their families’ futures. Time and again, my constituents share the same core concerns with me: the biting cost-of-living, energy bills that remain significantly higher than they were only three years ago, and an economy and a government that people don’t feel is working for them and their families.\nPeople are working harder than ever but seeing less for it.\nIn my Bradford South constituency, people are seeing the effects as several major employers are either forced to scale back their operations or close altogether due to unsustainable energy prices and the dire stewardship of the economy by an incompetent Conservative government – at the cost of hundreds of good Bradford jobs. And, with the recent news of national retailer Wilko’s collapse, even as hopes remain for someone to step in, my constituents are worrying: Is it my job next?\nThe bitter fact is that, under the Conservatives, an insecure economy and the cost-of-living crisis are here to stay. The government has learned no lessons from how families have struggled over the last few years. Crisis after crisis at the very top of government has resulted in weak policies, knee-jerk reactions, coupled with a refusal to acknowledge and address these problems have made things worse for people.\nAs autumn starts and the colder weather appears on the horizon, families need reassurances now that they will get support over another difficult winter. In fact, bringing energy costs significantly down for everyone is the top cost-of-living concern for over half of us.\nBut, rather than meaningfully tackling the deep-rooted and long-term problems the country faces, the Conservatives instead continue to side with the very energy companies that are making record profits over hard-working British families. It just isn’t good enough.\nA Labour government would close the loopholes protecting those vast energy profits and build the country’s energy independence, ensuring a diverse energy supply and weaning the UK off insecure foreign gas and oil to help protect families from the energy price shocks our country has been so vulnerable to.\nI have always believed that the people of Bradford have a strong sense of fair play. No one is asking to have everything handed on a silver platter. People want a fair day’s pay for a fair day’s work, better long-term prospects, and a better standard of living for them and their families. They worked hard in difficult times and they want and need a Labour government and economy that supports their aspirations – not this Conservative government that continues to let them down.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_petition-justice-for-those-affected-by-the-contaminated-blood-scandal/content_10.html": "Petition: Justice for those Affected by the Contaminated Blood Scandal\n- judithcumminsmp\n- Mar 18, 2024\n- 1 min read\nUpdated: Oct 9, 2024\nSir Brian Langstaff, the Chair of the Infected Blood Public Inquiry produced his final report on compensation in April 2023, calling for a compensation scheme to be set up and payments to start being made before the end of 2023.\nShockingly there was no mention in the Budget, either in the Chancellor’s speech or in the Red Book, of any money being allocated for compensation. This is despite the Government accepting the “moral case” for compensation and claiming to be working “at pace” on the issue. With your help, I am looking to present a petition to Parliament calling for the Government to act now to implement the recommendations of the Second Interim Report of the Infected Blood Inquiry without delay.\nThe best way to support the petition is to download this petition, provide your details and signature, and return it to me, either by scanning it, or by posting it back to me.\nPetitions should be returned by post or delivered to my office:\nJudith Cummins MP\n26-28 Church Bank\nBradford\nBD1 4DZ\nThis petition will be presented to Parliament by Judith, and will receive an official reply from a Government Minister.\nAlternatively, you can support a separate digital petition by clicking here.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_levelling-up-has-left-bradford-even-further-behind-says-judith/content_127.html": "\"Levelling Up has left Bradford even further behind\" says Judith\n- judithcumminsmp\n- Mar 4, 2024\n- 2 min read\nJudith has challenged the Government on its Levelling Up strategy as new research suggests the wealth gap between the North and the rest of England is set to grow.\nSpeaking in Parliament today, Judith questioned the effectiveness of the scheme, highlighting regional inequalities between the North and South are forecast to get bigger:\n“In 2010, total wealth per head in the North of England was 16% less than the rest of England.”\n“Last week the IPPR [Institute for Public Policy Research] released a report which estimated that, by the end of 2030, this gap will have grown to 21%.”\n“Can the Minister confirm that this government’s policies have achieved a ‘levelling up’?”\nResponding, the Secretary of State for Levelling Up, Michael Gove, argued:\n“I was delighted to be in West Yorkshire on Friday outlining the additional investment that we are making in the West Yorkshire region”\n“The specific agreement that we have reached with the Mayor of West Yorkshire, Tracy Brabin, will see significant additional funds going in to help with housing, adult skills, and transport, all of which will contribute to a revolution in devolution that has occurred under this Conservative government.”\nThe Government has recently agreed a Level 4 devolution deal for the West Yorkshire, a step down from the devolution deals approved for Greater Manchester and the West Midlands.\nA freedom of information request to the Department for Levelling Up, Housing and Communities has also revealed that by February 2024, less than 20 per cent of projects approved under levelling up’s Towns Fund have been completed in England.\nSpeaking afterwards, Judith said:\n“Levelling Up was supposed to be about addressing regional inequalities and giving an economic kick start to places such as Bradford. Instead, the scheme has left communities competing for the scraps of limited funding against the backdrop of chronic underfunding of our local services by government.\n“The Government’s completely ineffective strategy is leaving the very places that would benefit the most – like Bradford – even further behind.”\n“Labour’s plan to rebuild Britain will give towns and cities across England the tools they need to drive growth and build an economy that boosts living standards and good jobs in every part of the country”.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-presents-petition-on-infected-blood-inquiry/content_41.html": "Judith presents petition on infected blood inquiry\n- judithcumminsmp\n- May 20, 2024\n- 3 min read\nLast week, Judith presented a petition signed by residents from Bradford South which read:\n\"The petition declares that people who received infected blood and who have suffered as a consequence have, along with their families, waited far too long for redress.\nThe petitioners therefore request that the House of Commons urges the Government to implement the recommendations in the Second Interim Report of the Infected Blood Inquiry without delay.\"\nPresenting the petition to Parliament, Judith said:\n\"I join a number of Honourable Members in presenting a petition in the same terms on behalf of my constituents in Bradford South, although I know that it reflects feelings that are widespread across the country. The petition reflects concerns across Bradford South that the Government have yet to implement both the final infected blood inquiry recommendations and compensation, and the will of this House of Commons, which was expressed on 4 December 2023.\"\nResponding, the Minister for the Cabinet Office, John Glenn MP said:\n\"The Government is grateful to the Hon. Member for Bradford South, Judith Cummins MP, for submitting the petition on behalf of her constituents concerning the Government’s response to the Infected Blood Inquiry, and particularly the issue of final compensation recommendations made by Sir Brian Langstaff.\nThe Government acknowledge that victims of Infected Blood have been waiting far too long to see justice and we are progressing this work with urgency.\nThe Government has accepted the moral case for compensation and, starting in October 2022, made interim payments of £100,000 available to chronic infected beneficiaries and bereaved partners registered with existing support schemes. These payments continue to be made to eligible beneficiaries upon being accepted onto the schemes.\nHowever, we recognise there is more still to be done. On 30 April, Government amendments were added to the Victims and Prisoners Bill. The Government amendments impose a duty on the Government to establish an Infected Blood Compensation Scheme. It also establishes a new arms-length body, named the Infected Blood Compensation Authority, to deliver the compensation scheme. The Authority will operate on a UK-wide basis to ensure parity and consistency. The Government also agreed to deliver the regulations establishing an Infected Blood Compensation Scheme within 3 months of Royal Assent. This demonstrates our absolute commitment to pay compensation to those infected and affected by Infected Blood.\nAdditionally, in order to progress this work as swiftly as possible, a shadow body will be established by 20 May, led by an interim chief executive. This will be critical to getting the practical work in place to ensure the Infected Blood Compensation Authority can be fully operational as soon as possible. The shadow body will be able to begin work such as implementing IT systems and appointing staff which are needed for assessing and delivering compensation payments as quickly as possible.\nThe Government amendment also includes a statutory duty to make interim payments of £100,000 to estates of deceased infected people who were registered with existing or former support schemes (where previous interim payments have not already been made to infected\nindividuals or their bereaved partners). This is an important step forward to get substantial compensation into the hands of families of victims of infected blood.\nThe Government will make a substantive update to Parliament responding to the Infected Blood Inquiry’s recommendations on compensation as soon as possible following 20 May. It is important that the Government awaits the findings of the Inquiry’s final report, but Ministers are clear that the Inquiry's recommendations should form the basis of any response.\"",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_queensbury/content_46.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith champions oracy skills at Trinity Academy\nLocal News\nNov 24, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_job-losses-show-plan-failing/content_40.html": "Comment: Job losses show Govt's plan to grow jobs is clearly failing\n- judithcumminsmp\n- Nov 27, 2023\n- 1 min read\nJudith has raised concerns about a number of job losses in Bradford South.\nBradford's Telegraph & Argus reported last week that Bradford South based VCS had entered administration.\nCommenting to the T&A, Judith said:\n\"This news of more jobs at risk is bad news for Bradford.\"\n\"VCS's establishment of the largest dedicated ambulance and police vehicle factory in the country here in Bradford this year was a huge boon to the local economy, creating 150 jobs, and I hope administrators are able to preserve as many of these as possible.\"\n\"This news about VCS is the latest blow in what has been a very tough year for manufacturing in Bradford, and highlights the immense challenges that businesses are facing up and down the country.\"\n\"The Government's plan to grow the economy is clearly failing and it is working people who are paying the price.\"",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_categories_ukraine/content_18.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith represents United Kingdom at Crimea Summit\nUkraine\nOct 28, 2024\n2 min read\nJudith: \"Ukraine cannot be left waiting for much needed supplies.\"\nUkraine\nMay 19, 2023\n1 min read\nEditorial: In Ukraine, I saw the human cost of this war\nUkraine\nMar 2, 2023\n2 min read\nJudith presses Secretary of State for position on NATO ‘Fighter Jet Coalition’\nUkraine\nJan 31, 2023\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_to-build-bradford-s-future-we-must-invest-in-its-people-today/content_6.html": "To Build Bradford's future we must invest in its people today\n- judithcumminsmp\n- Mar 28\n- 1 min read\nIn her latest column, Judith reflects on her recent visit to Bradford College, and the work to make sure Bradfordians today are developing the skills needed for the competitive economy of tomorrow.\nRead it online on the Telegraph & Argus website:",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-welcomes-agreement-on-bulls-elite-academy/content_137.html": "Judith welcomes agreement on Bulls Elite Academy\n- judithcumminsmp\n- Jun 15, 2021\n- 1 min read\nReacting to news that Bradford Bulls will now continue to run an Elite Academy, Bradford South Labour MP Judith Cummins said, “I’m pleased that the club and the RFL have reached a resolution that enables Bradford to continue to run an Elite Academy.”\n“It would, however, have been better for all concerned to have avoided the worry and trauma in the first place,” she added.\nMs Cummins had challenged the RFL on the process and decision that saw Bradford losing out in the award of Elite Academy licences. She questioned whether quotas rather than an assessment of record, performance and deep roots into the community game had been given little weight in the consideration.\n“The Bulls Academy has been productive and respected for its work, a rich source of playing talent. Leon Pryce, Sam Burgess, and John Bateman to name but a few of the players to have come through the academy and gone onto star at the highest levels of our sport.\nThere remain challenges ahead but I’m looking forward to working with and supporting the club and the RFL to make sure that the sport has a healthy future,” said Ms Cummins.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_dentistry/content_87.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nDentistry plan 'simply inadequate' for scale of problem, says Judith\nHealth\nFeb 8, 2024\n2 min read\nEditorial | 2024: A Year for Change\nLocal News\nJan 24, 2024\n4 min read\nNHS Dentistry Must Serve Every Person, from the Cradle to the Grave\nHealth\nJan 9, 2024\n2 min read\nEditorial: To Stop the Rot in NHS dentistry we must look back to its founding principles\nLocal News\nMay 19, 2023\n3 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_i-am-so-often-inspired-by-the-energy-of-young-people-in-bradford/content_5.html": "I am so often inspired by the energy of young people in Bradford\n- judithcumminsmp\n- 8 hours ago\n- 1 min read\nIn her latest column for the Telegraph and Argus, Judith speaks about the inspirational young people of Bradford and our role in helping them get involved in the country's democratic way of life.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_petition/content_75.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nSave our Pharmacies: Judith delivers petition to Parliament\nHealth\nSep 7, 2023\n2 min read\nPetition: Save our Pharmacies\nHealth\nJul 26, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-represents-united-kingdom-at-crimea-summit/content_50.html": "Judith represents United Kingdom at Crimea Summit\n- judithcumminsmp\n- Oct 28, 2024\n- 2 min read\nJudith meets with the British Ambassador to Latvia. (Image: British Embassy)\nLast week, Judith Cummins, the Member of Parliament for Bradford South, addressed the Third Parliamentary Summit of the International Crimea Platform in Latvia in her role as Commons Deputy Speaker.\nIn February 2014, Russia launched an invasion of Ukraine occupying Crimea and the city of Sevastopol. In February 2022, this was followed by a full-scale military invasion of Ukraine which continues to this day.\nLast month, the Wall Street Journal reported an estimate that roughly 1 million people had been injured or killed during the war.\nThe Third Parliamentary Summit of the International Crimea Platform brought together delegations and representatives from about 40 countries, sending a message of unity in the face of Russia’s aggression.\nThe summit was addressed by President of Ukraine Volodomyr Zelenskyy\nIn a speech to international counterparts at the summit, Judith Cummins, the Deputy Speaker, said:\n“We must always remember that Russia’s violation of Ukraine’s sovereignty did not begin in 2022. It began with the annexation of Crimea in 2014 which was followed by repression and human rights violations.”\n“This conference is a vital opportunity for us to discuss how we can use our positions in our parliaments to support Ukraine and Crimea.”\n“We, as Speakers, Deputy Speakers and influential parliamentarians can and must continue to do that.”\nLast year, the Bradford branch of the Association of Ukrainians in Great Britain (AUGB) awarded Judith with Honorary Membership of the Association in recognition of her outspoken support for Ukraine. In 2022, Judith went to Ukraine with a British charity, supporting the humanitarian response to the war.\nSpeaking after the Summit, Judith said:\n“In an increasingly dangerous world, it is vital that the UK maintains solidarity and unity with our allies.”\n“As Ukraine continues to repel Russia’s illegal invasion, it is incumbent on the UK to provide our full and unwavering support to Ukraine.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-welcomes-pledge-to-continue-school-buses/content_25.html": "Judith welcomes pledge to continue school buses\n- judithcumminsmp\n- Feb 25\n- 2 min read\nJudith has welcomed the announcement that plans to cut school bus services to two Bradford schools have been temporarily scrapped, calling it an ‘important first step’ – but has warned that a permanent solution to keep these vital school buses must still be found.\nToday, Bradford Council and West Yorkshire Combined Authority announced that an agreement has been reached to continue funding school buses to St Bede's St Joseph’s Catholic College and Bingley Grammar until at least the summer of 2026.\nLast year, Bradford Council announced bombshell proposals to cut the twelve bus services serving the schools would have affected the almost 900 students that rely on these services to get to and from school every day.\nSpeaking at the time, Judith called the plans ‘disjointed, inconsistent and ill-thought through’ warning that ‘there would be unintended consequences of removing these bus services that risk destabilising the school system and would threaten the future viability of SBSJ entirely.’\nA petition calling for the plan to be axed was signed by over 1800 people and presented to and debated at a meeting of the Council.\nAnd, in December, Judith convened a meeting that brought the leader of Bradford Council, representatives of SBSJ and the Catholic Academy Trust that established a ‘clear consensus on the need to work together to find a way forward’.\nCommenting on today’s announcement, Judith said:\n“Today’s announcement is a positive first step.”\n“I am pleased that Bradford Council have listened to the voices of parents and pupils and have rethought their decision to cut school these vital school bus services and fund them for the next academic year.”\n“While I applaud the good sense shown by Bradford Council and WYCA on this decision, a permanent solution to keep these buses going must still be found.”\n“I will continue working with everyone involved. The council, schools and parents, the diocese and WYCA must continue to work together to come up with a viable long-term solution to make sure students in my constituency and across Bradford can continue to get to school safely and on time.”\nI am looking forward to visiting SBSJ in the coming weeks to celebrate this decision and to continue these important discussions. Catholic education in Bradford depends on good school bus services”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_contact_questionnaire/content_20.html": "The Labour Party uses your personal data for a variety of reasons related to engaging in the democratic process. Where we rely on consent, you are always able to opt out. To find out more about how we use your personal data and to view our Profiling Notice, please see labour.org.uk/privacy-policy\nBy ticking this box, I agree to the privacy policy.*",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_categories_dentistry/content_8.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith \"wears it pink\" in support of Breast Cancer Now\nHealth\nOct 18, 2024\n2 min read\nJudith chairs debate on damning report on state of NHS\nHealth\nOct 9, 2024\n2 min read\nJudith presents petition on infected blood inquiry\nHealth\nMay 20, 2024\n3 min read\nPetition: Justice for those Affected by the Contaminated Blood Scandal\nHealth\nMar 18, 2024\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_deputy-speaker/content_57.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith chairs Great British Energy Bill\nNational\nNov 6, 2024\n1 min read\nJudith represents United Kingdom at Crimea Summit\nUkraine\nOct 28, 2024\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_health/content_117.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith slams government delay on vital spiking report while charities launch legal action\nCrime & ASB\nSep 8, 2023\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_business/content_32.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nTo Build Bradford's future we must invest in its people today\nLocal News\nMar 28\n1 min read\nJudith welcomes announcement of Bradford Live operator\nFeb 19\n1 min read\nJudith chairs statement on Future of steel manufacturing in the UK\nNational\nSep 20, 2024\n2 min read\nJudith supports Small Businesses in Bradford\nBusiness\nDec 5, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_small-business-saturday/content_78.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith supports Small Businesses in Bradford\nBusiness\nDec 5, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-welcomes-debate-to-bring-an-end-to-the-prospect-of-future-mini-budget-disasters/content_68.html": "Judith chairs debate to bring an end to the prospect of future mini-budget disasters\n- judithcumminsmp\n- Sep 20, 2024\n- 2 min read\nUpdated: Nov 13, 2024\nJudith has chaired the Budget Responsibility Bill as it was brought before Parliament.\nThe Budget Responsibility Bill is part of the Government’s plan to restore the economy following recent record inflation.\nIn 2022, then-Prime-Minister Liz Truss announced a mini-budget which included £45bn of unfunded tax cuts. But, with financial markets reacting badly to the statement, the value of the pound fell to record lows, the cost of borrowing rose, impacting mortgage rates and the cost of everyday items.\nOne reason given for the adverse market reaction was the failure of the then-Government to publish the independent assessment from the Office for Budget Responsibility, contributing to a lack of investor confidence in the plans.\nBy creating a ‘fiscal lock’, the Bill would require that any fiscally significant announcement by the Government be subject to an independent assessment by the Office for Budget Responsibility.\nCommenting, Judith said: “There are families in Bradford who still feel the impact of previous disastrous mini-budgets. Many are still paying hundreds of pounds extra every month on their rent or mortgage. I welcomed the opportunity to chair this important debate on ensuring that future fiscally significant decisions by government are backed up by robust independent analysis. No government should be able to play fast and loose with Government finances.”\nAs Deputy Speaker of the House of Commons, Judith was responsible for moderating debate on the Bill and ensuring that voices on all sides of the House were heard.\nJudith presided over the ‘Committee of the whole House’, which is a process used to for Bills of constitutional or ethical importance and for parts of the annual Finance Bill.\nThe bill is one of 39 new bills for Parliament proposed by the new Labour Government in the King’s Speech. These focus on areas such as boosting energy and infrastructure, reforming the Transport system, tackling crime and securing the nation’s borders, boosting employment rights, restoring the NHS, and generating economic growth.\nThe Bill will now proceed to the House of Lords before it is voted on and officially made law.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_car-insurance/content_113.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith attacks 'car-insurance rip-off'\nLocal News\nNov 30, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-pushes-govt-to-commit-to-levelling-up-and-regeneration-in-bradford/content_121.html": "Judith pushes Govt to commit to levelling up and regeneration in Bradford\n- judithcumminsmp\n- Oct 21, 2022\n- 2 min read\nUpdated: Dec 6, 2023\nToday in Parliament, Bradford South MP Judith Cummins has invited the Sports Minister to visit Odsal Stadium to discuss its regeneration, amidst her concerns that economic uncertainty could put levelling up bids at risk.\nQuestioning Stuart Andrew MP, Sports Minister for Digital, Culture, Media & Sport (DCMS) in Parliament this morning, Judith highlighted the start of the Rugby League World Cup and asked the Government to commit to levelling up:\n\"With the men’s competition kicking off last Saturday and with the women’s and wheelchair teams due to get going next week, we can see that the Rugby League World Cup is really getting into its stride.\"\n\"To secure the legacy of this great event, and also the Bradford City of Culture 2025, I am backing an ambitious Levelling Up bid to transform Odsal Stadium, the iconic home of the Bradford Bulls in my constituency.\"\n\"But with the recent economic uncertainty, I am concerned that this bid could fall by the wayside. Will the Sports Minister show Bradford that the government is serious about levelling up and visit Odsal stadium with me?”\nThe ambitious £50m levelling up bid, which Judith has previously called a ‘once in a generation opportunity’ for Bradford, would see regeneration of the Osdal area of Bradford South, delivering a world-class music, culture, and sport arena, park and ride, and sports training complex, generating hundreds of jobs and creating long-term opportunities in the city.\nResponding, the Minister said:\n“The Honourable Lady rightly highlights Bradford’s ambitious plans, particularly given its city of culture status. I would be more than happy to come and see her.”\nSpeaking afterwards, Judith said:\n“Now is the time to push for investment into Bradford, and I will keep fighting for Bradford to have its fair share.”\nhttps://twitter.com/JudithCummins/status/1583108558400278529",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_pharmacy/content_67.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nEditorial | 2024: A Year for Change\nLocal News\nJan 24, 2024\n4 min read\nJudith unites MPs in joint letter to save Community Pharmacies\nHealth\nJan 4, 2024\n2 min read\nSave our Pharmacies: Judith delivers petition to Parliament\nHealth\nSep 7, 2023\n2 min read\nPetition: Save our Pharmacies\nHealth\nJul 26, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_west-yorkshire-police/content_107.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith hosts street walk with Deputy Mayor Alison Lowe\nCrime & ASB\nSep 20, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_levelling-up-bradford-left-behind-by-this-government-once-again/content_135.html": "Levelling Up: Bradford left behind by this Government once again\n- judithcumminsmp\n- Jan 19, 2023\n- 2 min read\nUpdated: Dec 5, 2023\nLast night, the Government announced that Bradford had not been successful in its levelling up bid to regenerate the Odsal area of Bradford South.\nSpeaking in Parliament in response to the announcement, Judith asked:\n“Would the Minister agree with me that the British people have an innate sense of fair play?\n“Independent analysis of the largest cities and towns in England identified Bradford as the UK’s number one Levelling Up opportunity – given that none of the four Bradford bids were successful in this round – does the Minister believe that the people of Bradford will think this is a fair outcome, or indeed that this process stinks?”\nResponding, Lucy Frazer MP, Minister for Housing and Planning said:\n“As I mentioned earlier, as somebody who grew up in Leeds, I understand how important that area of the country is, and how much more we can do. We were only able to allocate in this round £2.1 billion, but there is further funding available and Levelling Up Round 3 will be coming in due course.”\nSpeaking afterwards, Judith said:\n\"This is yet another example of this Government leaving Bradford and West Yorkshire behind.\nIt is hugely disappointing that Bradford's ambitious £50m levelling up bid to regenerate the Osdal area has not been successful. The transformative plan would have brought significant investment and hundreds of jobs in to Bradford.\nIt is a damning indictment of this Government's lack of vision and support for Bradford when not one of the city's submitted bids in this round was successful.”\nJudith added: “This is not the government levelling up, it is the government messing up. The government needs to fix the process to ensure fairness, so that public funds are targeted to places that would benefit the most like Bradford.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_petition-save-our-pharmacies/content_62.html": "Petition: Save our Pharmacies\n- judithcumminsmp\n- Jul 26, 2023\n- 1 min read\nUpdated: Oct 9, 2024\nI am launching a petition to save our pharmacies.\nOur pharmacies are a vital front-line service for people to get face-to-face healthcare and support, but serious underfunding is threatening their ability to continue to serve communities in Bradford South.\nFunding for pharmacies has dropped by 30% in real terms over the last ten years, putting many local chemists at risk of closure.\nI am presenting a petition to Parliament calling on the Government to give community pharmacies the support they need to ensure they can continue providing a high standard of care to the community.\nIf you agree, you can download, print and sign the petition below.\nPetitions should be returned by post or delivered to my office:\nJudith Cummins MP 26-28 Church Bank Bradford BD1 4DZ",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_categories_campaigns/content_28.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_valley-project/content_93.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith hosts street walk with Deputy Mayor Alison Lowe\nCrime & ASB\nSep 20, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-demands-tougher-action-on-spiking/content_120.html": "Judith demands tougher action on spiking\n- judithcumminsmp\n- Jan 16, 2023\n- 2 min read\nUpdated: Dec 5, 2023\nJudith Cummins MP has called for spiking to be made a specific criminal offence.\nSpeaking in a debate in Parliament on the Prevention of Spiking Incidents Judith, raised serious concerns about the chronic under-reporting of spiking and the ‘black hole’ of safeguarding in outdoor music festivals.\nJudith said: “Recent figures point to almost 5,000 spiking incidents in just one year. Those figures are shocking, but they are likely to be the tip of the iceberg.”\nShe then revealed that her own research of police forces shows just 10 spiking reports from a decade of festivals.\nJudith continued: “It is unrealistic that it is just 10. The same data recorded 193 sexual offences, almost a third of which were against children under 18—the youngest was just 12 years old. The incidents were nearly exclusively against women and girls.”\n“Festivals are huge pop-up towns, but the police and emergency service presence there is often minimal – police stick to traffic calming rather than policing as festival organisers provide event security and medical facilities.\nUnfortunately, this can lead to gaps in reporting that mean spiking is never explored with the victim, and reporting is not easily available. Recent recommendations were made by the Home Affairs Committee to provide all staff working at festivals with safeguarding training but these proposals were not taken forward by the Government.\nResponding, Tom Tugendhat, Minister for Security claimed that the government worked “closely with festivals and festival organisers and the outdoor events sector last summer to ensure that the necessary protocols, training, communications and guidance were in place ahead of events.”\nSpeaking afterwards, Judith said more needed to be done, concluding: “There is some good practice at some good festivals, more needs to be done to protect festival goers – and especially young people. Action is needed, including a specific criminal offence of spiking so that all the data of this offense is accurately recorded, and making sure that victims have the continuity of care and support they need.”\n“Government needs act to protect young people from spiking – wherever this crime occurs.”\nhttps://twitter.com/JudithCummins/status/1613948923772559361",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-seeks-assurances-on-police-s-dangerous-driving-work/content_34.html": "Judith seeks assurances on Police's dangerous driving work\n- judithcumminsmp\n- 8 hours ago\n- 1 min read\nFollowing announcement of operational changes at West Yorrkshire Police, Judith has spoken to the Telegraph and Argus, saying:\n“Operation Steerside is a valuable tool in tackling dangerous driving. This includes recent success in Bradford South dealing with the “fatal five” driving offences that saw action taken on 175 separate offences. This is important work which I have been proud to support since Operation Steerside was set up in 2016. I have contacted West Yorkshire Police to confirm that any operational changes will not negatively impact Steerside’s work to make our roads safer.”\nRead the full article on the Telegraph & Argus website",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_editorial-2024-a-year-for-change/content_54.html": "Editorial | 2024: A Year for Change\n- judithcumminsmp\n- Jan 24, 2024\n- 4 min read\nThis editorial first appeared in the Telegraph & Argus: Sat 20 January 2024\nFor many people, the new year is usually a time of reflection, renewal and optimism for what lies ahead. It also serves as an opportunity to think ambitiously about our future.\nWhilst this is no doubt a dangerous time for the world, 2024 will certainly be a big year for the UK. Voters are likely to have their say on who they think should be running the country - in the first General Election in five years. And whilst the Prime Minister has yet to set a date, for many, it cannot come too soon.\nBecause I know that people in Bradford and across the country have a thirst for change this year. People want renewal and growth, new jobs, opportunities, and better public services, not the slow and steady decline that we’ve seen under 14 years of Conservative Government that have cut services to the bone.\nTake the struggle to get an NHS dentist for one. I have been banging the drum and fighting against the decay of our dentistry services since I was first elected nearly eight years ago – and I am pleased that Labour put this squarely in the spotlight last week as the focus of a day of opposition debate in Parliament. This is an issue now high up on the political agenda.\nAs I have said many times, it is not acceptable that it is so difficult to get an NHS dentist in Bradford. Too many people are now left with no choice but to register for a private dentist because they cannot access an NHS dentist. The alternative is emergency treatment at A&E. Whilst this decline in our NHS services might seem inevitable, it is not. It is a political choice by this Conservative Government who have driven our vital public services into the ground, both at a national level and here in Bradford.\nLabour has a rescue plan to begin to save NHS dentistry. A Labour Government would address the immediate crisis with 700,000 more urgent dental appointments and focus dentist recruitment in places that need them most – I would argue, in places such as Bradford. Labour will improve children’s dental health by providing supervised tooth brushing up to the age of five, reducing tooth decay and building good dental habits for life. A Labour Government will also reform the NHS dental contract in order to save the NHS dental system - because our NHS services should serve everyone, from the cradle to the grave.\nI want to hear about your experiences getting an NHS dentist – fill in my dentistry survey on my website: www.judithcummins.org.uk/post/dentistry-survey\nThe issues faced by our healthcare system, of course, go beyond NHS Dentistry. I have been working in recent weeks and months to promote the importance of local community pharmacies. Hundreds of people signed a petition to protect local pharmacies here in Bradford South, which I delivered to Parliament in September. However, with Pharmacy funding cut by 30% between 2015 and 2023, the situation is desperate. In December, I co-ordinated a joint letter with 20 MPs to the Health Minister calling for the protection of pharmacy funding. Stepping into the new year, I intend to continue to call on Ministers to give pharmacies the funding that they deserve.\nHealthcare is as much about prevention as it is about the cure. Speaking to ITV this month, I raised the issue of the harmful effects of high-caffeine products on young people and the lack of regulation to keep children safe. Shocking new health research shows that excessive caffeine puts young people’s mental and physical health at much greater risk than previously thought.\nIt is not just that young people who regularly consume energy drinks have worse quality sleep and perform measurably worse at school, it is associated with health problems like diabetes, tooth decay, and impacts young people’s mental health with an increased risk of depression and anxiety.\nThe sale of all high-caffeine products to under-16s, including energy drinks and supplements, must be banned to protect young people from the harmful effects of excessive caffeine consumption. This is about preventing long-term health conditions for future generations, and about protecting our children. It is also the sensible option for our NHS.\nFinally, I am glad the government finally acknowledged the horrific impact of spiking - just days after my cross-party debate in Parliament. I welcome that the government thinks there should be a clarification to the law, but a rewording isn’t enough. We still need a specific offence of spiking to protect people from this horrific crime. The government has yet again missed a clear opportunity to make the law in this area fit for the 21st Century. That’s why I am introducing an amendment into parliament which makes the specific act of spiking is illegal.\n2024 can be a year of change. It can be a year of progress. Together, we can get Britain’s future back.\nI wish you a prosperous and happy year ahead.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-praises-police-work-to-tackle-danger-driving/content_14.html": "Judith praises police work to tackle danger driving\n- judithcumminsmp\n- Mar 4\n- 1 min read\nJudith has congratulated West Yorkshire Police on work to tackle dangerous driving that saw nearly two hundred tickets given out in Bradford South.\nThe work, lead by Bradford South Policing Inspector Adam Beecroft, with input from Judith, local councillors and residents saw days of action across the constituency, with offices targeting the fatal five driving offences:\n1. Failing to wear a seatbelt\n2. Speeding\n3. Driving whilst under the influence of drink or drugs\n4. Driving whilst using a mobile phone\n5. Driving without due care an attention and/or dangerous driving\nPraising the work, Judith said: \"Amazing work to tackle the fatal five driving offences. A huge thank you to the policing team for helping to make our streets safer for law-abiding drivers and pedestrians.\"",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_wibsey-community-garden-receives-230-000-funding-boost-with-support-from-judith/content_125.html": "Wibsey Community Garden receives £230,000 funding boost with support from Judith\n- judithcumminsmp\n- Jan 10\n- 2 min read\nJudith Cummins MP (Bradford South) has welcomed news of a significant funding boost that will secure the future of a vital community garden space in Bradford South.\nJudith provided key support for a funding application for Wibsey Community Gardens, who have been awarded £235,917 as part of the latest round of the Community Ownership Fund. This fund will empower communities to build opportunity and improve their local places.\nIn addition to being a place for residents to access low-cost fresh fruit and vegetables, Wibsey Community Gardens provides volunteering opportunities and a wide range of activities for residents to learn useful skills including growing fruit and vegetables, cooking, healthy eating, and recycling, all while helping people build confidence and strengthen community links.\nIn her supporting letter for the group’s funding application, Judith praised the Gardens as a “unique community green space in the heart of Wibsey village”.\n“The project does important work to encourage healthy eating and to support people to make more positive health choices.”\nJen White, of Bradford Organic Community Services who run Wibsey Community Garden said the funding will make ‘a huge difference’:\n“BOCS are thrilled to be awarded funds for Wibsey Community Gardens from the Community Ownership Funds Programme.\nWe thank everyone who supported our application and enabled this to happen. We know this will make a huge difference to the Gardens with improvements all over the site but especially to the growing areas and Polytunnels.\nThe Gardens provide an opportunity for many people to enjoy gardening and arts and craft activities and to have access to organically grown fruit, vegetables and salads, everyone is welcome.\nThis award will mean we can reach out to more people with a really improved Gardens.”\nSpeaking after the funding announcement, Judith said:\n“This funding recognises the special role Wibsey Community Gardens plays in bringing the local community together.”\n“I am delighted to have supported the group with their successful funding application, and I look forward to continuing to work with the team as they bring this important project to life.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_a-conservative-summer-of-job-cuts-judith-tells-parliament/content_105.html": "\"A Conservative summer of job cuts\" - Judith tells Parliament\n- judithcumminsmp\n- Sep 5, 2023\n- 2 min read\nUpdated: Dec 5, 2023\nYesterday in Parliament, Judith challenged the Government on their failing plan to grow the economy.\nQuestioning the Work and Pensions Minister, Judith highlighted the hundreds of jobs that have been lost in her Bradford South constituency:\n“In my constituency of Bradford South, we’ve seen a summer of job cuts with Morrisons and Solenis both announcing major redundancies.”\n“Does the Minister agree with me that this shows that the Government’s plan to ‘grow the economy’ is failing?”\nThe Office of National Statistics has recently published findings suggesting a rise in unemployment across Bradford over the past year. Unsustainable energy prices and the rising cost of production have forced several major employers to scale back or close their operations in Bradford South, at the cost of hundreds of jobs in the city.\nIn July, Bradford-based Morrisons announced plans to close its Cutler Heights fruit-packing plant, putting some 450 jobs at risk. Just weeks later, chemical firm Solenis announced 72 positions could be axed at their Low Moor plant as part of cost-saving measures.\nResponding, Minister for Employment Guy Opperman MP said:\n“Clearly, our Job Centres are doing a fantastic job and I am fully in support of all the work that is going on in Bradford to try and address these issues.”\nSpeaking afterwards, Judith said the government had failed to learn any lessons:\n“It should be obvious to anyone that people can only be supported into work if those jobs still exist. I have warned of job losses and demanded action from the Government time and time again.”\n“Yet, the concerns from businesses and workers that I first raised over a year ago were dismissed as an ‘extreme’ case. Instead of action, the Government continues to bury its head in the sand. This Government complacency has cost people their jobs. Now it is families in Bradford South who are paying the price; and people are rightly worried if it is their job next.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-praises-emergency-services/content_53.html": "Judith praises emergency services as she joins police on patrol\n- judithcumminsmp\n- Nov 7, 2024\n- 2 min read\nJudith Cummins, Member of Parliament for Bradford South has praised the response to the Bonfire period, following an evening on patrol with West Yorkshire Police ahead of Bonfire Night.\nJoining Bradford South Inspector Adam Beecroft and his team last Friday, Judith patrolled anti-social hotspots across the constituency.\nDuring the patrol, Judith discussed the joint approach to the busy bonfire period that sees the police, fire service, council and other agencies working together to report and respond to any incidents of anti-social behaviour as quickly as possible.\nJudith heard how planning started months in advance, engaging schools and community groups in the safe and responsible use of fireworks.\nMore bobbies on the beat meant that neighbourhood police could quickly identify and tackle anti-social behaviour, while extra youth activities by the Youth Service and local community groups ensured that young people had more things to do and places to go.\nThanking emergency services, partners and the community, Judith said:\n“Bonfire week is one of the most challenging periods for our emergency services. It was an eye-opening experience to join Inspector Beecroft and his team on one of their evening patrols.”\n“I am grateful to all the emergency services and partners whose hard work has ensured that residents have been able to enjoy this bonfire period safely and responsibly.”\nInspector Adam Beecroft, Bradford South said:\n“A lot of planning between Police and Partners goes on in the lead up to Bonfire night to ensure that Bonfire night is a safe and enjoyable night for the community. Both Police and partners worked tirelessly to ensure that Bradford South went largely without incident.\nI want to extend thanks to my partners for assisting make this happen as they proved invaluable in the lead up and on the night.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_energy/content_97.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nGovernment must act now to support energy intensive businesses and protect families\nBusiness\nJun 9, 2022\n2 min read\nJudith invites Shadow Chancellor to visit Bradford's Solenis\nBusiness\nMay 30, 2022\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_levelling-up/content_122.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\n\"Levelling Up has left Bradford even further behind\" says Judith\nNational\nMar 4, 2024\n2 min read\nJudith backs the Bulls after best season in years\nLocal News\nOct 27, 2023\n1 min read\nJudith pushes Govt to commit to levelling up and regeneration in Bradford\nBusiness\nOct 21, 2022\n2 min read\nJudith invites Chancellor to meet to take forward £50m Bradford South regeneration bid\nBusiness\nOct 12, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-hosts-street-walk-with-deputy-mayor-alison-lowe/content_76.html": "Judith hosts street walk with Deputy Mayor Alison Lowe\n- judithcumminsmp\n- Sep 20, 2022\n- 2 min read\nUpdated: Dec 6, 2023\nWest Yorkshire’s Deputy Mayor for Policing and Crime and Judith Cummins MP hear of positive police work during Holme Wood visit.\nBradford South MP Judith Cummins has invited West Yorkshire’s Deputy Mayor for Policing and Crime Alison Lowe OBE and Bradford South Neighbourhoods Inspector Andrew Thornton to Holme Wood to discuss recent work successfully tackling crime and anti-social behaviour.\nDuring the morning street ‘walkabout’, the group visited local community group the Valley Project and met with residents in Holme Wood to hear about local concerns and discuss future plans for the area.\nSpeaking with residents, Judith, the Deputy Mayor and Inspector Thornton heard of the immense pride and strong sense of community that residents of Holme Wood have, but how issues of anti-social behaviour and criminality were causing problems and having a negative impact on the perception of the estate.\nResidents also spoke about the problem of nuisance quads, an issue that Judith has raised in Parliament and is campaigning for tougher laws to curtail the use of these dangerous vehicles on our streets. Judith has been working together with Bradford South Police and the West Yorkshire Deputy Mayor to take action on antisocial behaviour and illegal use of vehicles, which has resulted in Bradford South Police operations successfully removing a number of problem cars, quads and motorbikes from our streets.\nAt the Valley Project, Judith and Alison met with the team to hear about their remarkable work over summer with hundreds of young people at their adventure playground, their plans for the future of the project, and the overwhelming community response to the recent vandalism on the site. Judith has supported the Valley Project since its launch, having previously helped the project secure funding for their vital work.\nSpeaking afterwards, Judith said: “Residents know their areas better than anyone. That is why I am always happy to invite senior figures to visit our communities to see and hear for themselves the issues residents are facing so we can harness the strength of the community to affect change.\nWest Yorkshire’s Deputy Mayor for Policing and Crime, Alison Lowe OBE said: “I was delighted to be invited to visit Holme Wood with Judith, police and local residents to talk about what work the police are undertaking in the area and what more needs to be done alongside our partners.It was particularly pleasing to see the fabulous Valley Project again who are making a massive difference to the lives of young people in the area and who are truly valued by those they serve. I look forward to returning in the coming months to take todays discussions forward.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news/content_37.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith encourages parents to have say on School Travel consultation\nLocal News\n2 hours ago\n1 min read\nJudith seeks assurances on Police's dangerous driving work\nCrime & ASB\n2 hours ago\n1 min read\nI am so often inspired by the energy of young people in Bradford\nLocal News\n3 hours ago\n1 min read\nOut with the Bang: Judith Raises Constituents’ Concerns about the ‘24/7, round-the-clock blight” of Fireworks with Minister\nCrime & ASB\nMar 28\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_trinity-academy/content_30.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith champions oracy skills at Trinity Academy\nLocal News\nNov 24, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_solenis/content_103.html": null,
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_wyke/content_71.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nComment: Job losses show Govt's plan to grow jobs is clearly failing\nBusiness\nNov 27, 2023\n1 min read\nJudith invites Shadow Chancellor to visit Bradford's Solenis\nBusiness\nMay 30, 2022\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_steerside/content_56.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith seeks assurances on Police's dangerous driving work\nCrime & ASB\n1 day ago\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_renting/content_58.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\n\"No renter should be left feeling insecure about their future\", says Judith\nNational\nOct 11, 2024\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_out-with-the-bang/content_70.html": "Out with the Bang! - Judith introduces Bill to curb noisy fireworks\n- judithcumminsmp\n- Apr 17, 2024\n- 2 min read\nUpdated: Oct 28, 2024\nToday, Judith introduced a Bill into Parliament calling for a reduction in the noise limits of fireworks available to the public.\nThe Bill would not affect fireworks used in public displays, or those conducted by those with specialist knowledge.\nSpeaking in Parliament, Judith said:\n“The Bill holds the power to protect people from disturbance, without impacting the experiences of those who use fireworks responsibly.”\nCurrently, the legal noise limit of fireworks available to the public is set at 120 decibels – equivalent to\nthe sound emitted by a pneumatic drill or a chainsaw. Judith is calling for this to be reduced to 90 decibels – equivalent to the sound emitted by a telephone ringing, or a hair dryer.\nPresenting the Bill, Judith recounted numerous experiences of residents within Bradford South:\n“One constituent described to me how the fireworks are literally window-pane shaking, 4 times a week, week after a week.”\n“Another spoke of local ex-servicemen, suffering from PTSD, who are constantly affected by loud, explosive, fireworks.”\nThe RSPCA is supporting my Bill, arguing that “by introducing measures like this, we can better priorities the safety and well-being of animals and vulnerable people.”\nJudith raised the issue of animal welfare during her speech:\n“One person spoke to me about a family member’s dog, who had died recently of a suspected heart attack as it lay quivering under his bed, terrified of fireworks.”\n“It is absolutely vital that animals and pets are considered alongside human needs.”\nSpeaking after introducing the Bill into parliament, Judith said:“The Government must take notice of people’s concerns about nuisance fireworks.”\n“Whilst fireworks are a great source of fun, they can cause misery for so many people.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_campaigns/content_4.html": "Help me to promote issues that are important to Bradford South. By clicking on the issues below, find out how to help in delivering the message.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_out-with-the-bang-judith-raises-constituents-concerns-about-the-24-7-round-the-clock-blight-of/content_31.html": "Out with the Bang: Judith Raises Constituents’ Concerns about the ‘24/7, round-the-clock blight” of Fireworks with Minister\n- judithcumminsmp\n- Mar 28\n- 1 min read\nJudith held a meeting with the Minister, Justin Madders MP, to raise resident's concerns about the 24/7, round-the-clock blight of fireworks.\nConstituents in Bradford South have long-complained about the impact of the anti-social use of fireworks on the community occurring on a daily basis.\nLast year, Judith introduced the Fireworks (Noise Limits) Bill into Parliament, which was designed to limit the upper noise limit of commercial fireworks to 90 decibels (the equivalent sound level of a ringing telephone).\nAs it currently stands, fireworks which can be bought by the general public can reach 120 decibels, which is the equivalent sound level of a chainsaw. The RSPCA previously supported Judith’s Bill, stating:\n“We believe that by introducing measures like this, we can better prioritise the safety and well-being of animals and vulnerable people...we urge Parliamentarians across the House to work with Judith on these welcome proposals.”\nWhilst Judith’s Bill did not become law due to the calling of a General Election, Judith met with the Minister responsible for regulating fireworks, Justin Madders MP, to discuss constituents’ concerns.\nSpeaking after the meeting, Judith said:\n“I welcome my meeting with the Minister, who I know is taking these concerns very seriously.”“These concerns cannot be ignored, and I know the impact that the antisocial use of fireworks is having on constituents’ day-to-day lives.”\n“I am delighted to have ensured that the voices of people in Bradford South are being heard at the very highest levels of Government.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_breast-cancer/content_48.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith \"wears it pink\" in support of Breast Cancer Now\nHealth\nOct 18, 2024\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_bonfire/content_60.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith praises emergency services as she joins police on patrol\nLocal News\nNov 7, 2024\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_a-cost-of-living-crisis-needs-a-bold-government-with-fresh-ideas/content_104.html": "Editorial: A cost-of-living crisis needs a bold Government with fresh ideas\n- judithcumminsmp\n- May 24, 2022\n- 3 min read\nUpdated: Dec 6, 2023\nThis column first appeared in the Telegraph & Argus\nAfter the last few years, chaos has become the new normal when it comes to our politics. It seemed the transition out of the EU and the disruption from the pandemic were becoming part of our past and we were all finding a new sense of optimism with hope and potential for the future. Then a cost-of-living crisis brought our energy bills to record highs and many families have been plunged back into uncertainty and anxiety. It is times like this, more than ever, that we need a serious government.\nPeople need real support and a proper plan.\nWhat a disappointment then, that last Tuesday the Government matched people’s eagerness for change with a raft of tired and rehashed plans that will do little to ease the struggles that my constituents and families are facing right now.\nLast week, the Queen’s Speech marked the opening of a new parliamentary session and was the opportunity for the Government to outline their plans to get us out of the mess we’re in. But 12 years of Conservative rule and they are out of ideas. There was nothing to tackle the cost-of-living crisis that is happening right now, no decent plan to protect our food and energy security from Putin’s Russia or other hostile states, and nothing to improve people’s daily lives. An employment bill which could protect workers, introduce minimum hour contracts, end fire and rehire practices, and stop people having to work multiple jobs just to get by, was completely left out.\nThis Government is out of touch and out of ideas.\nAs our energy bills skyrocket and the government makes undeliverable promises of rushed through nuclear power plants with no tangible plan for delivery, Labour has the plan and the seriousness to deliver an energy reform that is sustainable and ambitious, but also practical and protective of jobs.\nLabour has consistently pushed for a Windfall Tax on the massive profits oil and gas corporations are making thanks to the huge rise in people’s energy bills. Whilst the government try and defend the billions of pounds in profit for these big businesses and stoke fear about long-term investment, BP’s Chief Executive admitted that all of the planned £18bn investment in Britain over the next eight years would go ahead, even if a levy were imposed to meet the demands of this emergency.\nAs the Government dithers, I will spend the next few months pushing them to urgently address the shortage of NHS dentists and appointments, so that charities no longer need to intervene to protect our children’s oral health. I have raised the issue of poor access to NHS dentists with the Government every year since 2016 and on Monday I did so again. Six years on, the government hasn’t acted, and now we face a dentistry crisis.\nEarlier this month, I was proud to be sanctioned by the Kremlin for what they call “whipping up of Russophobic hysteria” and what I call fighting for Ukrainians right to live in peace and the freedom to determine their own future. My commitment to Ukraine is steadfast and I will continue to speak out against Putin’s shameful invasion.\nI will also continue to tackle the scourge of spiking in the country which has devastating consequences for its victims, and push for its recognition as a standalone crime. In particular, I am working to ensure that the 7.1 million people who attend outdoor music festivals every year – many of them young people – are fully protected by from these dreadful acts. On Monday this week, the Association of Independent Festivals demonstrated their commitment to improving with their Safer Spaces campaign and acknowledging that everybody has a right to enjoy themselves safely, with support and without fear.\nThat’s a good start.\nAs money gets tighter and tighter and the Government delays and delays, I will continue to push for more relief from this strangling cost-of-living crisis that means proud and hard-working people of Bradford are turning to food banks or having to pick between heating and eating. This Government is out of ideas. Bradford and Britain deserve better.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-welcomes-victory-spiking/content_89.html": "Judith welcomes victory on spiking - but says changes must go further\n- judithcumminsmp\n- Dec 21, 2023\n- 2 min read\nJudith has welcomed proposals to clarify the law on spiking following a lengthy campaign, but says more needs to be done to keep people safe.\nMeasures proposed by Government will see the wording of the Offences against the Person Act 1861 ‘modernised’ to remove ambiguity and ‘make it clear’ that the offence covers spiking in every form - but stops short of making spiking a specific, standalone offence in law.\nThe government’s announcements come just days after Judith led a cross-party debate in Parliament on spiking that highlighted that just 1 in 400 cases of spiking reported to police led to a criminal charge.\nReacting to the announcement, Judith welcomed the changes but said the government had missed a ‘clear opportunity’ to make the law fit for the 21st Century:\n“I welcome any measures to tackle the awful crime of spiking, so I look forward to the Government’s amendments to the Criminal Justice Bill.”\n“The National Police Chiefs’ Council has stated that a stand-alone offence would help it to understand the scale of the problem, enable a more accurate picture to be realised and allow enhanced support for victims.”\nMaking the announcement in Parliament, Safeguarding Minister Laura Farris MP thanked Judith for her work on spiking and acknowledged the devastating effects of the crime:\n“By their very nature, spiking cases are complex. The work we have done tells us that there are particular challenges in identifying perpetrators and gathering evidence.”\nFurther measures announced include Home Office funding to research the effectiveness of rapid drink testing kits, support for police to roll out a spiking reporting and advice tool, and the introduction of training on spiking for door supervisors.\nHowever, Judith raised concerns at the safeguarding ‘black hole’ at music festivals left behind by these measures, saying:\n“It is welcome news that hundreds of door staff will be trained to change the response to spiking at every single level, but I am at a loss as to the logic for why the Government have not included training for staff at outdoor music festivals, where tens of thousands of under 18-year-olds attend, often camping out, and where private security firms are tasked with their safety.”\nSpeaking afterwards, Judith said:\n“These are welcome first steps, and I am pleased that after years of campaigning, Government appears to finally be taking spiking seriously. However, the devil will be in the detail. Police must have the powers they need to effectively record and investigate these crimes, so that victims get the support the deserve and perpetrators feel the full consequences of the law.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_osteoporosis/content_126.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nTo save lives, the Government must set new targets to tackle the ‘silent disease’\nHealth\nJun 6, 2023\n2 min read\nPut an end to postcode lottery for bone health, demands Judith\nHealth\nApr 13, 2023\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_categories_comments/content_15.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nComment: Job losses show Govt's plan to grow jobs is clearly failing\nBusiness\nNov 27, 2023\n1 min read\nComment: Next closure worrying and difficult news for staff\nComments\nNov 17, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/http_www_judithcummins_org_uk/content_1.html": "top of page\nJudith's Ongoing Campaigns\nJudith continues to fight for Bradford South on a range of issues, both locally and in the UK Parliament. She is a leading figure in pushing for NHS Dental Reform; She has been successful in securing new legislation to tackle dangerous driving; she passionately advocates for strong action against spiking; and she is active in a number of Foreign Policy areas vital to UK security and in relation to International Trade.\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-ukraine-cannot-be-left-waiting-for-much-needed-supplies-1/content_59.html": "Judith: \"Ukraine cannot be left waiting for much needed supplies.\"\n- judithcumminsmp\n- May 19, 2023\n- 1 min read\nUpdated: Dec 5, 2023\nWe must ensure that the promised and much-needed military, economic and humanitarian supplies get to Ukraine promptly.\nFollowing this week’s visit by President Zelensky, the UK government pledged further support through drones and military hardware.\nUkraine’s ability to defend its territorial integrity against Russian expansionism impacts all of us.\nHowever, just this week the government has faced criticisms about the ‘mismatch’ between Ukraine’s need to get on with the job and the time it is taken the UK and allies to give Ukraine the support it needs to launch its counter-offensive.\nI asked the Secretary of Defence directly to ensure that the UK government continues to assess the pace of delivery of these vital supplies.\nResponding, Secretary of State for Defence Ben Wallace argued: ‘Some countries, as President Zelensky has said, have made pledges, but part of the delays is in getting the equipment ready to donate.’\n‘Our 12 Challengers are already in the country. We will make sure we keep monitoring it and pushing it as fast as possible’.\nI will continue to push the government to act quickly in supplying Ukraine with the equipment it needs. Ukraine cannot be left waiting for supplies as it seeks to defend its own territorial integrity.\nhttps://twitter.com/JudithCummins/status/1658510597594415119",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_spiking/content_64.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith chairs bill introducing Standalone Offence for heinous crime of Spiking\nCrime & ASB\nMar 14\n2 min read\nPMQs: “We Need Action, Not Just Words, to Tackle the Scourge of Spiking” – says Judith\nCrime & ASB\nMar 6, 2024\n2 min read\nJudith welcomes victory on spiking - but says changes must go further\nCrime & ASB\nDec 21, 2023\n2 min read\nChristmas Editorial: Fighting for you on the issues that matter\nLocal News\nDec 18, 2023\n4 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_about/content_16.html": "About My Work.\nAbout Judith\nJudith Cummins is the Member of Parliament for Bradford South\nWhen first elected in 2015, she became the first woman Ruskin College parliamentarian .\nSince being elected, Judith has successfully fought to save the Bradford Bulls and the National Science and Media Museum, and to increase sentences for dangerous drivers, as well as securing extra funding for NHS dentistry to Bradford South.\nIn parliament, Judith has campaigned for better transport links for the North (including bringing Northern Powerhouse Rail, which will boost our economy by £1.3bn, to Bradford) improving oral health, especially among children, and better jobs for the Bradford South constituency.\nJudith has also consistently spoken out on protecting our NHS and giving the police the funding they need to fight crime. She has been working closely with community and faith groups to support people through tough times.\nJudith has been a member of the House of Commons Panel of Chairs, a role that has seen her chairing debates and public bills committees.\nShe lives in her constituency with her husband and two children.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-champions-oracy-skills-at-trinity-academy/content_27.html": "Judith champions oracy skills at Trinity Academy\n- judithcumminsmp\n- Nov 24, 2023\n- 1 min read\nLast week, Judith spoke to a packed hall of Year 7 and 8 students at Trinity Academy, Queensbury.\nAs part of their 'Trinity Talks' project, which sees students learn about a wide range of important communication skills from interviews to poetry, students invited Judith to speak about her work as Member of Parliament and the importance of debating skills in Westminster.\nJudith told the assembly of over 400 students about some of the important skills she uses everyday, including having a strong knowledge of the issue, taking in a wide range of views, examining arguments critically, and actively listening to opposing views:\n\"People often think that debating is about disagreeing and winning the argument. It is not, it is about understanding different perspectives, considering those opposing viewpoints, and understanding why someone might have that point of view. By doing that, you can work together to find the common ground between the person you disagree with.\"\nWrapping up, Judith encouraged students to take part in healthy debate and active listening:\n\"So, keep debating, keep learning and keep building your speaking skills with Trinity Talks. Bradford South needs more informed, thoughtful and respectful voices like yours!\"\nJudith looks forward to welcoming students from Trinity Academy to Parliament in the near future!",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-oversees-bill-to-introduce-tougher-measures-to-tackle-nuisance-off-road-vehicles/content_42.html": "Judith Oversees Bill to Introduce Tougher Measures to Tackle Nuisance Off-Road Vehicles\n- judithcumminsmp\n- Mar 14\n- 2 min read\nThis week, Judith Cummins, the Labour MP for Bradford South and Deputy Speaker of the House of Commons, oversaw a bill that will give police powers to more easily tackle the misery and disruption caused by the misuse of quad bikes, e-bikes and e-scooters on our streets.\nNew laws in the Government’s Crime and Policing Bill to tackle neighbourhood crime follow up on manifesto commitments, making it easier for police to seize nuisance off-road vehicles, by removing the need for police to provide a prior warning to the driver.\nJudith has long called for tougher rules to tackle antisocial behaviour caused by the misuse of off-road vehicles. In 2022, Judith brought a bill to Parliament which called for greater police powers to seize and destroy nuisance off-road vehicles, meaning that once seized, they can never plague streets again.\nSpeaking at the time, Judith highlighted the noise nuisance quads cause in local communities, and the devastating impact their misuse can have on road users and pedestrians:\n“The constant, loud, piercing drone of quad bikes is an all-too familiar sound in many of our towns and cities. And when the worst happens, the result are catastrophic.”\nMeanwhile, figures show that crimes involving e-bikes and e-scooters have rocketed by over 700% in the last five years – leaping from 1,354 in 2019/2020 to 11,266 last year.\nSpeaking on the introduction of the Bill, the Home Secretary Yvette Cooper said:\n“I and many others will have heard the same story too many times[…] residents driven mad by the soaring number of roaring off-road bikes and scooters driven in an antisocial and intimidating way.’\n“The Bill gives neighbourhood police more powers to tackle the local crimes that undermine and damage communities”.\nSpeaking afterwards, Judith said:\n“It is vital that vehicles seized by the police are not returned back on to the streets.”\n“We need tough action to ensure that our roads and streets are safe, and that the users of nuisance off-road vehicles face the consequences of their reckless actions.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_no-renter-should-be-left-feeling-insecure-about-their-future-says-judith/content_35.html": "\"No renter should be left feeling insecure about their future\", says Judith\n- judithcumminsmp\n- Oct 11, 2024\n- 1 min read\nToday, the Deputy Speaker and Labour MP for Bradford South, Judith Cummins, Chaired the Renters’ Rights Bill in Parliament, which will provide several new protections for those who rent. It includes a ban on ‘no-fault’ evictions.\nMore widely, it will give greater security and stability to people to ensure that they can stay in their homes for longer, build lives in their communities, and avoid the risk of homelessness.\nThe bill will give tenants more time to move if evicted, introduce an Ombudsman with the ability to handle complaints and enforce solutions, and end the practice of bidding for rent.\nIt would also make it illegal for landlords to discriminate against those with children or in receipt of benefits and strengthen rights for owners of pets in rented properties.\nSpeaking about the Bill, the Deputy Prime Minister and Secretary of State for Housing said:\n“There can be no more dither and delay. We must overhaul renting and rebalance the relationship between tenant and landlord. This Bill will do just that and tenants can be reassured this Government will protect them.”\nFollowing the debate, Judith said:\n“No renter should be left feeling insecure about their future.”\n“A functioning rental sector provides flexibility for those who need it and serves as a stepping stone for those aspiring to homeownership.”\n“Renters across Bradford South deserve proper protections under the law.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_pmqs/content_108.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nPMQs: “We Need Action, Not Just Words, to Tackle the Scourge of Spiking” – says Judith\nCrime & ASB\nMar 6, 2024\n2 min read\nJudith to question Prime Minister at PMQs\nNational\nMar 6, 2024\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_profile_judith-cummins-mp_profile/content_3.html": null,
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_crime/content_82.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith slams government delay on vital spiking report while charities launch legal action\nCrime & ASB\nSep 8, 2023\n2 min read\nEditorial: Action needed on Dangerous Driving\nCrime & ASB\nMar 1, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-chairs-debate-on-damning-report-on-state-of-nhs/content_36.html": "Judith chairs debate on damning report on state of NHS\n- judithcumminsmp\n- Oct 9, 2024\n- 2 min read\nJudith has chaired a debate on a recent dire report showing people are waiting too long for care.\nCommissioned almost immediately after Labour’s victory in July, Lord Darzi’s independent investigation into NHS performance showed that people are waiting too long for care throughout all areas of the NHS, contributing to thousands of extra deaths.\nThe report also attributes the state of the NHS to a number of causes. One is the period of austerity and cuts ushered in by previous governments. It also points to reforms in 2012 as “a calamity without international precedent.”\nOutlining Labour’s response to the report in September, the Prime Minister said:\n“What we need is the courage to deliver long-term reform – major surgery not sticking plaster solutions. The NHS is at a fork in the road, and we have a choice about how it should meet these rising demands.”\n“Raise taxes on working people to meet the ever-higher costs of aging population – or reform to secure its future. We know working people can’t afford to pay more, so it’s reform or die.”\nSpeaking in the debate, Health Secretary West Streeting said it was ‘reform or die’ for the NHS:\n“This month, we will begin formal engagement with NHS staff and patients who will help write the 10-year plan for our NHS, a plan that will deliver the change and modernisation that our health service is crying out for”\nSpeaking following the debate, Judith said:\n“In Bradford, nearly a fifth of all patients end up waiting more than four hours in A&E to be seen in A&E.”\n“This report lays bare the crisis that the NHS has been long facing. We need change to create an NHS that is fit for the future.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_categories_business/content_26.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith chairs debate to bring an end to the prospect of future mini-budget disasters\nNational\nSep 20, 2024\n2 min read\nJudith calls for a Queensbury Banking Hub\nLocal News\nJan 26, 2024\n2 min read\nJudith supports Small Businesses in Bradford\nBusiness\nDec 5, 2023\n1 min read\nComment: Job losses show Govt's plan to grow jobs is clearly failing\nBusiness\nNov 27, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_fighting-for-you-on-important-issues/content_45.html": "Christmas Editorial: Fighting for you on the issues that matter\n- judithcumminsmp\n- Dec 18, 2023\n- 4 min read\nThis article first appeared in the Telegraph & Argus on Saturday 16 December 2023\nThe many Christmas events taking place across Bradford bring people together and spread festive joy to thousands. Christmas is both a wonderful time of optimism for what the next year might bring, and a time of reflection and consideration for the year gone by.\nI imagine for this Conservative government there is precious little optimism ahead – and their report card for the past year makes for grim reading. They end the year with the cost-of-living still crippling family budgets, an insecure economy that has caused the loss of hundreds of jobs in Bradford, and an NHS that is strained to breaking point.\nInstead of bold policies that address the challenges people are facing, we have had a year of recycled pledges and promises – more of the same from over thirteen years of tired leadership.\nWhile the government has all but given up on governing, I have continued to work on issues that matter to my constituents in Bradford.\nJoin me in taking action on anti-social fireworks\nSpectacular fireworks are an important and enjoyable part of our annual celebrations, and I am sure many of us will be welcoming in the New Year with friends and family, perhaps watching some of these breath-taking displays.\nYet, while the vast majority of us use fireworks safely and responsibly, their anti-social and illegal use is a year-round blight for people in Bradford. Residents are having to tolerate their misuse almost every day, seemingly without rhyme or reason. We are not talking about the odd ‘bang’ or one-off display, but constant and disruptive noise pollution that robs residents of sleep, peace, and causes unnecessary stress and anxiety to people and pets.\nI have proposed lowering the legal limit on the volume of fireworks from 120 decibels (as loud as a pneumatic drill you’d find on a construction site) to just 90 decibels (about as loud as a ringing telephone).\nThis would significantly reduce the disruptive impact and noise footprint of fireworks used anti-socially without affecting their legitimate use. ‘Low noise’ fireworks are readily available and compromise none of their spectacular visual effects that are so dearly loved in displays.\nWhile I was pleased the Minister said my proposal would be given ‘due consideration’, we in Bradford must make it clear to government that we have had enough. That is why I have launched a parliamentary petition to make our strength of feeling on anti-social firework use clear. I encourage residents to sign and share with as many friends and family as possible so that we can see meaningful action on anti-social and illegal use of fireworks in Bradford\nGovernment needs to step up to tackle the scourge of spiking\nAt a time of year where we are making lasting and precious memories with friends and family, it is only right that everyone deserves to always be safe when enjoying company at bars, pubs, clubs and festivals.\nThe unseen epidemic of the disgusting and cowardly crime of spiking is putting people, especially women and girls, at risk. It is simply shocking that 11% of women and 6% say they have been spiked, while almost half of women say they know someone who has been spiked.\nThese insidious drugs leave people incredibly vulnerable, disrupting their memories and cognition, and stealing from them their ability to consent and make informed decisions. This profound violation means that 97% of spiking victims never report it in the first place.\nHowever, the laws that are meant to protect people from this heinous crime are hopelessly out of date, making it even harder for victims of spiking to come forward about their experiences.\nFor those who do come forward, their incredible bravery is met with a confusing set of laws that could see the crime categorised under any of seven different offences. This makes recording and tracking the true scale of spiking nearly impossible. Last year, just 1 in 400 cases of reported spiking resulted in a criminal charge. This is unacceptable – just where is the justice for survivors?\nI led a Parliamentary debate on spiking last week to highlight this unacceptable blind spot and I demanded meaningful action – including making spiking a specific offence under law.\nUnfortunately, we have a Government who refuse to take this crime seriously. They are now eight months overdue on a report into the prevalence and scale of spiking that they were legally required to produce. While they dither and delay with no national strategy, women and girls are left at risk.\nIn stark contrast to the Government’s inaction, Labour leader Keir Starmer has already committed to make spiking a specific offence. The National Police Chiefs’ Council have said a standalone offence would help police to better understand the scale of the problem and lead to better support for victims.\nThis would make our night-time and festival economies safer for everyone. It would increase prosecutions and convictions and would mean that the law is a real deterrent to those vile perpetrators.\nIt would encourage more survivors to come forward and ensure they get the justice they deserve. The route on this is clear, we just need a government bold enough to seize it.\nAs we move into a brand-new year, I promise to champion the issues that matter to my constituents. How ever you are celebrating the festive period, I wish you and your families a safe and merry Christmas, and a happy and peaceful New Year.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_dangerous-driving/content_81.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nEditorial: Action needed on Dangerous Driving\nCrime & ASB\nMar 1, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_subscribe/content_12.html": "Be the first to receive updates about my work, and what I'm doing for Bradford South\nThanks for submitting!\nYour personal information will be kept private and held securely. You can unsubscribe at any time. For more information about how and why Judith and the Labour Party uses your information and your rights, see our privacy policy: https://labour.org.uk/privacy/privacy-notices/general-electorate-privacy-notice/",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-welcomes-statement-on-future-of-steel-manufacturing-in-the-uk/content_33.html": "Judith chairs statement on Future of steel manufacturing in the UK\n- judithcumminsmp\n- Sep 20, 2024\n- 2 min read\nUpdated: Nov 13, 2024\nJudith at a recent visit to Barrett Steel in Bradford South\nJudith has welcomed discussion in Parliament on the future of the UK steel industry.\nOverseeing Business Questions in the Commons on Thursday in her role as Deputy Speaker of the House of Commons, Judith presided over an Urgent Question from Martin Vickers MP (Briggs and Immingham), urging the government to consider the future of steel manufacturing in the UK.\nResponding, Minister for Industry Sarah Jones MP said the government ‘had a clear forward direction on steel’:\n“Steel has been a priority since our first day in office. We are standing by our commitment to spend £2.5bn to rebuild the steel industry. This funding will harness public and private investment to secure jobs and boost growth. We will take action to improve the wider business environment for the sector including reducing energy bills, and enabling more green UK-made steel to be used in our infrastructure projects. Decarbonisation must not mean de-industrialisation.”\nEarlier this year, Judith visited Bradford-based Barret Steel, the United Kingdom’s largest independent steel stockholder and supplier, to discuss many of the key issues the UK steel industry. This included the impact of plans to transition to greener Electric Arc Furnaces, rising energy costs in steel production and transport, and the ongoing work to decarbonise many parts of the industry.\nNew Electric Arc Furnaces are able to manufacture high quality steel for a wide range of uses while producing a fraction of the greenhouse emissions as traditional coke-fired furnaces. However, they rely on competitive industrial energy prices, and renewable energy sources, to sustainably meet net zero targets.\nCommenting afterwards, Judith said: “A thriving UK steel industry is not just vital for the tens of thousands of jobs it sustains directly and in the wider supply chain. The United Kingdom’s ability to effectively manufacture and utilise good quality steel with less dependency on foreign production is also an essential component of our national security. I welcome discussion to secure the future of the industry in the United Kingdom.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-campaigns-for-more-to-be-done-to-protect-young-girls-and-women-from-spiking-and-assault/content_129.html": "Judith campaigns for more to be done to protect young girls and women from spiking and assault\n- judithcumminsmp\n- Jan 13, 2022\n- 2 min read\nYesterday in Parliament, Judith challenged the government on their response to young girls and women being spiked. There has been a rise in the reporting of needle spiking in the media and on social networks in recent months. Across September and October of last year, the National Police Chief’s Council reported 198 confirmed reports of drink spiking, and 56 reports of spiking through injections.\nSpeaking in the commons, Judith Cummins MP asked: “Many girls and women are afraid of enjoying a night out or going to a music festival for fear of being spiked, raped, and assaulted. What work is the minister doing with venues such as bars, nightclubs and music festivals to prevent this from happening and to ensure appropriate safeguarding measures are in place, and what is the assessment of the scale of problem at these venues?”\nIn response, Rachel Maclean, Minister for Safeguarding responded: “The night time economy are playing a key role, and they are taking their responsibilities seriously. We work very closely with them as the government and we’re we are providing funding and helping them provide training to staff so women can feel safe at night.”\nCommenting after, Judith said: “No-one should be at risk whilst enjoying time with friends, and the fact is that spiking and sexual assault disproportionally affect girls and women. While I welcome the work to tackle drinks spiking, I remain worried that proper safeguarding measures are not in place. The Government urgently need to improve the understanding of the scale and impact of spiking of this worrying crime, and work with police, venues and event organisers to prevent this type of crime so that women and girls are safe.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_categories_crimeasb/content_24.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith seeks assurances on Police's dangerous driving work\nCrime & ASB\n1 day ago\n1 min read\nOut with the Bang: Judith Raises Constituents’ Concerns about the ‘24/7, round-the-clock blight” of Fireworks with Minister\nCrime & ASB\nMar 28\n1 min read\nJudith Oversees Bill to Introduce Tougher Measures to Tackle Nuisance Off-Road Vehicles\nCrime & ASB\nMar 14\n2 min read\nJudith chairs bill introducing Standalone Offence for heinous crime of Spiking\nCrime & ASB\nMar 14\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-chairs-bill-introducing-standalone-offence-for-heinous-crime-of-spiking/content_55.html": "Judith chairs bill introducing Standalone Offence for heinous crime of Spiking\n- judithcumminsmp\n- Mar 14\n- 2 min read\nThis week, Judith Cummins, the Labour MP for Bradford South and Deputy Speaker of House of Commons chaired a bill that will modernise the law around spiking, bringing in a new, specific criminal offence.\nSupporters say that the measures on spiking in the Crime and Policing Bill will give survivors the confidence to come forward, make it easier for police to respond more quickly, and ensure that survivors get the support they need - and the justice they deserve.\nSpiking can include, but is not limited to, putting alcohol into someone’s drink without their knowledge or permission, or administering prescription or illegal drugs without an individual’s permission.\nWhile a 2022 Yougov poll found that 10% of women and 5% of men said that they had been spiked, spiking is chronically under-reported, with one study by Drinkaware and Anglia Ruskin University finding that 90% of people who have been spiked never come forward to report it to police.\nCurrently, spiking can be prosecuted under seven separate criminal offences, some – some dating as far back as the Offences Against the Person Act 1861. The Crime and Policing Bill modernises the language, increases the maximum penalty and updates how courts deal with spiking offences.\nThe aim, according to the Ministry of Justice is to ‘give victims the confidence to come forward and report incidents’, ‘improve police record leading to more accurate data’, and ‘tackle the key barriers to prosecution – gathering evidence and identifying perpetrators’.\nThe new legislation, introduced by the new Labour Government, is a victory for spiking campaigners. Judith has long campaigned to introduce a standalone offence for spiking. In December 2023, Judith led a cross-party debate that called for the then-Conservative Government to ‘take a stand against this injustice’ and make the ‘the law on spiking fit 21st Century’ with a standalone offence.Speaking on the Bill, the Home Secretary Yvette Cooper said:\n“Too many women and girls are still facing stalking, spiking, violence and abuse. This Government will be tough on crime, and tough on the causes of crime – something that hasn’t happened for far too long.”\nSpeaking after Chairing, Judith said:“Spiking is a heinous crime, which affects so many people, often young women, all across the country. We must do everything we can to stop this crime and to ensure that the victims of spiking get the justice that they deserve.”\nJudith Cummins met with Drinkaware and Representatives from Anglia Ruskin University last month to discuss their recent report on Spiking (Image credit: Judith Cummins)",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-chairs-great-british-energy-bill/content_39.html": "Judith chairs Great British Energy Bill\n- judithcumminsmp\n- Nov 6, 2024\n- 1 min read\nLast week, Judith chaired the third reading of the Great British Energy Bill.\nYou can read more in the Telegraph & Argus here: https://www.thetelegraphandargus.co.uk/news/24693609.judith-cummins-chairs-great-british-energy-bill-reading/",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_column-action-needed-on-dangerous-driving/content_79.html": "Editorial: Action needed on Dangerous Driving\n- judithcumminsmp\n- Mar 1, 2023\n- 1 min read\nUpdated: Dec 5, 2023\nDanger driving continues to be a blight on Bradford roads.\nAll too often I hear from my constituents of the tragic consequences of dangerous driving. They tell me about their loved ones who have been seriously injured, or their lives cut tragically short.\nReckless and anti-social driving, and the illegal use of off-road vehicles on our streets and sometimes even our paths, matter both to me and my constituents in Bradford South. Hundreds of residents signed my petition on dangerous driving that I recently presented to Parliament – agreeing that urgent action is needed.\nThere is some excellent work being done by the Bradford and West Yorkshire Police and their dedicated Operation Steerside enforcement team.\nThis includes a number of recent high profile vehicle seizures. Nevertheless, policing has been stripped threadbare of the investment it needs to tackle dangerous driving effectively. Police should be fighting crime, not fighting for funding.\nImproving road safety for all vehicle users and pedestrians is an issue that I have campaigned on for as long as I have been a Member of Parliament.\nI was delighted when, after years of fighting for much needed changes in the law, the law was changed to bring forward tougher sentences for those who cause death by dangerous driving.\nLast year I brought a bill to Parliament aimed at tackling the misuse and abuse of dangerous off-road vehicles.\nThis reflected my belief that the police need greater powers to seize and destroy problem quads.\nThe Government must ensure that local policing has the resources it needs to deal with this menace.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-attacks-car-insurance-rip-off-in-bradford/content_99.html": "Judith attacks 'car-insurance rip-off'\n- judithcumminsmp\n- Nov 30, 2023\n- 1 min read\nUpdated: Dec 6, 2023\nSpeaking in Parliament, Judith Cummins MP attacked the “car insurance rip-off” affecting people in Bradford.\nLast year, Bradford faced the highest increase in car insurance prices across the whole of Yorkshire, with the average insurance premium standing at a staggering £879.\nThis falls against a backdrop of soaring car insurance. An investigation by The Independent found that nationally, premiums rose by 48 per cent in the year to June 2023.\nCalling for a debate on the issue in Parliament, Judith said it was those law abiding drivers who were paying the price:\n“The car insurance rip-off means that law-abiding citizens in Bradford are left paying for the reckless criminality of others.”\nResponding, the Leader of the House of Commons, Penny Mordaunt MP acknowledged the “huge amount of interest” on this issue and that legislation should “ensure that competition is working well, and that we really ensure the consumer is king”.\nSpeaking afterwards, Judith said:\n“My constituents spend a lot of their hard earned money on cars. But rising insurance premiums risk pricing my constituents out of car ownership all together. The insurance companies use a formula based on your postcode, rather than solely your record as a driver - that can’t be right, “",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_community/content_101.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nWibsey Community Garden receives £230,000 funding boost with support from Judith\nLocal News\nJan 10\n2 min read\nJudith hosts street walk with Deputy Mayor Alison Lowe\nCrime & ASB\nSep 20, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-invites-shadow-chancellor-to-visit-bradford-s-solenis/content_80.html": "Judith invites Shadow Chancellor to visit Bradford's Solenis\n- judithcumminsmp\n- May 30, 2022\n- 1 min read\nUpdated: Dec 5, 2023\nJudith and Shadow Chancellor Rachel Reeves have heard of astronimical rise in energy costs for Bradford's biggest energy-intensive firm.\nRachel was invited by Judith to visit chemical company Solenis in Low Moor, Wyke, last week.\nHearing that Solenis' energy bills had rocketted five-fold, Rachel said:\n\"Their energy bill here has gone up from £7m to £35m in two years, because there’s no price cap for businesses. Other countries are standing behind their energy-intensive industries, like this one.\"\n\"The Government has announced nothing for businesses, whether that’s smaller high-street businesses that are struggling or indeed with big businesses like this who have global competitors who haven’t experienced the same sort of increase in their energy bills.\"\n\"If businesses aren’t getting the support, that means less money for investment, it means less money for working people.\"\nTouring the site, Judith added:\n\"We’re not competing in the UK on a level playing field at all and Government isn’t helping our businesses out. I’m worried that, as a consequence, jobs may suffer.\nDavid Calder, Solenis' site manager said:\n\"It's always good to show people what's going on in Bradford. It's good to explain to politicans the challenges we face and how Government could help.\"",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_healthcare/content_73.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nSave our Pharmacies: Judith delivers petition to Parliament\nHealth\nSep 7, 2023\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_nhs/content_52.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith chairs debate on damning report on state of NHS\nHealth\nOct 9, 2024\n2 min read\nEditorial | 2024: A Year for Change\nLocal News\nJan 24, 2024\n4 min read\nSave our Pharmacies: Judith delivers petition to Parliament\nHealth\nSep 7, 2023\n2 min read\nPetition: Save our Pharmacies\nHealth\nJul 26, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_categories_local-news/content_17.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith encourages parents to have say on School Travel consultation\nLocal News\n1 day ago\n1 min read\nI am so often inspired by the energy of young people in Bradford\nLocal News\n1 day ago\n1 min read\nTo Build Bradford's future we must invest in its people today\nLocal News\nMar 28\n1 min read\nJudith praises police work to tackle danger driving\nLocal News\nMar 4\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-encourages-parents-to-have-say-on-school-travel-consultation/content_2.html": "Judith encourages parents to have say on School Travel consultation\n- judithcumminsmp\n- 5 hours ago\n- 1 min read\nAfter fighting hard for a temporary solution to securing bus services for the next academic year for St Bede’s and St Joseph’s School, Judith is encouraging everyone to have their say on the newly launched School Travel consultation by the West Yorkshire Combined Authority.\nThe Combined Authority is reviewing the way it supports travel to and from school across West Yorkshire. This consultation runs from Wednesday 23 April to 23:59pm Wednesday 11 June 2025.\nThe questionnaire is open to everyone, but they particularly want to hear from you if you are:\nCurrently in secondary or primary school\nA parent or carer of a child currently in school\nResponding on behalf of a school\nHave your say here: https://www.yourvoice.westyorks-ca.gov.uk/school-travel",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_sport/content_133.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith backs the Bulls after best season in years\nLocal News\nOct 27, 2023\n1 min read\nLevelling Up: Bradford left behind by this Government once again\nLocal News\nJan 19, 2023\n2 min read\nJudith wants Bradford at the centre of the next Rugby League World Cup\nLocal News\nOct 26, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-queensbury-banking-hub/content_63.html": "Judith calls for a Queensbury Banking Hub\n- judithcumminsmp\n- Jan 26, 2024\n- 2 min read\nJudith is campaigning for better access to face-to-face banking services in Bradford.\nJudith is exploring the banking hubs to maintain access to cash in Queensbury\nIn Judith’s Bradford South constituency, the closure of the last bank branch in 2022 means that many people must now travel three miles to access in-person banking, making it much harder for people to access cash, pay money in or get face-to-face help.\nJudith has been working with LINK, the UK’s largest cash machine network provider and who have a responsibility to review every community’s access to cash, to examine the challenges residents face accessing financial services in Bradford South.\nFollowing a review requested by Judith, LINK has agreed to visit Queensbury to complete a full community assessment to see if a local banking hub is suitable.\nA ‘banking hub’ is like a traditional bank branch but is available to everyone. They have a counter service where customers of all main banks can withdraw and deposit cash, make bill payments, and carry our regular banking transactions. The hubs have private spaces where people can see someone from their own bank on a rotating basis - so there will be staff from different banks available on different days.\nSpeaking about her work with LINK, Judith said:\n“Banking hubs are starting to be set up where there is a clear need for improved access to banking services. There is a strong case for Queensbury to have one and the opportunity to be explore this possibility with LINK is exciting.”\n“Queensbury’s location as one of the highest villages in England means that residents and the community’s many thriving local businesses must either travel down into the city centres of Bradford or Halifax to get to their nearest branch.\n“Everyone should be able to sort their banking locally, without having to travel miles and miles.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_employment/content_49.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nComment: Job losses show Govt's plan to grow jobs is clearly failing\nBusiness\nNov 27, 2023\n1 min read\nComment: Next closure worrying and difficult news for staff\nComments\nNov 17, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk/content_23.html": "top of page\nJudith's Ongoing Campaigns\nJudith continues to fight for Bradford South on a range of issues, both locally and in the UK Parliament. She is a leading figure in pushing for NHS Dental Reform; She has been successful in securing new legislation to tackle dangerous driving; she passionately advocates for strong action against spiking; and she is active in a number of Foreign Policy areas vital to UK security and in relation to International Trade.\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_press-comment/content_43.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nComment: Job losses show Govt's plan to grow jobs is clearly failing\nBusiness\nNov 27, 2023\n1 min read\nComment: Next closure worrying and difficult news for staff\nComments\nNov 17, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_let-the-city-of-culture-win-transform-bradford/content_118.html": "Let the City of Culture win transform Bradford\n- judithcumminsmp\n- Jun 22, 2022\n- 3 min read\nUpdated: Dec 5, 2023\nThe moment it was announced that Bradford had won the City of Culture 2025 title is a moment I will never forget. The crowds gathered in City Park erupted in cheers and applause at the sheer joy and immense pride of winning the title. I have said it many times in the past three weeks but it deserves to be said again: Congratulations Bradford!\nAnd while we are sure to enjoy all sorts of exciting cultural events across Bradford District during our year with the crown, that is just the tip of the iceberg. The City of Culture title is not just twelve months for Bradford to shine in the national limelight. It is a transformative opportunity for the city to unlock its potential and make sure Bradford’s light keeps burning brightly for years to come.\nPrevious title winners have seen tens of millions of pounds of long-term investment – and there is no reason why Bradford can’t do better. Bradford is the youngest, most entrepreneurial city in the country and study after study has shown it is the city with most to gain from levelling up and investment. Our City of Culture win is an unmissable opportunity to leverage investment, funding and ideas into the city.\nIt is about raising Bradford’s profile and making the case that we are open for business. It is a chance to showcase Bradford businesses to the world and to show that if you’re a company, then Bradford is a thriving place to come and do businesses too.\nBut to make the most of this springboard opportunity, families and businesses need support with the day-to-day struggle of making ends meet right now. I know times continue to be hard today but, what is worse, is that the country is on track to face an even harsher energy and cost of living crisis this winter.\nIn January, Labour proposed a one-off windfall tax on North Sea oil and other gas producers who are raking in obscene profits while ordinary people struggle, as a way to fund help with soaring energy costs. It took five months for the Government to finally accept that this was the right thing to do.\nFrom January to May, the Chancellor Rishi Sunak left families, older people and those already pushed to breaking point worried, panicking and stuck because the Government failed to act.\nI have long been calling on the Government to take action. In September 2021, I raised my concerns regarding our dwindling natural gas reserves directly with the Business Secretary and challenged the Government’s decision to stop investing in gas storage. I was met with meaningless rhetoric about future energy diversification and no plan – right before an energy crisis caused by a surge in wholesale gas prices. Then in May this year, we heard how the UK had a huge surplus of gas - but that we had nowhere to store it, while announcements were made that as many as six million households could face power cuts because of gas shortages.\nAnd it’s not just people here that are being hit by the cost of energy; it is affecting local businesses too. Some are facing astronomical energy bills as the energy price cap does not apply to businesses. I visited one energy-intensive manufacturer recently who told me their energy bills have skyrocketed from £7 million to £35 million a year. When I asked the Business and Energy Minister what plans the Government had to support businesses like this, the Minister simply dismissed this as an ‘extreme case’ – yet I am hearing that this is the story up and down the country. The government needs to listen to businesses and step in to help them.\nThis is important. Bradford’s manufacturing industry is part of the city’s heritage. Over 24,000 people in the city work in manufacturing, making it the fourth biggest city for manufacturing in the country. Energy intensive industries across the UK like steel, food production, basic chemicals and building materials are essential to our everyday lives. Hardworking workers plough in hour after hour to keep these industries going. How can we expect to be able to showcase the best of Bradford when rising energy costs means businesses and residents alike are fighting to keep their heads above the water?\nTo make the most of its City of Culture win, Bradford needs its residents and businesses to be thriving. We need the national Government to get the basics right on this: Act now to properly support businesses, not six months down the line when it reaches another crisis point.\nBradford is ready to build a City of Culture legacy that will last for decades to come, and I call for the Government to get on board with us too.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_education/content_7.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nTo Build Bradford's future we must invest in its people today\nLocal News\nMar 28\n1 min read\nJudith champions oracy skills at Trinity Academy\nLocal News\nNov 24, 2023\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-slams-government-delay-on-vital-spiking-report-while-charities-launch-legal-action/content_94.html": "Judith slams government delay on vital spiking report while charities launch legal action\n- judithcumminsmp\n- Sep 8, 2023\n- 2 min read\nUpdated: Dec 5, 2023\nJudith has criticised the Government for missing its statutory deadline to publish an important report into spiking, arguing that a failure to take spiking seriously is putting vulnerable people at risk.\nA law passed last year required that the government deliver a report on spiking to Parliament by April 2023. However, this vital report has still not been released, leading non-profits such as the Good Law Project and Gemini Project to consider legal action against the government.\nSpeaking in Parliament, Judith attacked the Government for failing on its legal duty:\n‘The deadline has long been passed and the Government is now facing threats of legal action to meet its statutory duty. The longer this government dithers and delays, the more vulnerable people are put at risk. Can the Leader of the House confirm a precise date when she expects this report will be laid before Parliament?’\nEvidence seen by the Home Affairs Select Committee shows that spiking is commonplace, with a shocking 15% of women and 7% of men saying they have had drugs or alcohol put in their drinks without their knowledge or consent.\nThe government’s failure to publish the report into spiking falls against the backdrop of their decision not to make spiking a specific criminal offence. When Judith challenged the government’s record on spiking earlier this year, then-Justice Secretary Dominic Raab downplayed gaps in the law that mean there are only a handful of spiking-related convictions annually.\nWhilst the Government continues to downplay the need for a specific law on spiking, their failure to publish a report has left the public in the dark about how widespread the spiking epidemic actually is.\nResponding to Judith’s question, the Leader of the House of Commons, Penny Mordaunt MP, said:\n‘I will make sure the Home Secretary has heard her concerns and contacts the honourable lady’s office with an update.’\nAlison Lowe OBE, Deputy Mayor for Police and Crime welcomed the work to hold government to account on the issue saying:\n“Spiking was raised as a major issue by women and girls with West Yorkshire Mayor Tracy Brabin and me in the winter of 2021. We have worked hard to clarify the law around spiking and have met with Judith Cummins MP on several occasions to take forward her recommendations for improvements, and to support her wider campaigning on the safety of young people at festivals.\nWe thank Judith for her commitment to this agenda and hope the government will act to protect the public.\"\nSpeaking afterwards, Judith added:\n‘This Government’s inaction makes it clear that they have no intention to tackle spiking. This long overdue report, which has still failed to materialise, must be published as soon as possible so that the scale of this issue is fully understood.’\n‘It is not right that government delays continue to put the safety of people, especially women and girls, at risk.’\nhttps://twitter.com/JudithCummins/status/1699778428139110552",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_bradford/content_84.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith welcomes announcement of Bradford Live operator\nFeb 19\n1 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_useful-links/content_9.html": "Emergency Contacts\nSt Vincent's Social Enterprise\nBenefits, Immigration and Housing Advice:\nWeb: https://svp.org.uk/st-vincents-bradford/contact-us\nTel: 0127 472 6790\nEnvironment Agency\nTel: Incident Hotline 0800 80 70 60\nWeb: www.environment-agency.gov.uk\nTwitter: @EnvAgencyYNE\nFloodline\nTel: 0845 988 1188\nMet Office\nWeb: www.metoffice.gov.uk\nTwitter: @metoffice\nElectricity (24 hour emergency service and supply failures only)\nTel: 0845 733 1331\nGas (24 hour emergency service and gas escapes)\nTel: 0800 111 999\nYorkshire Water (24 hour emergency service)\nTel: 0845 124 24 24\nTwitter: @yorkshirewater\nPolice (non emergency)\nTel: 101\nWeb: www.westyorkshire.police.uk\nTwitter: @westyorkspolice\nWest Yorkshire Fire & Rescue Service\nWeb: www.westyorksfire.gov.uk\nTwitter: @wyfrs_incidents\n@west_yorks_FRS\nNHS 111 (24 hours a day, 365 days a year confidential medical help or advice)\nTel: 111\nWeb: www.nhs.uk\nTwitter: @NHSChoices\nBradford Council\nTel: 01274 431000\nWeb: www.bradford.gov.uk\nTwitter: @bradfordalerts\nCommunity Contacts\n-\nAge UK - Support and services for older people\n-\nCatholic Care - Supporting children and families through challenging times\n-\nCitizens Advice - Support to find a way forward, whatever the problem\n-\nClarion Housing - Housing Association\n-\nIncommunities - Housing Association\n-\nMIND in Bradford - Mental Health and Wellbeing services\n-\nRoyds Community Association - Helping people help themselves\n-\nSandale Trust - Community centre supporting Bradford South\n-\nScholemoor Beacon - Community centre serving Scholemoor estate\n-\nSt Vincent de Paul Society - Social enterprise helping people in Bradford\n-\nThe Sutton Centre - Home of the Tong Wellbeing Hub\n-\n-\nBradford Museums Gateway to all of Bradford’s fine museums\n-\nBradford Peace Museum The UKs only dedicated Peace Museum\n-\nImpressions Gallery Independent photography gallery overlooking City Park\n-\nNational Media Museum A jewel in Bradford’s crown. One of the UKs finest museums\nCouncil Contacts\n-\nBradford Metropolitan District Council Information about Bradford Council’s services for residents, businesses and visitors to the district.\n-\nIndividual Councillors can be found here.\nHealth Contacts\nPolitical Contacts\nSports Contacts\n-\nBradford Bulls The official web site of the Bulls with all the latest news and message boards.\n-\nBradford City AFC Official site of Bradford City AFC\n-\nBradford Park Avenue AFC Official site of Bradford Park Avenue AFC",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_privacy-policy/content_38.html": "Office Policies\nPrivacy Policy\nI am the Member of Parliament (MP) for the Bradford South Constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy (https://labour.org.uk/privacy-policy/ ) for details of what information they hold, why, and how they use and process that information.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nMy responsible officer for data protection can be contacted at andrew.thornton@parliament.uk or on 01274 924280.\nData collection and use\nThe office of Judith Cummins MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do this where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, telephone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with:\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities, other public bodies and organisations. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for the Bradford South Constituency, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for the Bradford South Constituency, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites:\nThis website contains links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights:\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n-\nObtain copies of the personal information I hold about you (known as a “subject access request”)\n-\nRequest that I correct or update any personal information held about you\n-\nAsk that we erase or restrict the way in which I use your information\n-\nRequest that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications from me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nThe Data Protection Officer\nJudith Cummins MP\n26-28 Church Bank\nBradford\nBD1 4DZ\nEmail: andrew.thornton@parliament.uk\nTelephone: 01274 924280\nAlternatively you have right to raise any issues or concerns directly with the Information Commissioner’s Office.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_gps/content_124.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nEditorial: To Stop the Rot in NHS dentistry we must look back to its founding principles\nLocal News\nMay 19, 2023\n3 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_thousands-of-families-in-bradford-could-struggle-to-cope-with-energy-bills-this-winter/content_83.html": "Thousands of families in Bradford could struggle to cope with energy bills this winterjudithcumminsmpNov 19, 20150 min read",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-to-question-prime-minister-at-pmqs/content_119.html": "Judith to question Prime Minister at PMQs\n- judithcumminsmp\n- Mar 6, 2024\n- 1 min read\nJudith will be challenging the Prime Minister in House of Commons Chamber later today at Prime Minister's Questions.\nKnown as PMQs, the event takes place every Wednesday when Parliament is sitting and gives MPs to opportunity to directly question the Prime Minister on any topic of their choosing.\nYou can watch Judith and PMQs from 12:00 on BBC2, BBC iPlayer or via Parliamentlive.tv",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_access-to-cash/content_66.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith calls for a Queensbury Banking Hub\nLocal News\nJan 26, 2024\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_to-save-lives-the-government-must-set-new-targets-to-tackle-the-silent-disease/content_130.html": "To save lives, the Government must set new targets to tackle the ‘silent disease’\n- judithcumminsmp\n- Jun 6, 2023\n- 2 min read\nUpdated: Dec 5, 2023\nAs many people die from preventable hip fractures as from lung cancer or diabetes, Judith Cummins MP has revealed.\nSpeaking on Tuesday in the House of Commons, Bradford South MP Judith Cummins called on the Government to step up its game on bone fracture prevention and save lives.\nJudith has been vocal on the issue of Osteoporosis, which affects half of all women and a fifth of all men over 50. It is characterised by a loss of bone density, leaving people vulnerable to breaks and fractures. Because symptoms often aren’t noticed until a serious break, osteoporosis has been called the ‘silent disease’.\nRaising the issue in Parliament, Judith highlighted the shocking reality of the condition:\n‘Many of these will be serious hip fractures, and as many people will die from these fractures as from lung cancer or diabetes.’\nQuestioning the Minister, Judith asked why such a serious condition is so often overlooked in healthcare:\n‘Can the Minister explain why not even one of the 63 key performance indicators set by NHS England for Integrated Care Boards sets a target for fracture prevention?’\nResponding, Maria Caulfield MP, Minister for Women’s Health Strategy, thanked Judith for her longstanding work on bone health. The Minister also highlighted measures the Government is undertaking to tackle Osteoporosis:\n‘NHS England is expanding fracture services for higher risk women who do have Osteoporosis to prevent falls in the first place.’\nDespite the Government’s claims to be stepping up fracture services, the limits of the current services mean that 74,000 preventable fractures will occur over the next five years, costing the NHS £665 million.\nMaking fracture prevention a key performance target could lead to stronger delivery of these services, preventing unnecessary pain, giving patients the level of care they deserve, and saving vital NHS resources.\nFollowing the exchange, Judith said that Government support for fracture prevention was still inadequate:\n‘Whilst Bradford offers a trailblazing service for those with Osteoporosis, this is not always the case nationally.’\n‘The argument for investing in the prevention of fractures is clear: To save money and save lives, we need a government with the sense to invest in the future of women’s health in this country.’\nhttps://twitter.com/JudithCummins/status/1666090988975321088",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-invites-chancellor-to-meet-to-take-forward-50m-bradford-south-regeneration-bid/content_132.html": "Judith invites Chancellor to meet to take forward £50m Bradford South regeneration bid\n- judithcumminsmp\n- Oct 12, 2022\n- 2 min read\nUpdated: Dec 6, 2023\nYesterday in Parliament, Judith asked to meet with the Treasury Minister and the Chancellor to discuss the regeneration bid for Bradford South.\nSpeaking in Parliament at Treasury Questions, Judith Cummins MP asked Treasury Minister Felicity Buchan MP what measures the Government was taking to deliver on the Levelling Up Agenda in full.\nQuestioning the Minister, Judith asked:\n\"Building on the back of Bradford’s City of Culture win, and in this momentous year for Rugby League, I am supporting the plan for the transformation and regeneration of the home of the Bradford Bulls, the iconic Odsal Stadium, to become a world-class sports, music and culture arena.\"\n\"This plan would be an incubator for the ambitions of the entire Bradford district, delivering over a billion pounds worth of socio-economic benefits. Following the Bank of England’s repeated interventions, can the minister confirm the Levelling Up Fund Round 2 will still be going ahead in full, and will the Minister and the Chancellor demonstrate this by meeting with me, Bradford Council, the Bradford Bulls and the RFL to discuss our catalyst for growth?\"\nResponding, the Treasury Minister confirmed:\n\"We will be going ahead with second round of the levelling up fund in full, and there should be decisions by the end of the year. I wish her well in her bid and there is an independent assessment going on with the bids at the moment, if it is possible to meet then we would do that.\"\nJudith has supported the £50million bid to regenerate the Odsal area of Bradford South delivering a world-class music, culture, and sport arena, a park and ride car park, and a sports training complex, with pitches for local groups to use, generating almost five hundred full time jobs, and creating long-term opportunities in the constituency.\nSpeaking afterwards, Judith said: \"This is a once in a generation opportunity to deliver on Levelling Up for the people of Bradford South. Our ambitious £50 million bid would deliver investment directly into the area, giving my constituents better local services, more job opportunities and access to a world-class sport and music venue.\"\n\"Independent analysis repeatedly identifies Bradford as the strongest economic candidate for levelling up. We’ve heard a lot from the government over the last few years and seen little delivery. I look forward to meeting with the Treasury to discuss our bid further and to push for the investment in Bradford South that we need and deserve.”\nhttps://twitter.com/JudithCummins/status/1580125266835550209",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_put-an-end-to-postcode-lottery-for-bone-health-demands-judith/content_96.html": "Put an end to postcode lottery for bone health, demands Judith\n- Apr 13, 2023\n- 2 min read\nJudith Cummins MP on Tuesday called for the government to step up and provide 100% coverage for Fracture Liaison Services in England.\nOsteoporosis is a long-term health condition characterised by weak bones prone to breaking or fracture. It affects 3.5m people across the UK: a fifth of men and half of women over 50.\nA report by the Royal Osteoporosis Society found that 90,000 people miss out on the treatment every year and some 2.2 million people in the UK are left with undiagnosed spinal fractures. Fracture Liaison Services are an essential means of identifying and treating osteoporosis early. Yet, only 57% of people in England have access to this quality of life improving service.\nSpeaking in the Chamber, Judith called on the government to provide the necessary services, which could prevent over thirty thousand hip fractures by identifying bone problems early:\n“An investment of just £27 million per year in Fracture Liaison Services would deliver over £600 million in savings over five years for the NHS.\n“Will the Minister meet with me and the Royal Osteoporosis Society, to discuss our report, and commit to ending the postcode lottery by providing 100% coverage for Fracture Liaison Services for over-50s in England?”\nResponding, Secretary of State for Health Steve Barclay MP agreed: “Obviously, she sets out a very compelling case in terms of the return on investment. Clearly, we will need to scrutinise that in more detail.”\nJudith hears from the Health Secretary there is a ‘compelling case’ for investing in FLS\nSpeaking afterwards, Judith emphasized the need to act now to ensure that the NHS is not overwhelmed, and people are not unnecessarily left in pain with debilitating fractures:\n“Bradford has an exemplary fracture liaison service, but almost half of the country must do without. When these early opportunities to prevent fractures are missed there is a greater pressure on ambulances, acute hospital bed days, and greater stress on the NHS.”\n“By acting now to provide full Fracture Liaison Services coverage right across England, we can save people unnecessary pain, save the NHS vital resources, and give all patients the level of care they deserve.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_categories_national/content_19.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith chairs Great British Energy Bill\nNational\nNov 6, 2024\n1 min read\nJudith represents United Kingdom at Crimea Summit\nUkraine\nOct 28, 2024\n2 min read\n\"No renter should be left feeling insecure about their future\", says Judith\nNational\nOct 11, 2024\n1 min read\nJudith chairs statement on Future of steel manufacturing in the UK\nNational\nSep 20, 2024\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_economy/content_98.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith chairs debate to bring an end to the prospect of future mini-budget disasters\nNational\nSep 20, 2024\n2 min read\nJudith calls for a Queensbury Banking Hub\nLocal News\nJan 26, 2024\n2 min read\nEditorial: This country needs a change\nLocal News\nNov 13, 2023\n3 min read\nJudith pushes Govt to commit to levelling up and regeneration in Bradford\nBusiness\nOct 21, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_school-buses/content_21.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith encourages parents to have say on School Travel consultation\nLocal News\n1 day ago\n1 min read\nJudith welcomes pledge to continue school buses\nLocal News\nFeb 25\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-wears-it-pink-in-support-of-breast-cancer-now/content_13.html": "Judith \"wears it pink\" in support of Breast Cancer Now\n- judithcumminsmp\n- Oct 18, 2024\n- 2 min read\nJudith poses with pink earlier this week at in Parliament to support 'wear it pink' and raise awareness of breast cancer\nJudith added a splash of pink to her usual Westminster attire to support Breast Cancer Now’s “Wear it Pink” fundraiser, while the government announced plans for a pilot scheme to streamline the breast cancer screening process.\nJudith is calling for her constituents in Bradford South to join her, as well as thousands of others across the UK, to support Breast Cancer Now and by wearing it pink all through October’s Breast Cancer Awareness month.\nWear it Pink Day took place on Friday 18 October to raise vital funds for world-class breast cancer research and life-changing support.\nTo date, over £41 million has been raised towards Breast Cancer Now’s important work – however, uptake of breast cancer screening in Bradford remains low. Data from Healthwatch Bradford shows that only 51% of women attended breast screening in Bradford District and Craven in 2022 – a decrease of 5% compared to the year before. The national standard for breast screening uptake is 70%.\nThis week, Health Minister Karin Smyth MP announced a pilot that will see 111 online directly referring women with a worrying lump to a breast clinic so that patients see specialists faster.\n“This means faster diagnosis for cancer patients and more GP appointments freed up, which is better for patients and GPs.”\nAnyone can take part in wear it pink, whether at school, work or at home through October. With every penny raised, fundraisers across the UK will be helping the charity achieve its vision that by 2050 everyone diagnosed with breast cancer lives and is supported to live well.\nJudith said:\n“Every 10 minutes, someone in the UK hears the words “you have breast cancer”.\nEach year, around 11,500 women and 85 men lose their lives to the disease – that’s 32 people every day.”\n“Wear It Pink is great way for people to come together with friends and family to have fun whilst raising awareness of breast cancer and supporting Breast Cancer Now’s world-class research and life-changing support.\nBreast cancer affects so many people in Bradford – and is the most common cancer in Yorkshire, so I hope that everybody will get involved this October and do their bit to support this cause, whether making a donation, or just encouraging people to make sure they get screened.\nEarly detection is key to making sure people with breast cancer get the best outcomes to continue living well.”\nClaire Rowney, chief executive at Breast Cancer Now, said:\n“We are so excited to see wear it pink return to Westminster.”\n“We hope that by wearing pink, Members of Parliament will encourage their constituents to also wear it pink in their homes, schools or workplaces and help us to increase knowledge of breast cancer and continue to deliver life-changing research and support.”\nTo take part in wear it pink this October, please visit wearitpink.org for further details and fundraising ideas.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_westminster/content_91.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\n\"A Conservative summer of job cuts\" - Judith tells Parliament\nBusiness\nSep 5, 2023\n2 min read\nJudith challenges government over cost of food\nNational\nMay 25, 2023\n1 min read\nPut an end to postcode lottery for bone health, demands Judith\nHealth\nApr 13, 2023\n2 min read\nJudith presses Secretary of State for position on NATO ‘Fighter Jet Coalition’\nUkraine\nJan 31, 2023\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_fireworks/content_47.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nOut with the Bang: Judith Raises Constituents’ Concerns about the ‘24/7, round-the-clock blight” of Fireworks with Minister\nCrime & ASB\nMar 28\n1 min read\nJudith praises emergency services as she joins police on patrol\nLocal News\nNov 7, 2024\n2 min read\nOut with the Bang! - Judith introduces Bill to curb noisy fireworks\nCrime & ASB\nApr 17, 2024\n2 min read\nChristmas Editorial: Fighting for you on the issues that matter\nLocal News\nDec 18, 2023\n4 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_quads/content_77.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith Oversees Bill to Introduce Tougher Measures to Tackle Nuisance Off-Road Vehicles\nCrime & ASB\nMar 14\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_it-s-time-for-families-in-bradford-south-to-get-a-better-deal-on-their-energy-bills/content_110.html": "It’s time for families in Bradford South to get a better deal on their energy billsjudithcumminsmpJul 9, 20150 min read",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_city-of-culture/content_123.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nEditorial: A season of joy - but families are still struggling\nLocal News\nDec 20, 2022\n3 min read\nJudith invites Chancellor to meet to take forward £50m Bradford South regeneration bid\nBusiness\nOct 12, 2022\n2 min read\nLet the City of Culture win transform Bradford\nLocal News\nJun 22, 2022\n3 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_ukraine/content_86.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith represents United Kingdom at Crimea Summit\nUkraine\nOct 28, 2024\n2 min read\nJudith: \"Ukraine cannot be left waiting for much needed supplies.\"\nUkraine\nMay 19, 2023\n1 min read\nEditorial: In Ukraine, I saw the human cost of this war\nUkraine\nMar 2, 2023\n2 min read\nJudith presses Secretary of State for position on NATO ‘Fighter Jet Coalition’\nUkraine\nJan 31, 2023\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_dentistry-plan-simply-inadequate/content_92.html": "Dentistry plan 'simply inadequate' for scale of problem, says Judith\n- judithcumminsmp\n- Feb 8, 2024\n- 2 min read\nJudith has criticised the Government’s plan on NHS dentistry, warning that millions would still be left without an NHS dentist.\nRevealing the Government’s ‘NHS Dental Recovery Plan’, Health Secretary Victoria Atkins MP yesterday announced a series of measures to boost NHS Dentistry, including additional help for rural areas.\nJudith has repeatedly called for action to improve access to NHS dentistry in Bradford, as figures show a shocking data 98% of Bradford dentists are not accepting new NHS patients.\nQuestioning the Secretary of State for Health and Social Care following the announcement, Judith pointed out that many proposals, such as wider rollout of supervised school toothbrushing - which is already happening in Bradford -reflected long-standing Labour proposals, saying:\n“This plan mirrors many of my ideas over the years, and indeed much within Labour’s plan.”\n“However, the government says these recovery plans will provide care for up to 2.5m people. Meanwhile their own data shows that 12m people in England have unmet dentistry needs – which would still leave around 9.5 million people without a dentist.”\nJudith highlighted how people in desperate need of NHS dentistry services will still miss out. She shared the case of Beverley, who was informed that her dentist was no longer accepting NHS patients.\nJudith told the Health Secretary that her constituent Beverley had contacted her as the drugs she needs to take to treat her bone condition have had side effects:\n“Beverley now requires a check-up every three months after four of her teeth have decayed to such an extent that they need to be extracted. She has been with the same dentist for 50 years, but has just been told that her dentist is going fully private – leaving her without an NHS dentist.”\n“Can the Minister guarantee that, under these plans, people like Beverley will be able to access an NHS dentist?”\nResponding, Health Secretary Victoria Atkins MP did not offer assurances, instead saying dentists must be asked to ‘do their bit’:\n“I appreciate the hon. lady’s point about retention, which we are looking to address.”\n“But we all acknowledge that dentists are independent contractors, so we must ask them to do their bit and help our NHS out.”\nSpeaking afterwards, Judith said:\n“For years, I have raised the lack of access to NHS dentistry that people in Bradford face. Today, after years of waiting for a dental plan, the Secretary of State for Health could not even guarantee that my constituents who have acute need and absolutely need to see a dentist will be able to access an NHS dentist.”\nJudith said a long-term plan was needed to reverse the damage in NHS dentistry:\n“This plan is simply inadequate to tackle the scale of the problem.”\n“NHS dentistry needs fundamental reform to ensure that it can serve everyone from the cradle to the grave.”",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_editorial/content_29.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nI am so often inspired by the energy of young people in Bradford\nLocal News\n1 day ago\n1 min read\nTo Build Bradford's future we must invest in its people today\nLocal News\nMar 28\n1 min read\nEditorial | 2024: A Year for Change\nLocal News\nJan 24, 2024\n4 min read\nChristmas Editorial: Fighting for you on the issues that matter\nLocal News\nDec 18, 2023\n4 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_nhs-dentistry-must-serve-every-person-from-the-cradle-to-the-grave/content_114.html": "NHS Dentistry Must Serve Every Person, from the Cradle to the Grave\n- Jan 9, 2024\n- 2 min read\nSpeaking in a debate in the House of Commons, Judith Cummins, the Labour Member of Parliament for Bradford South, called for a ‘clear strategy’ for the recovery of NHS Dentistry.\nLast month, the Nuffield Trust announced that universal NHS Dentistry was ‘gone for good’ without radical action.\nThe BBC and the British Dental Association have conducted surveys which show that 90% of practices across the UK are no longer accepting new NHS patients.\nSpeaking in Parliament, Judith said:\n’14 years of this Conservative Government has brought about the decay of our vital NHS dental healthcare services.’\n‘Now is the time for a government which is determined to provide the care that people across this country, and their children, deserve.’\nOver 1000 dentists have left the NHS since the pandemic, and the number of treatments being completed each year is now 6 million lower than before the pandemic. The BDA estimate that 75% of dentists are thinking of reducing their NHS commitments this year.\nIn Bradford, 445 people were treated in hospital for dental related issues in 2022-2023.\nA local dentist based in Bradford South said:\n‘I’ve been saying it for years: the NHS dental contract needs fundamental reform. Without immediate action, there will be no Universal NHS Dentistry.’\nAlongside their plans to ‘build an NHS fit for the future’, the Labour Party has committed to the fundamental reform of NHS dentistry. They have also committed to providing an extra 700,000 urgent dental appointments.\nJudith said:\n‘There is one clear answer: the Government must recommit to a Universal NHS Dental Service which will care for all, from the cradle to the grave.’\n‘We cannot stand by and let the principle of NHS dentistry in this country be eroded.’\n‘This decline is not irreversible - or inevitable - it is a political choice. I urge the Government to take immediate action to save our NHS dental services’.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_editorial-this-country-needs-a-change/content_106.html": "Editorial: This country needs a change\n- judithcumminsmp\n- Nov 13, 2023\n- 3 min read\nThis column first appeared in the Telegraph & Argus on 11th November\nThe state opening of Parliament this week signalled the start of a new parliamentary session, likely the last before the country goes to the polls in the next General Election\nIt is a day of ancient traditions and ceremony.\nIt is also an opportunity for the Government to set out a clear vision for the future direction of the country.\nBut this week, we saw none of that. Instead, we were left with an underwhelming bundle of previously announced and repackaged policies that do nothing to take our country forward.\nIt shows that this Conservative Government really has lost the will to govern.\nWhen families in Bradford are paying hundreds of pounds a month extra on their mortgage, seeing their rents rise astronomically, spiralling energy bills, and when the cost of putting food on the table is higher than ever, I can’t help but think that people hearing the King’s Speech will have been left wondering - ‘is that it?’.\nTake our energy security, for example. Every family and business in Bradford are paying the price for this Government ’s failed energy policy. Major businesses in Bradford have cut jobs because they face rocketing energy costs which have seen a five fold increase over the last few years.\nYet, the Government ’s Energy Secretary herself admitted that their flagship project to license new oil and gas fields wouldn’t even ‘necessarily bring energy bills down’. You read that right – licenses that hand billions in taxpayer subsidies to the oil and gas companies who are raking in record profits while we don’t get so much as a penny off our bills.\nIt is vital that the UK diversifies its energy supply so that we can be less reliant on foreign states for our energy needs. At the same time, families need to see their bills made more manageable now.\nMeanwhile on crime, the Government used the King’s Speech to promise tougher sentences for serious offenders.\nBut under their watch, more criminals are being let off, and more victims are being let down. Just last month, the Government also announced that they would be sending fewer so called ‘low-level’ criminals to prison to prevent over-crowding.\nRather than tackling antisocial behaviour and crime within our communities, they are turning a blind eye. Criminals are now half as likely to be caught as under the previous Labour Government.\nTurning to transport, we heard more warm words again about much needed improvements to transport infrastructure in the North.\nI have fought for years for Bradford to get the regional and national transport links we need to grow our economy and bring in more good jobs.\nBut 85 per cent of what was announced in ‘Network North’ are simply old projects that have been repackaged as new.\nIf this Government couldn’t deliver projects like Northern Powerhouse Rail before – how can we believe they will now?\nAnd finally, on health, the Government has offered nothing of substance to fix the problems in NHS dentistry, community pharmacies and access to GPs.\nFor instance, it is simply unacceptable that 455 desperate people went to A&E at Bradford Royal Infirmary in dental agony, because they were unable to find an NHS dentist and cannot afford to go private.\nLabour has already committed to provide funding for 700,000 more urgent dental appointments and would cut red tape to improve coordination between pharmacies and GPs.\nThe Prime Minster has said that the country needs change – and he’s right.\nBut he is leading the same old tired Conservative Party that has no ambition for this country and is out of ideas. What we needed from the King’s Speech was a hard reset and a fresh approach to dealing with the problems our country faces.\nInstead, we got more of the same, from a Government in its dying days.",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_save-our-pharmacies-judith-delivers-petition-to-parliament-calling-for-the-protection-of-local-p/content_65.html": "Save our Pharmacies: Judith delivers petition to Parliament\n- judithcumminsmp\n- Sep 7, 2023\n- 2 min read\nUpdated: Dec 5, 2023\nJoining with residents across Bradford South, Judith Cummins MP delivered a petition to Parliament this week calling for the protection of local pharmacies.\nPresenting the petition to Parliament, Judith pointed out:\n‘The Government has stripped proper funding for pharmacies to act as community access points for NHS support and face-to-face healthcare support.’\nJudith delivered the petition with the backing of hundreds of people in Bradford who have expressed concerns over the challenges faced by their local community pharmacy in the Wyke area of Bradford South.\nThe petition urged the Government ‘to support pharmacies as they seek to recover from the pandemic, ensuring that they can continue to provide a high standard of care to patients within the community’.\nJames Currie, owner of Currie’s Chemist in Wyke outlined the challenges faced by local pharmacies:\n‘Pharmacy funding has plummeted by 30% since 2017 while our costs have sky-rocketed.\nWe are doing our bit to ease pressure on our NHS by helping people live happily and independently in the community, but while government is encouraging chemists to support patients with a wider range of services, we aren’t seeing an increase in funding.\nThis simply isn’t sustainable, and many pharmacies are on the precipice of collapse. We need proper support and fresh investment from government, or we face a domino effect that will see the end of community pharmacies.’\nIn their open letter, residents praised pharmacies as part of the fabric of the local community, saying:\n‘Our local pharmacy is more than just a place to get medicines. It ensures people like us can get face-to-face health care advice and access to NHS support, often without the need for an appointment’.\nSpeaking following her speech in the House of Commons, Judith said:\n‘I recognise how important pharmacies are within our local communities. They provide vital public health services in a time when our National Health Service is stretched. The Government should recognise that if they allow the closure of community pharmacies, they will leave residents isolated and vulnerable, often struggling to access life-saving medicines.’\n‘The Government must not delay. We must act to preserve our local pharmacies before it is too late.’",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-welcomes-announcement-of-bradford-live-operator/content_72.html": "Judith welcomes announcement of Bradford Live operator\n- judithcumminsmp\n- Feb 19\n- 1 min read\nJudith has spoken to the Telegraph and Argus following this week's announcement that Trafalgar Entertainment will be responsible for running Bradford Live.\nYou can read the announcement here:",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_tong/content_69.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nJudith supports Small Businesses in Bradford\nBusiness\nDec 5, 2023\n1 min read\nJudith hosts street walk with Deputy Mayor Alison Lowe\nCrime & ASB\nSep 20, 2022\n2 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_news_tags_transport/content_109.html": "top of page\nHOME\nABOUT\nCONTACT\nQuestionnaire\nNEWS\nSUBSCRIBE\nDONATE\nUSEFUL LINKS\nMy News\nHere you can keep up to date on my work standing up for Bradford South\nAll Posts\nBusiness\nCrime & ASB\nHealth\nUkraine\nComments\nLocal News\nNational\nCampaigns\nEditorial: This country needs a change\nLocal News\nNov 13, 2023\n3 min read\nbottom of page",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_bradford-centre-next-rugby-world-cup/content_136.html": "Judith wants Bradford at the centre of the next Rugby League World Cup\n- judithcumminsmp\n- Oct 26, 2022\n- 2 min read\nUpdated: Dec 5, 2023\nJudith Cummins MP has called on the government to use the power of sport as a ‘force for good’ to bring investment into Bradford.\nSpeaking in a debate on the contribution of the Rugby League world cup to culture and sport in the UK, Judith highlighted how sport is at the heart of local communities in her Bradford South constituency:\n“Week in, week out, local communities come together to support their clubs, their local kids’ teams and young players.”\n“However, levels of investment and opportunities haven’t always matched the pride we feel in our towns and cities, but it’s moments like the world cup that will give communities the opportunities to stand tall and showcase where they live to the world.”\n“A compelling levelling-up bid has been submitted to government for a world-class stadium and training complex for elite sports with a Rugby League Skills, Training and Education centre in Odsal to serve the people of Yorkshire and the North. I can’t wait to host the world cup again in a decade’s time and be standing in our very own Odsal stadium in Bradford cheering England on!”\nResponding to Judith’s invitation to visit Odsal, Sports Minister Stuart Andrew MP said: “If I’m still in post by the end of the week I’ll still come but, if not, I’ll leave a note to my successor that their first trip needs to be to Bradford!”\nThe 2022 Cup’s world-leading social impact programme has invested more than £26 million in equipment and facilities, volunteering, mental health, culture and education, to transform clubs into hubs for their communities. And, for the first time, the men’s, women’s and wheelchair tournaments will be held concurrently.\nA study from the Sheffield Hallam University shows that investment in sport and physical activity gives back four times the investment in social value, equivalent to around £72 billion each year across the UK, improving people’s health and wellbeing, creating jobs and stimulating local economic growth.\nJudith is fighting for Bradford to have its share:\n“When the competition is over and the winning teams raise their trophies, it is only the start of the story for communities, not the end. With the Rugby League world cup in full swing, Bradford’s year as capital of culture in 2025, and Bradford’s bid for a world-class stadium and sports complex that will bring over a billion pounds of benefits to Bradford, now is the time to ensure that people of Bradford benefit from this legacy.”\nhttps://twitter.com/JudithCummins/status/1584880580881063937",
  "http_www_judithcummins_org_uk/https_www_judithcummins_org_uk_post_judith-backs-the-bulls-after-best-season-in-years/content_128.html": "Judith backs the Bulls after best season in years\n- judithcumminsmp\n- Oct 27, 2023\n- 1 min read\nJudith has praised the Bulls on this season's performance while the club reflect on their latest IMG ranking and believe modernisation of Odsal stadium is key to taking the club forward.\nIn a club statement, Bradford Bulls said:\n\"Yesterday’s illustrative IMG Grading score ranks the club as 14th on the grading ladder, behind all the 2023 season Super League clubs, as well as Toulouse.\"\n\"That grading should leave no one in any doubt that the single biggest impediment to getting our club back to the Super League is the absence of an appropriate 21st century facility.\"\n\"Our relatively strong and strengthening scores in the other four grading pillars (finances were 61 per cent and performance, hampered by being in the Championship, was 43 per cent) clearly demonstrate the progress the club has and continues to make in recent times.\"\nCommenting on the news, Judith urged for stakeholders to work together to build a bright future for the Bulls in Bradford:\n\"Fans are rightly proud of the Bulls' performance this season. Yet the IMG's illustrative grading for Bradford Bulls makes it clear that the club is being held back by the dire need for the modernisation of their historic Odsal Top home.\"\n\"Sporting success brings pride to our communities and prestige to our city. But, for the Bulls and Bradford to thrive, investment in our sporting facilities needs to match that ambition.\"\n\"That is why, earlier this year, I established a working group that brings key partners together to find a viable way forward for the Bulls in Bradford.\n\"All parties must do everything they can to secure the top-tier Rugby League that Bradford deserves.\""
}