{
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_about-rss/content_13.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_public-service/content_23.html": "No stranger to public service, Darren devoted 26 years of his life to our country with the Royal Air Force. His skills, loyalty and work ethic honed in the face of adversity will make him the perfect Member of Parliament to represent everyone in Broxtowe.",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_category_Articles/content_21.html": "Covid-19 Vaccine Q&A 13th January 2021 Many of you have been in touch with me regarding the Covid-19 vaccine. I understand that misinformation has been spread regarding the vaccine, I recently spoke... Articles\nWhat can politicians learn from Rugby? 20th October 2019 As we approach the \"kick-off\" for a general election campaign, we are also excitedly anticipating a win for England in the World Cup Final this Saturday in... Articles\nServe On's response to the Nepali earthquake 28th April 2015 Live to serve. Serve to lead. Lead to change Articles",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_category_Local-News/content_16.html": "Darren Henry reflects on his time as Broxtowe MP 6th July 2024 Broxtowe had their say. I am incredibly proud of the work I have done to improve our community in the last four years. Securing £21.1 million in Stapleford, £16... Local News\nVote Darren Henry for Broxtowe on 4 July 2nd July 2024 Vote Darren Henry for Broxtowe on 4 July Local News\nDarren Henry MP writes to the new Mayor of the East Midlands 29th May 2024 I have written to the new Mayor of the East Midlands to highlight my constituents’ desire to have a Toton Link Road and an Apprenticeship Hub in Broxtowe... Local News\nDarren Henry MP at the Stapleford Towns Fund Project Update 23rd May 2024 The Stapleford Towns Fund Project Update was a brilliant event to get feedback from residents on the progress that we have made with the Towns Fund. Please find... Local News\nDarren Henry MP speaking about high streets in the House of Commons 22nd May 2024 High streets and the shops on those are integral to Broxtowe’s community. In my speech below, among other topics, I talk about the improvement we have seen in... Local News\nDarren Henry MP watches a performance by Beeston Players 21st May 2024 It is always a pleasure to watch a production by Beeston Players. I have been attending their events ever since I have been the Member of Parliament for... Local News\nDarren Henry MP Opens Giltbrook Post Office 17th May 2024 I was honoured to be asked to open the Giltbrook Post Office which is also now within a convenience store. Please see the video below for more information on... Local News\nDarren Henry MP marks Dementia Action Week 17th May 2024 Dementia Action Week! This year I spoke to a local Dementia Advisor from the Alzheimer’s Society at my Senior Citizens’ Fair. I am aware that one of the main... Local News\nDarren Henry MP hosted his Senior Citizens’ Fair in Beeston 16th May 2024 I had the greatest of pleasure hosting my first ever Senior Citizens’ Fair in Beeston. I hope that those who came along got the information they needed, I... Local News",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_windrush-day/content_14.html": "Today marks 70 years since the Empire Windrush arrived at Tilbury Docks. We will mark the contribution of the Windrush generation to British society and ensure their legacy will never be forgotten.\n·To recognise their contribution, the Prime Minister has announced the establishment of a Windrush Committee to create a permanent, fitting tribute to the Windrush generation and their children.\n·The Windrush generation have made a lasting contribution to all aspects of British society, as they both rebuilt our country and built their own lives here.",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_parliament/content_3.html": "Paternity Leave (Bereavement) Bill | Commons debates I could not be more delighted that the Bill has finally reached this stage today.\nHigh Streets (Designation, Review and Improvement Plan) Bill | Commons debates High streets are essential to our towns.\nFlood Recovery Framework - [Clive Efford in the Chair] | Westminster Hall debates In Nottinghamshire we had Storm Babet and Storm Henk in quick succession.\nFlood Recovery Framework - [Clive Efford in the Chair] | Westminster Hall debates I thank my right hon. Friend for securing the debate.\nPharmacy: Licensing | Department of Health and Social Care | Written Answers To ask the Secretary of State for Health and Social Care, whether he is taking steps to reduce the time taken to grant licences to pharmacie\nClause 1 - Shared parental leave: entitlement in the event of death of mother | Shared Parental Leave and Pay (Bereavement) Bill Committee | Public Bill Committees It is a pleasure to serve under your chairmanship, Mr Paisley. I thank the hon.\nClause 1 - Shared parental leave: entitlement in the event of death of mother | Shared Parental Leave and Pay (Bereavement) Bill Committee | Public Bill Committees As the hon. Member knows, I am delighted that the Bill has got to this stage.\nIncome Tax (Charge) | Commons debates I am sure that many of my constituents will be delighted and relieved at the cut in national insurance.\nIncome Tax (Charge) | Commons debates I am sure that many of my constituents will be delighted and relieved at the cut in national insurance.\nTopical Questions | Education | Commons debates I recently visited Fairfield Spencer Academy in my Broxtowe constituency, where I met Craig Jones, who is doing good work with the Junior Ad",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_campaigns_nottingham-matlock-rail-service/content_4.html": "Following timetable changes instigated by East Midlands Railway (EMR) in the summer of 2021, the Nottingham to Matlock rail service was suspended, severely impacting commuters from Beeston and Attenborough Railway Stations.\nIn March 2022, I held a virtual public meeting ensuring that local people could have their say about the impact of this decision. I am calling on EMR to work with the Department for Transport, to get the service reopened as quickly as possible.\nSo please register your support by visiting https://go.backourcampaign.co.uk/matlock-rail-service",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_george-floyd-black-lives-matter-covid-19-and-outcomes-bame-groups/content_12.html": "Many of you have been contacting me about the death of George Floyd in the US, the Black Lives Matter campaign and outcomes for BAME groups. Please be assured that I take your opinions on these matters very seriously indeed and your correspondence will be shared with the relevant Government department to demonstrate the strength of feeling amongst Broxtowe constituents.\nAs a black man myself I was incredibly distressed by the footage of what happened to George Floyd in the lead up to his death in police-custody. I understand that the police officer involved in the incident has been charged with second-degree murder, and there will be a federal review.\nI completely understand the strength of feeling over this incident and of course fully support the right to peacefully protest. I cannot however condone the violent scenes and unrest which has followed, not only in America but across the UK too.\nRioting and violence is unlawful and very distressing, and I urge all sides to de-escalate these tensions. I do hope that communities can come back together and not tear itself apart over this incredibly distressing incident.\nLike you, I will of course be following developments closely, including throughout the federal review.\nWith regards to export of rubber bullets and tear gas, I know the Government takes its export control responsibilities very seriously. The UK operates one of the world’s most robust and transparent export control regimes. Each export licence application is considered on a case-by-case basis against the Consolidated EU and National Arms Export Licensing Criteria. The Consolidated Criteria provide a thorough risk assessment framework, requiring the Government to think very carefully about the possible impact of providing equipment and its capabilities. My understanding is that the Government will not grant an export licence if doing so would be inconsistent with the criteria. I have ensured Ministers are aware of the points Broxtowe constituents make about these exports.\nThe Coronvirus figures suggesting that people from black, Asian and minority ethnic backgrounds are at greater risk of becoming seriously ill with Covid-19 are extremely concerning and trouble me greatly. The disproportionate impact has been recognised by my colleagues in Government and Public Health England was commissioned to conduct thorough research into the matter. I understand that PHE has now published its report and I await the Department for Health and Social Care's response as soon as possible.",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_our-future-outside-european-union/content_24.html": "Good to meet Lord Dobbs and discuss EU and Brexit... and of course House of Cards.\nAlso, interesting new Research Briefing - Brexit : impact across policy areas\nhttp://researchbriefings.parliament.uk/ResearchBriefing/Summary/CBP-7213\nGood to meet Lord Dobbs and discuss EU and Brexit... and of course House of Cards.\nAlso, interesting new Research Briefing - Brexit : impact across policy areas\nhttp://researchbriefings.parliament.uk/ResearchBriefing/Summary/CBP-7213",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_darrens-statement-regarding-dominic-cummings/content_17.html": "Darren Henry MP’s Statement Regarding Dominic Cummings\nIn recent days, I have received hundreds of emails from constituents regarding the actions of Dominic Cummings. I understand your anger and frustrations, especially given the personal difficulties and sacrifices that have been made by many people to reduce the spread of the virus. Please be assured that your points have been noted and I have raised those concerns with the Prime Minister.\nRather than comment immediately, I chose to wait until Mr Cummings had offered an explanation and I had considered the available facts. This statement outlines my opinion on this matter and my resolve to move on and focus on the national challenge COVID-19 presents.\nIn his statement on Monday 25 May 2020, Mr Cummings offered an account of his reasons for travelling to Durham. I will not repeat the details here as the statement has been covered extensively elsewhere. Having listened to Mr Cummings’ statement - and considered the available facts, Government guidance and statements from Dr Jenny Harries - I personally believe he did not breach the lockdown guidelines. His account of his journey to Durham makes clear that he did everything possible to isolate - and protect - himself and his family whilst travelling and staying on his parents’ farm. Whilst I do question his decision to drive to Barnard Castle, and would not have taken the same course of action, I believe that Mr Cummings acted in the best interests of his family. It is clear that he was motivated by the need to keep his son safe, should anything happen to him or his wife, and I sympathize with this.\nI understand that not everyone will agree with my opinion, but I fundamentally believe in due process. It is ultimately for the police to consider the evidence and determine whether Mr Cummings’ actions were outside these lockdown rules - not other MPs, the media or general public. If Mr Cummings has breached the lockdown rules, action must be taken as we are all equal in the eyes of the law. As other MPs have concluded, I would be shocked if a constituent advised me that they were receiving violent threats, being hounded by the media and pressured to resign from their job because of allegations they had fully denied. The fundamental principles of due process, being innocent until proven guilty and equality in the eyes of the law cannot be overlooked. If Mr Cummings is found to be guilty of a breach of these rules, my views on this matter will be different.**\nIt is clear that there has been also misinformation about Mr Cummings (and other MPs, advisors and officials) circulating and this needs to stop. There have been rumours that I have been travelling between Broxtowe and Wiltshire; these are unfounded and untrue. Like many of you, the lockdown restrictions have required personal sacrifices from me. I have not seen vulnerable members of my family for months. I was especially shocked to see journalists coming to my home to question me on this made up story. I do not believe anybody - regardless of their occupation - should be subject to such behaviour. To confirm, I have remained in Broxtowe and have fully complied with all lockdown requirements.\nI appreciate the difficult sacrifices that people across Broxtowe, and the country, are making to stay safe and save lives. Going forward, I do not think it is wise to continue to debate the actions of one advisor. My team and I will continue to work relentlessly to support constituents, especially those most adversely impacted by this virus, as we approach the next phase of our fight against COVID-19. As ever, if I may be of any assistance, please do not hesitate to contact me.\n**Since I wrote this Durham Constabulary issued a full statement on 28th May which is available via this link: https://www.durham.police.uk/news-and-events/Pages/News%20Articles/Durham-Constabulary-press-statement--.aspx\nThe police have made clear they are taking no action against Mr Cummings over his self-isolation.\nAs your MP, with the support of my excellent team, I will now continue to focus my energy on the emails from constituents asking for help. To do anything other than this would be a disservice to the people of Broxtowe who need support in such a difficult and unprecedented time. As such, I will not be commenting further on this matter but, as I have always said, if I may be of assistance, I will always endeavour to support you and would urge you to contact me.",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news/content_18.html": "Darren Henry reflects on his time as Broxtowe MP Saturday, 6 July, 2024 Broxtowe had their say. I am incredibly proud of the work I have done to improve our community in the last four years. Securing £21.1 million in Stapleford, £16.5 million for Kimberley, lifts for Beeston Train Station, a banking hub for Stapleford, a ramp at the Awsworth-end of Bennerley Viaduct, Pharmacy First in Nuthall, funding for Chilwell School and so much more. I even managed to have a huge... Local News\nVote Darren Henry for Broxtowe on 4 July 2nd July 2024 Vote Darren Henry for Broxtowe on 4 July Local News\nDarren Henry MP writes to the new Mayor of the East Midlands 29th May 2024 I have written to the new Mayor of the East Midlands to highlight my constituents’ desire to have a Toton Link Road and an Apprenticeship Hub in Broxtowe... Local News\nDarren Henry MP at the Stapleford Towns Fund Project Update 23rd May 2024 The Stapleford Towns Fund Project Update was a brilliant event to get feedback from residents on the progress that we have made with the Towns Fund. Please find... Local News\nDarren Henry MP speaking about high streets in the House of Commons 22nd May 2024 High streets and the shops on those are integral to Broxtowe’s community. In my speech below, among other topics, I talk about the improvement we have seen in... Local News\nDarren Henry MP watches a performance by Beeston Players 21st May 2024 It is always a pleasure to watch a production by Beeston Players. I have been attending their events ever since I have been the Member of Parliament for... Local News\nDarren Henry MP Opens Giltbrook Post Office 17th May 2024 I was honoured to be asked to open the Giltbrook Post Office which is also now within a convenience store. Please see the video below for more information on... Local News\nDarren Henry MP marks Dementia Action Week 17th May 2024 Dementia Action Week! This year I spoke to a local Dementia Advisor from the Alzheimer’s Society at my Senior Citizens’ Fair. I am aware that one of the main... Local News\nDarren Henry MP hosted his Senior Citizens’ Fair in Beeston 16th May 2024 I had the greatest of pleasure hosting my first ever Senior Citizens’ Fair in Beeston. I hope that those who came along got the information they needed, I... Local News\nDarren Henry MP discusses upgrading transport in Broxtowe with the Minister 15th May 2024 It was good to recently catch up with the Minister of State (Department for Transport), Huw Merriman. Now that work has started for ‘Access for All’ at Beeston... Local News",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_privacy/content_5.html": "This document outlines how Darren Henry processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Darren Henry\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Darren Henry.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Darren Henry, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Darren Henry via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_cookies/content_2.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_category_European-News/content_8.html": "Postal Votes 27th November 2019 If you have a #PostalVote please make sure you get them out in time! To protect democracy is one of the main reasons I served in the RAF - that’s what we need... European News\nSupport for Getting Brexit Done 23rd November 2019 Thank you to Steve Barclay, Minister for Exiting the EU for joining us today. Lots of great conversations with people who just want to Get Brexit Done. European News\nOur Future Outside The European Union 25th August 2016 Good to meet Lord Dobbs and discuss EU and Brexit... and of course House of Cards. Also, interesting new Research Briefing - Brexit : impact across policy areas... European News",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_darren-henry-reflects-his-time-broxtowe-mp/content_7.html": "Broxtowe had their say. I am incredibly proud of the work I have done to improve our community in the last four years. Securing £21.1 million in Stapleford, £16.5 million for Kimberley, lifts for Beeston Train Station, a banking hub for Stapleford, a ramp at the Awsworth-end of Bennerley Viaduct, Pharmacy First in Nuthall, funding for Chilwell School and so much more. I even managed to have a huge impact on changing the law around parental leave following a constituency surgery. My aim was always to improve our community, not for me but for our children and grandchildren. I feel like I have achieved that and it has been the honour of my life to serve Broxtowe.",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_campaigns/content_6.html": "Robin Hood Half Marathon This September, I will be running my first ever Robin Hood Half Marathon in aid of local charity Forces in the Community. Forces in the Community is based in...\nNottingham to Matlock Rail Service Following timetable changes instigated by East Midlands Railway (EMR) in the summer of 2021, the Nottingham to Matlock rail service was suspended, severely...",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_darren-henry-mp-stapleford-towns-fund-project-update/content_20.html": "The Stapleford Towns Fund Project Update was a brilliant event to get feedback from residents on the progress that we have made with the Towns Fund. Please find out more information in the video above.\nThe Stapleford Towns Fund Project Update was a brilliant event to get feedback from residents on the progress that we have made with the Towns Fund. Please find out more information in the video above.",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk/content_1.html": "Latest News Darren Henry reflects on his time as Broxtowe MP Broxtowe had their say. I am incredibly proud of the work I have done to… Vote Darren Henry for Broxtowe on 4 July Vote Darren Henry for Broxtowe on 4 July Darren Henry MP writes to the new Mayor of the East Midlands I have written to the new Mayor of the East Midlands to highlight my… Campaigns Robin Hood Half Marathon This September, I will be running my first ever Robin Hood Half Marathon in aid… Nottingham to Matlock Rail Service Following timetable changes instigated by East Midlands Railway (EMR) in the… Facebook Instagram Twitter\nDarren Henry reflects on his time as Broxtowe MP Broxtowe had their say. I am incredibly proud of the work I have done to…\nDarren Henry MP writes to the new Mayor of the East Midlands I have written to the new Mayor of the East Midlands to highlight my…\nRobin Hood Half Marathon This September, I will be running my first ever Robin Hood Half Marathon in aid…\nNottingham to Matlock Rail Service Following timetable changes instigated by East Midlands Railway (EMR) in the…",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_campaigns_robin-hood-half-marathon/content_9.html": "This September, I will be running my first ever Robin Hood Half Marathon in aid of local charity Forces in the Community.\nForces in the Community is based in Beeston and offers advice and support to Veterans and their families with issues such as housing, benefits, mental health and employment.\nAs a Veteran myself, I know first-hand the important role played by organisations like Forces in the Community in helping members of the Armed Forces transition to civilian life. I am pleased to be raising much needed funds to help the charity continue with their vital work.\nFor anybody wishing to donate to my fundraising campaign, please visit https://www.gofundme.com/charity/forces-in-the-community",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_events_feed/content_22.html": null,
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_self-employment-income-support-scheme-seiss/content_15.html": "Self-Employment Income Support Scheme (SEISS)\nIt is absolutely vital during this pandemic that no one is left behind. All self-employed individuals must have support in place.\nDuring this new lockdown, it is more important than ever that we look again at the SEISS scheme and ensure that no one is left without support.\nSo, I have written once more to the Chancellor on behalf of those constituents in Broxtowe who have fallen through the gaps with financial support.\nExpanding the scheme at this stage may be the only way to ensure that many self-employed people, such as those mentioned in my letter, are protected by this Government so that they may have the opportunity to emerge from the pandemic with businesses still able to survive and grow.\nThank you to those constituents who have raised this to my attention.",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_category_Speeches/content_11.html": "My Link to the Windrush Generation 24th June 2020 For those who feel the need to put me in a box - I am British Afro-Caribbean. My Dad, Harry, came from Jamaica and my Mum, Gloria, came from Trinidad & Tobago... Speeches",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_category_Opinions/content_10.html": "Self-Employment Income Support Scheme (SEISS) 7th January 2021 Self-Employment Income Support Scheme (SEISS) It is absolutely vital during this pandemic that no one is left behind. All self-employed individuals must have... Opinions\nNo Child Should Grow Up Hungry 23rd October 2020 I appreciate the immense difficulties posed by coronavirus, and that the most vulnerable in society have faced even greater challenges. Eradicating child... Opinions\nGeorge Floyd, Black Lives Matter, Covid-19 and outcomes for BAME groups 4th June 2020 Many of you have been contacting me about the death of George Floyd in the US, the Black Lives Matter campaign and outcomes for BAME groups. Please be assured... Opinions\nDarren’s Statement Regarding Dominic Cummings 27th May 2020 Darren Henry MP’s Statement Regarding Dominic Cummings In recent days, I have received hundreds of emails from constituents regarding the actions of Dominic... Opinions\nPublic Service 25th November 2019 No stranger to public service, Darren devoted 26 years of his life to our country with the Royal Air Force. His skills, loyalty and work ethic honed in the face... Opinions\nA Broxtowe Romance 24th November 2019 Darren met the love of his life, Caroline, whilst living and working in the area during the 90s - Caroline was born and raised here, with the history of their... Opinions\nRAF100 10th July 2018 Celebrating a 100th anniversary is an amazing achievement, and the history of our Royal Air Force is made up of just that. Amazing achievements, undertaken by... Opinions\nWindrush Day 22nd June 2018 Today marks 70 years since the Empire Windrush arrived at Tilbury Docks. We will mark the contribution of the Windrush generation to British society and ensure... Opinions\nHenry VIII talk by Dr David Starkey compares Brexit to the Reformation 19th March 2017 Dr David Starkey, the UK's leading constitutional historian, compares Brexit to the Reformation. Last night David discussed the English King that everybody... Opinions",
  "https_www_darrenhenry_org_uk_/https_www_darrenhenry_org_uk_news_darren-henry-mp-writes-new-mayor-east-midlands/content_19.html": "I have written to the new Mayor of the East Midlands to highlight my constituents’ desire to have a Toton Link Road and an Apprenticeship Hub in Broxtowe. Please read my letter below:\nI have written to the new Mayor of the East Midlands to highlight my constituents’ desire to have a Toton Link Road and an Apprenticeship Hub in Broxtowe. Please read my letter below:\n| Attachment | Size |\n|---|---|\n| Darren Henry MP writes to the new Mayor of the East Midlands (173.72 KB) | 173.72 KB |"
}