{
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_contact/content_7.html": "Skip to main content\nMain navigation\nHome\nAbout Sherrie\nNews\nCampaigns\nContact\nContact\nLeave this field blank\n[email protected]\nFacebook\nOn Twitter\nSherrieLee_McDaid\nFirst Name\nLast Name\nPostcode\nAddress id\nAddress 1\nEmail\nMobile number\nMessage\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:\nYes\nThere will be an easy way to opt out of future messages. For more information on how we handle your data and your rights, please see our\nPrivacy Policy\n.",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_speaking-annual-civic-service-st-marys-church-cheshunt/content_2.html": "It was an honour to be invited to speak at the Mayor's Annual Civic Service.\nA huge thank you to the Reverend Eugene Hanshaw for leading a beautiful service and to the Cheshunt Sea Cadets' immaculate welcome to guests.\nThank you also to the 'dream team at Broxbourne Borough Council who over saw the event with a friendly smile and good cheer, not to mention providing all the cakes!\nAn uplifting and thoughtful community event, which after attending, has always left me humbled and thankful for everything I have around me.",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_category_Articles/content_9.html": "Employment rate: Near record highs 16th April 2024 Sherrie welcomed the news today, where it was announced that the latest jobs figures show there are nearly 4 million more people in work since 2010 with 204,000... Articles\nProtecting and improving water quality across England. 9th April 2024 Conservatives are committed to protecting and improving water quality across England. Sherrie was pleased to hear the Government’s announcement this week that... Articles\nBusy Year so far, on the Campaign Trail! 6th April 2024 It’s been a busy year so far, out on the campaign trail across London and the Eastern Region! Campaign mutual aid is so important. We in the Conservative Party... Articles\nBlast from the Past - My Student of the Year Award 11th February 2024 Clearing out a draw this afternoon and I found this blast from the past! Reading it back through has left me feeling humbled and grateful, remembering the... Articles\nNational Apprenticeship Week 2024 8th February 2024 Apprenticeships can take you anywhere – whether you want to become a nurse, doctor, hairdresser, lawyer, plumber, personal trainer or any career, nearly 70% of... Articles\nCWO Herts, Watford Action Day! 27th January 2024 Fantastic turnout for the CWO Herts, Watford Action Day! A HUGE thank you to the absolutely brilliant Joy Morrissey MP for joining us. Thank you to everyone who... Articles\nGrowing the economy through the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) 24th January 2024 In July 2023, the UK became the first European country to join the CPTPP bloc, worth £12 trillion. With 500 million people across CPTPP countries, this trading... Articles\nCutting Taxes for 27 Million Working People 6th January 2024 Fantastic news as taxes are cut for 27 million working people! Conservatives are making a real positive difference in people's lives. Find out your savings... Articles\nThe 'Get Around for £2' Bus Scheme has been extended. 1st November 2023 Buses are the most popular form of public transport so keeping bus fares down will be of great benefit, linking communities and preventing isolation. That is... Articles",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_broxbourne-cheshunt-police-cadets-awards-recognition-evening-2023/content_5.html": "It was an honour to join the Broxbourne & Cheshunt Police Cadets Awards evening. It was inspiring to meet so many young aspiring people and celebrate their hard work and commitment in helping look after their community. Thank you for organising a lovely evening and a big thank you to the Cadets for stepping up and wanting to make a positive difference in people's lives. You're all heroes and your family and friends must be very proud.",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_fragility-freedom/content_25.html": "Freedom is fragile and it cannot, it must not, be taken for granted.\nOn the 27th January, it is Holocaust Memorial Day, join the nation to take part in the 'Light the Darkness' national moment at 8pm.\nI was honoured and immensely humbled to attend the Holocaust Memorial service at the Lowewood Museum, Broxbourne today, where we remembered all those who were brutally murdered for who they were. It is not enough that we just remember, we were also reminded how vital it is, that we must stand up against prejudice and racism today.\nFollow this link to find out more about what the Holocaust Memorial Day Trust are doing to spread this message and how you to can stand up against hatred and bring light to where there is darkness - https://www.hmd.org.uk",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_cwo-herts-watford-action-day/content_15.html": "Fantastic turnout for the CWO Herts, Watford Action Day! A HUGE thank you to the absolutely brilliant Joy Morrissey MP for joining us.\nThank you to everyone who came to support the determined and fantastic Dean Russell MP today. The fantastic team was able to cover lots of ground and bring back many surveys from residents. Thank you to all the residents who were able to give some time completing the surveys and sharing their views.",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_dare-dream/content_11.html": "WoW! The fabulous students of LMA Studios lit up the stage this afternoon with their 'dare to Dream' performance at The Spotlight which I attended as Deputy Mayor. Thank you to you all for an inspiring afternoon where you all truly shone like stars and showed what is possible when you dare to dream! Keep on shining, you awesome stars.",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk/content_1.html": "Latest News Employment rate: Near record highs Sherrie welcomed the news today, where it was announced that the latest jobs… Protecting and improving water quality across England. Conservatives are committed to protecting and improving water quality across… Speaking at Annual Civic Service, St Mary's Church, Cheshunt It was an honour to be invited to speak at the Mayor's Annual Civic Service. … Find me on X Find me on Instagram Find me on Facebook\nEmployment rate: Near record highs Sherrie welcomed the news today, where it was announced that the latest jobs…\nProtecting and improving water quality across England. Conservatives are committed to protecting and improving water quality across…\nSpeaking at Annual Civic Service, St Mary's Church, Cheshunt It was an honour to be invited to speak at the Mayor's Annual Civic Service. …",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_national-apprenticeship-week-2024/content_16.html": "Apprenticeships can take you anywhere – whether you want to become a nurse, doctor, hairdresser, lawyer, plumber, personal trainer or any career, nearly 70% of jobs can now be accessed via an apprenticeship. And from September 2024, they could even take you to space!\nThis week is Apprenticeship Week, and Sherrie is using the opportunity to reflect on how an apprenticeship was the vital stepping stone in her own education and also to celebrate the achievements of our fantastic apprentices across the country,\nCommenting, Sherrie said: “The positive impact the Conservative Government’s apprenticeship scheme has had on opening up new opportunities and career pathways, as well as playing a critical role in local economies is not only fantastic news for our young people but will deliver tangible results, delivering brighter futures across the country by ensuring people have the skills they need to secure high-skilled jobs, and creating a stronger economy. The plan under the Conservatives is working’’\nSince taking office in 2010, the Conservative Government has delivered 5.7 million apprenticeships across the country. With nearly 700 apprenticeship training courses available now, young people have a diverse range of career pathways available to ensure they learn the skills they need to succeed in a career they love.\nJust this week, the Conservative Government announced they are introducing a new teaching apprenticeship that will offer a high-quality, alternative route for people to become qualified teachers. This is on top of record levels of funding in skills and apprenticeships with investment to apprenticeships increasing to £2.7 billion by 2024-25, creating a world-leading skills system that is employer-focused, high quality, and fit for the future.\nUnder the Conservatives, the plan is working. If we stick to the plan, we can continue to create more opportunities for our young people to gain the skills they need to succeed in life so they can build a brighter future.\nFind the Apprenticeship for you, here - https://www.gov.uk/apply-apprenticeship",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_busy-year-so-far-campaign-trail/content_23.html": "It’s been a busy year so far, out on the campaign trail across London and the Eastern Region! Campaign mutual aid is so important. We in the Conservative Party come together with our shared values and determination to help candidates both local and national cover as much ground as possible in order to spread the positive work our party is doing for the country, and make sure we listen and hear from as many people as we can.\nIt's been fantastic and insightful hearing from residents and meeting so many incredible and passionate activists out on the campaign trail. Politics has the power to change and benefit lives. Conservatives are the only party that will fight for opportunity and aspiration, so people are able to take control of their own future, ensure that hard work pays off and people can build successful lives and have bright futures.",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_growing-economy-through-comprehensive-and-progressive-agreement-trans-pacific-partnership/content_19.html": "In July 2023, the UK became the first European country to join the CPTPP bloc, worth £12 trillion. With 500 million people across CPTPP countries, this trading opportunity will boost investment and support thousands of UK jobs.\nYesterday it was announced, Singapore ratified the UK’s membership of the Comprehensive and Progressive Agreement for Trans-Pacific Partnership.\nCommenting, Sherrie said: ‘’This is welcome news, this deal will benefit businesses in all corners of our country and help deliver on the Conservatives promise to grow the economy. CPTPP membership will ensure 99% of goods traded with the trade bloc will be tariff-free.\nThese are real steps in helping to grow our economy, create jobs and provide a boost to business as we stick to our plan to ensure a brighter future for the whole of the UK.’’",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_accessibility/content_12.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_local-bee-experience/content_13.html": "It was a magical and fascinating experience meeting a local beekeeper and finding out about our pollinator friends the Honey Bee. The local hive enclosure I visited also provides a meaningful, quiet and contemplative setting for people - children and adults alike.\nHowever, pollinators face many pressures which have led to declines in numbers, and a reduction in the diversity of species to be found in many parts of the country.\nI am a strong believer in being proactive and there are a plethora of actions we can all take to both protect and enhance the environment as well as provide enough homes and public infrastructure for future generations.\nTo start with 5 simple actions that anyone can take to help pollinators:\n- Grow more flowers, shrubs and trees.\n- Let patches of land grow wild.\n- Cut grass less often.\n- Do not disturb insect nests and hibernation spots.\n- Think carefully about whether to use pesticides.\nContinued in my campaign section…",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_21st-anniversary-celebrations-top-field-cozens-grove-local-nature-reserve/content_24.html": "It was an honour to be invited to present the very well deserved Green Flag to the Friends of Wormley Open Spaces and to celebrate the 21st Anniversary since the creation of the Top Field & Cozens Nature Reserve. There was a fantastic turnout and the jubilant performances from the Steel Pan in Motion group were enjoyed by everyone, including the many four legged friends taking their Sunday afternoon walk through this beautiful green space!",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_volunteering-barclay-park-broxbourne/content_20.html": "A lovely Saturday morning spent helping the Friends of Barclay Park.\nMore volunteers always welcome to come help keep this beautiful space clean and preened! Volunteering is a fantastic way to get involved in your local community, meet new people and get a bit of a work out too!",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_employment-rate-near-record-highs/content_10.html": "Sherrie welcomed the news today, where it was announced that the latest jobs figures show there are nearly 4 million more people in work since 2010 with 204,000 more pay-rolled employees this year and the level of youth unemployment is down by 43.8% since 2010. Real wages have risen for the ninth month in a row whilst inflation is falling meaning regular pay is continuing to grow and outpace inflation.\nCommenting, Sherrie said '‘Today’s released employment figures tell us the Conservative’s plan for the country is working. As we continue to see inflation fall and wages rise, it is clear that it is the Conservative party that will deliver the jobs hardworking families need and ensure that work pays.\nI am particularly pleased to see youth unemployment has fallen by almost half since 2010.\nThis Conservative government is ensuring the right support is available to help young people to enter and progress in employment. Helping them take control of their own futures and build successful careers and lives.\nWe must never forget that no Labour government has ever left office with unemployment lower than when it started.\nIt is only the Conservatives who will create opportunity for everyone, make sure work pays and help people build successful lives for themselves and their families.’’",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_category_Local-News/content_3.html": "Speaking at Annual Civic Service, St Mary's Church, Cheshunt 7th April 2024 It was an honour to be invited to speak at the Mayor's Annual Civic Service. A huge thank you to the Reverend Eugene Hanshaw for leading a beautiful service and... Local News\nFragility of Freedom. 26th January 2024 Freedom is fragile and it cannot, it must not, be taken for granted. On the 27th January, it is Holocaust Memorial Day, join the nation to take part in the... Local News\n21st Anniversary Celebrations at Top Field & Cozens Grove Local Nature Reserve 3rd September 2023 It was an honour to be invited to present the very well deserved Green Flag to the Friends of Wormley Open Spaces and to celebrate the 21st Anniversary since... Local News\nVolunteering at Barclay Park, Broxbourne 2nd September 2023 A lovely Saturday morning spent helping the Friends of Barclay Park. More volunteers always welcome to come help keep this beautiful space clean and preened... Local News\n''Bee' a Volunteer! 30th June 2023 Super fun Friday morning helping look after local honeybee hives and making beeswax candles from scratch! More volunteers would be gladly welcome, get in... Local News\nLocal Bee Experience 26th May 2023 It was a magical and fascinating experience meeting a local beekeeper and finding out about our pollinator friends the Honey Bee. The local hive enclosure I... Local News\nBroxbourne & Cheshunt Police Cadets Awards & Recognition Evening 2023 25th May 2023 It was an honour to join the Broxbourne & Cheshunt Police Cadets Awards evening. It was inspiring to meet so many young aspiring people and celebrate their hard... Local News\nHealthy Mindset, Healthy You 24th May 2023 Just finished a very productive meeting with the brilliant team at Strength in Mind Therapeutic Services CIC. We discussed many important issues such as... Local News\nMore Police Recruited in Hertfordshire 26th April 2023 In 2019 the Government promised to recruit 20,000 additional police officers in England and Wales and today the Prime Minister confirmed that they had delivered... Local News",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_cutting-taxes-27-million-working-people/content_14.html": "Fantastic news as taxes are cut for 27 million working people! Conservatives are making a real positive difference in people's lives.\nFind out your savings through this link - www.https://taxcuts.conservatives.com\nFantastic news as taxes are cut for 27 million working people! Conservatives are making a real positive difference in people's lives.\nFind out your savings through this link - www.https://taxcuts.conservatives.com",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_campaigns_love-where-you-live/content_6.html": "Please get in touch if you would like to get involved in a local community activity. From litter picks, supporting local businesses and town events, amateur dramatics, park gardening groups, park runs, and charity bucket collections, there are many ways to make a positive impact in your town.\nIn July 2020, during our first Lockdown in the UK, I created a community action campaign inviting people to help raise awareness of worthy causes in Broxbourne by getting moving!\nI wanted to help keep people engaged in their community as well as stay active, which is not only good for our physical health but also beneficial to our mental and emotional well-being.\nThe campaign was called ‘’Broxbourne Travel the World’’ and people from anywhere in the world could send in the distance they had travelled through getting active and these distances were added together to plot a trip around the world!\nActivities ranged from; walking, running, cycling, horse riding, distance covered in a litter pick, walking the dog, pushing the pram, mowing the lawn, school's Sports Day…people really got creative, it was great fun!\nI enjoyed this campaign immensely and the response and uptake was incredible. Together, the Broxbourne Travel the World community covered the distance of a trip around the world within a year!\nFollow these links to see what we achieved:\nWebsite - www.findwaysonward.com\nInstagram - https://www.Instagram.com/Broxbourne_traveltheworld\nFacebook - https://www.facebook.com/groups/broxbournetravelstheworld/?ref=share\nI want to build on this community spirit, as it benefits people and the local area.\nI look forward to hearing from you!",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news_more-police-recruited-hertfordshire/content_18.html": "In 2019 the Government promised to recruit 20,000 additional police officers in England and Wales and today the Prime Minister confirmed that they had delivered on that promise.\nThis comes as part of a wider plan of action to tackle crime across the nation. The Government’s Beating Crime Plan will deliver a safer Britain alongside record funding for our police, with a £17.2 billion policing budget for 2023–2024. This is alongside the Police, Crime, Sentencing, and Courts Act, which is giving the police and courts the powers they need to tackle serious crime head on. The Conservative Government is also delivering its Violence Against Women and Girls Strategy, backed by £100 million in funding, making UK streets and neighbourhoods safer for women and girls.\nCommenting, Sherrie said ‘’ This positive news is very assuring. These new recruits mean there are now a further 338 more police officers in Hertfordshire and more police officers than ever before across the country, helping to pursue criminals and tackle anti-social behaviour. It is clear that Conservatives are working hard and delivering to keep our country safe.’’",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_news/content_8.html": "Employment rate: Near record highs Tuesday, 16 April, 2024 Sherrie welcomed the news today, where it was announced that the latest jobs figures show there are nearly 4 million more people in work since 2010 with 204,000 more pay-rolled employees this year and the level of youth unemployment is down by 43.8% since 2010. Real wages have risen for the ninth month in a row whilst inflation is falling meaning regular pay is continuing to grow and outpace... Articles\nProtecting and improving water quality across England. 9th April 2024 Conservatives are committed to protecting and improving water quality across England. Sherrie was pleased to hear the Government’s announcement this week that... Articles\nSpeaking at Annual Civic Service, St Mary's Church, Cheshunt 7th April 2024 It was an honour to be invited to speak at the Mayor's Annual Civic Service. A huge thank you to the Reverend Eugene Hanshaw for leading a beautiful service and... Local News\nBusy Year so far, on the Campaign Trail! 6th April 2024 It’s been a busy year so far, out on the campaign trail across London and the Eastern Region! Campaign mutual aid is so important. We in the Conservative Party... Articles\nBlast from the Past - My Student of the Year Award 11th February 2024 Clearing out a draw this afternoon and I found this blast from the past! Reading it back through has left me feeling humbled and grateful, remembering the... Articles\nNational Apprenticeship Week 2024 8th February 2024 Apprenticeships can take you anywhere – whether you want to become a nurse, doctor, hairdresser, lawyer, plumber, personal trainer or any career, nearly 70% of... Articles\nCWO Herts, Watford Action Day! 27th January 2024 Fantastic turnout for the CWO Herts, Watford Action Day! A HUGE thank you to the absolutely brilliant Joy Morrissey MP for joining us. Thank you to everyone who... Articles\nFragility of Freedom. 26th January 2024 Freedom is fragile and it cannot, it must not, be taken for granted. On the 27th January, it is Holocaust Memorial Day, join the nation to take part in the... Local News\nGrowing the economy through the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP) 24th January 2024 In July 2023, the UK became the first European country to join the CPTPP bloc, worth £12 trillion. With 500 million people across CPTPP countries, this trading... Articles\nCutting Taxes for 27 Million Working People 6th January 2024 Fantastic news as taxes are cut for 27 million working people! Conservatives are making a real positive difference in people's lives. Find out your savings... Articles",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_about-rss/content_4.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_privacy/content_17.html": "This document outlines how Sherrie McDaid processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Sherrie McDaid\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Sherrie McDaid.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Sherrie McDaid, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Sherrie McDaid via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_events_feed/content_21.html": null,
  "https_www_sherriemcdaid_uk_/https_www_sherriemcdaid_uk_cdn-cgi_l_email-protection/content_22.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare."
}