{
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-071024/content_23.html": "MP newsletter - flooding, child poverty, and bus services - 07 October 2024\nDo you want to receive this newsletter first? Click here to subscribe\nGood morning and thank you for subscribing. As Parliament has been in recess, this edition of the newsletter is focused on local news.\nBirmingham news\nFlooding\nHouses, businesses, schools, and other public buildings across the Northfield area were flooded on Thursday 26 September. The flooding also caused severe traffic disruption, and, in some cases, cars had to be rescued.\nMy thoughts are with all those whose face the misery of flood damage. Even with insurance, the shock of the intrusion and the loss of personal items can be impossible to put right.\nI spent that night and the days that followed escalating reports and appeals from constituents. Public information was also provided. A special mention is due for the constituency office team, who worked incredibly hard to get people support from the authorities.\nAs global warming rises, the risk of flooding is also set to increase. Although the River Rea swelled, this time the damage was attributed to groundwater flooding (in other words, from rain run-off).\nA number of people have made reports of blocked drains, which can raise the risk of groundwater flooding. I am concerned that the highways contractor, Kier, has advised that it may take up to 16 weeks for drainage teams to visit ‘low priority’ reports. This takes us in theory beyond Christmas, and my office are working with local councillors to see if the callouts can be sped up.\nChild poverty\nIn September, the Birmingham Mail published a hard-hitting report on child poverty in the city. It is a difficult but essential read.\nThe report sets out how the heavy ties of inadequate (and often shocking) housing conditions, hollowed-out public services, and low wages combine to hold people down. Locally, almost one in three children are in relative poverty, and one in five are in absolute poverty.\nNationally, child poverty rates were up by a third over the last eight years. But in the Birmingham Northfield constituency they almost doubled. Those rates started below the West Midlands average, but now we have fallen behind.\n(Figures and graphic are care of the House of Commons Library)\nThere was once a legal duty on the government to prepare child poverty strategies, and to report against targets for reducing child poverty. Those targets were scrapped in 2016. The scrapping of targets means that the impact of government policy on child poverty is now lesser reported (for example, at a time when public sector pay is a topical issue, it is worth reflecting that past caps on pay made child poverty worse).\nIt is therefore welcome that a new child poverty strategy is due to be published next Spring. It is important that the issues raised by the Birmingham Mail’s report are reflected in its work.\nAnother immediate step is the creation of free breakfast clubs in primary schools. These clubs have been proven to reach children who might not otherwise get three meals a day, while raising attainment. Funding is now available for 750 ‘early adopter’ primary schools and I’d encourage schools in the Northfield constituency to apply.\nThese positive steps must be balanced by the extremely concerning news – confirmed today – that Birmingham’s youth service budget faces cuts of two-thirds, which places more than half of staff posts, and the future of the Factory youth centre in Longbridge at risk.\nI have written before about Birmingham City Council’s financial challenges (of which, there is more below). The city must get back to a balanced budget. But what accounting is being made of the long-term social and financial costs of this reduction in services, particularly when organised crime gangs are targeting young people who are excluded (or at risk of exclusion) from the system?\nThese proposals are not yet confirmed – they will be subject to consultation, and I will make a full representation. As with the submission to the library consultation, this will be made public.\nSEND surgery\nOne linked issue is Special Educational Needs and Disabilities (SEND). Too many families and carers are being forced to fight for basic provision within a failing system. I have spoken to too many parents who have been forced to give up work in order to keep their children in education.\nOn Wednesday, I held my first ‘SEND surgery’ which was organised with the excellent SEND Socials Birmingham group.\nWithout going into the details of individual cases, there were some common themes, including: shortages in professionals (which is holding up diagnoses and making it harder to get Education, Health and Care Plans); and agencies not working together as they should.\nI’m grateful to those who attended. It is not always easy for people to share their experiences. A number of casework issues were picked up, and it is very helpful for me to hear directly what is going wrong for the next time that SEND reforms are debated in Parliament.\nTelegraph poles – investigation\nI wrote about telegraph poles in the last newsletter. As an update: OFCOM has confirmed that it is now investigating BRSK’s approach to telegraph pole installation in Birmingham, following a complaint submitted by Birmingham City Council in May.\nI attended a residents’ meeting in Pineview, near Northfield Station, to discuss the issue in more depth. I am in contact with BRSK and raising individual cases, but the problem remains that consultation is seen as ‘best practice’ only, due to changes made around a decade ago.\nThe debate on planning permission and telegraph poles has been delayed – hopefully by no more than a week – to make time on the Parliamentary agenda to mark the one-year anniversary of the appalling atrocities on 07 October, and in the days that followed. I hope to have a substantial update next week or the week after.\nBirmingham City Council finances\nBack in September, I secured a commitment from the new government that they would be ‘open to any representations they [Birmingham City Council] want to make’ over funding, and the central government approach to Birmingham that was inherited from the previous government (which was described by the West Midlands Mayor, Richard Parker, as a ‘political hit job’ last week).\nA cautiously encouraging update was given by the local government Minister, Jim McMahon, at Labour Party Conference, which is worth quoting:\n’There is a commitment from us (the Government) to say to Birmingham ’we are open to receiving your proposals. We are listening, if you can present a proposal that holds water, that will satisfy the … Treasury. …\n’What we have not said to the council is that we, the Government, have a proposal to extend the recovery period or give more money. But we have said to the council we are open to the council proposing an alternative. That is an important difference.\n‘The onus is on the council to say ’we are seeking to reschedule things - the cost of Oracle is now this, the equal pay liability is now this, can we reschedule the borrowing on that basis through capitalisation, which means we don’t have to make the same cuts or asset sales.’\nBirmingham faces real problems. It is better that those problems are fixed from within the city, but central government has an important role to play as well, and I am hopeful that a more constructive approach will be found.\nTransport update\nCross-city buses - Longbridge to Sutton Coldfield\nAs mentioned in the last newsletter, Transform for the West Midlands has now published details of its proposals for bus services.\nThe planned scheme extends beyond the constituency, but details for Longbridge to Northfield high street can be found here. A second set of proposals affect the Bristol Road northwards, from (broadly speaking) St Laurence Road to the Weoley Park Road area. These can be viewed here.\nMany of the details seem very sensible to me. At the southern end, TfWM proposes to extend bus parking areas, and minor road widening, in Longbridge, as well as putting up additional shelters. Better enforcement for the bus cage is also proposed for Northfield high street.\nMore extensive works are proposed north of Northfield high street through to Selly Oak high street, including the installation of a series of non-continuous bus lanes where there are stops. There would be some widening of the road and the loss of five trees through this section.\nI travel most places by public transport. We need better public transport options to reduce emissions and free up space for all road users. I want to support proposals that will deliver a more reliable bus service, and I’d be really interested in your views on the TfWM proposals (questions are at the end of the newsletter).\nHelp with the cost of public transport\nRichard Parker and Transport for the West Midlands have also launched a public awareness campaign to get more people who are starting new jobs signed up to support with the cost of transport.\nUnder the Workwise scheme, people who are starting a new job (and earning £30,000 or less) can get two months’ free travel on bus, rail and tram – followed by a further 50 per cent discount for a month. There is no income criteria for people who are coming off unemployment benefits.\nIf this applies to you (or someone you know) then you can apply for a ticket here.\nRail news\nFinally, congratulations to Laura Shoaf, Chief Executive of the West Midlands Combined Authority, who has been appointed as the new Chair of Great British Railways – the body which will oversee passenger services under public ownership.\nI first met Laura many years ago, when she was a director of the old West Midlands Integrated Transport Authority, and it can only be good for Birmingham to have someone based in the city in the driving seat as the railways change.\nKings Norton mop fair\nThe Kings Norton Mop Fair is today – rides and other entertainment are on the Green from 15:00 to 22:00.\nOut and about\nSince the last newsletter, I attended a meeting of the Northfield Business Improvement District (BID) to hear about potential improvements to the high street. I also spoke at a public meeting organised by the Friends of Northfield Library (alongside a representative of the Birmingham Loves Libraries campaign).\nI attended the in-person consultation at Frankley Community Library, alongside local residents, to help make the case for a viable future for this community asset. I also had the privilege of spending some time at King Edward VI Balaam Wood Academy next door, where the leadership team has done a very impressive job of improving the school over the last eight years. Funding has been confirmed for a rebuild of the 1980s site – it is now important that the timetable is confirmed.\nWith thanks to Northfield Community Partnership, I attended and spoke at their International Day of Older Persons event at Hawkesley Community Centre. It was great to see so many people there. Along with my team, we shared information on Pension Credit applications, which will also go on the website when it is refreshed. Another important community initiative is FoodCycle at St Gabriel’s in Weoley Castle, where free hot food is available each Tuesday, and I was glad to spend time with volunteers and guests.\nI also met UNISON representatives to talk about public services (it can become a politicised point – but I will always be proud of my trade union background). Unfortunately, I couldn’t attend a meeting with Shenley Neighbourhood Watch and the canal clean-up in Kings Norton due to illness at the end of last week, and I hope to rearrange soon.\nInternational\nThe fear of a wider war in the Middle East is compounding the scenes of horror in Palestine, which underlines the need for an immediate ceasefire, progress towards a two state solution and – one year on from the October 07 pogrom – the release of hostages. I am hoping to speak in a debate on the importance of getting more aid into Gaza later this week.\nIf you know anyone who has ties to the constituency and who is attempting to leave Lebanon then please get in touch.\nWhat do you think?\nHave you had a chance to look at the proposed bus measures along and the around the A38? What is your view on TfWM’s plans? Are there other specific improvements that you would like to see to local bus services?\nI’d be particularly interested in different perspectives on the proposals – such as from residents, as well as bus passengers, drivers, pedestrians and cyclists who use the route.\nBest wishes\nLaurence Turner\nMP for Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThis newsletter was mostly written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_storm-darragh/content_33.html": "Storm Darragh\nEnvironment\nI am aware of the impact of the extreme weather experienced this weekend across the constituency. I hope that everyone has been able to stay safe.\n- Birmingham City Council - Highways Department (for tree removal): 0121 303 4119\nIf anyone is experiencing specific issues, please do not hesitate to contact my office.\nEmail: laurence.turner.mp@parliament.uk\nPhone: 0121 516 5770 (Monday to Friday, 0900 - 1700)",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_brigids-cc/content_28.html": "Education questions - St Brigid’s and Cadbury College\nThere are fewer hustings events than there used to be. But on Wednesday, I was put on the spot by the School Parliament at St Brigid’s Catholic Primary School.\nAlong with Gary Sambrook (Conservative MP for the 2019 - 2024 Parliament), the pupils asked us searching questions about homelessness, how official decisions are made, refugees, crime, and traffic on Frankley Beeches Road.\nThe School Parliament is a credit to St Brigid’s, and I hope to be in a position to visit again. You can read the school’s account of the event here.\nLater that day, I spoke at a hustings for students and staff at Cadbury College, which was attended by the local Labour, Green and Reform candidates, and the Conservative candidate for Selly Oak and the Liberal Democrat candidate for Ladywood.\nThe questions covered a wide range of subjects, including job prospects for young people, the cost of living crisis, inclusion, the war in Gaza, and skills policy. The debate was at times robust - as it should be - but the tone was respectful throughout. I am grateful to Cadbury College for the invitation.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_news/content_17.html": "Latest Northfield news and views\nA New Deal for Working People\nWork\nCampaign\nKings Norton\nLongbridge and West Heath\nPollution in the Rea\nEnvironment\nNorthfield\nRiver Rea\nFriends of Balaam’s Wood\nFrankley Great Park\nCommunity\nNewStarts\nFrankley Great Park\nCommunity\nSupporting our high streets\nNorthfield\nKings Norton\nHigh Streets\nCrime and anti-social behaviour\nCampaign diary: 02 June\nCampaign\nAllens Cross\nFrankley Great Park\nNorthfield\nWeoley and Selly Oak\nNo matching items",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_walking-cycling-jan-25/content_45.html": "Cycling and walking investment\nChris Boardman gave evidence at the Transport Select Committee on Wednesday.\nA couple of years ago, the Tories cut funding for road improvements by two-thirds.\nHe accepted that this meant that (a) fewer people are now cycling and (b) walking and cycling targets are ’extremely hard to hit.\nA new strategy is due soon and I hope that it will set out secure, long-term funding so that more improvements like the Bristol Road cycleway extension can go ahead.\nLaurence Turner: I won’t speak for others, but I think we understand the importance of long-term certainty and funding. Returning to those inyear budget reductions for ’23-24, is it accurate to boil it down to saying that those projects not proceeding meant that fewer people are now cycling and the 50% target is harder to hit?\nChris Boardman: Yes, it has made it extremely hard to hit those targets, and there would have to be some significant changes in policy or funding to be able to meet it by 2030. We still have a massive pipeline of schemes with local authorities. They still have their network plans. We have just slowed right down on the delivery without the commitment to deliver it—the commitment in consistency and the funding itself.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_caseworker-vacancies/content_42.html": "Vacancies - caseworkers (x2)\nI am recruiting two caseworkers - closing date 23 August 2024.\nApplications are encouraged from people who have a background in community and voluntary organisations in the Northfiled constituency. Please see below for more details about the role and how to apply.\nClosing Date: 23 August 2024\nJob Title: Caseworker (two posts)\nWorking For: Laurence Turner MP (Birmingham Northfield)\nLocation: Constituency office (initially in Longbridge)\nSalary: £31,000\nLength of Contract: Permanent (subject to successful completion of a probationary period)\nJob Details\nLaurence Turner MP is seeking to recruit two caseworkers to work and play a key role in a busy constituency office.\nThis role is full-time and constituency office-based, however requests for flexible working arrangements will be considered.\nResponsibilities\n• Responding to enquiries and securing improvements for residents of the Northfield constituency.\n• Accurately and securely logging and maintaining casework records.\n• Completing casework that is of a consistently high-standard and completed in a timely, sensitive, and professional manner.\n• Assisting with surgery appointments and meetings if required.\n• Working with external agencies and local voluntary organisations.\n• Other duties as may be reasonably directed from time to time.\nPersonal specification, knowledge, and experience\nThe postholder should have:\n• Experience of casework or a related role.\n• A good writing style.\n• A proven ability to manage a large and complex workload.\n• Good IT skills – including knowledge of case management systems or databases.\n• A professional manner and the ability to speak sensitively to people who may be experiencing challenging personal circumstances.\n•Knowledge of Birmingham City Council, local voluntary organisations, and central government agencies (such as the Department of Work and Pensions) would be an advantage.\n• A commitment to Labour values.\nThe postholder may be required to occasionally work outside of normal working hours.\nUpon appointment you will be required to apply for security clearance, undertaken by the Security Vetting and Pass Office. See Members’ Staff Security Clearance page for further info. MPs generally pay staff in accordance with IPSA guidelines.\nClosing Date: 23 August 2024\nInterview/Start Dates\nInterviews expected in the week commencing 26 August.\nApplication Details\nEmail a CV and a covering letter (of no more than two sides of A4) to laurence.turner.mp@parliament.uk by the end of Friday 23 August, and use ‘Caseworker’ in the subject line.\nRequests for submitting applications in alternative formats will be considered.\nI am committed to being an inclusive employer and applicants are encouraged to make requests for reasonable adjustments as part of the interview process if they have accessibility requirements.\nAll new staff members will be expected to successfully complete the Members’ staff security verification process.\nImage credit - Wikimedia Commons.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_privacy/content_12.html": "Privacy policy\nI am the Member of Parliament (‘MP’) for the Birmingham Northfield constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf, and consult residents on local issues.\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nI can be contacted in relation to data protection issues at laurence.turner.mp@parliament.uk.\nData collection and use\nThe office of Laurence Turner MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do this where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails or texts where you have provided explicit consent. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe procedure that I detail in communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for Birmingham Northfield, it may be necessary for me to transfer personal information to countries or jurisdictions outside the UK. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulations (it should be noted that there are no such suppliers in use as of October 2024).\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Birmingham Northfield, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nCookies\nThis site does not automatically capture or store personal information other than the use of cookies through the Google Analytics service. The details recorded do not allow me to identify individual visitors to the website.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information.\nLinks to other websites\nThis website may contain links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\nObtain copies of the personal information I hold about you (known as a “subject access request”)\nRequest that I correct or update any personal information held about you\nAsk that we erase or restrict the way in which I use your information\nRequest that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications form me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact me:\nOffice of Laurence Turner MP\n1 Devon Way\nLongbridge\nBirmingham\nB31 2TS\nEmail: laurence.turner.mp@parliament.uk\nOctober 2024",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_campaign-diary-020624/content_24.html": "Campaign diary: 02 June\nFighting for every vote\nI spent the Friday and Saturday knocking on doors and listening to residents’ concerns.\nAs Labour’s candidate I am taking no vote for granted. Along with Labour councillors and campaigners, we’ve picked up casework throughout the weekend and reported a number of issues to the council.\nA lot of people said that they were fed up with Rishi Sunak and wanted a change after 14 years of the Conservatives. People raised serious issues which need a determined local MP and a change in national government to address.\nThese issues included:\nCrime and anti-social behaviour. This issue was raised again and again. No-one should feel unsafe on their own street and in their own constituency. But the police have been cut back. 700 police officers have been cut from West Mids Police under the Tories.\nI spoke about wanting to work with community groups as MP, and Labour’s pledge to hire 13,000 new police officers and PCSOs. I will fight for south Birmingham to gets its fair share so community policing teams can be bolstered and there can be more patrols on our streets.\nPublic services. I heard appalling accounts of waiting times for NHS surgery dates and ambulances. And schools that are struggling to provide the support that pupils need.\nWe need to invest in community services to reduce pressure on emergency services. I talked about my work on SEND through the GMB union, which represents teaching assistants and other SEND workers.\nWork and wages. People are still struggling with the cost of living crisis. Wages are falling behind and they are lower in the constituency than in other areas.\nI spoke about Labour’s plan to make work pay and restore fair treatment at work. We are the party of people who work and people who want to work, and I am proud to have helped develop these policies. Labour will also fund free breakfast clubs in our primary schools, which would provide real help to young families.\nImmigration. There is real anger over the government’s failure to stop small boats, as Rishi Sunak promised - and the money wasted on the failed Rwanda scheme.\nLabour would pull together a new Border Force Command to smash the criminal gangs that are killing people in the English Channel. We already forced the Government to scrap the discount which allowed employers to pay 20% lower wages to non-UK nationals in some jobs.\nKeir Starmer has announced new plans to provide more training places at home, and to ban companies that break the law from hiring non-UK nationals.\nI’m back out on the doorstep as we fight for every vote in every part of the constituency.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_maiden-speech/content_39.html": "Maiden speech\nI made my first speech in Parliament this week.\nI won’t always post contributions in Parliament, but by tradition the first (or ‘maiden’) speech focuses on the constituency. Most of the speech was about Northfield. That part is below and the full text can be read here.\nI tried to do the area justice, without shying away from the challenges we face.\nTo talk about Birmingham is to tell a tale of two cities. That is as true of the Northfield constituency as it is elsewhere.\nPockets of relative affluence sit cheek by jowl with deprivation. The historic village centres of Kings Norton and Northfield lie a short distance from the new estates, like Weoley Castle, that were built to serve the needs of Birmingham’s growing economy.\nThe fortunes of the constituency rise and fall with Birmingham, but the seat is also defined by its outer estates—New Frankley, Rubery and Allens Cross—which are distant and distinct from the city centre.\nAll these communities face common challenges, including crime and antisocial behaviour, and the decline of the traditional high street. They have been hit hard by cuts to neighbourhood policing and by the decision last year to not proceed with the regeneration of Northfield’s high street. There is much to do.\nFor most of the constituency’s history it was best known for the Longbridge car plant, which also drew in workers from the surrounding areas of West Heath, Rednal and beyond.\nFor 100 years, Longbridge paid handsomely into the national purse, and it was essential to our defence in times of crisis. During the second world war, Longbridge and its shadow factories produced many of the armaments and aircraft that kept our nation free. … I am reminded at this point of my grandad’s story, often repeated with pride to us as children, about his time stationed at the air defences at Billeseley Common, when he—almost—fired a rocket at an encroaching German plane.\nThe site that began as the Austin works was an important part of our national life. At its peak, it employed some 25,000 people. Models from the Austin 7 to the Metro became part of our shared culture. It is hard to believe that next year will mark the 20th anniversary of Longbridge’s closure. That occasion must be marked appropriately in Birmingham and in Parliament.\nThe site is now home to an ambitious redevelopment project and, importantly, some manufacturing jobs are returning, but travel just a short distance and the scars of that closure are still plain to see. The male employment rate remains a staggering 10 points lower than in Birmingham as a whole. Shamefully, average monthly wages are £300 lower in the constituency than they were in 2010, after inflation. The scourge of in-work poverty is never far away.\nToday, my constituents are most likely to be employed in public services. I am proud to be the son of two teachers even if, sadly, the headquarters of the NASUWT, the Teachers’ Union, which my parents were members of for many years, is just over the border in the neighbouring constituency of Bromsgrove.\nThere will be more to say—much more—in this Parliament about the funding and delivery of services in Birmingham. It is enough to say today that after 14 years of severe cuts, the second city is bleeding, and I welcome the statements that the new Government have made about the importance of putting local government funding on a sustainable footing.\nThe new Government’s plans to establish a fair pay agreement for adult social care, and to reinstate the school support staff negotiating body, will also make a real, material and long overdue difference to thousands of low-paid workers in the Northfield constituency, most of them women, who I was proud to help represent as an officer of the GMB union, and whose skills and professionalism have been undervalued for too long.\nIf I could achieve one thing in the time I have in this place, it would be to secure improvements to special educational needs and disabilities provision.\nIt is a cause that is close to my heart: I was one of those children. I know what it means to have to fight to avoid being defined by other people’s low expectations. I know the stigma that is the mark of attitudes that are still common and from words that I will not repeat in this place. I wish that I could say otherwise, but it never leaves you. I know, too, that a child’s life can turn on access to an identification or a single decision about adjustments and resources—or even for the want of a few encouraging words.\nSo if I speak for a moment in anger, it is because too many children and families in Birmingham and beyond face barriers that are higher now than they were 25 years ago, in breach of the promise that life for each generation will be better than the last. It is not enough to fight for people within a failing system; we have to change it. That is one of the causes I came to Parliament to advocate for, and I welcome the commitments on SEND made by the Education Secretary and the Prime Minister in the early days of this Parliament.\nI would like to end by talking about family.\nBefore me came generations of factory workers, electricians and shopkeepers, painters and polishers, cleaners and coachbuilders, jewellery makers and japanners—some escaping famine’s shadow—who were born in Birmingham or who came to call the city their home.\nIn the last few weeks, I have thought about those I knew, and those I did not, and what they might have said if they could have seen this day: just as the hard accumulated years of millions of working lives form the prologue to the new deal for working people and the history that this Labour Government will make.\nI have thought, too, about public service—about the challenge of proving to be equal to the task ahead and to the hopes of the people who trusted us to represent them in this place.\nMadam Deputy Speaker, I hope to be.\nImage credit - Wikimedia Commons.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_flooding-260924/content_70.html": "Flooding in Northfield and surrounding areas\nI am aware of flooding within the constituency. If anyone is experiencing specific issues please don’t hesitate to reach out to my office.\nThe current forecast suggests intermittent heavy rainfall across this evening and into tomorrow morning, and the potential for it to continue across the weekend.\nStay up to date with the latest information: Sign up to the Flood Warning service: https://www.fws.environment-agency.gov.uk/app/olr/home\nCheck the Met Office’s weather warnings: https://www.metoffice.gov.uk/\nKeep up to date with the current flood warning situation: https://check-for-flooding.service.gov.uk/alerts-and-warnings\nWhat to do in a flood: https://check-for-flooding.service.gov.uk/what-to-do-in-a-flood\nWhat happens after a flood: https://check-for-flooding.service.gov.uk/what-happens-after-a-flood",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-010125/content_11.html": "MP newsletter - Birmingham funding and industrial action, better rail services (and Happy New Year) - 01 January 2025\nDo you want to receive this newsletter first? Click here to subscribe\nGood afternoon and Happy New Year. Christmas and New Year are times when many people catch up with precious family time (including MPs), but it’s believed that more than a million people work as normal on Christmas Day, and more on New Year’s day. I’m grateful to everyone in the Northfield constituency – from those in emergency services to retail workers – who kept on going so the rest of us can enjoy that special time.\nBirmingham news\nLocal funding\nI want to start with a quick update on local funding. It was announced in late December that:\nBirmingham’s ‘core spending power’ is to rise by £227 per household, or by 9 per cent.\nThis was one of the top ten increases in England, out of more than three hundred councils.Additional money has also been put into homelessness prevention, including funding for a pilot scheme to test ending of b&b emergency accommodation.\nWest Midlands Police grant funding is to rise by 6.7 per cent.\nWhile these increases are welcome and above-inflation, painful decisions still lie ahead, and the way that money is allocated has not yet been reformed. This change will take time but, under the last government, poorer areas did not get their fair share, which is one factor in Birmingham’s troubles.\nEqual pay\nDecember saw the news that agreement in principle has finally been reached to resolve Birmingham’s equal pay dispute.\nThe equal pay problem has blighted the city for too long. The oldest claims date back as far as 2008. The loss of HR support at the council in the early days of austerity stored up new problems that have now come home. And at the heart of the problem are hundreds of women who were denied fair pay rates for years.\nSorting the equal pay dispute is important for the future financial health of the city. Some very high estimates of the liability have been bandied about in the press: £760 million, or even more than a billion. The actual settlement is reported to cost significantly less.\nThis isn’t the end of the story. HMRC must still ‘run the rule’ over the settlement. And the hard work now begins of putting in place a job evaluation scheme that prevents pay discrimination in the future. But there is no doubt that this is a stride forward for Birmingham.\nBin strikes\n… and just as a stride is taken forward, another step is taken back.\nTalks have collapsed between the Council and Unite the union, which represents the majority of refuse workers. As a result, Unite’s members are working to rule from tomorrow. Additional strike dates have been announced through to April on the following days and significant disruption is expected.\nStrike dates\n| January | February | March | April |\n| 6 | 7 | 6 | 2 |\n| 14 | 10 | 14 | - |\n| 22 | 18 | 25 | - |\n| 30 | 26 | - | - |\nAt the heart of the dispute is the proposed removal of the ‘WRCO’ role (Waste Recycling and Collection Officer). The post was introduced at the end of the last bin strike and it has reportedly been a factor in the separate equal pay case. Although some workers will be able to move to higher paid roles, others face a loss in pay.\nThe collapse of talks is of course a serious disappointment (especially as progress had been made in other areas – including the acquiring of new lorries). The Council has held out hope that talks can be resumed – if that is the case then it needs to happen quickly to establish whether any basis for an agreement remains. I will share information about service arrangements during the strikes as soon as it is available.\nBin collections\nOn a related subject, I know that a number of rescheduled Boxing Day bin collections were not, in fact, carried out. I am chasing collections with the Council along with local councillors.\nAs always, it is ultimately down to the Council to resolve missed collections, but I am always happy to take up the issue. If your collection has been missed then please feel free to contact me on: laurence.turner.mp@parliament.uk.\nKings Norton railway station update\nI recently met Midlands Connect, Network Rail, and other railway chiefs at Kings Norton Station, along with Councillor Carmel Corrigan and Selly Oak MP, Al Carns (although Kings Norton itself is in the Northfield constituency, the boundary runs down the middle of the railway tracks).\nThe reopening of Camp Hill services – expected in late 2025 – will bring real benefits for Kings Norton. It will mean the restoration of six trains an hour, with two trains initially running into New Street before transferring at a later date to Moor Street. It will also open up new transport options between Kings Norton and Stirchley, Kings Heath and Moseley.\nServices could be improved still further (perhaps to eight trains an hour) if money can be found to reinstate the middle platform at Kings Norton, which was last used for regular passenger services in 1978.\nAt this point, it is necessary to separate some fact from fiction. It was claimed during the election that the Conservatives had ‘secured the funds to re-open the middle platform at Kings Norton Train station.’ But this is not, and never was, the case.\nThe only money that had been committed was £123 million for design works across the entirety of the ‘Midlands Rail Hub’ project, but not a penny had been put aside for rebuilding the platform or other construction works.\nIt is a bit like buying an architect’s drawing and then claiming that you are putting up a house.\nDecisions are being made soon about the future of these projects. I have raised the matter with Ministers, including in Parliament with the local transport Minister, and with the rail Minister at the Transport Select Committee (Q45).\nThere is only so much money to go around, but I will keep pressing the case for Kings Norton. Upgrades to Northfield station (where the island platform is in a much worse state) and Longbridge station are harder to achieve, but they also need to be part of the long-term plan for the area.\nSmall Business Saturday\nIt was great to pop in and spend some time with two brilliant businesses on Northfield high street – the Clock Café and Mr Souvlaki, which imports almost all its ingredients from Greece. More can be read about it here.\nExtreme weather\nMultiple trees fell during Storm Darragh which caused extensive travel disruption. The tragic death of a man in Erdington underlined the risk to life from falling trees during storms.\nFallen trees can be reported to the highways department on 0121 303 4119, and if fallen trees are not removed then please get in contact with my office or local councillors.\nOne related problem is leaf clearance, particularly from drains. Regular checks stopped some time ago and the contractor (Kier) responds instead to reports. But waiting times are too long.\nIt isn’t good enough and I have raised the issue with the Roads Minister (the highways contract is half-funded locally and half from central government).\nI hope that everyone is able to stay safe over the coming days, as snow is forecast.\nHospice funding\nI also visited Acorns Children’s Hospice recently, again with Al Carns.\nAcorns provides a vital and compassionate service for families across south Birmingham. It is important that local MPs work together to support our hospices.\nAbout a third of hospice funding comes the public purse, which is partly in recognition of the role that hospices play in supporting the NHS.\nThe Children’s Hospice Grant was scrapped before the election. Back in July, I called on the new Labour Government to bring back the Children’s Hospice Grant. Earlier this month, Acorns warned that the lack of certainty could force them to turn children away.\nIt is really welcome that £26 million has now been committed by the Government for next year - with £100 million extra for buildings and equipment at hospices that serve people of all ages.\nWe heard about the good use that the money will be put to. Hospices still need long-term financial security which I will continue to argue for.\nOut and about\nOther commitments have included speaking at a public meeting organised by Weoley Hill United Reformed Church… holding a busy surgery … meetings about local SEND services, and the future of community services in Allens Cross … Saturday doorknocking … meeting University of Birmingham politics students… and popping in to Kings Norton Christmas Market.\nSix months on since the election\nSaturday marks six months since the general election. I wanted to report on some of the actions taken between July and December include:\nAs promised, reinstated an advertised constituency office, held regular surgeries, and sent and published regular and detailed updates.\nResolved more than 500 individual casework problems – including some very complicated housing and SEND cases, and replied to more than 2,100 policy emails (averaging more than 800 policy emails a week).\nKnocked on doors across the constituency almost every weekend (weather permitting).\nBeen active in the House of Commons: with 212 contributions in Parliament (more than the total for Northfield between 2019 and 2024).\nCommunity improvements that I’m particularly proud of include:\nGetting a new bus stop installed.\nPermanent changes to remove a flytipping hotspot in Frankley.\nGetting dangerous and longstanding waste removed from an area that children play in, in Weoley Castle.\nSecuring important individual changes that have been denied to people for too long (such as long overdue housing repairs, and matching vulnerable constituents to social workers so they can get the support they need).\nPolitics isn’t for the faint hearted but most people come into it with the simple aim of wanting to make things better, and those tangible improvements make it all worthwhile.\nIn Parliament\nBirmingham pub bombings\nThere was a late-night statement earlier this month on the repeal of the Northern Ireland Legacy Act.\nAs the Birmingham MP in the Commons at the time, I raised the 50th anniversary of the pub bombings and the ongoing campaign for answers and justice.\nYou can watch the exchange (with subtitles) below.\nBirmingham City FC briefing\nOne issue that never fails to get interest is the future of the city’s football clubs.\nI hosted a briefing in Parliament for the city’s MPs with Birmingham City’s owners. The focus was on the stadium redevelopment project. It was the first such meeting, and more are intended.\nThe Birmingham City Foundation already does good work in our area, and the I have seen first-hand how important the club’s support is for Balaam’s Wood Academy.\nThe club’s plans for the Birmingham Wheels site are impressive and Tom Wagner has brought off-field stability at the same time that the club’s fortunes are improving on it. Up to £3 billion could be put into the stadium move (the point was made about rare it was for a club to be talking about staying within a city, rather than moving out-of-town). Depending on planning consent, construction could start in 2027.\nPaulette Hamilton (Erdington) and I raised the need for transport links from outer areas to be up to handling the increase in travellers that the club wants to attract. There are issues to work through, but there is no taking away from what should be a major investment and good news for the city as a whole.\nSupporting local business groups\nBack in September, I wrote about the Nationwide Caterers’ Association (NCASS), which is based in Kings Norton and has strong links locally, including to Herbert’s Yard in Longbridge. I was glad arrange a meeting between NCASS and Gareth Thomas, the High Streets Minister, to talk about some of the challenges that face small catering businesses. We extended an invitation to visit which will hopefully be taken in 2025.\nRights at work\nI won’t go into detail in this newsletter due to space, but most of my time in Parliament at the moment is taken up with the Employment Rights Bill Committee, which sits all day twice a week until the end of January.\nThis is a landmark piece of legislation that will make work better for millions of people. I am proud to be involved in passing and improving such an important new law.\nOn a related issue, I spoke in a debate on the treatment of terminally ill people in the workplace. There are gaps in the law which, sadly, do not always protect people as they approach the end of their life. The ‘Dying to Work’ campaign is a great cause and I hope the law can be looked at again.\nWhat do you think?\nWe talk a lot in politics about preventing crime and punishing offenders. But what about support for the victims who are left behind?\nOne issue that I want to highlight in 2025 is the failures of the Criminal Injuries Compensation Scheme. The scheme is supposed to provide compensation to victims of serious violent crime. A payment is often the only official recognition that a victim gets of the harm they have suffered.\nBut the scheme doesn’t work as it should. It hasn’t been updated since 2012. The rules sometimes seem strange and arbitrary (and some people who suffer horrendous injuries get no compensation at all). On average, people wait more than a year for a decision. It just isn’t good enough.\nThe government consulted three times on possible reforms between 2020 and 2022, but nothing further happened. It’s high time that progress was made on this issue.\nIf anyone has any experiences of the Criminal Injuries Compensation Scheme that they feel up to sharing then please let me know. It can be in strict confidence.\nHousekeeping\nAs 2024 ends and 2025 begins: the readers of this newsletter are one of the best resources that I have to draw on. While we might not always agree, the replies make me a better MP. I am grateful.\nMy thanks are also due to the office team, who work hard and largely without public recognition. They are all dedicated to right thing – helping people individually, and making the constituency a better place to live. I am lucky to have a strong group around me.\nHere’s to happiness and health in 2025.\nBest wishes\nLaurence Turner\nMP for Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThese newsletters are mostly written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_send-january-25/content_7.html": "Speaking up for SEND\nI spoke in a debate on SEND last week.\nThere were so many MPs that wanted to speak that we had 75 seconds each! On one level, this can only be a good thing to have so many MPs now who want to take up the issue.\nMy contribution is below. It was impossible to say everything that needed to be said, but there will be much more to say on this most important subject during this Parliament:\nIn the seconds available to me, I cannot do justice to the cases I have heard of pupils and parents who are stuck in the system.\nTen years on from the passing of the Children and Families Act 2014, it is time to look at where the current system is failing. Local authorities had additional responsibilities loaded on to them, and at the same time they had powers and resources taken away.\nIt has become harder for them to plan shared resources, and that is a major cause of delays and cost increases in the system.\nI draw attention to my declaration in the Register of Members’ Financial Interests: I am a member of the GMB [trade union]. We cannot lose sight of the role of school support staff in this equation.\nIf I can make one appeal to the shadow Minister it is to say this: please rethink the opposition to reinstating the school support staff negotiating body. Classroom-based school support staff spend the majority of their time supporting SEND learners. We cannot resolve the SEND crisis without resolving the workforce problems.I am proud to have been a SEND pupil. I am open about my differences as an MP. I hope that, on a cross-party basis, we can look back at the end of this Parliament and say, “We did find a system in crisis, and we did change it.”",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_acorns-221224/content_22.html": "Children’s hospice funding\nI visited Acorns Children’s Hospice on Friday with Selly Oak MP Al Carns.\nAcorns provides a vital and compassionate service for families across south Birmingham. It is important that local MPs work together to support our hospices.\nAbout a third of hospice funding comes the public purse, which is partly in recognition of the the role that hospices play in supporting the NHS.\nThe Children’s Hospice Grant was scrapped before the election. Back in July, I called on the new Labour Government to bring back the Children’s Hospice Grant. Earlier this month, Acorns warned that the lack of certainty could force them to turn children away.\nIt is really welcome that £26 million has now been committed by the Government for next year - with £100 million extra for buildings and equipment at hospices that serve people of all ages.\nWe heard about the good use that the money will be put to. Hospices still need long-term financial security which I will continue to argue for.\nThis was followed by a meeting about community services in Allens Cross, and a busy constituency surgery.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_send-update-270724/content_62.html": "SEND update\nI wanted to provide an update on some my work on SEND.\nSEND update\nFrankley Hill School\nI asked the government’s Department for Education for an update on the new Frankley Hill special school.\nBirmingham City Council successfully applied in 2022 for a new autism-specialism school to be built. There is a known problem of a lack of places in autism-specialist settings in Birmingham, which results in some children from Northfield travelling for hours each day across th city. The school will be large (at 400 places) and its intake will be ‘all-through,’ from ages 4 to 19.\nThe latest update is that the school progressed to ‘pre-opening stage’ in March - by one reckoning, this stage can last two years. The Department for Education told me that:\n‘[Government] officials are working closely with the local authority and the trust to agree an opening date.’\nI will post further updates as I get them.\nBirmingham SEND Commissioner - new report coming\nThe Government’s ‘SEND Commissioner’ has published reports on Birmingham’s provision for the last two years. The reports suggest that SEND services are improving, but personally I think the reports focus too much on statistics and not enough on the actual experience of young people and their families.\nIt appears that a third report was delayed by the election, and Ministers told me that:\nThe [Department for Education] aims to publish the report within the coming months, in line with existing practice.\nI am sure that the report, when it is published, will be read closely by everyone who follows SEND provision in Birmingham.\nBBC Midlands\nI was glad to have the opportunity to speak to BBC Midlands Today, who ran a piece on Friday about SEND provision in the West Midlands (with a focus on Worcestershire). The BBC’s article - which sets out some more details - can be found here.\nBirmingham - SEND tribunals outcomes\nI wanted to establish a clear local picture of what is happening with SEND tribunals. When families and young people and the local authority cannot agree on support, the cases often end up in court.\nThe figures I was given show that, in Birmingham, 97 per cent of parents’ appeals against the City Council’s decisions were successful (of the cases that got a hearing) in 2022. This is in line with the national average, as 98 per cent of cases were successful at tribunal last year. These extremely high rates clearly show that the system is not working as it should.\nThe cost to taxpayers of defending these cases is significant. A report for Birmingham City Council put the figure at £10.1 million between 2014 and 2021 - or ‘half a new school.’ These issues are replicated in other local authorities.\nThe full figures are below.\nSEND Tribunal outcomes - Birmingham\n| Academic year | Total appeals registered | In favour of the appellants | In favour of the local authority | Total appeals withdrawn | Conceded before the hearing | Awaiting a hearing date |\n|---|---|---|---|---|---|---|\n| 2020 | 291 | 180 | 10 | 32 | 65 | 0 |\n| 2021 | 547 | 367 | 31 | 48 | 89 | 1 |\n| 2022 | 525 | 365 | 10 | 52 | 84 | 12 |\nSpeech and Language Therapist (SALT) recruitment\nIt is important to recognise good news when it comes along.\nSpeech and Language Therapists (or, SALTs) are in short supply. The lack of SALTs has been a major cause of delays in accessing assessments for particular conditions.\nThe Department of Health and Social Care told me that there has been an increase in the number of SALTs in Birmingham - from 200 six years ago, to 284 today. There has been a similar increase across the West Midlands too.\nOn paper, this looks like progress (although, of course, demand has gone up too). The test will be whether waiting lists actually start to fall.\nA new government - a new focus on SEND\nThe new Government is bringing a welcome focus on SEND. It is early days yet, but I think a fresh pair of eyes was needed to assess what has gone wrong.\nTen years have passed since the 2014 legislation that created the system as we know it today. Bridget Phillipson - the new Education Secretary - gave a briefing to MPs on Monday. I was unable to attend due to other Parliamentary commitments, but I caught up with education officials afterwards.\nAhead of recess, I briefed MPs on the trail of devastation left across education by the Conservatives.\nWe’ve been left a SEND system that is ‘lose, lose, lose’ in the Tories’ own words.\nWe’ll work tirelessly to overhaul the system, but there is a long way to go. pic.twitter.com/wcWLJdXfDe— Bridget Phillipson (@bphillipsonMP) July 30, 2024\nOver the coming months, I will be talking to young people, families, and professionals in the system, and making sure that their voices are heard in government. One early change is set out in the Children’s Wellbeing Bill.\nLocal councils - including Birmingham City Council - have a legal duty to plan SEND services, but there aren’t effective obligations on academies and the NHS to work with those councils.\nThe Bill will start to address this problem by applying a new duty to co-operate on all schools in the local area. It represents an important start on the long road to SEND reform.\nSEND issues are a top priority, and I will report further on these and other points.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_smallbusinesssaturday24/content_49.html": "Small Business Saturday on Northfield high street\nCommunity\nIt was a wet and blustery Small Business Saturday but it was great to spend time with Northfield Councillor Esther Rai at two brilliant and welcoming local businesses:\nThe Clock Cafe which has been a part of the business community for 28 years\nMr Souvlaki - the only Greek restaraunt in Northfield which sources its fresh ingredients from Greece.\nIt is important that small businesses get support, including Business Rates discounts for ‘brick and mortar’ shops and assistance with National Insurance costs.\nI’d encourage anyone who hasn’t visited these two businesses to stop by.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_casework/content_65.html": "See what I can help with\nIf you are a constituent in Birmingham Northfield and you are experiencing difficulties then please contact me if you think I can assist. I am here to help and represent you, and I will assist if I can.\nPlease note that Parliament operates under a strict code which means that I can only take up issues on behalf of people who live in the constituency. You can click here to check if I am your MP.\nWhat I can help with\nMPs can help to make representations to public bodies on your behalf when you aren’t getting the right treatment, such as:\n- DWP\n- HMRC\n- The Home Office\n- Birmingham City Council\nPlease include any reference numbers that you hold, and copies of correspondence from those bodies if you have them.\nCouncillors are also elected to hold Birmingham City Council to account and they should be contacted in the first instance on council matters. You can find and contact your councillors here.\nI might also be able to raise policy issues in Parliament. You can read more here.\nSurgeries\nI hold regular surgeries across the constituency. Please contact me and include your postal address and a summary of the issue to request an appointment.\nA member of the team will be in touch. Many problems can be resolved faster over the phone or by email and my staff may make suggestions on the best way of taking a matter forward.\nSources of local support\nMy team can suggest local sources of support, but you may wish to contact those organisations directly:\nBirmingham City Council: Cost of living support https://www.birmingham.gov.uk/livingsupport\nNorthfield Community Partnership offers high-quality advice and assistance with a wide range of issues, including social housing and benefits matters (not including PIP), and food parcels. 0121 411 2157 - https://www.northfieldcommunity.org/\nBirmingham Citizens Advice Bureau can assist with a number of matters, including PIP applications: 0808 278 7990 - https://www.bcabs.org.uk/\nBirmingham SENDIASS free advice on special educational needs and disabilities (SEND), arms-length from Birmingham City Council: 0121 303 5004 - https://www.birminghamsendiass.co.uk/\nSt Bart’s Pantry food pantry in Allen’s Cross: 07568 528 826 - https://www.yourlocalpantry.co.uk/pantry-listings/birmingham-st-bart-s-pantry/\nB30 & South Birmingham Foodbank in Kings Norton: 07582 143 972 - https://b30.foodbank.org.uk/\nFoodCycle Weoley Castle offers a free weekly hot meal at St Gabriels Church: https://foodcycle.org.uk/location/foodcycle-birmingham-weoley-castle/\nNewStarts in Frankley can offer free furniture, household supplies, and food support to those who need it: 0121 679 2072 - https://newstarts.org.uk/\nVisiting Parliament\nI can help with arranging visits to Parliament school visits and getting tickets for Prime Minister’s Questions - although please note that the dates for school visits and PMQs book up months in advance.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_general-election24/content_57.html": "Election results\nNorthfield voted for a new direction on Thursday.\nIt is the honour of my life to be elected as the new Member of Parliament for the Northfield constituency. I will work hard every day to repay the trust that has been placed in Labour, and in me.\nThe election represented a clear mandate for changed. Labour achieved the biggest majority recorded in the seat for twenty years.\nI know, however, that many people voted Labour this time to give us a chance to change things for the better, after fourteen long years of Conservative Government. It is my duty as MP to help turn our manifesto into policies that make a real and material difference to people’s lives.\nAt the count, I paid tribute to Gary Sambrook, who has left his mark in Northfield. I am sure that this is not the end for him in Birmingham politics.\nI said that:\nAs MP, I want to represent all the communities in the constituency, and those who did not vote Labour, or who voted Labour for the first time.\nThe constituency faces profound challenges after 14 years of the national running down of public services. People voted Labour in the Parliamentary election and in the council elections to deliver better public services - that is what we are going to fight for.\nI said at the start of the campaign that I want to be an advocate for SEND pupils, and their families, and to fight in Parliament for a better and fairer system. That is what I am committed to doing.\nLabour won the two council by-elections for Kings Norton North and Northfield wards. Carmel Corrigan and Esther Rai will be brilliant representatives and I look forward to working with them to make our areas better.\nI am now busy responding to correspondence, being inducted into Parliament, and setting up two offices. Job adverts for constituency staff roles will be published here, and on the W4MP website.\nPlease check back as this website changes following the election. You can also sign-up to receive a regular newsletter on constituency and Parliamentary activity using the form below:\nPhoto credits - Amara Sophia Elahi and Liz Clements on Twitter.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_vote-0407/content_34.html": "Vote Labour today\nCampaign\nAfter a long campaign, the day is finally here.\nVote Labour today in the Northfield constituency for:\nInvestment in our schools and the NHS\nTurning the page on this disastrous Tory Government\nA locally based-MP who will restore a full MP’s service to the area\nIf you don’t know your polling station, it can be checked here. This year, you will also need photo ID.\nFrom myself, I want to express my thanks to everyone who has offered their support during the campaign. It has been a privilege to represent the Labour Party in the most important election in a generation - and to have the chance to stand up for Northfield in Parliament.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_cleaning-prices-square/content_14.html": "Cleaning up Prices Square and Longbridge flats\nCommunity\nEarlier this month, I joined Labour volunteers and local councillor Esther Rai to clear up the land next to Prices Square, off Nothfield high street.\nWe cleared 21 sacks of waste which were all properly secured and reported to the Council, which collected them. Representations have been made about long-term improvements to the site.\nMy office often respond to flytipping reports, and I’m glad to be able to report that - after some confusion about land ownership had prevented action for some time - the extensive flytipping outside the flats at the bottom of Bristol Road has now been removed.\nIf there are unresolved flytipping problems in your area then please get in touch: laurence.turner.mp@parliament.uk or 0121 516 5770.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_libraries-evidence/content_48.html": "| Local authority | Population | Community libraries | Libraries per 100,000 |\n|---|---|---|---|\n| Bristol | 479,024 | 26 | 5.43 |\n| Leeds | 822,483 | 36 | 4.38 |\n| Nottingham | 328,513 | 14 | 4.26 |\n| Coventry | 355,600 | 13 | 3.66 |\n| England | 57,106,398 | 2,020 | 3.54 |\n| Birmingham | 1,157,603 | 35 | 3.02 |\n| Manchester | 568,996 | 15 | 2.64 |\nLibraries submission\nThe deadline for written submissions to the Birmingham libraries consultation is today. My representations are below.\nBirmingham Libraries Consultation 2024\nIntroduction\nI am making this submission to the written stage of the libraries consultation as the Member of Parliament for Northfield.\nLibraries provide an essential service. Northfield’s libraries combine a traditional library environment – of quiet space and access to books – with digital access and support, community activities, and a place of warmth.\nAs the early 2024 review of public libraries stated:\n‘As the last public facing agency on the high street, library staff have a profound understanding of the needs of their users.’1\nLibraries, and Birmingham, face a very challenging situation. Across England, more than 300 libraries have closed since 2010, as national cuts were loaded on to local government. The city lost more than 40p in the pound. It must be recognised that there is a wider political context to these proposals, which were – in part – developed by the previous Conservative Government.2\nHowever, I am deeply concerned about any reduction in library service. I am concerned also about aspects of the consultation itself. It is important that library provision in Frankley, Kings Norton, Northfield, and Weoley Castle is maintained, and that irreversible decisions are not made.\nBackground\nThere are four libraries within the Northfield constituency: Frankley Community Library, Weoley Castle Library, Kings Norton Library, and Northfield Library.\nA number of my constituents use other libraries in Birmingham and, in particular, Rubery Library, which is not in the City of Birmingham although it is part of the same conurbation. This response focuses on the libraries within the constituency. It is informed by information and representations from constituents, campaign groups, and councillors.\nConstituents are concerned not only by the possibility of reductions in library services but also by the reductions that have already taken place.\nThe constituency has already lost West Heath Library – one of only four community library closures in Birmingham since 2010. Staffing and service reductions have affected service reliability.\nIn the past, even the smaller libraries in the constituency opened past 17:00 during a least one evening in the week. As of 22 July, only Weoley Castle and Northfield libraries will open for a single hour beyond 17:00 once a week, and Frankley Library will open for just two days each week. Library services are increasingly difficult for people in-work to access, and this is especially true for people who work on Saturdays.\nBirmingham’s libraries face real cost pressures. There is a maintenance backlog, including a boiler that needs to be replaced at Northfield Library. The constituency’s libraries are of varying age. Weoley Castle Library is housed in a modern building, and as such it benefits from lower running costs.\nThe Carnegie libraries in Kings Norton and Northfield should be seen as an important part of south Birmingham’s architectural heritage (alongside their wider significance, given Northfield Library’s connection to the suffragettes). The difficulties of trying to find an alternative use for the old Selly Oak Library site is a caution against any attempted sale of these historic buildings.\nBirmingham’s community library services are not extensive by comparison with other large cities. In fact, the ratio of libraries to people in Birmingham is lower than the average for England, including rural and other more sparsely populated areas. The ratio is also lower than in other large cities sampled, with the exception of the city of Manchester.\nLocal library services - 20223\nCommunity benefit\nLibraries play an important role in their primary function: providing access to information. The Literacy Trust estimates that the Birmingham Northfield constituency has some of the highest rates of literacy need in the country (ranked 37 out of 533 constituencies).4 Local libraries are particularly important for encouraging children to discover the joy of books and learning.\nLibraries provide digital access for residents who do not have the internet at home, or who require support to access online services. This need is greater after the council has transitioned most of its own services to an ‘online-first’ or even an ‘online-only’ approach. Many of these residents are older, have limited support networks, and have reduced mobility. A number of them have told me that they don’t know what they would do without access to their local library.\nLocal libraries reduce social isolation through the activities of the different community groups that they host. These groups are predominantly attended by older residents and those with young families.\nAll the libraries in the Northfield constituency host community events, from social events to skills classes, including on digital literacy. Again, it is unclear where these events would take place if those events were not provided in local libraries. Residents can also verify official documents at libraries, and it is unclear what alternatives would be provided, or how far they would be.\nIt is hard to directly compare the role played by the different libraries. Northfield and Kings Norton libraries have high usage and membership compared to other Birmingham libraries, and they benefit from support groups. There is deprivation in all the wards in the constituency, and Frankley Great Park and Weoley and Selly Oak are among the most deprived wards in the country.\nI am particularly concerned about Frankley Community Library, which I fear is not fairly served by the consultation. The Council’s scorecard suggests that Frankley may be particularly vulnerable to closure, as reflected in its now much-reduced opening hours. In fact, the consultation even states that:\n‘The current provision of Community Libraries is not concentrated in the centre of the city where there is greatest need.’\nI am concerned that there is no recognition in the consultation of the importance of libraries in the city’s outer estates, where there are also problems relating to employment, public transport, crime and anti-social behaviour, and education.\nFrankley is a case in point. The library is comparatively well used for a community library of its size and location. As the Council’s the figures (presented below) show, Frankley has proven to be more resilient than other libraries across Birmingham over the last decade.\nThe communities that surround Frankley and Weoley Castle libraries are also less well served by public transport, and I fear that much of the current footfall would not transfer to other ‘Library Hub’ sites. It would simply stop. Frankley is particularly poorly served in this regard. Frankley Library users face the farthest distance to an alternative site in Birmingham. After the loss of other amenities, a number of residents have expressed to me their concern about the wider impact on the estate, if the community asset is lost. I share this fear.\nLibraries are also part of the communities’ sense of identity. I can do no better than quote one Northfield resident who wrote to me:\n’Northfield Library is, for me, much more than a place to access books, and is difficult to put into words.\n‘For me, our library is about a sense of place, embedded in our local culture. The building has been there all my life. … [It is part of] our history, our sense of place, places where we met, talked, became friends, shared a culture, unified, became proud to be from Northfield.’\nFinally, I am concerned about the reduction in the library workforce and the difficulty of attracting and retaining qualified library staff.5 Birmingham City Council is subject to national funding decisions and national pay negotiations under the National Joint Council for Local Government Services, and the challenges that face Birmingham are shared to an extent by other authorities. Nevertheless, the loss of skilled library staff and the reduction in headcount has reduced the reliability of library services.\nI would welcome an assurance that the recognised trade unions are being fully engaged as part of the consultation and the long-term planning for Birmingham’s library services.\nFuture of Birmingham’s libraries\nIt is hard to comment on the future of individual sites without sight of more detailed plans. However, it must be recognised that the proposed budget cuts (of more than 50 per cent by next year) are severe and unprecedented.\nGreater transparency should be provided about the library use statistics that the consultation relies on, and about the role of the Commissioners and central government, under its previous Conservative leadership, in preparing these options.\nI welcome the proposal to involve community groups more, and to aim to provide a greater range of activities and services at library sites. It should be recognised, also, that asking community organisations to run libraries does carry risks. The Community Asset Transfer of Castle Vale Library, which has now closed, is a case in point. It is not clear from the consultation how the lessons from Castle Vale have been applied.\nBirmingham City Council is undergoing a period of potential change, following the General Election. The City Council must be prepared to revisit the scale of the budget reduction to library services, particularly if there is a change in approach to the way that central government intervenes following Section 114 notices.\nI call on Birmingham City Council to:\nPause the consultation if there is a change in the central government capitalisation direction and its directions to the City’s Commissioners.\nAssess the potential value of the Worcestershire ‘Libraries Unlocked’ scheme, which is in use at Rubery Library, as a way of raising revenue and extending opening hours within a limited staff allowance.\nConduct, and publish, a review of the Community Asset Transfer of Castle Vale Library, and its implications for the current consultation.\nPublish all the data that underlies the consultation so that more informed community planning can take place.\nConclusion\nBirmingham’s libraries face change, but that change should retain a network of local community libraries that includes Frankley, Kings Norton, Northfield, and Weoley Castle. The Council should reflect on the legitimate points raised by campaigners, and work with library users, community representatives, and library staff build a service that is fit and relevant to the 2020s and 2030s, and that is ‘comprehensive and efficient.’\nPDF version\nFootnotes\nDepartment of Culture, Media and Sport (DCMS), An Independent Review of English Public Libraries, July 2023, page 3 https://assets.publishing.service.gov.uk/media/65a9211ced27ca000d27b22c/An_Independent_Review_of_English_Public_Libraries_-_formatted.pdf↩︎\nAccording to a response to a Kings Norton Library user: ‘The options [in this consultation] were generated by internal teams and the Department for Digital, Culture, Media and Sport.’ Birmingham City Council, All Online AM Library Consultations Q&A’s, 04 July 2024, page 23 https://www.birminghambeheard.org.uk/adults-communities/lc24/supporting_documents/Online%20AM%20Consultations%20QAs%204.7.24%203.pdf ↩︎\n‘Local library’ is defined here on the same basis as the services subject to consultation: static, local authority-provided sites that exclude large central libraries. Central libraries were not excluded from the England figure. Data sources: Arts Council England, Basic Dataset for Libraries, https://www.artscouncil.org.uk/supporting-arts-museums-and-libraries/supporting-libraries; ONS, Estimates of the population for the UK, England, Wales, Scotland, and Northern Ireland, 15 July 2024 https://www.ons.gov.uk/peoplepopulationandcommunity/populationandmigration/populationestimates/datasets/populationestimatesforukenglandandwalesscotlandandnorthernireland↩︎\nNational Literacy Trust, Identifying the places with the greatest literacy need, 2017 https://nlt.cdn.ngo/media/documents/Constituency_table_-_by_rank_-_FINAL.pdf↩︎\nI must draw attention to the fact that until July 2024 I was an official of the GMB trade union, which is one of the unions that represents Birmingham City Council staff.↩︎\nComments on the consultation\nThe consultation itself is not, in my view, accessible to all library users, and it is not adequately designed to allow all those with a stake in their future to express a view.\nAt 66 questions, the consultation may be hard to access for some library users: for example, this may be true of people with English as an additional language, or dyslexic readers. These are some of the most important groups that library services should reach.\nThe simple length of the consultation also presents a barrier to many people submitting their views. I have spoken to residents who would like to express a view, but they do not have the time. I have attempted to represent their views through this submission.\nThe consultation is very data-driven, but the data itself is largely obscured from direct view. As well as PDF summaries and interactive dashboards, the actual information should be made available in an unrestricted form so that the Council can benefit from independent analysis.\nFinally, the consultation invites views from community groups and other representatives (such as MPs), but the questions are then structured around individual libraries. This is not sufficient when we are expressing a view about services that cross communities and must form a coherent network.\nI ask that these issues be taken into account when the Council next consults on the future of vital services.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_updates/content_10.html": "Subscribe for updates\nYou can sign up to receive regular news (normally weekly while Parliament is sitting) below. My MP’s newsletter provides information about what I am doing on your behalf, as well as local news and updates from Parliament.\nNo matching items",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_palestine-190724/content_38.html": "Palestine - UNRWA and the right to work\nI spoke about Israel and Palestine on Friday.\nYou can watch the intervention below:\nIn my former role, as an official of the GMB trade union, I extended solidarity to trade unionists affected by the conflict, and helped raise thousands of pounds for Medical Aid for Palestinians. One of my first acts as an MP was to ask the new Government if it would resume the UK’s funding of the UN Relief and Works Agency (UNRWA).\nI was glad to hear the new government confirm that:\nIt would restore the UK’s funding to UNRWA - the only agency capable of delivering aid at scale in Gaza.\nMinisters had ordered a fresh and ‘comprehensive review of Israel’s compliance with international humanitarian law,’ which will include the question of arms exports.\nMinisters are blocked from seeing the advice provided to their Conservative predecessors. It is right that a new process be followed, and it is important that it concludes quickly.\nI used my question to raise an issue that might not otherwise have been debated - the position of Palestinian workers. Before the war, more than a fifth of Palestinian workers in the West Bank were employed in Israel or the settlements.\nAround 160,000 jobs have been lost after the Israeli government blocked legal routes for Palestinians to work in Israel. This policy contributes significantly to poverty and political instability in both Gaza and the West Bank.\nI welcome the reassurances that the new Government has taken up the issue of labour rights alongside the need to end the settlement programme, which represents both an injustice and a fundamental threat to the prospects of a long-term peace settlement.\nThe Government’s position has changed significantly as a result of the general election. Political pressure must now be applied internationally for an immediate ceasefire, the release of hostages, and for progress towards a two state solution.\nThe text of the exchange can be found below:\nLaurence Turner (Birmingham Northfield) (Lab)\nI welcome the Foreign Secretary and his team to their places, and strongly welcome the decision announced today to restore funding for UNRWA, which will be recognised by many people in south Birmingham as an important step—among many others—towards ending the horror that we see today in Gaza. The Israeli Government’s decision to end the legal routes for Palestinians to work in Israel has played an important role in the entrenchment of poverty and political instability in the West Bank, alongside the illegal settlements programme. Will the Foreign Secretary make representations on this important matter, recognising that both the Israeli Histadrut and the Palestinian General Federation of Trade Unions, as pillars of civil society in both nations, have an important role to play in the establishment of a lasting peace?David Lammy (Foreign Secretary)\nI am grateful to my hon. Friend for his question, which gives me an opportunity to talk about what I saw on the West Bank. The situation is febrile—it is anxious. There is tremendous hardship because of the withdrawal of those funds. It is phenomenally tense, and against that backdrop, people are watching their land being taken from them before their eyes. As such, the representations that my hon. Friend has asked me to make are absolutely the representations I made when I spoke to the leadership in Israel, because this simply cannot continue, and we must act to stop it.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_check/content_20.html": "functiondisplayData(postcode){var html =\"Your constituency is \";$('#text').hide(); html += postcode.result.parliamentary_constituency_2024; html +=\" and your local government ward is \"; html += postcode.result.admin_ward;$('#text').html(html).fadeIn(300);}//ajax callfunctionpost(url){return $.ajax({url: url,success:function(){ },error:function(desc, err) {$('#text').html(\"Postcode not found - please try again\"); } });}//uppercase String.prototype.strFirstUpper=function() {returnthis.charAt(0).toUpperCase() +this.slice(1);}\nPut in your postcode to check if I am your MP\nThe below map also shows the constituency boundaries (and the local government wards within it).",
  "https_laurence4northfield_com_/https_laurence4northfield_com_contact/content_4.html": "How to get in touch\nYou can get in touch using the form opposite.\nYou can also contact me in the following ways:\nEmail\nlaurence.turner.mp@parliament.uk\nPhone\n0121 516 5770\nConstituency office (note - meetings by appointment only)\n1 Devon Way\nLongbridge\nB31 2TS\nPlease include your home address in written correspondence so that I can prioritise messages from constituents.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-080924/content_37.html": "Good evening. Welcome to this ‘bumper’ newsletter – please excuse the length, which tries to capture activity over the summer as well as events over the last week. Thank you as always for subscribing.\nBirmingham news\nBirmingham City Council – funding\nOne of my main focuses since the last newsletter has been Birmingham City Council’s finances. In normal times, council operations would not pre-occupy MPs’ time. But we are not in normal times and there is no single more pressing local issue.\nAs things stand, under the terms of the September 2023 central government intervention, Birmingham is required to balance its books within two years. This requirement is dictating the pace of the very sharp cuts to services like libraries (there is an update on libraries below) and adult day centres. Those cuts in public services and rises in Council Tax come on top of some of the heaviest funding reductions of any local authority between 2010 and 2024.\nNone of this is to downplay the problems that need to be addressed at the council. Even with those funding constraints, some services are not as good as residents reasonably expect them to be. Staff turnover is too high and the quality of casework responses that I receive sometimes is sometimes not high enough. Two things are true at the same time: improvements need to be made within the city, and Birmingham has also been exceptionally badly-served by central government.\nWe need answers on a number of points. Why was the equal pay liability so seriously overstated, at £760 million (all parties now accept that the true cost is likely to be much lower)? Why did the external auditors say last September that the equal pay liability could be over £1 billion? How did the Oracle HR system get as far as the point that it was made ‘live,’ despite the fact that it was clearly unfit for purpose? These are some of the questions that are asked in a new report by Sheffield University’s Audit Reform Lab. You can read the report here.\nI have been making the case for looking again at Birmingham’s immediate situation through the press and in Parliament. I was glad to receive a constructive response from the Local Government Secretary, Angela Rayner, this week. She said that she wanted to stop Birmingham’s treatment as a ‘political football’ and build a constructive relationship with the city. Specifically, she said that Ministers were ready to listen to alternative suggestions.\nThis was an important moment. Long-term budgets for councils are expected to be set out next year, and there is limited time available to make changes ahead of next year’s budget. But it is important that local representatives try – it is about fighting for the future of the city. You can read more about the exchange here, and there will be more to report in future newsletters.\nLibraries update\nIn late August, the Council published an important update on the future of library services. In short:\nThe Council is proposing that Northfield Library be kept open full-time as a Community Hub Library.\nWeoley Castle and Kings Norton libraries would be reduced to part-time council-staffed hours (at either 14 or 24 hours per week).\nFrankley Community Library is marked for possible community asset transfer. An additional bus stop would be put in. The future of library is not secure and it is still at risk of closure if an organisation cannot be found to run or fund the library.\nThroughout this process, I have argued that it is important that as many services are preserved as possible, for as long as possible, so that irreversible reductions in library services are not made.\nIt is a silver lining that none of Northfield’s libraries are marked for closure in the short-term, but (apart from Northfield libraries) the deterioration in opening hours looks set to continue, and the future of Frankley’s library is far from secure.\nIt is important that the community and their representatives continue to engage with the consultation to try to secure the best possible future for all our community’s libraries.\nAs a reminder, the in-person consultation events are taking place at the below times (the Northfield library engagement session was on Monday this week – unfortunately it coincided with Parliament sitting).\nThe following package(s) will be installed:\n- formattable [0.2.1]\nThese packages will be installed into \"~/Documents/R/Websites/Northfield - Copy - Copy/renv/library/R-4.3/x86_64-w64-mingw32\".\n# Installing packages --------------------------------------------------------\n- Installing formattable ... OK [linked from cache]\nSuccessfully installed 1 package in 35 milliseconds.\n|\nLibrary\n|\nDate\n|\nTime\n|\n|\nFrankley Community Library\n|\nWednesday 25 September\n|\n10:30 to 12:00\n|\n|\nKing’s Norton Library\n|\nFriday 20 September\n|\n10:30 to 12:00\n|\n|\nWeoley Castle Library\n|\nThursday 19 September\n|\n15:00 to 16:30\n|\nDangerous dogs\nDuring August, the shocking news hit the community that a man (who has been named locally as Nicholas Glass) had been killed by dogs in Rubery. West Midlands Police confirmed last week that two of the four dogs that had been seized were of the ‘XL Bully’ breed.\nInvestigations are continuing, and I think it is best to avoid comments on the specifics of cases that are ongoing. My thoughts are with those loved ones who issued a moving tribute.\nI understand from Ministers that they are looking at current dog control rules, and whether those rules are sufficient.\nBristol Road – bus infrastructure and cycleway extension\nA number of residents have asked for an update on the proposed extension of the A38 cycleway (which currently runs as far as Selly Oak).\nI attended a briefing recently which was organised by the Better Street for Birmingham campaign group. There were two updates from Transport for the West Midlands (TfWM) and the City Council:\nProposals will be published soon (in September) on bus infrastructure and priority measures along the Bristol Road. The details were being revised, following early comments from businesses on Northfield high street, so there should be more to say on this issue in a future newsletter.\nThe potential cycleway extension is at an earlier stage in its development. The City Council is currently exploring different designs and identifying a preferred option for extending the cycleway from its current end in Selly Oak to Longbridge.\nI want to see further progress with the cycleway scheme. Both initiatives will receive central government money that can only be spent on transport improvements. We should be encouraging public transport use and cycling and, while the details of both proposals need to be subjected to scrutiny and judged on their merits, I hope that investment can go ahead without the politicisation with has affected schemes in the past.\nLocal achievement\nThere was brilliant local representation on the international stage this week as Megan Richter won gold in the triathlon at the Paris Paralympics.\nStudents also received their A Level, GCSE, and vocational and technical qualifications this month. A number of local schools and colleges have published summaries of their results, including Cadbury College. Congratulations to all involved.\nNorthfield Town FC\nContinuing the theme of sporting achievement, Northfield Town Football Club is going from strength-to-strength on the pitch. The club remains unbeaten in the league this year, following promotion to the Midland Football League’s Division Two.\nHowever, funding for facilities improvements is needed if the club is to progress further. The club is looking for all-weather pitch facilities, and an update is needed to changing facilities if a greater range of women’s and girls’ teams are to be established.\nSaul and Alan from the club reached out, and I was glad to be able to visit the club and arrange a helpful discussion with the Football Foundation in Parliament this week. There are a number of leads to follow up as we try to secure funding for those improvements. I have written to the Department for Culture, Media and Sport (DCMS), and I am due to meet the Minister who covers grassroots football this coming week.\nLocal visits\nIn the wake of the disgraceful scenes of rioting that shamed our nation, I joined Friday prayers at the Al-Mahdi Institute in Weoley to show support as a community representative.\nNo one should feel unsafe because of their religion or skin colour. In many ways, the response to the riots – the actions of the majority who came together to repair physical damage and build new links across communities – showed us at our best. But the fact is that some additional support is needed.\nI have written to the Home Office in support of the Al-Mahdi Institute’s application for additional security measures, and raised the eligibility of educational and research centres for that support directly with Ministers.\nI have also visited or otherwise met a number of organisations, including the Nationwide Caterers’ Association (which is based in Kings Norton) to discuss some of the challenges that independent food and drink retailers face.\nI have also met or visited: Northfield Arts Forum (congratulations to the NAF on securing new premises on Church Road); GMB and Unite (to discuss Birmingham City Council and the upcoming equal pay hearing in November); a number of people at Birmingham City Council, in part to progress casework; and the Bishop of Birmingham.\nConstituency office update\nWhen I was elected, I pledged to set up an advertised office in the constituency, with all my public resources based there.\nI am glad to be able share those contact details (please note that, due to unfortunate security threats that all MPs have to contend with, meetings are by appointment):\nPostal address\nOffice of Laurence Turner MP\n1 Devon Way\nLongbridge\nB31 2TS\nLandline (active from 16 September)\n0121 516 5770\nEmail\nlaurence.turner@parliament.uk\nThe location is a serviced office, and likely temporary, and I will advertise any change of address in this newsletter and on my website.\nStaff have been hired and are starting work following completion of notice periods. I want the office to be an asset that works on behalf of the community, and I look forward to it being up to capacity soon.\nIn Parliament\nWinter Fuel Allowance\nThere will be a difficult vote on the future of the Winter Fuel Allowance on Tuesday. I wrote about the background to the change in the last newsletter, and I will try not to repeat myself.\nA number of people have written to ask how I will vote. Everyone will get a detailed reply (including with the latest information on Pension Credit applications and other forms of support). But in short: I will be voting with the Government. I do not think there is another practical choice.\nNo-one joins the Labour Party to cut social security or to retreat from the universal principle. I know there is scepticism about the description of what Labour has inherited. But it absolutely true.\nThe last Government did exactly what the Conservatives always accuse Labour of: they traded votes for empty promises, over-committed the public finances, and hid the liability from Parliament. The cost of overspends on asylum and immigration alone are greater than the entire cost of providing the Winter Fuel Allowance.\nThis isn’t abstract. For example, it will take years for the country to recover from the disastrous Liz Truss ‘mini-Budget.’ Without emergency action then the cost of borrowing would have risen sharply and further cuts to public services and social security would have been needed.\nI know that many people feel that they have been singled out. I think that the intention of giving people as much time as possible to prepare in advance of winter was honourable, and the truth is that more cuts are coming.\nThe savings from the Winter Fuel Allowance work out at less than 10 per cent of the in-year liability that was inherited. Had there been a Conservative Government then they would have had to make similarly deep cuts – the difference is that they hid that reality from the public.\nI spend each Saturday knocking on doors in the constituency, and I have found that a large number of people may be eligible for Pension Credit (and would continue to receive the Winter Fuel Allowance), but the eligibility criteria are not well known. Those criteria extend to disability status and people with caring responsibilities, alongside the income threshold.\nIf you are in any doubt about your eligibility then please do:\nI am speaking to the Independent Age charity about campaigns to reduce pensioner household costs. I am glad that the Government has now extended the Household Support Fund – this fund provided grants worth up to £200 in Birmingham for households in hardship. The State Pension increase is estimated to increase by around £400 (a real increase after inflation) in April, and if this is a particularly cold winter then £150 should be automatically discounted from electricity bills.\nI know that many people feel passionately about this issue. Please do reply to this email if you would like to make your voice heard and I will do my best to respond. I will be working to make sure that as many people as possible are signed up to Pension Credit between now and the December deadline.\nLegislation and other debates last week\nI was proud to vote in favour of the Passenger Railway Services (Public Ownership) Bill, which will start to turn the page on rail privatisation (a rushed and disastrous decision of the John Major Government).\nIt was really positive to hear that funding has been secured for 131 low-carbon energy generation projects – compared to zero last year, because no bidders came forward.\nI had hoped to speak in a Westminster Hall debate on SEND last Thursday, but unfortunately I wasn’t called.\nWhat do you think?\nAhead of the Budget on the 30 October, there has been some speculation about what might be announced. These stories are hard to confirm or deny – the measures in the Budget will only be known to a very small number of people. But it is helpful to me to know if there are particular issues of concern.\nAre you worried about particular measures that might be in the Budget? Are you affected by the means-testing of the Winter Fuel Allowance? If so, are you eligible for other forms of support, and what will the likely effect be on you?\nAs always, any response will be treated in confidence.\nBest wishes\nLaurence Turner\nLabour MP, Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThis newsletter is written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_about-me/content_6.html": "About me\nI stood to be your MP to deliver better public services and better protections at work. I know what it takes to represent different communities.\nBefore I was elected as MP in July 2024, I worked as head of policy at a trade union – the GMB - where I fought for better for working people every day. I changed the law to double sentences for abusers who sexually assault police officers, ambulance workers and firefighters. I campaigned for and delivered better pay for thousands of key workers. For me, making life better for working people is what the Labour Party should be about.\nI was elected with a mandate to fight for better public services. Those services were there for me when I needed them. I was a SEND kid who went on to become a senior trade unionist and ultimately run for Parliament. That’s why I am passionate about reforming the SEND system that is failing too many children and families. I know what it’s like to be a victim of serious violent crime and I will always stand for safer streets across our community.\nBirmingham needs MPs who will stand up for the city in Parliament. Most of my family are from south Birmingham and I will always fight investment and opportunity in our communities. I pledged to be a locally-based MP and to restore a full constituency service. Since the election, I’ve set up a fully staffed constituency office and regular surgeries. All my resources are here, in Birmingham. I am one of the most active MPs in Parliament where I regularly raise constituency issues, and I scrutinise Government policy as a member of the Transport Select Committee.\nI will always speak up for Birmingham Northfield in Parliament and fight for working people and the better public services that we need.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_wellbeing-bill/content_44.html": "Children’s Wellbeing Bill vote\nI spoke in favour of the Children’s Wellbeing Bill yesterday - and set out why I couldn’t support the Tory Party’s amendment.\nLet’s be clear: the Tories shamefully tried to scrap legislation that will help keep children safe - they just tacked a call for an inquiry to the end of a ‘wrecking’ amendment.\nThe amendment wouldn’t even have required the Government to set up a new inquiry. But had it gone through, it would have meant that important measures to safeguard children would have been delayed by months.\nYou can read what the vote was actually on here.\nSky News has a good summary:\nHowever, it’s important to note that had the amendment passed, it would not actually have forced the government to launch an inquiry.\nIt would instead simply have killed the legislation, which is focused on early years education\nKemi Badenoch even used this vote to raise money for the Conservative Party. It’s disgusting, gutter politics.\nThis week’s Bill was about taking action that the Child Sexual Abuse Inquiry called for: a duty to report. Making sure that vulnerable kids don’t fall through the gaps. As well as keeping the costs of uniforms down and protecting teachers’ pay.\nThe empty gesture politics from the Tories dangerous and shameful posturing, and an insult to survivors.\nMy short speech from the debate is below:\nThe Bill represents a real step towards closing the gaps through which children are falling. Parents and carers in Birmingham Northfield will welcome the measures in the Bill to help keep the cost of school uniforms down, to extend free breakfast clubs to every primary school, and to tackle the profiteering by the pirates of the high needs, which my hon. Friend the Member for Mansfield (Steve Yemm) spoke about so convincingly.\nI agree with Members from across the House who have said that beyond the Bill, we need to see progress in this Parliament on our children’s happiness and on SEND. We cannot lose sight of the fact that the new duty to report safeguarding concerns will protect children and save lives. May I say how welcome it is to see in the Bill the name of the safeguarding Minister, the hon. Member for Birmingham Yardley (Jess Phillips)? Child abuse is the cruellest and most cowardly of crimes, and few have done as much as her to champion victims. The public hounding that we have seen in the past week, which some Members of this House have failed to condemn, represents a threat to public safety, a disgrace to public life and an insult to survivors of grooming and abuse.\nSome of my constituents will take an interest in the vote on the Conservative amendment as well as on the Bill. I want to be clear: the amendment is a lengthy hodgepodge of objections to the Bill, and I fundamentally disagree with it; it would have the effect of delaying action on safeguarding.\nI conclude by saying to Opposition Front Benchers that if they continue with the opportunistic weaponising of the most sensitive and serious issues, which we have learned over the last day has extended to using this matter as a fundraising opportunity, they will remain in opposition and will deserve to do so.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-191124/content_43.html": "MP newsletter - knife crime, local policing, and remembrance - 19 November 2024\nDo you want to receive this newsletter first? Click here to subscribe\nGood evening. After a bit of a break, this newsletter is a little longer than normal and it mostly covers local news.\nI have not included the usual ‘what do you think’ question to save on length and, also, because of the nature of some of the topics covered. But if you would like to let me know your thoughts on any of the matters covered below then please just reply to this email.\nBirmingham news\nKnife crime\nIt is terrible and sobering to start by talking about knife crime. But that shock has been felt keenly over the last two weeks.\nThe horrendous news broke that a man had been killed in Kings Norton. Two people were quickly charged with murder and ‘possession of a bladed article.’\nThis was followed by the news that a 15 year old boy had been stabbed near Northfield high street and sustained ‘life threatening injuries.’ Two teenagers have been arrested on suspicion of attempted murder and the police have appealed for any information.\nIt is truly shocking news. It is also important to avoid speculation about the individual incidents.\nThe scourge of knife crime is taking a devastating toll, including in Birmingham. So much needs to be done in terms of prevention, education, investigation and enforcement. My thoughts are with the families of the victims, and I am grateful to the local police for their professionalism at this difficult time.\nChanges to local policing\nThe police are making some changes which will make a visible difference – and be of wider interest.\nThe local police force are changing the way they operate. Up to now, PCSOs have been deployed across the constituency as a whole. But in response to demand for more regular patrols, there will now be more regular and visible patrols on Northfield high street and in Weoley Castle.\nPolice officers will still be deployed to respond to incidents across the constituency. PCSOs do an essential – and sometimes overlooked – job, and these changes are welcome. Graffiti and shoplifting are a real problem for the businesses that we need to attract and retain in Northfield (in fact, when I met businesses on the high street recently, crime and anti-social behaviour was the first issue that they raised).\nThe scrapping of the ‘£200 rule,’ which meant that so-called ‘low-level’ shoplifting was not routinely investigated and offenders were not prosecuted, is a welcome change. But the resources must be there to enforce it. The local police do a tough job with limited resources, and this is a step in the right direction.\nRemembrance weekend\nIt was a privilege to represent Parliament and join remembrance services and activities in Longbridge, New Frankley, Northfield, and Kings Norton.\nThe number of services in the constituency is a credit to the strength of our communities.\nA marker was also placed for Birmingham Northfield in Parliament’s garden of remembrance.\nI would like to record my thanks to the organisers: New Frankley Parish Council, God’s Heart for Longbridge, Kings Norton Farmers’ Market, and Royal British Legion Austin Branch Northfield.\nBin collections\nAnother week - and another round of bin collections has been missed.\nSome missed collections are inevitable in a city of Birmingham’s size but we all know that’s not what we’re talking about. The service has not been good enough for too long, and\nI spoke to BBC Radio WM along with local residents about the state of bin collections (with a particular focus on Allens Cross). Each week, I make representations to the Council about bin collections, and it is sometimes possible to secure remedial collections.\nWhile councillors should be the first contact, please feel free to get in touch if you have missed collections – I am always happy to take up individual cases, and my team do a brilliant job of following up reports. My office details are:\nlaurence.turner.mp@parliament.uk\n0121 516 5770\nCollection rates have improved, somewhat, since the worst months in the summer, but that is not true in every area. I continue to talk to the Council regularly about the need to show sustained improvement in this service.\nFlooding – Manor Farm Park estate community meeting\nMy office recently organised a community meeting with the Weoley councillors (Jamie Tennant and Miranda Perks), which was hosted by Bournville Village Trust.\nThe meeting was by Severn Trent, Keir, Birmingham City Council, BVT, and Midland Heart. Regrettably, Crest Nicholson (the developer) did not attend.\nSome progress was made in the meeting, but it was clear that there was a lack of certainty over which agencies were responsible for the upkeep of some infrastructure. My team are following up, and thank you to those who attended.\nCAMHS\nI have written before in this newsletter about mental health services, and the huge increase in referrals for children and adolescents’ mental health services last year (CAMHS).\nNew figures, which I obtained in Parliament, show that these problems are not just new: waiting times have been roughly double the national average for years.\nOn the other side of the coin, adult mental health services in Birmingham have actually improved, even if challenges remain – as a report found two weeks ago.\nWe need to find a way of delivering those same improvements for young people’s mental health services. Each day stuck on a waiting list risks damage that may not be put right later – it also leaves some young people at risk of grooming by gangs. I met Birmingham Healthwatch to discuss the issue, and they reported that work is under way to take a more integrated approach between adult and youth services.\nBirmingham bombings anniversary\nThis Thursday marks the 50th anniversary of the Birmingham bombings.\nThere will be more to say on the day. I know that all those who can will stop to observe a minute’s silence at 14:00 in memory of the 21 victims of that appalling crime, and to think about those who survived.\nDates for the diary\nIn addition to the Kings Norton Christmas Market mentioned in the last newsletter on Saturday 14 December, Northfield Christmas Arts Market will be held on the same day at the shopping centre (complete with a Father Christmas) between 11:00 and 16:00.\nWest Heath Christmas Fayre is also at the Community Centre this Saturday (the 23rd) from 12:00 to 16:00.\nSouth Birmingham history\nTwo hundred years ago, John Cadbury sold his first drinking chocolate. For the two-hundred year anniversary, Mondelez is putting investment into the company’s archives, and making them more accessible (including by making more records available online).\nI will be hosting a reception in Parliament to mark the occasion next month. The site hosts open days which are advertised through Bournville Village Trust. They are well worth the time when the free tickets are made available (the most recent was in September).\nAnother, more violent, anniversary was also marked in Parliament. 185 years ago, hope for political reform gave way to rioting – or, as they are remembered in some places, uprisings – as the Chartists demanded political reforms that are mostly seen as fundamental democratic rights today.\nViolence spread in the centre of Birmingham. While buildings around the Bull Ring burned, soldiers of the Worcestershire yeomanry were deployed to parade and keep order – such was the fear that the violence would spread. Matthew Boulton’s diary records that:\n‘[Following] a dreadful riot in Birmingham last night … three squadrons quartered in this neighbourhood, Galtons at Kings Norton and Packington’s at Northfield’.\nI spoke briefly to commemorate the Birmingham Political Union, and those heady times.\nOut and about\nI visited the We Clean business in Rubery (which is - just – on the county side of the border). We Clean is a local success story, having doubled its size over the last five years and now employs around 700 people, including in Northfield. We spoke about the importance of supporting independent businesses, as well as promotion of the city and some of the challenges that are currently facing business.\nI also met with a variety of high street businesses in Northfield (organised through the Business Improvement District) to talk about crime and anti-social behaviour, Council finances, and the impact of the Budget.\nI’ve also met with University Hospitals Birmingham to talk about their plans for winter (which includes working with other trusts to create more beds at West Heath hospital), as well as Healthwatch Birmingham (who provide independent scrutiny of local health services).\nCongratulations\nTo Northfield Town FC, who beat Cadbury Athletic 3-2 on the 2nd.\nIn Parliament\nSEND\nAs this newsletter contains quite a lot of local news, I will try to keep the Parliamentary section brief.\nI raised SEND delays with Ministers in the House of Commons – including the delays caused by public agencies (such as the NHS, schools, the council, and social services) not working together as they should.\nI was glad that the Minister agreed to hear from south Birmingham families about their experiences, which I am working to facilitate. It is important that reforms to the system are directly shaped by the experience of the young people and families who are at its sharp edge.\nA transcript is here.\nTransport Committee\nAs a member of the Transport Select Committee, I provide scrutiny of the Government’s decisions in this important area.\nLouise Haigh, the Transport Secretary, answered questions last week. I asked about bus fares and wider public transport, plans for rail nationalisation, and motorway improvements. The tone is difficult to get right: constructive, but challenging. Hopefully it was a meaningful contribution.\nTrade union group\nI have never shied away from the fact that I am an MP from a trade union background: I am proud to have represented low-paid, working people.\nIt meant a lot to be elected as Chair of the GMB Parliamentary Group. Some important is going on in Parliament to raise employment standards across the country, and I hope to have more to say on that subject in the next newsletter.\nBest wishes\nLaurence Turner\nMP for Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThese newsletters are mostly written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_assisted-dying/content_56.html": "Terminally Ill Adults (End of Life) Bill\nPlease find a letter to residents on the upcoming vote below:\nDear residents\nNow that the Terminal Ill Adults (End of Life) Bill has been published, I want to set out my view and explain why I will be voting against it.\nI also want to thank everyone who has taken the time to write to me on this issue. This is a complex and emotive issue, and there are strongly held ethical and moral views on both sides of the debate. This is true within the Birmingham Northfield constituency, as it is across the country.\nGiven this is an issue of conscience, it is right that individual Members of Parliament, rather than the Government, will decide on whether to change the law. I have thought hard about my own position, and I will vote against the proposal when it is debated.\nWe must judge any system by how it treats the most vulnerable. I have some background in disability rights campaigning, and on the basis of what I have seen, and the testimony of others, I do not believe that either the NHS or the court system are currently in a position to fulfil that duty of care in all cases.\nI understand and I am sympathetic to the desire for a right for a person to end their life under controlled and humane circumstances of their own choosing. But the best-designed system of checks and balances will still fail if they are underpinned by attitudes are still outdated, and stigmatising.\nI do not mean, in any way, to denigrate the compassion and professionalism of the people who work in the health and court services – quite the opposite. But the hard fact is that those attitudes are still too common. I have seen it in practice. I believe that – in individual cases – inappropriate pressure would be applied to some people to end their lives. I cannot in good conscience vote in favour after being exposed to (some of) the reality of what the treatment of disabled people within our health and court systems can look like.\nI recognise that the UK Bill is more restrictive in scope than equivalent systems in Canada and some nations. But the safeguards in the Bill are not (in my view) well-designed or practical. Under its provisions, if a second doctor did not share the view of the first then that second doctor could be replaced. The Bill also requires High Court approval, but the High Court is already seriously over-stretched and cases are beset by delays.\nI have also listened to medical professionals who have stressed the difficulty of assessing end-of-life expectancy with any certainty, and of the lack of confidence that the drugs that would likely be used to end life do, in fact, result in a painless and dignified death. It weighs heavily with me to know that the proposed change is opposed by the overwhelming majority of medical professionals who work with people at the end of their lives.\nThere is much that can be done to improve palliative care, including by addressing the ongoing gap in hospice funding. I think that more can be done, too, to give greater protections to people of working age who are terminally ill, and I have been involved in the past in supporting the ‘Dying to Work’ campaign.\nBut on the issue of assisted dying, my personal view is that current prosecutorial guidelines strike a difficult, but right, balance – recognising that family members can act out of compassion, and should not face prosecution, where there is evidence that they acted accordance with the wishes of the deceased, and the experience of familis in this position should be improved.\nI do respect the position of those who hold a different point of view. It is a matter of individual conscience, and I cannot, personally, vote in favour.\nYours sincerely\nLaurence",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_telegraph-poles-debate-181024/content_66.html": "News: Laurence Turner leads debate on telegraph poles\nPress release\nWEST MIDLANDS TELEGRAPH POLE INSTALLATION DEBATED IN PARLIAMENT\nMinister seeking meeting with BRSK, and threatens new legislation\nLaurence Turner, Member of Parliament for Birmingham Northfield, led an adjournment debate in the House of Commons today on the issue of ‘planning permission and telegraph poles.’\nResidents’ complaints about telegraph poles in Birmingham have already attracted national local and national attention, and Ofcom is currently investigating broadband rollout in south Birmingham.\nMPs were told that some telegraph poles in the Northfield area were ‘unwanted, unneeded, and obtrusive.’ Similar issues were raised about poles in Bournville, Edgbaston, Dudley, and Redditch.\nLaurence Turner argued that there had been a lack of engagement and consultation, as well as concerns over the complaints procedure which ‘fails to go further than the company providing written responses detailing the reasons why the complaint is accepted or rejected.’\nHe called for a better code of practice to ensure the fulfilment of the Government’s ambition to a full gigabit coverage by 2030, as well as a stronger role for Ofcom in enforcing the Code.\nIn response, the Minister of State, Chris Bryant, said that a small selection of companies were ‘behaving like cowboys.’ He said that he was looking to meet with network operator BRSK in the forthcoming weeks, and that providers should ‘fully understand the concerns of many Birmingham MPs… [and] understand the Government’s concerns in this field.’\nThe Minister also said then the Government would be prepared to introduce new legislation is a strengthened code of practice, expected in the New Year, did not address the issue.\nCommenting, Laurence Turner, MP for Birmingham Northfield, said:\n’This issue is causing real problems for some residents.\n’We all want better broadband connections and poles will be the right answer in some areas, but residents should know what is proposed in their area and have the chance to object.\n’Intrusion and loss of pavement access are real challenges and it is not good enough to expect companies to mark their own homework.\n‘I’m encouraged by the Minister’s statement today that legislation could follow if the problem isn’t resolved, and I will certainly be following up on behalf of residents.’\nENDS\nThe debate can be watched here and a transcript can be read here.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-031124/content_54.html": "MP newsletter - the Budget, Commissioners, and new leadership in Birmingham - 03 November 2024\nDo you want to receive this newsletter first? Click here to subscribe\nGood evening. As the Budget was published on Wednesday, I think it makes sense to start with national news this week.\nThe contents of this week’s newsletter are perhaps more ‘political’ than normal, but I do appreciate the fact that people who hold different political views subscribe to it.\nIn Parliament\nThe Budget\nThe main business in Parliament this week was the Budget – the first Labour Budget in 15 years.\nThe financial context is very different to that which faced the start of the last Labour Government, in 1997. The pressures of adjusting to an aging society are imposing new costs, and the challenges facing public services are, in some ways, greater today (this is particularly true of local government).\nAt the same time, people voted overwhelmingly in July for better public services. This week, the Budget set out to balance the need for serious investment in services with the pledge, after nearly a generation of austerity and the cost-of-living crisis, to not raise taxes on working people.\nCertain measures have dominated the headlines – from the additional £26 billion for the NHS,* to the tax increases which fall primarily on employers’ National Insurance Contributions and increases to the Capital Gains Tax rates.\n(* It is worth reflecting that, as a result of changes made in this Budget, that the NHS will receive the largest real-terms funding increase since the 2005-2010 Parliament.)\nThe Budget marks a break, in my view, from the failed approach of attempting to ‘manage decline.’\nThe scale of the tax increases are significant but they reflect the scale of the challenge (a view which found surprising support from former Conservative Chancellor, Kwasi Kwarteng, who acknowledged that taxes needed to go up).\nFor me, some of the most significant, and welcome, measures in the Budget were:\nThe decision to put substantial money (an additional £550 million) into the Schools Rebuilding Programme. Two local schools – Green Meadows Primary, and King Edward VI Balaam Wood Academy – were due to be rebuilt under the programme.\nHowever, a rise in construction costs has cast doubts on the affordability of individual projects, and the timetable for their delivery. This money should increase confidence that the rebuilds will now go ahead.\nThe decision to give the West Midlands Combined Authority a new, long-term ‘consolidated’ budget.\nOver the last decade or so, local government has become dependent on ‘bidding’ for pots of money that are ringfenced for specific purposes.\nThese funds are often short-term in nature and they can prevent long-term planning. The cost of bidding to local authorities is also high and there is no guarantee of success (as was shown when the much-advertised bid to rejuvenate Northfield high street was denied).\nIt is welcome that the West Midlands has been marked out as one of just two combined authorities that will benefit from the new approach).\nMore than £2 billion for local government, with some money allocated specifically for SEND, roads maintenance, and adult social care.\nIt is important that we know what Birmingham City Council’s allocation is soon so that these new funds can be included in next year’s local budget planning.\nRaising the National Minimum Wage by 6.7 per cent to £12.21 an hour. This is acting on the recommendations of the independent Low Pay Commission, which for the first time is taking the cost of living into account.\nIt has been estimated that 1 in 10 people in work in Birmingham Northfield constituency are on the minimum wage – this is a significant increase for around 3,000 people in work locally.\nRaising the Carer’s Allowance earnings threshold from £151 per week to £196 per week (the highest increase since the benefit was introduced in 1976).\nExtending the Household Support Fund by a further six months (about which – more local details below).\nCompensation for the victims of the infected blood and Post Office Horizon scandals.\nBusiness rates reform: permanently lower rates are being introduced for retail, hospitality, and leisure businesses, to be funded by higher rates for much larger premises (such as out-of-town warehouses).\nThis is a longstanding problem which means that internet retail giants like Amazon pay a much lower effective rate of local taxation than ‘brick and mortar’ high street shops. I am delighted that the unfairness is finally being address.\nOne measure, which I had hoped could be avoided, is the increase in the bus fare cap to £3 next year.\nFor all the attention that trains get (and I am a rail enthusiast), buses account for the great majority of public transport journeys.\nThe cap was always due to come to an end in 2024, and no money had been put aside before July to extend it, so this change can – to an extent – be viewed as a mitigation.\nIn Birmingham, a National Express single fare will rise to £2.90 (while this is marginally lower, in today’s money, than the cost five years ago, it is still a significant increase). I will be looking to raise the issue, including if possible through the Transport Select Committee.\nBirmingham news\nCommissioners\nI met the Birmingham Commissioners earlier this week along with some of the other Birmingham MPs. You can watch some of the fallout from last week’s decision to block the ‘call-in’ of the day centre closure decision here.\nWithout revealing the details of a private meeting, I raised the decision and the question of how realistic Birmingham’s current timetable is for balancing its books.\nOut and about\nLast weekend, I attended the opening of the new Gilgal charity shop in Rednal, along with Police and Crime Commissioner Simon Foster. Gilgal provides a women and children’s refuge which serves the whole city of Birmingham.\nThe quality of the products is very high and all proceeds go towards funding the refuge. Please visit if you can: the address is: 1688 Bristol Road South, B45 9TZ.\nOn Friday I met with Birmingham City Council’s impressive new Managing Director, Joanne Roney, who has just joined the authority, along with the Leader and Deputy Leader of the Council. Joanne was previously the Chief Executive of Manchester City Council, and she brings real credibility and personal to the efforts to improve local services.\nI also met the Friends of the Fairway Day Centre with Councillor Carmel Corrigan to discuss next steps for the campaign following the closure decision, and the Council’s plans to draw up plans for individual service users.\nI share the families’ concern that there may not be enough social worker capacity to draw up meaningful plans in the time available. I was grateful for their time and I will be contacting the Council this week off the back of the meeting.\nAs regular readers will know, I knock on doors at least once a week to pick up on issues and discuss political issues.\nThis week, I spoke to residents in the Great Stone Road area of Northfield, along with councillors Esther Rai and Carmel Corrigan. We picked up a number of items of casework, which are being actioned, including on housing, winter fuel payments, and crime and anti-social behaviour.\nDate for the diary\nThe Christmas Kings Norton Farmers Market will be held from 09:00 to 13:30 on 14 December.\nSEND\nI have secured a question in Parliament tomorrow on SEND services.\nI intend to raise local issues, and I am particularly interested in cases of different public agencies that aren’t working together as they should. I will report back on any progress.\nWider politics\nI try not to include too much ‘party political’ material in these newsletters, but there are two other events which could have a profound impact on the UK, and the wider world.\nFirst, Kemi Badenoch has been elected as leader of the Conservative Party. Personally, I do not think that someone who believes that the Downing Street Partygate scandal was ‘overblown,’ that statutory maternity pay is ‘excessive,’ and who wrongly says that autism is a mental health condition (while speaking out against the reasonable adjustments framework that has existed for disabled people for thirty years) is fit to lead our country. But it is down to those of who us do not share those beliefs to make the case in public and in the community.\nThe United States of America also goes to the polls on Tuesday. The results could immediately change – and lead to greater bloodshed - in the war against Ukraine, and in the conflicts in the Middle East. I am sure that we all be watching with hope, and trepidation.\nWhat do you think?\nWhat was your view of the Budget? Some of the complications in Budgets are often not spotted on the day but are better understood as the small print is scoured in the days that follow. Are there any measures that will affect you which you think haven’t had the attention that they should?\nLet me know and I am always happy to press the government for more clarity on how these announcements will affect people and businesses in practice.\nBest wishes\nLaurence Turner\nMP for Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThese newsletters are mostly written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_new-deal/content_55.html": "A New Deal for Working People\nFighting for every vote\nThe New Deal for Working People is the Labour Party’s plan to make work pay and strengthen the economy.\nIt is a blueprint for respect and decent treatment at work. Volunteers from the GMB trade union joined local campaigners on Sunday to talk to residents in King’s Norton and Longbridge about Labour’s commitments.\nThe New Deal will make a real difference to people in work, including in particularly low-paid roles. It will also give unions like GMB a fairer chance when it fights to provide proper representation to workers in employers like Amazon.\nThe New Deal has been developed with unions, including GMB, to end the race-to-the-bottom in pay and terms and conditions. I am proud to have played a role in developing those policies, and I want to make sure they are implemented in Parliament.\nKey commitments in the New Deal include:\nEnding fire and rehire\nBanning exploitative zero hours contracts\nDay one rights at work\nPreventing employers from using outsourcing to evade equal pay liabilities\nStrengthening redundancy rights and TUPE\nStrengthening flexible working and family leave rights\nReinstating the School Support Staff Negotiating Body and establishing better contracts and new pay rates for the 1,500 school support staff workers in the Northfield constituency\nA Fair Pay Agreement to establish a new, national minimum pay rate for adult social care workers\nRestoring and strengthening the two-tier code to protect workers who are outsourced from the public sector\nNew rights so that workers can access unions in their workplace\nReforming union statutory recognition and modernising balloting (by law, unions are currently required to hold statutory ballots by post)\nMaking blacklisting regulations fit for 21st century technology\nThese are important commitments which, I believe, will make a real and material difference to people in work in Northfield.\nBut if people want change then they have to vote for it - by backing Labour on 04 July.",
  "https_laurence4northfield_com_/https_laurence4northfield_com/content_1.html": "Welfare proposals\nI wanted to post something about yesterday’s welfare proposals.\nMar 19, 2025\nWorking hard to represent you\nIt is an honour to be elected as Birmingham Northfield’s Member of Parliament. I will work hard every day to repay the faith that has been placed in me.\nYou can use this website to find out about my work in Parliament and find contact details for casework support. You can also subscribe to a regular constituency newsletter.\nParliamentary record since July 2024\n3,000+ cases closed\n191 questions asked\n180 times spoken\n156 times voted\nSocial media",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_equal-pay-111224/content_71.html": "News: Birmingham equal pay settlement ‘historic’ and ‘good news for city’\nPublic services\nThe news that an agreement has been reached to resolve Birmingham’s equal pay liability has been welcomed as ‘historic’ and ‘good news for the city’s finances.’\nResponding to the news, Laurence Turner, MP for Birmingham Northfield, said:\n’This historic agreement sets out a route that will hopefully end Birmingham’s equal pay liability once and for all.\n’The City Council’s leadership and trade unions deserve great credit for reaching this settlement.\n‘The agreement to resolve the city’s equal pay liability is good news for the city’s finances - but we must also remember the women who fought for pay justice, and who were subject to detriment for too long.’",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_welfare-march-2025/content_8.html": "Welfare proposals\nI wanted to post something about yesterday’s welfare proposals.\nThere’s been time now to read the detailed proposals and (for me) to speak to Ministers. A number of people have been in touch to ask for my reaction, and what work I am doing on this issue as your MP.\nFirst, it’s clear that much of the press reports before yesterday were wrong. I am critical of parts of the plans, but some of the coverage this morning was also, I think, misleading. If you have the time, then I’d encourage you to read the ‘green paper’ (called ‘Pathways to Work’) which contains more details. The link is at the end of this post.\nStarting with the positives, there were some good and overdue announcements that need to be welcomed.\nExempting people who cannot work from PIP reassessment will save a lot of people constant, and needless, worry. I know this from people who are close to me who – with the best will in the world – cannot work, but who had to go through continual reassessment.\nThe money that is going into proper welfare-to-work support is not a sticking plaster – this is serious investment. Scrapping the Work Capability Assessment (WCA) is another measure that disability organisations have called for over many years.\nReplacing PIP cash payments with vouchers has also been ruled out. This is the right call and something I have raised with Ministers since I was elected. The idea that the DWP should be trying to micromanage disabled people’s money was always wrong, and patronising.\nI have serious concerns over other parts of the proposals.\nSpecifically, the new PIP criteria means that points would no longer be added up over the different categories. Instead, people will need to score 4 points in a single category to qualify. To give an example, at the moment, someone who cannot cook on a hob, but who can use a microwave, scores under 4 points.\nTo me, this is not a fair test of whether someone needs disability support. A review of the PIP assessment has been announced, which I hope will lead to new, and fairer, criteria. I have made this case to Ministers and I will continue to do so.\nSecond, I don’t agree with the proposed restriction of Universal Credit from people aged under 22, and Disability Living Allowance from people aged 16 and 17.\nThe Government has said that ‘severely’ disabled young people should continue to be eligible. But the biggest factor for many disabled young people is whether they can live in the family home – sometimes, this just isn’t possible due to relationship breakdowns, or lack of space, or other reasons.\nThe aim of reforming social security for modern times is the right one. Anyone who has been on disability benefits, or out of work benefits, knows that it is failing too many people.\nAnd – to be frank – governments in the past have been happy to look the other way when the social security bill kept the unemployment statistics down, including in Birmingham.\nWe need to get this right. There is still time to make changes and make these proposals fairer.\nI want to see more done to make reasonable adjustments the standard at work (so more disabled people stay in work and progress to better-paid roles).\nWe also need to address the problem of special school leavers who suddenly find that there isn’t support for the transition to adulthood, which is when many parents drop out of work.\nTwo other pieces of information that may be useful:\nThis is a consultation. The plans are not yet set in stone. The consultation can be found here and it is open until the end of June. I’d encourage anyone interested to respond (you don’t have to answer every question): https://www.gov.uk/government/consultations/pathways-to-work-reforming-benefits-and-support-to-get-britain-working-green-paper\nSecond, even if carried through as they stand, the proposed changes would start to come into force in November 2026, so no-one faces an immediate change in income.\nThis is an ongoing process. It is also a hugely important issue. I’d welcome your thoughts.\nImage credit - Wikimedia Commons.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-140724/content_15.html": "MP Newsletter - libaries, bins, and a new government - 15 July 2024\nDo you want to receive this newsletter first? Click here to subscribe\nMP NEWSLETTER – 14 JULY 2024 – LIBRARIES, BIN COLLECTIONS, AND A NEW GOVERNMENT\nGood morning and thank you for subscribing to my regular newsletter. This email – sent weekly when Parliament is meeting – provides an update on local news and national politics. It also allows me to ask your views on important topics.\nElection result\nWelcome to my first MP newsletter. It is truly an honour to be elected to serve the Birmingham Northfield constituency.\nWhen I was elected, I said that I would aim to deliver the highest standards of public service, and that I will work hard every day to repay the faith that has been shown in me. I will strive to be true to those values.\nVoters delivered a resounding mandate for change. That was true in all the communities in Northfield constituency – including in Kings Norton North and Northfield Wards, where Carmel Corrigan and Esther Rai were also elected as Labour councillors.\nIt was also true across the country. The Labour majority of 5,389 in Birmingham Northfield is the best result in the seat since 2005. But many people did not vote for either of the two main parties. And many voted Labour for the first time as an instruction to deliver political stability and better public services.\nI said at the election count that I want to represent all my constituents, including those who did not vote Labour, or who voted Labour for the first time. From Green voters to those who backed the Conservatives or Reform, one of the tasks of an MP is to work hard and win trust. That is what I intend to do.\nI also paid tribute to my immediate predecessor, Gary Sambrook. We live in an age when politics is dangerously fractured and divided, and it is more important than ever that politicians try to work across party lines. I am sure that this is not the end for Gary in Birmingham politics, and I wish him well.\nYou can read more about the election (and see the results) here.\nBirmingham news\nLibraries\nLast week, I attended a public meeting organised by the Friends of Northfield Library. The City Council’s consultation closes on Wednesday and all library services are under review, including the future of the libraries in Frankley, Kings Norton, Northfield, and Weoley Castle. The Council is exploring alternative ways of delivering services in some areas, and it is possible that some sites will shut completely.\nThere is a wider story about Birmingham’s finances, and a national lack of funding for libraries. More than 300 public libraries have closed in England since 2010. But I am deeply concerned about the current state of library services and the consultation itself.\nThe internet has had an effect on the number of people who use libraries but public services in decline can become a self-fulfilling prophecy. None of the libraries in the Northfield constituency now open after 17:00. Cuts to staffing, including to qualified staff, have meant that the service is less reliable (Northfield library was closed last Saturday due to staff shortages).\nI spent some time knocking on doors in Frankley yesterday to talk to residents about the future of the library. Many people said that they relied on the library, particularly older people, and parents. There was a more general concern about the effect on the estate if another amenity was lost, and about the lack of public transport to alternatives.\nI am making a submission to the consultation and I want to make sure that residents’ views are represented. The consultation itself – at 66 questions – is not, in my view, accessible to many library users, such as those with English as an additional language, or some people with accessibility requirements. There has to be a better way of consulting on the future of essential local services.\nBin collections\nOne of the issues that came up on the doorstep most frequently during the election was bin collections. Service reliability fell significantly during last few weeks. I have been making individual representations to the Council about missed collections, and I also set out to get a substantial update on the situation.\nThe Council is spending serious money to remedy its aging vehicles and to put on ‘catch-up’ collections, but it will be some time before the service has recovered. You can read my letter to the Council, and the Council’s reply, here.\nBirmingham City Council finances\nIt is hard to talk about libraries without also talking about the City Council’s finances, and the Section 114 notice. There are still many unanswered questions about what happened last year, including how the estimate for the city’s equal pay liability – which was backed by external auditors – was got so badly wrong.\nI believe that the way that Michael Gove sent in the Commissioners cannot be separated from the politics of the General Election campaign. I have submitted a number of questions in Parliament on the issue. There will be more to say on this important issue, but it was heartening to hear from Richard Parker – West Midlands Mayor – this week that early discussions with the new Government had been positive.\nThere does need to be accountability locally – and I have backed calls for a public inquiry. The scale of the cuts to Birmingham’s funding is difficult to overstate. Accounting for inflation, more than 40p in the pound was cut for each person in the city. Difficult decisions lie ahead, but it is already making a difference to no longer have a government that is determined to talk Birmingham down for narrow political ends.\nCycling safety\nA cyclist was hit and received advanced emergency care on Thursday in South Road, off the Bristol Road and near Northfield Station. I was in the area and I saw the extent of the police and ambulance presence that night. Although it is usually best to avoid commenting on a specific incident until the facts are known, the roads should be safe for all their users, including cyclists.\nSadly, 60 young cyclists alone were killed or seriously injured on the city’s streets between 2016 and 2020. We know what works: segregated infrastructure, or dedicated cycleways, have been shown to keep people safe, reduce congestion, and encourage more people to cycle. Birmingham City Council is due to publish a consultation on the proposed A38 Cycleway extension later this year, and I look forward to seeing the details. My thoughts are with the cyclist who sustained those serious injuries.\nSchool news\nCongratulations to the staff and pupils at the University of Birmingham School for winning the ‘Secondary School of the Year’ award at the Midlands Education Awards this year.\nMP office update\nFollowing the election, I am now in the process of recruiting staff and setting up a constituency office. Two roles have been advertised on the ‘Work 4 MP’ service, and more posts will be advertised this week.\nAs I am currently working without an office, I must ask that people be patient about correspondence. I am currently receiving around a hundred emails from constituents each day, and I am obliged to prioritise urgent casework. I have made representations this week on a number of issues, including on housing, SEND transport, and urgent visa issues.\nIf you do not receive a response then I would encourage you to follow up with me on: laurence.turner.mp@parliament.uk.\nIn Parliament\nParliament is now sitting but the scrutiny of legislation has not yet begun. However, while some events (like MPs being ‘sworn in’) have taken place in public, a lot of work is happening behind the scenes.\nKeir Starmer spoke to the new Labour MPs earlier this week. He reminded us how unusual Labour governments are, and how precious the time that have in power is. As a Labour supporter, after 14 long years in opposition, it was an uplifting and emotional moment.\nThe new Government’s legislative programme will be set out in the King’s Speech on Wednesday. We don’t know yet what it will contain, but I’m heartened by the steps that the new Government has already taken in these first few days, including:\nRestoring housebuilding targets;\nLifting the ban on new onshore wind power;\nReforming planning so that more essential national infrastructure is built;\nHolding constructive talks with trade unions and businesses;\nReaffirming the UK’s support for Ukraine.\nI’ll be looking out in particular on Wednesday for an announcement on the New Deal for Working People. I hope and believe that Labour’s plans to end the race to the bottom on employment rights will be remembered as one of this Government’s finest achievements. There will be more to report in next week’s newsletter.\nThe full business of Parliament will start again after the King’s Speech, but MPs can submit questions at this point. I have tabled questions on issues such as: local GP practice coverage; SEND and the timetable for the opening of the new Frankley Hill autism-specialism school; the Birmingham Section 114 notice; the ambulance workforce; and some specific issues raised by constituents. I will report back on any answers received.\nWhat do you think?\nAhead of the Birmingham library consultation closing: do you use your local library? What do you think the effects of closures or service reductions would be on you and the community? Thinking over the longer-term, are there things that Birmingham’s libraries could do differently, or better?\nYour views would be much appreciated ahead of Wednesday’s deadline. I will share my response to the consultation online, and in next week’s newsletter.\nBest wishes\nLaurence Turner\nLabour MP, Birmingham Northfield",
  "https_laurence4northfield_com_/https_laurence4northfield_com_pension-credit/content_3.html": "Get Pension Credit support\nCheck if you are eligible\nPension Credit can top up your regular income - but it can also be a passport to other forms of support, including the free over-75s TV licence, council tax exemption, winter fuel payments, and boiler replacement support.\nMany people are not getting the support that they are entitled to. Around 2,600 households in the Birmingham Northfield constituency are believed to be eligible but they do not receive Pension Credit.\nYou might still be eligible for Pension Credit even if your income is higher than the threshold. If you are in any doubt then please check whether you are entitled to the extra support.\nWhat are the criteria?\nThe best way to check your eligibility is to speak to an adviser. Please click below - Pension Credit - get independent advice - for details of free local and national advice services.\nThe below advice is based on the official criteria, but it is guidance only.\nBe of pensionable age\nYou (and your partner, if you have one) must be of pensionable age or you (or your partner) are in receipt of Housing Benefit for people over the state pension age.\nIncome\nPension Credit will top up your income to £218.15 a week if you are single, or joint income to £332.95 a week if you have a partner.\nIf you have savings of more than £10,000 then £1 a week will be deducted from these totals for every £500 that you have above £10,000. Some forms of income – such as Attendance Allowance – do not count towards your weekly total. If you are in doubt then please talk to an adviser.\nSavings Credit – for people who retired before 06 April 2016\nIf you retired before 06 April 2016 and have some savings then you might be eligible for Pension Credit even if your income is higher than the weekly threshold. This is called Savings Credit. Please speak to an adviser.\nNote: if you are not eligible for Pension Credit then you should still get Winter Fuel payments if you are in receipt of one of: Universal Credit; income-related Employment and Support Allowance (ESA); income-based Jobseeker’s Allowance (JSA); Income Support; Child Tax Credit; or Working Tax Credit.\nPension Credit - how to apply\nWhat you’ll need\nThere are number of ways that you can apply for Pension Credit.\nBefore applying, you should have to hand: (a) your National Insurance Number, (b) details of any income, savings, or investments, and (c) those same details for three months ago (or on your retirement date if you retired within the last three months).\nHow to apply\nBy phone: DWP 0800 99 1234 Freephone service – open 08:00 to 18:00, Monday to Friday\nOnline: apply-for-pension-credit.service.gov.uk/ (note – there is no www. before the link)\nBy post: A form can be printed out – this can be downloaded from: https://www.gov.uk/pension-credit/how-to-claim\nIf you do not have access to a printer then please contact my office by emailing laurence.turner.mp@parliament.uk or by phoning: 0121 516 5770\nPension Credit - get independent advice\nThere are a number of sources of independent advice and support for Pension Credit applications.\nNorthfield Community Partnership (NCP)\nNorthfield Community Partnership can assist with the application process (as well as supporting applications for other DWP entitlements).\nBy phone: 0121 411 2157\nIndependent Age helpline\nIndependent Age is the only national charity that is dedicated solely to the issue of low incomes among older people.\nIts free national helpline advisers can help with the preparation of a Pension Credit claim.\nBy phone: 0800 319 6789 (08:30 to 17:30, Monday to Friday - freephone)\nBirmingham Citizens’ Advice Bureau (CAB)\nThe Citizens Advice Bureau can provide guidance on a wide range of matters, including on benefits / social security.\nBy phone: 0808 278 7990 (09:30 to 16:30, Monday to Friday - freephone)\nNorthfield MP’s office\nIf you have submitted an application but you then have problems with the DWP (such as delays in replying) then you can contact my office.\nBy phone: 0121 516 5770 (09:00 to 17:00, Monday to Friday)\nBy email: laurence.turner.mp@parliament.uk",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-241024/content_13.html": "MP newsletter - rights at work, Birmingham services, and telegraph poles debate - 24 October 2024\nDo you want to receive this newsletter first? Click here to subscribe\nGood afternoon. Thank you as always for subscribing to this regular newsletter.\nBirmingham news\nBirmingham City Council\nI have to start a newsletter, once again, by talking about Birmingham City Council.\nIt is true that Birmingham lost enormous, and disproportionate, amounts of funding over recent years. It is also true that basic services need to be better, and that there needs to be an accounting for programmes that have gone wrong: chief among them, the Oracle human resources and payments IT system.\nThis is the backdrop to a report, published today, which was submitted by the Commissioners to Michael Gove back in April. The report is challenging (and parts of it are open to dispute). But that is not to under-state the scale of the challenges that the local authority faces.\nSome things have moved since April. In particular, serious negotiations are underway over a settlement of the equal pay liability, and the implementation of a job evaluation process that should prevent future liabilities from occurring. The local government Minister (Jim McMahon) has written to me to say that:\n‘These are positive signs but there remains more to be done, and I am keen that the intervention moves as quickly as possible to a model based around a more equal partnership with the Council so that it is increasingly able to lead its own recovery.’\nA new report is expected in January and I anticipate that there will be a government statement then.\nDay centres\nAs I write, the news has come through that the Commissioners have blocked an attempt to ‘call-in’ the decision to close four adult day centres – including the Fairway, and Harborne in the neighbouring constituency of Edgbaston. A ‘call-in’ is essentially a request from councillors for more scrutiny.\nThe rejection raises some very uncomfortable questions. Where is the local accountability? Some people have been using the day centres for decades, and the future of services for vulnerable adults needs more scrutiny, not less. I disagree, sharply, with the Commissioners’ claim that there has been ‘comprehensive pre-decision scrutiny.’\nI know that this news will come as a heavy blow to the centre users and their families. I am due to meet the Commissioners (along with other Birmingham MPs) on Monday.\nTelegraph poles\nAs mentioned in previous newsletters, I secured my first debate in Parliament last week. This was on the subject of ‘planning permission and telegraph poles.’\nThis isn’t a problem in every area, but in some parts of the constituency there has been a sudden appearance of inappropriately sited poles that can block pavements and restrict property access. Judging by the number of MPs who wanted to speak, this is a problem in many other areas too.\nThe Minister said that ‘a few [companies] are behaving like cowboys,’ and that:\n‘The industry has committed to revising the code of practice, which I think will be much tougher, and the guidance should be published in the new year. However, I am absolutely clear that if voluntary adherence does not work, we reserve the right to change the law.’\nPersonally, I would like the government to go further. As long as community consultation and complaints processes are voluntary then there will always be bad practice. However, the threat of legislation will focus minds, and I will keep on taking up casework with the individual companies.\nThere’s a short clip from the debate (focusing on the constituency) below. The full debate can be watched here and a transcript can be read here.\nLibraries\nBirmingham City Council has published its updated proposals for the future of local library services.\nIn a nutshell, the Council is now proposing an increase in the opening hours at Kings Norton and Weoley Castle, but a reduction in hours at Northfield. It must be stressed that these changes are compared to the previous proposals, not to current (and unreliable) opening hours.\n| Library | Changes (compared to previous proposal) |\n| Frankley Community Library | ‘Partner-led’ (no change) |\n| Kings Norton | 21 hours per week (+7 hours) |\n| Northfield | 28 hours per week (-7 hours) |\n| Weoley Castle | 21 hours per week (+7 hours) |\nThroughout this process, I have tried to avoid the trap of playing off some of our local libraries against others. Our aim must be to keep all of our libraries open, for as long as possible.\nThe situation at Frankley Community Library continues to be a major concern. It was apparent at the in-person consultation last month that substantial work needed to be done to identify a suitable partner organisation (the situation is complicated by the site-share with the King Edward VI Balaam Wood school).\nOut and about\nI was glad to join the Friends of Weoley Hill Park group, which is in the process of forming, along with Councillor Miranda Perks at the village hall on Friday. We agreed a number of next steps, including on the importance of public meetings on the Environment Agency’s proposals.\nOn Saturday I spent time knocking on doors in Shenley, along with local volunteers and Councillor Jamie Tennant. These sessions are a really useful way of staying in touch, and we picked up a number of casework issues that are being progressed.\nI have also been working to get a substantial update on the future of the King George V pub site. I share residents’ concerns about the lack of news and the deteriorating condition of the listed building. I hope to be in a position to provide that update soon.\nIn Parliament\nRights at work\nParliament made big progress this week on the delivery of a manifesto commitment to ‘Make Work Pay’ by debating the Employment Rights Bill.\nThe measures in the Bill include:\nGiving people on zero-hours the right to a regular-hours contract (when employers like JD Wetherspoons have trialled this approach, almost 100% of people chose a regular-hours contract).\nMaking Statutory Sick Pay a day-one right and removing the Lower Earnings Limit.\nMaking parental, paternity, and bereavement leave available from day one.\nBetter protections for public service workers who are outsourced.\nCreating new negotiating bodies to raise pay and standards for school support staff and care workers.\nThese measures will make a real difference in south Birmingham. There are almost three thousand care workers and school support staff in the Northfield constituency. They are some of the lowest-paid workers in public services, and the lack of sick pay protection lead directly to more infections and more deaths in care homes during the pandemic.\nPeople in the West Midlands are also more likely to be employed on zero hours contracts than anywhere else in the country.\nAs a trade unionist, I worked on this agenda for years and it was a special moment to see this law go through its first stages. As part of my speech, I paid tribute to the former Birmingham MP, Jack Dromey, who did so much to advance this cause.\nThere was opposition to the Bill – both the Conservatives and Reform voted against. A lot of work lies ahead, but for me this the kind of change that people voted for in July: real, tangible, improvements, which will be felt most keenly in working class communities that have been neglected for too long.\nA clip from my speech can be watched below and the transcript is here.\nAPPG on SEND\nLate last week, I was glad to join MPs from different parties to re-launch the All-Party Parliamentary Group on SEND (Special Educational Needs and Disabilities).\nAs you might know, this is an issue that is very important to me. I look forward to working with colleagues from Labour and other parties to make the case for reforming the system.\nMaking the case for libraries\nI was also really glad to host a reception for CILIP (the Chartered Institute of Library and Information Professionals) earlier this week, and to see a constituent – John Dolan, MBE, who is involved in the Birmingham libraries campaign – there.\nI spoke about the importance of Birmingham’s library services – their history and the essential services that they provide – and the need to libraries to be included in the Government’s strategy for education and skills. There was further news this week about Birmingham’s libraries, which is discussed above.\nTransport Select Committee\nI am delighted to be joining the Transport Select Committee. Better public transport services is a cause that should unite us all, and I am looking forward to scrutinising the Government’s work. In preparation, I’ve been busy asking questions about falling cycling rates, support for bus schemes, and disability access on our rail network. Answers will be published here as they come through.\nWhat do you think?\nEmployment rights have hit the front pages this week. There has been some public concern about cost to businesses – put at around £4.5 billion, most of which is transferred to people at work.\nPersonally I think those costs can be compensated by reducing other business costs, such at the £7.5 billion additional cost of customs checks, but what do you think? Are there particular measures that you want to see, or that you are concerned about?\nI’m particularly keen to hear from people on insecure or low-paid contracts, and local businesses. I’ve been reaching out to various private sector organisations locally, and I’m always keen to visit workplaces.\nBest wishes\nLaurence Turner\nMP for Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThese newsletters are mostly written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_bin-problems/content_21.html": "Bin collection problems\nPublic services\nA number of residents are continuing to experience unacceptable delays to their bin collections.\nI’ve reported individual roads that haven’t received collections over the last few weeks but it’s clear that the problem hasn’t abated.\nMy letter to Birmingham City Council can be found below.\nIndividual reports of missed bin collctions can be made to the Council using its own website or the Fix My Street service. The Council normally replies in two to three days.\nUPDATE: the reply from John Cotton, Leader of Birmingham City Council, is reproducd below.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newstarts/content_25.html": "NewStarts\nFrankley Great Park\nCommunity\nI’m grateful to NewStarts in Frankley for allowing me to visit on Monday.\nThe NewStarts project provides furniture to those who need it, and sells furniture at affordable prices. The proceeds are used to fund emergency support and a community space.\nNewStarts provides a space for coffee mornings and meetings in the heart of the community.\nIf you are in a position to support the charity - either by donating furniture or by making a financial donation - then please click here.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_visiting-ncp/content_29.html": "Visiting Northfield Community Partnership\nOn Monday, I visited Northfield Community Partnership (NCP).\nAt a time when public services are increasingly stretched, NCP provides an essential community safety net.\nNCP provides or otherwise hosts an incredible range of services - including a food bank, a food pantry, employment and digital skills training, and health advice. Sadly, the need for its food support services is higher than ever.\nLater in the week, I was privileged to spend some time at the ‘NAF Caf’ - a community cafe run by Northfield Arts Forum at the Baptist church. This ‘pay as you feel’ service provides a lifeline to many in the community. I spoke to people who said the cafe was a lifeline, and a place to find companionship when loneliness is a growing problem.\nCommunity organisations are an essential part of our society, and if I am elected as MP then I will work with them and speak up for the third sector in Parliament.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_power-cuts021224/content_32.html": "Power cuts update\nFollowing the power cuts in the general Northfield area during the last week, I wanted to share the below response that I have received from National Grid:\n’On receipt of your email I asked our local team in Birmingham for an update. They confirmed that, unfortunately, we are currently dealing with four high-voltage faults in the Northfield area – all of which happened within a 4-5 hour window. It is likely that these faults caused the outages experienced by your constituents.\nWe recognise the disruption that such outages cause to residents and businesses, and our local team responded swiftly to identify and repair the faults. …\n‘To minimise disruption for residents and businesses, and to restore supplies as swiftly as possible, the local team have restored supplies via an alternative, low-voltage back feed and have also made use of generators. There should, therefore, hopefully not be any further interruptions to customers’ supply in this area as our team carry out the necessary repairs.’\nNational Grid’s emergency 24/7 number can be contacted on 105. Please do also let me know if you experience similar power cuts in the future.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_practical-driving-tests/content_68.html": "Driving test delays\nPractical driving test availability is an important problem for a number of people locally.\nIn fact, Birmingham has been named as the fifth hardest place in the country outside London to get a test.\nI got hold of the current average waiting times for local test centres:\n| Test centre | Average waiting time |\n|---|---|\n| Shirley | 22.8 weeks |\n| Kings Heath | 24 weeks |\nThe Transport Select Committee looked at the problem earlier in December. I raised delays in Birmingham (and other high-delay areas) with the head of the DVSA.\nThe causes of the delay are complicated. They is a national shortage of examiners. Third-party apps and bots are leading to block-bookings which then traded across the country. A focus on HGV examinations during the pandemic drew resources away from car driving assessments.\nThe Government has just announced that hundreds of new examiners will be recruited, and legislation on bots has not been ruled out.\nThe investment should hopefully start to bring delays down.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_richard-burden/content_59.html": "Meeting Richard Burden\nCampaign\nFighting for every vote\nI caught up on Thursday with Richard Burden, Labour MP for Northfield between 1992 and 2019.\nRichard is backing my campaign and he has written about the reasons on his website.\nI worked with Richard in Parliament to develop some of the transport policies that a Labour government will enact, including regaining community control of local bus services, investing in a green motor industry, and taking passenger rail contracts back into public hands.\nRichard has a proud record of serving the community. It means a lot to have his support in this campaign.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_libraries-update-220824/content_18.html": "Important libraries update\nLibraries update\nBirmingham City Council has just published an important update on the future of local library services.\nThe Council is proposing that Northfield Library be kept open full-time as a Community Hub Library.\nWeoley Castle and Kings Norton libraries would be reduced to part-time council-staffed hours (at either 14 or 24 hours per week).\nFrankley Community Library is marked for possible community asset transfer. An additional bus stop would be put in. The future of library is not secure and it is still at risk of closure if a organisation cannot be found to run or fund the library.\nThe budget prepared under the Commissioners sets out cuts of 40 per cent to libraries and buildings spending, or cuts of £2.3 million.\nIt is important that as many services are preserved as possible, for as long as possible, so that irreversible reductions in library services are not made.\nIt is a silver lining that none of Northfield’s libraries are marked for closure in the short-term, but it is important that the community and their representatives continue to engage with the consultation to try to secure the best possible future for all our community’s libraries.\nMy written submission to the library consultation can be read here. I am engaging with library users’ and community groups and the unions that represent library staff, and I will provide further updates when I can.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_kings-norton-station25/content_5.html": "We need investment in Kings Norton station\nI am working with neighbouring MP, Al Carns, to try to get investment into Kings Norton Station.\nAfter a number of delays, it looks like the reopened Camp Hill Line is on track for the end of this year. Services will run to Kings Norton, restoring 6 trains an hour.\nThis is good news for Kings Norton - but without investment in the middle platform and a turnaround facility, the rest of the Cross-City Line can’t be restored to its previous frequency.\nI spoke to ITV Central about the issue along with commuters and small business owners:\nOur joint letter can be read below.\nDuring the General Election, people were told that the money had been found to reinstate the platform. I am afraid that this was never the case. Money had been put aside for design works only. Not a penny was allocated for the works themselves.\nThat decision is now due. I have raised the matter on a number of occasions with Ministers, and I will continue to push for investment in Kings Norton, Northfield, and Longbridge stations.\nWe are also working closely with local councillors Carmel Corrigan, Liz Clements, and Fred Grindrod to try to secure the upgrade.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_stlaurences-traffic/content_69.html": "Traffic problems outside St Laurence schools / Bunbury Road\nThere was a horrendous near-miss outside the St Laurence schools (Infant and Primary) on 22 April.\nA car swevered on to a curb on the Bunbury Road and landed on the schools’ drive shortly before children and parents were due to leave for the day.\nTwo months have passed and the damage is still visible. Other incidents have led to closure of the road at busy times.\nI met parent and staff representatives yesterday, who raised longstanding problems of inappropriate parking enforcement. The campaign group Better Streets for Birmingham have been helpful, but action is needed from public authorities.\nIt was clear to me that traffic calming measures - or other appropriate steps - are needed before another serious incident occurs.\nAlong with Esther Rai, Labour’s council candidate for Northfield, I’ve committed to taking up the issue and reporting back on progress.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-021224/content_51.html": "MP newsletter - assisted dying, power cuts, and animal welfare - 02 December 2024\nDo you want to receive this newsletter first? Click here to subscribe\nGood evening. Following a longer week than usual in Parliament, this newsletter covers the difficult subject of assisted dying, as well as a number of local matters.\nThank you for subscribing; even if I can’t always reply to every message, I appreciate the number of people who take the time to comment and I do read each one.\nBirmingham news\nBins and industrial relations\nUnite, the trade union which represents the majority of Birmingham’s refuse workers, is currently balloting its members for industrial action over the proposed restructure of waste services. More details can be found here.\nWe should know the results within the week. I am due to visit the Lifford Lane Depot soon, and it is important to understand what the timescale is (after the ballot closes), and any contingency planning. I should be able to give a substantial update next week or the week after.\nAs there has been some confusion over the Council’s proposals, it is worth resharing the implications for households: under the new system, food waste should be collected each week. Recycling and all other waste (residual) will be collected on alternating weeks.\nI say ‘should’ because collections are still not reliable enough in some parts of the constituency. As a reminder, while councillors should be the first point of contact on refuse collections, I and my office do chase missed collections and can sometimes secure remedial collections.\nPlease do let me know when collections have been missed on your streets or for your blocks. My office details contact are:\nlaurence.turner.mp@parliament.uk\n0121 516 5770\nIn the same spirit, I understand that negotiations over a resolution to the city’s equal pay liability are ongoing. It is in no-one’s interest to provide a running commentary. But I very much hope that a line can be drawn under the problem for good.\nBirmingham hardship grants\nLocal grants are now open for applications for households facing financial hardship.\nThe grants are worth up to £200 per household. The scheme is administered by BVSC on behalf of Birmingham City Council and it is paid for through the Government’s Household Support Fund.\nHow to apply:\nhttps://hsfbirmingham.online/enquiry/ (direct form to register your interest)\nIf you are experiencing any difficulties with the application process then please get in contact with your local councillors or my office.\nPower cuts\nI am aware that there have been power cuts across parts of the constituency during this week, which affected homes, businesses, and public services.\nReaders may be interested in the below response which I have received from National Grid:\n’On receipt of your email I asked our local team in Birmingham for an update. They confirmed that, unfortunately, we are currently dealing with four high-voltage faults in the Northfield area – all of which happened within a 4-5 hour window. It is likely that these faults caused the outages experienced by your constituents.\n’We recognise the disruption that such outages cause to residents and businesses, and our local team responded swiftly to identify and repair the faults. …\n‘To minimise disruption for residents and businesses, and to restore supplies as swiftly as possible, the local team have restored supplies via an alternative, low-voltage back feed and have also made use of generators. There should, therefore, hopefully not be any further interruptions to customers’ supply in this area as our team carry out the necessary repairs.’\nNational Grid’s emergency 24/7 number can be contacted on 105. Please do also let me know if you experience similar power cuts in the future.\nChristmas shopping – free evening bus travel\nBus travel will be free in the evening next week, Monday to Friday (from 19:00 until 03:00 in the morning). The free travel is part of an initiative to encourage more people on to the bus and support Christmas shopping. No ticket is needed to board and the scheme covers almost all buses across the West Midlands Combined Authority. More details can be found here.\nOut and about\nLast weekend’s commitments were curtailed by Storm Bert – I hope everyone who is reading this kept safe.\nBut on the Friday, I was fortunate enough to spend some time at the University of Birmingham to learn more about the university’s impressive work on local government finances and SEND education.\nThe University also sponsors the secondary school which shares its name in Weoley Hill / Selly Oak. Some exciting and progressive work is being done on SEND by the University, which I hope will be followed by Government. I also met the King Edward VI Foundation which sponsors two schools in the constituency.\nThis was followed by a busy surgery. I never share details of people’s cases, beyond what has been agreed. But as a general comment: it is so frustrating that people find themselves in distressing circumstances because public resources are stretched and simple things are not being done.\nOne exception to that rule, because it is a public issue, is the Primodos campaign. Primodos was a brand name for a hormone-based pregnancy test which was in widespread use from the 1950s until 1978, when it was withdrawn from sale.\nAs the Birmingham Post reported in October 1977, the old Committee on the Safety of Medicines had ‘warned that the drug can cause babies to be born malformed.’ A link between the test and birth defects has often been suggested but it has not been accepted by successive governments. A new study is currently being looked at by the Government’s advisory body.\nI met two local campaigners who are affected by the issue. After public outcry over proven injustices – Post Office Horizon and the infected blood scandal, to name but two – the demands for answers after these long years are all too easy to understand. I submitted a question on the matter in Parliament and I will look for other opportunities to raise the issue.\nI also spent time knocking on doors in Northfield this Saturday and picked up on a number of casework issues.\nNew website\nSome weeks ago, I mentioned that I was working on an updated version of the website. This is now up and running and the refreshed version can be found here: https://laurence4northfield.com/\nI hope that its usefulness has been improved. There is more information now on advice and support services, as well as ‘ready reckoner’ means for people to check if they are a constituent.\nI’m keen to hear feedback, if there is any. I am not much of a programmer but I am always on the lookout for suggestions on how my digital services could be improved.\nIn Parliament\nAssisted dying\nUnusually, the majority of MPs were in Parliament on Friday for the debate Assisted Dying Bill (formally known as the Terminally Ill Adults (End of Life) Bill).\nThis is the most sensitive of issues. As MPs, we can listen to and weigh the arguments on both sides – and I am grateful to the hundreds of people who have taken the time to write. But, ultimately, we have to each weigh the issues as best as we can, and vote according to our conscience.\nPersonally, I could not support the Bill, and I voted against it. I have serious concerns over attitudes towards vulnerable patients in parts of the NHS and the courts system, which make coercion more likely to occur.\nThese are not comfortable things to talk about, but – like a lot of people – I draw on personal experience, and I have seen it. On the detail, the proposed safeguards are flawed (in my view) even if followed to the letter: the two doctors are not necessarily truly independent from each other, and it is not clear what meaningful role the courts would play in scrutinising an application.\nIt is difficult in the space of a newsletter to do justice to the sincerely held arguments on both sides. I have written in more detail about my reasoning here. It is important that we continue to respect other points of view on this matter of conscience, and almost all the contributions so far have been in that tone.\nThere is a possibility of amendment to the Bill and I hope that at least some of those concerns can be addressed. A final House of Commons vote is expected towards the middle of 2025.\nEmployment Rights Bill\nA less public – but still crucial – part of the Parliamentary process is the ‘Bill Committee.’ These committees submit legislation to detailed, line-by-line scrutiny.\nAs of last week, I am serving on the Employment Rights Bill Committee. This legislation will bring in a range of new protections and rights at work, including the right to a regular-hours contract, day-one rights to sick pay and family leave, and repeal of much of the anti-trade union legislation of recent years.\nThis is important and diligent work, but it will limit time for speaking in other debates until the end of January. As always, my work in Parliament is public record, and the TheyWorkForYou website does a good job of making those contributions easy to follow.\nAnimal welfare\nI was glad to support the Fur Bill this week. The Private Member’s Bill is sponsored by my Labour colleague, Ruth Jones. The Bill seeks to outlaw the import of fur products.\nFur farming is already illegal in the UK - it was banned on animal welfare grounds in 2000, following a similar Private Member’s Bill. There is no such thing as cruelty-free fur. The trade is environmentally destructive and unsanitary fur farms abroad risk disease outbreaks.\nSome years ago, I worked for the Humane Society International (UK), and I am member of the Labour Animal Welfare Society.\nCauses promoted through Private Members’ Bill rarely become law, but there are exceptions. I really hope that the Bill will get government support.\nBuses inquiry\nTo report from the work of the Transport Select Committee: a new inquiry has just been launched into bus services.\nThe focus of the inquiry is on rural buses, but the final scope includes ‘services that straddle rural and non-rural areas.’ If anyone has comments about services into Worcestershire – such as the 202 or the 145/A – then I’d interested to hear about experience of those services.\nWhat do you think?\nAssisted dying is a difficult subject for many people to talk about. I include myself in that. We all bring our own experiences to this question, which can be hard to revisit.\nThere is no obligation to share your views, but the Bill has passed its first stage, and I would be interested in your views on draft law and what should happen next.\nWhat is your view of the proposed safeguards? If the Bill was to be amended, what changes (if any) would you like to see? Although Private Members’ Bills have traditionally received less scrutiny than Government legislation, there may be opportunities to raise those points later.\nAgain, thank you to all the people who have written in on this most important matter already.\nBest wishes\nLaurence Turner\nMP for Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThese newsletters are mostly written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-200924/content_36.html": "MP newsletter - CAMHS, telegraph poles, and equal pay - 17 September 2024\nDo you want to receive this newsletter first? Click here to subscribe\nGood afternoon. This newsletter is being sent out a little later than hoped, but please find the latest newsletter below. Thank you as always for subscribing.\nBirmingham news\nChildren and Adolescent Mental Health Services (CAMHS)\nOne issue that was raised on the doorstep during the election was the difficulty of accessing CAMHS services.\nI obtained some figures that prove what families are saying. The service is under real strain. There were almost 10,000 more referrals last year (an increase of 38 per cent). But the number of children and young people who are seen by the service has been steadily falling (and there was a particular sharp fall in the number of people seen within six months).\nSome of the issues were highlighted in a Care Quality Commission report on the Women and Children’s Trust earlier this year, which noted that ‘staffing vacancies … in the [CAMHS] team impacted on their ability to provide a responsive service to the emergency department.’\nBehind these numbers and reports are thousands of children and families across the city who are not getting the support they need. Although there isn’t a single cause (and I am sure that social media pressures have played a part), the increase in need for mental health support following the pandemic is mirrored across the country. That increase is also not confined to young people.\nI raised these figures in Parliament last week (you can watch the exchange below).\nService improvements need to be an ongoing priority. When CAMHS can’t keep up with referrals then demand will inevitably increase for other public services. As we push for additional investment in our communities, part of the picture needs to be the rebuilding of the primary care (preventative) services that have been lost.\nTelegraph poles\nAnother issue that several people have got in touch about is the sudden growth in the number of telegraph poles, including in (but not limited to) West Heath, Northfield, and Weoley.\nThese poles are put up directly by broadband companies. There is very little that residents or the council can do if they have concerns. This is thanks to changes to the law and associated regulations in 2013 and 2015, which removed most of the requirements for local consultation and reuse of existing infrastructure.\nI have now secured a debate in Parliament on the issue. This will be held on the evening of Monday 07 October (under the snappy title of ‘planning permission and telegraph poles’). I am glad that Ministers have separately said that ‘we understand concerns about the excessive deployment of telegraph poles, and are urgently considering options to address this.’\nWithout going into individuals’ details, I share concerns about inappropriately sited poles, and poor local engagement. Birmingham City Council has also said that one of the limited requirements on broadband companies – to inform the local planning authority 28 days in advance of an installation – has not been met. The Council said in late June that:\n‘The City Council is aware that a number of broadband poles have been installed by BRSK [broadband provider] without giving the requisite 28-day notification to the Local Planning Authority. … We have reported this matter to OFCOM. As this is now an ongoing investigation, we are not able to comment any further.’\nInvestment in broadband is no bad thing, and in some areas the installation of poles may be the right answer (particularly where buried utilities are too difficult to or expensive to adapt). The issue is the absence of any kind of fair process. I look forward to raising the matter directly in Parliament in early October.\nPolicing and crime update\nI attended a West Midlands Police briefing yesterday.\nIt is important to recognise progress where it is being made, particularly since the current Chief Constable Craig Guildford joined the force at the end of 2022.\n999 and 101 call handling and callout response times have significantly improved. More resources have been put into investigations, and the benefits of this approach were shown this week when an illegal street racing group (with strong ties to south Birmingham) was broken up.\nThe point, however, that was made repeatedly by the Police and Crime Commissioner (Simon Foster) and the Chief Constable was funding. According to one estimate, the West Midlands has the greatest gap between funding and need of any area in the country. Compared to 2010, West Midlands police has 663 fewer police officers and 1,360 fewer staff overall (a fall of about 10 per cent).\nElements of the police funding formula date back decades and doesn’t reflect the challenges that the police now face. More can be done in this area and it’s important that local police get their fair share.\nConsultations – flood defences and bus services\nI will write about the consultations in more detail, but there are two important updates.\nThe Environment Agency has restarted its consultation work on its Bourn Flood Risk Management Scheme. I understand from the Environment Agency that, this time, no ground works investigations will take place while the consultation is being undertaken. The EA is approaching groups directly, and Bournville Village Trust has provided this update:\n‘The EA have developed a new plan for consultation and engagement with residents and local organisations/groups, which will be officially launched at a FRMS Focus Group meeting taking place on Friday 04 October 2024. An Invitation to the meeting has been sent to key stakeholders including BVT Estates Committee, reps from Weoley Hill and Bournville Village Councils, and a rep from Bournville Freeholders and Leaseholders Association (BFLA).’\nThe proposed bus measures from Longbridge to Northfield, which I wrote about in the last newsletter have just now been published. The details can be found here. I will write about them in more detail in the next newsletter.\nOut and about\nI popped along to Kings Norton Farmers’ Market on Saturday, in between meetings and doorknocking. I spend most Saturdays talking to people about any matters that they would like to raise, and this Saturday we picked up a number of a issues relating to bin collections and HMO licencing in West Heath. I also attended a meeting about traffic issues in the Bunbury Road area.\nMacefield Community Garden\nMacefield Community Garden has sadly been vandalised. The community amenity is just over the (political) boundary, in the Selly Oak constituency, but it is used by people from Northfield. If you are in a position to donate to the repair fund then it can be found here.\nLibraries consultation\nJust as a reminder, in-person consultations are taking place at three out of the four libraries in the constituency over the next two weeks. I’ve been critical of how the consultation has been run, but it is really important that library users attend these session if they can.\n| Weoley Castle Library | Thursday 19 September | 15:00 to 16:30 |\n| Kings Norton Library | Friday 20 September | 10:30 to 12:00 |\n| Frankley Community Library | Wednesday 25 September | 10:30 to 12:00 |\nA summary of the latest position can be found here and my submission to the consultation, which made the case for keeping all the local libraries open, can be found here.\nIn Parliament\nEqual pay\nIt was a pleasure to welcome teaching assistants from Birmingham schools to Parliament last week, and to hear more about the ongoing talks over Birmingham City Council’s equal pay liability.\nEqual pay has taken on a special significance in discussions of Birmingham’s wider funding problems, especially since the dubious £760 million estimate was publicised. But we shouldn’t lose sight of the fact that all sides accept that pay discrimination did occur.\nWhen I was a trade union officer, I represented school support staff. They are some of the lowest-paid people in the public sector, primarily women, and they deserve better. More widely, the new Government’s pledge to reinstate the School Support Staff Negotiating Body can’t come quickly enough.\nAs talks are ongoing, it is best to wait for official updates. If an agreement cannot be reached then the issues will be heard in court in November.\nLegislation and other debates last week\nDuring the week, Parliament had the very difficult vote on the future of the Winter Fuel Allowance. I wrote about the background and my voting position at length in the last two newsletters, and I will try not to be repetitive.\nThe one update is that information on Birmingham’s support for households in hardship this winter – funded through the extension of the Household Support Fund – is expected soon. I have asked the Council for further information, and I will share it when it has been received.\nIn the meantime, you can submit an ‘expression of interest’ here, or by calling: 0121 634 7100\nThere were also debates on the public inquiry into the Grenfell disaster, and the Darzi report into the NHS. I will write more about Grenfell at a later date, as Parliament is due to debate the report in October.\nBuilding quality in south west Birmingham remains an issue that needs its own dedicated time and space. It is enough to say now that it was deeply moving to hear, in painful detail, the missed opportunities and the deceit and incompetence that allowed the Grenfell disaster to happen.\nThe Darzi report recognised that many parts of the NHS – possibly our greatest national asset - still function well, but it also recognised that the overall service is buckling. I was glad that the report identified the many causes of our current challenges, including poor housing quality, the appalling state of social care, and the rise of mental health needs that were talked about at the start of this newsletter.\n15 years ago, if you went to A&E then you were almost guaranteed to be seen within 4 hours. Today, four in ten of us are not. There will be more to say about this issue too – the problems in the NHS grew over many years, and they will take years to address. But the political appetite is there to try.\nHousekeeping\nI didn’t send a newsletter during the last period when Parliament wasn’t sitting, which left it a bit overloaded. The lesson has been learned, and I will try to provide a further update at some point over the next fortnight (Parliament sits again in October).\nI am also working on the constituency website, which was put together during the campaign, to provide more useful information about local support.\nWhat do you think?\nHave you (or your area) been affected by telegraph pole installation? If so, how would you summarise the experience? Do you think that the provision of additional broadband providers and infrastructure justifies the absence of consultation?\nIf this is an issue that affects you, or that you have an opinion on, then please let me know, as it will help with preparation for the debate in October.\nBest wishes\nLaurence Turner\nLabour MP, Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThis newsletter is mostly written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_allenscross-communitypantry/content_27.html": "St Bart’s Local Pantry and Allens Cross Community Garden\nCommunity volunteer services are more important than ever, and that is especially true of St Bart’s Local Pantry at Allens Cross Community Centre.\nThe pantry requires a subscription of £5 a week to residents who live within five miles of Allens Cross.\nIn return, members can access high-quality food of their choice once a week. The service offers excellent value for money to people who are trying to make ends meet.\nI was grateful for the chance to visit yesterday and talk to pantry members and volunteers. It was clear that the pantry provides a lifeline and an essential social space.\nLike similar organisations, the pantry relies on donations of money and suitable food. You can read more about the pantry here and on Facebook.\nI also had a chance to look at the brilliant community garden. Converted from an old playground, the garden offers a range of educational visits for local schools, as well as producing fresh food.\nIt is hard to do justice to the full range of services on offer. A number of pantry members raised specific issues, and as MP I would want to work closely with the pantry and similar services to improve access to casework support.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_bcc-question-02092024/content_64.html": "News: Birmingham City Council - Angela Rayner ‘open to representations’\nI raised Birmingham’s public services and local government funding in Parliament earlier today.\nFollowing the election, a new approach is needed to the relationship between central and local government. While there are real challenges to address in Birmingham, the terms of Michael Gove’s intervention are leading to some of the deepest local government cuts in any authority - on top of the loss of 6 out of 10 council staff.\nIt is welcome that Angela Rayner said that she wanted to take a constructive approach to Birmingham after years of Brummies being treated as political footballs. She offered to listen to a local case for a different approach to the intervention, which I will be taking up along with other local representatives.\nMy press release is below:\nBIRMINGHAM CITY COUNCIL - ANGELA RAYNER ‘OPEN TO REPRESENTATIONS’\nCommitment given in response to question in Parliament today\nAngela Rayner, the Secretary of State for Housing, Communities and Local Government, said today that she was open to ‘any representations that’ Birmingham City Council might want to make, in response to a question on funding and the Government’s statutory intervention.\nShe also stated that she ‘had no interest in using Birmingham and its people as a political football.’\nThe comments were made in response to a Parliamentary question by Laurence Turner, Labour MP for Birmingham Northfield, who asked what assessment the Department has made on the potential impact of the intervention on the provision of public services by Birmingham City Council.\nBirmingham City Council is subject to a statutory intervention under the Local Government Act 1999, following Birmingham City Council’s issuing of a Section 114 notice in September 2023.\nThe Council’s non-statutory services are planned to be subject to significant cuts in the 2025/26 under the terms of that intervention.\nCommenting on Angela Rayner’s commitments, Laurence Turner said:\n“Birmingham endured some of the sharpest cuts in the country under the previous Conservative government.\n“While difficult conversations lie ahead, there is a very strong case for looking again at Michael Gove’s intervention so that we can put the city’s public services on a more sustainable footing.\n“There was a welcome change in tone today from the new government. I was glad to secure a commitment from Angela Rayner that Ministers will engage constructively with representations on alternative ways forward.\n“I will work to make sure make sure that the strongest possible case is made for sustainable funding and Birmingham’s vitally important public services, including in Northfield.”\nNote:\nAngela Rayner said today that:\n“He is right to highlight the cuts that Birmingham has faced under the Tories and unlike previous ministers, we have no interest in using Birmingham and its people as a political football. We cannot avoid the need to make difficult decisions, but I want to work with the council leadership as well as the commissioners, and of course are open to any representations they want to make.”",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-040824/content_26.html": "MP Newsletter - violent disorder, crime and anti-social behaviour, and Enviornment Agency Plans - 04 August 2024\nSince this newsletter was sent out there have been isolated, but utterly unacceptable, scenes of intimidation, vandalism, and violence elsewhere in Birmingham.\nNo-one is above the law. Public order offences are extremely testing for the police, who must be allowed to do their job. Justice must also be done, and be seen to be done. The police have just issued a statement, including confirmation that an arrest was made for possession of a weapon, which can be read here.\nCalm heads must prevail over the coming days. There are always forces that try to divide communities but the small number who resort to violence do not represent Birmingham. I will report back on community work over the next week.\nDo you want to receive this newsletter first? Click here to subscribe\nMP NEWSLETTER – 04 AUGUST 2024 – VIOLENT DISORDER, CRIME AND ANTI-SOCIAL BEHAVIOUR, AND ENVIRONMENT AGENCY PLANS\nGood evening. Thank you for subscribing to my regular newsletter. This email– provides an update on local news and national politics. It also allows me to ask your views on important topics.\nSouthport – and violent disorder\nFor a brief moment earlier this week, it felt like the whole country was united in horror and sorrow at the senseless killing of three children in Southport, and the injuring of many more.\nLiverpool Crown Court had made the unusual decision to identify the teenage suspect, but there is much that we still don’t know about the attack. It is important that perpetrators are not better remembered than the victims: Bebe King, Elsie Dot Stancombe, and Alice Dasilva Aguiar. We remember them.\nShamefully, misinformation was spread – apparently deliberately by a few individuals – almost immediately, and then echoed by national political figures who should know better. Across the country, the far right is attempting to exploit the horrendous murders and divide our communities.\nWe have all seen the clips of people being attacked in the street for the colour of their skin. Multiple police officers have been injured. In Liverpool, a library was burned down. These scenes shame our nation.\nIt is important that the families of the victims, who have called for calm, are respected. Neither rioting nor racism must not come to the streets of Birmingham. There may be a protest in central Birmingham on Saturday 17 August. I am in contact with Hope Not Hate, and I have been in touch with community groups over the weekend. The new Government’s statement can be read here.\nBirmingham news\nEnvironment Agency – flood alleviation proposals\nResidents in the north of the constituency will be familiar with the ongoing question of the Environment Agency’s proposals to undertake new flood alleviation works in Manor Farm Park and Weoley Hill Park.\nThere is some strong local opposition to the plans, and the Environment Agency has acknowledged that consultation could have been carried out better. Initial plans for ground investigation works were scrapped in May after Bournville Village Trust launched a legal challenge.\nI spent some time this week with the Friends of Manor Farm Park Group to hear their concerns. The risk of flooding is rising, partly as a result of climate change, but it is important that any works are sympathetic, built to the best design possible, and consulted on properly.\nI am due to meet the Environment Agency later this month, and I will provide a report.\nSEND\nI won’t repeat it all here, but I have pulled together a longer report on SEND work, covering:\nAn update on the new Frankley Hill autism-specialism school\nA new upcoming report from the Birmingham SEND Commissioner\nLocal SEND appeals and Speech and Language Therapist recruitment\nLocal press coverage\nThe update can be read here.\nChildren’s Hospice funding\nThere is some good news. In the last newsletter, I spoke about children’s hospice funding. Ringfenced government funding had been withdrawn last year, although NHS England is continuing to provide funding for this year. Reliable income is particularly important for charitable organisations, including the Acorns hospice in Selly Oak, which is used by families across Birmingham.\nAfter I raised the issue in Parliament, Ministers have said that they are now looking again at the future of this funding. A serious conversation is taking place in the Department for Health and Social Care, and it is encouraging that the new Government is looking again at the issue. I will report back on any further progress.\nBirmingham City Council\nOn Friday I met John Cotton, the leader of Birmingham City Council, along with Esther Rai – the new councillor for Northfield ward. We talked about a number of important issues, including Birmingham’s budget and issues with the central government intervention, continued problems with bin collections, and SEND.\nMPs and the council have different roles – and I have always said that, in order to perform the job properly, MPs must stand apart from the council and be willing to criticise. But we must also be ready to work together in the interests of the constituency and the city, rather than getting drawn into artificial confrontations – as happened at times over the last five years.\nConstituency office set up\nWork continues apace to get the constituency office up and running. Staff are being hired – I was determined to run a proper recruitment process for all roles, which is slower than just hiring people you know, but it is important for delivering value for taxpayers’ money. A temporary office space has been identified and I hope to be able to share the address in the next update.\nDuring this time, I am replying to as many emails as I can – and taking up casework – but delays should be expected. I sometimes receive more than 200 emails a day, not including round robins, and like most new MPs I am currently working without administrative support. The constraint is temporary, but I must ask for patience during this period.\nIn Parliament\nFuel payments and the state of public finances\nSince the last newsletter, the Chancellor Rachel Reeves made a statement on public finances. A large number of people have been in touch about the plan to limit the Winter Fuel Payment to those in receipt of Pension Credit.\nThis is a very difficult issue. The universal principle is important and it should not be pulled away from unless there are exceptional and compelling circumstances. The Winter Fuel Payment was introduced by Gordon Brown in 1997 – without Labour, it would not exist at all. This is one reason why the announcement is so difficult for those of us who represent Labour. This is not a change that anyone wanted to make.\nLet’s be clear about what happened. The outgoing Conservative government:\nStored up public sector pay problems for years – leaving the NHS without the staff it needs, all of which lengthened the waiting list – and deliberately delayed the pay process until after the election by leaving it late to submit evidence to the Pay Review Bodies.\nPromised transport and hospital projects that never had a proper budget behind them. These phantom rail lines and hospitals were cynical election gimmicks. They were never real. But the pledges have added to the already serious pressure on the public finances.\nFailed to come clean about the ballooning costs of the Rwanda deportation scheme, which ran to hundreds of millions of pounds more than were ever admitted.\nThe Office for Budget Responsibility has confirmed that it only discovered these spending pressures a week before Rachel Reeves’s announcement. These spending pressures, it said, were ‘one of the largest year-ahead overspends … outside of the pandemic years.’\nAfter the Liz Truss ‘mini-budget,’ there can be no going back to the days when the Government rolled the dice on mortgages and rent payments. The state of the public finances means that more difficult decisions are to come.\nIt is important to say as well that Pensions Credit is under-claimed. By one estimate, 2,600 households in the Northfield constituency may be eligible for the credit – and by extension, the Winter Fuel Payment. The Government has promised to work with local authorities to increase the number of people who claim their entitlement, and I will work to make sure that as many people in the constituency are signed up as possible.\nFirst speech\nAn MP’s first speech – or, in the old-fashioned language of procedure, which I don’t personally like, their ‘maiden speech’ – is an opportunity to talk about their constituency, its history, and the challenges that it faces.\nI made mine this week during a debate about the future of the railways. I spoke about the communities in Northfield, public services, and a bit about my own background. If you are interested, you can read the text here. I hope that I did Northfield justice in the time available.\nIn figures\n- -35% - the fall in the number of new apprenticeships in Northfield between 2019 and 2024.\nHousekeeping\nAs Parliament is not sitting now until September, this newsletter will be less frequent. If the House of Commons is recalled at any point then a special newsletter will be sent out.\nWhat do you think?\nDo you agree that crime and anti-social behaviour has become more frequent? If so, what do you think are the reasons for the increase? Is the response as simple as providing more resources to the police (and to be clear, I do think that the police need more investment)? Do you think that Birmingham’s new road safety action plan will make a difference in respect of dangerous driving?\nAs always, your views are much appreciated.\nBest wishes\nLaurence Turner\nLabour MP, Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_crime-asb-010824/content_41.html": "Tackling crime and anti-social behaviour\nCrime and anti-social behaviour was the number one issue on the doorstep in Northfield during the election.\nNo-one should feel unsafe on their doorstep, or in their own community.\nI raised the problem in Parliament this week. The policing Minister has agreed to meet me, Simon Foster (the West Midlands Police and Crime Commissioner), and Birmingham City Council. I will push for the powers and resources that the police and council need.\nLaurence Turner (Birmingham Northfield):\nCrime and antisocial behaviour was the No. 1 issue on the doorstep during the election, and my constituents in Birmingham Northfield are paying the price for years of cuts to community services and neighbourhood policing. Figures released last week show that there was a 10% fall in recorded crime in Birmingham last year, but the number of shoplifting reports was up by a third. Will the Minister arrange a meeting with me, Simon Foster the West Midlands police and crime commissioner, and Birmingham city council, to discuss how respect orders and other measures can reduce the crime and antisocial behaviour that is blighting our communities?Diana Johnson (Policing Minister):\nMy hon. Friend is absolutely right about this being one of the top issues on the doorstep during the general election campaign. It is worth reflecting on the fact that the powers in the Anti-social Behaviour, Crime and Policing Act 2014 actually weakened the response to antisocial behaviour, and for far too long the Conservatives wrote this off as just low-level crime. That is why we are introducing respect orders and stronger powers for the police to tackle persistent antisocial behaviour offenders and get them out of our town centres. Of course I would be happy to meet my hon. Friend to discuss this issue.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_send-socials/content_35.html": "SEND matters\nSEND (Special Educational Needs and Disability) is a cause that is close to my heart.\nProblems with accessing support have been raised by dozens of people on the doorstep and I know that the issue affects thousands of families in the Northfield constituency.\nI was a SEND pupil. I have lifelong differences that affect the way I approach each day. Things weren’t always easy growing up. But I was fortunate at key moments to benefit from support and services.\nThe hard truth is that far too many families struggle to access the same assessments and support today.\nThe founders of S.E.N.D Socials Birmingham took the time to talk about their work yesterday. The not-for-profit, Community Interest Company was founded when parents made contact on Facebook six years ago.\nNow the S.E.N.D Socials network provides an online space for families to share their story and advice. It also organises regular meetings and social events (including visits) for children and parents.\nWe spoke about some of the many problems in the current system, including:\nDelays in securing assessments and Education, Health and Care Plans (some 40 per cent of applications for an EHCP are not responded to in Birmingham within the 20 week target)\nThe stress and exhaustion that that families and pupils experience when they are forced to fight for an ECHP in the first place, and then for it to be implemented\nFamilies’ struggles to secure appropriate, full-time placements, which is forcing some parents and carers to reduce their working hours or drop out completely\nCuts to school transport services for older SEND pupils\nTeacher training and general awareness of SEND, including sensory adjustments\nShortages of teaching assistants and speech and language therapists\nThe conflict between schools’ duties to make reasonable adjustments and some uniform, attendance, and disciplinary policies\nThe under-funding of SEN Support (the category that covers pupils who are identified as having additional learning needs but who do not have an EHCP) is also a serious concern.\nIf I am fortunate enough to be elected as MP then I want to be a local advocate for SEND. And if I was to secure one new national policy, it would be reform of SEND provision.\nThe current system is too confrontational, and money is not reaching those who need it. Children’s life chances hang on seemingly arbitrary decisions and delays.\nThere will be a lot more to say on this subject. But we can only start by listening to SEND pupils, adults, and their families.\nI’m grateful to S.E.N.D Socials for taking the time to meet and explain their important work. I hope to meet other local groups in the weeks ahead.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_remembrance-day-2024/content_61.html": "Remembrance weekend\nCommunity\nIt was an honour to join deeply moving remembrance services this weekend.\nThe number of services in the constituency is a credit to the strength of our communities.\nRepresenting Parliament, I laid wreaths and tied remembrance ribbons at the services in Frankley, Longbridge ExtraCare Village, Kings Norton Farmers’ Market, and the Quarry Lane Royal British Legion Austin Branch (Northfield).\n’At the going down of the sun and in the morning.\nWe will remember them.’\nThanks are due to the organisers: New Frankley Parish Council, God’s Heart for Longbridge, Kings Norton Farmers’ Market, and Royal British Legion Austin Branch Northfield.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_highstreets/content_67.html": "Supporting our high streets\nI visited Kings Norton Farmers Market on Saturday.\nThe market hosts small business from the local area and Birmingham more widely. It is well worth a visit (and a chance to sample some of the best products from local traders).\nUnfortunately, our high streets are suffering. This is particularly true of Northfield high street.\nNorthfield was denied a £11.4 ‘Leveling Up’ bid to revitalise the high street last year, despite raised expectations from the Conservative MP. All Birmingham’s bids were rejected in what the Birmingham Mail called a ‘huge blow’ for the city.\nSimon Foster (pictured), Police and Crime Commissioner for the West Midlands, and I spoke to shopkeepers about Labour’s plans to lift our high streets by:\nTackling crime by investing in neighbourhood policing and making sure more shoplifting cases are investigated.\nSetting fair rates for small businesses - we would scrap the antiquated business rates system and level the playing field with the internet giants.\nSpeed up late payments for businesses through new legal requirements.\nIntroduce new guarantees that face-to-face banking services will be available in communities like Northfield.\nGive community associations a ‘right to buy’ disused and boarded up shopfronts.\nLabour has an excellent candidate in the Northfield by-election - Esther Rai - and together we picked up casework around anti-social behaviour and flytipping.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_animal-welfare-24/content_52.html": "Animal welfare - fur imports\nParliament\nI was glad to support the Fur Bill - sponsored by my Labour colleague, Ruth Jones. The Bill seeks to outlaw the import of fur products.\nFur farming is already illegal in the UK - it was banned on animal welfare grounds in 2000, following a similar Private Member’s Bill. is no such thing as cruelty-free fur. The trade is environmentally destructive and unsanitary fur farms abroad risk disease outbreaks.\nSome years ago, I worked for the Humane Society International (UK), and I am member of the Labour Animal Welfare Society.\nCauses promoted through Private Members’ Bill rarely become law, but there are exceptions. I really hope that the Bill will get government support.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_ofcom-investigation/content_40.html": "Ofcom investigates south Birmingham broadband rollout\nPress release\nOFCOM INVESTIGATE BRSK’S COMPLIANCE WITH PLANNING PROCEDURES IN BIRMINGHAM\nLaurence Turner MP: “Much better community engagement needed over telegraph pole installation”\nOfcom has announced an investigation into whether the broadband network provider BRSK properly informed Birmingham City Council prior to installing telegraph poles.\nIn May 2024, Ofcom received a complaint and supporting evidence from actions taken in the Birmingham City area which suggested BRSK may have breached regulations established in the Electronic Communications Code. This forms the rules that broadband companies must follow when installing telegraph poles.\nIn relation to the investigation, the Electronic Communications Code sets out regulations to consult with local planning authorities and stakeholders, and requiring code operators to give twenty-eight days’ written notice to the local planning authority.\nLaurence Turner, Member of Parliament for Birmingham Northfield, said:\n“Proper community consultation needs to accompany the important extension of broadband infrastructure.\n“A number of residents have raised serious concerns over the quality of local engagement and notification. Under existing rules there are limited requirements on broadband companies, and this investigation is welcome.\n“Much better engagement is needed over telegraph pole installation. I am glad that Ministers have recognised that there are legitimate concerns over the inappropriate siting of some telegraph poles.\n“I have secured a debate in next week in Parliament on this issue, which I hope will signal the need for the rules to be looked at again and for providers to improve their practices.”",
  "https_laurence4northfield_com_/https_laurence4northfield_com_acceptable-use/content_9.html": "Office standards\nAcceptable use policy\nI understand that people may act out of character in times of trouble or distress. There may have been upsetting or distressing circumstances leading up to a constituent approaching my office.\nHowever, I will not tolerate abusive behaviour nor actions that result in unacceptable or excessive demands on my staff in that it prevents them from carrying out their duties effectively.\nIt is these behaviours and actions that I aim to manage under this Policy. In a small minority of cases, it may be necessary to apply restrictions on engagement in order to protect staff and ensure the continued availability of constituency office services.\nAggressive or abusive behaviour\nIf anger or frustration escalates into aggression towards my staff, I consider that unacceptable. Any violence, threats, or abuse towards staff will not be tolerated.\nViolence is not restricted to acts of aggression that may result in physical harm. It also includes behaviour or language that is threatening or abusive.\nI will judge each situation individually based on the circumstances of each case.\nUnacceptable language is that which:\nIs offensive, derogatory, or patronising;\nIs discriminatory in any way; or\nMakes serious allegations that individuals have committed criminal, corrupt, or perverse conduct without any evidence.\nI may decide that comments aimed not at my staff but at me or third parties are unacceptable because of the effect that listening or reading them may have. Examples include rudeness, offensive comments, derogatory remarks, making inflammatory statements, or raising unsubstantiated allegations made towards these third parties. Such comments may be made on social media or other third-party platforms.\nAll threats against either my staff will be taken very seriously and if staff feel scared or threatened at any point during a conversation with a constituent, the interaction may be ended at any time.\nUnreasonable demands\nA demand becomes unacceptable when it starts to (or when complying with the demand would) impact substantially on the work my staff carry out on my behalf.\nExamples of this behaviour include:\nRepeatedly demanding response within an unreasonable timescale;\nInsisting on seeing or speaking to a particular member of staff, when that is not possible;\nRepeatedly changing the substance of a complaint or raising unrelated concerns;\nMaking repeated and unnecessary contact during the course of us dealing with a complaint or carrying out an investigation;\nRefusing to accept a decision where explanations for the decision have been provided.\nAn example of such impact would be that the demand takes up an excessive amount of staff time and in doing so disadvantages other constituents and prevents their own complaint from being dealt with quickly.\nUnreasonable levels of contact\nSometimes the volume and duration of contact made to my office by an individual may cause problems. This can occur over a short period, for example, a number of calls in one day or hour.\nIt may occur over the life-span of a complaint when a constituent repeatedly makes long telephone calls to us or inundates us with copies of information that has been sent already or that is irrelevant to the substantial matter raised.\nI consider that the level of contact has become unacceptable when the amount of time spent talking to a constituent on the telephone, or responding to, reviewing, and filing emails or written correspondence impacts on my offices’ ability to deal with that matter, or with other constituents’ issues.\nHarassment\nMy staff have the right to carry out their duties free from harassment or threats of harassment. I ask everyone to respect that my staff are delivering a service on my behalf and therefore this may not reflect their own views or preferences.\nExamples of behaviours I consider to be harassment against my office include:\nRecording telephone discussions and publishing the information online such as through YouTube, Facebook or Twitter;\nContacting staff using their personal details or social media profiles such as Facebook, Twitter, or LinkedIn;\nPublishing personal, sensitive, or private information about staff online or other public domains such as noticeboards or newsletters.\nExamples of unacceptable or persistent levels of contact can include:\nContinuous contact while my office is in the process of considering a matter,\nRepeated telephone calls over a short period, for example, a high number calls in one day or week,\nLengthy telephone calls repeating the same points of discussion,\nHigh volumes of information provided by email or post referencing the same issues,\nUnnecessarily or excessive copying us into emails to other parties.\nActions I may take\nWhen my office experiences behaviour or demands which are unacceptable, I may consider taking more formal action. The actions I will consider can include the following:\nWarning the constituent about their behaviour and requesting that the constituent modifies their behaviour in future contact with us.\nAppointing a specific point of contact for the constituent\nCommunicating only in writing or via a representative\nDeciding not to investigate a representation on the basis that it has been pursued in a way that is unacceptable.\nStop all communication with a constituent\nRestricting or limiting contact\nWhere it is decided that formal action must be taken to manage someone’s behaviour I or my office, will inform them of the decision in writing. A note will be placed on our records to this effect.\nOctober 2024",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_friends-bw/content_30.html": "Friends of Balaam’s Wood\nFrankley Great Park\nCommunity\nIt was good to meet volunteers from the Friends of Balaam’s Wood group on Thursday.\nThe group builds improvements in the woodland such as bridges and benches. They maintain the quality of the woodland and they conduct regular litterpicks. The group also help to monitor water quality in the River Rea and they keep a community orchard.\nBalaam’s Wood is a beautiful natural and community resource. But reductions in park ranger services pose real challenges to volunteer groups’ ability to make improvements to these public spaces.\nWe need to protect our natural environment, and I want to work with our volunteer groups so they can continue to make our woodlands accessible to the community.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_christmas-opening-hours24/content_47.html": "Office Christmas / New Year opening hours\nParliament\nThe constituency office will be open as usual until the end of this week (Friday 20 December).\nThe office will reopen on Thursday 02 January. Electronic messages will be monitored for emergency casework over the Christmas break.\nIf you need to get in touch then the contact details are:\nemail: laurence.turner.mp@parliament.uk\nphone: 0121 516 5770\nWishing people a Merry Christmas.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_fairwaydc-161024/content_53.html": "Fairway Day Centre - joint statement\nWe are extremely concerned about the proposal to close the Fairway Day Centre.\nCombined with the planned closure of Harborne Day Centre, there won’t be an alternative centre within four miles.\nSome residents have spent decades in the care of Fairway and their families are understandably concerned that suitable alternatives won’t be found.\nWe have listened to the families of residents who feel that the service has not been adequately advertised in recent years, and that their voices have not been heard during the consultation process.\nWe urge that the long-term costs are taken into account so that residents get the care they need, and ratepayers don’t end up paying more for less.\nLaurence Turner\nMP for Birmingham Northfield\nCarmel Corrigan\nCouncillor for Kings Norton North",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-141024/content_31.html": "MP newsletter - day care centres, renters’ rights, and West Midlands Fire Service - 14 October 2024\nDo you want to receive this newsletter first? Click here to subscribe\nGood morning. I’m afraid that this week’s newsletter is much shorter than usual due to illness. Normal service will hopefully be resumed next week.\nBirmingham news\nI am very concerned about the proposed closure of the Fairway Day Centre in Kings Norton, which is due to be discussed at Birmingham City Council’s Cabinet on Tuesday.\nThe Council’s own equality impact assessment acknowledges the ‘potential adverse impact’ on disabled users of the service. Combined with the proposed closure of Harborne Day Centre, the closest council-run service will be in Moseley – more than four miles away.Further consultation will follow if the decision is approved on Tuesday, and I am working with Carmel Corrigan, Councillor for Kings Norton North, to make representations to the Council.\nI’m glad to report that my debate on ‘planning permission and telegraph poles’ – which was delayed last week to commemorate the first anniversary of the October 07 attacks – has been rescheduled for this Thursday.\nThe debate will likely be held at about 16:00, depending on other Parliamentary business. It will be streamed on this link.\nMy team met BRSK during the week and we are working to raise individual cases, although the root problem is a lack of national requirements on broadband companies.It was really good to welcome students from the James Brindley schools (including Northfield) to Parliament this week. James Brindley is a specialist group of academy schools, which offers placements to pupils outside of mainstream settings. The pupils asked some engaged questions – on everything from Parliamentary procedure to votes at 16 – and I look forward to visiting the school.\nIn a recent newsletter, I praised recent improvements that had been made at West Midlands Police under the leadership of the Police and Crime Commissioner and the Chief Constable.\nThis can only stand in contrast to the West Midlands Fire Service. Over the course of the last few days, the Interim Chief Executive was suspended, and he has now resigned, following a ‘Section 5’ report which alleges that a senior finance officer was unlawfully removed. The Authority’s Chair has also resigned. The story is developing and it is essential that services are not affected.\nIn Parliament\nMPs debated a really important piece of legislation last week – the Renters’ Rights Bill. The legislation will outlaw Section 21, ‘no fault’ evictions in the private renting sector, which has left some tenants afraid to raise insanitary housing problems like damp and mould, while others have been left homeless with no explanation at all. Such evictions are also a major draw on local government finances, as councils are obliged to provide emergency accommodation.\nThe Bill also seeks to end bidding wars, and sets new minimum standards for the quality of rented accommodation – a Decent Homes Standard. The Bill faced some opposition but I was glad to vote for it.The Government has also just published the Employment Rights Bill. This bill is a landmark in the history of employment law – it represents possibly the biggest single step forward ever for rights at work. I worked on this agenda over several years as a trade unionist, and I want to do it justice in the next year. For now, it is enough to say that the changes will make a real, and positive difference to thousands of people in the constituency, and I can’t wait to argue for it.\nI spoke on private school fees and VAT – and made the point that per pupil funding in Birmingham state schools fell by £179 over the last five years. Locally, this is leading to staff being let go, and plans to buy new equipment or invest in buildings are being put on hold.\nRaising between £1.3 billion and £1.5 billion from private school fees is, I think, the right policy. We already tax private healthcare insurance, which helps to fund the NHS. More information will be published at the Budget on 30 October. You can read the contribution here.I also spoke on the supply of aid to Gaza. Earlier in the week, MPs marked the one year anniversary of the October 07 atrocities, which I was glad to make that possible by moving my own debate.\nNow, more than 40,000 Palestinians have been killed, and the UN has just reported that no food has entered Gaza in October. The number of aid trucks had fallen to just a tenth of their pre-October 2023 rates, imposing the spectre of famine across the territory. The horrifying situation demands both a political and a humanitarian response. You can read the contribution here.\nBest wishes\nLaurence Turner\nMP for Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThis newsletter was mostly written at the weekend alongside domestic duties so please excuse any typos.\nImage credit - Wikimedia Commons.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_sharkey-rea/content_46.html": "Pollution in the Rea\nI was very glad to be joined on the campaign trail by Feargal Sharkey.\nFeargal is a prominent environmental campaigner who in recent years has dedicated himself to cleaning up our seas and rivers.\nA lot of investment has gone in to turning the River Rea into a true community amenity, and volunteer groups have opened up the Rea to more people. Volunteers also help to monitor water quality.\nUnfortunately, pollution is a serious problem. There were an estimated two sewage discharges each day into the Rea last year, while Severn Trent’s Chief Executive received a package worth £3.2 million.\nLabour will:\nGive regulators powers to block the payment of bonuses to executives who pollute our waterways and bring criminal charges against persistent law breakers.\nImpose automatic and severe fines for wrongdoing and ensure independent monitoring of every outlet.\nAs a trade union official, I’ve worked with water company staff and Environment Agency workers who are sick of the rule-breaking and short-cuts that are degrading our natural environment.\nI’m proud to a member of SERA - Labour’s environmental campaign - and I’m grateful to Feargal for visiting Northfield and meeting some of the volunteers who are working to maintain and improve the Rea.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_birmingham-bombings-50/content_58.html": "Birmingham pub bombings - 50th anniversary\nCommunity\nMy thoughts are with all the loved ones of those who lost their lives, the survivors, and those still affected by the events of that day.\nToday marks the fifty-year anniversary of the Birmingham pub bombings. Twenty-one people never returned home and more than two hundred people were injured.\nMany more in the city, not least families and friends of the victims, suffered psychological wounds that persist to this day.\nBehind each of the twenty-one victims is a story of loved ones, a life lived, and of a life to live.\nI want to praise the work of those who have kept the pursuit of justice alive.\nJustice has eluded the victims, and their families, for fifty years after this terrible atrocity.\nThe fight for justice must continue.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-030225/content_2.html": "MP newsletter - youth services, crime in Kings Norton, and transport investment - 03 February 2025\nDo you want to receive this newsletter first? Click here to subscribe\nGood afternoon and thank you as always for subscribing to this newsletter.\nUpdate\nSince this newsletter was sent by email, two important local pieces of news were announced.\nCouncil tax\nOn Monday, the Goverment announced local government funding details for April - including council tax.\nCouncil tax in Birmingham will rise by 7.5% - which is high but lower than expected. This is because Ministers rejected another 10% rise, which the previous Conservative Government allowed and planned to repeat this year.\nI know that this is still a significant increase. If you are think you may be eligible then please look at applying for a reduction or exemption.\nOne thing people tell me again and again is that they need better services at a time when the rates are going up. They are right to do so. The improvements to youth services are a start, but there is a long way to go.\nThe Labour Government also confirmed that Birmingham is set to receive one of the biggest funding increases in the country - after fourteen years of some the biggest funding cuts under the Tories.\nProgress has been made since July and we no longer have a Government that is set on punishing the city - people now need to start seeing the difference.\nBins - industrial action\nUnite (the union which represents most refuse workers) announced a trebling of strike days.\nThe strike was already having a disruptive effect on collections, which is now likely to increase. If you have missed collections then I may be able to help - please see details below.\nThe Council has confirmed that it is still talking to Unite, and provided the following updates:\nDuring the extended period of industrial action, contingency measures include:\nsuspension of recycling collections every day during this period of industrial action\nwe aim for every resident to receive one collection of their bin per week\nwe will continue to collect neatly bundled side waste, this could include cardboard and newspaper. Make sure you place any excess waste in black bags and position neatly next to your household waste wheelie bin. Bin lids need to be closed, to reduce the risk of damage to bins and vehicles, and an increase in waste spillage\nresources will be stretched and will be focused on our housing blocks and houses of multiple occupation. Assisted collections will continue.\nI think it is known that I am a former GMB union official, and I have always worked to promote constructive industrial relations in the city (including over equal pay). In my experience, the only parties at this point that can resolve a strike are those round the negotiating table. It is important that the dispute is resolved as soon as possible.\nIf your collection has been missed then please feel free to contact me on: laurence.turner.mp@parliament.uk or by calling the office on 0121 516 5770. I will need details of your address for escalation with the Council.\nBirmingham news\nBirmingham budget\nBirmingham City Council’s budget proposals are expected latre today. The details are expected to reflect both the scale of the city’s remaining financial challenge, and the better-than-expected funding settlement in December.\nI spoke to ITV on Friday about the need to protect as many services as possible so that reductions can be reversed at a later date, and the need for funding that reflects Birmingham’s level of need.\nFunding rules – the formulas – are very complex and take time to change, but the Government is consulting on a new formula to better reflect deprivation. This change is urgently needed after Birmingham lost more than 40p in pound for each person in the city, accounting for inflation.\nI will give an update on the budget proposals and their implications for communities in the Northfield constituency as soon as possible.\nGood news on youth services\nCredit where it is due – there has been some very good news for Birmingham’s youth services and the threat of closure has been lifted.\nThe Council has announced that ‘all youth centres will remain open and will either be retained by Birmingham City Council or partner organisations,’ including the Factory and the 3 Estates project.\nThere will be ‘an increased number of full time and part time permanent posts with no planned youth centre closures.’ New specialist SEND posts are being created. The Council has been able to increase front-line service by sharing administrative support with other departments and securing new NHS funding.\nThis is exactly the kind of imaginative thinking we need. And in light of youth crime challenges (recorded youth crime is the only category that is growing), the outcome is incredibly important for the community. I have written to the Council to ask for more details on the future of the 3 Estates Youth Project and The Factory at Longbridge, and I will share any response that I receive.\nInvestment in Kings Norton railway station\nAs readers of the last newsletter will know, I am working with local councillors and the neighbouring MP, Al Carns, to try to get investment into Kings Norton Station.\nAfter a number of delays, it looks like the reopened Camp Hill Line is on track for the end of this year. Services will run to Kings Norton, restoring 6 trains an hour. This is good news for Kings Norton - but without investment in the middle platform and a turnaround facility, the rest of the Cross-City Line can’t be restored to its previous frequency.\nIn other words, we need this investment for Northfield and Longbridge stations too.\nOnly design works have been funded up to this point. A decision on the capital funding is now due. Regional press coverage and our joint letter to the Government can be found here (and the ITV coverage is below).\nNorthfield Beach\nNorthfield Community Partnership are fundraising to try to bring the Northfield Beach back for 2025.\nIf you are in a position to make a donation then please consider doing so. The fundraising link is here and more details can be found here.\nSchool improvements\nCongratulations to King Edward VI Balaam Wood Academy in Frankley and Turves Green Boys’ School on being named as the most and the tenth most improved schools in the West Midlands.\nOn schools, I recently met the Schools Minister, Stephen Morgan, to push for investment in local schools. It was also really good to meet staff and pupils from St Columba’s Catholic Primary School, and answer questions.\nParliament belongs to the whole nations and all pupils should have the opportunity to visit. If there are any local schools that don’t have trips to Parliament planned then please feel free to get in touch.\nCleaning up Prices Square and Longbridge flats\nEarlier this month, I joined Labour volunteers and local councillor Esther Rai to clear up the land next to Prices Square, off Nothfield high street.\nWe cleared 21 sacks of waste which were all properly secured and reported to the Council, which collected them. Representations have been made about long-term improvements to the site.\nMy office often respond to flytipping reports, and I’m glad to be able to report that - after some confusion about land ownership had prevented action for some time - the extensive flytipping outside the flats at the bottom of Bristol Road has now been removed.\nIf there are unresolved flytipping problems in your area then please get in touch: laurence.turner.mp@parliament.uk or 0121 516 5770.\nOut and about\nRecently, I’ve be out talking to businesses on Northfield high street about shoplifting, and meeting with local healthcare professionals who are concerned about the Assisted Dying Bill, Local Trust (about potential funding for community projects in the constituency), West Midlands Mayor Richard Parker, Jaguar Land Rover about employment prospects in the West Midlands, and Birmingham City Council about local SEND issues and youth services.\nI also held a busy and well-attended surgery with my casework team. I spend each Saturday talking to residents about any issues that they want to raise. Over the last few weeks, I’ve been knocking on doors and letting people know how to get in touch in Kings Norton (North and South wards), Weoley Castle, Northfield, and Allens Cross.\nIn Parliament\nRights at work\nFor the last two months, I have been busy in the Employment Rights Bill scrutiny committee. This important part of the Parliamentary process normally doesn’t get much publicity, but it is a very important part of the work of MPs. I ended up making the most contributions of any Labour backbencher in December, largely as a result of work on this committee.\nI’m glad to be able to say that the Bill has been improved (and a number of technical issues addressed). It has taken a lot of time. It was well-spent, but now that it is over, there will be more time for activity like bringing debates (and writing newsletters). I intend to write up a fuller report on that work so you can know how your MP’s hours are being spent.\nChildren’s Wellbeing Bill vote\nSome recent debates have shown Parliament at its best. I am afraid that the recent vote on safeguarding measures for children was not one of them.\nAs so much ink has been spilled on the subject, I will just say this: because of the way the Conservative amendment was worded, a vote for it would have meant that protections for children (such as mandatory reporting) would have been dropped. It was deliberate, and to use direct language, it was dangerous, gutter politics.\nIf anyone wants to know more about my position, you can read more about it here.\nSEND\nSEND was debated again in Parliament. There were so many MPs that wanted to speak that we had 75 seconds each! On one level, this can only be a good thing to have so many MPs now who want to take up the issue.\nMy contribution can be watched or read here or below. It was impossible to say everything that needed to be said, but there will be much more to say on this most important subject during this Parliament. I hope that at some point we can have a dedicated debate on SEND in Birmingham or the West Midlands.\nCycling and walking\nI know that there’s a lot of interest locally in projects to make it more convenient and safer for people to cycle and walk for work and leisure. I try to draw on that local experience when I ask questions on the Transport Select Committee.\nPrevious newsletters have talked about the hoped-for extension of the A38 cycleway extension from Selly Oak to Longbridge, which is currently being designed and which I want to see succeed (for the avoidance of doubt, there would be consultation on those plans).\nChris Boardman – who now heads the Government transport body, Active Travel England – gave evidence on Wednesday.\nA couple of years ago, the then Conservative Government cut funding for road improvements by £800 million, or two-thirds. This was mainly to local authority grants.\nWhen I asked him about the effect of those cuts, Chris Boardman accepted that the reduction meant that (a) fewer people are now cycling and (b) walking and cycling targets are ’extremely hard to hit.\nA new strategy is due soon and I hope that it will set out secure, long-term funding so that more improvements like the Bristol Road cycleway extension can go ahead.\nYou can watch or read the exchange here or below.\nInternational\nFreedom of Religion and Belief\nThank you to all the constituents who contacted me in support of Open Doors’ campaigns.\nBack in September, and on the strength of those representations, I raised the Special Envoy on Freedom of Religion or Belief post with Ministers. I am really glad that its future has been confirmed. I attended the launch of the World Watch List 2025 report and spoke to the new Special Envoy, David Smith, about the persecution of Christians and other people of faith around the world.\nPalestine\nA fragile peace now holds in Gaza. Hundreds of thousands of people are returning to the fragments of their homes amid scenes of almost unimaginable devastation. Hostages are also being released after being held – it seems mostly underground – for more than a year. Aid is starting to arrive now, including through the Rafah crossing (I understand that UK Ministers played a role in the crossing’s reopening) although for thousands of people, it is arriving too late.\nI am appalled that this fragile peace in the Gaza strip has been matched by violence and calls for annexation in the West Bank. These issues affect our communities here, in Northfield. I recently raised one such case in Parliament, with the permission of the constituent affected. I have raised humanitarian causes in Palestine since being elected and I will continue to do so.\nWhat do you think?\nYouth violence is the only category of recorded crime that is going up. The word ‘recorded’ is important, because the figures never tell the whole story.\nIt is good news that youth services staying open. The police are also starting to visit primary as well as secondary schools. But what other steps do you think should be taken? I am sympathetic also to calls to change new kitchen knives (or ‘rounding’), but do you think this is practical?\nAs always, please feel free to share your thoughts in confidence.\nBest wishes\nLaurence Turner\nMP for Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nThese newsletters are mostly written at the weekend alongside domestic duties so please excuse any typos.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_newsletter-230724/content_16.html": "| Library | Date | Time |\n|---|---|---|\n| Frankley Community Library | Wednesday 25 September | 10:30 to 12:00 |\n| King’s Norton Library | Friday 20 September | 10:30 to 12:00 |\n| Northfield Library | Monday 02 September | 15:00 to 16:30 |\n| Weoley Castle Library | Thursday 19 September | 15:00 to 16:30 |\nMP Newsletter - council cuts, SEND, and international - 23 July 2024\nDo you want to receive this newsletter first? Click here to subscribe\nMP NEWSLETTER – 23 JULY 2024 – COUNCIL CUTS, SEND, AND INTERNATIONAL\nGood evening. Thank you for subscribing to my regular newsletter. This email – which is a little later this week and next – provides an update on local news and national politics. It also allows me to ask your views on important topics.\nBirmingham news\nCommissioners and Section 114\nThe documents for Birmingham City Council’s meetings contain a lot of new information – not all of it welcome.\nThe latest bad news takes the form of a warning from the Commissioners that the council faces a ‘deteriorating’ financial position. According to a report by the Council’s Head of Financial Planning, new costs of more than £50 million have emerged – which mostly relate to complex children’s care, and higher inflation.\nThis cost is greater than the savings (or, in many cases, cuts) that been identified for next year’s budget. Combined with an existing shortfall, it means that Councillors were told at a meeting today that up to £79 million in additional cuts need to be found from next year’s budget.\nThe advice can be found in this document (be warned, the wider file runs to nearly 800 pages). I am concerned that the warning is based on some assumptions that look, to say the least, questionable. For example, they assume that central government support for local government will not grow at all during this Parliament. But the latest sobering claims do contrast with more positive reports about recent discussions between the city and the new Government.\nThere is still a lot that we don’t know, and I have been trying to get some answers in Parliament. Responses from Ministers show that:\nThe Commissioners handed their ‘formal report’ about Birmingham to Michael Gove on 26 April – it is not clear why the report was then sat on for the month leading up to the election, but it should be published soon.\nThe Government does not hold an updated estimate of Birmingham’s equal pay costs, despite the fact that those costs are widely reported (including by Max Caller, the Lead Commissioner) to be over-stated.\nAn equality impact assessment was carried out on the decision to allow Council Tax to rise by more than 10 per cent.\nI have followed up with more questions and requests under the Freedom of Information Act. People should have a right to basic information about the process that is having such a negative impact on them, and Birmingham’s public services.\nSEND\nI spoke to the BBC (Midlands Today) about local SEND provision for a news item, which will hopefully be broadcast on Friday. SEND is an issue that is close to my heart. Too many children and their families find themselves locked in confrontation to get the support they need.\n2024 marks the ten-year anniversary of the legislation which created the current system. As the Children’s Commissioner has said, it created ‘a complicated system that is too often adversarial.’ I obtained figures this week which showed that, in Birmingham, 97% of parents’ appeals against a local authority decision that make it to a hearing are successful. Cuts to transport services, particularly for 16-18 year olds, are causing real pain for families and forcing some parents and carers to make impossible choices.\nThe new Government has made some positive statements. Bridget Phillipson, the Education Secretary, has said that SEND will be a priority, even if the issue received ‘less attention’ during the election. Keir Starmer has stated that:\n‘Our councils [were] pushed to the brink by the previous Government and [are] now unable to deliver even basic services to children with special educational needs.’\nThis is a positive start. A system built over ten years is not going to change overnight. But I have been heartened by the number of new MPs who said that they would make SEND a priority. We need a less confrontational and more compassionate approach to SEND, and there will be much more to say about this issue over the months ahead.\nInvictus Games\nOne item of good news for the city is that it will host the 2027 Invictus Games (at the ICC). Congratulations to those involved. It is important that the event raises the profile of disability sport within Birmingham, including beyond the city centre, and I look forward to working with the event organisers to try to extend some of the benefits of the games to Northfield.\nLibraries\nI said in the last update that I would share my submission to the consultation on the future of Birmingham’s libraries. The response can be found here. Libraries rightly occupied a lot of space in last week’s newsletter, which I won’t repeat, but it is important to state that the consultation is not over yet.\nThe next stage will take the form of drop-in sessions at the libraries. There is no need to book an appointment to speak to an official. If you are able to attend your local session (they are during the working week) then I’d encourage you to do so.\nChildren’s Hospice funding\nA number of people have been in touch about the future of funding for children’s hospices. The Acorns Hospice is just over the constituency border, in Selly Oak, but it is used by children from across Birmingham and beyond.\nThe Children’s Hospice Grant was established in 2008 to provide dedicated funding. The Grant never accounted for the majority of hospices’ funding, but guaranteed income is extremely valuable to organisations that otherwise rely on uncertain donations and bequests.\nThe Children’s Hospice Grant was scrapped last year. NHS England is providing interim funding, but its future is unclear. I have raised the issue in Parliament and I hope to visit Acorns soon.\nIn Parliament\nThe King’s Speech – the new Government’s legislative agenda – was published on Wednesday. After the last wasted months of the previous Government, when Parliament drifted aimlessly with a dwindling majority and few laws to debate, it felt like a sense of purpose had returned to Parliament.\nThe King’s Speech announced 40 new laws. It would be a mistake to try to do justice to them here (the briefing notes alone run to 104 pages). There is no shortage of issues for us to work on. Some measures which I was particularly pleased to see announced are:\nThe Employment Rights Bill which will enshrine Labour’s New Deal for Working People in law. For me, the Bill is a charter for dignity and respect at work. It will address the race to the bottom which means that, for most people, their wages don’t go as far as they did 15 years ago.\nAverage wages in Northfield have fallen by a shocking £300 a month since 2010, after inflation. I was particularly pleased to see two lesser-heralded measures in the Bill: the School Support Staff Negotiating Body, and the Fair Pay Agreement in adult social care, which will establish new minimum rates of pay for around 3,000 low-paid workers in the constituency.\nA law to bring passenger rail services into public ownership. I worked on rail policy for four years, and John Mayor’s privatisation was a bungled and ideological disaster that has cost the taxpayer billions. The Bill will be debated for the first time on Monday, and I hope to speak in support.\nA Children’s Wellbeing Bill which will establish free breakfast clubs – open to all children – in every primary school, and require all schools to co-operate with councils on SEND inclusion. As always when Parliament is sitting, I am asking questions to establish new information about the state of local services (examples below). I’m glad to have also secured a question on anti-social behaviour on Monday, which was perhaps the single-most raised issue on the doorstep during the election.\nIn figures\n- 3 GP surgeries and 7 Sure Start Children’s Centres closed in Northfield under the 2010-2024 Government.\nInternational\nThe focus of this newsletter is local and national news – but that doesn’t mean that we can look away from the world outside our borders.\nA number of constituents have written to ask about my position on Israel and Palestine. I spoke on this issue in Parliament this week – you can watch the question below.\nIn my former role, as an official of the GMB trade union, I extended solidarity to trade unionists affected by the conflict, and helped raise thousands of pounds for Medical Aid for Palestinians. One of my first acts as an MP was to ask the new Government if it would resume the UK’s funding of the UN Relief and Works Agency (UNRWA).\nThe positive decision to resume funding is an important step. UNWRA is the only agency with the ability to deliver aid at scale on the ground. I wanted to raise an important, but perhaps neglected issue: the status of Palestinian workers in Israel, and I was heartened to receive a positive response. It is vital that political pressure is applied internationally for an immediate ceasefire, the release of hostages, and for progress towards a lasting peace and a two-state solution.\nYou can read more here.\nHousekeeping\nParliament stops meeting from next Tuesday until September – although, for me and the other new MPs I have spoken to, it will not be a holiday – and the next newsletter will be sent out shortly after to capture all events in the House of Commons before it breaks.\nWhat do you think?\nAre you affected by the state of SEND services? The Government’s SEND Commissioner says that things have got better in Birmingham over the last two years – does that reflect your experience? What would your priorities for changing the SEND system be?\nI want to keep applying political pressure on this issue – particularly from September, when MPs can apply to secure debates on specific topics in Parliament. Any information that you can provide will be a real help, and it will treated confidentially.\nBest wishes\nLaurence Turner Labour MP, Birmingham Northfield\nP.s. If you don’t want to receive these messages then please reply to this email with the word ‘unsubscribe.’\nImage credit - Wikimedia Commons.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_campaign-launch/content_60.html": "Campaign launch\nFighting for every vote\nIt was great to launch Labour’s campaign for Northfield.\nI spoke to Labour members about why we need a change in Northfield and a change in government.\nAll the communities in Northfield need a strong, campaigning voice in the constituency and in Parliament. I want my daughter to grow up here, and I will make sure that Northfield gets a full constituency office service again.\nOur services have been run down, but under the Tories 40p in the pound has been cut for each person in Birmingham. Leveling up money for Northfield high street was denied, and improved transport services for Longbridge have stalled.\nWe also have two fantastic council candidates - Carmel Corrigan and Esther Rai - in King’s Norton North and Northfield.\nLabour is working hard to get Northfield’s future back, and to win people’s trust and support in the elections on 04 July.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_birmingham-mail/content_19.html": "Birmingham Mail\nCampaign\nI spoke recently to the Birmingham Mail about workers’ rights, SEND, better transport and public services, my background - and my priorities if I am elected as MP.\nThe article can be found here.\nLocal press scrutiny of politicians - including people who are standing for Parliament - is more important than ever, especially as local news coverage has been cut back in many areas.\nYou can subscribe to Jayne Haynes’s (Politics and People Editor at the Mail) regular newsletter here.",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_wfa-letter/content_50.html": "Winter Fuel Allowance letter\nA number of people have written to me about the vote in Parliament this week.\nI am replying to each message directly, but I wanted to share information on the support that is available to pensioners this winter - as well as the justification for this decision.\nI will be sharing more information on routes to getting support for households that need it over the coming weeks.\nDear residents\n11 September 2024\nI want to take the time to explain to you why I voted with the Government on the issue of the Winter Fuel Allowance, as well as setting out the support that is available for pensioners this winter.\nNo-one wants to be in this position. We have only had winter fuel payments for the last 25 years because a Labour Government brought them in and I wish that it was possible to keep the Winter Fuel Allowance as a universal benefit.\nWork is being undertaken locally to protect the payment for as many people as possible. Important information about support and eligibility is contained in this letter, but It is also important to talk about how we ended up in this situation.\nSupport for pensioners\nI would like to assure you that the new Government is taking steps to support pensioners, despite the UK’s very difficult financial situation, including:\n• Maintaining the Triple Lock so that the value of the State Pension is protected. The annual New State Pension will rise by £460 in April. The Basic State Pension will rise by £353.60 a week. As the BBC has noted, this increase is ‘much higher than inflation.’\n• Extending the Household Support Fund – in Birmingham, this Fund has supported grants of up to £200 for households in hardship. I have written to the Council to ask them to set out the support they will provide, now that this fund has been extended.\n• Providing the Warm Home Discount worth £150 off electricity bills this winter for millions of low-income households, including pensioners’.\n• Maintaining the Cold Weather Payment if this is an unusually cold winter (worth £175 a week for each consecutive 7 days that the temperature drops below zero).\n• Preserving the Winter Fuel Allowance for people in receipt of Pension Credit and certain other benefits (Universal Credit, income-related Employment and Support Allowance, income-based Jobseeker’s Allowance, Income Support, Child Tax or Working Tax Credit.)\nPension Credit eligibility\nIf you are in receipt of Pension Credit or certain other benefits then you will continue to get the Winter Fuel Allowance.\nMany people are eligible to receive Pension Credit but do not claim it. Some 2,600 households in the Northfield constituency meet the criteria but they do not receive the payments and are out-of-pocket. Pension Credit is also a gateway to other forms of support, including the free over-75 TV licence and boiler replacement funding.\nThe eligibility criteria for Pension Credit extend to disability status and people with caring responsibilities. If you think that you (or people you know) may be eligible then I urge you to take the following steps:\n• Phone this DWP number - 0800 99 1234. You can also apply online at: https://www.gov.uk/pension-credit\n• If you need support with an application then you can consult the Independent Age national helpline on 0800 319 6789.\nIf the Winter Fuel Payment is going to be means tested we need to make sure that as many people who are eligible to continue to receive the payment can do so. I am trying to make sure that it reaches as many people as possible and I have been in contact with Independent Age, the UK’s only national charity that focuses exclusively on pensioner poverty, to discuss campaigns to reduce costs for pensioners.\nMinisters have also given me an assurance that they working urgently to simplify the application process for Pension Credit, as well as looking to write to all pensioner households in receipt of housing benefits, as they may be eligible for Pension Credit.\nThe public finances\nThe reality is that the last government, as it fell behind in the polls, made ever grander promises in the hope of winning a few votes back. As the Office for Budget Responsibility has confirmed, the financial reality was hidden from Parliament and the public until after the election. For example, immigration and asylum was over-spent more than £7 billion this year – several tunes the entire cost of winter fuel payments.\nUrgent action was needed to repair the public finances. Without immediate steps, the cost of government borrowing would have risen and more benefits and services would have to be cut down the line. Not acting could have led to higher prices, mortgages and rents. I can only convey my anger at this situation, and assure you that the new Government will not act in this manner with the public finances.\nWe can never go back to the days when reckless spending crashed the housing market, punishing pensioners who didn’t own their homes outright more than most. We know that Conservative Ministers looked at cuts to the Winter Fuel Allowance last year. Had they won the election then it is likely that pensioner benefits would have been reduced due to the scale of the hidden liability.\nWe are also acting to raise money from those with the broadest shoulders, including by cracking down on wealthy non-UK nationals who have been exempted from tax, and by levying the windfall profits of the energy companies.\nI understand that it might look like pensioners were singled out because of the timing of the announcement, but as winter approaches there was - I think - some benefit in people being given as much time as possible to prepare.\nI will continue to work hard in representing all of my constituents, ensuring that we bring about economic stability, restore our public services, and protect ordinary people during this difficult time.\nYours sincerely\nLaurence Turner MP Member of Parliament for Birmingham Northfield",
  "https_laurence4northfield_com_/https_laurence4northfield_com_posts_send-delays-041124/content_63.html": "Raising SEND delays in Parliament\nSEND has been a major focus since the election.\nI was able to raise young people and families’ poor experiences in Parliament this week - specifically, the problem of delays between schools, NHS bodies, councils, and social work, which are in turn delaying decisions.\nThe Minister agreed to hear from south Birmingham families directly. You can watch the exchange and read the transcript below.\nLaurence Turner (Birmingham Northfield):\nAt the recent SEND surgery that I organised with SEND Socials Birmingham, one message came through time and again: different public bodies are not working together as the Children and Families Act 2014 intended, and this is contributing to long delays and distress. Will the Minister agree to receive representations from young people and families in south Birmingham, so that their negative experiences can at least contribute to the important work of reforming the SEND system?Catherine McKinnell (SEND Minister):\nAbsolutely. We are committed to working with families to deliver an improved SEND system that works for all. We ensure that families have access to free and impartial information, advice and support to enable them to participate as fully as possible in the decisions that affect them, but I would welcome suggestions from my hon. Friend and parents in south Birmingham on how to improve the system."
}