{
  "https_dawnfurness_com/https_dawnfurness_com_tag_gpew/content_9.html": "Tag: #GPEW\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_2025_05_01_why-i-left-the-green-party/content_6.html": "Over the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that happened, I realised that the party I loved was abandoning both its principles and its people.\nA Green Party Goodbye\nLeaving the Green Party was one of the hardest decisions I’ve ever made. Over ten years, I invested my time and skills in roles such as:\n- GPEx Local Party Support\n- Blyth Valley Coordinator\n- North East Region Coordinator\n- GPWomen Co-Chair\n- Member of the International Committee\n- Prospective Parliamentary Candidate (2015, 2017, 2019)\n- Green MEP Candidate (2019)\nThese positions gave me insight into policy-making, grassroots organising, and fundraising—and I believed wholeheartedly in our shared values. Yet several colleagues and friends who raised child-safeguarding concerns—particularly around experimental treatments like puberty blockers—were instead met with internal tribunals and suspensions. Their removal has weakened our councils’ ability to tackle climate change at the local level, exactly when experienced leadership is most needed.\nSafeguarding vs. Ideology\nThe Cass Review delivered landmark recommendations on child safeguarding in medical settings. The Government adopted the Cass Report in full1, acknowledging the urgent need for better oversight. Yet the Green Party quietly withdrew its own supporting statement, siding with lobby groups over vulnerable children2.\nhttps://webarchive.nationalarchives.gov.uk/ukgwa/20250310143933/https://cass.independent-review.uk/home/publications/final-report/\n“Our party’s refusal to acknowledge these safeguarding risks was the final straw. After a decade of building networks and resources, I cannot stay where female members’ safety is compromised.”\nThis wasn’t a minor policy tweak—it was a repudiation of our duty to protect the most vulnerable.\nInstitutional Sexism & Legal Action\nThe scale of this purge is astonishing. More than 30 Green Party members—many women—have been suspended, expelled, or forced to resign for lawfully raising Equality Act 2010 concerns3. In response, affected members launched the “Institutional Sexism: Legal Action Against GPEW” Crowdfunder campaign4, which states:\n“We allege persistent discrimination against female members who raised safeguarding issues, costing individuals thousands in legal fees and emotional distress.”\nThree litigations are already underway, with more likely to follow. The Party’s choice to use members’ donations for aggressive legal defence threatens its financial and moral fabric.\n“Biological Reality”\nAt Prime Minister’s Questions, Kemi Badenoch sharply reminded MPs:\nHer words underscore that no organisation—no matter how well-intentioned—can place ideology above statutory duty.\nThe Cost to Local Climate Action\nExpelling experienced women councillors has not only harmed individuals—it’s emptied our councils of vital environmental expertise. We used to insist on a “Green in the room,” a committed advocate for People and Planet who guaranteed that every decision, however diverse the interests, at least considered sustainability, biodiversity, and climate resilience. Even if green motions lacked the votes to pass, they still commanded attention and debate.\nNow, because of the Party’s shameful internal purge, we’ve lost those indispensable voices. At a moment when climate change has escalated from crisis to chaos, this abdication of responsibility is unconscionable. Without seasoned Green champions at the table, our councils risk making decisions blind to the environmental consequences that will shape all our futures.\nMoving Forward\nDespite my departure, my commitment to the environment, sustainability, and women’s rights remains unwavering. Right now that position could be described as ‘Eco-Feminist’. I believe the reputational damage to the Green Party is unrecoverable.\nIf you share my shock at these “dirty tricks” campaigns—where members’ dues fund damaging court battles—please support the extended Crowdfunder campaign:\nInstitutional Sexism: Legal Action Against GPEW\nhttps://www.crowdfunder.co.uk/p/institutional-sexism-legal-action-against-gpew\nEvery contribution helps hold the Party to account and demand a sustainable and lawful green movement.\nIf you support environmentalism either as a current or former member of the Green Party and believe women’s sex-based rights are a material reality, I invite you to sign ther Green Women’s Declaration:\nhttps://greenwomensdeclaration.uk/\nLocal Elections 1 May 25\nIf you are a local resident and are interested in setting up a community growing group, recycling hub or residents association, please send me a messge cllr@DawnFurness.com\nOn Thursday 1 May 2025, remember that real sustainability depends on both environmental protections and making the most of our existing resources. Vote for leaders who follow evidence, uphold the law, and empower every voice.\nFootnotes\n- Department of Health, Cass Review Adoption, 2024. ↩\n- “Green Party Withdrew Statement on Cass Review,” PoliticsHome, 2025. https://www.politicshome.com/news/article/green-party-withdrew-statement-cass-review ↩\n- “Suspended, expelled, resigned,” Gender Critical Greens, 2025. https://gcgreens.uk/suspended-expelled-resigned/ ↩\n- “Institutional Sexism: Legal Action Against GPEW,” Crowdfunder. https://www.crowdfunder.co.uk/p/institutional-sexism-legal-action-against-gpew ↩\nLeave a Reply",
  "https_dawnfurness_com/https_dawnfurness_com_tag_nodebate/content_10.html": "Tag: #NoDebate\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com/content_1.html": "Safeguarding. Sustainability. Climate.\n-\nCramlington’s Overgrown Non-Native Trees\nResidents Large Tree Concerns I recently canvassed residents across Cramlington Eastfield about their top local issues, and the problem of outsized, unruly trees featured prominently. Neighbours pointed out that multiple factors have combined to make the situation worse: severe budget cuts have reduced the council’s in-house arborist capacity, leaving urgent pruning work unaddressed; private contractors—often…\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…\n-\nI’ve Recycled my 2024 General Election Flyer!\nUpcycling in Action: From 2024 Flyers to Fresh 2025 Updates Who says recycling is only for plastic bottles and old newspapers? I’ve given my 2024 General Election flyers a new lease of life by stapling on bright A7 “Vote on 1 May” updates—and I’ve discovered it’s the fastest, cheapest, and most eye-catching way to get…\n-\nGroomed: A National Scandal!\nA National Statutory Inquiry Into Grooming Gangs: Holding Authorities Accountable The Channel 4 documentary Groomed: A National Scandal broadcast this evening has once again brought the issue of grooming gangs into the spotlight, exposing the horrific abuse suffered by young victims across the UK. While the victims’ stories are both heart-wrenching and crucial to the…\n-\nCramlington and Killingworth – GE24 Candidate Survey\nWant to ask me a question?",
  "https_dawnfurness_com/https_dawnfurness_com_tag_legal/content_8.html": "Tag: #Legal\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_tag_sex/content_11.html": "Tag: #Sex\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_2025_05_01_groomed-a-national-scandal/content_3.html": "A National Statutory Inquiry Into Grooming Gangs: Holding Authorities Accountable\nThe Channel 4 documentary Groomed: A National Scandal broadcast this evening has once again brought the issue of grooming gangs into the spotlight, exposing the horrific abuse suffered by young victims across the UK. While the victims’ stories are both heart-wrenching and crucial to the conversation, the documentary also sheds light on the monumental failures of local councils, care providers, and the police in allowing such crimes to flourish unchecked for so long.\nAs we continue to process the scale of the abuse, it’s clear that a national statutory inquiry is not just necessary—it’s urgent. The victims deserve justice, but we also need to understand the full scope of systemic failures that enabled these crimes to occur. Without accountability for the authorities who failed to act, we are only addressing part of the problem.\nWhy the Focus Must Extend Beyond the Victims\nWhile the stories of the victims are undeniably tragic, focusing solely on the victims risks missing the larger issue: the role of institutions in enabling this abuse. Local councils, social services, and the police were aware of the patterns of abuse, yet failed to take appropriate action. These institutions were meant to protect vulnerable children, yet time and time again they ignored warnings, silenced whistleblowers, and allowed grooming gangs to operate in plain sight.\nThis failure to act raises serious questions about the priorities of these institutions. Why were the safety and wellbeing of these children ignored? What was the cost of political correctness or fear of being labelled “racist”? How did these authorities continually protect perpetrators, even when their actions were reported to them?\nThe Role of Labour and Political Failures\nIt’s essential to consider the political context that allowed these failures to continue unchecked. In particular, the relationship between Labour and certain communities has raised concerns. Allegations that Muslim block postal votes were traded for financial support for mosques by the Labour Party point to a deeply concerning intersection of politics and community leadership. This connection creates an environment where issues such as grooming gangs, which often involve men from the Muslim community, were left to fester.\nThe reluctance to address grooming gangs within certain communities due to political motivations is not just an oversight—it’s a betrayal of the victims. Labour’s failure to hold these communities accountable, out of fear of alienating certain voters, contributed to the deep-rooted failure to protect children.\nThe Oldham Timeline: A Case of Delayed Accountability\nThe case of Oldham Council serves as a poignant example of the political inertia that delayed justice for victims of grooming gangs. For years, the council, under Labour control, rejected calls for an independent inquiry into the grooming gangs operating within the area. Despite increasing public pressure and the testimony of whistleblowers, Oldham Council maintained a stance of denial, failing to launch a proper investigation into the systemic failures that allowed the abuse to continue.\nHowever, a major shift occurred when, on 13 February 2025, Oldham’s Conservative Group led a motion calling for a statutory public inquiry into child sexual exploitation in the town. This move followed months of frustration, as ministers had previously rejected a government-led inquiry. The motion, which was passed unanimously by the council, emphasized that a judge-led review would have more power than the current local inquiry, including the ability to compel witnesses. This motion was met with applause from the public gallery, many of whom had been advocating for such an inquiry for years.\nThe call for a statutory inquiry was grounded in the fact that previous investigations and local reviews had failed to uncover the full extent of the abuse or compel relevant witnesses to provide evidence. It was noted that safeguarding failures by Greater Manchester Police and Oldham Council, particularly between 2011 and 2014, were highlighted in a 2022 report, which found no evidence of a cover-up, but confirmed that children in Oldham had been failed (BBC News).\nGovernment Response: From Promise to Controversy\nIn January 2025, Home Secretary Yvette Cooper announced a £10 million initiative to fund local inquiries into grooming gangs in five towns, including Oldham. This move came after mounting public pressure and legal threats, notably from former police detective Maggie Oliver, who warned of legal action unless the government took meaningful steps to address the issue (ITV News).\nHowever, the government’s approach has faced criticism. The planned local inquiries lack statutory powers to compel witnesses, raising concerns about their effectiveness in uncovering the full extent of institutional failures. Critics argue that without the authority to summon witnesses and demand evidence, these inquiries may not achieve the transparency and accountability needed (The Times).\nMoreover, the government’s decision to limit the inquiries to five towns has been met with skepticism. Some argue that this selective approach may be politically motivated, potentially downplaying the involvement of certain demographics and favoring areas with specific political leanings (AP News).\nLegal Action: Holding Authorities Accountable\nIn response to the government’s limited approach, Maggie Oliver has launched the #TheyKnew campaign, aiming to hold accountable those who failed to act on grooming gang cases. The campaign seeks to raise £125,000 to investigate the actions of police forces, local authorities, and individuals across the country to determine whether private prosecutions, civil claims, or other legal proceedings can be brought against them for past failures (ITV News).\nOliver has been a steadfast advocate for victims, emphasizing the need for legal accountability to ensure that those in positions of power who failed to protect children are held responsible for their actions.\nWhy a Statutory Inquiry is Crucial\nRupert Low’s crowdfunding campaign for a national statutory inquiry is essential for ensuring that the authorities responsible for these failures are held accountable. This inquiry must not only examine the victims and their tragic experiences but also look at the political and institutional failures that allowed grooming gangs to thrive. It must question why certain individuals and institutions felt comfortable prioritizing political gain over the safety of children.\nA national inquiry will provide a platform to investigate systemic failures, uncover cover-ups, and ensure that those in positions of power are held to account. This inquiry is not just about investigating grooming gangs—it’s about investigating the structures that allowed these heinous acts to continue.\nWorking Across Political Lines for a Common Cause\nWhile I strongly disagree with many policies of the Reform Party (particularly their position on the environment and tackling the climate crisis), I firmly believe that it is vital to collaborate with other parties when it comes to issues of safeguarding and protecting vulnerable individuals. The grooming gang scandal is a national institutional safeguarding failure, disproportionately affecting vulnerable young white girls, and it is a matter of urgent national importance. Regardless of political differences, ensuring that justice is served for these victims is a cause that transcends party lines. The need for a comprehensive inquiry into the institutional failures surrounding grooming gangs is something that must unite us all in the pursuit of justice and accountability.\nHow You Can Help: Support the Inquiry\nThe crowdfunding campaign launched by Rupert Low is crucial in funding the resources necessary for this inquiry. Public support for the campaign sends a clear message that we, as a society, will not tolerate such gross negligence and injustice. By contributing to the campaign, you can help ensure that these stories are heard and that those in power are held responsible.\nIt’s time for the authorities to stop brushing these issues under the carpet and start taking responsibility for the lives they failed to protect. A statutory inquiry will provide the transparency needed to expose the truth, prevent future abuse, and ensure that those responsible are held accountable for their actions.\nTake Action: Sign the Parliamentary petition\nPlease support the vital work of Maggie Oliver.\nPersonal Note on why this is important.\nAs an environmentalist and former Green Party Executive (GPEx) elected member, I understand that my decision to share campaigns from other political groups (particularly from the Reform Party) may raise eyebrows for some. But let me explain why I feel compelled to do so.\nFor two decades as a music teacher, and with extensive experience in safeguarding and policy development at the national level, I have seen firsthand the importance of collaboration in achieving common goals. Large organizations, whether political or otherwise, must have systems in place to protect vulnerable people—this is non-negotiable. When it comes to protecting children and holding those in power accountable, we must set aside our differences and work together, regardless of party lines.\nThe need to safeguard the most vulnerable in our society is too important to be divided by ideological barriers. In this fight, every ally counts, and I am willing to work with anyone who shares this essential goal, even if it means stepping outside my usual political comfort zone. It’s about putting the welfare of our most vulnerable first—above all else.\nIn solidarity – Dawn Furness\nLeave a Reply",
  "https_dawnfurness_com/https_dawnfurness_com_category_uncategorized/content_18.html": "Category: Uncategorized\n-\nCramlington’s Overgrown Non-Native Trees\nResidents Large Tree Concerns I recently canvassed residents across Cramlington Eastfield about their top local issues, and the problem of outsized, unruly trees featured prominently. Neighbours pointed out that multiple factors have combined to make the situation worse: severe budget cuts have reduced the council’s in-house arborist capacity, leaving urgent pruning work unaddressed; private contractors—often…\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…\n-\nI’ve Recycled my 2024 General Election Flyer!\nUpcycling in Action: From 2024 Flyers to Fresh 2025 Updates Who says recycling is only for plastic bottles and old newspapers? I’ve given my 2024 General Election flyers a new lease of life by stapling on bright A7 “Vote on 1 May” updates—and I’ve discovered it’s the fastest, cheapest, and most eye-catching way to get…\n-\nGroomed: A National Scandal!\nA National Statutory Inquiry Into Grooming Gangs: Holding Authorities Accountable The Channel 4 documentary Groomed: A National Scandal broadcast this evening has once again brought the issue of grooming gangs into the spotlight, exposing the horrific abuse suffered by young victims across the UK. While the victims’ stories are both heart-wrenching and crucial to the…\n-\nCramlington and Killingworth – GE24 Candidate Survey",
  "https_dawnfurness_com/https_dawnfurness_com_2025_05_01_ive-recycled-my-2024-general-election-flyer/content_5.html": "Upcycling in Action: From 2024 Flyers to Fresh 2025 Updates\nWho says recycling is only for plastic bottles and old newspapers? I’ve given my 2024 General Election flyers a new lease of life by stapling on bright A7 “Vote on 1 May” updates—and I’ve discovered it’s the fastest, cheapest, and most eye-catching way to get the word out.\nCramlington Eastfield – Thursday 1 May\nI’ve RECYCLED my 2024 General Election flyer!\n✔️ Safeguarding, Energy, & Climate Campaigns!\n⏰ Polls Open 7 AM – 10 PM\n🆔 Bring Your Photo ID\nFacebook.com/CllrDawnFurness\nFun fact: due to a printing glitch in my General election campaign, my print fulfillment company delivered 90,000 flyers instead of the 55,000 ordered—so I’ve got more than enough to go around.\nMy position on the environment, sustainability, and protecting the rights of women and girls has not—and will not—change. It’s striking that the core message on my flyer from 4 July 2024 still feels completely on-brand ten months later!\nRecycling in Practice, Not Just Theory\nIf you’ve got 35,000 old election flyers lying around—whether mine or from other candidates—don’t let them go to waste! Here’s how to turn them into powerful campaign tools:\n- Staple on Mini-Updates: Print eight A7 updates per A4 sheet and attach.\n- Add QR Codes: Link directly to your campaign website or a “Vote on 1 May” reminder page.\n- Re-use Envelopes: Slip recycled flyers into mail-drops, saving on stationery.\n- Social Share: Snap your upcycled flyer in action and post with #UpcycleYourVote on Facebook and X.\nThis approach saves on printing costs, reduces waste, and shows voters you practice what you preach. 🌍♻️\nIt also demonstrates that your message and values are consistent!\nThe Future is on 1 May\nThursday 1 May 2025 is the day to make your voice count:\n🗳️ Vote: Dawn Furness (Independent)\n⏰ Polls open 7 AM–10 PM\n🆔 Don’t forget your photo ID\nBy supporting an Independent candidate, you vote for:\n- Real sustainability rooted in practice, not just platitudes.\n- Strong safeguards for women, children, and vulnerable adults.\n- Clean, transparent governance that follows the law.\n- Inclusive debate where all voices—scientific, community, and lived experience—matter.\nSo if you are having Deja Vu, at some of my campaign literature…don’t worry, it has just been UPCYCLED.\nJoin me on 1 May to build a greener, safer, and fairer Cramlington Eastfield.\nNOTE: The Recycled flyer updates have the full election imprint on them.\nLeave a Reply",
  "https_dawnfurness_com/https_dawnfurness_com_tag_gpew-greens-greenparty-politics-sex-gender-genderideology-nodebate-sexism/content_13.html": "Tag: #GPEW #Greens #GreenParty #Politics # Sex # Gender #GenderIdeology #NoDebate #Sexism\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_2025_05_01_when-good-intentions-grow-too-big-the-plight-of-cramlingtons-non-native-trees/content_2.html": "Residents Large Tree Concerns\nI recently canvassed residents across Cramlington Eastfield about their top local issues, and the problem of outsized, unruly trees featured prominently. Neighbours pointed out that multiple factors have combined to make the situation worse: severe budget cuts have reduced the council’s in-house arborist capacity, leaving urgent pruning work unaddressed; private contractors—often hired at substantially higher rates—have struggled to keep up with demand; and those same original 1970s town-planning decisions to plant fast-growing, non-native species continue to haunt us. Together, these pressures have left many streets shaded almost to full darkness and gutters filled to bursting every autumn\nA short history of our tall trees\nIn the 1970s, Cramlington New Town’s planners set out to create green corridors, leafy verges, and community woodlands to complement its modern housing estates. Trees were chosen for their fast growth and year-round appeal—but few foresaw that species like Leyland cypress, Robinia pseudoacacia (black locust), and even Sitka spruce would soon tower over front gardens, block daylight, and shed thousands of leaves into neighbouring gutters. This article explores how those well-meaning choices have turned into a maintenance headache, the legal responsibilities around public-land trees, and positive, community-driven solutions to keep Cramlington both verdant and neighbourly.\nIndigenous vs. Planted: A Tale of Two Arboreal Worlds\nNative Treasures\nThe ancient woodlands of Northumberland—Briarwood Banks with its oak, ash, and wych elm—reflect the species best suited to our soils, climate, and wildlife1. Common native trees around Cramlington include:\n- English oak (Quercus robur) and sessile oak (Quercus petraea)\n- Silver birch (Betula pendula) and downy birch\n- Rowan (Sorbus aucuparia)\n- Alder (Alnus glutinosa)\n- Hawthorn (Crataegus monogyna) and Guelder rose (Viburnum opulus)\n- Holm oak, field maple, and hazel grow in remnant hedgerows and parks.\nThese species evolved here, support local insects and birds, and rarely overwhelm small plots.\nNew Town Selections\nBy contrast, the 1970s New Town plantings favoured rapid shade and visual impact. Council records (e.g., the “Trees for Cramlington” project) show common additions of:\n- Beech (Fagus sylvatica) for formal avenues2\n- Sycamore (Acer pseudoplatanus), prized for its resilience\n- Robinia pseudoacacia (black locust), later removed in places due to invasiveness\n- Leyland cypress hedges—fast-growing but requiring frequent trimming\n- Elder and sitka spruce on reclaimed pit-land edges3.\nThese choices, though spectacular at first, quickly outgrew their spaces.\nWhen Beautiful Becomes Burdensome\nBlocking Light & Views\nEvery summer when canopies fill out, neighbouring homes report near-total loss of natural light. Living rooms and kitchens go dark by mid-afternoon, forcing residents to rely on lamps. Even north-facing gardens feel the squeeze.\nSafety & Sound\nOverhanging branches can snap in storms, threatening people and property. Meanwhile, idling cars from parents waiting at neighbouring school gates wrestle for space beneath big conifers—bringing noise and fumes right to front doors.\nA Fallen Leaf Epidemic\nAutumn gutter blockages lead to damp walls and basement flooding. Clogged street drains cause local ponding, which only clears after manual intervention.\nWho’s on the Hook? Understanding Tree Law Basics\nIn England and Wales, the owner of the land on which a tree stands is responsible for its maintenance and any damage caused by its roots or branches. For public-land trees—along roads, in parks, or on school grounds—ownership usually rests with the local authority (e.g., Northumberland County Council).\n- Council Responsibilities\n- Trimming & Safety: Under the Highways Act 1980, councils must remove overhanging branches and clear sightlines on public highways.\n- Liability: If a council fails to act on a known hazard and someone is injured or property damaged, it can face negligence claims.\n- School Grounds\n- Many of the worst offenders stand on school land. Under the Occupiers’ Liability Act 1957, schools owe a duty of care to staff, pupils, and visitors. Yet budget cuts often leave them claiming they “lack resources” for essential tree work.\n- Neighbourly Rights\n- Homeowners may prune branches that overhang their property boundary—provided they do not trespass onto council land. The law entitles them to reasonable trimming back to the boundary line but not to fell the tree entirely without permission.\nLEGAL VIEW: Case Study – Leigh v. Taylor [1902]\nIn this landmark case, a homeowner was allowed to cut back overhanging laurel branches because they encroached on his land. However, he was not permitted to damage the tree’s overall health. This principle guides modern disputes.\nFor a quick primer on your rights, watch this “Tree-Law Basics” explainer:\n“Do-It-Yourself” Risks & Insurance\nSome residents, exasperated by years of blocked light and broken drains, might be tempted to take a chainsaw to overhanging branches. Dangerous idea—here’s why:\n- Personal Liability: If you damage a council tree or cause it to fall and injure someone, you could face a civil claim for property damage or personal injury.\n- Criminal Risk: Destroying or wilfully damaging a protected tree (Tree Preservation Order or conservation area) can lead to fines or prosecution.\n- Insurance Gaps: Home insurance rarely covers legal costs arising from negligent tree work on public property. Councils carry Public Liability Insurance, but individuals do not.\nBetter Approach:\n- Report hazards to the council’s Highways & Tree Service via their online portal.\n- If immediate action is needed, obtain a homeowner’s liability policy that explicitly covers tree-care activities.\n- Hire qualified arborists who carry Public Liability and Professional Indemnity Insurance.\nLeaf Clearance & Drainage: Who Does What?\n- Gutters & Driveways: Homeowners must clear leaves from private gutters and driveways to prevent water ingress and ACA failures (Action on Agricultural).\n- Pavements & Channels: Local authorities are responsible for clearing leaves and debris from adopted highways and street drains under the Highways Act. Residents can help by letting the council know about blocked gullies online or through the Northumberland County Council reporting tool.\nQuick Fixes:\n- Install gutter guards and leaf traps in drains.\n- Use a garden rake and broom to sweep leaves before they wash into channels.\n- Organise community clear-up days (see below).\nLEGAL VIEW: Who Owns Fallen Leaves? Legal Ownership and Responsibilities\nOnce a leaf drops from a council-owned tree, its legal status changes immediately—any detached natural debris becomes the property of the landowner on whose land it comes to rest. In practice, this means:\n- Leaves on Public Highway: When leaves fall onto adopted highways (pavements, road gutters, and verges maintained by the council), the council remains responsible for clearing them under the Highways Act 1980. They must prevent hazards such as slippery footpaths or blocked drains.\n- Leaves on Private Property: If leaves blow onto your front garden, driveway, or gutter, you—as the landowner—own that detritus and bear the duty to remove it. This is not just a courtesy; under common law, homeowners must keep their property safe (e.g., preventing slip risks or water ingress from blocked gutters).\n- Leaves Crossing Boundaries: A resident may lawfully sweep or rake leaves from a neighbour’s fence or from the pavement back onto the highway, but cannot dispose of them onto someone else’s private property without permission.\nNo court has ever treated fallen leaves as “abandoned property” that anyone can claim; instead, they’re considered part of the natural cycle, yet once detached, they fall under the ownership and maintenance duties of the land they cover. For clear guidance on street leaf clearance and reporting blocked drains, visit the Northumberland County Council Report It page.\nThe Big Picture: Funding Cuts & Resource Gaps\nOver the last decade, central governments have slashed funding for local authorities:\n- Welfare & Disability Support: Budget reductions of over 20% since 2010 have forced councils to prioritise statutory services (e.g., social care) over discretionary work like tree-maintenance and public realm cleaning.\n- Tree Budgets: Many councils report a 30–40% cut to arboricultural budgets since 2015, leaving scheduled pruning and replanting schemes cancelled or delayed.\nResponsibility lies with successive administrations—from the Cameron-Clegg coalition to the current government—that have reduced the Local Government Finance Settlement. The impact is tangible: towering trees with no care plan, blocked drains, and vulnerable residents left in the shade.\nCommunity Action: Spruce-Up Days & Tool Libraries\nWhen budgets run dry, communities can step in. Cramlington residents have successfully:\n- Organised Spruce-Up Days, where neighbours bring rakes, shears, and wheelbarrows to clear leaves, prune hedges, and plant native saplings.\n- Launched a “Library of Things” at the community centre, lending out strimmers, ladders, and safety gear.\nFor years, I combined my morning dog walk with a quick litter-pick through our streets. Together, we filled dozens of bags, making our neighbourhood cleaner and brighter. Since my beloved dog passed away 2 weeks ago I’m looking at setting up something more community based. For guidance on running your own event, check out these “Community Gardening” videos.\nLooking Ahead: The Value of Early Environmental Consultation\nThe lesson here is clear: investing in thorough environmental analysis and community consultation at the very earliest stages of any development or landscaping project can save tens of thousands of pounds—and countless headaches—down the line. By choosing the right species for the right place, budgeting properly for ongoing maintenance, and listening to local residents from the outset, councils and developers can prevent the sort of “legacy problems” that Cramlington Eastfield is now facing. Engaging arborists, ecologists, and community groups before a single sapling is planted ensures greener, safer, and more sustainable neighbourhoods for everyone.\nA Greener, more sustainable Cramlington\nThe legacy of 1970s tree-planting reminds us that even the best intentions need ongoing care. By understanding our legal rights, pressing councils for action, and pooling community resources, we can ensure our streets stay leafy—without leaving neighbours in the shade.\nGet Involved:\n- Report a Hazard: This can be raised trees roots that are a trip hazard. Use the Northumberland County Council Report It page.\n- Join a Spruce-Up Day: Check your local residents’ association Facebook page.\n- Borrow Tools: Ask your local neighbour nicely to borrow their tools. If not perhaps it’s time we set up a community Library of Things?\nTogether, we can keep Cramlington’s green spaces vibrant, safe, and full of light for generations to come.\nLeave a Reply",
  "https_dawnfurness_com/https_dawnfurness_com_tag_courtcases/content_17.html": "Tag: CourtCases\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_tag_greens/content_16.html": "Tag: #Greens\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_tag_greenparty/content_14.html": "Tag: #GreenParty\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_tag_sexism/content_12.html": "Tag: #Sexism\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_tag_law/content_7.html": "Tag: #Law\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_tag_gender/content_15.html": "Tag: #Gender\n-\nWhy I Left the Green Party\nOver the past decade, I devoted myself to the Green Party’s mission—fighting climate change, championing renewable energy, and safeguarding vulnerable people. I stood shoulder-to-shoulder with some of the UK’s most passionate environmentalists—many of whom served as local councillors—only to witness them summarily suspended or expelled for raising perfectly lawful concerns about child safeguarding. When that…",
  "https_dawnfurness_com/https_dawnfurness_com_2024_07_04_cramlington-and-killingworth-ge24-candidate-survey/content_4.html": "Prospective Cllr for Cramlington Eastfield\nPosted\nin\nby\nAdmin\nTags:\nYour email address will not be published. Required fields are marked *\nComment *\nName *\nEmail *\nWebsite\nSave my name, email, and website in this browser for the next time I comment.\nLeave a Reply"
}