{
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_about-rss/content_3.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_news_join-us-evening-comedy-jim-davidson/content_5.html": "Prepare for a night of laughter, wit, and entertainment as North Devon welcomes the legendary Jim Davidson for an unforgettable evening on March the 22nd! Get ready to indulge in a delightful dinner and a brief yet hilarious show at the prestigious Barnstaple Hotel, located on Braunton Road, Barnstaple, EX31 1LE.\nThis promises to be an extraordinary evening filled with laughter, camaraderie, and Jim Davidson’s signature humor. As this event is generating buzz beyond North Devon, securing your tickets early is highly recommended!\nTickets are selling fast, so don't miss your chance! Secure your seats today by booking your tickets online now or by contacting our ticket hotline at 01271 624579. Hurry, this exclusive event is sure to sell out!\nJoin us for a night of laughter, camaraderie, and unforgettable moments with Jim Davidson. Be part of this special evening, and let's celebrate the power of laughter together! See you there! 🎤🤣 #JimDavidsonLive #NorthDevonLaughs\nAny questions contact [email protected]",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_what-we-stand/content_4.html": "We are a patriotic party of the centre-right in UK politics. We stand for freedom, enterprise, community and equality of opportunity.\nWe are a party of choice, responsibility, local decisions, low taxation and strong but limited government. We believe a strong economy is the key to the services and security we all rely on.\nWe are a party which champions individual choice.\nConservatives believe that people and not government make the decisions that are best for themselves, their families and communities. Parents, students, tenants, consumers and investors must have the freedom to choose.\nWe are a party of responsibility.\nConservatives believe that people must take responsibility for the decisions they make and bear the consequences if they break the law. Freedom cannot exist without responsibility and respect for the rule of law. We are ending 'free movement' and will introduce an immigration system that is fair but firm.\nWe are a party giving people more say over their lives.\nConservatives believe that decisions should be made as close to the people as possible. Big government stifles local action. We believe in re-empowering local communities and giving more power to tenants, employees, parents and residents.\nWe are a party of low taxation.\nConservatives want to see people keep more of the money they earn and not have it eaten up by excessive government spending. We believe in prioritising the family budget over the government budget. We believe in cutting taxes for the lowest paid and the most vulnerable but using the taxes people pay to fund improvements to the services we all rely on, such as schools, hospitals and security.\nWe are a party of strong but limited government.\nConservatives believe in government that is strong in its guarantee of security, freedom and civil liberties, but limited in its size, cost and ability to interfere in the day to day lives of individuals, families and businesses. We believe the UK must have strong defence coupled with free and fair trade with other nations around the globe.",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_accessibility/content_8.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_news_local-transport-survey/content_11.html": "With Transport, Highways, Planning and Potholes likley to be a major issue for the Devon County Council elections in May 2025. Do please let us know your thoughts.\nLocal Transport Survey | North Devon\nWith Transport, Highways, Planning and Potholes likley to be a major issue for the Devon County Council elections in May 2025. Do please let us know your thoughts.\nLocal Transport Survey | North Devon",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_cdn-cgi_l_email-protection/content_7.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_news_feed/content_10.html": null,
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_cookies/content_9.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_devolution-survey/content_6.html": "This Survey and why it matters\nThere has been lots of coverage of “Devolution in Devon”, losing our District Councils and getting a mayor – but what does all this mean? How can you influence what happens in your local community?\nThe new Labour Government is insisting councils rush through proposals to abolish district and county councils and create unitary councils everywhere. They also want everywhere in the country to have a mayor.\nMost of these decisions now rest with the Labour Government. Our Conservative run County Council asked had its request to be a priority area, to get the best deal for Devon declined. This means that devolution and will go ahead, but at a slightly slower pace and the Labour Government will ultimately dictate what our local authorities look like.\nForcing our Councils into this is unacceptable, and too fast to deliver optimal solutions, but it is happening, and we cannot change that. Given change is going to happen, many of us may have complained about our bin collections, pothole repairs, planning decisions, congestion etc – if we get the new structures right in Devon we might find all of these improve. This change is huge and it is vital your views are heard.\nPlease do complete this survey, we look forward to hearing from you.",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk_news/content_2.html": "Postal Votes arriving - Meet our candidates Monday, 14 April, 2025 With postal votes hitting - a reminder of our candidates here in North Devon: Barnstaple North: Lisa Mackenzie Lisa Mackenzie believes in the power of community. Her goals are simple - to do all she can to protect our green areas, tackle anti-social behaviour and to be the voice for the residents and business owners of Barnstaple. Lisa Will ask the questions that you want answers too and will work... Local News\nLocal Transport Survey 14th November 2024 With Transport, Highways, Planning and Potholes likley to be a major issue for the Devon County Council elections in May 2025. Do please let us know your... Local News\nBack our Campaign to Stop the Family Farm Tax 14th November 2024 Join the 420 people in North Devon who have already signed this important petition. #nofarmersnofood www.stopthefarmtax.com Local News\nJoin us for an evening of comedy with Jim Davidson 25th October 2023 Prepare for a night of laughter, wit, and entertainment as North Devon welcomes the legendary Jim Davidson for an unforgettable evening on March the 22nd! Get... Local News\nSelaine Saxby MP Writes to the Prime Minister to Call For Support for Off Grid Households 28th August 2023 The Government has proposed a ban on the installation of oil boilers from 2026, potentially affecting the 14% of households across North Devon who live off the... Local News\nSelaine Saxby MP visits local business with Cllr Jeremy Yabsley in Witheridge 21st February 2023 Selaine Saxby MP visited Littledart Fufilment in Witheridge, who were awarded Apprentice Employer of the Year 2023 in the SME category by Petroc. Littledart are... Local News\nSwimbridge Church of England Primary School has been successful in its bid to the School Rebuilding Programme. 16th December 2022 Swimbridge Church of England Primary School has been successful in its bid to the School Rebuilding Programme. The current school is built on a plateau cut into... Local News\nBraunton County Councillor is founding member of local charity for disabled beach users. 17th August 2021 Cllr Pru Maskell, Conservative County Councillor for Braunton Rural, this week announced the launch of Access for All, a North Devon charity looking to improve... Local News\nCllr Andrea Davis calls for public input on important South West Transport consultation 4th August 2021 Cllr Andrea Davis is calling for residents and businesses across North Devon to take part in a critical public consultation on transport in the South West which... Local News\nCllr Paul Crabb gives local update 18th July 2021 Cllr Paul Crabb, our County and District Councillor for Ilfracombe had this detailed update for Ilfracombe residents today. If you’ve got couple minutes on this... Local NewsReports\nThe Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News",
  "http_www_northdevonconservatives_org_uk/http_www_northdevonconservatives_org_uk/content_1.html": "Find us on Facebook\nFind us on Twitter\nDonate\nWith your help we're building a strong voice for local Conservatives.\nAny donation will make a difference.\nWelcome to the website of North Devon Conservatives. We are an active local association working hard for the benefit of the area. If you'd like to get involved or help out, please get in touch with our office via the Contact page.\nWith your help we're building a strong voice for local Conservatives.\nAny donation will make a difference."
}