{
  "http_www_rebeccalongbailey_com/http_www_rebeccalongbailey_com/content_1.html": "March Newsletter\nDisability Benefits Reform This week the Government announced a package of reforms to the social security system – the ‘Pathways to Work’ Green Paper. I welcome the Government’s planned investment in tailored, non-compulsory employment support and other sensible reforms but I am deeply concerned that removing £5 billion from the benefits system by 2030 would completely undermine this positive step and restrict support to those … Continue reading March Newsletter\nFebruary Newsletter\nInjured Patients and Staff A number of MPs across the House have been contacted by constituents regarding the conduct and competency of a spinal consultant, who was sacked in 2015. Families and patients operated on by Doctor ‘F’ over two decades at the Salford Royal Hospital, Spire Manchester Hospital and the Royal Manchester Children’s Hospital, along with concerned staff, formed a support group. The group … Continue reading February Newsletter\nJanuary Newsletter\nRenter’s Reform Bill I voted in favour of the Renter’s Reform Bill which saw the most significant package of reforms to the private rented sector in over 40 years and it will provide greater security and stability for more than 11 million private renters. Millions of people in England live day in, day out with the knowledge that they and their families could be uprooted … Continue reading January Newsletter\nChristmas Helplines\nMy office will be closed for the Christmas break from the 21st of December until the 2nd of January. However, I will be intermittently checking the inbox for any urgent enquiries which cannot wait until the 2nd of January. If your email is urgent, please add ‘URGENT’ to the email subject and I will get back to you as soon as possible. Please ensure you … Continue reading Christmas Helplines\nDecember Newsletter\nAt this time of year it’s important to appreciate all the brilliant people, workers and organisations in Salford. Those who have helped us or cared for us, protect us and kept us safe, taught us, entertained us and provided our public services – and those volunteer and gave their time to help us. All of those people helped transform our communities for the better and … Continue reading December Newsletter\nNovember Newsletter\nThe Budget and What it Means for Salford Earlier in the month, the Chancellor of the Exchequer, Rachel Reeves, made some big announcements in the Budget. I’ve summarised some key points on what it means for Salford: • Thousands of people in Salford are set to receive a 6.7% pay rise while apprentices and young people could see their wages increase by 16.3%. • Extending … Continue reading November Newsletter\nRebecca Long-Bailey MP: ‘Save Salford’s Post Office’\nSalford’s MP, Rebecca Long-Bailey, has written to Government Ministers asking them to intervene and call a halt to plans which could see Salford City’s post office close. Salford City’s branch is among more than 100 across the UK at risk of closure. Rebecca said, “Salford City’s Post Office is an essential part of our local economy and is relied upon by local residents and businesses, and … Continue reading Rebecca Long-Bailey MP: ‘Save Salford’s Post Office’\nOctober Newsletter\nWinter Fuel Payments Chancellor Rachel Reeves will deliver Labour’s first Budget on Wednesday the 30th of October. Ahead of the budget, I wrote to the Chancellor calling for an immediate halt to the ending of Winter Fuel Payments and reconsideration of these plans in time for the Budget. According to Age UK, 8400 people in my constituency are set to be affected by these cuts, … Continue reading October Newsletter\nSeptember Newsletter\nRead the latest news, events and updates in my September newsletter. Continue reading September Newsletter\nNewly renovated Salford Quays Mosaics unveiled by Rebecca Long-Bailey MP and Tommy Charlton, brother of Sir Bobby Charlton\nSalford’s Member of Parliament, Rebecca Long-Bailey MP, and Tommy Charlton, brother of the late footballing legend Sir Bobby Charlton, officially re-launched the Quays Mosaic Trail in the heart of Salford Quays. 21 years ago this September Sir Bobby Charlton formally launched the Quays Mosaic Trail. Following recent restorations, Rebecca unveiled the new plaque for The Quays Mosaic Trail with Tommy Charlton, as a Guest of … Continue reading Newly renovated Salford Quays Mosaics unveiled by Rebecca Long-Bailey MP and Tommy Charlton, brother of Sir Bobby Charlton"
}