{
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-visits-salus-global/content_37.html": "Richard recently visited Salus Global in Billericay.\nSpeaking after the visit, Richard said:\n\"It was a pleasure to meet with Marc Sansom at Salus Global who just happens to have its office opposite mine in Billericay!\nSalus Global is a world leader in hospital design and development and brings together from across the UK, Europe and the world at their leading expert conferences too. Plus it is based in the heart of our community!\nIt’s amazing to learn about different businesses right on our doorstep that contribute so much in every area.\nI’ll be doing my best to support and connect them in the future alongside all other businesses in our local area.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-criticises-labours-emergency-budget/content_45.html": "Following from the Chancellor's Spring Statement, Richard has provided his views on what was announced.\nSpeaking, Richard said:\n\"Yesterday’s Emergency Budget gave Labour and Rachel Reeves a chance to reverse the damage they have done to our economy from the decisions they took to massively hike taxes last year. Including the massive national insurance rise that is going to hammer small firms, GPs, schools and hospices.\nBut despite Britain’s economic growth forecast being halved as the tax burden on working people reaches record highs, Labour did not reverse the decisions and doubled down on damage.\nWe’ve now seen:\nGrowth halved\nInflation up\nInterest on debt SOARING\nAND\nUnemployment expected to rise for the next 3 years\nRachel Reeves has lost all credibility.\nEven the traditionally very pro-Labour newspapers, like the Guardian and Mirror are calling out Labour’s largest disastrous emergency budget.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_category_Opinions/content_10.html": "Richard speaks to Gateway 97.8 6th September 2024 Richard joined Johnny Jenkins in the studio for his first interview since the election in July. Listen here. Opinions\nRichard Holden MP appears on BBC Essex to talk about becoming the New MP for Basildon and Billericay. 5th August 2024 Richard Holden MP appears on BBC Essex Breakfast Show to talk about becoming the New MP for Basildon and Billericay. Listen here. Opinions",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-visits-cloud9/content_18.html": "Richard recently visited Cloud9 on the High Street in Billericay.\nSpeaking after the visit, Richard said:\n\"Every week I meet local businesses big and small. Recently I met with Neil, owner of Cloud9 Espresso Bar & Kitchen in Billericay, to chat about his high street businesses and how Government policy is affecting small businesses like his.\nIt’s clear that the rising costs from Business Taxes, especially national insurance and business rates are astronomical and really pose an existential threat for small businesses like Cloud9.\nTo be landed with higher taxes and bills, and then much higher staffing costs, takes away any incentive to open and run a small business. And when the government is also pushing a massive expansion of red tape that further harms business and their willingness as well as ability to employ people.\nSMEs are the backbone of British business, and Labour’s anti-growth policies need to be challenged and reversed ASAP.\nI will keep putting pressure on the Government in Parliament until they realises how damaging these measures are and will continue to urge them to change course.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_cdn-cgi_l_email-protection/content_26.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_about-rss/content_4.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_good-news-story-week-housing-tenancy-passed-down/content_20.html": "Richard's Good News Story of the Week concerns a housing tenancy agreement being passed down through a family.\n\"Mrs T from Basildon got in touch with me earlier this month to ask for my help with her family’s housing situation. There needed to be a tweak to her tenancy agreement so her mother in law could also live with the family, crucially also helping provide much needed help with the children.\nAfter half a year of emails and calls, Mrs T and her family were no closer to an end sight. Once she told me and my team the issue, I immediately contacted her social housing provider to establish the situation and find out what the hold up was.\nAfter some initial investigations, it’s clear that the social housing provider were initially unwilling to keep their word and help out.\nHowever, I’m very pleased to announce that after some back and forth, the social housing provider will honour the agreement and have conducted their due diligence checks to ensure they can change the tenancy and get them all into a new property.\nMrs T was stuck in system, waiting for a reply which was taking way too long and impacting on her family. As your MP, I am always happy to help move things along when they get stuck.\nWhilst I won't be able to get success with every case, my team and I will always do our best to help every constituent who comes to us. Do not hesitate to get in touch via www.richardholden.org.uk/contact.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richards-echo-column-threat-our-local-economy-very-real/content_2.html": "“In April, I’ve found time to visit lots of schools to give them an insight to what their MP does – and to show I’m a real person fighting for them! It’s been a pleasure meeting so many students and answering so many questions, and it’s very encouraging to see that our next generation has such a keen interest in our democracy. Men and women fought and died for our country’s survival, and I’m sure they’ll be very proud of those following in our footsteps for their dedicated to Great Britain.\nI’ve also been visiting so many local businesses across Basildon and Billericay recently to hear directly from them what impact this Labour Government is having on them. The threat to our local economy – and the national one too – is very real. Businesses are telling me they are facing astronomical increases in costs, from the rise in National Insurance to the increase in National Minimum Wage, and even the doubling of business rates following the Government’s cut to the rates relief. Labour’s actions will certainly lead to job losses and a recession, their anti-growth policies go directly against what they are preaching to the media.\nWe also have the ongoing attacks on our Green Belt land by the Government and the Council. Thousands of homes will be pushed onto land suddenly considered “grey belt” despite no history of development there. And will there be new roads, or schools, or any kind of infrastructure? No chance! Not until they’ve finally joined up Romford to Shoeburyness. The Conservatives, nationally and locally, continue to fight against this deeply inappropriate and ill-thought-out policy of destroying our Green Belt all to cover up the Labour Mayor of London’s failure to build new homes.\nLastly, I’m very pleased to report I’m on over 7,200 pieces of casework since becoming the MP for Basildon and Billericay. My team and I are here to help, and I’ve had some brilliant wins that I post on my Facebook and website. If any readers need help from me and my team, perhaps you’re stuck in the system and you’re up against “computer says no”, then get in touch via my website: https://www.richardholden.org.uk/contact.”",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-hosts-community-pastors-parliament/content_35.html": "Richard recently hosted the Community Pastors from Billericay for a visit to Parliament.\nSpeaking after the visit, Richard said:\n\"My team and I were delighted to host our local community pastors in Parliament!\nWe host many school visits too as well as groups of young people for a real range of organisations\nIf you run a group and are interested in a visit, get in touch with me and the team via www.richardjolden.org.uk/contact and we can link you up with the team in Parliament to make it happen!\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richards-echo-column-commemorative-events-are-honour/content_23.html": "\"On Remembrance Sunday and on Monday 11th November, residents across Basildon and Billericay will join the nation marking the service and sacrifice of the many brave men and women from across our towns and villages who gave their lives so that we could live without fear and enjoy the freedoms we hold so dear.\nOne of the highest honours of being your Member of Parliament is being able to represent my constituents at commemorative events in the days leading up to and on Armistice Day.\nLast week I placed a remembrance cross for all those across the constituency who made the ultimate sacrifice in the Parliamentary Garden of Remembrance in Parliament. I was also honoured to speak in the Remembrance and Veterans debate in the House of Commons, it was wonderful to be able to mention one of our local heroes, D-Day veteran Don Sheppard, who died earlier this year at 104 years old.\nEvery year, the Royal British Legion invites MPs to support and raise awareness for the Poppy Appeal, this year it is to cycle as far as they can in 5 minutes to help raise vital funds. While being a bit of fun it is also an important way for parliamentarians to play their part in raising awareness, especially amongst younger generations, about the need to continue to support our veterans.\nAhead of Remembrance Sunday, I’ll be visiting all the war memorials in Basildon and Billericay and look forward to joining residents in Billericay on Sunday at 11am and in Laindon in the afternoon. Cllr Jeff Henry will be laying the wreath in Basildon on my behalf on Sunday morning and I will be in Basildon at 11am on Armistice Day itself.\nIf you can’t make it to one of the events taking place, then I strongly encourage you to visit your local memorial at some point for a moment of contemplation of those who gave their tomorrows for our today.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-supports-tool-theft-bill/content_25.html": "Richard is supporting the Theft of Tools of Trade (Sentencing) Bill that is currently progressing through Parliament.\nSpeaking about the Bill, Richard said:\n\"I’m backing the Stop Tool Theft Bill to make sentencing harsher for those that steal tools from hardworking people.\nThere’s lots of people in Basildon and Billericay that rely on the tools in their van to make a living, and it’s totally unacceptable that they are at a heightened risk of being targeting by criminals.\nI’ve also had it reported to me about hotspot locations where vans are targeted, and I have been raising this with Essex Police. That’s why I’m very happy to see the police successfully catching criminals red-handed in Rainham who stole a whopping £50,000 worth of tools from our area.\nThis Bill would act as a further deterrent to thieves but to also punish them for their audacity when stealing tools, and I’ll be giving my full support to get it over the line.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-highlights-ve-day-events/content_41.html": "On Thursday 8th May, we will be marking the 80th anniversary of Victory in Europe. There’s plenty of events across Basildon and Billericay for local people to attend and pay their respects to the heroes of the Second World War.\nI raised in Parliament recently about encouraging all local councils to hold VE Day events and I’m very pleased to confirm the below events for this year’s VE Day locally.\nFirstly, on Monday 5th May from 10.30am until 2.30pm, there is a VE Day Commemoration at the South Green Memorial Hall.\nThen, on VE Day itself, Thursday 8th May, there is a Flag Raising at the Basildon Centre at 9am. After that, in there evening, there are several Beacon Lighting Ceremonies across Basildon and Billericay. You can find the details and location of each one below:\n• Basildon – Gloucester Park from 9pm until 9.30pm\n• Billericay – Sun Corner from 8.30pm until 9.30pm\n• Laindon – Pound Lane from 8.30pm until 10pm\n• NoakBridge – Wash Road from 7.30pm until 10pm\n• Vange – Swanmead from 8.45pm until 9.30pm\nAlso, you can tune in to the national events being shown live on TV. On Monday 5th May, at 11.30am, there will be a Military Procession from the Cenotaph to Buckingham Palace followed by a Flypast and HMS Belfast gun salute at 1pm.\nOn the 8th May, there is a service in Westminster Abbey Service at 11.30am and a concert on Horse Guards Parade Ground at 7.30pm both of which will be on TV as well.\nI hope to see as many people as possible across these events as we celebrate and commemorate #VEDay80!",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_accessibility/content_6.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_category_Local-News/content_31.html": "Richard visits Cloud9 2nd May 2025 Richard recently visited Cloud9 on the High Street in Billericay. Speaking after the visit, Richard said: \"Every week I meet local businesses big and small... Local News\nRichard visits Salus Global 1st May 2025 Richard recently visited Salus Global in Billericay. Speaking after the visit, Richard said: \"It was a pleasure to meet with Marc Sansom at Salus Global who... Local News\nRichard visits Asda Eastgate 29th April 2025 Richard recently visited Asda Eastgate with PFCC for Essex, Roger Hirst, to discuss retail crime in the local area. Speaking after the visit, Richard said: \"I... Local News\nGood News Story of the Week: Housing Tenancy Passed Down 29th April 2025 Richard's Good News Story of the Week concerns a housing tenancy agreement being passed down through a family. \"Mrs T from Basildon got in touch with me earlier... Local News\nRichard hosts Community Pastors in Parliament 28th April 2025 Richard recently hosted the Community Pastors from Billericay for a visit to Parliament. Speaking after the visit, Richard said: \"My team and I were delighted... Local News\nRichard visits ATF at Millhouse Primary 26th April 2025 Richard recently visited ATF at Millhouse Primary for their sporting session. Speaking after the visit, Richard said: \"It was fantastic to meet Stuart and his... Local News\nRichard highlights VE Day Events 25th April 2025 On Thursday 8th May, we will be marking the 80th anniversary of Victory in Europe. There’s plenty of events across Basildon and Billericay for local people to... Local News\nRichard visits Basildon Hospital's Maternity Ward 24th April 2025 Richard visited the maternity ward at Basildon Hospital recently. Speaking after the visit, Richard said: \"I recently visited the maternity ward at Basildon... Local News\nRichard visits Buttsbury Primary School 22nd April 2025 Richard recently visited Buttsbury Primary School to talk to them about his role as an MP. Speaking after the visit, Richard said: \"Following on from meeting Mr... Local News",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-supports-marie-curie-parliament/content_34.html": "Richard met with Marie Curie in Parliament at their MP drop-in event. Speaking after the meeting, Richard said:\n\"I was delighted to meet Alison from Marie Curie and fictional Billericay local, star of Gavin and Stacey, Larry Lamb - who is a big supporter of Marie Curie - in Parliament today as we promote their work across the UK.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_surgeries-0/content_29.html": "I hold surgeries most weeks for constituents who want to discuss issues effecting them – I’ve spoken to people about an enormous range of things, from housing problems and benefits issues to people having issues with their bin collections to people who have concerns about their mobile phone contracts.\nI want to stress that, whatever the problem is, my team and I will try to help in any way that we can. Where we cannot or unable, we will be transparent and honest.\nIf you would like to request to attend a surgery, please email [email protected].\nStrict Parliamentary protocol states that I can only deal with constituents of Basildon & Billericay, so please include your full name, address (including postcode) and contact details in the email. Please also include details of the issue you would like to discuss. This will all be kept fully confidential.",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-celebrates-world-book-day/content_32.html": "Today was World Book Day. Speaking about the event, Richard said:\n\"Happy World Book Day to all my constituents in Basildon and Billericay. Sadly, reading for pleasure amongst children is at an all-time low, with only 1 in 3 children saying they enjoy reading.\nWe have brilliant libraries in Billericay, Laindon, Fryerns, and Basildon, so why not take your child out to find a book they'd really love!\nIt was lovely to pop down to Laindon Library with Cllr Jeff Henry recently who regularly uses the Library for his surgeries in Laindon, as I did today too! He’s also recently ensured that alongside repair works to the roundabout the area outside the library has been tidied up to make it more open, accessible and appealing.\nMassive thanks to the everyone involved in the campaign for keeping up the work to get kids reading.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_category_European-News/content_36.html": "Richard Holden on Government Help for Ukrainians 14th March 2022 Help for the most vulnerable Ukrainians from the U.K. Government and how you at home can assist. A statement from Richard Holden MP: \"None of us could have... European News",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_contact/content_17.html": "If you are seeking support about a matter affecting you personally, please fill in the form below and my team and I will get in touch with you. Alternatively, if you do not have access to an email address, you can write to my constituency office at 16 Western Road, Billericay, Essex, CM12 9DZ with your full name, postal address and telephone number.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richards-echo-column-supporting-farmers-and-our-pensioners/content_46.html": "\"The bitterly cold weather that has hit Essex reminds us that winter has definitely arrived and while we can soon look forward to celebrating Christmas with family and friends, the impact from the Budget is going to be felt through the winter into 2025 and for years to come.\nNovember is when pensioners across Basildon and Billericay should be receiving their Winter Fuel payments. Sadly, due to the political choice made by Labour, hundreds of pensioners will not receive the payment this year and will have to choose between heating and eating.\nLast week saw farmers across the county and the UK descend on Westminster to protest Labour’s Family Farm Tax plans. Under the proposals, and despite promises made in the past to protect farmers, more than 100,000 farms will be hit by new inheritance tax laws.\nThis is not only devastating for family farms, but this will also pose a serious risk to our domestic food security and could lead to higher food prices.\nI was pleased to join Conservative MPs standing in support of our farming community. In the House of Commons, I recently raised concerns from workers at the New Holland tractor plant and I’m receiving correspondence from others who are really worried about the impact this policy will have.\nAnd farms aren’t the only businesses being hammered. In another broken manifesto commitment, Labour have imposed a £25bn National Insurance Jobs Tax that is already deterring businesses locally from recruiting. It will push up prices and sadly will more than likely lead to some businesses here closing.\nLast Wednesday we had the terrible news that Ford will be cutting 800 UK jobs. I’m very concerned for staff at Dunton and I’m seeking an urgent meeting with the Director after raising the matter with the Department for Transport.\nThese changes in the Budget are damaging our economy and harming our community. Let’s hope the Government will reconsider the damage its doing and change course before it’s too late.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_cookies/content_22.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-supports-pancreatic-cancer-survivors/content_48.html": "Richard attended a drop-in about pancreatic survivors.\nSpeaking after the event, Richard said:\n\"I recently met with pancreatic cancer survivors to hear the impact of ongoing shortages of pancreatic enzyme replacement therapy (PERT), which thousands of people rely upon daily to digest food and absorb nutrients. Without PERT tablets, people with pancreatic cancer can experience debilitating symptoms, are less able to tolerate treatment, have poorer quality of life and can even be at risk of starvation.\nSupplies of the essential medication have been disrupted for over a year and the problem is set to last until at least 2026 due to production problems at the main plant supplying the UK and increasing demand for the medication.\nPancreatic Cancer UK estimates the shortages could be affecting 61,152 people across the UK - which means around 100 families in Basildon and Billericay. As well as the pancreatic cancer community, people with cystic fibrosis, chronic pancreatitis and neuroendocrine cancers also can be reliant on PERT too.\nMore must be done to ensure that PERT is available when people need it and I’ll keep pressing minister to ensure the situation gets resolved asap.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_category_Speeches-in-Parliament/content_43.html": "Richard Holden MP wins ‘Parliamentarian of the Year’ from the APPG on Beer and launches ‘Pub of the Year’ competition in North West Durham 21st July 2022 Richard Holden MP understands the vital role of pubs and clubs in our towns and villages. This week, for his campaigning work – leading over 100 fellow MPs to... Speeches in Parliament\nGovernment Bans 'Virginity Tests' following Richard Holden MP's Campaign 26th November 2021 Richard Holden MP, speaking to GB News on 26 November, about Banning So-Called “Virginity Testing” and Hymenoplasty. \"This week the Government accepted in full... Speeches in Parliament\nRichard Holden gives his maiden speech 20th January 2020 Richard Holden, MP for North West Durham, today gave his maiden speech in the House of Commons – you can watch his full speech here. Richard spoke about a... Speeches in Parliament",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-supports-community-pharmacies/content_33.html": "Richard attended a drop-in event in Parliament to discuss community pharmacies.\nSpeaking after the event, Richard said:\n\"It was really interesting to hear more about the crucial role community pharmacies play in Basildon and Billericay. Pharmacy teams are doing great work delivering care closer to home, but I heard loudly and clearly that more support is needed to ensure they are able to continue to provide what the NHS and, crucially, members of the public, need.\nWe must protect our community pharmacies, and work closely with local pharmacists to ensure they have sufficient resources to keep pharmacy doors open, so I’m grateful for Community Pharmacy England for hosting an event in Parliament.\nI’m visiting the pharmacy in Noak Bridge next week to learn more about the issues facing them on a local level and where the Government needs to step up, especially after its decision to reorganised the NHS in England.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-visits-atf-millhouse-primary/content_12.html": "Richard recently visited ATF at Millhouse Primary for their sporting session.\nSpeaking after the visit, Richard said:\n\"It was fantastic to meet Stuart and his team from Achievement Through Football alongside Cllr Louise McKinlay at Millhouse Primary in Laindon to see the important work they are undertaking with local children. It was really moving to hear from their coaches about their own personal stories and how ATF and sport in general helped put them on the right track in life.\nThe Holiday Activity programme, set up by the last government, has been instrumental in providing a really positive environment to children from low-income families and areas. I’m especially pleased with how Essex County Council has been providing funding to continue these activities for children outside of school term times.\nI am urging the new Government to continue this funding which, through groups like ATF, is making such a positive impact in Basildon and Billericay, and more widely across South Essex, vital funding that is targeted at the most vulnerable.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-hosts-sunnymede-primary-parliament/content_42.html": "Richard recently hosted Sunnymede Primary for a visit to the Houses of Parliament.\nSpeaking after the visit, Richard said:\n\"It was fantastic to meet Mrs Houghton and students from Sunnymede in Parliament to chat to them about my work as their MP and answer their many questions. Normally, it’s me visiting the students in their school, so it was an absolute pleasure to have them come to me this time!\nIt would be amazing to have all the schools in Basildon and Billericay visit Parliament at least once, and I’m happy to put any schools in touch with the Education and Engagement team - just drop me a message via www.richardholden.org.uk/contact.\nI have plenty more school visits coming up on the ground across Basildon and Billericay and I am on track to visit every one of our local schools. Ensuring all our children have an understanding of politics and importantly access to their local MP.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-visits-asda-eastgate/content_14.html": "Richard recently visited Asda Eastgate with PFCC for Essex, Roger Hirst, to discuss retail crime in the local area.\nSpeaking after the visit, Richard said:\n\"I was pleased to meet with Asda’s store staff and Roger Hirst to hear their real concerns and irritations and work out ways we can reduce retail crime in Basildon and Billericay. The meeting showed that we have a challenge ahead of us and it is of the utmost importance we all work together to reduce crime.\nI’ll be working with Roger to set up a roundtable with more businesses from Basildon and Billericay to hear directly about their experiences and suggestions to cut retail crime, and ultimately make shopping a safer, cheaper and more enjoyable experience.\nOur town centres can only really thrive if people feel safe to shop there and getting the right security and policing response in place is crucial.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news/content_11.html": "Richard visits Cloud9 Friday, 2 May, 2025 Richard recently visited Cloud9 on the High Street in Billericay. Speaking after the visit, Richard said: \"Every week I meet local businesses big and small. Recently I met with Neil, owner of Cloud9 Espresso Bar & Kitchen in Billericay, to chat about his high street businesses and how Government policy is affecting small businesses like his. It’s clear that the rising costs from Business Taxes... Local News\nRichard visits Salus Global 1st May 2025 Richard recently visited Salus Global in Billericay. Speaking after the visit, Richard said: \"It was a pleasure to meet with Marc Sansom at Salus Global who... Local News\nRichard's Echo column: Threat to our local economy is very real 30th April 2025 “In April, I’ve found time to visit lots of schools to give them an insight to what their MP does – and to show I’m a real person fighting for them! It’s been a... Articles\nRichard visits Asda Eastgate 29th April 2025 Richard recently visited Asda Eastgate with PFCC for Essex, Roger Hirst, to discuss retail crime in the local area. Speaking after the visit, Richard said: \"I... Local News\nGood News Story of the Week: Housing Tenancy Passed Down 29th April 2025 Richard's Good News Story of the Week concerns a housing tenancy agreement being passed down through a family. \"Mrs T from Basildon got in touch with me earlier... Local News\nRichard hosts Community Pastors in Parliament 28th April 2025 Richard recently hosted the Community Pastors from Billericay for a visit to Parliament. Speaking after the visit, Richard said: \"My team and I were delighted... Local News\nRichard visits ATF at Millhouse Primary 26th April 2025 Richard recently visited ATF at Millhouse Primary for their sporting session. Speaking after the visit, Richard said: \"It was fantastic to meet Stuart and his... Local News\nRichard highlights VE Day Events 25th April 2025 On Thursday 8th May, we will be marking the 80th anniversary of Victory in Europe. There’s plenty of events across Basildon and Billericay for local people to... Local News\nRichard visits Basildon Hospital's Maternity Ward 24th April 2025 Richard visited the maternity ward at Basildon Hospital recently. Speaking after the visit, Richard said: \"I recently visited the maternity ward at Basildon... Local News\nRichard supports the Tool Theft Bill 23rd April 2025 Richard is supporting the Theft of Tools of Trade (Sentencing) Bill that is currently progressing through Parliament. Speaking about the Bill, Richard said: \"I... Westminster News",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_parliament/content_7.html": "Richard Holden MP Slams Russia Over The Invasion Of Ukraine and Backs Prime Minister.\nRichard said: \"Today’s invasion by Russia of Ukraine is a catastrophe for our continent and the world.\n\"Aggressive military action against democratic countries must always face the most severe consequences.\n\"I w",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-speaks-gateway-978/content_44.html": "Tweet Friday, 6 September, 2024 Opinions Richard joined Johnny Jenkins in the studio for his first interview since the election in July.Listen here.\nRichard visits Cloud9 Friday, 2 May, 2025 Richard recently visited Cloud9 on the High Street in Billericay.Speaking after the visit, Richard said:\"Every week I meet local businesses big and small.",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_privacy/content_3.html": "This document outlines how Richard Holden processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Richard Holden\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Richard Holden.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Richard Holden, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Richard Holden via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_visitparliament/content_47.html": "Parliament is free and open to all British and Commonwealth subjects during sitting days. However, should you wish to visit as part of a school, apply to attend Prime Minister’s Questions or have a guided tour of Parliament, different rules apply. In all cases (except PMQs) bookings can made online or by calling the bookings team on 0207 219 4114.\nRichard Holden is always delighted when constituents visit Parliament and will do everything he can to meet them if they wish as part of their visit.\nPlease be advised that all visitors must pass through airport-style security.\nAttending Debates (free, no booking)\nAnyone can visit Parliament for free to watch a public Parliamentary Proceeding, this includes Debates in the House of Commons & House of Lords, as well as other proceedings such as Committee meetings. No booking is required. Certain parts of Parliament such as Westminster Hall and Central Lobby are usually open to the public for browsing, which you can do in your own time. More info\nTour of Parliament (free for UK residents, booking required)\nUK residents can book free 75-minute tours before the House begins Sitting most mornings. Note tours do not include the House of Commons Chamber on Thursdays. During non-sitting days (most Fridays & Saturdays) Parliament operates commercial tours which can be purchased online. All options must be booked in advance. Other free options include an Online Guided Tour. Book online\nAttending Prime Minister’s Questions (free, limited spaces, request through your local MP Office)\nIf you want to attend Prime Minister’s Questions on a Sitting Wednesday (note not during school holidays) then you have to request tickets through your local MP’s office. Spaces are very limited and MPs can only apply for 2 tickets per month. Even so, application on behalf on constituents does not guarantee success, as if a certain week proves popular space allocations for MP guests will be balloted. If you wish to request to watch PMQs then please let us know as far in advance as possible as this increases your chance of success. Please also be aware that as both Houses sit on Wednesdays, it is not possible to then be toured following PMQs as the Chambers are restricted to Parliamentarians.\nSchool Visits (free, booking required)\nSchools and other education institutions should book to visit Parliament through the Education Centre. Students can then enjoy a unique learning experience, as well as get to see history being made first-hand with a tour of the Houses of Parliament. Education session can also include a Q&A with Richard Holden MP, subject to parliamentary business. School visits are usually booked a term in advance. Book school visit",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_category_Westminster-News/content_13.html": "Richard supports the Tool Theft Bill 23rd April 2025 Richard is supporting the Theft of Tools of Trade (Sentencing) Bill that is currently progressing through Parliament. Speaking about the Bill, Richard said: \"I... Westminster News\nRichard highlights World Parkinson's Day 11th April 2025 Richard is highlighting that today is World Parkinson's Day. Speaking about the day, Richard said: \"To mark World Parkinson's Day, I met with Parkinson's UK and... Westminster News\nRichard hosts Sunnymede Primary in Parliament 4th April 2025 Richard recently hosted Sunnymede Primary for a visit to the Houses of Parliament. Speaking after the visit, Richard said: \"It was fantastic to meet Mrs... Westminster News\nRichard supports Community Pharmacies 3rd April 2025 Richard attended a drop-in event in Parliament to discuss community pharmacies. Speaking after the event, Richard said: \"It was really interesting to hear more... Westminster News\nRichard supports Pancreatic Cancer Survivors 31st March 2025 Richard attended a drop-in about pancreatic survivors. Speaking after the event, Richard said: \"I recently met with pancreatic cancer survivors to hear the... Westminster News\nRichard criticises Labour's Emergency Budget 27th March 2025 Following from the Chancellor's Spring Statement, Richard has provided his views on what was announced. Speaking, Richard said: \"Yesterday’s Emergency Budget... Westminster News\nRichard celebrates World Book Day 6th March 2025 Today was World Book Day. Speaking about the event, Richard said: \"Happy World Book Day to all my constituents in Basildon and Billericay. Sadly, reading for... Westminster News\nRichard supports Marie Curie in Parliament 5th March 2025 Richard met with Marie Curie in Parliament at their MP drop-in event. Speaking after the meeting, Richard said: \"I was delighted to meet Alison from Marie Curie... Westminster News\nRichard meets with Buttsbury Primary School in Parliament 20th February 2025 Richard recently met with Buttsbury Primary School when their Deputy Headteacher visited Parliament. Speaking after the meeting, Richard said: \"I met Mr Graves... Westminster News",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-holden-mp-appears-bbc-essex-talk-about-becoming-new-mp-basildon-and-billericay/content_16.html": "Tweet Monday, 5 August, 2024 Opinions Richard Holden MP appears on BBC Essex Breakfast Show to talk about becoming the New MP for Basildon and Billericay. Listen here.\nRichard visits Cloud9 Friday, 2 May, 2025 Richard recently visited Cloud9 on the High Street in Billericay.Speaking after the visit, Richard said:\"Every week I meet local businesses big and small.",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-highlights-world-parkinsons-day/content_19.html": "Richard is highlighting that today is World Parkinson's Day.\nSpeaking about the day, Richard said:\n\"To mark World Parkinson's Day, I met with Parkinson's UK and people affected by the condition to hear about the support that Parkinson’s UK provides, at every stage in a Parkinson’s journey in Basildon and Billericay and across the country.\nParkinson’s affects so many families and one of my grandmothers had the condition in her last few years alongside dementia, which made things doubly tough at times.\nI recently met volunteers who shared what life with Parkinson’s is like and the particular challenges they have faced. There are around 153,000 people living with Parkinson’s in the UK and we must do everything we can to ensure they are supported.\nParkinson’s UK provides all types of support from a listening ear through to specialist support with care, employment and benefits. As your MP, I’m here to support you too.\nIf you need help or advice, please don’t hesitate to contact me as your local MP, or to find out what's available via Parkinson’s UK locally on www.parkinsons.org.uk or ring their helpline 0808 800 0303.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_how-can-I-help-you/content_30.html": "Who?\nIf you are a constituent of Basildon & Billericay, this means Richard Holden is your Member of Parliament, and as such can respond to your queries and raise concerns on your behalf to 'seek redress of grievance' or make an issue public.\nIf you are not a constituent then sadly Richard Holden is unable to assist you, even if he wanted to, due to strict Parliamentary Convention. You can check who your MP is at: www.writetothem.com\nWhat?\nThere are many reasons as to why you may choose to contact your Member of Parliament. This may include but is not limited to:\n- Issues/queries with benefits, pensions, etc, associated with the work of the Department for Work and Pensions.\n- Immigration issues.\n- Tax issues.\n- NHS problems.\n- Child maintenance.\n- School issues.\n- Issue with or opinion on National Government policy.\n- Comments on Bills passing through Parliament, Mr Holden’s House of Common’s debates, or a\n- Local campaign you find worthy.\nHow?\nMr Holden has an office in Parliament that deals with national policy issues, and a constituency office in Billericay which deals with local and personal issues constituents may have.\nKeeping the issue private, Richard Holden might write to the relevant department or official, send a letter to the appropriate Minister or make a personal appointment to discuss the issue. These steps can often go a long way to providing a solution.\nHe may decide to make the issue public by raising it in the House of Commons, where it will be officially recorded, and could potentially come to the attention of the press and public.\nOutside Parliament, Richard Holden may speak at an event concerning the issue, pledge his support to a campaign or write to the local media.\nWhen?\nFor policy matters, Richard Holden aims to write back to you within 2 weeks. Some matters take longer if, for example, we are awaiting replies from Government departments or external bodies, etc.\nFor personal matters, we aim to reply to you initially by email within 3 working days. Please be aware that urgent personal matters are prioritised to a same or next day initial response. Richard Holden will then write to you with his final response after relevant enquiries have been made. How long it takes depends on how long third parities, such as Basildon Council or Essex County Council, take to write back to us.\nSurgeries?\nSometimes, it might be appropriate to hold a surgery meeting with Richard Holden about your personal matter. If your query is about policy, he will usually reply in writing. Richard Holden's office will always try to assist you before offering a surgery appointment as this will often delay matters. Requests are prioritised and facilitated at his local office in Billericay or at a public site such as Basildon Library.\nWhat can your MP not do?\nYour MP cannot:\n- Give legal advice.\n- Intervene in private or civil matters.\n- Direct authorities to change a decision.\n- Advise on financial matters.\n- Breach the 'separation of powers' between the Courts and Parliament.\n- Express disloyalty to His Majesty The King, his heirs or successors.\nContact\nAll correspondence, if electronic, should be sent to [email protected].\nYou can also write to The Rt Hon Richard Holden MP, House of Commons, London SW1A 0AA (for matters of policy) or to The Rt Hon Richard Holden MP, 16 Western Road, Billericay, Essex CM12 9DZ (for personal matters).",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-holden-mp-russian-invasion-ukraine/content_39.html": "Richard Holden MP Slams Russia Over The Invasion Of Ukraine and Backs Prime Minister.\nRichard said: \"Today’s invasion by Russia of Ukraine is a catastrophe for our continent and the world.\n\"Aggressive military action against democratic countries must always face the most severe consequences.\n\"I will support whatever sanctions our Government push for and hope that our European allies step up to the plate, alongside our friends in North America and across the world, to make them as tough as possible so that the free world speak with a united voice.\n\"Our Prime Minister is speaking to fellow G7 leaders today and is calling for an urgent meeting of all NATO leaders as soon as possible, as well as making a further statement in the House of Commons at 5pm today.\"",
  "https_www_richardholden_org_uk_/http_www_richardholden_org_uk_contact/content_24.html": "If you are seeking support about a matter affecting you personally, please fill in the form below and my team and I will get in touch with you. Alternatively, if you do not have access to an email address, you can write to my constituency office at 16 Western Road, Billericay, Essex, CM12 9DZ with your full name, postal address and telephone number.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_feed/content_21.html": null,
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-meets-buttsbury-primary-school-parliament/content_27.html": "Richard recently met with Buttsbury Primary School when their Deputy Headteacher visited Parliament.\nSpeaking after the meeting, Richard said:\n\"I met Mr Graves, the Deputy Headteacher, and Ms Hall of Buttsbury Primary School in Parliament to celebrate them achieving accreditation with the British Council International School Award (ISA)!\nThe British Council’s ISA is a framework for schools to incorporate international elements to their curriculum teaching, in Buttsbury’s case a fantastic link up with a school in our Commonwealth partner Kenya! This helps prepare young people for work in a global economy by increasing their understanding of other languages, cultures but more importantly the things that we all have in common.\nA huge congratulations to all the team at Buttsbury on this great acheivement for a fantastic local school and I look forward to visiting them very soon!\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_rt-hon-richard-holden-mp/content_15.html": "Richard was first elected in December 2019 as the first ever Conservative Member of Parliament for North West Durham. Following the abolition of that seat by the Boundary Commission, Richard became the Parliamentary candidate for Basildon & Billericay, Essex, where he was re-elected to Parliament in the July 2024 General Election.\nBorn in Blackburn, Richard grew up in the Pennine village of Grindleton, near Clitheroe. He attended the local village primary school and passed the 11+ to go to a grammar school in Skipton, North Yorkshire. He went to sixth form in Blackburn before going on to study at the London School of Economics (LSE), where he graduated in 2007.\nSince then, he has worked in both the public and private sectors, as well as in politics in London. Before becoming an MP, he worked as Deputy Head of Press for the Conservative Party Headquarters and as a Special Adviser to the Secretaries of State for Education, Defence, Transport and in the House of Lords.\nFollowing his election, Richard has been very active on behalf of his constituency, both locally and in Parliament, raising issues such as transport infrastructure, jobs and the economy, farming, and lobbying for a replacement to Shotley Bridge Hospital. He is also involved in national campaigns to better regulate gambling, provide better mental health services and help prevent suicide, and for environmental protection.\nRichard served on the Public Accounts Committee from 2019-2022, which holds the Government to account for how taxpayers’ money is spent. He is also on the European Statutory Instruments Committee, which scrutinises all regulations that the Government is making during the transition period following our exit from the European Union. In addition, Richard was part of UK parliamentary delegations to overseas bodies for democracy, such as the Council of Europe and the Inter-Parliamentary Union.\nSince being elected to Parliament, Richard has led successful campaigns to change Government policy. Within weeks of being elected he successfully convinced the Chancellor of the Exchequer to reverse the 'Motorhomes Tax' - an EU regulation that had caused a huge rise in tax on motorhomes.\nSubsequently Richard has helped introduce a new draught beer duty for pubs and changed the law through the Health and Care Act to ban Virginity Testing and so-called hymen repair procedures. Richard also successfully campaigned in Parliament to extent the Automatic Enrolment of Pensions to 18 year-olds in order to boost the financial retirement prospects of millions across the UK.\nIn February 2022 Richard was promoted to Parliamentary Private Secretary (PPS) to the Department for Digital, Culture, Media and Sport. This is an unpaid assistant role, acting as the 'eyes and ears' for the Department in the House of Commons, carried out in addition to his role as a Backbench MP. In September 2022 Richard was promoted to be the lead PPS to the Department for International Trade.\nRichard was graciously appointed Parliamentary Under Secretary of State at the Department for Transport by HM The King on 28 October 2022. His brief included roads, local transport, freight, and haulage. Richard proudly introduced the ‘Get Around for £2’ bus fair cap helping millions of people to save money on travel to work, and make the most of affordable days out.\nOn the 13 November 2023 Richard was appointed the Chairman of the Conservative Party by the Prime Minister. In addition to running the Conservative Party, Richard attended Cabinet and as such was appointed to His Majesty's Most Honourable Privy Council. This body act as advisers to The King, as such Richard is now styled The Right Honourable.\nFollowing the 2024 General Election result Richard resigned as Party Chairman in order to focus his time and energy on his new constituents in Essex.\nRichard has secured and set up a new constituency office, the first time in many years that Basildon and Billericay has had an MP with a high street office.\nHe enjoys cooking roasts, local pubs and walking in his spare time.",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk/content_1.html": "About Richard Latest from Richard Richard visits Cloud9 2nd May 2025 Richard recently visited Cloud9 on the High Street in Billericay. Speaking after the visit, Richard said: \"Every week I meet local businesses big and small... Local News Follow me on Facebook Am I your MP? Enter your postcode to confirm that Richard Holden is your candidate. Postcode Contact Richard Latest from Richard Richard visits Salus Global 1st May 2025 Richard recently visited Salus Global in Billericay. Speaking after the visit, Richard said: \"It was a pleasure to meet with Marc Sansom at Salus Global who... Local News Follow me on Twitter Who represents you? Enter your postcode to find your MP, councillors and other elected representatives. Richard in the media Latest from Richard Richard's Echo column: Threat to our local economy is very real 30th April 2025 “In April, I’ve found time to visit lots of schools to give them an insight to what their MP does – and to show I’m a real person fighting for them! It’s been a... Articles Follow me on Instagram Basildon & Billericay Map\nRichard visits Cloud9 2nd May 2025 Richard recently visited Cloud9 on the High Street in Billericay. Speaking after the visit, Richard said: \"Every week I meet local businesses big and small... Local News\nRichard visits Salus Global 1st May 2025 Richard recently visited Salus Global in Billericay. Speaking after the visit, Richard said: \"It was a pleasure to meet with Marc Sansom at Salus Global who... Local News\nRichard's Echo column: Threat to our local economy is very real 30th April 2025 “In April, I’ve found time to visit lots of schools to give them an insight to what their MP does – and to show I’m a real person fighting for them! It’s been a... Articles",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_work-experience/content_8.html": "I offer work experience opportunities to students from the constituency. The placement gives young people an insight in to local politics and a chance to boost their skills. Students will be able to help with a number of tasks:\n- Casework, depending on the age and ability of the student\n- Researching an issue\n- Taking press-cuttings\n- Writing press releases\n- Accompanying the MP to a meeting or event in the House or in the Constituency\n- Assisting with office duties\n- Answering queries from constituents, either by 'phone or by email\nPlease contact us to enquire about work experience in my office.",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richards-echo-column-help-businesses-survive-and-thrive/content_40.html": "\"Visiting Billericay Christmas Market last weekend really did re-enforce that we’re now just weeks from Christmas! I’m sure that many residents have been better than me in getting presents bought. Every year I try to get it done early, but inevitably it’s a mad rush days before!\nWhether you have everything bought already or, like me, you’ve left it to the last minute, I hope you will have made the decision to buy local where you can.\nIt goes without saying but small businesses are truly the lifeblood for our economy. They reflect our culture and tie our communities together. This weekend is Small Business Saturday, a day when we celebrate the contribution they make to our High Streets.\nIt’s no coincidence that this day takes place in December as businesses are in the midst of the festive shopping period. Unfortunately, our small businesses and family firms are under threat and many will be fearing for their future because of the Government’s Jobs Tax and slashing business rates relief.\nDespite promising not to raise National Insurance, Labour brought in a tax on jobs – which the Office for Budget Responsibility estimates will costs businesses an additional £800 per employee. This week Conservative MPs called on the Government to release the full impact assessment of their Jobs Tax, which they have refused to do.\nThis weekend I will be visiting some of the amazing small businesses across Basildon and Billericay and will continue to use my Facebook page to showcase them. I will also be formally opening my new constituency office on Western Road in Billericay, providing a high street presence as well as continuing holding surgeries in Basildon and visiting people in their homes too. Being clearly accessible with both my office, surgeries and visits is important and I wanted to send a signal too of how I value our High Streets and will do all I can to ensure they continue to thrive for years to come.\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_category_Articles/content_5.html": "Richard's Echo column: Threat to our local economy is very real 30th April 2025 “In April, I’ve found time to visit lots of schools to give them an insight to what their MP does – and to show I’m a real person fighting for them! It’s been a... Articles\nRichard's Echo column: Help businesses to survive and thrive 6th December 2024 \"Visiting Billericay Christmas Market last weekend really did re-enforce that we’re now just weeks from Christmas! I’m sure that many residents have been better... Articles\nRichard's Echo column: Supporting farmers and our pensioners 28th November 2024 \"The bitterly cold weather that has hit Essex reminds us that winter has definitely arrived and while we can soon look forward to celebrating Christmas with... Articles\nRichard's Echo column: Commemorative events are an honour 8th November 2024 \"On Remembrance Sunday and on Monday 11th November, residents across Basildon and Billericay will join the nation marking the service and sacrifice of the many... Articles",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_news_richard-visits-basildon-hospitals-maternity-ward/content_28.html": "Richard visited the maternity ward at Basildon Hospital recently.\nSpeaking after the visit, Richard said:\n\"I recently visited the maternity ward at Basildon Hospital to see their recent progress following a change in leadership.\nIt’s encouraging to see how dedicated the team on the wards are, from the newest nurse to the most experienced consultants and midwives, and that they are putting in a huge amount of effort to make the service as great as possible for mothers coming to give birth. It’s really pleasing to know that the Trust has listened to the feedback and views of patients and the CQC and has taken really positive steps to rectify the reported issues.\nIt was especially interesting to visit after seeing a couple of episodes of The Young Midwives of Essex tv show filmed in the hospital last year!\"",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_about-richard-holden/content_9.html": "Richard was first elected in December 2019 as the first ever Conservative Member of Parliament for North West Durham. Following the abolition of that seat by the Boundary Commission, Richard became the Parliamentary candidate for Basildon & Billericay, Essex, where he was re-elected to Parliament in the July 2024 General Election.\nBorn in Blackburn, Richard grew up in the Pennine village of Grindleton, near Clitheroe. He attended the local village primary school and passed the 11+ to go to a grammar school in Skipton, North Yorkshire. He went to sixth form in Blackburn before going on to study at the London School of Economics (LSE), where he graduated in 2007.\nSince then, he has worked in both the public and private sectors, as well as in politics in London. Before becoming an MP, he worked as Deputy Head of Press for the Conservative Party Headquarters and as a Special Adviser to the Secretaries of State for Education, Defence, Transport and in the House of Lords.\nFollowing his election, Richard has been very active on behalf of his constituency, both locally and in Parliament, raising issues such as transport infrastructure, jobs and the economy, farming, and lobbying for a replacement to Shotley Bridge Hospital. He is also involved in national campaigns to better regulate gambling, provide better mental health services and help prevent suicide, and for environmental protection.\nRichard served on the Public Accounts Committee from 2019-2022, which holds the Government to account for how taxpayers’ money is spent. He is also on the European Statutory Instruments Committee, which scrutinises all regulations that the Government is making during the transition period following our exit from the European Union. In addition, Richard was part of UK parliamentary delegations to overseas bodies for democracy, such as the Council of Europe and the Inter-Parliamentary Union.\nSince being elected to Parliament, Richard has led successful campaigns to change Government policy. Within weeks of being elected he successfully convinced the Chancellor of the Exchequer to reverse the 'Motorhomes Tax' - an EU regulation that had caused a huge rise in tax on motorhomes.\nSubsequently Richard has helped introduce a new draught beer duty for pubs and changed the law through the Health and Care Act to ban Virginity Testing and so-called hymen repair procedures. Richard also successfully campaigned in Parliament to extent the Automatic Enrolment of Pensions to 18 year-olds in order to boost the financial retirement prospects of millions across the UK.\nIn February 2022 Richard was promoted to Parliamentary Private Secretary (PPS) to the Department for Digital, Culture, Media and Sport. This is an unpaid assistant role, acting as the 'eyes and ears' for the Department in the House of Commons, carried out in addition to his role as a Backbench MP. In September 2022 Richard was promoted to be the lead PPS to the Department for International Trade.\nRichard was graciously appointed Parliamentary Under Secretary of State at the Department for Transport by HM The King on 28 October 2022. His brief included roads, local transport, freight, and haulage. Richard proudly introduced the ‘Get Around for £2’ bus fair cap helping millions of people to save money on travel to work, and make the most of affordable days out.\nOn the 13 November 2023 Richard was appointed the Chairman of the Conservative Party by the Prime Minister. In addition to running the Conservative Party, Richard attended Cabinet and as such was appointed to His Majesty's Most Honourable Privy Council. This body act as advisers to The King, as such Richard is now styled The Right Honourable.\nFollowing the 2024 General Election result Richard resigned as Party Chairman in order to focus his time and energy on his new constituents in Essex.\nRichard has secured and set up a new constituency office, the first time in many years that Basildon and Billericay has had an MP with a high street office.\nHe enjoys cooking roasts, local pubs and walking in his spare time.",
  "https_www_richardholden_org_uk_/https_www_richardholden_org_uk_events_feed/content_38.html": null
}