{
  "http_www_greghands_com_/http_www_greghands_com_accessibility/content_3.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_greghands_com_/http_www_greghands_com_news/content_7.html": "Statement from Rt Hon Greg Hands, former Member of Parliament for Chelsea & Fulham Wednesday, 10 July, 2024 Dear Chelsea & Fulham resident, You will be aware that the General Election took place on Thursday 4 July. Unfortunately, I was not re-elected as Member of Parliament for Chelsea & Fulham. Please see visit here for the result in full. I knew it was neck and neck in our constituency, and the results show just that, with only 152 votes between the Labour candidate and myself. I congratulate my... Local News\nGreg Hands’ walkabout up Wandsworth Bridge Road 28th June 2024 Greg Hands went on a walkabout up Wandsworth Bridge Road. Greg stopped by great local businesses like Il Pagliaccio restaurant, Randalls Butchers and Kenrick’s... Local News\nNews Bulletin #727: Only Greg Hands lives in Chelsea & Fulham 28th June 2024 Did you know that Greg is the only major party candidate in this General Election who actually lives within the Chelsea & Fulham constituency? This is why he... Reports\nGreg Hands’ new initiative to improve accessibility at Putney Bridge Tube Station 27th June 2024 Greg Hands launches a new initiative as part of his ongoing campaign to improve accessibility at Parsons Green and Putney Bridge Tube Stations. As part of the... Local News\nNews Bulletin #726: It's neck and neck in Chelsea & Fulham 25th June 2024 It’s neck-and-neck here in Chelsea & Fulham. The latest Survation MRP poll has Greg just 1.3% ahead of Labour. That is just a few hundred votes. It could hardly... Reports\nNews Bulletin #725: Postal votes arriving - Vote for Greg! 21st June 2024 Latest polling showed that Greg is just 1.3% ahead of Labour here in Chelsea & Fulham and he will need every vote to remain as your MP. The same poll shows that... Reports\nNews Bulletin #724: Greg Hands only 1% ahead in Chelsea & Fulham 18th June 2024 Today, Postal Votes start to arrive in people’s letterboxes in Fulham. They will arrive from Thursday in Chelsea. Greg's campaign continues at pace. In recent... Reports\nGreg Hands walks the length of North End Road 17th June 2024 Greg Hands lives just off the North End Road, and enjoyed waling the length of it, meeting fellow local residents. Greg visited The Brunswick Club after... Local News\nNews Bulletin #723: Only Greg Hands opposes Labour’s 20% tax on parents 14th June 2024 Not only is Greg the only major party candidate in this election who lives in Chelsea & Fulham, he is also the only candidate to be fighting Labour’s... Reports\nNews Bulletin #722: Will you be here on Thursday 4 July? 11th June 2024 The General Election will take place on Thursday 4 July. The result in Chelsea & Fulham will be neck and neck. If you think you might not be around to vote in... Reports",
  "http_www_greghands_com_/http_www_greghands_com_about-chelsea-and-fulham/content_5.html": "Chelsea and Fulham is one of the most vibrant areas in London. Stretching from Sloane Square in the east to Craven Cottage in the west, the constituency encompasses well-known landmarks such as the Royal Hospital in Chelsea (home to the Chelsea Pensioners), the King’s Road, and the two eponymous Premier League football clubs.\nThe constituency is formed from parts of the London Borough of Hammersmith and Fulham, and the Royal Borough of Kensington and Chelsea. The area is diverse: home to people of many nationalities and dozens of languages. It is also one of the most economically active parts of the UK, benefitting from a prime location and good transport links. Unsurprisingly, many young professionals working in the capital call the area their home.\nIn addition to a plethora of green spaces, the constituency sits alongside the River Thames, and hosts the start of the annual Oxford-Cambridge Boat Race. Chelsea is regarded as one of the artistic centres of London, and more recently serves as one of the capital’s prime retail destinations. Fulham has a rich cultural heritage and retains a village-feel in the heart of London, boasting many great restaurants and cafés. The constituency is home to some of the best schools in the country.\nThe constituency includes six wards from Hammersmith and Fulham:\n- Fulham Broadway\n- Munster\n- Palace Riverside\n- Parsons Green and Walham\n- Sands End\n- Town\nAnd five Kensington and Chelsea wards:\n- Chelsea Riverside\n- Brompton and Hans Town\n- Redcliffe\n- Royal Hospital\n- Stanley",
  "http_www_greghands_com_/http_www_greghands_com_government/content_14.html": "Greg Hands MP, in his capacity as Trade Minister, completed a vibrant and productive visit to Washington DC.\nGreg is familiar with Congress, having previously worked there before embarking on his career as an MP. Greg was in Washington DC to meet with trade representatives, associations, and businesses. As a part of the UK Trade delegation, Greg emphasised the pivotal role of businesses in strengthening the ‘special’ UK-US relationship.\nGreg Hands MP, in his capacity as Trade Minister travelled to Ukraine, amidst the conflict, to sign a defence partnership agreement between the UK and Ukraine.\nGreg was accompanied by a delegation of 29 leading UK defence and security companies. The mission aimed to foster collaboration between UK and Ukrainian businesses to bolster Ukraine's military capability and reconstruction efforts.\nGreg Hands MP had an excellent visit to Jersey and Guernsey in the Channel Islands last week in his capacity as Minister for Trade. The visit was very useful to gain further insights in how the Department for Business and Trade can help Jersey and Guernsey trade better globally. The Crown Dependencies have so much to offer in terms of goods and services to the UK’s trade agenda – which can bring great benefits to the Bailiwicks, too!\nGreg Hands MP completed a very productive and jam-packed visit to Poland last week, in his capacity as Minister for Trade. The focus of his most recent trade visit was to talk about the two countries’ common priorities, the UK-Polish trade and investment relationship, opportunities for UK companies and to discuss how the UK and Poland can further cooperate in supporting Ukraine in its fight against Putin’s brutal invasion.\nOn Monday 29 January 2024, the MP for Chelsea and Fulham and Minister of State for Trade Policy, Greg Hands MP, responded to the second reading debate of the Trade (Comprehensive and Progressive Agreement for Trans-Pacific Partnership) Bill in the House of Commons Chamber for the Department for Busi\nOn Thursday, 25 January 2024, the MP for Chelsea and Fulham and Minister of State for Trade and Minister for London, Greg Hands MP, responded to Department for Business and Trade oral questions in the House of Commons.\nThe Minister of State for Trade and Minister for London responded to a variety o\nGreg Hands MP, in his capacity as Trade Minister, had a very positive visit to Qatar and Bahrain.\nGood progress was made on a trade deal with the GCC in Qatar.\nGreg had a productive discussion with British business owners based in Bahrain about how the Government can help and what they’d like to s\nOn Thursday, 30 November 2023, as Minister of State for Trade, Greg Hands MP responded to Oral Questions in the House of Commons.\nAlongside the Secretary of State for Business and Trade, Rt Hon Kemi Badenoch MP and the ministerial team, Greg answered a range of questions including on the Government\nGreg Hands MP appointed Minister of State for Trade and Minister for London.\nTo kick off Greg’s return as Trade Minister, it was fantastic that on 14 November, the UK signed the 7th and biggest UK-US Memorandum of Understanding (MoU) with Florida to boost trade and investment.\nGreg is back as Mini",
  "http_www_greghands_com_/http_www_greghands_com_cdn-cgi_l_email-protection/content_17.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_greghands_com_/http_www_greghands_com_contact/content_6.html": "You will be aware that the General Election took place on Thursday 4 July. Unfortunately, Greg was not re-elected as Member of Parliament for Chelsea & Fulham.\nYou can contact Greg by completing the form below.\nI would like to be kept up-to-date by the Conservatives on future issues that matter to me:",
  "http_www_greghands_com_/http_www_greghands_com_about-greg/content_4.html": "Born in 1965 to British parents in New York, Greg lived in the USA until he was seven years old and the family moved back to the UK.\nAfter being educated at Dr Challoner’s Grammar School in Amersham, in 1985 Greg embarked on a gap year in West Berlin, where he worked at a swimming pool, a department store and at McDonalds. Thereafter, Greg studied Modern History at Cambridge University. He joined the Conservative Party whilst at Cambridge. After university, Greg began a career in finance, and worked on trading floors in London and New York.\nIn 1998 Greg was first elected as a Councillor in the London Borough of Hammersmith & Fulham and from 1999 until 2003 he was Leader of the Conservative council group.\nIn 2005 Greg was elected as Member of Parliament for Hammersmith and Fulham, taking the marginal seat from Labour, with a 7% swing, achieving a majority of 5,000 votes.\nFor the 2010 General Election Greg was selected to fight the newly created constituency of Chelsea & Fulham which he won with a huge majority. Since then, Greg has successfully defended the seat of Chelsea & Fulham in the 2015, 2017 and 2019 General Elections.\nFrom January 2009 to May 2010, Greg served as Shadow Treasury Minister, and after the 2010 General Election he was appointed Parliamentary Private Secretary to the Chancellor of the Exchequer, George Osborne. In October 2011, Greg joined the Government Whips, where he worked for almost four years. During this period, in 2013, he was appointed Deputy Chief Whip and Treasurer of HM Household.\nFollowing the 2015 General Election, which resulted in a Conservative-majority Government under David Cameron, Greg was appointed Chief Secretary to the Treasury. Greg carried out the 2015 Spending Review, which set out all of Government spending for almost five years, the longest and most successful review ever undertaken.\nIn July 2016, under Prime Minister Theresa May, Greg was appointed Minister of State in the newly created Department of International Trade. Greg worked in promoting exports, inward investment, trade agreements and tariff policy. In 2018 Greg resigned from this position in order to meet his election promise of voting against a third runway at Heathrow airport.\nGreg was re-appointed Minister of State for Trade Policy in the Department for International Trade by Prime Minister Boris Johnson in February 2020. In this role, Greg focused on new UK Free Trade Agreements, the UK Global Tariff, and the UK’s role at the World Trade Organisation.\nFrom September 2021 until September 2022, Greg served as Minister of State for Climate Change, Clean Growth and Energy at the Department for Business, Energy and Industrial Strategy.\nGreg then served as Minister of State for Trade Policy after his third appointment to this role in October 2022 by Prime Minister Liz Truss and subsequent re-appointment by Prime Minister Rishi Sunak.\nIn February 2023, Greg was appointed Chairman of the Conservative Party and attended Cabinet.\nOn 13 November 2023, Greg was appointed Minister of State for Trade at the Department for Business and Trade, as well as Minister for London.\nGreg is fluent in German and French and speaks several other European languages to a good standard, notably Czech.\nGreg has lived in Fulham since 1990. He is separated, but lives with his two children.\n- Update 10 July 2024 - Statement from Rt Hon Greg Hands, former Member of Parliament for Chelsea & Fulham\nDear Chelsea & Fulham resident,\nYou will be aware that the General Election took place on Thursday 4 July.\nUnfortunately, I was not re-elected as Member of Parliament for Chelsea & Fulham.\nPlease see visit here for the result in full. I knew it was neck and neck in our constituency, and the results show just that, with only 152 votes between the Labour candidate and myself.\nI congratulate my successor and wish him good luck in this role.\nMost importantly, I would like to thank you and the fellow constituents of Chelsea & Fulham.\nThank you for your inspiration and the opportunity you gave me to serve as Member of Parliament for 19 years.\nBeing your Member of Parliament has been the greatest honour.\nI have also had the honour to serve our country as a Government Minister for over 11 years.\nAt this point, I would also like to thank my family and many members of ‘Team Hands’ for their dedication in supporting me in this work.\nIn terms of my future, I am looking forward to a more relaxed summer and will think about plans for the future.\nI will continue to live in Chelsea & Fulham, and I am sure I will see you around.\nWith best wishes for the future,\nGreg Hands\nYour Member of Parliament, 2005-2024 and Government Minister for most of 2010-2024",
  "http_www_greghands_com_/http_www_greghands_com_news_news-bulletin-723-only-greg-hands-opposes-labours-20-tax-parents/content_16.html": "Dear resident,\nI hope you are well.\nNot only am I the only major party candidate in this election who lives in Chelsea & Fulham, I am also the only candidate to be fighting Labour’s destructive new 20% tax on independent school parents.\nWith more than 50% of children locally educated in the independent sector, this will hit those parents very hard.\nBut, it will have consequences for the state sector too, as many parents will be forced to switch, and our local secondary schools are already oversubscribed with ever-shrinking catchment areas.\nLady Margaret School, for example, where my daughter went, is already five times oversubscribed. The new Fulham Boys School, where I am the Patron, has just started to achieve its first Oxbridge entrants, but its building and site would make expansion very difficult. The London Oratory School is already very hard to gain admission, and Chelsea Academy, Hurlingham Academy and Fulham Cross are also all doing very well but might not be able to take extra numbers.\nSo, this policy from Labour, confirmed this week in their manifesto, would be a disaster for all of us in Chelsea & Fulham.\nPlease sign my petition below and don’t forget that only a vote for me will show your opposition to this destructive and unwelcome policy.\nKind regards,\nGreg Hands\nThe Rt Hon Greg Hands\nConservative Parliamentary Candidate for Chelsea & Fulham",
  "http_www_greghands_com_/http_www_greghands_com_news_news-bulletin-722-will-you-be-here-thursday-4-july/content_8.html": "Dear resident,\nI hope this finds you well.\nThe General Election will take place on Thursday 4 July. The result in Chelsea & Fulham will be neck and neck.\nIf you think you might not be around to vote in person on 4 July – apply for a postal vote now!\nThe Postal Vote application deadline is 5pm on 19 June 2024.\nYou can simply apply online here.\nAlternatively, you can download the form here. If you have any questions or you require a paper form to register, you can contact your local Electoral Registration Office here.\nRead on below about what I have been up to across Chelsea & Fulham - walking the length of Fulham Road from Fulham Palace to Chelsea, meeting residents at local Tube stations, on door steps and on the pavements of Chelsea & Fulham.\nAs always, please don’t hesitate to reach out to me if you have any issues or queries.\nKind regards,\nGreg Hands\nThe Rt Hon Greg Hands\nConservative Parliamentary Candidate for Chelsea & Fulham",
  "http_www_greghands_com_/http_www_greghands_com_map-locations/content_2.html": "My map\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "http_www_greghands_com_/http_www_greghands_com_news_category_Articles/content_12.html": "Greg Hands MP visits Washington DC as Minister for Trade 9th April 2024 Greg Hands MP, in his capacity as Trade Minister, completed a vibrant and productive visit to Washington DC. Greg is familiar with Congress, having previously... Articles\nGreg Hands MP visits Ukraine as Minister for Trade 9th April 2024 Greg Hands MP, in his capacity as Trade Minister travelled to Ukraine, amidst the conflict, to sign a defence partnership agreement between the UK and Ukraine... Articles",
  "http_www_greghands_com_/http_www_greghands_com/content_1.html": "About Greg Latest News Find Greg on Facebook Local Action As a Minister Find Greg on Twitter My Plan Contact Chelsea & Fulham Are you a Chelsea & Fulham constituent? Enter your postcode Postcode",
  "http_www_greghands_com_/http_www_greghands_com_cookies/content_9.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "http_www_greghands_com_/http_www_greghands_com_events_feed/content_13.html": null,
  "http_www_greghands_com_/http_www_greghands_com_about-rss/content_10.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "http_www_greghands_com_/http_www_greghands_com_news_greg-hands-walkabout-wandsworth-bridge-road/content_11.html": "- Greg Hands went on a walkabout up Wandsworth Bridge Road.\n- Greg stopped by great local businesses like Il Pagliaccio restaurant, Randalls Butchers and Kenrick’s wine shop.\n- However, Greg was struck by the number of closed down shops and is calling on Labour-run Hammersmith & Fulham council to take action so businesses can continue to thrive.\nGreg Hands started his walkabout up Wandsworth Bridge Road, at the extraordinary Fulham Beach, which wedges itself between the A217 and the CEMEX UK cement works. Greg has lived in the constituency since 1990 and this has been here since 2016 and it is certainly an innovative place for a beach.\nGreg popped into famous Italian restaurant Il Pagliaccio and Randalls Butchers, both longstanding institutions on Wandsworth Bridge Road. He caught up with their teams to discuss how business was doing.\nGreg also stopped by Kenrick’s wine shop, which he has always helped with different local issues and was delighted to see them doing well.\nHowever, Greg was really struck with the number of businesses struggling on this road. Everywhere up and down Wandsworth Bridge Road, shops are closed down (Greg counted at least 10) and To Let signs are up. Greg knows that this is not normal for our part of London.\nThis is, unfortunately, a result of Labour-run Hammersmith & Fulham council policies.\nFirst, their failure to re-open Hammersmith Bridge the last 5 years. Second, failing to help businesses impacted by their various traffic schemes, money box junctions and more. As a result, Wandsworth Bridge Road is in crisis.\nThis needs to change. That is why Greg is supporting the fantastic local businesses along Wandsworth Bridge Road and is calling Hammersmith & Fulham council to take action to make sure that businesses can continue to thrive on Wandsworth Bridge Road.\nCommenting, Greg Hands said:\n“Wandsworth Bridge Road is a key local high street, with a wide variety of businesses, shops, restaurants and cafes. I know many of the businesses very well along the road and have worked to help them overcome various issues over the years.\nBut it is such a shame to see businesses struggling and so many closed down shops and too many To Let signs up, as a result of Hammersmith & Fulham council policies.\nThis needs to change and that is why I am calling for the council to take action to make sure our local businesses can continue to thrive!”\nENDS",
  "http_www_greghands_com_/http_www_greghands_com_news_greg-hands-walks-length-north-end-road/content_15.html": "- Greg Hands lives just off the North End Road, and enjoyed waling the length of it, meeting fellow local residents.\n- Greg visited The Brunswick Club after successfully campaigning for its funding, and the historic North End Road market.\n- North End Road is the heat of Fulham’s community.\nGreg Hands lives just off the North End Road, Fulham and had a great walkabout along the length of it on Monday, 17 June, meeting fellow local residents. Greg is the only major party candidate in the upcoming General Election, who lives in Chelsea & Fulham and therefore, understands constituency issues.\nGreg started his walk at the historic St John’s Church, appreciating its architectural beauty and listed status.\nAt the onset, Greg enthusiastically engaged directly with voters at the 28 bus stop. This bus is a vital link connecting Fulham with High Street Kensington and Notting Hill.\nContinuing his journey, Greg visited The Brunswick Club, reflecting on how it is a fantastic asset to the local community, providing football training, chess, taekwondo, and more to local young people, most often from Clem Attlee Estate. Greg has been a trustee since 2002 and thanks to his successful campaign and petition, Hammersmith and Fulham Council was forced to reinstate crucial funding last year.\nGreg walked to the vibrant North End Road Market, celebrating its rich heritage spanning over a century. Fresh fruit and vegetables remain at the heart of the market. But there is also great lunch options on offer too, like Filipino street food.\nHe concluded his journey at West Kensington station, reflecting on North End Road’s significance as the heart of Fulham’s community.\nCommenting, Greg Hands said:\n“It was great to walk the length of North End Road, meeting and chatting to fellow local residents.\nThe North End Road is the heart of Fulham’s community, with the beautiful St John’s Church, the fantastic Brunswick Club and historic market.\nThanks to the local residents and businesses who stopped to chat!”\nENDS"
}