{
  "https_www_laura-weldon_co_uk_/https_www_laura-weldon_co_uk/content_1.html": "Laura entered politics following an early career in the charity and social welfare sector, where she delivered wellbeing projects for local and national charities for older people. She was a frontline worker through the Covid 19 pandemic as a welfare manager for the Home Office's asylum contractor, where she worked with vulnerable children, victims of human trafficking and sexual exploitation.\nUsing this experience, Laura transitioned into politics, gaining experience in the constituency offices of Conservative Members of Parliament in Yorkshire, and was selected to stand in Pontefract, Castleford and Knottingley against Home Secretary Yvette Cooper in 2024. She currently works as Head of External Affairs at a major UK infrastructure company, where she oversees political engagement in the North West of England.\nOriginally from Stockport, Greater Manchester, Laura has lived in various parts of Yorkshire for most of her adult life - including Selby, Wakefield, Harrogate and Sheffield. Her family has Polish and Irish heritage, and her political inspiration is her grandfather, who was a member of the Polish Resistance during Nazi occupation. Her father - an NHS dentist - died suddenly when Laura was five years old and she and her siblings were raised alone by her mother, who was a Special Educational Needs teacher and later deputy head of the local pupil referral unit in Stockport. She currently lives in Pontefract and is mother to a ten year old son.\nLaura holds a Dual Honours degree in Economics and Politics from the University of Sheffield, and a postgraduate diploma in Crisis Communications from the Chartered Insitutute of Public Relations.\nLaura has a range of political interests, including personal freedom and a smaller state, choice in education, welfare of Armed Forces families, better political representation for the North of England, the rights of women and girls, environmental concerns - especially soil and water quality, maternal employment and adult education.",
  "https_www_laura-weldon_co_uk_/https_www_laura-weldon_co_uk_home/content_2.html": "Laura entered politics following an early career in the charity and social welfare sector, where she delivered wellbeing projects for local and national charities for older people. She was a frontline worker through the Covid 19 pandemic as a welfare manager for the Home Office's asylum contractor, where she worked with vulnerable children, victims of human trafficking and sexual exploitation.\nUsing this experience, Laura transitioned into politics, gaining experience in the constituency offices of Conservative Members of Parliament in Yorkshire, and was selected to stand in Pontefract, Castleford and Knottingley against Home Secretary Yvette Cooper in 2024. She currently works as Head of External Affairs at a major UK infrastructure company, where she oversees political engagement in the North West of England.\nOriginally from Stockport, Greater Manchester, Laura has lived in various parts of Yorkshire for most of her adult life - including Selby, Wakefield, Harrogate and Sheffield. Her family has Polish and Irish heritage, and her political inspiration is her grandfather, who was a member of the Polish Resistance during Nazi occupation. Her father - an NHS dentist - died suddenly when Laura was five years old and she and her siblings were raised alone by her mother, who was a Special Educational Needs teacher and later deputy head of the local pupil referral unit in Stockport. She currently lives in Pontefract and is mother to a ten year old son.\nLaura holds a Dual Honours degree in Economics and Politics from the University of Sheffield, and a postgraduate diploma in Crisis Communications from the Chartered Insitutute of Public Relations.\nLaura has a range of political interests, including personal freedom and a smaller state, choice in education, welfare of Armed Forces families, better political representation for the North of England, the rights of women and girls, environmental concerns - especially soil and water quality, maternal employment and adult education.",
  "https_www_laura-weldon_co_uk_/https_www_laura-weldon_co_uk_opinion-articles/content_7.html": "3rd June 2024\nMy grandfather designed power stations after the war. He was a civil engineer, and with a combination of mathematics and near-perfect draughtsmanship created huge coal-fired behemoths that helped our country on the road to economic recovery after World War II.\nMy mum still has his drawings - done by hand on huge pieces of draughtsman's paper the size of carpets, and although he wasn't involved in any in our area, I'm sure he would have been very familiar with the designs of Ferrybridge, Eggborough and Drax, that the mines in every town around here fed with a steady supply of coal, and that pumped out gigawatts of energy every hour.\nToday we know that coal fired power won't be sustainable in the future. Most people agree that we need cleaner forms of energy, and Yorkshire is already a hub of technological progress on things like wind power and hydrogen. Knottingley was even in the running to be the site of one of the UK's first new small modular nuclear reactors (SMRs) - but as usual our sitting MP didn't make enough effort selling the benefits of our area to be successful in the bid.\nI've spoken to business owners and energy industry professionals about what is holding up the transition to new cleaner power - especially electricity - and a big factor is connecting to the grid.\nAt the moment, grid connections are on a \"first come, first served\" basis, and it's leading to massive backlogs as National Grid lines up the resources to connect up people producing their own clean energy on a smaller scale. The queue is up to two years long - and that's not time that we have to waste!\nBut here's where the advantages of our area come in. Our former coal-fired power stations were pumping out many times more electricity than they currently do on lower carbon fuels - and that capacity still exists. Even between power stations it's far easier to connect these areas to the grid than it is in a totally new area with no existing infrastructure. So let's take advantage, and create a new clean power economy on the sites of our old coal past.\nI call this the \"M62 Clean Energy Corridor\", and it's a plan that I've been discussing for a while with key figures in the energy and infrastructure industries - who are overwhelmingly supportive of this plan.\nRather than superficial investment policies with cheap logos, this is a real plan that is designed to ensure that we get rid of the blocks that are holding back progress on clean energy production, reinvigorate industrial communities that are still feeling the effects of heavy industry decline, and help prevent our pioneering innovations being sold off to European firms.\nIt's also intended to require the minimum of funding, and relies on cutting red tape and the benefits we'll gain from productivity. So what would it do, in a nutshell?\nSites on or sufficiently near to the sites of former coal-fired power stations would be allocated as part of the Clean Energy Corridor that would create incentives for industries creating clean power which need grid connections, as well as the ancillary industries (e.g. manufacturing the machinery needed to generate the energy). These incentives would include:\nPriority for grid connections over areas not allocated to end the ineffficient \"first come first served\" system\nTax and regulatory incentives similar to those of Freeports or Enterprise Zones\nPlanning liberalisation on former power generation or industrial sites in the corridor, making it easier and faster to build the infrastructure on sites where energy has been generated in the past.\nThese plans are simple, they would make a real difference, and they address the problems that people in industry have told me are holding us back.\nBut what do you think? Why not get in touch and let me know - email me at contact@laura-weldon.co.uk, or go to the contact page to share your thoughts.\n26th April 2024\nAs part of the Mayoral election campaign, our candidate Arnold Craven asked me to attend Asthma + Lung UK's round table on clean air on his behalf. I was really pleased to be involved, because cleaner air is an issue that is affecting our community at one of the highest rates in West Yorkshire.\nGovernment data puts our area at well above the UK average for both asthma and COPD (chronic obstructive pulmonary disease), and you don't need to be a scientist to work out why.\nUntil March of 2022, spotting the cooling towers of Ferrybridge Power Station was a sign that we were nearly home - and that meant that you were probably travelling on one of our constituency's major arterial roads that are pumping out the highest levels of emissions and particulates in the entire region.\nAdd to that a legacy of heavy industry, historic smoking rates and levels of deprivation and it's a wonder any of us can catch our breath at all.\nWe all know what we need to do to make our air cleaner - for most of us as individuals it's using the car less. It's easier said than done: our lack of regional connectivity means that using public transport is likely to take you time you don't have, and could cost you far more than having a car!\nCars undoubtedly give you freedom. I can jump in my car any time I like, and drive anywhere in the country. I'm a safe driver with a modest second hand car that's paid for outright. My insurance and tax come to just under £600 for the year and I maybe spend £25 per week on fuel. I can bring passengers and luggage, and I can go directly from my front door to any destination.\nWere I to get rid of my car, I would undoubtedly be far worse off. Not only would I be at the mercy of timetables, strikes and the \"last mile\" problem, I'd also have to spend up to £3386.70 per year for bus and train passes - and they would only cover me and my young son across West Yorkshire! So you can also add on the extra for the cross country trains when we visit family or friends, the taxis when we can't get where we need to go on time, and the increased costs of food and household essentials that you can only buy from places accessible by public transport or have delivered to your door.\nI worked out last year that to take my son to school on the bus he would have to either leave before 7am and arrive at school nearly an hour early, or be 10 minutes late every day. If I was to accompany him and stay until school started, I wouldn't get home until well after most people start work - a two and a half hour round trip, for a journey of around 5 miles that takes under 15 minutes each way in the car.\nIt's true that there are many poorer people who can't afford a car, but there's also a huge number of people who just can't afford not to have a car, and we need to make sure that if we start making car ownership more expensive to discourage use, we don't put all the burden on the people at the bottom who'll feel it first.\nSo how then do we begin to tackle the pollution that's caused by our car dependence without hurting the least well off?\nThere are a few different angles to try here. At the clean air roundtable I may have accidentally-on-purpose committed Arnold Craven to an e-scooter scheme for West Yorkshire. Thankfully I know he's a big fan of them and he was immediately on board, and he knows that not only are they a handy way of speeding up a local journey, they're also great fun! Being able to zip across town on an e-scooter rather than huffing and puffing up a hill would especially encourage younger people to rethink the need for a car journey, and there are companies who can provide them right away at little or no cost to the taxpayer.\nMy plan for our town centres is also a big part of getting people out of the car. We have a transport hub at Glasshoughton/Junction 32 - there's plenty of parking available, as well as trains and buses coming in. If we connect Pontefract and Castleford town centres with a clean, accessible, frequent, convenient and affordable shuttle, it could free up the town centres from being choked with cars.\nAnd with my plan for Castleford meaning that we focus those essential services on the high street, and my plan for Pontefract looking to attract visitors and tourists from outside the area to spend their money at our wonderful attractions, we need to ensure that everyone can get there cheaply and easily with or without a car.\nWe'll always have some use of private vehicles, but we need to make sure we keep opening up options for people to do something different. I don't want to see schemes where people's freedom is limited - like some of the most extreme proposals, but I do want to see thought about how we can reduce the car burden in a way that's safe, enjoyable and an easy switch. Putting essential facilities in easy reach of new houses, making active travel fun and attractive and making sure we don't concrete over our green public spaces are far better than heavy-handed and punitive taxes, fines and levies.\nPontefract, Castleford and Knottingley's next MP needs to put local people's health and happiness first.\n4th April 2024\nIn the last few weeks we've heard a lot about MPs who are standing down, or taking extra security measures because of the dangers that they feel they are under. The Prime Minister had to make a statement outside Downing Street, and extra funding has been announced for security for MPs, and for Parliamentary Candidates.\nAbuse has always been part of politics to an extent - when I was a student helping out in the 2005 election we used to say that if you hadn't been told to eff off yet, you hadn't knocked on enough doors.\nThe deaths of Jo Cox and David Amess are fresh in people's minds, and alongside that there have been some disgusting attacks on MPs offices in recent months.\nI frequently speak to other candidates from around the country, and I've attended quite a few events now designed to encourage more women to get into politics. There is certainly a feeling that women especially are being put off politics by a perception of danger and personal risk, and many people are calling for something to be done.\nIt's never right to use or threaten violence to a person who is just doing their job, and I'd never encourage anyone to do it, but I might be in the minority with my attitude to risk in politics.\nAnger and hatred comes from a lack of communication, and locked doors, security buzzers, bodyguards and suspicion don't do anything to help.\nI speak to my friends and neighbours in the Five Towns constantly, and the majority of those I speak to agree that certainly in our area that \"extra security\" can sometimes feel like a convenient excuse to stay at arm's length.\nPeople want to access their MP, and knowing that they'll be at a pop-up surgery in Asda every other Friday, or you've seen them coming and going from their high street office means a lot to people.\nThey turn to their MP when there's nobody else to turn to, and feeling like you've been fobbed off on an issue that matters is a real kick in the teeth.\nThat's why you'll be getting the leaflet opposite through your door very soon - with my pledges for exactly how I'll behave as your MP. This is what people tell me that they want from their representative - and it's what I'd want too as a voter!\nRisk is a part of the job, and some people won't be up to it. Just as there are many people who could never join the army, or be a firefighter or police officer. I met up with an old university friend a few weeks ago, who became an MP in 2017. When I asked him was being an MP really the best job in the world and worth the risk, he gave me an emphatic yes. And I know why - the power to open doors and get people round the table to solve problems would mean I could solve the problems I saw as a charity worker in a snap!\nIn my former career as a welfare manager I faced some pretty hairy situations - when I worked with asylum seekers I was assaulted by a woman on police bail for stabbing her partner, and when I worked with older people I had to use all my wits to get out of the house of a man who threatened that \"I'd be sorry\" if I didn't get him a befriender, after he told me he'd been arrested for threatening to kill his wife. Those incidents didn't stop me from continuing to help people, and I trust my community to treat me with the respect that I treat them.\nAnd I really am putting my trust in the people of Pontefract, Castleford, Knottingley and Altofts - my home phone number is on my leaflets, and my home address will be on the ballot paper. I hope that you'll feel like that means you can trust me too.\nIf you've any doubts, give me a call...",
  "https_www_laura-weldon_co_uk_/https_www_laura-weldon_co_uk_your-data-privacy/content_3.html": "Thank you for visiting www.laura-weldon.co.uk. Your privacy is important to us, and we are committed to protecting your personal data in accordance with UK data protection laws, including the UK General Data Protection Regulation (UK GDPR).\nData Controller:\nLaura Weldon is the data controller for any personal data collected through this website.\nWhat Information We Collect:\nWhen you visit our website, we may collect certain information about you, including:\nPersonal information you provide to us voluntarily, such as your name, email address, and any other information you choose to provide when contacting us through our website.\nInformation about your device and usage of our website, collected automatically using cookies and similar tracking technologies. This may include your IP address, browser type, operating system, and browsing activity.\nHow We Use Your Information:\nWe use the information we collect for the following purposes:\nTo respond to your inquiries and communicate with you.\nTo improve and optimize our website, including analyzing trends and usage patterns.\nFor legitimate political activities, including engaging with constituents and voters, as permitted by UK electoral law.\nLegal Basis for Processing:\nWe process your personal data on the following legal bases:\nWith your consent, where required.\nTo perform a contract with you or to take steps at your request prior to entering into a contract.\nTo comply with our legal obligations.\nFor the legitimate interests pursued by us or by a third party, such as engaging in political activities for democratic engagement, subject to your interests and fundamental rights not overriding those interests.\nData Sharing:\nWe may share your personal data with third-party service providers who assist us in operating our website or conducting our political activities. We require these service providers to only process your personal data in accordance with our instructions and to implement appropriate security measures to protect it.\nData Retention:\nWe will retain your personal data only for as long as necessary to fulfill the purposes for which it was collected, including any legal or reporting requirements.\nYour Rights:\nYou have certain rights regarding your personal data under UK data protection laws, including the right to access, correct, delete, or restrict the processing of your personal data. You also have the right to object to the processing of your personal data in certain circumstances.\nContact Us:\nIf you have any questions or concerns about our privacy practices or your personal data, please contact us at contact@laura-weldon.co.uk.\nUpdates to this Privacy Statement:\nWe may update this Privacy Statement from time to time to reflect changes in our privacy practices or applicable laws. We encourage you to review this Privacy Statement periodically for any updates.\nLast updated: 15/04/2024\nBy continuing to use our website, you acknowledge that you have read and understood this Privacy Statement.\nCopyright for all content and photography is either:\n1) owned by Laura Weldon, Five Towns and Hemsworth Conservatives or The Conservative Party\n2) stock photography used under purchased and appropriate licence for non-commercial use\n3) in the public domain\n4) used with express permission of the copyright owner.\nPhotographs and videos legally taken in a public place may feature members of the public - no endorsement is implied unless expressly stated.",
  "https_www_laura-weldon_co_uk_/https_www_laura-weldon_co_uk_contact/content_5.html": "Search this site\nEmbedded Files\nSkip to main content\nSkip to navigation\nHome\nMedia & Engagement\nOpinion & Articles\nHome\nMedia & Engagement\nOpinion & Articles\nMore\nHome\nMedia & Engagement\nOpinion & Articles\nContact\nEmail:\ncontact@laura-weldon.co.uk\nX:\n@LauraRWeldon\nGoogle Sites\nReport abuse\nPage details\nPage updated\nGoogle Sites\nReport abuse\nThis site uses cookies from Google to deliver its services and to analyze traffic. Information about your use of this site is shared with Google. By clicking \"accept\", you agree to its use of cookies.\nCookie Policy\nReject\nAccept",
  "https_www_laura-weldon_co_uk_/http_www_laura-weldon_co_uk/content_6.html": "Laura entered politics following an early career in the charity and social welfare sector, where she delivered wellbeing projects for local and national charities for older people. She was a frontline worker through the Covid 19 pandemic as a welfare manager for the Home Office's asylum contractor, where she worked with vulnerable children, victims of human trafficking and sexual exploitation.\nUsing this experience, Laura transitioned into politics, gaining experience in the constituency offices of Conservative Members of Parliament in Yorkshire, and was selected to stand in Pontefract, Castleford and Knottingley against Home Secretary Yvette Cooper in 2024. She currently works as Head of External Affairs at a major UK infrastructure company, where she oversees political engagement in the North West of England.\nOriginally from Stockport, Greater Manchester, Laura has lived in various parts of Yorkshire for most of her adult life - including Selby, Wakefield, Harrogate and Sheffield. Her family has Polish and Irish heritage, and her political inspiration is her grandfather, who was a member of the Polish Resistance during Nazi occupation. Her father - an NHS dentist - died suddenly when Laura was five years old and she and her siblings were raised alone by her mother, who was a Special Educational Needs teacher and later deputy head of the local pupil referral unit in Stockport. She currently lives in Pontefract and is mother to a ten year old son.\nLaura holds a Dual Honours degree in Economics and Politics from the University of Sheffield, and a postgraduate diploma in Crisis Communications from the Chartered Insitutute of Public Relations.\nLaura has a range of political interests, including personal freedom and a smaller state, choice in education, welfare of Armed Forces families, better political representation for the North of England, the rights of women and girls, environmental concerns - especially soil and water quality, maternal employment and adult education.",
  "https_www_laura-weldon_co_uk_/https_www_laura-weldon_co_uk_media-engagement/content_4.html": "For all media enquiries or requests for appearance, comment or interview, please email press@laura-weldon.co.uk\nPublic Affairs, Campaigns & Engagement\nIf you would like to get in touch with Laura regarding a campaign for an organisation or group, please email campaign@laura-weldon.co.uk.\nSpeaking and Writing Invitations\nLaura is available as a speaker for panel debates, round tables, keynote speeches and more, offering profound, insightful and humorous reflections on her experience both professionally and as a Conservative Parliamentary Candidate.\nShe has written a number of opinion and thought leadership pieces featured in local and national press, both under her own name and on behalf of other organisations and individuals, and would be delighted to contribute pieces where a Northern, female, or right-of-centre view is required, including to start-up and voluntary organisations.\nFor more information please email press@laura-weldon.co.uk"
}