{
  "https_brexitinformation_com_/https_brexitinformation_com_2019_03_29_why-mps-must-vote-against-the-withdrawal-agreement-today/content_12.html": "British MPs must vote against the Withdrawal Agreement today on 29th March 2019 because it is not Brexit. This agreement would be an international treaty that would compel Britain to remain in the EU, via the Irish Backstop, for an indefinite period, without any say over EU rules and without any power to unilaterally walk away from the treaty.\nLeo Varadkar has publicly said that there would be no visible border checks in the event of a no-deal Brexit, and has thereby blown the gaff on the entire Irish backstop. The backstop has nothing to do with the Irish border or the Good Friday Agreement, which makes no mention at all of the border between Northern Ireland and the Irish Republic. The backstop is a legally binding lock to keep Britain tied to the EU indefinitely, with the EU holding the keys.\nCertain well-meaning MPs are considering to vote for the agreement on the basis that the alternative to the Withdrawal Agreement is no Brexit at all. This, in my opinion, is a false argument.\n- If the British Establishment succeeds in preventing Brexit then let’s have this theft of British Democracy right in the open, where everybody can see it. Hiding this theft behind a surrender agreement that pretends to effect a withdrawal from the EU but in fact does not, would simply help the Establishment to escape from their responsibility in orchestrating this theft.\n2. The 2018 EU Withdrawal Act is on the Statute Book. It means we leave the EU, deal or no deal. To remove a statute you need another statute. This means you must have:\n(1) A Prime Minister willing to give Parliamentary time for a Bill to repeal the 2018 Withdrawal Bill, or acquiesce in rogue MPs taking over the order paper for the same ends.\n(2) A Prime Minister who gives binding advice to the Monarch to the effect that the repeal Bill, impacting as it would the Royal Prerogative, must be given Royal Consent to be put to the Commons and Lords at the Second and Third Readings.\n(3) Majorities in the Commons and Lords for a Bill to repeal the 2018 Withdrawal Act.\n(4) A Prime Minister who gives binding advice to the Monarch to the effect that Royal Assent must be given to the Repeal Bill.\nAnybody reading this blog must ask themselves a simple question: Do all of the above four conditions stand a chance of all being met together?\nIf the answer to this question is no, then the conclusion is simple: We are certain to leave the EU without a Withdrawal Agreement, the so-called no-deal or WTO option, if MPs today have the guts to vote down May’s surrender agreement.\nIn my opinion patriotic MPs can ensure that all four of the above conditions for a repeal of the 2018 EU Withdrawal Act will never be met:\nThe Prime Minister\nThe Prime Minister would be the central figure for any repeal of the Withdrawal Act. But Theresa May is now in a very weakened position; she has twice publicly evoked her own resignation this year, most recently two days ago. Determined opposition by Conservative and DUP backbenchers would stop Theresa May from undertaking any action to facilitate repeal of the Withdrawal Act. Conservative and DUP MPs could move a motion of no-confidence in her leadership, transfer the whip to the DUP or indeed bring down the government, all of these options being available at any time. This is in the context of ordinary Conservative and DUP party members being overwhelmingly in favour of a no-deal Brexit and overwhelmingly against the Withdrawal Agreement. Moreover public opinion has hardened in favour of a no-deal Brexit.\nParliament\nThe House of Lords would be tempted to support the repeal of the 2018 Withdrawal Act, but would they dare? Such a move would give a huge wind to abolition of what is in effect an unelected legislative chamber. So their support for repeal would be in conflict with their desire not to imperil their power and privileges. Also the Lords do not have a final say: their verdict can always be overridden by the Commons.\nThe House of Commons would not vote for repeal of the 2018 Withdrawal Act. The majority leave vote was more broadly spread across England and Wales than the Remain vote, which was heavily concentrated in London, Bristol, Oxford and Cambridge. Consequently a clear majority of constituencies, 420 out of 650 (190 majority) voted to leave. This means that MPs voting to repeal the Withdrawal Act would face a huge backlash and would risk losing their precious seats.\nPatriotic MPs and Patriotic Lords (they do exist! David Stoddart for example) have a big role to play. By staying on the field, by continuing to make and strengthen the arguments for a real Brexit, patriotic MPs and Lords will make a difference and help get the real Brexit we all deserve and voted for over the line.\nConclusion\nOn 23rd June 2016 17.4 million British people voted to leave the EU, and 16.1 million British people voted to remain in the EU. This vote was taken in the context of a written and public declaration by the then Prime Minster, David Cameron, that the decision of the People would be implemented by the government. Let’s work together to make a real Brexit happen, starting by putting May’s surrender agreement into the bin for good.\nFirst rate commentary. If we are going to be betrayed let’s make sure we can see who the betrayers really are , not excluding those senior civil servants who are dragging their feet about no-deal preparations.\nLikeLike",
  "https_brexitinformation_com_/https_brexitinformation_com_contact/content_2.html": "Contact This is a contact page with some basic contact information and a contact form. Name(required) Email(required) Website Comment(required) Submit Δ Like Loading...",
  "https_brexitinformation_com_/https_brexitinformation_com_2016_05_17_the-british-project/content_9.html": "The above report describes how a vote for Brexit (Leave EU) will give our Country new policy-making opportunities in the areas of:\n- Industry and the Economy\n- Clean and Plentiful Electrical Energy Generation\nThe above report describes how a vote for Brexit (Leave EU) will give our Country new policy-making opportunities in the areas of:",
  "https_brexitinformation_com_/https_brexitinformation_com_2019_03_30_what-conservative-and-dup-mps-must-do-now/content_18.html": "Today, March 30th 2019, was supposed to have been the United Kingdom’s first full day as an independent sovereign country since December 31st 1972. Unfortunately the British Establishment, very much including Theresa May, has colluded with the European Union to prevent this. However, there is everything is to play for. Complete British freedom is less than two weeks away, if Conservative and DUP MPs act intelligently and with determination. This blog explains clearly what the MPs must do now to achieve this.\nWhat Conservative and DUP MPs must do\nConservative and DUP MPs must give the following instructions to Theresa May:\n- The British government must advise the President of the E.U. Council (Donald Tusk) in writing that the United Kingdom rejects the draft Withdrawal Agreement that was provisionally agreed by the Prime Minister in November 2018, and that consequently the United Kingdom shall leave the E.U. at 11:00PM British Time on 12th April 2019, without any Withdrawal Agreement.\n- Theresa May must advise, in writing, Her Majesty the Queen and the Chairman of the Conservative & Unionist Party (Brandon Lewis) that she is resigning from the leadership of the Conservative and Unionist Party with effect on 12th April 2019 at 11:00PM.\nTo ensure that the above instructions are fully complied with, all Conservative and DUP MPs must sign the following public proclamation:\n- That they swear by Almighty God that they will vote again and again against the draft Withdrawal Agreement that has already been rejected three times in a row by the House of Commons, by clear and overwhelming majorities. That they will never vote in favour of the draft Withdrawal Agreement.\n- That they swear by Almighty God that they will instantly lay before the House of Commons a motion of no-confidence in Theresa May’s government if any attempt is made to ask the E.U. for an extension of article 50 or a revocation of article 50; and that attempts to do the same by cross-party MPs will be interpreted as having government sanction and will also prompt a no-confidence motion, unless energetically opposed by the government.\nThe case for the above course of action is made in the rest of this blog, as follows.\nThe position in British and EU Law today.\nToday the position in British and EU law is that the United Kingdom will leave the European Union (EU) at 11PM British Time on 12th April 2019. This state of affairs can only be changed in British Law by a further extension to Article 50, by Statutory Instrument under the 2018 EU Withdrawal Act, or outright repeal of the 2018 EU Withdrawal Act. In E.U. law an application to extend the Article 50 process must be made by the British government and then be approved by every E.U. member state. It is argued that the United Kingdom could unilaterally revoke article 50, however this could be disputed, as the High Court drew opposite conclusions in the Gina Miller case in early 2017.\nThe EU view.\nAs said above, any extension of the Article 50 process can only be approved by a unanimous decision of the European Council less the United Kingdom, i.e. the other 27 member states. Unlike the Brexit negotiations, which were conducted wholly by the European Commission, any decision to extend is the exclusive competence of the 27 member states. The European Commission has no say in this. Any positive decision to extend must be unanimous, so if France, or Malta or Denmark or any one of the EU27 said no, that would be it, no extension.\nReports on the extended European Council meeting that agreed the first article 50 extension suggest that EU member states were divided, with France, Spain and Belgium in favour of a hard line and refusing an extension. It is suggested that Germany and Poland talked the foregoing countries into allowing the limited extension to 12th April 2019. Further reports today suggest that EU member states are again hardening in their attitudes, and are now openly contemplating refusing any further extension. Thus the European Commission yesterday commented that a No Deal Brexit is “very likely”.\nThe Conservative Party\nI rejoined the Conservative Party in January 2019, after a 10-year stint in UKIP from which I resigned in December 2018, in the wake of Gerard Batten’s disastrous decisions to transform UKIP into a BNP lite party. The Conservative Party’s future, like that of the other major British political parties, is connected with the British National Interest. In any democracy it is not unreasonable for MPs to be concerned with the outlook for their parties, provided that MPs remember that their ultimate loyalty is to their Country and to their Constituents.\nIt is a central message of this blog that the British National Interest and the interests of the Conservative Party and DUP are completely aligned for Brexit, as is explained below.\nThe Conservative Party interest is:\n(a) To deliver Brexit fully and incontrovertibly right now, as promised to the British People by David Cameron in 2016 and then repeatedly by Theresa May in the years since. The only way to achieve this is by a WTO Brexit on 12th April, the so-called No-deal. If British MPs were to approve of May’s disastrous surrender deal, then the nightmare continues, and grows. Yes, the U.K. would leave the EU Treaties, probably on 22nd May, but on the same day we would rejoin the E.U. institutions, without any voting rights, via Theresa May’s Withdrawal Agreement which would take the form of an international treaty. Brexit would be delivered in name only, the British People would see through the sham travesty and the division, the arguments and the shenanigans in Parliament would continue apace, with no end in sight. The controversy would be fuelled by the trade negotiations with the E.U., which few people realise have not started to this day. The Conservative Party would be in line to receive the greater part of the electorate’s fury, having been the governing party overseeing the unfolding disaster.\n(b) To keep the United Kingdom outside of the European Elections. If the U.K. were to participate in these elections then tens of millions of Conservative voters would be justifiably outraged and moreover these voters would not vote Conservative; they would vote for UKIP or Nigel Farage’s new Brexit Party. And many of these voters, having voted UKIP or Brexit Party in the Euro Elections, would continue to support these parties in future British elections, repeating the pattern in 2009/2010 and most especially in 2014/2015.\n(c) To see the final end of UKIP and prevent the emergence of Nigel Farage’s Brexit Party. If the Conservative government delivers a WTO Brexit on 12th April 2019 then UKIP will continue on its rapid path to extinction and the Brexit Party will be stillborn: dead before it was ever born.\n(d) To fight a British General Election in 2022, three years after having delivered Brexit fully and replaced Theresa May with a new leader. In this way Theresa May’s successor will have ample time to bed down, move on from Brexit and develop his or her program for the future. As explained above, a WTO Brexit on 12th April is only way of delivering this. Any other option: May’s disaster deal, a rerun of the referendum or revocation of article 50 means the next general election being dominated by the Conservative Party’s disastrous handling of Brexit.\nThe DUP interest is:\n(a) To uphold the Union between Great Britain and Northern Ireland. I will not rehearse the arguments about the appalling Backstop and the blatant attempt by the E.U. to carve Northern Ireland away from the United Kingdom, as Martin Selmayr has gleefully admitted. Clearly a clean WTO Brexit is the best outcome for Unionists; no ifs no buts, just total clarity: the United Kingdom of Great Britain and Northern Ireland becomes again 100% a Sovereign Country, with no obligations of any sort whatsoever to the E.U.\n(b) To deliver prosperity to Northern Ireland. Northern Ireland, like many parts of the English North and Midlands, along with much of Wales and Scotland, has become de-industrialised and over-dependent on government civil service employment to keep the local economy going. British manufacturing needs to make a major comeback in Northern Ireland, just like it needs to in much of Great Britain. Leaving the E.U. is not a panacea. But it will give the whole country, including Northern Ireland, the opportunity to chart a new course, with the powers over employment, competition, state aid, industrial policy, trade, energy and the environment in British hands not E.U. hands.\nThe British National Interest\n- The British National Interest is dominated by the overwhelming need to bring the Country together and to re-assert the fundamental principles of democracy and the rule of Law. On 23rd June 2016 the Referendum on E.U. membership was held, in the context of public declarations by the then Prime Minister David Cameron that the People’s decision would be implemented i.e. we would leave the E.U. if the majority voted to leave, and remain if the majority voted to remain.\n- As we all know 17.4 million voted to leave and 16.1 million voted to remain, giving a clear majority to leave. Most British people expected this decision to be respected even if they were on the losing side. This is because there is a greater principle at stake than E.U. membership: democracy itself. Whilst many in the 16.1 million who voted to remain will have been disappointed by the referendum result, leaving the E.U. does not mean we are out of the E.U. forever: the referendum directed the government to leave the E.U. today and did not in any way forbid future generations from deciding to rejoin. In twenty years’ time for example, the public mood might swing towards E.U. membership again, and we could conceivably rejoin the E.U. But today the issue before the Nation is to implement the referendum decision in full, and thereby underline the fundamental democratic principle that the People decide.\n- The Country is understandably very tired of the Brexit process and wants a conclusion. Leaving the E.U. on 12th April 2019 will bring this conclusion and the Brexit process will end immediately. In the following weeks and months people will observe that the earth is still spinning on its axis, that life continues and most especially private enterprise, the engine of the whole World economy. The scare stories about “No deal” will die their own deaths as reality imposes its own agenda, and people will move on. The simple act of continuing to live and work normally after Brexit day will bring most people together. Having campaigned extensively in the Referendum my perception is that most remain supporters were worried about their jobs; when they live the reality of prosperity following Brexit day then I think the Brexit divisions will fade away. A minority will remain discontented. These are people, characterised perhaps by the journalist Polly Toynbee, who are clearly very uncomfortable with any sense of British identity, and who saw in the E.U. a preferred national entity for their loyalties. They will never be placated, and will ultimately have to decide individually whether to adapt to a Sovereign Britain or become citizens of an E.U. member state.\n- If we were to extend article 50 into the European Elections, rerun the referendum and/or belatedly agree Theresa May’s disastrous Withdrawal Agreement then the Brexit process would continue, with no end in sight. The public mood would become progressively more and more hostile to the political structures; already recent opinion polls suggest that around 60% of the public believe Parliament has been deliberately obstructing Brexit – sadly they are right, and this reinforces the reality that whilst the politicians can stop Brexit, they cannot deceive the public.\n- The British economic interest is to revive British Manufacturing industry, which has stagnated (not grown) over the last 25 years. Contrary to received wisdom, Britain’s export performance of goods, as opposed to services, to the E.U. has been very poor indeed. Over the last 25 years our exports of goods have increased by around 2% in real terms, compared with an increase of more than 80% for our goods exports to the rest of the World. This is why our goods exports outside of the E.U. have overtaken our goods exports to the E.U. Our exports of services to the E.U. trebled over the last 25 years, but they also trebled to the rest of the World. Consequently most of our service exports, like most of our goods exports, continue to go outside the E.U. Only 44% of our total exports went to the E.U. in 2017, and the percentage goes down every year. The EU27 today only represents around 12% of the World economy – our future is in the World, not in the E.U.\nConclusion\nConservative and DUP MPs have the opportunity, perhaps rare in politics, to follow a course of action that is 100% in the Country’s interest and 100% in the interests of their political parties.\nJust Do It!",
  "https_brexitinformation_com_/https_brexitinformation_com_2019_04_07_why-the-cooper-bill-is-unlawful/content_10.html": "Yvette Cooper MP has sponsored a Bill (European Union (Withdrawal) (No. 5) Bill) which directs the Prime Minister to seek an extension of the period specified in Article 50(3) of the Treaty on European Union. This Bill is unlawful because it is progressing through Parliament without Queen’s Consent having been signified at the Third Reading in the Commons. Cooper’s Bill directs the Prime Minister to extend the A50(3) period of the Treaty of European Union. The Prime Minister would do this using the Royal Prerogative, because making treaties is part of the Royal Prerogative. Any Bill that impinges on the Royal Prerogative must have Queen’s Consent to be debated signified at the Third Reading. Normally the government has control of the order paper, and the Queen would be given binding advice by the Prime Minister to signify Queen’s Consent for any Bills supported by the government that impinge on the Royal Prerogative. However backbench MPs, such as Yvette Cooper, do not give binding advice to the Queen and consequently it is no surprise that Queen’s Consent has not been signified for this Bill.\nAbsence of Royal Consent from Yvette Cooper’s Bill\nBelow is the link to Hansard for Yvette Cooper’s Bill; there is no mention of Queen’s Consent, which is not surprising as Yvette Cooper MP, being a backbench MP, cannot advise the Queen.\nHansard for Yvette Cooper Bill\nBelow is the link to Hansard for the third reading of the EU Withdrawal Act 2018. Hansard clearly states that Queen’s Consent (sometimes called Royal Consent) was signified for this Bill, which makes sense as the Prime Minister gives binding advice to the Queen and the Bill was government business.\nHansard for the third reading of EU Withdrawal Bill 2018\nThe Cooper Bill\nThe operative parts of the Bill where the Prime Minister is given the instruction to extend the Article 50 period are subsections (4) and (5) of clause 1 of the Bill, as follows:\n“….(4) If the motion in the form set out in subsection (2) for the purposes of subsection (1) is agreed to without amendment, the Prime Minister must seek an extension of the period specified in Article 50(3) of the Treaty on European Union to a period ending on the date included in that motion.\n(5) If the motion in the form set out in subsection (2) for the purposes of subsection (1) is agreed to with an amendment to change the date in the motion as moved to another date, the Prime Minister must seek an extension of the period specified in Article 50(3) of the Treaty on European Union to a period ending on the date included in the motion as agreed to.…..”\nThe above clauses are legally binding on the Prime Minister. This is the conclusion of the House of Commons Library Briefing Paper 08541 of 2nd April 2019 on this Bill – see section 3 of the paper on page 10. The Briefing Paper is here:\nThe full text of the Yvette Cooper Bill is here:\nQueen’s Consent and the Royal Prerogative\nA helpful pamphlet on Queen’s Consent, published by the office for parliamentary counsel, is available below. The pamphlet also covers Prince’s Consent, covering those areas where the consent of the Prince of Wales is required.\nQueen_s_and_prince_s_consent_pamphlet__September_2018___accessible_\nAt the start of chapter 2 on page 2 the pamphlet says:\n“…..2.1 Queen’s Consent needs to be considered in the case of –\n- provisions affecting the prerogative and;\n- provisions affecting the hereditary revenues of the Duchy of Lancaster or the Duchy of Cornwall, and personal property or personal interests of the Crown….”\nIn chapter 2, pages 2-3, section 2.7 says:\n“…..prerogative powers of government (whether, in practise, exercised personally by the Monarch (with or without the advice of Ministers), or exercised on her behalf by Ministers, officials or other bodies) includes the following powers –\n- to make treaties;…..”\nIn Chapter 4 exceptions are considered to the above rule, where if the impact of a Bill on a Royal Prerogative is considered minor or trivial, then Queen’s Consent is not needed. Examples are given – and it is noteworthy that they cover Bills which impinged theoretically on the Queen’s revenues but in practise had little or no impact. No examples are given of Bills affecting broad prerogative powers such as making treaties or waging war being exempt from the requirement to have Queen’s Consent.\nIndeed the Military Action Against Iraq (Parliamentary Approval) Bill 1999 provides a useful president. It was a private member’s Bill introduced by the late Tam Dalyell MP, then a Labour backbencher, like Yvette Cooper today. The aim of the Bill was to make military action by the United Kingdom against Iraq contingent on approval by a simple majority on a motion in the House of Commons. The Bill therefore impinged on the Royal Prerogative in respect of waging war, just like Yvette Cooper’s Bill does. The Bill did not have Queen’s Consent and consequently fell at its Second Reading. (Note that the requirement for Queen’s Consent was moved from the second reading to the third reading in 2015 – see the above pamphlet.)\nThe above pamphlet concludes in chapter 5:\n“….5.1 Queen’s or Prince’s Consent must be signified in each House of Parliament, though it is normally only sought once in relation to a bill unless amendments to the bill require it to be sought again….”\nConclusion\nYvette Cooper’s Bill is unlawful. Its progress through Parliament should halted until a request is submitted for Queen’s Consent. Failure to see Queen’s Consent signified should cause the Bill to fall.",
  "https_brexitinformation_com_/https_brexitinformation_com_2016_05_17_the-eu-treaties/content_19.html": "If you really want to know what the EU is then you must read the EU Treaties – both of them, as amended:\n- The Treaty of the EU (TEU) – originally the Maastricht Treaty\n- The Treaty for the Functioning of the EU (TFEU) – originally the Treaty of Rome\nHere they are in one document:",
  "https_brexitinformation_com_/https_brexitinformation_com_author_jameshenrybush_page_2/content_20.html": "Data Section\nThe office for National Statistics (ONS) 2018 Pink Book for the British Balance of Payments in 2017 is here: UK … Continue reading Data Section\nThe office for National Statistics (ONS) 2018 Pink Book for the British Balance of Payments in 2017 is here: UK … Continue reading Data Section\nIf you really want to know what the EU is then you must read the EU Treaties – both of … Continue reading The EU Treaties\nBritish Project rev D The above report describes how a vote for Brexit (Leave EU) will give our Country new … Continue reading The British Project\nFollowing the clear instruction delivered by the British People through the June 23rd 2016 Referendum, this Blog is about promoting … Continue reading Securing our Country’s future: Making a Clean Brexit Happen",
  "https_brexitinformation_com_/https_brexitinformation_com_2019_06_03_why-i-left-the-tories-and-joined-the-brexit-party/content_16.html": "I set out below why last Friday I decided to resign from the Conservative Party and join the Brexit Party:\n1. The Conservative Party is on course to fail to deliver Brexit by 31st October 2019, or indeed at a later date. By Brexit I mean leaving fully the two treaties which define EU membership, the Treaty of the EU (TEU) and the Treaty on the Functioning of the EU (TFEU), and not concluding any new treaties with the EU. Ipso facto leaving all of the EU’s institutions. In a nutshell, to carry out the instruction of the 23rd June 2016 referendum.\n2. Brexit is the most important issue in British Politics since Winston Churchill replaced Neville Chamberlain in the aftermath of the failure of the Norwegian Campaign in May 1940. The Conservative’s Party failure to deliver Brexit will end the Party as a major electoral force in British Politics for decades or perhaps even permanently. The United Kingdom is about to experience what happened in Canada 26 years ago when Preston Manning’s Reform Party came from nowhere and destroyed the Progressive Conservatives. Nigel Farage is Britain’s Preston Manning and the Brexit Party is Britain’s Reform Party.\n3. Under May the Conservative Party has approached Brexit as a negotiation to conclude a new treaty with the EU – colloquially referred to as a “deal”, and all of the Conservative Party leadership candidates, with the exception of Esther McVey, are committed to continuing this approach. If I hand in my notice to my employer, then at the end of my notice period my contract of employment has no effect and I have left my employer. But if on the last day of my notice period I conclude a new contract with my employer then I have not left all, I have simply changed my job function. In the same vein, because our membership of the EU is defined by adherence to treaties, if we conclude a new treaty with the EU we aren’t leaving the EU, we’re simply changing our membership terms, even if we no longer have the label “EU member”.\n4. Conservative leadership candidates Rory Stewart and Matthew Hancock have publicly opposed leaving the EU without a deal i.e. a new treaty. This is precisely because conclusion of a new treaty will cement Britain into the EU, which is what Hancock and Stewart want. The argument of Hancock, Stewart, Hunt and others that a better deal can be obtained whilst opposing no-deal is an outrageous lie. By opposing no-deal they guarantee the EU will never renegotiate May’s awful deal: Either we accept May’s deal and the consequential vassalage or we don’t accept the deal and remain in the EU on current terms forever. The EU wins either way, and Hancock, Stewart, Hunt and all the others are fully aware of this. Opposition to no deal is weasel-speak for opposition to Brexit full stop. In plain English large swathes of the Parliamentary Conservative Party are totally opposed to Brexit. The genuine Brexiteers are a minority in the Conservative Parliamentary Party.\n5. In my opinion Brexiteers everywhere, very much including myself, have massively underestimated the total commitment of the British Establishment to the cause of EU membership. Phillip Hammond, Amber Rudd, David Gauke etc understand that the failure to deliver Brexit will destroy the Conservative Party. But it is a sacrifice they are willing to make, as Hammond recently admitted when he refused to rule-out voting with the opposition on a confidence vote if the government were to pursue no-deal. When the electoral cataclysm comes for the Conservative Party I predict that Remain former MPs will be looked after: jobs in the EU Commission, non-executive directorships in large multinationals. Indeed some Conservative MPs may well be in discussion right now about jumping ship to the Liberal Democrats.\n6. The EU has only ever had one priority: its own survival. The EU is terrified of British success once outside of the EU, because this would inevitably lead Denmark, Sweden, the Czech Republic, the Netherlands and even Italy to leave the EU, and thereby bring about the EU’s collapse. So right from the start the EU’s approach has been to stop Brexit outright or make the leaving terms injurious and humiliating for Britain, to deter the other member states from leaving. Indeed Michel Barnier, soon after his appointment as EU Brexit negotiator, said that his objective was to make the withdrawal agreement so onerous that we would decide to revert to EU membership on pre-Brexit terms.\n7. In 2016 the EU might have been willing to consider a negotiating a Free Trade Agreement (FTA) with the UK, that would have come into force on Brexit day. But this would only have been possible with an assertive British government making it abundantly clear from the outset that Britain would not conclude any new treaties with the EU. Perhaps Boris Johnson could have pulled it off had he won in 2016. As it was Theresa May became PM instead, she capitulated and now nothing will convince the EU we are willing to leave without concluding a new treaty. Consequently they will not renegotiate May’s Withdrawal Agreement or consider an FTA.\n8. Brexit can only be delivered by leaving without concluding a new treaty with the EU. Of course Brexit is entirely compatible with making agreements (not treaties) with the EU in the framework of existing worldwide treaties such as the World Trade Organization (WTO). The only leadership candidate to fully understand this is Esther McVey with odds of 33:1 of becoming leader. Perhaps Raab and Johnson have also some understanding of this.\n9. Even if Esther McVey/Raab/Johnson were to become leader, the large Remain contingent in the Conservative Party would torpedo their premiership. Just look at the total breakdown in cabinet responsibility and the guerilla warfare waged by hardline Remain Conservative MPs against Brexit, in the last 6 months in the Commons.\n10. What is most striking about the leadership candidates is that none of them have a plan and none of them seem remotely informed about how trade works, how the EU works, international standards, the British Constitution or how the WTO works.\n(a) The biggest obstacle to any sort of Brexit is Parliament itself. None of the candidates have a plan to overcome this difficulty. Yet there is a way out of this. Ten years ago Stephen Harper was leading a minority Conservative government in Canada and was facing a no-confidence vote because of opposition to his budget. So he asked the Queen’s representative the Governor General to prorogue the Canadian Parliament for 6 weeks and used the time to agree the budget with his coalition partners. The only hope for the new Prime Minister is to follow Harper’s Canadian example and prorogue Parliament from day one till 1st of November 2019, and thereby deliver Brexit, without of course concluding any new treaty with the EU. And yet not one single candidate has ever mentioned Stephen Harper or proroguing Parliament.\n(b) Goods trade between EU member states is not friction free and the EU internal market in goods is incomplete for the simple reason that VAT directive has not been fully implemented, and has no prospect of ever being implemented. All exports between EU countries must have Intra EU Export forms for VAT, because imports entering an EU country are subject to VAT in the receiving country for the full value of the import, regardless of whether the import comes from another EU country or a country outside the EU. So the whole concept of VAT breaks down at the borders between EU member states, generating paperwork. If the VAT directive were ever fully implemented then all the EU countries with trade deficits with the other EU states would see huge losses in VAT receipts, with Germany and the Netherlands seeing large gains (Britain would lose around £16 billion a year). So all the arguments amongst the candidates about “frictionless trade” are a total and utter irrelevance: there is no frictionless trade to start with.\n(c) Articles 8 and 21 of TEU place binding obligations on the EU to reduce tariffs and barriers to trade in its trade with non-EU jurisdictions. The EU’s negotiating stance over Brexit has flagrantly flouted articles 8 and 21, and yet not a single candidate proposes to take the EU Commission to court over this.\n(d) A big challenge facing Britain trading on WTO trade terms with the EU is not a shortage of money, rather how to route efficiently the extra £9 billion in customs receipts we will get to the exporting companies that will be facing new tariffs. WTO rules forbid direct export support even when the justification is tariffs. Instead the WTO allows sectorial support for R&D and sectorially favoured tax regimes. Not one single candidate has mentioned this.\n(e) Another big challenge facing Britain on WTO trade with the EU is the 9.9% tariff on cars and automotive components. Actually our greatest vulnerability is that British cars typically use over 50% of EU components, which will suddenly jump in price. A farsighted candidate would be planning the construction of new factories in Britain to give secure and cheap component supplies to UK manufacturers. But not one single candidate has mentioned this. An immediate measure would be to set employers National Insurance contributions to zero for firms in the automotive sector so they would immediately see an improvement to their cost structure, to offset the new tariffs at least partially. Again, no mention of this by the candidates.\n(f) Finally engineering and scientific standards are totally dominated by American standards administered by American organizations: The Food & Drug Administration (FDA), The Federal Aviation Administration (FAA), The American Society of Mechanical Engineers (ASME), The American Petroleum Institute (API)…The aviation, pharmaceutical and chemicals industries use American standards and design codes for practically everything. Our membership or not of the EU is totally irrelevant. Again, the candidates seem totally unaware of this.\nWhilst I accept that the Brexiteer leadership candidates are well-meaning, they come across as disorganized, very ill-informed, naïve, and yes, lazy and arrogant. As for the Remain leadership candidates, they are as duplicitous as they are determined to stop Brexit.\nConclusion\nThe Conservative administration under the new leader will either descend into chaos if a Brexiteer is elected or lead to the overt cancellation of Brexit if a Remainer is elected.\nOne way or another there will be a general election this year where the Conservative Party will be wiped out regardless of who is leading it. The Brexit Party will replace the Conservative Party in Parliament. If the Brexit Party secures a majority then Brexit will happen, if it doesn’t then Brexit will be cancelled.\nGood read. I look forward to more posts\nLikeLike",
  "https_brexitinformation_com_/https_brexitinformation_com/content_1.html": "Securing our Country’s future: Making a Clean Brexit Happen\nFollowing the clear instruction delivered by the British People through the June 23rd 2016 Referendum, this Blog is about promoting … Continue reading Securing our Country’s future: Making a Clean Brexit Happen",
  "https_brexitinformation_com_/https_brexitinformation_com_2020_04_10_unlocking-the-lockdown/content_14.html": "The problem\nThe World is confronted with a highly infectious disease, Coronavirus, which, thanks to the dreadful animal welfare standards prevailing in China, has jumped the species barrier to human beings. Consequently humanity has no immunity to this disease as the disease has evolved in animals not humans. Moreover, there is no vaccine for this disease and nor is there a serum or any proven curative therapy for it. The disease causes death in a minority of cases, although an accurate mortality is not known. However the mortality is observed to be a strong function of age, with almost no deaths recorded at all for babies, infants or small children but deadly for the elderly, with a mortality which increases progressively from low levels in adolescents and younger adults, higher levels in people over 40 and mortality rates possibly as high as 10% in people over 70. Overall mortalityrates of 1% have been cited.\nHow the World has responded\nWith a very few exceptions, governments across the World including the British government, have responded in the same way: lockdowns. The reader can surely appreciate the massive downsides to lockdown: mass house arrest, thousands of businesses put at risk, the finances of families and the state put at risk, damage to the education of millions of schoolchildren, and this list does not include the health downsides like suspended cancer treatments.\nThe British response\nThe British government has to its credit more than doubled the Country’s ICU capacity and is on course to double it again. The UK began with only 4,000 ventilators, we now have 10,000 and are producing a thousand per week. I commend the government’s decision to ramp-up British production of ventilators and of vital PPE. I also commend the government’s Nightingale hospital program, which is an outstanding success. The government can perhaps justifiably claim that the British lockdown was necessary to build British ICU and PPE capacity by slowing down the pandemic whilst these resources were built up.\nNevertheless, the reality must be faced that we cannot stay in lockdown indefinitely. We do need an exit plan from the lockdown, and fast. This Blog addresses this vital question. Before tacking the exit plan, it is worth examining the situation of Coronavirus in the UK.\nThe disease in the UK\nUntil very recently the UK had performed relatively few tests, around 2,000 per million, compared with five times this number in Germany, and with Switzerland managing nearly 20,000 tests per million. So the picture given by the record of cases in the UK is very misleading because so few tests have been carried-out. Consider that recorded deaths are currently running at around 800 per day, which implies that in a single day some 80,000 people must have become infected if one assumes the 1% mortality. Now the total number of recorded cases in the UK is 65,000 (on 9th April) i.e. less than the probable number of infections in one single day some 2 to 3 weeks ago. And this conclusion is reached using the relatively high 1% mortality number, which is around ten times the 0.1% mortality that is generally accepted for influenza.\nTherefore last Friday I carried-out a calculation (click on Coronavirus Calculation below) to determine the spread of the infection in the UK – the calculation text was updated today to correct an error of terminology. The calculation assumes that mortality is constant, which has the useful corollary that the fractional growth rate for deaths and cases are the same. Now the deaths data, unlike the cases data, is complete, allowing direct calculation of this fractional growth rate: k in the calculation below (this is the constant in equation 4 in the calculation: Number Infected = exp(k x time)). The first reported case in the UK was 1st February 2020, but the media has reported people returning from Italy and Northern Italy two weeks earlier with strong Coronavirus symptoms. I therefore assumed the infection began on 14th January with one person. Having already calculated the fractional growth rate k, this allowed direct calculation of the number of cases on any given day, and hence the mortality, as the ratio of deaths to cases. To do the mortality calculation I assumed that victims died two weeks after becoming infected.\nThe results are:-\nMortality = 0.29%\nNumber of cases* in UK as of 3rd April 2020 = 24.4 million\n*This is all infections, and therefore includes people who have recovered and are no longer infected.\nk = 0.213 per day\nYesterday the Daily Telegraph reported on a study by the German government where a single town was studied and tested in depth. The conclusion of the study was a mortality of 0.37%, quite close to the 0.29% number I calculated last week from a completely different data-set.\nIn the last week the value of k has, by my calculation, fallen to around 0.12 per day. Using this value, and taking 24.4 million as the number of cases last Friday, I find that the number of cases today in the UK is:\nNumber of cases as of 10th April 2020 = 24.4 million x exp(0.12 x 7)\nNumber of cases as of 10th April 2020 = 56.5 million\nIf the above is correct then the UK, with a population of 66 million, has already acquired herd immunity, and in plain English, the general lockdown is no longer needed. The afore-mentioned German study reaches a similar conclusion.\nConclusions and Recommendations\n- To anybody reading this blog I recommend fully complying with the letter and spirit of the Government’s general lockdown, until such time as this lockdown is lifted. This blog and its attendant calculations is arguing that most people in the UK have or already have had Coronavirus. But this is a hypothesis not a fact. In crisis situations it is very important that people are disciplined and act in a co-ordinated way. Obedience to government directives is therefore vital to avoid chaos.\n- The government must level with the British People. Most British people are going to get coronavirus, and it is likely that most people already have. Taking the 0.29% mortality this means that around 100,000 people or more may well be taken away by the virus. I cannot see any other possible outcome given that the virus is so infectious and there is no vaccine or curative therapy. Obviously I hope that I am wrong, but even if the 0.1% mortality number for influenza is used then the total death toll is likely to exceed 30,000 people in the UK.\n- The general lockdown must be brought to an end before the end of this month (April 2020). The government needs to move the national conversation away from stay at home. It is simply not possible for the Country to hide from the virus in our dwellings indefinitely, especially as the lockdown may well be becoming futile right now.\n- The government must publish the disease progression modelling so that it can be scrutinized. It is very disturbing that it has not already done so.\n- Whereas the general lockdown must be swiftly ended, there is a strong case for a selective lockdown based on age and health complications, as it is an established fact that the elderly and infirm are especially vulnerable to coronavirus. Now the elderly and infirm are not usually economically active. So the British economy can be fully restarted and rebooted whilst protecting the most vulnerable. A lockdown of the elderly and infirm is manageable over much longer timescales, and could be used to protect this section of the population whilst vaccines and curative therapies are developed.\nI fully believe this. I had mild symptoms at the start of March (2nd of March), which included a burning sensation in my sinus, blocked nose, general feeling of unwellness (malaise), slight weakness and some muscle aches in my lower back.\nI have determined that along with this data, my suspicions were true that I was infected with COVID-19 and as with so many millions of cases, I only experienced very very mild symptoms that lasted 5-6 days maximum.\nMy job involves being in large crowds of people without divulging too much information, and 1 week prior to my infection I was within huge crowds.\nLikeLike\nA good article which contains (IMHO) a major flaw – it assumes that the spread of the disease is uniform throughout the country.\nAnecdotal evidence (and some reading between the statistical lines) suggests this is far from the truth: Most of the infections are probably confined to hospitals and care homes where the death rate is very much higher than the figure for the general population.\nIf this is correct, it is quite plausible that most of those in hospitals and care homes have or have had the disease (and hence the death rate will shortly peak and then drop) but most who are secluded at home have not yet had it.\nIf that is the case, then we should expect another spike of deaths after lockdown ends. How big a spike? I don’t know, but if you have already counted most of those most at risk, then the death rate for the remaining population would be very much lower, so even if 50 million people are not yet infected, we should not expect 1% of these (500,000) to die.\nI agree with the conclusion (that lockdown must end soon) but not for the reasoning given above.\nLikeLike\nAs at 18 April, 357,023 people have been tested in the UK of which 114,217 tested positive. You reckon that 56.5 million out of 66.5 million in the UK had Coronavirus as of 10 April (and presumably your latest figures would show an even higher figure). The people who have been tested are those most likely to have the virus (showing symptoms or working in high risk situations such as hospitals). I cannot see how 32% positive tests from a highly biased sample most likely to have the virus is possibly consistent with your reckoning that 85% have had the virus a week earlier. I would love to think your conclusions are correct but this comparison of your predictions and the facts suggests to me your modelling assumptions are incorrect and therefore your conclusions are incorrect.\nLikeLike",
  "https_brexitinformation_com_/https_brexitinformation_com_about/content_17.html": "Here is the British Project, which explains how, following a vote to leave the EU, we can rebuild our industries and build new, clean, reliable electrical power generation capacity:\nThe need to leave the EU to rebuild our manufacturing industries is succinctly expressed by the following leaflet:\nThe looming electricity generation crisis that the EU is inflicting on Britain is explained in the British Report above and also in the leaflet below:\nThe UK’s true trade position with EU is shown graphically in the attached leaflet:\nThe electricity generation crisis is also helpfully described in the following article:\nThe overall economic case for leaving the EU is set-out in the attached leaflet:",
  "https_brexitinformation_com_/https_brexitinformation_com_2019_01_27_how-the-government-can-stop-anti-brexit-bills-from-becoming-law/content_7.html": "The government is faced with backbenchers, notably Yvette Cooper and Dominic Grieve, who are seeking to stop Brexit from happening by repealing or amending the 2018 EU Withdrawal Act and 2017 EU Notification of Withdrawal Act. In the normal run of things, a backbench initiative should not present a problem to a government because a government has control of the legislative timetable, notably through standing order 14 of the House of Commons. However the Speaker of the Commons John Bercow is very hostile to Brexit and is very biased. He is ensuring, and will ensure, that these backbench anti-Brexit initiatives get parliamentary time.\nMoreover, the government’s majority, even including the DUP is very slender (13), and rebellions by hardline Remain Conservative MPs could well get anti-Brexit legislation through the Commons.\nHowever the government does have three ways of preventing bills from becoming law, beyond seeing them voted out in the Commons. The purpose of this blog is to say what they are and to provide the background constitutional explanation, including the precedents.\nThe ways a government can stop bills from becoming law, besides voting them out in the Commons, are:\n- Advise the Queen to withhold Royal Assent when the bill is presented to her, following its successful passage through the Commons and Lords. This power was last used in Queen Anne’s reign in 1708 to block a bill on Scottish Militias.\n- Advise the Queen to withhold her consent for the bill to be debated. This would cause the bill to fall at the Third Reading. This power pertains only to bills impinging on the Royal Prerogative. This power was last used as recently as 16th April 1999 (see below) on advice from the Blair government to block a bill that would have made the decision to attack Iraq contingent on a vote in the House of Commons.\n- Advise the Queen to prorogue Parliament i.e. to suspend Parliament. If Parliament is prorogued all the bills going through Parliament fall. This power was last used in Canada, where the Canadian Parliament was prorogued between 4th December 2008 and 26th January 2009, on advice from Stephen Harper’s Conservative government, in order to avoid a vote of no-confidence.\nAny bill that would repeal the 2018 EU Withdrawal Act and/or the 2017 EU Notification of Withdrawal Act outright or instruct the government to seek an extension of the Article 50 period, would also be impinging on the Royal Prerogative. This is because the power to make, break or modify international treaties is a Royal Prerogative. Britain’s EU membership is based on successive British governments having signed, using the Royal Prerogative, the set of EEC/EC/EU treaties that are known collectively as “The Treaties” and formally as The Treaty of the EU (TEU) and The Treaty for the Functioning of the EU (TFEU). British adherence to these treaties is given legal effect by the 1972 European Communities Act, as amended. This is why the core of the 2018 EU Withdrawal Act is to repeal the European Communities Act at 11PM on 29th March of this year. It follows then that the government could choose to block anti-Brexit bills using the second way above i.e. block the bill at its second reading, because any anti-Brexit bill would force the government to seek to extend British adherence to the EU Treaties beyond 11PM on 29th March 2019.\nThe Monarch is the head of the Government as well as head of State.\nThe United Kingdom has a head of state, a government and a legislature. The head of state is also the head of the government, as is also the case in the United States and France. This is why the British government is called Her Majesty’s Government, for the simple reason that the government is her Majesty’s. For the same reason British government ministers are known as Ministers of the Crown. This constitutional point was made by Winston Churchill, perhaps unintentionally, in the telegram he sent to General Alexander on 10th August 1942 appointing him as Commander in Chief Middle East:\n“1. Your prime and main duty will be to take or destroy at the earliest opportunity the German-Italian Army commanded by Field Marshall Rommel, together with all its supplies and establishments in Egypt and Libya.\n2. You will discharge or cause to be discharged such other duties as pertain to your Command, without prejudice to the task described in paragraph 1, which must be considered paramount in His Majesty’s interests (my italics)”\nIn conclusion the Queen is the head of the government. This statement might surprise people because the Queen’s position is hereditary and she has no democratic mandate. This apparent difficulty has been overcome by the convention that the Monarch accepts binding advice from the Prime Minister. Thus the Queen’s very considerable powers are exercised not on the Queen’s own free will but on the advise of the Prime Minister.\nAt this point it is worth making a diversion into history to see how the Monarch’s role has changed. Medieval Kings and Queens were active heads of government in the sense that we would recognize today as the compass of Prime Ministers. The Monarch would direct the government and appoint Ministers. Parliament was the legislature and right from the beginning of Parliament (in 1265) all taxes had have Parliament’s assent before they could be levied. All statute laws were made in Parliament, an example of a surviving statute that is in force today is the 1351 Treason Act, passed in the reign of Edward III. In those days the Legislature (Parliament) and the Monarch’s government were very separate.\nOver a period of about 150 years, from the Glorious Revolution in 1688 to the beginning of Queen Victoria’s reign, the relationship between the Monarch and Parliament changed, and moved towards the situation we have today. This change was due to:\n- The 1689 Bill of Rights which re-emphasized Parliamentary power.\n- The emergence of political parties (the Whigs and Tories) in William III’s reign.\n- George I becoming King in 1714, a German with no knowledge of English, and this led to the emergence of the office of Prime Minister (Robert Walpole in George I’s reign).\nIn Queen Victoria’s reign the situation was very similar to today, in that the Prime Minister would give binding advice to the Monarch, and the Prime Minister had supplanted the Monarch as the person directing the government.\nRoyal Assent\nTo become statute Law a bill that has successfully passed through the Commons and Lords must receive Royal Assent. This is not a formality. Royal Assent is the Head of the Government saying “yes” to legislation going onto the statute book. The mechanism of Royal Assent is the means by which the constitution makes sure that both the government and legislature agree with a bill becoming statute Law. This point was very obvious in the period before 1688, when the government was unambiguously in the day to day control of the Monarch.\nIt is fair to say that Royal Assent has in more recent times had the appearance of a formality, because the government has been in control of the parliamentary timetable so any bill that made it through the Commons and Lords would only have done so with governmental approval. Moreover the British first past the post system tends to result in governments having working majorities in the House of Commons with well under fifty per cent of the total popular vote. However the foregoing situation has changed since 2011:\n- The passing of the Fixed Term Parliament Act 2011 means that governments fall much less easily than before. i.e. minority governments can survive despite defeats in the House of Commons.\n- The hung parliaments in 2010 – 2015 and 2017 to the present means that governments have had to form coalitions or make confidence and supply agreements to have working majorities.\n- John Bercow, the Speaker, is using his own powers to discard precedent and favour the hard Remain side.\nThe above three factors mean that legislation could get through the House of Commons and the House of Lords against the wishes of the present government. Suddenly Royal Assent has ceased being a formality and has returned to its former significance pre-1688, as the assent of the government to a new statute law.\nRoyal Prerogative\nThe Royal Prerogative powers are those powers which the Monarch exercised directly as Head of the government in Medieval Times and which the Monarch exercises today on the advice of the Prime Minister*. They may be listed thus:\n- The power to grant Royal Assent to bills that have gone through the Commons & Lords. When a bill receives Royal Assent it becomes statute Law.\n- The power to appoint the Prime Minister.\n- The power to summon Parliament.\n- The power to prorogue Parliament.\n- The power to wage war on another country.\n- The power to annexe a foreign territory.\n- The power to make (or break) international treaties.\n- The Monarch is the Commander in Chief of the armed forces.\n- The power to make regulations for the armed services.\n- The Monarch is the Supreme Governor of the Church of England.\n- The power to appoint Bishops and Archbishops in the Church of England.\n- The power to grant passports.\n- The power to grant clemency to convicted prisoners.\n- The power to grant honours.\n*The exception is the power to appoint the Prime Minister. This is not done on the advice of the Prime Minister. Instead the Queen (or her Governor General in Australia, Canada or New Zealand) exercises her own judgement for this decision.\nQueen’s Consent\nWhen a bill that impinges on the Royal Prerogative (see above) is brought before Parliament the Queen’s Consent is required for the bill to proceed beyond the Third Reading. Indeed up until 24th February 2015 the requirement for the Queen’s Consent was at the Second Reading. As well as the Royal Prerogative, the Queen’s Consent is also required for bills impinging on:\n- Hereditary revenues of the Monarch.\n- The Duchy of Lancaster.\n- The personal interests of the Monarch.\nIf a bill that requires the Queen’s Consent does not receive the Queen’s Consent then the bill falls at the Third Reading.\nPrecedents for withholding of the Queen’s Consent.\nHer Majesty Queen Elizabeth II has, on the advice of her Prime Minster of the day, withheld her consent for bills to be debated on three occasions during her reign. In all three cases the bills impinged on the Royal Prerogative. These precedents are:\n- The Military Action Against Iraq (Parliamentary Approval) Bill, 1999.\n- The Reform of the House of Lords Bill, 1990.\n- The Palace of Westminster (Removal of Crown Immunity) Bill, 1988.\nThe Military Action Against Iraq (Parliamentary Approval) Bill 1999.\nThe Military Action Against Iraq (Parliamentary Approval) Bill was a private member’s Bill introduced to Parliament under the Ten Minute Rule. It was proposed by the late Tam Dalyell MP and had its First Reading on the 26th January 1999. The aim of the bill was to make military action against Iraq by the United Kingdom contingent on approval by a simple majority on a vote in the House of Commons. The bill therefore impinged on the Royal Prerogative in respect of waging war. On the advice of the then Prime Minister Tony Blair the Queen withheld her consent for the bill to be debated. The bill was bill 35 in the 1998/1999 Parliamentary session. Its Second Reading was initially scheduled on 16th April 1999 but was postponed till 23rd July 1999 because of the absence of the Queen’s Consent. On the 23rd July 1999 the bill fell at its Second Reading because the Queen’s Consent was still withheld.\nThe Reform of the House of Lords Bill 1990.\nThis bill sought to make the House of Lords an elected chamber. The Queen’s Consent was withheld on the advice of the late Prime Minister Margaret Thatcher, presumably on the grounds that the bill impinged the Royal Prerogative in respect of summoning Parliament. This bill did not receive the Queen’s Consent on 26th January 1990, the date of its Second Reading and consequently the bill fell. The bill had been proposed by Graham Allen MP.\nThe Palace of Westminster (removal of Crown Immunity) Bill 1988.\nThis bill sought to remove the employees of the Palace of Westminster from the jurisdiction of the Monarch, in order for these employees to have the statuary employment rights as employees in general. The Queen’s Consent was withheld on the advice of the late Prime Minister Margaret Thatcher, presumably on the grounds that the bill impinged on the Monarch’s personal interests. The bill therefore fell at its Second Reading on 8th July 1988. The bill had been proposed by Joan Walley MP.\nProrogue Parliament.\nProrogation of Parliament means the ending of a session of Parliament. Prorogation is usually carried-out in the context of an up-coming general election and the Queen prorogues Parliament on advice from her ministers. Prorogation can also be used outside of the general election timetable, if the government of the day wishes to suspend Parliament’s activities.\nThe most recent precedent for prorogation outside of the general election timetable is Canada, in December 2008. Six weeks before the Federal Elections had yielded a minority Conservative government. In December the opposition parties decided to try and bring down the government by a vote of no-confidence, because they objected to the government’s proposed budget. The Canadian Prime Minister, Stephen Harper, asked the Queen’s representative, the Governor General Michaelle Jean, to prorogue Parliament. This the Governor General agreed to do, on condition that Parliament reconvene in January 2009. The Canadian Parliament did reconvene on 26th January 2009 and the Conservative government’s budget was passed with the support of the Liberal Party.",
  "https_brexitinformation_com_/https_brexitinformation_com_author_jameshenrybush/content_15.html": "Unlocking the Lockdown 2\nSummary The coronavirus outbreak in the UK is modeled on the basis of rate of spread being proportional to the … Continue reading Unlocking the Lockdown 2\nSummary The coronavirus outbreak in the UK is modeled on the basis of rate of spread being proportional to the … Continue reading Unlocking the Lockdown 2\nThe problem The World is confronted with a highly infectious disease, Coronavirus, which, thanks to the dreadful animal welfare standards … Continue reading Unlocking the Lockdown\nIn my last post in May of this year I explained why I left the Conservative Party and joined the … Continue reading Why I believe Boris’ Deal delivers Brexit\nI set out below why last Friday I decided to resign from the Conservative Party and join the Brexit Party: … Continue reading Why I left the Tories and joined the Brexit Party\nYvette Cooper MP has sponsored a Bill (European Union (Withdrawal) (No. 5) Bill) which directs the Prime Minister to seek … Continue reading Why the Cooper Bill is unlawful\nToday, March 30th 2019, was supposed to have been the United Kingdom’s first full day as an independent sovereign country … Continue reading What Conservative and DUP MPs must do now.\nBritish MPs must vote against the Withdrawal Agreement today on 29th March 2019 because it is not Brexit. This agreement … Continue reading Why MPs must vote against the Withdrawal Agreement Today\nThe government is faced with backbenchers, notably Yvette Cooper and Dominic Grieve, who are seeking to stop Brexit from happening … Continue reading How the Government can stop anti-Brexit Bills from becoming Law\nTechnomica has published a paper on the three options for Brexit: May’s Withdrawal Agreement, a Canada-style Free Trade Agreement and … Continue reading Brexit Papers\nBrexit: The Way Foward. Before discussing Brexit in detail, it is important to set the scene: Dispel the myth circulated by … Continue reading Brexit: The way forward",
  "https_brexitinformation_com_/https_brexitinformation_com_2017_01_26_brexit-the-way-forward/content_3.html": "Brexit: The Way Foward.\nBefore discussing Brexit in detail, it is important to set the scene:\n- Dispel the myth circulated by the media: “access to the EU single market”.\n- Present Britain’s export performance in the EU.\n- Exports to EU by non-EU countries.\n- EU tariffs and the WTO.\nThere is no such thing as the EU “single market“\nQuite simply, there is no such thing as the EU single market. Take a look at the EU treaties (downloadable from this website) and you will find no mention at all of a “single market”. Instead, the treaties describe the EU customs union and the internal market consisting of the national markets of the EU member states within the customs union. The customs union is defined by the Common External Tariff (CET). The CET is one of the defining features of the EU, it is quite literally a fence behind which the EU member states are corralled. This fence is owned and policed by the EU institutions. Flows of goods, services and capital between EU states and non-EU states must go through this fence, and it is the same fence for every EU state. Flows of goods, services, capital and people between EU member states are not subject to any fence. This is the internal market – the market that is internal to the EU, and specifically internal to the customs union, with the CET as its boundary.\nThus for trading purposes, the CET has established the EU as a sovereign trading jurisdiction in its own right, just like the USA or South Africa. The EU and all its member states are full members of the World Trade Organization (WTO). Because the EU is a customs union, its member states have surrendered their rights to be independently represented for the purposes of international trade, and are therefore represented by the EU at the WTO. Because the EU is a full WTO member, it is obliged, right now, to give full access of its internal market to every other WTO member, just like every other WTO member has to. Sceptical? I suggest you make a visit to B&Q. Most of the goods on sale there are made in China, and China does not have a free trade agreement with the EU. Instead, China’s access to the EU internal market derives entirely from the WTO, just like the USA’s.\nBritish Export Performance in the EU\nAdvocates of EU membership, and those clamering to stay inside a non-existant “single market”, argue that British membership of the EU has somehow benefited British exporters. In a word, they are wrong.\nTaking 1992 as a base year, when the scope of the EU’s internal market was hugely expanded by the landmark Maastricht treaty, Britain’s export performance to the last full year (2015) has been lamentable for goods and for services the same as British exports to non-EU countries.\nNote to the reader: In all the discussions below about exports to the EU, whether by Britain or countries outside of the EU such as USA, the EU is the current EU membership less Britain. In this way direct comparisons between Britain and countries outside the EU can be made. For example, US exports to EU do not include US exports to Britain.\nGoods\nBetween 1992 and 2015 British exports of goods to non-EU increased by 81% in real terms. In contrast, British exports of goods to the EU only grew 5.7% in real terms over the same period. In fact if you change the base year to 1995 they actually shrank!\nBritish exports of goods to non-EU (£151 billion in 2015) have now overtaken British exports to the EU (£134 billion in 2015).\nIreland\nBritish exports of goods to the Irish republic were £16.8 billion in 2015, or 12.5% (one eighth) of the total £133.5 billion goods exports to EU by Britain. British goods exports to France, a country with 14 times more inhabitants than Eire were barely higher at only £17.9 billion, whereas British goods exports to Italy (61 million inhabitants) were only £8.4 billion – half the figure for Eire (4.6 million inhabitants). What a damning commentary of Britain’s EU membership that we can’t export successfully to large EU nations after 43 years of EU membership.\nThe high British exports to Eire are a legacy of the historical, cultural and family links between the two countries. British exports to Eire are totally untypical of British exports to the rest of the EU. Without Eire in the EU statics British exports to EU would only be £116.7 billion, well below the £151.4 billion of British goods exported to non-EU.\nBritain’s trade in goods with Eire generates a £ 4.8 billion surplus for Britain, in contrast with a deficit on goods of £89.5 billion with the whole EU. So without Eire in the statistics the deficit with EU would be £94.3 billion on goods, with goods exports being £116.7 billion and goods imports £211.0 billion. Thus imports would be approaching double our exports. Indeed on Britain’s goods trade with Germany and Italy it is already the case that imports are double exports.\nServices\nBritish exports of services, whether to the EU or non-EU, have trebled in real terms since 1992. So whilst it is true that British exports of services to the EU have grown strongly, this growth was matched in British exports of services to non-EU. In a nutshell British exports of services have done well, both to the EU and non-EU alike.\nBritish exports of services to non-EU (£137 billion in 2015) are much higher than British exports of services to EU (£89 billion in 2015).\nExports to EU by non-EU countries.\nThose who advocate EU membership argue that it helps British exporters, and that by extension, when we do leave the EU, that British exporters will somehow suffer. In the section above it is shown that from inside the EU British export performance of goods to the EU has lagged massively behind British export performance of goods to non-EU. In this section the exports of goods to the EU made by the USA and Switzerland are presented. If the advocates of EU membership are right, US and Swiss export performance to the EU must have been awful – after all if British performance from inside the EU was bad then countries outside the EU must have fared even worse, surely? Let’s see how these countries really performed.\nUS exports of goods to EU\nIn 1992 Britain exported 33% more goods to the EU than the USA. In 2015 the USA overtook Britain as an exporter of goods to EU. This happened because US exports to the EU grew strongly over this period, whereas British exports stagnated. It is important to put the strong US export performance into context:\n- The USA is outside of the EU, whereas Britain is in the EU, supposedly enjoying trade “benefits” from EU membership.\n- The USA does not have a free trade agreement in place with the EU – an attempt has been made to negotiate an agreement in recent years but it has now been abandoned with nothing in place.\n- The USA therefore trades with the EU on the basis of ordinary WTO rules and US exporters must pay tariffs to the EU, whereas British exporters do not*.\n*It is true that British exporters do not, from their own treasuries, make any direct payments to the EU in respect of exports made to the EU. However British exporters, like all British businesses, pay local and national taxes to the British state on a huge scale: corporation tax, employers’ national insurance contributions, business rates and so on. The British state then makes a net contribution to the EU budget, currently running at £11 billion or 8.4% of total British exports to the EU. So “UK PLC” does pay a trade tariff to the EU – from general taxation, which includes the receipts from British exporters. So indirectly British exporters do pay a tariff to the EU through their taxes. Of course EU exporters make no contribution to Britain directly or indirectly – EU exports to Britain are literally tariff free.\nSwiss exports of goods to EU\nBetween 1992 and 2015 the growth in real terms of exports of goods to the EU by Britain, USA and Switzerland has been, by country:\n- Britain: 5.7%\n- USA: 46%\n- Switzerland: 58%\nSwitzerland’s export performance has literally been ten times better than Britain’s. Like the USA, Switzerland is not (and has never been) an EU member. If the above statistics are not shocking enough, consider that Switzerland, a country with only 8 million inhabitants, exports more goods in absolute terms to Italy than does Britain, a country with over 65 million inhabitants. The foregoing is not a one-off fluke: British exports of goods to Italy have been running at 20 percent below Switzerland’s for the last five years. Italy is the EU’s third largest economy and historically a fountain of European culture. How is it, that after more than 40 years in the EU, that British export performance to this large and prestigious market is so bad? The inescapable conclusion is that EU membership has not helped British exporters.\nEU tariffs and the WTO\nAs stated above the EU is a full member of the WTO and must follow WTO rules in setting tariffs with other countries, which will include Britain when we leave. So the scaremongers are wrong: EU bureaucrats will not be at liberty to set whatever tariffs they like on British exports to EU. The two key WTO rules are:\n- Most Favoured Nation regulations.\n- The obligation to reduce tariffs.\nMost Favoured Nation (MFN) regulations\nThe MFN regulations forbid countries from levying lower tariffs on imports from one country or group of countries than on another, unless there is a free trade agreement between the countries. In plain English country A cannot levy lower tariffs on imports from country B than on country C unless there is a free trade agreement between country A and country B.\nThe MFN regulations mean that the current levels of tariffs levelled by the EU on imports from outside EU would apply to Britain if we left the EU without concluding a free trade agreement. On a trade weighted basis, EU tariffs average 3.6%. So overall EU tariffs are quite low, and this may well explain why the USA has been so successful in increasing its exports to the EU: Tariffs have been too low to make a difference. So if Britain left the EU tomorrow (hurrah!) the average tariff on British goods exports to EU would be 3.6% and Britain would be entitled to levy the same tariffs on our considerably higher imports from EU.\nThe obligation to reduce tariffs\nAll WTO members, including the EU, have an obligation under WTO treaties to work for the progressive reduction of tariffs. Indeed this obligation has been transcribed into article 21 of the Treaty of the EU (TEU) – see clause 2(e):\n“2. The Union shall define and pursue common policies and actions, and shall work for a high degree of cooperation in all fields of international relations, in order to:\n(e) encourage the integration of all countries into the world economy, including through the progressive abolition of restrictions on international trade;”\nCurrent EU tariffs\nAs already said above the trade-weighted average EU tariff is 3.6%. It is important to realise that:\n- Tariffs vary very widely. About 60% of EU goods imports are already tariff-free. By contrast the average EU tariff on agricultural products is 22.3%. Agricultural products account for around 10% of EU goods imports, but account for one third of the total EU tariff burden. The average EU tariff on non-agricultural products is only 2.3%.\n- The MFN regulations apply product group by product group. So country A cannot levy a tariff on imports of cars from country B of say 10% if it is only levying 8% on cars from country C. The MFN regulations would oblige country A to level down to 8%. However different patterns of trade between countries mean that the average tariffs levied by countries can vary whilst respecting the MFN regulations.\nApart from agricultural products, the other significant EU tariff is on cars and car components, where the tariff is 10%. This tariff would apply to British exports to the EU under WTO rules – but Sterling has devalued by over 15% since June 23rd, so even with this tariff British car exporters would still receive more pounds for each car sold into the EU than they did before the referendum. This is why Honda and Nissan have publicly committed to keeping and developing their U.K. operations.\nBrexit: the negotiations.\nThe EU negotiating position\nThe EU negotiating positions will be determined by two factors:\n- The need to replace the £11 billion net contribution from the British taxpayer to the EU every year.\n- Prevention of contagion i.e. other member states leaving the EU.\nMany Brexiteers argue that the interests of EU, chiefly German, exporters will also be very important to the EU negotiating position. Brexiters have argued, correctly, that WTO tariffs will hit disproportionately the EU (especially German exporters). This because The EU has a massive £89 billion goods surplus with Britain (tariffs are not levied on services). Also the recent devaluation of Sterling against the Euro means that British exporters will receive more pounds for exports priced in Euros even if tariffs are levied.\nSo is the EU case for a free trade agreement with Britain done and dusted? What else is at stake for the EU, and most particularly Germany?\nGermany and China are the world’s biggest exporters, and both countries owe a large part of this success to currency manipulation. In the case of China, which is a brutal communist dictatorship, the ressources of the state have been corralled into buying vast quantities of US government securities, thereby holding down their country’s exchange rate against the US dollar. Germany has a similar policy: it is called the Euro. Before the Euro Germany could not disguise or offsets her huge trade surpluses and consequently the Mark rose over time against other currencies, and acted as a brake on German export growth. By joining the Euro Germany is able to hide her strong export and balance of trade performance behind the less impressive performances of the rest of the Eurozone. The Euro has taken off the brake on German exports by allowing German exporters to trade in a currency that is much weaker than the old Deutsch Mark and consequently Germany can price her exports much more competively than she otherwise could.\nIn a nutshell Germany’s interest is the continuation and survival of the EU and its currency, the Euro. If the EU folds and the Eurozone goes back to national national currencies, then Germany will be faced with an immediate and massive appreciation of her trading currency, which will reflect the undiluted strength of the German economy. To get an idea of the appreciation, consider the appreciation of the Swiss Franc against the Euro since the Euro’s introduction in 1999. In 1999 a Swiss Franc was worth 0.63 Euros, today it is worth 0,93 Euros i.e. a 50 percent appreciation. Switzerland and Germany resemble each other in being high savings high export countries, racking up huge trade surpluses year after year. So in the event of the Deutsch Mark being resurrected, an appreciation of this scale (50%) is to be expected. Former holders of Euros would be desperate to convert their holdings into Marks. The underperformance of the rest of the Eurozone relative to Germany (and indeed Britain!) is underlined by the following 2011 data from the European Commission. The top three EU exporters of cars to outside the EU in 2011 were:\n- Germany: €56.3 billion\n- Britain: €12.6 billion\n- Belgium: €4.4 billion\nFrance and Italy don’t even make the list. Germany’s exports are in a different league from her neighbors. The above German exports to outside EU in just one category – cars – equate to two thirds of total German goods exports to Britain in a single year (£62 billion). Total German exports are running at £1100 billion a year. So, whilst WTO tariffs would be a real cost to the German economy (around £2 billion a year), it is likely that Germany would prefer this outcome to an unraveling of the EU that would force German exporters back to the Deutsch Mark and a crippling 50% appreciation that would put all of Germany’s £1100 billion a year exports at risk.\nAll of the above is a long way of saying that Germany has a massive economic interest in protecting the integrity of the EU, so that its exporters can carry on exporting in Euros instead of Deutsch Marks. This interest massively outweighs any tariffs Germany might have to pay to Britain under WTO rules, in the ratio of 1100:2 = 550:1!\nBrexit, for the EU, is above all an absolutely massive loss of prestige. Whatever member states are saying publicly, every EU member state is re-evaluating its own membership of the EU club, which has suddenly been devalued by an order of magnitude. The deputy president of the EU Commission Frans Timmerman has said that he can now envisage the failure of the EU project, in the light of the Brexit vote. Let us suppose that EU and Britain make a Free Trade Agreement, what would be the immediate political impact? Look at things from the point of view of Denmark, Sweden and the Netherlands. Your protector in the EU, Britain, has gone. Your net contributions to the EU are rising, because the EU Commission now has a £11 billion a year black hole in its finances to fill. Your country is being overwhelmed by massive immigration forced on you by the EU. Meanwhile your erstwhile protector, Britain, has left the EU mess behind, is no longer paying into the EU and is not subject to EU rules or EU immigration. Moreover, thanks to a free trade agreement, British exporters enjoy tariff free access to the internal EU market. Wouldn’t the natural reaction of sensible and rational Swedes, Danes and Dutchmen be, well, let’s do the same as our British friends? Let’s trade freely with the EU but stop being dominated by the EU and stop subsidising it.\nThe huge danger for the EU project is that other countries, particularly the “sorted” countries such as Sweden, Denmark and the Netherlands do the same as Britain. Agreeing a free trade deal with Britain, whilst benefiting EU exporters, carries the risk of encouraging the likes of Sweden, Denmark and the Netherlands to leave as well. If these countries left the EU as well then what chance the EU? If the EU fails then so does the Euro, with huge implications for the German export machine.\nIn conclusion, despite the £89 billion a year goods surplus the EU has with Britain, the EU is unlikely to agree to a Free Trade Agreement. This is because such an agreement would encourage other EU member states, particularly those in good economic health, to leave. So whilst WTO tariffs would cost German exporters around £2 billion a year, this cost could well viewed as minor compared with safeguarding £1100 billion a year of total German exports.\nAnother factor weighing against a Free Trade Area is the loss of Britain’s £11 billion a year net contribution. This represents 10% of the whole EU budget – so is very serious for the EU institutions. At this point it is important to remember that EU members pay all tariff receipts on imports from outside the EU straight to the EU institutions. So if Britain does not conclude a FTA with the EU, the EU institutions will receive the tariffs levied on British goods exports to the EU. This would be around £ 5 billion a year. This would go along way to filling the £11 billion black hole in the EU budget caused by Brexit.\nThe British negotiating position\nThe British position is dominated by the need to actually leave the EU and not be inveigled into accepting an agreement that would be EU-lite membership. The British people have spoken and their wishes must be accepted.\nThe Prime Minister’s recent statement (17th January 2017) that Britain will be leaving the EU “Single Market” (in reality EU internal market), provides welcome clarity that the British People’s decision to leave the EU in full.\nBritain’s national interest is to reduce the crippling £89 billion deficit we have with the EU on goods. This interest would be served by trading with the EU on WTO rules. This is because the recent fall in Sterling would shield British exporters from EU tariffs while accentuating the effect of British tariffs on EU exporters to the United Kingdom. So the effect of WTO tariffs would be asymmetrical: neutral for British exporters but very hard for EU exporters. It is reasonable to expect then an improvement in our awful trade balance with the EU.\nIt is worth putting some numbers to the above:\n1) 3.6% is the average WTO tariff on goods imports to EU. So this number is a good guide to the average tariff British exporters would face. It is miles away from the 20% depreciation of Sterling. So on average British exporters will have a very large exchange rate cushion from EU tariffs.\n2) The 3.6% number is a trade-weighted average of many different tariffs: some goods already attract no tariffs whereas others, notably cars and agricultural still face significant tariffs of 10% and 22% respectively.\n3) For cars the 10% tariff would still be well below the 20% depreciation, so British car exporters are still in the clear.\n4) For agricultural exporters the tariffs would be slightly higher than the depreciation: so exporters would lose out without government support – see below.\nUnder WTO rules the British government would receive a £8 billion windfall of tariff receipts on the £221 billion of EU goods imports, assuming the 3.6% average tariff. It is proposed that this money be ringfenced and used to support British exporters in general and in particular car and agricultural exporters.\nThe WTO does not restrict support given to agricultural exporters, so the government would enjoy considerable latitude to support exporters of agricultural products. For non-agricultural goods WTO rules are much stricter: you cannot subsidise exports, by paying the tariffs on exported cars for example. But the WTO does allow governments to provide sectorial support. Thus the government could give British car manufacturers very large tax breaks for example. Companies making cars or components could be exempt from paying employers national insurance contributions and/or local businesses rates. Such measures would be entirely compatible with WTO rules and be guaranteed to inject money into the car makers.\nIn summary, then, WTO rules would actually work very well for Britain. In this scenario it would be important for the government to do all it can to make sure Sterling continues to “feel” the awful trade and current account deficits and remain weak against the Euro. Limits on hot money flows into Britain should be applied and large scale purchases of assets by foreign investors should be discouraged.\nTariffs, even when mediated by the WTO, are ultimately regressive. The government is right to promote free trade, whether with EU or other trading jurisdictions. So in the negotiations with EU the British government should offer a free trade agreement. Even if we leave on WTO rules, the tariffs will probably disappear anyway in 20 or 30 years time as a result of future WTO agreements concluded across the World. The British position is actually very strong:\nWe leave and trade with EU through a new free trade agreement. So we regain our sovereignty, stop subsidies to EU and control our borders.\nWe leave and trade with EU on WTO rules. We still regain our sovereignty, stop subsidies to EU and control our borders. British exporters are supported by the exchange rate and by recycling massive EU tariff receipts to British exporting industries such as car making.\nEither way we win. The British government should not offer any concessions and stick to the Prime Minister’s pledge to walk away from a lousy deal.\nThe most determining factor in the negotiations with the EU will be money. Britain’s net contribution of £11.4 billion per year to the EU budget means that when we leave, the EU budget, currently running at around £110 billion a year, will face an immediate black hole of 10%. This will be the main focus of the EU institutions: how to claw money out of Britain even though we will have left, in order to back-fill the gaping hole in their budget. This is why there will only be two possible outcomes to the negotiations:\n- Britain continues to pay into the EU budget, in return for tariff-free trade with the EU. This will be dressed-up as “access” to the “single market”. In reality it will be an effective continuation of EU membership, with the continuing requirement to accept free movement of EU citizens into the U.K; or\n- WTO rules i.e. a complete break.\nIndeed this is what the EU Council President Donald Tusk has said recently: Brexit can only be “hard” – or not be Brexit at all. He is right.\nMany Brexit supporters will be surprised that the EU would ever contemplate WTO rules – after all EU goods exports to Britain are approaching double our goods exports to the EU. So surely under WTO rules “EU PLC” would pay nearly double what “UK PLC” would. How could the EU institutions see any advantage in such an arrangement? At this point it is important to remember that:\n- The EU institutions are not “EU PLC”.\n- Tariffs on imports into the EU go straight to the EU institutions, regardless of other cash transfers between the institutions and member states.\n- The EU institutions will not be paying any tariffs to the Britain – it will be individual EU exporting companies such as Volkswagen and Peugeot that will pick up the tab.\nSo under WTO rules EU exporters will get hammered whilst the EU institutions will receive a new income flow: the tariffs payable on every single British goods export to the EU. At current tariffs of 3.6% and £134 billion a year, this tariffs income will be £4.8 billion a year or 42% of Britain’s yearly contribution to the EU budget as a full EU member.\nAt this juncture it is important to remember the collapse of the EU – US trade talks, and the impending implosion of the Canada – EU deal. If these two free trade agreements had gone ahead then the EU institutions would have lost the tariffs on imports from these countries. Now US goods exports to EU are around 5% higher than UK exports, so the corresponding tariffs payable will be 5% higher too – £5 billion a year. The combined tariffs incomes from US and UK exports to EU will be £4.8 billion + £ 5.0 billion = £ 9.8 billion. This number is close to Britain’s yearly net contribution of £11.4 billion to the EU budget, without even considering tariffs on Canadian imports.",
  "https_brexitinformation_com_/https_brexitinformation_com_page_2/content_8.html": "Data Section\nThe office for National Statistics (ONS) 2018 Pink Book for the British Balance of Payments in 2017 is here: UK … Continue reading Data Section\nThe office for National Statistics (ONS) 2018 Pink Book for the British Balance of Payments in 2017 is here: UK … Continue reading Data Section\nIf you really want to know what the EU is then you must read the EU Treaties – both of … Continue reading The EU Treaties\nBritish Project rev D The above report describes how a vote for Brexit (Leave EU) will give our Country new … Continue reading The British Project\nFollowing the clear instruction delivered by the British People through the June 23rd 2016 Referendum, this Blog is about promoting … Continue reading Securing our Country’s future: Making a Clean Brexit Happen",
  "https_brexitinformation_com_/https_brexitinformation_com_2016_05_17_first-blog-post/content_4.html": "Following the clear instruction delivered by the British People through the June 23rd 2016 Referendum, this Blog is about promoting the ideas and information to persuade British People to support a Clean Brexit.\nFollowing the clear instruction delivered by the British People through the June 23rd 2016 Referendum, this Blog is about promoting the ideas and information to persuade British People to support a Clean Brexit.",
  "https_brexitinformation_com_/https_brexitinformation_com_2018_12_26_brexit-papers/content_13.html": "Technomica has published a paper on the three options for Brexit: May’s Withdrawal Agreement, a Canada-style Free Trade Agreement and Clean Break – Brexit on WTO rules.\nThe paper can be downloaded here: TechnomicaPaper13 (1)\nTechnomica has published a paper on the three options for Brexit: May’s Withdrawal Agreement, a Canada-style Free Trade Agreement and Clean Break – Brexit on WTO rules.\nThe paper can be downloaded here: TechnomicaPaper13 (1)",
  "https_brexitinformation_com_/https_brexitinformation_com_2019_12_04_why-i-believe-boris-deal-delivers-brexit/content_6.html": "In my last post in May of this year I explained why I left the Conservative Party and joined the Brexit Party, having taken the view that the Conservative Party was on course to fail to deliver Brexit.\nI subsequently applied to the Brexit Party to become a parliamentary candidate, and having submitted a CV and attended an interview, I was appointed by the Brexit Party in August as their candidate for the Lichfield Constituency where I live.\nOn Friday 18th October I resigned from the Brexit Party and announced on Twitter my support for the Conservative Government, and in particular the new Withdrawal Agreement negotiated by Prime Minister Johnson. It is my considered view that the Johnson deal does indeed fully deliver an exit from the EU and is therefore a legitimate deal that all Brexiteers should get behind and support.\nIn the following paragraphs I will examine the Withdrawal Agreement and thereby justify my view that this agreement is indeed a genuine Brexit.\nThe Johnson deal with EU\nAs, with May’s deal, now defunct, Johnson’s deal has two parts:\n- Withdrawal Agreement\n- Political Declaration\nThe Withdrawal Agreement (WA), if passed, will become an international treaty between the United Kingdom and the EU. The WA would create a transition phase, from the date of coming into force of the WA, to 31st December 2020. During this time the UK and EU would negotiate a free trade agreement. The Political Declaration, in contrast, is a statement of intent, pertaining to the aforesaid negotiations. So whereas the provisions of the WA are binding on both parties, the Political Declaration is not binding. The WA is therefore much more important, and will be considered first.\nWithdrawal Agreement.\nThe Withdrawal Agreement is perhaps most significant in what it does not say. There is no Irish backstop. There is no mention of the United Kingdom remaining in any sort of customs union with the EU or of remaining in the EU’s internal market (i.e. what is colloquially known as the “Single Market”). Indeed repeatedly the Withdrawal Agreement distinguishes between UK and EU customs territory and the UK and EU internal markets. There is a partial exception – Northern Ireland, where there will be continuing regulatory alignment to some aspects of the EU internal market. But Northern Ireland is formally recognized as being part of the UK customs territory, and in five years’ time, a simple majority vote in Stormont can ditch the alignment provisions of the Withdrawal Agreement. Moreover Northern Ireland will participate fully in all UK free trade agreements with third countries.\nThe WA breaks down into the following:\n- Part One: Common Provisions (articles 1 to 8).\n- Part Two: Citizens’ Rights (articles 9 to 39).\n- Part Three: Separation Provisions (articles 40 to 125)\n- Part Four: Transition (articles 126 to 132)\n- Part Five: Financial Provisions (articles 133 to 157)\n- Part Six: Institutional and Final Provisions (articles 158 to 185)\n- Protocol on Ireland / Northern Ireland (articles 1 to 19, annexes 1 to 7)\n- Protocol relating to the Sovereign Base Areas of the United Kingdom of Great Britain and Northern Ireland in Cyprus (articles 1 to 13)\n- Protocol on Gibraltar (articles 1 to 6)\n- Annex I: Social Security Coordination\n- Annex II: Provisions of Union Law referred to in article 41(4)\n- Annex III: Time Limits for the Situations or Customs Procedures referred to in article 49(1)\n- Annex IV: List of Networks, Information Systems and Databases referred to articles 50, 53, 99 and 100\n- Annex V: Euratom\n- Annex VI: List of Administrative Co-operation Procedures referred to in article 98\n- Annex VII: List of Acts/Provisions referred to in article 128(6)\n- Annex VIII: Rules of Procedure of the Joint Committee and Specialized Committees\n- Annex XI: Rules of Procedure\nPart One: Common Provisions.\nThe only noteworthy provision is that the UK must have “due regard” for to relevant ECJ case law after the transition period (article 4 paragraph 5). This relates to the close-out of continuing EU programs that will remain under EU law until their completion. See article 138 under Part Five – Financial Provisions.\nPart Two: Citizens Rights\nThe main provision is that EU citizens who are not resident in the UK shall not receive social security payments (article 23 paragraph 2).\nPart Three: Separation Provisions\nNo notable provisions. This part of the Withdrawal Agreement is concerned with administrative provisions. An example is article 41, on the continuing circulation of goods placed on the market before the end of the transition period. Notably the article distinguishes clearly between the EU and UK markets.\nPart Four: Transition\nArticle 126 states that the transition period ends on 31st December 2020 if it is not extended. Article 132 states that this transition period can only be extended once, for up to two years, with the decision to extend taken by 1st July 2020 at the latest. Prime Minister Johnson has publicly committed not to extending the transition period.\nArticle 127 states that, with exceptions, EU law will continue to apply in the UK during the transition period. Nevertheless the UK will be exempt from the following EU programs and policy areas during the transition:\n- Schengen and the EU charter of Human Rights do not apply to the UK (article 127 paragraph 1)\n- The UK will not participate in EU “enhanced co-operation” (article 127 paragraph 4)\n- The UK is no longer bound by articles 42 and 46 of the Treaty of the EU, which set-up the EU’s Common Security and Defence Policy (article 127 paragraph 7).\n- The UK shall not be a “framework nation” in EU battlegroups (article 129 paragraph 7).\nFinally the UK can negotiate new international agreements outside of the EU provided they do not come into force before the end of the transition period (article 129 paragraph 4).\nPart Five: Financial Provisions\nThe key provisions are:\n- The UK is liable for its share of EU budgetary commitments as of the end of the transition, with some exceptions (article 140 paragraph 1).\n- The UK is liable for its share of EU liabilities as of the end of the transition, with some exceptions (article 142 paragraph 1).\n- The UK is liable for its share of the operations of the European Investment Bank at the end of the transition (article 150 paragraph 1).\n- The UK remains in the 11th European Development Fund round, until its closure (article 152 paragraph 1).\n- The UK will make no contributions for EU spending decided after the date of coming into force of the Withdrawal Agreement (article 135 paragraph 2).\n- The EU is liable to the UK for the UK’s share of the assets of the European Coal and Steel Community at the end of the transition (article 145).\nEU law will continue to apply to the financing of EU MFF programs for the period 2014 – 2020 (article 138 paragraph 1). This is what article 4 (Part One: Common Provisions) is referring to where it says that the UK must have due regard to relevant ECJ case law after the end of the transition.\nThe above provisions are used to calculate the UK’s financial settlement for leaving the EU, currently understood to be around £33 billion.\nPart Six: Institutional and Final Provisions\nArticle 159 creates an authority to oversee the provisions of Part Two of the Withdrawal Agreement in respect of EU citizens in the UK. The authority is empowered to bring legal action in UK courts in respect of alleged breaches of Part Two.\nArticle 164 establishes a Joint Committee, co-shared by the UK and EU, to oversee the Withdrawal Agreement as a whole.\nArticles 170 to 173 establish a dispute resolution mechanism based on an arbitration panel, with equal numbers of UK and EU panel members. In the event of the panel not reaching agreement, disputes are taken before the International Court of Arbitration in The Hague in the Netherlands for a final decision.\nProtocol on Ireland / Northern Ireland\nThe introduction to the Protocol states “Nothing in this Protocol prevents the United Kingdom from ensuring unfettered market access for goods from Northern Ireland to the rest of United Kingdom internal market”.\nNorthern Ireland is part of the Customs Territory of the United Kingdom, and Northern Ireland will participate fully in any Free Trade Agreements negotiated by the United Kingdom with third countries (article 4).\nGoods moved from Great Britain to Northern Ireland shall not be subject to customs checks unless the goods are ”at risk” of being re-exported to the EU either by itself or processed into another product (article 5). The Joint Committee shall define the applicable criteria before the end of the transition period.\nArticles 5 to 10 of this Protocol are subject to democratic consent in Stormont based on a simple majority in the assembly. Thus the Assembly will be able to remove articles 5 to 10 of the Protocol by a simple majority. This mechanism is created by article 18 of the Protocol. The first opportunity for a vote will be 4 years after the end of the transition.\nProtocol relating to the Sovereign Base Areas of the United Kingdom of Great Britain and Northern Ireland in Cyprus\nThe Sovereign Base Areas remain part of the EU customs territory (article 2 paragraph 1). Paragraph 6 of article 2 says that goods intended for military purposes can go through a port/airport under the control of the Sovereign Base Areas.\nProtocol on Gibraltar\nThe Introduction to the Protocol recalls that the law of EU ceases to apply to the UK and Gibraltar from the date of entry into force of the Withdrawal Agreement.\nFinal remarks.\nIn the above I have sought to pull out what I consider to be the notable provisions of the Withdrawal Agreement, which runs to 541 pages. It is not possible to comment on every article in the Withdrawal Agreement, unless one is writing a book instead of a blog. It is now apposite to look at the Political Declaration.\nPolitical Declaration.\nThis document is not a treaty and is therefore non-binding. However it does set the scene for the negotiations between the UK and the EU that will begin once the UK leaves the EU in a few weeks’ time (if Johnson wins the election). The declaration seeks to set an agenda for these negotiations.\nThe declaration states that at the core of the new relationship between the UK and the EU there should be a “comprehensive and balanced free trade agreement”. This is the most important statement made in the declaration, and arguably sums-up the whole 18 page document.\nThe declaration also states that the future relationship between the UK and the EU must, for the EU:\n- Ensure the autonomy of EU decision-making.\n- Be consistent with the integrity of the EU internal market and Customs Union.\nAnd for the UK the future agreement must:\n- Ensure the sovereignty of the United Kingdom.\n- Ensure the protection of the UK internal market.\n- Respect the outcome of the 2016 referendum.\n- Allow the UK to develop an independent trade policy.\n- End free movement of people between the EU and UK.\nThe Political Declaration does not commit the United Kingdom to regulatory alignment with the EU. Section II of Part II of the declaration specifically states that both Parties will preserve regulatory autonomy. Section XIV of Part II talks about a “level playing field for open and fair competition”. However section XIV does not define what a level playing field is or what constitutes fair or unfair competition. Section XIV consistently uses the conditional form “should” instead of the directive forms “shall” or “will” in respect of the Parties i.e. the EU and UK. In other words Section XIV is an exhortation to both Parties on what they should do and should not do i.e. operate “fairly” and not distort state aid to create “unfair” competition.\nThe Political Declaration does not commit the UK to giving access to UK waters to EU fishermen. Section XII of Part II does enjoin the two Parties to agree a new fisheries agreement whose scope would include access to waters and quotas, with the aim of getting an agreement made by 1st July 2020. However the Parties are under no formal commitment to reach an agreement and the shape of any such agreement is undefined. Section XII recognizes the UK as an independent costal state and again restates the regulatory autonomy of the Parties. Section XII enjoins the Parties to co-operate bilaterally and internationally to preserve fish stocks.\nThe Political Declaration recognizes the sovereignty of the United Kingdom and the autonomy of the EU. The UK foreign policy, defence and security policy will be independent of the EU’s, as in all other policy areas. The Political Declaration envisages co-operation in foreign, defence and security where the interests of the Parties coincide. To quote directly from Section III of Part III of the declaration: “The Parties will shape and pursue their foreign policies according to their respective strategic and security interests, and their respective legal orders. When and where these interests are shared, the Parties should cooperate closely at the bilateral level and within international organizations.”\nIn summary, the Political Declaration is an inoffensive document that recognizes the sovereignty and independence of both Parties, the United Kingdom and the European Union. The declaration envisages a future relationship built around a new free trade agreement and co-operation on matters where the interests of both Parties align.\nConcluding remarks.\nUnder the Withdrawal Agreement and the associated Political Declaration the United Kingdom leaves the EU fully, coming out of all of the EU institutions. The Parties agree to try an negotiate a free trade agreement during the transition period that ends next December. The EU involvement in the UK’s affairs is progressively unwound, with EU regulations still applying to those EU programs in the UK that are still running at the end of the transition. Northern Ireland continues to respect some EU regulations pertaining to the EU internal market, though this is subject to a simple majority vote in Stormont in five years’ time. The United Kingdom makes a payment to the EU of around £33 billion in respect of what is deemed the UK’s share of EU spending commitments and liabilities at the end of the transition.\nThe Withdrawal Agreement gives Brexiteers what we all want: Exit. The only downsides are the £33 billion payment and the position in Northern Ireland. However, if we stay in the EU then we will give them net at least £33 billion in less than three years, and if the DUP get a majority in Stormont then the EU internal market provisions for Northern Ireland can be ditched. Is the Withdrawal Agreement perfect in all aspects? No it is not. But it does get us out, and this is why I support it and the Johnson government.\nIt is important to understand that there is no other practical plan to deliver Brexit; the Brexit Party has no plan, no policies and no prospects of getting a single MP. The Labour Party and the Liberal Democrats have both committed to ditching the 2016 referendum. The Labour Party would introduce a new referendum with Remain and remaining in the EU internal market, customs union and free movement as the options i.e. no Brexit option at all. The Liberal Democrats would simply Remain in the EU, full stop.\nIf you want Brexit then vote Conservative on 12th December 2019.",
  "https_brexitinformation_com_/https_brexitinformation_com_2016_05_31_data-section/content_11.html": "The office for National Statistics (ONS) 2018 Pink Book for the British Balance of Payments in 2017 is here: UK Balance of Payments, The Pink Book 2018\nThe Office for National Statistics (ONS) 2016 Pink Book for the British Balance of Payments in 2015 is here: Pink Book 2016\nThe contrast between the huge trade deficit on EU trade and the trade surplus on non-EU trade is large.\nThe latest WTO report for tariffs between countries (including EU) is here: tariff_profiles15_e (1)\nSee page 77 of the WTO report on tariffs for the tariffs that apply to the EU. On a trade-weighted basis the average EU tariff is only 3.6% and falls to 2.3% when agricultural products are stripped out.",
  "https_brexitinformation_com_/https_brexitinformation_com_2020_04_30_unlocking-the-lockdown-2/content_5.html": "Summary\nThe coronavirus outbreak in the UK is modeled on the basis of rate of spread being proportional to the product of the number of uninfected people and the number of infectious people. The model is shown to accurately predict the deaths reported by PHE to-date, including the recent correction by PHE to include deaths outside of hospitals.\nThe model uses the 0.09% case mortality observed in Singapore for Coronavirus, which is comparable with the 0.1% mortality often cited for influenza. Accordingly the model finds that over 34 million people have already been infected in the UK and that around 55 million will have been infected at the end of the outbreak, forecast for November of this year. A total death toll of 49,300 is forecast for the UK, based on a gradual lifting of the lockdown from 11th May onwards.\nThe model finds that the British lockdown has saved at least 9,000 lives, even if it is assumed that the NHS would have coped without a lockdown i.e. unchanged mortality. The model also finds that the timing of the British lockdown was very important; if it had started 3 weeks earlier then it would have had virtually no effect on the outbreak. The 3 week extension of the lockdown is found not to have saved any lives.\nIntroduction.\nThis blog is an update on the blog I wrote a few weeks ago, entitled “Unlocking the Lockdown”. In the earlier blog I used a simple model of the infection to deduce the spread of the virus cases from the reported deaths. This approach relied on the assumption of a constant mortality and a known start date. It also imposed a continuous exponential phase, by assuming that the rate of spread at any moment in time was proportional to the number of cases at that same moment. This assumption yields an exponential curve, which is correct for the start of the epidemic but which becomes progressively less justified as more and more people become infected. Also, the earlier post did not consider the effect of the lockdown which began on the 23rd March.\nI have therefore updated my calculations by using a more complete model for the spread of the virus, wherein:\n- Rate of spread at any moment is proportional to the product of the number of uninfected people and the number of infectious people. The constant of proportionality, the “k” value, is the measure of the rate of spread of the virus. In the new model the k value was reduced by a factor of 2.75 for the period of the lockdown, to account for the reduction in contact between people imposed by the lockdown.\n- The number of infectious people is those people who were infected within a characteristic time of the moment in time in question i.e. people infected earlier are not counted in the population of infectious people.\n- The new model retains the concept of a constant mortality, and the number of deaths at a moment in time is the total number of infected cases a characteristic time before the moment, multiplied by the mortality.\n- The new model retains the known start date used in the earlier model, namely 14th January 2020.\nMethod and parameters selected.\nThe new model lends itself to a numerical solution of the differential equations, as opposed to the analytical solution used for the earlier simpler model. For the new model the approach taken was to fit parameters to the data-set up to the 3rd April 2020 i.e. the same data-set used previously. I found:\nConstant for rate of spread: k = (0.24567 / 67,000,000) per day per person\nMortality: x = 0.09%\nWhere the 67,000,000 is the total population.\nThe characteristic time for someone to be infectious was taken as 14 days from the moment of infection.\nThe characteristic time for someone to die from the virus was taken as 16 days from the moment of infection.\nNote that the mortality used is very low compared with the 1 to 2% numbers frequently cited for coronavirus. However 0.09% is the case mortality found today in Singapore, based on 15 deaths and 16,169 reported cases in that country. Singapore has done extensive testing, over 24,000 tests per million people. This is double the UK number.\nNote that the k value used above corresponds to 0.24567 per day at the start of the infection, when the number of uninfected people is more or less the whole population, and a first order model is appropriate. The k value used in the earlier model which was a first order model was 0.213 per day.\nResults.\nThe new model was used to simulate the following scenarios:\n- No lockdown.\n- The current lockdown from 23rd March till 10th May with a gradual lifting from 11th May onwards, spread over 8 weeks.\n- The current lockdown from 23rd March till 10th May with a sudden and complete lifting on 11th May.\n- A shortened lockdown from 23rd March till 19th April with a gradual lifting from 20th April onwards, spread over 8 weeks.\n- An earlier lockdown from 2nd March till 19th April with a gradual lifting from 20th April onwards, spread over 8 weeks.\nNo Lockdown.\nThe predicted curves of deaths, deaths per day and cases is shown in the following three graphs.\nThe model results (blue curves) show the characteristic “sombrero” for a constant value of k in the deaths per day graph. The red curves are the PHE data for deaths; the recent spike is due to the inclusion by PHE of deaths outside of hospitals in the data for 29th April onwards. The model shows that the infection would have spread over nearly the whole population by the end of April, yielding very high deaths per day. The total deaths would have been around 58,000 people if it is assumed that the 0.09% mortality would have applied. This in turn assumes that the NHS would not have been overwhelmed. It should be borne in mind that the mortality includes credit for medical care; if a medical care is reduced then mortality rises. I surmise that the assumption of an inflated mortality due the NHS being overwhelmed was behind the 250,000 deaths number predicted by Imperial College for the No Lockdown scenario.\nCurrent Lockdown 23rd March till 10th May with gradual lifting from 11th May onwards.\nThis scenario is what I think is going to happen. In the model, the 8 week gradual lifting is simulated by progressively increasing the k value from the low value used for the lockdown period (i.e. k = 0.08933 / 67,000,000 per day per person) to the non-lockdown value of k = 0.24567 / 67,000,000 per day per person.\nThe graph of total deaths shows that the model has correctly predicted the course of the lockdown so far, as it matches the most recent PHE data i.e. 26,000 or so deaths. The prediction is that the total deaths will almost double from today i.e. finish at around 49,300. This is a considerable improvement over the 58,000 deaths predicted for the No Lockdown case, where the 58,000 number assumes no increase in mortality despite very high infection rates. The results of this model, if true, show that the lockdown has saved lives. Note that the death rate does bump up slightly and then subsides. The end of the infection occurs in late November 2020.\nAs with the no-lockdown scenario and indeed the earlier model, this model predicts very wide infection across the population. By the end of April over 34 million people are predicted to already be infected. This goes against mainstream thinking, but as yet no-one has come up with a reliable way of determining whether people have had the infection.\nThe model predicted a spike on the 8th April which is not reflected in the PHE data. However at this time the PHE numbers only included hospital deaths. The ONS have reported very high deaths in early April, and this is reflected in the retrospective upwards adjustment in PHE’s data this week, producing an artificial spike in the data.\nCurrent Lockdown 23rd March till 10th May; Sudden lifting on 11th May.\nThis scenario is unlikely to happen. It was simulated by jacking up the k value from the lockdown value to the pre-lockdown value on 11th May.\nThese results show that a gradual lifting of the lockdown will save some lives, as the total deaths is around 51,000 for the sudden lifting versus 49,300 for the gradual lifting. The difference is not huge, but we are still talking about 1,700 human beings’ lives. The infection ends more quickly than for the case where the lockdown is lifted gradually.\nShorter Lockdown 23rd March till 19th April followed by gradual lifting over 8 weeks.\nThis is the optimal scenario, in my opinion: the sombrero is flattened and the lockdown is progressively lifted.\nThe model results show that the extra three weeks of the lockdown have brought no benefit: there is no reduction in the total number of deaths, as the number of deaths for the shorter lockdown is the same. The shorter lockdown is actually better in that the infection ends sooner as well.\nEarlier Lockdown 2nd March till 19th April followed by gradual lifting over 8 weeks.\nThis scenario is in effect the current lockdown shifted 3 weeks earlier. Many people were urging this course of action on the government; the model’s results may surprise some people…\nThe results show that the lockdown squashes the infection, during the lockdown. During the 6 week lockdown no herd immunity is acquired at all, so when the lockdown is lifted, even gradually, the infection just re-establishes itself and the final outcome resembles the no-lockdown scenario, but delayed two months into June. These results show that the government was right: timing is important. Some countries that went in for earlier lockdowns may well be in for a nasty surprise later this year.\nConclusions.\n- The new model shows that the 0.09% case mortality found in Singapore for coronavirus today applies to the United Kingdom as the overall mortality for the outbreak of coronavirus.\n- Accordingly, based on a gradual lifting of the British lockdown made from 11th May onwards, a forecast of 49,300 total deaths is made for coronavirus in the United Kingdom. This does not include collateral deaths due to reduced treatments for cancer and other conditions during the 6-week lockdown. This forecast does not take credit for measures taken to protect the elderly and infirm, such as increased surveillance in care-homes.\n- The model finds very widespread infection already present in the United Kingdom. Thus the number of infected people today, 30th April, is found to be over 34 million. At the end of the outbreak, forecast for November, over 55 million people will have been infected with coronavirus. Thus the herd immunity model for the infection is shown to be correct.\n- The model finds that the lockdown has saved many lives. Without the lockdown lives lost would be at least 9,000 higher even if it assumed that mortality would have been unaffected by the very intense outbreak that would have resulted without the lockdown.\n- Albeit that the lockdown was necessary for the first 3 weeks, its prolongation by a further 3 weeks is not found to have saved any lives.\n- A gradual lifting of the lockdown will save lives compared with a sudden lifting. A sudden lifting sees total deaths increased by 1,700.\n- The British government was correct in delaying the lockdown till the 23rd March. The model finds that the 6-week lockdown would have achieved nothing at all had it been imposed 3 weeks earlier, on 2nd March. The model finds that the effect of an earlier model would have been to delay the outbreak till June, but that the loss of life and intensity would have been the same as the no-lockdown scenario. So locking down too soon is a mistake.\nJames Bush\n30th April 2020."
}