{
  "http_www_ndca_org_uk_/http_www_ndca_org_uk_events/content_4.html": "Patrons' Club and Members' Drinks Party - Ticket Sales Closed 9th May 2025 6.00pm to 8.00pm St Giles House, Wimborne St Giles. Guest speaker the Rt Hon James Cleverly MP. By Kind Permission of Lord Shaftesbury Unfortunately ticket sales have closed.\nBlackmore Vale Lunch Club 12th May 2025 12.00 for 12.30pm The Crown Inn Marnhull. The speaker is Kim Voizey manager of the Vale Family Hub incorporating the Vale Pantry. To book your place email [email protected]\nLet's Talk Politics Over Dinner 5th June 2025 6.30pm The Royal Chase Hotel, Shaftesbury. Tickets £27.50.\nNDCA AGM 28th June 2025 10.00am NDCA AGM is on Saturday 28 June 2025 - Speakers Simon Hoare MP & Sherry Jespersen Chair NDCA. Location to be confirmed.",
  "http_www_ndca_org_uk_/http_www_ndca_org_uk_news_category_National-News/content_5.html": "The Conservative Party's final Party Election Broadcast 29th April 2025 Want the best for your town? Watch our most recent Party Election Broadcast where Kemi explains how important the Local Elections on the 1st May are National News\nConservative response to Labour's Emergency Budget 26th March 2025 Read Shadow Chancellor Mel Stride’s response to Labour’s Emergency Budget, explaining why we are in economic disarray National News\nKemi Launches our 2025 Local Elections Campaign 26th March 2025 At a speech in Buckinghamshire on March 20th Kemi Badenoch spoke about what's at stake in the local elections on May 1st National News\nKemi Launches the Policy Renewal Programme 18th March 2025 At a speech in London Kemi Badenoch launched the Policy Renewal Programme, the largest policy exercise in a generation National News\nKemi’s statement on Ukraine 3rd March 2025 Ukraine is fighting for the same freedom, democracy and sovereignty we enjoy in the UK – we must support them National News\nKemi’s speech on foreign policy 25th February 2025 Kemi's keynote speech on foreign policy National News\nKemi gives a speech at the Alliance for Responsible Citizenship Conference 18th February 2025 On Monday 17th February 2025 Kemi gave a speech outlining how important it is for the West to robustly defend its values National News\nRebuilding Trust with our new Immigration Policy 10th February 2025 Kemi’s new plan for immigration shows the Party is back in the service of the British people National News\nKemi’’s First Speech of 2025: Rebuilding Trust 27th January 2025 Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party National News",
  "http_www_ndca_org_uk_/http_www_ndca_org_uk_news_kemis-first-speech-2025-rebuilding-trust/content_8.html": "Tweet Monday, 27 January, 2025 National News Kemi Badenoch gave a speech on how she’ll rebuild trust in the Conservative Party\nConservative Councillors to call on Dorset Council to prioritise economic growth and support for local business. Thursday, 1 May, 2025 Councillor Simon Gibson, Dorset Council member for Verwood, will put a motion to the Full Council meeting of Dorset Council, on May 15th, calling for an Economic Emergency comparable to the Climate Emergency declared in 2019.",
  "http_www_ndca_org_uk_/http_www_ndca_org_uk/content_1.html": "Upcoming Events\nLocal News\nNational News\nFind us on Facebook\nJoin or Renew\nBy joining the Conservative Party, you're doing your bit to help change Britain.\nYour support is vital to our campaign to build a better future.\nDonate\nWith your help we're building a strong voice for local Conservatives.\nAny donation will make a difference.",
  "http_www_ndca_org_uk_/http_www_ndca_org_uk_privacy/content_3.html": "This document outlines how North Dorset Conservatives processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is North Dorset Conservatives\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact North Dorset Conservatives.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of North Dorset Conservatives, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact North Dorset Conservatives via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "http_www_ndca_org_uk_/http_www_ndca_org_uk_map-locations/content_2.html": "Our map\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.\nThis map illustrates the locations of news articles and forthcoming events on this website. Dark blue markers indicate news articles and light blue markers indicate events. Click on the markers to visit the relevant pages.",
  "http_www_ndca_org_uk_/http_www_ndca_org_uk_news_rt-hon-mel-stride-mp-guest-speaker-lunch-event/content_7.html": "The Rt Hon Mel Stride MP, Shadow Shadow Chancellor of the Exchequer was the guest speaker at our Spring Lunch attended by over 60 members and guests at Crane Valley Golf Club Verwood on Friday 7 March 2025.\nIn a lively Q&A session Mel answered questions on the economy, the Conservative record in government, the farm tax and future policy.",
  "http_www_ndca_org_uk_/http_www_ndca_org_uk_cdn-cgi_l_email-protection/content_9.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "http_www_ndca_org_uk_/http_www_ndca_org_uk_north-dorset-business-forum/content_6.html": "Simon Hoare MP\nThe North Dorset Business Forum allows business owners and directors the opportunity to meet with Simon Hoare MP, ministers and business leaders to discuss the issues effecting business in North Dorset. This ensures that Simon has a regular dialogue with the sector and allowing him to take up issues with government on their behalf.\nThe Forum meets 4 or 5 times a year over breakfast or lunch the speakers so far have been:\nRt.Hon. John Glen MP Chief Secretary to the Treasury and MP for Salisbury\nCllr Spencer Flower Leader of Dorset Council\nCecilia Bufton Chair of Dorset LEP\nThe membership of the Forum is restricted to ensure members have quality interactions with speakers and each other.\nShould you be interested in joining please email [email protected]"
}