{
  "https_www_timroca_org_/https_www_timroca_org_privacy-policy/content_2.html": "Tim Roca MP\nMember of Parliament for Macclesfield\nPrivacy Policy – Tim Roca MP\nAs the MP for Macclesfield, I and my constituency staff correspond with constituents to answer policy enquiries, take up casework, and respond to queries or concerns regarding local and national issues.\nThis document explains how I collect and use personal data arising from this correspondence, the legal basis for doing so, and explains your rights in relation to your personal data.\nAs the holder of that data – I, Tim Roca – am the Data Controller.\nI have a team of staff who also correspond with constituents on my behalf. To enable them to do this, my staff also have access to the relevant data and correspondence. Therefore, this policy will reference “we”, to include myself as MP and data controller, alongside my office staff.\nContact Details\nEmail: tim.roca.mp@parliament.uk\nPost: Tim Roca MP, House of Commons, London, SW1A 0AA\nData collection and use\nFor dealing with casework, policy enquiries, and any other enquiries about my work as MP for Macclesfield, we collect or use personal information.\nThis personal data may include, but is not limited to: names, contact details, address, email address and telephone number.\nFor the same reasons, we may also collect or use special category data.\nThis special category data may include, but is not limited to: racial or ethnic origin, political opinions, religious or philosophical beliefs, trade union membership, health information, sex life information and sexual orientation information.\nData is collected directly from, or on behalf of constituents.\nLawful Basis and Data Protection rights\nOur lawful basis for collecting or using personal information for dealing with casework, policy enquiries and any other enquiries about my work as MP for Macclesfield are:\n· Where we have your consent to do so (UK GDPR Article 6(1)(a))\n· Where we have a contract to do so (UK GDPR Article 6(1)(b))\n· Where we have a legal obligation to do so (UK GDPR Article 6(1)€\n· Where we need to process personal data to protect someone’s vital interests (UK GDPR Article 6(1)(d)\n· Where we need to for the purposes of our public task and parliamentary functions (UK GDPR Article 6(1)€\n· Where the processing is in our legitimate interests and not overridden by your rights (UK GDPR Article 6(1)(f)\nData Retention\nWe will only retain your personal information for as long as it is necessary to fulfil the purposes described when your personal data was originally collected. However, to provide the best service and representation for constituents, it may be necessary to revisit closed casework and policy enquiries.\nClosed policy enquiries will be securely and permanently deleted at the end of the parliamentary session in which they were made.\nWe may retain information about closed casework in order to be able to give you full support, should you contact us again for help.\nIf you wish to exercise your rights to erasure, you are welcome to do so. Please see the “Your Rights” Section for more information.\nWho we share information with\nWhen processing your correspondence, we will only share your information with a third-party organisation where it is necessary and reasonable to do so.\nThird-parties include, but are not limited to: government departments, local authorities, public bodies, health trusts, regulators, system providers (with appropriate agreements or contracts in place).\nWe will only share as much information as is necessary to take your enquiry forward.\nWe will never share or sell your personal data to other organisations for direct marketing purposes.\nData Security\nWe are committed to processing and retaining data within established technological and physical controls in a transparent manner, as well as promoting and safeguarding the information rights of data subjects.\nOur procedures ensure that technological and physical controls are in place that guarantee the privacy of data subjects, the security of data held on technological systems is processed according to an established lawful processing condition. Any such procedures will be reviewed as necessary and updated to ensure their effectiveness in line with advances in technology.\nCorrespondence from my office may provide links to other websites. We are not responsible for the content or privacy practices of these websites.\nYour Rights\nYou have the following rights in relation to your personal information:\n· Where we are relying on your consent to use your personal data, you can withdraw that consent at any time - “right to object”\n· You can request access to the personal data we hold about you at any time - “right to access”\n· You can ask us to update your personal data if it changes. In certain circumstances, you can request we erase the personal data we hold, or ask us to stop or restrict processing if you have an objection “right to rectification”\n· You can request deletion of the personal data we hold about you at any time - “right to erasure”\n· You can request we restrict processing of personal data we hold about you at any time - “right to restrict processing”\nYou can contact us about exercising your rights in respect of personal data, if you have questions about how personal data is used or if you would like to make a complaint, via the aforementioned contact details.\nIf you remain unhappy with how we’ve used your data after making a complaint with us, you can also complain to the ICO.\nThe ICO’s address:\n· Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, Cheshire, SK9 5AF.\n· Helpline Number: 0303 123 1113\n· Website: https://www.ico.org.uk/make-a-complaint\nLast Updated: 14 October 2024",
  "https_www_timroca_org_/https_www_timroca_org/content_1.html": "Tim Roca MP\nMember of Parliament for Macclesfield\n\"I am dedicated to delivering change for the people of Macclesfield and will ensure you get the representation you deserve. If I can help, please get in touch\".\nAs your Member of Parliament for Macclesfield, I am working hard every day to ensure that our community’s voice is heard and acted upon. I’m proud to represent Macclesfield, where my family has deep roots, with both my mum and grandmother having worked in our local NHS, and where I went to school in Poynton. This is a fantastic area with incredible people, but we have been taken for granted by the Conservatives for too long and suffered a great deal after 14 years of austerity.\nI am focussed on helping our community through the cost of living crisis and working with the new Labour Government to see investment in our public services. Work has already begun to tackle the climate emergency, but there is still much more to do. Our town centres need a strategy to bring partners and businesses together to improve the offer available to visitors and shoppers. NHS waiting times in Cheshire East are still too high and that is why Labour's NHS Recovery Plan has been introduced so that we can finally see patients put first. I am also passionate about fair funding for our local schools and will campaign hard for the resources our schools need.\nI have already begun the work to get Macclesfield the fair deal it deserves. Together, we can turn turn our community and country around and build a brighter future for everyone. I urge you to reach out if you have any casework, local issues, or concerns—be it about things like policing, public services, or anything else. I am here to serve and support you.\nTim Roca",
  "https_www_timroca_org_/https_www_timroca_org_newsletter/content_5.html": "top of page\nHome\nStatements\nContact\nNewsletter\nNotices\nMore\nUse tab to navigate through the menu items.\nTim Roca MP\nMember of Parliament for Macclesfield\nSubscribe to my monthly newsletter to keep up to date with my work as the Member of Parliament for Macclesfield.\nEnter your email here\nSign Up\nThanks for submitting!\nLatest Newsletter\nMarch Edition\nFebruary Edition\nJanuary 2025 and 2024 Roundup\nNovember Edition\nOctober Edition\nbottom of page",
  "https_www_timroca_org_/https_www_timroca_org_statements/content_4.html": "top of page\nHome\nStatements\nContact\nNewsletter\nNotices\nMore\nUse tab to navigate through the menu items.\nTim Roca MP\nMember of Parliament for Macclesfield\nStatements\nStatement on Grooming Gangs and the Children’s Wellbeing and Schools Bill\nbottom of page",
  "https_www_timroca_org_/https_www_timroca_org_contact/content_3.html": "top of page\nTim Roca MP\nMember of Parliament for Macclesfield\nContact\nI'd love to hear from you! Please email me at tim.roca.mp@parliament.uk including the following information:\n-\nFull name.\n-\nFull postal address.\n-\nContact telephone number.\n-\nReason of your email.\n-\nAny relevant reference numbers.\nThank you!\nFollow me on Social Media\nbottom of page"
}