{
  "https_www_chrislaw_scot/https_www_chrislaw_scot/content_1.html": "Dundee West MP Chris Law has backed the growing campaign for a Fashion Watchdog, following calls for support for the Transform Trade campaign by Scottish Soroptimists. Members of Soroptimist International met at Dundee’s Discovery Point on Saturday 3rd June to discuss issues around fast fashion and how communities can collectively transform the fashion trade to … Continue reading MP backs Fashion Watchdog campaign at Dundee Soroptimist conference\nDundee MP backs PCS civil service campaign\nDundee West MP Chris Law has backed PCS Trade Union workers in their ongoing dispute with the UK Government, following industrial action which saw thousands of civil servants on strike earlier this week. Civil servants, including those who work in Dundee for the Department of Work and Pensions and HM Revenue and Customs, are covered … Continue reading Dundee MP backs PCS civil service campaign\nChris Law MP signs Holocaust Educational Trust Book of Commitment\nThis week Chris Law MP signed the Holocaust Educational Trust’s Book of Commitment, in doing so pledging his commitment to Holocaust Memorial Day and honouring those who were murdered during the Holocaust as well as paying tribute to the extraordinary Holocaust survivors who work tirelessly to educate young people today. Holocaust Memorial Day falls on 27th … Continue reading Chris Law MP signs Holocaust Educational Trust Book of Commitment\nDundee MP welcomes funding despite national Brexit drop\nDundee West MP Chris Law has welcomed the success of a bid for funding towards a sustainable transport hub, amid warnings that the UK Government’s flagship Levelling Up Fund is failing to deliver upon promises to match lost investment which resulted from the UK’s exit from the European Union. The UK Government have announced that … Continue reading Dundee MP welcomes funding despite national Brexit drop\nSNP MP criticises UK failure to condemn Azerbaijan over Lachin corridor protests\nDundee West MP Chris Law has written to the UK Government to criticise its failure to join allies on the UN Security Council in condemning Azerbaijan, following protests on the country's Lachin corridor which have cut off 120,000 ethnic Armenians from food and medical supplies. Reports from the UN Security Council have suggested that the … Continue reading SNP MP criticises UK failure to condemn Azerbaijan over Lachin corridor protests"
}