{
  "https_www_jowhite_uk_/https_www_jowhite_uk_news_2025_01_410m-investment-for-fusion-energy-in-bassetlaw/content_3.html": "The Government has today announced a £410 million investment to develop cutting-edge fusion energy, which promises to be a safe, low carbon and sustainable part of the world’s energy supply with potential to help sustain net zero in the future.\nThe prototype fusion energy plant is set at the site of a former coal power plant, West Burton, here in Bassetlaw, and will revitalise a UK industrial heartland, supporting new, skilled jobs in former coal communities.\nThis new funding money will help the development of the skills needed for scientists, engineers, welders and programme managers to enter the industry, which will all help deliver on the mission for UK to become a clean energy superpower.\nBassetlaw’s rich history has been shaped by energy production. From the seven pits producing coal to the power stations lined up alongside the River Trent, our area has always been at the heart of power production for over hundred years and the announcement in 2022 that this history will continued with fusion energy production was widely welcomed.\nToday’s announcement by the Energy Secretary of a new £410m fusion energy fund to rapidly develop the technology and progress the site at West Burton in Bassetlaw. This is a game changer for our area, unlocking thousands of new, high-skilled jobs on our doorstep. Bassetlaw is leading the world on Fusion energy and Government is right behind this.\nI want to see our young people find routes into fusion, through the supply chains, the development of new technologies and the construction of the site. This is our best chance to change life outcomes for future generations in Bassetlaw, and I want local businesses to have the opportunities to shift their production techniques so that they become the key players as new supply chains are established.\nI am fighting to make sure that everyone in Bassetlaw feels the full benefit from the STEP fusion energy project, including road and rail infrastructure improvements that will come as we unlock the full potential of our area. Today’s announcement is a welcome step to delivering the jobs, growth and future energy that we need.",
  "https_www_jowhite_uk_/https_www_jowhite_uk_privacy-policy/content_5.html": "Privacy Policy\nI am the Member of Parliament (‘MP’) for the Bassetlaw Constituency. As your MP, it is important that I and my office can keep in touch with constituents about my work, take up casework on their behalf and ask for views on local issues.\nAs a Labour Party MP I also have access to other information which I or my office, or volunteers working with me, will use for campaigning purposes or for communicating with Labour Party members. In respect of that information, the Labour Party is the data controller, and you should consult their privacy policy for details of what information they hold, why, and how they use and process that information. (https://labour.org.uk/privacy/)\nThis page explains how I collect and use personal data, the legal basis for doing so and provides information about your rights in respect of your personal data for which I am the data controller.\nMy Data Protection Officer can be contacted at [email protected]\nData collection and use\nThe office of Jo White MP will only collect and use personal information for the specific purpose for which it has been obtained.\nI will undertake casework using personal information provided by or on behalf of a constituent. It may be necessary for me to share your information with third party organisations. I will only do this where it is necessary and reasonable to do so, and I will share only the minimum amount of personal information necessary in order to advocate on your behalf. Please see the “who I share your information with” section for further details.\nWhen registering with this website or by completing a form or survey sent to you by my office, you may be asked for personal information. In each case, I will ask for your explicit consent to use your information, and I will only use it for the purposes for which you provide it.\nI may communicate by post, email, phone or text message about my work and to give you the latest news on my campaigns and opportunities to get involved. I have a legal entitlement to the full electoral register for my constituency, which includes the full name and address of every registered elector and I may write to you in connection with my activities as an MP.\nI will only send emails, texts or contact you by telephone where you have provided explicit consent for me to do so. You may withdraw your consent or unsubscribe at any time from communications in any medium by contacting our Data Protection Officer or by using the unsubscribe option I provide in all communications.\nI will not use personal data for any automated decision making or profiling.\nWho I share your information with\nWhen I take up casework on your behalf, it may be necessary for me to share the details you provide with government departments, local authorities and other public bodies. I will only share as much information as is necessary to take your case forward. If you have any questions or concerns about how information you provide as part of a casework request is used, please contact my Data Protection Officer for more information.\nOther than in the circumstances above, I will not share personal information with other organisations without your explicit consent.\nIn order to communicate with you about my work as the MP for Bassetlaw, it may be necessary for me to transfer personal information to countries or jurisdictions outside the EU. In each case, I will take steps to ensure that the suppliers I use comply with the General Data Protection Regulation or are subject to the Privacy Shield scheme agreed between the European Union and the United States.\nRetention of personal data\nI will only keep your personal information for as long as it is necessary to fulfil the purposes described in this policy. Information relating to casework will only be retained for as long as it is necessary to resolve or otherwise complete your request, although I may retain a minimum amount of information about closed cases in the event that you contact me again for help.\nIf you have consented to receive information about my work, I will only retain your personal information so long as I am the MP for Bassetlaw, or you ask not to be contacted further.\nI will regularly review the personal information I hold to ensure that its use is necessary and proportionate.\nIP Addresses and Cookies\nThis site does not automatically capture or store personal information, other than logging the user’s IP Address or the location of your computer or network on the Internet, for systems administration and troubleshooting purposes. I also use IP addresses in the aggregate to track which pages people visit in order to improve the quality of the site.\nA cookie is a tiny text file that is stored on your computer. Cookies may be used in order to tailor your experience on this site according to the preferences you have specified. Cookies on this website do not contain personally identifiable information, other than your IP address, which itself is only very rarely enough to identify you as an individual.\nLinks to other websites\nThis website may contain links to other websites. I am not responsible for the content or privacy practices of these websites.\nYour rights\nYou have a number of rights in relation to your personal information and the opportunity to choose how it is used. You can:\n- Obtain copies of the personal information I hold about you (known as a “subject access request”)\n- Request that I correct or update any personal information held about you\n- Ask that we erase or restrict the way in which I use your information\n- Request that personal information you have given your consent for me to use is provided in an electronic format so it can be transferred to another data controller (also known as “data portability”)\nYou may opt out of receiving further communications form me in any medium at any time. All requests to unsubscribe are dealt with promptly, and in all cases within a week.\nIf you wish to exercise your rights in respect of your personal data or have any concerns about how your data is used, please contact my Data Protection Officer:\nOffice of Jo White MP\nNew Street\nRetford\nDN22 6EG\nEmail: [email protected]\nAugust 2024",
  "https_www_jowhite_uk_/https_www_jowhite_uk_news_2024_12_worksop-guardian-column-18-12-24/content_8.html": "This week, I raised with the Prime Minister the issue of a man in Worksop whose son’s arm was badly broken when he was knocked off his bicycle by an off-road biker speeding on the pavement. The biker was dressed in black, with no number plate and was totally unidentifiable.\nThe young boy no longer goes out to play, and this experience isn’t unique. I am taking up this issue in Parliament and I am calling for action to smash the bikes and put police back on our streets. If this is an issue that has affected you, please contact my office by email [email protected] or by telephone 01909 212171.\nWhen I stood for election as your MP, one of my main priorities was to get Doncaster Airport reopened. I have made it my mission to do my bit to get our much-loved local airport re-opened. I have been working with other local MPs and I have met with the Mayor of South Yorkshire, Oliver Coppard, to ensure Bassetlaw’s voice is heard loud and clear.\nThis month, 2Excel, a logistics company that has continued to base itself at the airport, landed the first plane since the airport’s closure in 2022. This is fantastic news for the future of the airport, and I was delighted to be there.\nThank you to the many thousands of Bassetlaw residents who signed my petition over the last few years. Your support really made a difference.\nIn Parliament, I am calling for all MPs and members of the House of Lords to automatically have DBS (criminal record) checks. MPs often visit care homes and local schools, and any other job would require a full and clean criminal record check. I want to see MPs held to the very highest standards.\nHere in Bassetlaw, I was pleased to welcome Kerry McCarthy MP, the Minister for Climate, to Bassetlaw to open the new Fusion Café in Worksop.\nI would like to take this opportunity to wish you a very Merry Christmas full of love, peace and happiness, and a Happy New Year.",
  "https_www_jowhite_uk_/https_www_jowhite_uk_news_2025_01_jo-white-backs-sarah-champions-five-point-plan/content_6.html": "The previous Bassetlaw Member of Parliament for Bassetlaw, John Mann alongside Sarah Champion, were the two MPs who stepped up and gave evidence to the Professor Jay Inquiry. They spoke up for their constituents and I am duty bound to continue to be the voice of victims and survivors in Bassetlaw.\nUnlike the vast majority of politicians, I sat and listened to victims of child sex abuse. It is gut-wrenching, horrible, beyond anything and for them to have the bravery to speak, including to people like me is awe-inspiring.\nAnyone who thinks this isn’t a problem, including here in Bassetlaw, is hiding from the truth. I am disgusted at those who have sat on their hands, shut their mouths and done nothing. From our streets, through villages, towns and into cities, evil men have abused children. Every single one must be hunted down and jailed and we must stop this from ever happening again. Not all children survive, not all have come forward and some are incapable of saying anything.\nIn our area, some who came forward hadn’t even told their loved ones, parents, husbands, or their own children. Only two MPs attended and participated in the five-year inquiry into child abuse; Sarah Champion from Rotherham and my husband John Mann when he was our MP. Sarah spoke on behalf of the young girls and boys who had been groomed by the rape gangs of Rotherham and elsewhere. Crimes committed by groups of men of Pakistani origin. She is right, we cannot turn our back on anyone.\nIf you want to know how bad it has been in our area, I invite you to speak to John. He has more scars on his back from his time in Westminster, fighting for justice than anyone. He is still helping me to assist our people.\nThe idea that victims in our area should not have priority in government is obscene and dangerous. That inquiry lasted five years with John putting in hundreds of days fighting for justice and to eradicate child abuse, and so will I. I will not be told by MPs who did and said nothing until the last few weeks what needs to be done.\nThe children who survived are now adults. In our area, they tell me that they want us to get on and implement the inquiry recommendations. 20 were published in 2022, and none have been implemented. Last week, I voted to put the first three into law, but I can assure you I am already screaming and shouting, persuading and fighting for the other 17 to be actioned.\nWhere there is evidence of grooming gang activity, action must be taken, no ifs or buts. In local areas, this may have to be an inquiry, backed by the government with local authorities and the police being called to account and required to implement immediate action. We have to make our cities, towns and communities safe for our children and young people.\nI launched my own campaign in November in Parliament on recommendations number 9 and 10 about police checks and I am at war with the powers that be on this issue. I will not be backing down.\nI am backing Sarah Champion’s Five Point Plan for addressing Child Sexual Exploitation and Abuse.",
  "https_www_jowhite_uk_/https_www_jowhite_uk_news_2025_02_worksop-guardian-column-05-02-25/content_10.html": "Here in Bassetlaw, most people work hard all their lives, pay their dues and want to live comfortably. What unites many in anger is the known benefit fraudster, who lives down the street.\nWith billions of public money lost last year, it is time at long last for real action against the fraudsters. Those who are milking the system, be it the workshy or those feeding the coffers of organised crime. I have lost count of the number of times that I hear from local people that benefit fraud is happening and nothing seems to be being done about it.\nI welcome the government’s new Fraud Bill, which will allow for the seizure of luxury goods, bags of cash, and mobile phones as evidence of fraud, and stronger powers to go after those who receive money they are not entitled to. Where there is an outright refusal to repay, it is right that their driving license should be taken away.\nBanks and building societies will be able to flag when they spot fraud, such as expensive holidays aboard, or a wage going in whilst benefits are also being claimed. These powers will include strong safeguards, protecting the real vulnerable and the sick.\nI cannot abide the thought of the hard-earned money of Bassetlaw people funding the luxury lifestyle of the fraudsters. Labour is the party of working people, and this is our values being put into action. I want to see the first raid take place in Bassetlaw.\nThis is also why I back the additional powers in this Bill that will pursue those who ripped us off during Covid pandemic, including the previous government’s greedy friends who grabbed the PPE contracts and the fake company owners who took the business loans. We cannot allow time limitations to act as a barrier. We want our money back, the thieves jailed and anyone who lined the pockets of their mates also feeling the long hand of the law on their collars.",
  "https_www_jowhite_uk_/https_www_jowhite_uk_contact/content_7.html": "As your local MP, I am here to help. You can contact me using the form below or you can email me: [email protected]",
  "https_www_jowhite_uk_/https_www_jowhite_uk_news_2024_11_fur-free-britain/content_4.html": "The UK introduced the world’s first fur farming ban over 20 years ago. Despite this historic step, it is estimated that one million animals worth of fur is still imported here annually. I have joined over 50 cross-party MPs and Peers at an important Parliamentary event, supported by singer-songwriter Will Young, to call for an end to fur import and sale in Britain.\nHumane Society International/UK and FOUR PAWS UK, two of the UK’s leading animal protection organisations, organised the event, which was hosted by Adam Jogee, MP for Newcastle-under-Lyme, and urged the Government to back Ruth Jones, MP for Newport West and Islywn’s, new Fur (Import and Sale) Bill.\nDuring the event, harrowing new footage from a recent HSI/UK investigation on Finnish fur farms revealed the cruel conditions in which animals are kept in the fur industry. Confined in tiny, barren wire cages for their entire lives, these animals endure severe physical and mental suffering. They are later killed by gassing or electrocution at around eight months old.\nThese cruel, unsanitary, and overcrowded farms also pose a major public health risk. Many hundreds of outbreaks of COVID-19 have occurred on fur farms and, almost five years after the first reported case of the disease in China, a recent study in scientific journal Nature found dozens of novel viruses on animals from Chinese fur farms, sparking fears of a new pandemic. Leading virologists at Imperial College London have warned that fur farming should be considered in the same high-risk level category as the bushmeat trade and live animal markets, all of which increase the likelihood of future pandemics.\nThe vast majority of the British public, much like my constituents, are appalled by the cruelty of the fur trade. With 77% supporting a ban, it’s time for Parliament to reflect this overwhelming support and take decisive action. By ending the UK’s role in the fur trade, we can safeguard animals, our health, and our values. That’s why I’m proud to back the Bill for a ban on fur imports and sales.",
  "https_www_jowhite_uk_/https_www_jowhite_uk_cdn-cgi_l_email-protection/content_2.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_jowhite_uk_/https_www_jowhite_uk/content_1.html": "Jo White MP\nBASSETLAW'S STRONG VOICE\nKEEP UP TO DATE\nSubscribe to receive my regular email newsletter and online surveys. Your views are important to me.\nIt is an honour and a privilege to have been elected to serve the people of Bassetlaw as your Member of Parliament.\nI want to be an MP who listens and understands the issues that matter to you. Please do sign up to receive my regular email newsletter and surveys. If you need my assistance, you can contact me using the form below.\nGET IN TOUCH\nAs your local MP, I am here to help. You can contact me using the form below or you can email me: [email protected]\n- 01909 212171\n- [email protected]\nCAMPAIGNS\nSOCIAL MEDIA\nPeople in Bassetlaw made their views very clear yesterday at the polls.\nSome councillors of many years standing lost their seats. This is the course of democracy but I would like to take this opportunity to give thanks and recognition to the hard work and dedication they have given to their communities. Sybil Fielding, Glynn Gilfoyle, Mike Quigley and Tracey Taylor deserve all of our thanks and commiserations.\nCan I congratulate everyone who won - I put politics to one side when I'm fighting for Bassetlaw and I will work with anyone to get the very best for our area.\n... See MoreSee Less\nPolls are open and make sure you for your local Labour candidates to fix your potholes, restore neighbourhood policing and tackle anti-social behaviour.\nRemember to take voter ID and you can find your nearest polling station here:\nwheredoivote.co.uk\n... See MoreSee Less\nAn NHS free at the point of use.\nFundamental for everyone to have equal access to healthcare, no matter our backgrounds.\nA health system operated on how much you can personally afford to pay creates a system for the haves and the have nots.\n... See MoreSee Less",
  "https_www_jowhite_uk_/https_www_jowhite_uk_news_2024_12_worksop-guardian-column-04-12-24/content_9.html": "Last week, Parliament voted on the Terminally Ill Adults (End of Life) Bill. I received hundreds of emails, campaign cards, and letters, and there was a huge response to my online survey. I respect the strongly held beliefs on both sides, and I am grateful to everyone who shared their deeply personal experiences with me.\nI had to think deeply about this issue, and the views and values of Bassetlaw people have contributed to my thoughts. I have a photo of myself in my office of me as a young woman with a placard saying, ‘our bodies, our rights, our right to decide’. It is my fundamental belief that each individual should have a choice and control over how they manage their lives, and if you carry this principle through, this should include at the end of life. Having listened to the thousands of people who have contacted me, legal experts, medical professionals, disability charities, and faith groups, I voted for the Bill last week.\nI continue to have some concerns about the Bill and will address these as it makes its way through the law-making process in parliament. These include access to good palliative care, having enough GPs available to coordinate the assessment and ensuring that the High Court decision is a timely one. I want to also ensure that assisted dying is not a service that only the rich can use. It must be open to all people who want to take that route.\nI appreciate that this may be a disappointment for some residents, but there will be further opportunities to amend this Bill as it goes through Parliament and I will continue to listen to local people.\nIn the past week, I spoke to GB news about what drives me as a Member of Parliament, especially tackling violence against women and girls. My experiences have given me a deep strength and the energy to use my time in Parliament to fight for change. We all have to take responsibility, we can no longer turn a blind eye or tolerate those who abuse women and girls. It starts with language and ends with violence. It has to stop."
}