{
  "https_www_martynday_scot/https_www_martynday_scot/content_1.html": "Martyn Day, An Experienced Candidate and Representative\nThis post will be updated throughout the selection contest, so do check back\nUpdated, Saturday 3 May\nJust days left for Falkirk East and Linlithgow SNP members to choose your candidate for next year’s Holyrood election.\nThank you to everyone who’s already pledged their support and returned their ballots. If you haven’t yet, I’m asking for your #1 preference.\nI’m offering a detailed plan, a proven record, and the leadership our movement needs. As the only candidate to publish a manifesto, I’ve shown how we can win Falkirk East and Linlithgow and put independence at the heart of the next campaign.\nI’ve served this area for years — standing up for local people, fighting for public services, and making the case for independence every day.\nYou know me, and so do the general public — I’m a weel-kent face who has already helped many in our communities. I’ll always work tirelessly for our area and for Scotland’s future.\nThe 2026 Parliament will face immense pressure and opportunity. It will need representatives with real parliamentary experience from day one — ready to lead, act, and deliver immediately.\nWith the experience, reputation, and credibility to lead, I’m ready to unite the wider movement and get straight to work.\nI’m asking for your support. I’m asking you to vote Martyn Day #1 for Falkirk East and Linlithgow.\nBallots close on Tuesday 6 May at 12 Noon. Make sure your voice is heard.\nUnlike others, I’m only seeking selection in my home constituency—not on any regional list. My sole focus is winning Falkirk East and Linlithgow first-past-the-post.\nI’ve spent my life working for independence while campaigning locally and building relationships across our movement. Politics isn’t just about debates in Parliament—it’s about taking the fight to the streets and standing with the people.\nUpdated, Friday 2 May\nJust days left for SNP members in Falkirk East and Linlithgow to cast your vote.\nI’m the only candidate to publish a detailed manifesto, with a clear plan to win this seat and put independence at the heart of the next campaign.\nYou know me — and so does the wider public. I’m a weel-kent face who’s helped many in our community and delivered for this area over years of public service.\nJohn Swinney will need politicians with real parliamentary experience from day one. I’m ready to get to work — with the experience, reputation, and leadership to deliver for Falkirk East and Linlithgow.\nPlease give me your #1 vote — Martyn Day.\nBallots close Tuesday 6 May at 12 Noon.\nThe days of Devolution are numbered, what comes next is up to each and every one of us.\nOver nine years as an MP, my office handled 37,000 enquiries—20,000 from within this constituency area. Everyone here knows someone we’ve helped.\nI’m committed to serving my home communities of Falkirk East and Linlithgow, not seeking a place on the regional list. My sole focus is winning this seat to ensure a pro-independence majority at Holyrood.\nBe afraid, be very afraid. The U.K. drifts ever further to the right.\nTime for independence with whatever governments we choose for ourselves – or wait and take your chances in broken Britain with PM Farage.\nI know what I intend on doing. Vote for #independence.\nWinning people over means meeting them where they are—making the case that independence is the best way to tackle their concerns about the NHS, energy bills, and cost of living. Another Scotland is possible!\nAs Co-Convenor of the Scottish Independence Convention, I’m dedicated to bringing the fragmented YES movement together. With your support, I’ll continue standing up for our communities and help deliver a credible, pro-independence SNP led Government.\nUpdated, Thursday 1 May\nSeveral people have been asking what the Scottish Government is doing about Grangemouth. Yesterday’s Parliamentary Statement provided some important insights.\nIn the interest of transparency It is shared in full. So you can form your own conclusions.\nAs Kate Forbes MSP highlighted, the 66 potential projects identified in the feasibility study show that Grangemouth can be at the heart of Scotland’s just transition — delivering jobs, investment, and industrial transformation.\nThese projects range from waste processing innovations and biofuel development to the use of low-carbon hydrogen for clean fuels like e-methanol and e-ammonia. With the right investment, Grangemouth could lead Scotland’s move to net zero while creating serious employment opportunities beyond the 800 jobs envisaged in Project Willow.\nHowever, while the Scottish Government is committed to supporting these opportunities, the powers we have are limited under devolution. To make real progress, we need the UK Government’s cooperation and funding. Unfortunately, experience shows that we cannot rely on Westminster to act in Scotland’s best interests.\nBy contrast Anas Sarwar was torn to ribbons at the STUC conference this week over his Grangemouth lies. This needs circulated widely…\nI’ve only ever represented my home patch—first as Linlithgow councillor, then winning three General Elections as MP for Linlithgow and East Falkirk.\nHaving represented three-quarters of this new constituency and handled thousands of inquiries, I’ve built relationships that are essential to securing victory.\nAt this election we need candidates with Parliamentary experience who can hit the ground running from day one. —we need proven experience and deep local connections.\nSNP MEMBERS: A Clear Plan. A Proven Record. A Strong Future.\nThe SNP Candidate Selection Ballot will be closing shortly — and I’m asking for your #1 preference to continue leading the fight for independence in our local area and taking that fight to our national Parliament.\nI am the only candidate who has published a detailed Personal Manifesto to local members — setting out a clear and credible plan to win Falkirk East and Linlithgow and deliver real momentum for independence.\nWith your support, I will continue standing up for our communities, championing local priorities, and helping to deliver a credible, pro-independence SNP Government at Holyrood.\nOnce selected, I have the leadership and organisational abilities not only to win here, but to ensure that independence becomes the defining force of the next electoral cycle — inspiring our members, reconnecting with voters, and uniting the wider Yes movement.\nThis election is not just about selecting a candidate — it’s about choosing someone ready to lead, unite our movement, and deliver real results for Scotland. Someone you can trust to support John Swinney’s next government.\nMake your voice count — Vote Martyn Day for Experience, Reputation, and Leadership.\nNow’s the day, and now’s the hour. Let’s make this count — for our community, our movement, and Scotland’s future.\nOn this day in 1707, the Treaty of Union took effect, joining Scotland with England under a single Parliament at Westminster. 318 years later, this union continues—but for how much longer?\nScotland’s future isn’t set in stone, it’s in our hands.\nWestminster’s broken promises on Grangemouth are just the latest example of a union that doesn’t serve our interests. As an oil-rich nation without refineries while England continues refining domestically, we must ask: is this partnership working for Scotland? With independence polling at an 11% lead, the momentum is building.\nThe Treaty of Union began on May 1st, 1707—how long it continues is down to each of us. Let’s take control of our destiny and build the Scotland we deserve.\nUpdated, Wednesday 30 April\nSNP MEMBERS: A Clear Plan. A Proven Record. A Strong Future.\nMartyn Day is the only candidate to have published a detailed Personal Manifesto to local members — setting out a clear plan to win Falkirk East and Linlithgow and to rebuild momentum for independence.\nWith years of experience as a Parliamentarian and a strong reputation locally and nationally, Martyn has the skills needed not just to win this selection, but to deliver for our area.\nOnce selected, he will bring the leadership and organisation needed to ensure independence becomes the defining force of the next electoral cycle — inspiring our movement, reconnecting with voters, and securing the change we all believe in.\nMake your voice count. Vote Martyn Day for Experience, Reputation and Leadership.\nThe latest opinion polls show respectable leads for independence—encouraging, but we must demonstrate this support at the ballot box.\nIndependence will only become reality when voters see it not as an abstract ideal, but as essential to their daily lives. This has always been my approach, and we’ll achieve independence by convincing 50%+1.\nThe more people we speak to, the sooner we achieve it.\nUpdated, Tuesday 29 April\nOur path forward must include: making independence relevant to daily life by linking it to healthcare, cost of living, and our economy; rebuilding trust by highlighting our achievements; and reuniting our fragmented Yes movement.\nAs Co-Convenor of the Scottish Independence Convention, I’m committed to bringing together pro-independence voices across parties and groups. Together, we can deliver a winning campaign.\nGreat to get through helping Katy Loudon.In Hamilton, Stonehouse and Larkhall. Today I was out campaigning in all three communities.\nKaty Loudon is quite correct when she said:\n“Scotland is little more than an afterthought to the Labour government, so it’s no surprise that Sir Keir Starmer will be avoiding this by-election.\n“The Labour Party has lost its way, saying they’ll reduce bills by £300 and then doing the opposite and cutting support for disabled people.”\nNine years in Westminster has shown me firsthand how the system works against Scotland—from the UK Internal Market Act undermining devolution to funding decisions that cut Scotland at source.\nThese aren’t abstract issues—they directly impact our NHS, schools, and communities.\nIndependence will only be won in the heart of our communities, not by dancing eternally on Westminster’s hamster wheel.\nUpdated, Monday 28 April\nAs MP, I was one of few parliamentarians actively engaged with the Chemicals Sector, recognising its strategic importance to our economy. Despite tireless efforts supporting Grangemouth, Scotland’s limited powers mean we’re constrained by Westminster decisions.\nBrexit—which Scotland rejected—has already cost chemical sector jobs.\nOnly with independence can we truly protect our industries and build prosperity on our own terms.\nSNP MEMBERS: Important Reminder for Postal Voters\nIf you received a paper ballot by post — especially if it only just arrived — please don’t delay. All ballots must be received by 6 May to be counted.\nImportant: You do not need an email address to vote online.\nYour paper ballot pack includes a unique voting code that you can use to vote online quickly and securely. If you prefer to post your ballot back, please do so as soon as possible to give it the best chance of arriving in time. Voting online is strongly recommended at this stage to make sure your vote is counted.\nIf you have not received your ballot at all:\nEmail support@mi-voice.com immediately, giving your name, address, and confirming your constituency is Falkirk East and Linlithgow. They will resend your voting information.\nMake your vote count — Vote Martyn Day for Experience, Reputation and Leadership.\nUpdated, Sunday 27 April\nSNP MEMBERS: Check Your Spam Folder!\nIf you haven’t received your SNP Candidate Selection Ballot, check your Spam or Junk folder now.\nIt was sent by Alex Kerr, SNP National Secretary on Tuesday 22 April around 12 Noon.\nStill missing?\nEmail support@mi-voice.com with your name, address, and confirm Falkirk East and Linlithgow as your constituency.\nA replacement ballot will be resent to you once you contact them.\nBallots must be returned by 6 May — act now.\nUpdated, Saturday 26 April\nThe SNP Candidate Selection Ballots are being returned —and I just want to check with SNP members if yours has arrived safely.\nI hope you’ve been able to return it, giving me your #1 preference to continue leading the fight for independence in our local area, and taking that fight directly to our national Parliament.\nWith your support, I’ll continue standing up for our communities, championing local priorities, and helping to deliver a credible, pro-independence SNP Government at Holyrood.\nIf you haven’t received your ballot yet, please take action immediately.\nContact support@mi-voice.com, who are administering the ballot on behalf of the Party. Just provide your name, address, and confirm your constituency is Falkirk East and Linlithgow, and they’ll arrange for your voting details to be resent.\nDo let me know if your ballot has been received and returned—it’s incredibly helpful to know who’s been able to take part.\nLet’s make this count— Now’s the day, and now’s the hour.\nUpdated, Friday 25 April\nOver 2/3 of SNP members taking part in the candidate selection have already voted – have you?\nVote Martyn Day #1\nUpdated, Thursday 24 April\nThe SNP Candidate Selection Ballots are out.\nSNP Members who have not received it, should take steps immediately.\nPlease contact support@mi-voice.com who are running the ballot on behalf of the Party. Give them your details (Name, address, and the Constituency – Falkirk East and Linlithgow) and it will be resent.\nThis is how the ballot email looked in my inbox when it arrived on Tuesday 22 April.\nUpdated, Wednesday 23 April\nLook for the name you know – Vote Martyn Day #1\nCheck for an email from “Alex Kerr, SNP National Secretary”.\nCandidates are in a random order, so look for the name you know – vote Martyn Day 1.\nExperience, reputation and leadership are the key reasons which set me apart as the best candidate to represent Falkirk East and Linlithgow. I have a detailed plan to win this seat for the SNP, and the experience and reputation to deliver on it. Vote Martyn Day #1 today if you are an SNP member.\nCouldn’t have happened at a worse time, but I managed to damage my phone last night. So apologies for non response to any messages.\nApologies for anyone who has tried to call or text since 8pm yesterday till 2.30pm today as I will not have received the messages. Please resend.\nSNP selection ballots are out. Delighted to be receiving votes and messages of support from local members.\nIf you haven’t already returned your ballot please do so. Check for an email from “Alex Kerr, SNP National Secretary”.\nCandidates are in a random order, so look for the name you know – vote Martyn Day 1.\nUpdated, Tuesday 22 April\nI was happy standing, great talk from Gordon MacIntyre Kemp on the Wellbeing Economy. Lots of good content and enaged yessers.\nEvents like this are crucial for helping bring the fragmented nature of our movement back together. We all need to play our part and work together for independence.\nI have a detailed plan to win this seat for the SNP, and the experience and reputation to deliver on it. Vote Martyn Day #1 today if you are an SNP member.\nExperience matters. With so many of our MSPs retiring the SNP will lose a combined total of 385 years parliamentary experience at next years election.\nJohn Swinney needs our very best candidates and campaigners, ready to serve the party, in our communities and in Holyrood.\nAs the most experienced candidate on your ballot, I’m ready to step up, join John at Holyrood and get Scotland over the line, to win our independence.\nCheck your email for one from Alex Kerr, SNP National Secretary. Candidates are in a random order, so look for the name you know – vote Martyn Day 1.\nGlad to have the support and friendship of Jim Robertson.\nSNP members are encouraged to support an Experienced SNP Candidate with a track record of winning locally and high level of public recognition and trust by selecting Martyn Day with their 1st preference vote in todays ballot.\nVote Martyn Day #1\nUpdated, Monday 21 April\nIn light of the sad passing of Pope Francis the SNP has temporarily suspended public campaigning for the rest of today.\nI have therefore rescheduled the remainder of todays posts.\nSNP members will now receive their candidate selection ballots from midday tomorrow, not 9am as previously planned.\nMessage To Members – Select Martyn Day for SNP\nHaving danced around for all eternity on the Westminster hamster wheel, I can say with absolute certainty that the fight for independence will only be won here at home in the heart of our communities.\nWe need experienced voices at Holyrood who know how to win and who understand both the big picture and the local detail. I’ve dedicated my life to our cause—now I’m ready to bring that experience home to Holyrood and help win independence for Scotland.\nWith 25 years of public service locally, including nine years as MP for Linlithgow and East Falkirk and having served as a front-bench spokesperson for the SNP at Westminster, I am already a well-known figure with a high level of public recognition and trust.\nJohn Swinney will need battle hardened replacements to support his next government, I am ready to fill that role.\nExperience, reputation and leadership are the key reasons which set me apart as the best candidate to represent Falkirk East and Linlithgow.\nI have published a detailed Personal Manifesto, setting out my vision and plans for an intensive independence-focused campaign, which you can read at: (Link in email) You can find a full summary of my selection campaign messages and videos on my blog: https://manifesto.pub/SelectMartyn.\nI joined the SNP when we were barely at 12%, and through hard work by members like ourselves we made this a party of government. With my experience and campaign knowledge, and with your support we will win this constituency and advance independence.\nPlease reach out if you have any questions, or to let me know of your support. You can call or text 07887 658 998 or email mail@martynday.scot.\nYours for Scotland,\nMartyn Day\nAn Experienced SNP Candidate.\nMartyn Day brings 25 years of public service and proven SNP leadership—now he’s standing for Falkirk East & Linlithgow.\nBack experience. Back commitment. Back Martyn. #SNP#Holyrood2026\nListen to what those who have worked closely with Martyn on the front lines of the independence struggle have to say about him.\nVote Martyn Day #1 in SNP members ballot\nUpdated, Sunday 20 April\nJohn Swinney will need battle hardened replacements to support his next government, I am ready to fill that role.\nExperience, reputation and leadership are the key reasons which set me apart as the best candidate to represent Falkirk East and Linlithgow.\nI have published a detailed Personal Manifesto, setting out my vision and plans for an intensive independence-focused campaign, which was emailed to all local members.\nYou can find a full summary of my selection campaign messages and videos on my blog: https://manifesto.pub/SelectMartyn.\nI joined the SNP when we were barely at 12%, and through hard work by members like ourselves we made this a party of government. With my experience and campaign knowledge, and with your support we will win this constituency and advance independence.\nSNP Members asked to Vote Martyn Day #1\nMartyn brings 25 years of local service, having represented 3/4 of the new constituency on the national stage, and having served as a front bench spokesperson makes him a well kent and trusted SNP figurehead locally.\nHis social media reach is unrivalled as these facebook stats for the selection contest from his page demonstrate. When Martyn Makes the case for independence – local people notice.\nBack a winner, back an independence champion, back Martyn – Vote #1\nVote Martyn Day #1\nHe has the experience we need at this crucial election.\nUpdated, Saturday 19 April\nOut and about in Hamilton today helping Team SNP get Katy Louden elected as the next MSP for Hamilton, Larkhall and Stonehouse.\nHaving campaigned with Katy before I know she will make an excellent representative and follow in Christina’s footsteps.\nAll across Scotland voters have learned that Labour promises are worthless, and real progress will only come through the SNP and independence.\n“If my time at Westminster has taught me anything, it’s that independence will only be won by our work here, in the heart of our communities—not by dancing around for all eternity on the Westminster hamster wheel.” – Martyn Day\nWestminster Watch – Experience That Matters\nNine years in Westminster has given Martyn first-hand experience of how the system works—and more importantly, how it works against Scotland. Martyn was there to see up close the power grabs that threaten our democracy, from the UK Internal Market Act which undermines devolved decision-making to UK Government spending decisions that cut Scotland’s funding at source.\nThese are not abstract issues—consequentials have consequences. When Westminster makes spending choices that reduce funding for devolved services, it directly impacts our NHS, schools, transport, and local communities. The stakes could not be higher.\nMartyn knows how to navigate the Westminster system, how to challenge power grabs, and how to push back effectively. His experience will be put to good use—defending Scotland’s interests, making sure every threat is exposed, and ensuring our Parliament has the strongest possible representation as we continue the fight for independence.\nI had the privillage of being Election Agent for Falkirk East when Angus MacDonald won the seat from Labour. This was the start of the partys meteroric rise, and led to the 2014 referendum. I am grateful for his continued support and friendship.\nIn recent years we have dropped back electorally, and last years General Election was dissapointing. Since then John Swinney has stabalised the national position, and now is the time to rebuild trust on the ground locally.\nVote Martyn Day #1\nUpdated, Friday 18 April\nVote Martyn Day\nLets win Falkirk East and Linlithgow with Martyn Day. He is a well known and popular candidate with deep local roots and experience on the national stage.\nMartyn has only ever represented his home patch and is not seeking selection in any other constituency. He will also not be standing on the regional list—his sole focus is winning his local area first-past-the-post.\nHe has spent his life working for independence, campaigning locally and working with others across the movement.\nA Street Campaigner, Not Just a Parliamentarian\nPolitics isn’t just about debates, committees, and questions in Parliament—it’s about taking the fight to the streets, standing with the people, and making our voices heard. While Martyn has years of experience in Parliament—scrutinising government decisions, holding ministers to account, and fighting for his constituents—he is just as much a street campaigner as he is a parliamentarian.\nMartyn has been on the frontlines of our movement, not just behind a microphone in a debating chamber, but on street corners, at rallies, and leading protests. He has:\nAddressed All Under One Banner (AUOB) independence marches and rallies, standing alongside thousands fighting for Scotland’s future.\nSpoken at pro-Palestinian rallies, condemning the Israeli genocide and calling for justice, peace, and international accountability.\nProtested outside the Courts of Justice, standing with constituents who have been failed by the Financial Conduct Authority (FCA) and the UK Government’s weak financial regulations.\nLed a cross-party demonstration at the UK Supreme Court, when the case on Scotland’s right to hold an independence referendum was heard, making it clear that we will never accept Westminster blocking our path to independence.\nThe selection campaign for Falkirk East and Linlithgow is getting some press coverage both in the local and national press.\nToday’s Journal and Gazette has a feature on each of the candidates standing.\nMartyn Day is the strongest candidate, he brings experience, dedication and leadership to the fight. Scotland needs experienced voices at Holyrood who know how to win and who understand both the big picture and the local detail.\nHe is uniquely placed to hit the ground running in the election campaign and as the area’s MSP.\nHis name recognition and familiarity in the constituency is second to none, giving us a crucial advantage that would take years to establish from scratch.\nThrough years of active engagement, Martyn has built strong relationships with local community groups and businesses.\nHe is uniquely placed to hit the ground running in the election campaign and as the area’s MSP.\nHis name recognition and familiarity in the constituency is second to none, giving us a crucial advantage that would take years to establish from scratch.\nMartyn Day served as the Member of Parliament for Linlithgow and East Falkirk from 2015 until 2024. Before serving behind enemy lines at Westminster, he began his political career as a councillor in Linlithgow in the late 1990s, following a career in retail banking.\nNow Martyn is ready to bring his wealth of experience to the Scottish Parliament.\nVote Martyn Day #1\nUpdated, Thursday 17 April\nSelect Martyn Day for the New Falkirk East and Linlithgow Constituency.\nThis new seat includes four-sevenths of Martyn’s former Linlithgow and East Falkirk Westminster constituency, meaning he has represented three-quarters of it over the past nine years as MP—winning three General Elections in the process and giving a strong voice to these communities by standing up for them in Westminster.\nFor 25 years, Martyn has served Linlithgow—first as a local councillor, then as MP.\nOver his time in Westminster, he dealt with approximately 20,000 constituent enquiries across this new constituency —meaning almost everyone in the area will know someone Martyn Day has helped.\nThrough years of active engagement, Martyn has built strong relationships with local community groups and businesses. He is uniquely placed to hit the ground running in the election campaign and as the area’s MSP. His name recognition and familiarity in the constituency is second to none, giving us a crucial advantage that would take years to establish from scratch.\nSelect an Experienced SNP Candidate.\nVery pleased to have the endorsement and support of sitting MSP Michelle Thomson for the SNP selection contest in Falkirk East and Linlithgow.\nOur party and movement needs experienced campaigners to drive forward the fight for independence on the ground and to support John Swinneys next Government in Parliament.\nSelect an Experienced SNP Candidate – Vote Martyn Day #1\nUpdated, Wednesday 16 April\nJohn and I worked very closely both at Westminster and in our constituences accross Falkirk District. The 1/4 of the new constituency which wasn’t in my old constituency was well represented by my friend and colleague John McNally and I am delighted to have his support.\nVote Martyn Day #1, your experienced SNP candidate\nOn Tuesday 22 April I’m asking SNP members to vote Martyn Day #1\nWinning people over means meeting them where they are—understanding their priorities and framing the case for independence in a way that directly addresses their concerns. If a voter tells us they’re worried about the cost of living, or the state of the NHS, or energy bills—we don’t dismiss those concerns or try to change the subject. We make the case that independence is the best and only way to truly tackle these issues.\nBy making clear how independence will restore and protect the NHS, secure Scotland’s energy wealth for its people, and create a fairer economy, we can build the support needed to win.\nAt the same time, we must remind voters of the broken promises and outright lies from Labour and the other unionist parties. Time and again, they have shown they cannot be trusted—whether on protecting public services, defending workers’ rights, or standing up for Scotland’s interests. We must expose their failures while presenting independence as the credible, necessary alternative.\nOnly by engaging people on the urgency of independence to their daily lives will we turn favourable Yes opinion polls into an electoral reality at the ballot boxes – A reality that cannot be ignored.\nAnother Scotland is possible.\nI was delighted to attend the screening of Denmark Film by Lesley Riddoch organised by the Tryst Yes Campaigners.\nA very thoughtful and engaging evening. and, it was good catching up with friends including former Falkirk MP John McNally.\nThe independence movement is strongest when we work together. As Co-Convenor of the Scottish Independence Convention (SIC) alongside Roza Salih, I am dedicated to bringing the fragmented YES movement together—building unity and common purpose across pro-independence parties, groups, and activists.\nI’ll get along to whatever I can, and help promote the good work being done accross our movement.\nUpdated, Tuesday 15 April\nA nice spot of coverage in the National for my selection bid.\nPublishing a detailed 35 page manifesto with my plans for an intensive independence campaign has clearly been noticed.\nTodays opinion poll suggesting an 11% lead for independence is encouraging, but we need to demonstrate that support at the ballot box.\nIndependence will only become a reality when its urgency is recognised by the people of Scotland—when voters see it not as an abstract ideal, but as essential to their daily lives. Our campaign must ensure that independence is not something people feel they can put off for another time, but is the solution to the challenges they face right now.\nThis has always been my approach, and we will achieve independence by convincing 50%+1. The more people we speak to the sooner we achieve it.\nI am inviting any local SNP members to get in touch to discuss my campaign for the Scottish Parliament.\nIf you haven’t received my personal manifesto outlining my approach to the campaign, let me know and I’ll get a copy to you.\nThis election is too important to take risks—we need an experienced candidate with deep local roots who knows how to win for the SNP. This is not the time for untested candidates; we need someone with a proven record of winning elections, growing our vote, and building strong local campaigns.\nI have only ever represented my home patch—first as a local councillor for Linlithgow, then as MP for Linlithgow and East Falkirk, winning three General Elections. I have spent decades working with local communities, businesses, and campaigners, building relationships that will be essential to securing victory.\nHaving been at the heart of successful SNP campaigns, taking on roles from Candidate to Election Agent to frontline organiser, I have helped ensure every campaign is professional, disciplined, and voter-focused.\nIt is always good to share the thoughts and support of colleagues who have worked closely with you.\nI am delighted to have this endorsement from Hannah Bardell with whom I worked behind enemy lines in Westminster, and also worked closely within West Lothian locally.\nMy record and work ethic are not mere rhetoric they are proven, and I am grateful for the support.\nUpdated, Monday 14 April\nA few words of support for former SNP Westminster Leader Ian Blackford – someone who knows how I operated on the national stage as a parliamentarian.\nDelighted to have his support in my selection bid.\nI quite agree with out First Minister John Swinney, If Labour at Westminster can nationalise British Steel, why not the same for Grangemouth? If it can fund London’s supercomputer, it can reinstate Edinburgh’s. If it green-lights carbon capture in England, the north-east of Scotland must follow.\nScotland’s people deserve better.\nOn jobs and the economy, as the local MP I was a leading voice for local businesses, frequently challenging UK ministers for greater support and regulatory changes. All too frequently I saw first-hand how Westminster disregards Scotland.\nI was one of the few parliamentarians actively engaged with the Chemicals Sector, recognising its strategic importance to the local and national economy. Working closely with Scottish Enterprise, I have supported business expansion and job creation in Grangemouth.\nDespite tireless efforts to support jobs, industry, and the economy, Scotland’s limited powers mean we are too often forced to work within constraints set by Westminster. Brexit—a decision Scotland overwhelmingly rejected—has already cost jobs in the chemical sector at Grangemouth, making it harder to attract investment and secure a stable future for the industry. Once again, it proves that only with the full levers of independence can we truly protect our industries, tackle the cost of living, and build a prosperous future on our own terms.\nAre You Yes Yet\nIf my time at Westminster has taught me anything, it’s that independence will only be won by our work here, in the heart of our communities—not by dancing around for all eternity on the Westminster hamster wheel.\nNine years in Westminster has given first-hand experience of how the system works—and more importantly, how it works against Scotland. I’ve seen up close the power grabs that threaten our democracy, from the UK Internal Market Act which undermines devolved decision-making to UK Government spending decisions that cut Scotland’s funding at source.\nThese are not abstract issues—consequentials have consequences. When Westminster makes spending choices that reduce funding for devolved services, it directly impacts our NHS, schools, transport, and local communities. The stakes could not be higher.\nUpdated, Sunday 13 April\nA lot of the campaign knowledge and energy I picked up over the years was due to working with Stewart Stevenson in the early years, really pleased to have his continued backing and friendship.\nA lifelong nationalist, I joined the SNP in the 1980s using money from my first pay packet—not for a career, but to help deliver independence at a time when the party was polling at just 11–12%.\nBelieving that achieving independence required full-time activism, I gave up a career in the banking sector to dedicate myself fully to the cause, becoming a Councillor for Linlithgow in 1999. In addition to standing as a candidate, I have also served as an election agent in both parliamentary and local elections.\nOne of the political disappointments was as the Election Agent in 1999 not getting Stewart elected for Linlithgow. Delighted that he did get into a Parliament a few years later.\nUpdated, Saturday 12 April\nMessage To Members – Select Martyn Day for SNP\nVote Martyn Day #1\nI am asking for your support in the SNP selection to be the candidate for Falkirk East and Linlithgow at the next Scottish Parliament election.\nPlease take a moment to read my Personal Manifesto (attached or via Link in email) – it outlines my values, priorities, the experience I bring to this campaign, and some of my plans for the campaign ahead.\nAs a seasoned parliamentarian, I have experience representing three-quarters of Falkirk East and Linlithgow on the national stage—fighting for independence, championing local issues, and defending public services. I believe I am the strongest and most experienced candidate to represent our local area and to play a meaningful role in delivering a credible SNP government at Holyrood.\nWith nearly a decade of experience at Westminster, I have stood firm against austerity, pushed for fairer energy costs, and worked tirelessly to tackle the cost-of-living crisis. I bring dedication, knowledge, and a deep connection to our communities. At this election, we’re not just choosing a local representative—we’re selecting the team that will govern Scotland and secure a pro-independence majority in Parliament. I want to play my part supporting John Swinney’s next government, bringing experience, energy, and commitment to help deliver a better future for Scotland and fill the gaps left by experienced SNP MSPs who are stepping down.\nWe must make the urgency of independence relevant to voters’ daily lives, demonstrating how it directly impacts healthcare, the cost of living, and the economy. We must rebuild trust—reminding voters of both our personal track records and the achievements of our Government.\nAnd we must reunite the Yes movement, which has become dangerously fragmented.\nParty campaigning rules for this selection mean I am not allowed to doorstep members during the campaign, but I will do my best to telephone as many people as I can.\nI’ll be updating a campaign blog regularly at: 👉 Here\nIf you don’t already, please also follow me on social media: (I am no longer promoting X/twitter.)\nAll @MartynDaySNP Facebook: BlueSky: Instagram: YouTube:\nIf you’d like to discuss any part of my campaign, raise any questions, or let me know of your support, please don’t hesitate to get in touch on 07887 658 998—I’d love to hear from you.\nWarm regards,\nMartyn Day\nAn Experienced SNP Candidate\nReally pleased that SNP Councillors Jim Robertson and David Balfour have let me know they are backing me to be the next SNP candidate.\nBoth have been going through some ill health lately. I wish them well in their recovery and look forward to seeing them back at work in the near future.\nOver the years, I have campaigned closely with them, and I look forward to doing so again. I have enjoyed being at the heart of their successful SNP campaigns, taking on roles from election agent to frontline organiser—helping ensure local campaigns are professional, disciplined, and voter-focused.\nFor nine years I represented 3/4 of the new constituency, and I am delighted that John McNally who represented the rest is asking SNP members to select me.\n“Through years of active engagement, Martyn has built strong relationships with local community groups and businesses. He is uniquely placed to hit the ground running in the election campaign and as the area’s MSP. His name recognition and familiarity in the constituency is second to none, giving us a crucial advantage that would take years to establish from scratch.”\nUpdated, Friday 11 April\nMembership Contact Opens – Saturday 12 April\nFrom Saturday 12 April, SNP candidates for selection will receive access to the party membership list. This allows us to engage in limited, respectful contact with members during the campaign period.\nI’ll be sending out my personal manifesto tomorrow—please check your inbox to make sure you’ve received it.\nThis manifesto sets out the values and priorities I bring to this campaign, as well as the experience I’ve built as a seasoned parliamentarian representing around three-quarters of Falkirk East and Linlithgow on the national stage.\nI’ve stood firmly for independence, championed local issues, and defended our public services. I believe I’m the most experienced and ready candidate to represent our local area—and to play a strong role in delivering a credible SNP government at Holyrood.\nOur path forward must include:\nMaking the urgency of independence relevant to daily life—linking it to healthcare, the cost of living, and our economy.\nRebuilding trust—highlighting our personal records and the real achievements of our Government.\nReuniting the Yes movement—bringing together a cause that has become dangerously fragmented.\nIf you’d like to discuss any aspect of my campaign, raise questions, or let me know I have your support, I’d love to hear from you. Please don’t hesitate to get in touch on 07887 658 998.\nIf you haven’t received my manifesto by email, please get in touch for a paper copy or an online link.\nTogether we can deliver a winning campaign.\nStarmer acts to recall Parliament saying “As Prime Minister, I will always act in the national interest to protect British jobs and British workers.”\nBritish workers, not Scottish ones.\nJust days before the election, Labour MP Brian Leishman declared, “Only voting Scottish Labour on July 4th can save the jobs at the Grangemouth refinery.” Keir Starmer himself assured Scotland that Grangemouth’s future was a “real priority” for his government. During the STV leaders’ debate, Anas Sarwar promised that voting Labour would “save the jobs at Grangemouth”. The Labour campaign hinged on these assurances.\nYet now, just months later, the refinery is closing—400 direct jobs gone, no rescue package, no intervention. And it’s not just those 400 jobs. The refinery supports an additional 2,822 jobs in the wider economy—jobs now at risk because of Labour’s inaction. As if to add insult to injury UK Labour are now considering nationalising British Steel, but not Grangemouth.\nSo what happened to Labour’s supposed power to save Grangemouth? Did they ever have a plan, or were they simply making empty promises to win votes? This is a betrayal of Scotland’s workers and communities, proving once again that Labour cannot be trusted.\nGrangemouth’s closure is not just an economic disaster—it’s a national disgrace. Scotland is an oil-rich nation, yet with no refineries left, we will be forced to import fuel while England continues refining oil domestically. If Scotland had voted Yes in 2014, we could have protected our energy sector. Instead, we are left at the mercy of Westminster, where Scotland’s resources are treated as an afterthought.\nThis is why independence is urgent. Only with full control over our economy and energy policy can we protect jobs, invest in industry, and secure our future. Grangemouth is not just a loss—it’s a warning. Scotland must take back control before more of our industries are sacrificed by Westminster neglect.\nThis election is too important to take risks—we need an experienced candidate with deep local roots who knows how to win for the SNP.\nThis is not the time for untested candidates; we need someone with a proven record of winning elections, growing our vote, and building strong local campaigns.\nDelighted to have the support of my good friend and colleague Angus MacDonald.\nUpdated, Thursday 10 April\nIt was a real pleasure to meet up with Dr Rajeev Rai MP today during his visit to Scotland.\nRajeev Rai is the National Secretary and spokesperson of Samajwadi Party. He is credited with being the man behind the success of forming the 1st Samajwadi Party government in Uttar Pradesh in 2012. He is currently serving as a Member of Parliament (MP)\nScotland’s future as an independent nation must be built on the principles of fairness, compassion, and justice—not just at home, but on the global stage.\nThroughout my political life, I have been a consistent and vocal advocate for humanitarian causes, standing up against injustice wherever it occurs.\nThis commitment has earned close friendships and support from fellow politicians across the globe—key contacts who may prove invaluable when Scotland seeks international recognition for our independence.\nDelighted to have the support and backing of outgoing MSP Michelle Thomson.\nWith the retirement of our three local MSPs—Fiona Hyslop, Michael Matheson, and Michelle Thomson—our area will lose 61 years of parliamentary experience. I can help fill part of that gap, having already represented most of the local area on the national stage.\nScotland must elect a pro-independence Parliament and we must have a strong SNP led government. I am ready to use my knowledge, experience and skills to this effect.\nUpdated, Wednesday 9 April\nOver the nine years as an MP my office and I dealt with 37,000 enquiries, some 20,000 of these were in the Falkirk East and Linlithgow constituency area – everyone will know someone we have helped.\nAt this crucial moment, we must secure a pro-independence majority—and that means earning public confidence through trusted, dependable voices, both local and national.\nI am touched by the supportive comments from Hannah Bardell MP who has worked closely with me.\nUpdated, Tuesday 8 April\nBeing an SNP member isn’t just about delivering leaflets, running jumble sales, or sitting through meetings on minutiae—it’s about shaping our democracy and ensuring we elect the best representatives for our party and our communities.\nSelecting the right candidate is one of the most important responsibilities we have, as they must not only uphold SNP values but also work tirelessly for every constituent.\nLocal SNP members who’d like to discuss any part of my Scottish Parliament campaign, raise any questions, or let me know of your support, please don’t hesitate to get in touch on mail@martynday.scot —I’d love to hear from you.\nUpdated, Tuesday 8 April\nAlways good during a selection to share what experienced colleagues who have worked closely with you think.\nVery grateful to Dr Philippa Whitford SNP MP for her endorsement, getting to work with her was one of the few positives from those years at Westminster. Thanks for the support.\nUpdated, Monday 7 April\nThe SNP nomination process has concluded, we now enter the selection phase of the internal campaign. Ballots are to be issued on April 21.\nOver the campaign I will be highlighting the 25 years of experience in public service I bring to the fight, my successful track record at elections, the public recognition from having represented 3/4 of Falkirk East and Linlithgow, years of parliamentary experience including having served as a front bench spokesperson, is experienced on the national stage and my longstanding involment in Scotlands Independence movement.\nVote Martyn Day #1 – the only serious choice for Falkirk East and Linlithgow.\nUpdate, Sunday 6 April 2025\nPRESS RELEASE\nMartyn Day has officially entered the SNP selection race for the newly created Falkirk East and Linlithgow constituency ahead of the 2026 Scottish Parliament election. A long-standing representative of the area, Day brings 25 years of experience in public service, including nine years as the MP for Linlithgow and East Falkirk and prior service as a local councillor.\nThe new constituency, which unites parts of Falkirk East, Falkirk West, and Linlithgow, represents a significant electoral shift. With three prominent SNP MSPs—Fiona Hyslop, Michelle Thomson, and Michael Matheson—standing down, Day has paid tribute to their collective parliamentary service totalling more than 60 years.\n“This election is too important to take risks—we need an experienced candidate with deep local roots who knows how to win for the SNP here,” said Martyn Day. “I have already had the privilege of representing three-quarters of this new constituency over the past nine years, and I want to continue working for our communities as the SNP candidate, and subsequently MSP, for Falkirk East and Linlithgow. The SNP must select its strongest and most capable candidates to advance our struggle for Scotland’s independence, and I am determined to deliver for the people of this constituency.”\nDay has confirmed he is seeking selection solely in Falkirk East and Linlithgow and will not stand on the regional list. He emphasised the importance of securing victory in the constituency to help ensure a nationalist majority at Holyrood.\nAmid an ever-changing political landscape, Day stressed the need for experienced candidates to bolster the party’s position in government. “It’s vital we return a strong team to Holyrood. With my experience at Westminster, including serving as a frontbench spokesperson and working on key committees, I bring the skills and knowledge necessary to deliver strong representation for our communities and support a dedicated parliamentary group standing up for the needs of people across Scotland.”\nSNP members in Falkirk East and Linlithgow will cast their votes in the selection contest from 21st April. Martyn Day is encouraging members to reach out to him at mail@martynday.scot to discuss any questions or thoughts they may have ahead of the ballot.\nENDS\nUpdate, Saturday 5 April 2025.\nA new playlist for the Falkirk East and Linlithgow SNP selection contest has been launched on my youtube channel.\nUpdate, Tuesday 1 April 2025.\nThe SNP’s nomination process for the 2026 Scottish Parliament election is well underway, marking a moment of change for our party and our communities.\nWith the creation of the new Falkirk East and Linlithgow constituency, I want to take a moment to pay tribute to the outstanding service of Fiona Hyslop, Michelle Thomson, and Michael Matheson. Their combined parliamentary experience of 61 years has been invaluable to our area and to Scotland. Their decision to stand down next year represents a major transition, and I thank them for their dedication and contributions.\nThis election is too important to take risks—we need an experienced candidate with deep local roots who knows how to win for the SNP here. This is not the time for untested candidates; we need someone with a proven track record of delivering victories and growing our support in this area.\nThis new seat brings together parts of the current Falkirk East, Falkirk West, and Linlithgow constituencies. It comprises four-sevenths of my former Linlithgow and East Falkirk Westminster constituency, meaning I have already had the privilege of representing three-quarters of it over the past nine years as MP. I’ve served Linlithgow for 25 years, first as a local councillor and then as an MP, and I want to continue working for our communities as the SNP candidate for Falkirk East and Linlithgow.\nWith independence, we can build a better future for Scotland, and I want to be part of the team that delivers it.\nGetting our most experienced people elected to the Scottish Parliament and using that platform to turbocharge our independence drive must be our priority.\nI am pleased to have been formally nominated as a candidate for selection in Falkirk East and Linlithgow. The selection contest is ongoing, and SNP members will be balloted on 21 April.\nI am not seeking selection in any other constituency, nor will I be seeking a place on the regional list. To secure a nationalist majority, we must win Falkirk East and Linlithgow on a first-past-the-post basis, and I am determined to achieve that.\nIt is crucial that the party selects its strongest and most capable candidates to advance our struggle for freedom. John Swinney has successfully stabilized the SNP, recovering from last year’s General Election setback and positioning the party as a strong contender to remain the largest in next year’s Holyrood election. However, current polling suggests we are heading toward an SNP minority government, with fewer seats than at present and a significant loss of experience and knowledge. By next year’s election, the combined parliamentary experience lost due to SNP candidates elected in 2021 who have declared they will not stand again amounts to 385 years.\nWith nine years of experience at Westminster—including serving as a frontbench spokesperson, working on select committees, and engaging in cross-party collaboration—I bring key skills that will strengthen our parliamentary group. I know how to win, and I know how to deliver for our communities.\nIf you’re an SNP member in Falkirk East and Linlithgow, I would be honoured to have your support. Please consider giving me your first-preference vote. If you would like to discuss any issues with me, you can reach me at mail@martynday.scot. I’d love to hear from you.\nInitial Post Tuesday 1 April 2025"
}