{
  "https_www_jencraft4thurrock_com/https_www_jencraft4thurrock_com_blank/content_3.html": "About Jen\nI am a former civil servant who was born and brought up in Thurrock and I am now raising my family here. I’m an unpaid carer for my daughter, am a community volunteer and a passionate campaigner for disability rights.\nI am truly honoured to be Labour’s candidate for my home here in Thurrock.\nOur community have been hit hard by the Tories' failures. They’ve bankrupted our council, we have some of the worst GP waiting times in the country and some of the worst levels of air pollution outside of London. Everyone here is feeling the pinch of the cost of living crisis, while the Tory Government prioritise resolving their own internal squabbles over running the country.\nI am determined to be a champion for Thurrock and for the people living here. I look forward to hearing from people in Thurrock what they want to see from a Labour Government and having conversations about how they will see a real positive change with Labour for both our community and our country.\nIf you would like to speak to me, please get in touch.\nLocal Campaigns\nI was born, brought up and now live in Thurrock. It is because of this that I understand the issues impacting our community, because they affect me and my family too. I will be a campaigning MP, fighting to improve our community and the services we all rely on.\nHere you can read about some of the campaigns I am currently running, including on our local health services (especially maternity care), Thurrock Council finances and protecting local services such as the Thameside Centre.\nNews\nHow to Vote\nIf you live in Thurrock, you will need to register in order to vote. You can do that easily online at https://www.gov.uk/register-to-vote - it only takes 5 minutes.\nFor the first time this year, you will need photo ID to vote in person. The easiest thing to do is to vote by post instead. You can download the form here – post it back to the council at Thurrock Council, Civic Offices, New Road, Grays, RM17 6SL.\nIf you want to vote in person and don’t have photo ID, you can apply for one free here.\nGet in Touch",
  "https_www_jencraft4thurrock_com/https_www_jencraft4thurrock_com_event-details_hangmans-wood-street-meeting/content_7.html": "top of page\nHangman's Wood Street Meeting\nThu 27 Mar\n|Location is disclosed in your invite.\nJoin Jen for a meeting to discuss fire prevention at Hangman's Wood.\nRegistration is closed\nSee other eventsTime & Location\n27 Mar 2025, 12:30 – 13:00\nLocation is disclosed in your invite.\nAbout the event\nJoin Jen for a street meeting with representatives the Council, Natural England, and the Essex County Fire and Rescue Service to discuss the issue of fire prevention at Hangman's Wood.\nThis is an invite only event. Local residents will have received an invite in the post disclosing the full details. If you want to attend, please RSVP.\nbottom of page",
  "https_www_jencraft4thurrock_com/https_www_jencraft4thurrock_com_event-details_health-coffee-afternoon-south-ockendon/content_6.html": "top of page\nHealth Coffee Afternoon - South Ockendon\nFri 28 Mar\n|Location is disclosed in your invite.\nJoin Jen for a coffee afternoon in South Ockendon to discuss your experiences of local health services.\nRegistration is closed\nSee other eventsTime & Location\n28 Mar 2025, 12:30 – 14:00\nLocation is disclosed in your invite.\nAbout the event\nJoin Jen for a coffee afternoon in South Ockendon focusing on local NHS services, discussing what changes you would like to see to improve the service for patients.\nThese are very informal meetings where you can have a coffee or tea, a biscuit, and a chat with Jen about your experiences of using the NHS.\nThis is an invite only event. Physical invitations containing the full details have been sent to all residents in South Ockendon. If you have received an invite and want to attend, please RSVP.\nbottom of page",
  "https_www_jencraft4thurrock_com/https_www_jencraft4thurrock_com_privacy-policy/content_5.html": "PRIVACY POLICY\nWe respect your privacy and are committed to protecting your personal data. This privacy policy will inform you as to how we look after your personal data when you visit our website (regardless of where you visit it from) and tell you about your privacy rights and how the law protects you.\nWHO WE ARE AND HOW TO CONTACT US\nAli Craft is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy).\nIf you have any questions about this privacy policy or any concerns or complaints about how your data has been processed, please contact us at\nPURPOSE OF THIS PRIVACY POLICY\nThis privacy policy aims to give you information on how we collect and process your personal data through:\nyour use of this website (including, but not limited to, any data you may provide through this website by, for example, signing up as a supporter of Jen Craft.\nBy collecting such data, we will be able to inform you about relevant developments that relate to the Campaign and what you can do to help the Campaign as it progresses.\nThis privacy policy supplements other notices and privacy policies (such as wording that may feature on our website alongside options to subscribe to newsletters and other communications) and is not intended to override them.\nTHE DATA WE COLLECT ABOUT YOU\nPersonal data, or personal information, means any information from which your individual identity could be discerned. It does not include data where the identity has been removed (anonymous data). We may collect, use, store and transfer different kinds of personal data about you which we have grouped together as follows:\n-\nidentity data, including first name, maiden name, last name, username or similar identifier, marital status, title, date of birth and/or gender;\n-\ncontact data, including address, email address and/or telephone number(s);\n-\nfinancial data, including bank account and payment card details;\n-\ntransaction data, including details about payments to and from you and other details of products and services you have purchased from us;\n-\ntechnical data, including internet protocol (IP) address, your login data, browser type and version, time zone setting and location, browser plug-in types and versions, operating system and platform, and other technology on the devices you use to access this website and platforms hosting our content;\n-\nprofile data, including your username, your interests, preferences, feedback and/or survey responses;\n-\nusage data, including information about how you use our website; and/or\n-\nmarketing and communications data, including your preferences in receiving content and/or marketing from us and your communication preferences.\nWe also collect, use and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. For example, we may aggregate your usage data to calculate the percentage of users accessing a specific website feature. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this privacy policy.\nHOW WE COLLECT YOUR PERSONAL DATA\nWe use different methods to collect data from and about you.\nProvided by you – directly\nYou may give us your name and contact details by filling in forms or by corresponding with us by post, phone, email or otherwise.\nThis also includes personal data you provide when you register as a supporter of the Campaign, subscribe to any mailing lists, give feedback and/or contact us directly via such forms, email, telephone or similar mediums.\nHOW WE USE YOUR PERSONAL DATA\nThe uses\nWe will only use your personal data when the law allows us to. We will use your personal data in the following circumstances:\n-\nRegister you as a supporter of Jen Craft;\n-\nInform and engage you about the Campaign;\n-\nManage donations, payments, fees and/or charges;\n-\nComply with our legal obligations; and/or\n-\nAnswer your queries and respond to your questions and/or complaints.\nThe Legal Basis\n-\nWhere you have specifically consented to a particular use of your data (such as where you have subscribed to receive information about the Jen Craft campaign);\n-\nWhere you have entered into a legal agreement with us that necessitates that particular use of your data (such as where you make a payment or donation to us);\n-\nWhere it is a necessary lawful basis for our legitimate interests and your interests and fundamental rights do not override those interests; or\n-\nWhere we are obliged to process your data in a particular way by law (for example, if we are required to notify any authority or regulator of the nature or value of your donations).\nWHEN WE WILL SHARE YOUR DATA\n-\nWe will never sell your personal data to any other organisation and we will not share your personal data unless it is obvious that this is what we are going to do (such as the signing of a petition). We may share your data:\n-\nTo enable transfers to take place (where appropriate);\n-\nWhere we need to comply with a legal obligation; and/or\n-\nWith suppliers who act as our ‘data processors’ and who provide the means of processing financial transactions including, but not limited to, Stripe, PayPal and others.\nWHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing\nYou will receive marketing communications (i.e. communications promoting the Campaign and/or individuals related to it) from us if you have requested information from us and/or you have subscribed to receiving that marketing.\nRight to object/Opting-out\nYou can ask us to stop sending you marketing messages at any time by contacting us at info@jencraft4thurrock.com\nYou have a right to opt-out of your data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds for the processing.\nWhere you opt-out of receiving these marketing messages, this will not apply to personal data provided to us as a result of other engagement or transactions with us (so, for example, if you opt-out of receiving messages from us – this will not cause us to change the way we use data you have provided for processing donation payments).\nCOOKIES\nA cookie is a tiny text file that is stored on users’ machines (computers, tablets or mobile devices). We may use cookies in order to tailor your experience on our site according to the preferences you have specified. You can set your browser to refuse all or some browser cookies, or to alert you when websites set or access cookies. If you disable or refuse cookies, please note that some parts of this website may become inaccessible or not function properly.\nCHANGE OF PURPOSE\nWe will only use your personal data for the purposes for which we collected it, unless we reasonably consider that we need to use it for another reason and that reason is compatible with the original purposes (as set out in this privacy policy). If you wish to get an explanation as to how the processing for the new purpose is compatible with the original purpose, please contact us. If we need to use your personal data for an unrelated purpose, we will notify you and we will explain the legal basis which allows us to do so.\nCHANGES TO THE PRIVACY POLICY\nWe keep our privacy policy under regular review and will notify you of any substantive changes. Any revisions to our privacy policy can be reviewed on this website.\nTHIRD-PARTY LINKS\nThis website may include links to third-party websites, platforms, plug-ins and applications. Clicking on those links or enabling those connections may allow third parties to collect or share data about you. We do not control these third-party websites or platforms and are not responsible for their privacy policies or statements. When you leave our website, we encourage you to read the privacy policy of every website you visit.\nINTERNATIONAL TRANSFERS\nIn order to process your personal data for the purposes outlined in this Privacy Policy, we may need to transfer your data to countries or jurisdictions outside the European Economic Area (EEA). In each case, we ensure that our suppliers provide adequate protection for the rights of data individuals in connection with the transfer of their personal data. Currently, we expect all suppliers to use a standard contractual clause approved by the European Union or be part of the Privacy Shield scheme in the United States.\nDATA SECURITY\nWe have put in place appropriate security measures to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. In addition, we limit access to your personal data to those employees, agents, contractors and other third parties who have a business need to know. They will only process your personal data on our instructions and they are subject to a duty of confidentiality. We will notify you and any applicable regulator of a breach where we are legally required to do so.\nHOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe will only retain your personal data for as long as reasonably necessary to fulfil the purposes we collected it for, including for the purposes of satisfying any legal, regulatory, tax, accounting or reporting requirements. We may retain your personal data for a longer period in the event of a complaint or if we reasonably believe there is a prospect of litigation in respect to our relationship with you.\nTo determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal, regulatory, tax, accounting or other requirements.\nYOUR LEGAL RIGHTS\nAs a data subject, you have a number of rights in relation to your personal data. Below, we have described the various rights that you have, as well as how you can exercise them.\nRIGHTS OF ACCESS\nYou may, at any time, request access to the personal data that we hold which relates to you (you may have heard of this right being described as a “subject access request“).\nWe follow the ICO’s “Subject Access Code of Practice” when dealing with requests for access to personal data. You can read this code by visiting https://ico.org.uk/media/for-organisations/documents/2014223/subject-access-code-of-practice.pdf.\nPlease note that this right entitles you to receive a copy of the personal data that we hold about you in order to enable you to check that it is correct and to ensure that we are processing that personal data lawfully. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to or contain your personal data.\nYou can exercise this right at any time by contacting us at info@jencraft4thurrock.co.uk telling us that you are making a subject access request. You do not have to fill in a specific form to make this kind of request.\nYOUR RIGHTS OF RECTIFICATION AND ERASURE\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (you may have heard of this right described as the “right to be forgotten“).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is right. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase, we will tell you what that reason is at the time we respond to your request.\nYou can exercise this right at any time by contacting us at info@jencraft4thurrock.co.uk telling us that you are making a request to have your personal data rectified or erased and on what basis you are making that request. If you want us to replace inaccurate data with new data, you should tell us what that new data is. You do not have to fill in a specific form to make this kind of request.\nYOUR RIGHT TO RESTRICT PROCESSING\nWhere we process your personal data on the basis of a legitimate interest (see the sections of this privacy policy which explain how and why we use your information), you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data: (a) if you dispute the accuracy of that personal data and want us to verify that data’s accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; or (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nPlease note that if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it. You can exercise this right at any time by contacting us at info@jencraft4thurrock.co.uk and telling us that you are making a request to have us stop processing the relevant aspect of your personal data and describing which of the above conditions you believe is relevant to that request. You do not have to fill in a specific form to make this kind\nYOUR RIGHT TO PORTABILITY\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nBecause of the kind of the nature of our work do and the systems that we use, we do not envisage this right being particularly relevant to the majority of individuals with whom we interact. However, if you wish to transfer your data from us to a third party, we are happy to consider such requests in good faith.\nYour right to stop receiving communications\nAs noted above, where we send you email marketing communications (or other regulated electronic messages) you have the right to opt-out at any time. You can do this by using the ‘unsubscribe’ link that appears in the footer of each communication (or the equivalent mechanism in those communications).\nAlternatively, if for any reason you cannot use those links, or if you would prefer to contact us directly – you can unsubscribe by contacting us at info@jencraft4thurrock.co.uk and telling us which communications you would like us to stop sending you.\nYOUR RIGHT TO OBJECT TO AUTOMATED DECISION MAKING PROFILING\nYou have the right to be informed about the existence of any automated decision making and profiling of your personal data, and where appropriate, be provided with meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing that affects you.\nEXERCISING YOUR RIGHTS\nWhen you write to us making a request to exercise your rights, we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help us to verify your identity. This is a security measure to ensure that personal data is not disclosed to any person who has no right to receive it. We may also contact you to ask you for further information in relation to your request to speed up our response.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be, the faster and more efficiently we can deal with your request. If you do not provide us with sufficient information, then we may delay actioning your request until you have provided us with additional information (and where this is the case, we will tell you).\nYou will not usually have to pay a fee to access your personal data (or to exercise any of the other rights). However, we may charge a reasonable fee if your request is clearly unfounded, repetitive or excessive. Alternatively, we could refuse to comply with your request in these circumstances.\nWe try to respond to all legitimate requests within one (1) month. However, it could take us longer than a month if your request is particularly complex or if you have made a number of requests. In this case, we will notify you of this and keep you updated.\nRIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.\nThe contact details for the ICO are:\nInformation Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\nTelephone: 0303 123 1113\nWebsite: https://ico.org.uk/concerns/\nLast updated: 30/09/2022",
  "https_www_jencraft4thurrock_com/https_www_jencraft4thurrock_com_campaigns/content_2.html": "top of page\nBring back the Tilbury ferry\nThe closure of the Tilbury to Gravesend ferry last year was a huge loss for our area.\nHaving existed in some form for hundreds of years, the ferry was a small but crucial part of local public transport infrastructure, providing a vital link between Thurrock and Gravesham.\nI know how valued the ferry was by local residents. Growing up here, I have many fond memories of using the ferry with family, and I’ve loved taking my own children for day trips across the river.\nAs your MP, I'm determined to bring this service back for our community.\nbottom of page",
  "https_www_jencraft4thurrock_com/https_www_jencraft4thurrock_com/content_1.html": "I'm Jen Craft, I'm your Member of Parliament for Thurrock.\nI was born in Orsett Hospital, I went to Palmer's College, and now I am raising my young family here.\nThis is my home. I understand the feeling of frustration that things are not working as they should be. My mortgage has skyrocketed, I am paying increased council tax, and we don't have enough GPs or dentists.\nAfter 14 years of Conservative government, working people are paying more and getting less.\nOn 4 July 2024, you voted for change, and I am committed to working every day to improve the lives of families in Thurrock. This is my home and I don't shy away from standing up for Thurrock in Parliament.\nI'm not a career politician, as a SEND parent I am used to fighting for what my family needs. I want to bring this fight and commitment to make things better for you, your family, the community and everyone in this country.\nPlease get it touch if you want to speak to me about an issue or if you are looking for help - just click contact me in the menu.\nGet in Touch",
  "https_www_jencraft4thurrock_com/https_www_jencraft4thurrock_com_event-list/content_4.html": "top of page\nAbout Me\nNews\nCampaigns\nEvents\nContact Me\nMore\nUse tab to navigate through the menu items.\nLog In\nHealth Coffee Afternoon - South Ockendon\nFri 28 Mar\nDetails\nHangman's Wood Street Meeting\nThu 27 Mar\nDetails\nbottom of page"
}