{
  "https_www_greenparty_org_uk/https_www_greenparty_org_uk/content_1.html": "Support our campaign to push the Government to do better – much better – to protect and restore nature.\nNature is in crisis. The UK is one of the most nature depleted countries in the world with only half its wildlife left and another 10,000 plants, animals and birds threatened with extinction.\nYet the Government is way off track meeting its own nature targets and as another UN biodiversity summit gets underway, hasn’t even published a strategy to restore nature, something it promised at the last nature summit two years ago.\nWe can get biodiversity thriving again. Our four Green MPs will push Labour to act now to protect and restore our precious environment, boost nature friendly farming and keep fossil fuels in the ground.\nBut they need your help to send a clear message: Nature Action Now.\nWe did it!\nFour Green MPs in Parliament, speaking up for us all and holding the new government to account.\nThis is just the beginning, real hope and real change is coming and you can be part of it.\nJoin us now at the most exciting time in our history.\nLatest News\n- Record high for Green Party after County Council elections After this year’s County Council elections in England, the Green Party has made a net gain of 43 seats, taking their tally to 859 seats on 181 councils. The party held 38 seats, gained 48 and lost just 5. The Greens gained from both the Conservatives and Labour and lost no seats to either. 24… Read more: Record high for Green Party after County Council elections\n- Greens are the positive and progressive antidote to Reform after local election results The Green Party is celebrating another record-breaking year having taken their councillor numbers to a new record high. Greens delivered impressive results in the County Council elections with good gains in places such as Worcestershire, Gloucestershire and Devon while breaking through onto councils for the first time in areas where Reform dominated, including in Staffordshire… Read more: Greens are the positive and progressive antidote to Reform after local election results\n- Greens respond to Runcorn and Helsby by-electionGreen Party co-leader Adrian Ramsay MP said: “This Labour government and Prime Minister Keir Starmer need to do nothing short of a complete reset. “Tonight’s results, not just in Runcorn, show that rather than pandering to Reform, they need to address the genuine concerns of working people by taxing wealth to ensure they can rebuild… Read more: Greens respond to Runcorn and Helsby by-election",
  "https_www_greenparty_org_uk/https_www_greenparty_org_uk_members/content_2.html": "Our members help shape our policy. Not a member? Join today.\nMember Websites\nMembers’ site\nFind out more about being a local party officer, or how to help with our campaigns, at the Members’ Site\nYour Membership\nManage your membership in the Membership Portal\nGovernance\nThe structure of the Green Party of England and Wales is set out in our Constitution, which is approved and regularly reviewed by Conference.\nWe ask all of members to abide by the Party’s Code of Conduct, which is approved and regularly reviewed by Conference. Complaints about members alleged to have breached the Code are dealt with through our complaints process – you can find out more below.\nUsing Social Media for Party Benefit\nSocial media has the potential to be a powerfully democratising force, allowing party activists to share party policies and positions without needing access to formal media. The Green Party has a wonderful, diverse community of social media users who have built our profile and credibility with great skill in recent years.\nHowever, the style and tone of communication on social media is not always consistent with Green values and, while we’re all bound to make the odd mistake, we all need to be careful that we uphold the highest standards.\nIt is also important to remember that social media is public communication, so a good working rule is to never share something that you wouldn’t be comfortable seeing printed above your name in a newspaper or on a poster.\nSome of the people who see your posts may not have heard much about the Green Party or rarely hear our perspective – their online interaction with you as a green party member may shape their view of the Green Party for years to come. Be mindful of this.\nIt is important that we do take on our critics and detractors on social media, but it is also important to know when you are being deliberately provoked, having your time wasted, or being tempted to fall below our party’s high standards. So online spats should be treated with caution.\nSocial media is not an ideal space to criticise party structure or other party members. Whenever you criticise our party or its officers you are giving aid to our opponents.\nThere are internal routes for raises issues of concern and we need to ensure that these are strengthened to allow people to have the robust but respectful disagreements that are essential to a democratic party but without washing dirty linen in public.\nAs a local party, you are responsible for the content of your party’s Twitter feed so please do make sure that whoever sends the tweets is communicating with the support of the whole local party.\nCriticisms of the party’s staff are rare to the point of non-existence. This is good to know because such criticisms breach the party’s duty of care towards those staff and could result in could result in claims against the party being taken to an employment tribunal.\nGPEx, March 2021\nMembers Code of Conduct\nThe Members Code of Conduct is an organisational document that is binding on all members of the Green Party of England and Wales (‘the Green Party’). It forms part of the national disciplinary framework that applies to all Green Party members, as set out in the Green Party of England and Wales Constitution and Standing Orders for Party Discipline.\nSafeguarding Policy\nOur Safeguarding Policy was adopted by the Green Party Executive in March 2019. It is subject to regular review, based on best practice.\nHelp Govern the Green Party\nThe party is always looking to make the most of its members’ skills and experience – and willingness to pitch in to help with the many tasks that need doing to keep things moving onwards and upwards.\nThe party is always looking to make the most of its members’ skills and experience – and willingness to pitch in to help with the many tasks that need doing to keep things moving onwards and upwards.\nWelcome to this new section of the member’s website which lists vacancies in Green Party Governance bodies, and sets out wider volunteering opportunities.\nNo national opportunities at present – please contact your local party.\nComplaints Procedure\nFind out how to address a dispute or complaint here.\nMember Speaking Out (Raising Concerns) Procedure\nThe procedure Green Party members can follow to Speak Out (raise concerns) within the party can be found here.\nStaff Whistleblowing (Raising Concerns) Policy\nThe Green Party is committed to encouraging a climate of openness and dialogue endorsed by positive working relationships between management and employees. The Party promotes an environment where employees feel able to raise concerns which are in the public interest in a responsible way without fear of victimisation.\nRead more here.\nFramework for Ethics and Conduct\nThis Framework has been created to draw together key advice, guidance and constitutional documents for ease of reference for members following a motion to Conference in Autumn 2019.\nRead more here."
}