{
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_10_31_3/content_48.html": "Strategy for the next Euro-election: Green New Deal (1)\nThere need be no secret about what must be at the core of the next European election campaign for the Green Party; it is the same as the central plank of the 2009 campaign: the Green New Deal.\nBased on an argument produced with the New Economics Foundation the Green New Deal argues for a Keynsian programme of public spending on a range of measures designed to green the economy, reduce our environmental impact, and along the way create jobs and reduce inequality. The Defence Secretary Philip Hammond recognises the value of such public spending, noting the creation of jobs (mostly American) involved in a new Trident programme. What any Green will argue is that the £100 billion Trident will cost could be applied to producing more jobs, and jobs directed to a more useful ends.\nThe Green candidate for the Presidency in the US, Jill Stein, is campaigning on a Green New Deal that as well as seeking to mend the lack of commitment to democracy in the country, and economic, employment, and fiscal policies aimed at curbing the power of big companies, the banks, and ‘the market’, includes a programme of employment built on Green jobs. This policy argues that 16 million jobs can be created in areas familiar to all of us: sustainable energy, energy efficiency retrofitting, mass transit, urban areas adapted for people, locally sourced agricultural production, organic farming and clean manufacturing.\nThis last an interesting point, nesting with the need for regulation, and the argument that regulation, and high standards, create jobs in manufacturing, fitting and maintenance of equipment; as well as inspection and enforcement; requiring companies to spend rather than distribute money to shareholders, with narrower profit margins exerting a downward pressure on prices.\n31\nOct\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_feed/content_35.html": null,
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_category_uncategorized_page_2/content_39.html": "On Wednesday I am to speak, all being well, at the meeting of the World Development Movement in Leeds. The focus is on my visit to Benin in October last year, and in particular on the farming education project at Songhai in Porto Novo.\nI have spoken on this a number of times – to a joint GP/RS meeting at Leeds Met, to the AGM of Leeds Development Education Centre, to a Geographical Association meeting at Threshfield, to a TEESNET meeting in London, and a range of other venues.\nI was in Benin as part of the UK delegation to a joint meeting on Development Education with teachers from Brazil, Austria, Czech Republic, Benin and the UK.\nThere are various problems relating to farming in Benin. One of the specific problems in Benin was the recognition that young people were moving from the villages to the city because of low farm incomes. Songhai was set up partly to deal with this, and a major aspect is agricultural training. Young people spend 18 months at the centre, including time on a model farm that shows how the Songhai model can be adapted to circumstances in the villages, before going back to the village.\nFor all developing countries there are issues relating to the importation of farming techniques and species that are not native in either the biological or cultural sense – Songhai uses local techniques and varieties.\nLocal agriculture also suffers from the structure of the industry with raw materials being exported, and the value added through processing overseas, and the marketing being non-native. Songhai is set up to process and sell its own production, keeping the value added in the country.\nSonghai is an integrated system – plant waste is fed to animals, goes to compost, or goes to bio-energy; animal waste goes to compost, bio-energy, or fish food; fish waste goes to irrigation and bio-energy. In energy terms there is some growing of jatropha for fuel, and this is used on site, extensive use of solar, and experimental use of wind; they expect to be energy self-sufficient by 2014.\nAnother example of how Songhai works that I have used with students relates to brick production. The site has clay, and this is dug from shallow pits. The pits are not left, but are used for growing wet rice, partly irrigated by water from the fish farming. The clay is fired in a kiln built on site, and fuelled with wood grown on site.\nA local animal, the agouti was highly prized for bush meat, like a large beaver or rabbit they live on elephant grass, grown on site. Songhai got hold of three females and a male, and they bred like, well, rabbits. Only by constant sales can the population be kept at 300. The meat sales are a major income stream.\nOne unexplained link was between the animal waste and the fish. The manure is put in a shed in metre square boxes; flies land on these, lay eggs. The maggots are harvested and fed to the fish. The feature of the maggot shed that is perhaps a shining example of the Songhai idea is that it is surrounded by a moat with fish in. These fish will eat any maggots that wriggle out; they eat anything trying to get in and eat the maggots, and then are harvested themselves.\nOne comparison to Samso in Denmark is that soya is grown, squeezed for oil, and then the protein rich cake used for animal and plant food – again all the value is retained in the system.\nThe Power Point is one that I use in talking about Songhai, and will use tomorrow.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_06/content_11.html": "In my readings on EU law I had several times come across the case of Costa v ENEL as being one of the cases that confirmed the superiority of EU over national law, and when details were given that the issue was concerned with the nationalisation by the Italian government of the electricity supply industry. I was not however clear about whether the case decided that states could not nationalise industries.\nSo I went to the case, helpfully available on eur-lex.europa.eu. The bill in dispute was for 1925 lire – so clearly a matter of principle. This did not reach a decsion on the issue of nationalisation although this was discussed. More help came from a more recent report from the Centre for European Policy Studies (aei.pitt.edu/15173/1/Task_Force_Report_on_Bank_State_Aid.pdf) which on p.9 notes “nationalisation itself is not a form of state aid – the EU Treaty itself is neutral with regard to the form of ownership”.\nI was looking because of the banks of course, including the serial offender Royal Bank of Scotland. RBoS received, in two slices state aid amounting to £45.5 billion – the price of a useless weapons system if you wanted one – and the state ended up owning 84% of the company. What are the governance rules? The biggest figure in France was E2.45 billion for Caisse d’Epargne.\nThe report led on to other observations, in particular of the huge proportion of GDP this country has dedicated to the banks, especially in comparison with other economic units:\nIn 2007: Eurozone: 3% US: 0 UK: 5%\nIn 2008: Eurozone: 28% US: 57% UK: 58%\nIn 2009: Eurozone: 28% US: 48% UK: 74%\nIn 2009 three quarters of the national earnings went to support the banks.\nAnd now there are rafts of activities – personal insurance, small company insurance, LIBOR rates- that along with the financial instruments that created no real wealth, and the issues of bonuses highlight again the moral bankruptcy of the banks. The solution must lie in governance, and part of that solution must lie in ownership and oversight by people outside the financial system – the citizens of the state, or the members of a mutual: nationalisation or mutualisation.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_02_03_green-candidate-for-morley-outwood/content_2.html": "Last night at the hustings of Leeds and Wakefield Green Party I was adopted as the parliamentary candidate for the Morley & Outwood constituency, a mixture of a small market town and a group of former pit villages. Of course, the Green party is not wealthy, and my standing depends on raising the deposit and other campaign costs.\nMy local links I will come to later, they are historical more than anything else, but with a surname like Hemingway connections to the area west of Wakefield and south of Leeds can be assumed.\nI come to the campaign with a lot of political experience. I worked on my first campaign when I was 16, and then on many other unsuccessful campaigns for the Labour Party before coming back to my family roots in Leeds at the end of 1985. In 1990 I was elected as Labour councillor for the old Whinmoor ward, and served three terms before standing down in 2002.\nI got a lot done while a Labour councillor, felt that I contributed as a ward and City councillor, but much that I did would be considered Green. I served on the Housing, Highways and Environment committees through my whole term. I was Deputy Chair, and for a time Chair, of West Yorkshire Waste Management – meeting that took me to Wakefield regularly (and to Stanley), and successfully persuaded the Leeds Labour Group then not to incinerate waste or allow Leeds waste to be incinerated. I was chair nationally of UK Nuclear Free Local Authorities, campaigning vigorously and widely. Of course many other things beside – and there may be time for a catalogue later.\nBut during the last term as a councillor the Labour party moved away from me. I had been worried by the election of Blair, shocked at the announcement they would stick with Tory policies including PFI, and in despair when they stuck to this. I could not defend the policies of New Labour (and I do know about SureStart .. but what else?), and left the Council, left the Party, and joined the Greens.\nWhy? Because the policies of the Green Party are close to those that made me join Labour, are close to the policies on which the welfare state, social housing, full employment, increasing equality were built during the fifties, sixties and seventies before Conservatives, New Labour and the Coalition took their axes to a consensus that worked for almost everyone – but not the rich, not the big companies.\nSince then I have carried on the politics working locally, regionally and nationally in the Green Party; standing as a local election candidate, as a Parliamentary candidate twice (in Leeds North-West), and twice in the European elections, almost getting elected as an MEP as lead candidate in 2009.\nThe 2015 general election offers a single choice – four parties in the neo-liberal market economy camp in a centralised state – Conservative, Labour, Liberal-Democrat and UKIP, all agreeing on austerity, only over the speed at which they are going to make life richer for the rich and more miserable for those at the bottom; and the alternative – the Greens – proposing a more Keynsian solution with public spending building houses, improving energy efficiency, developing infrastructure, rescuing the Health service and providing jobs at a living wage. And yes, the rich and the big companies will pay for it by being made to pay their taxes (and a bit more). And against the centralised state, powers devolved to the lowest level possible, with the power to raise money locally, and above all the power over how to spend locally both this money and the wealth redistributed across the country.\nIn today’s Green Party Manifesto, the Party says it would collect £25 billion a year through a wealth tax starting at £3 million. In France the wealth tax starts with personal fortunes of just £800,000. Yet it brings in only £4 billion per year. Why the difference between here and there ?\nAlso, the estimated tax revenue from the abolition of tax relief on loan interest paid by private landlords appears to assume that the number of such landlords will stay the same (or even go up!). But faced with much higher levels of taxation, most such landlords will simply sell up, pay off their mortgages and invest in something else.\nDear John\nit is a long time since I have visited my blog page, and can I begin by apologising for the long delay in replying to your question of the 14th April last year.\nIn relation to the first point the party member and group responsible for the tax calculation will have used a relevant formula for the calculation. If you would still like an answer I will try and find out. The two most obvious factors that might explain the difference would be to do with the number or net worth of individuals falling in the particular bracket, or the level at which the wealth tax was to be set.\nOn the second the main argument for the abolition of tax relief on buy to let mortgages was the decision not to subsidise a group of people making a personal income in a way that was not seen as socially desirable. Again, as to the calculation, I would need to ask, but I would like to think that there was some substance in your comment – if the change meant a fall in property prices and a transfer back of housing from private landlords to owner-occupiers, an admittedly unlikely scenario. There was considerable discussion of the proposal at conference and one view voiced by those working in the sector was that ‘the banks would never allow it’ presumably because of the level of risk they would then be exposed to – possibly accurate, but the banks were not regarded with a lot of sympathy at the time of that debate.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_04_13_withdrawal-from-the-eu/content_6.html": "Withdrawal from the EU linked to reducing immigration from the EU under the ‘freedom of movement’ rules is central to the UKIP offer in this election. The Conservatives out of fear have embraced it and talk of renegotiation.\nThe first question is: Is the EU likely to agree to reform of the treaty terms on “freedom of movement of people”?\nTo which the answer is No. The freedoms established by the various Treaties that underpin the EU are almost not going to be negotiable – they are central tenets of the Treaty. Cameron will not be able to negotiate them away.\nThe second question is: Can the UK leave the EU but take EEA (associate) status like Norway or Switzerland and no longer have to permit “freedom of movement of people”?\nAgain the answer is No. In early 2014 Switzerland voted to limit the freedom of movement of people from Croatia the most recent accession state, and immediately lost the right to access EU education and research funds, and would go on to lose more. It is a central tenet of the Treaty, and EEA states are bound by the same rules as those in the EU, they just have no say n making the rules. Switzerland is busy rescinding the vote. It is important to ask – why do these two wealthy countries see it as in their economic interest to maintain these close links with the EU?\nThe third question: Is the only way to lose the requirements on “freedom of movement of people” complete separation from the EU?\nAnd here we get a Yes. This would give the UK the same status in relation to the EU as for example Botswana, one of the Commonwealth states UKIP will build links with. The UKIP suggestion that the UK could negotiate separate treaties with individual EU states would not help since these would be reciprocal, and a right of residence for the 1 million UK citizens in Spain might be linked to freedom of movement of people, and access to fishing grounds\nQuestion four takes us into the ground that UKIP does not publicise: If the UK left completely what would be the day to day consequences on ordinary UK citizens?\nThe answers here are crucial, we cannot leave the EU and retain the privileges of membership:\n- Visitors arriving at ports and airports would face border checks to cover purpose of visit, intention to return and level of income\n- Visitors would need to go through the non-EU visitors queue at airports, the current wait at Charles-de-Gaulle in Paris is one to two hours – and that is without thousands of Britons in the queue. The same at Barcelona, Palma, Rome..\n- Non EU citizens can only spend 90 days in any 180 in the Schengen zone, so there will be no long winter breaks in the Canaries.\n- If we bring in visa requirements for citizens of one EU country eg Bulgaria, the whole of the EU would require visas for UK citizens. If they wanted to be bloody minded they could make us queue at embassies and consulates or apply weeks in advance\n- Long term residents, would cease to be that. If staying more than five years they would have to apply for ‘long term resident status’ which might have requirements such as speaking the language. UK citizens with no right to remain would be expelled and could be detained for 6 months to ‘facilitate’this\n- Different rules on property sales may apply to non-EU citizens affecting property values\n- Pensioners would lose upgrading of UK pensions (UK pension law)\n- The rules on joining family members in the EU would be restrictive\n- Those seeking work in the EU would need a ‘Blue Card’ or be an ‘intra-corporate transferee’ subject to more demanding rules\n- Students would not get equal treatment on tuition fees, would have limited rights to work during study, and no right to stay on completion\nAnd then of course question 5: If the UK left completely what might be the economic consequences?\nThe UK is a major trading partner of the EU but this is in part because we are in the EU. Some firms assemble here to get round rules on access to the EU market in a country with low wages and limited workers rights. Financial institutions have indicated they would not stay, and while we might feel quite happy to say good riddance to the lot of them, it might not be the best solution. It will take years and cost billions to pay for such things as establishing new border controls and re-issuing passports. Establishing a ‘hard border’ between Eire and Northern Ireland, may well have consequences for the current political settlement there.\nAnd then of course we need to be clear about what the Green Party would do, especially since it dislikes the whole business orientation of the EU, while welcoming its internationalism?\nThe focus needs to be on addressing the concerns of those who feel that there is a strong negative impact of EU migrants on costs, jobs and housing in the UK (no matter how inaccurate those perceptions)\nFrance limits benefits and access to free healthcare to those who have paid into the national system for a certain time, but allows access to those who can demonstrate they have access to the relevant financial resources. Each country can establish its own rules, I would not suggest that we should be less welcoming, but the option is there.\nIf we are short of houses we must build – create jobs, generate taxes.\nIf we are short of jobs then Keynsian economic policies – Building to create jobs – the Green New Deal and one million jobs – reinstating the NHS – building sustainable transport (not HS2) are in our policies and central to our campaign.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2015_04_21_another-question-for-ukip/content_59.html": "A moral conundrum. UKIP want a points based system for immigrants that would allow us to poach doctors, nurses and other medical staff from developing countries, but they want to reduce overseas aid to the minimum to make replacement more difficult. Not something they are interested in resolving.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_tag_incineration-plants/content_17.html": "I spent some time while a Leeds City councillor as Chair or Deputy\nChair of West Yorkshire Waste Management, Deputy Chair of Leeds\nEnvironment Committee, and chair of Save Waste and Prosper; I also\npersuaded the Labour group at the time to oppose a Leeds incinerator,\nand the incineration of Leeds waste.\nThere are a range of issues to factor in.\nLandfill sites in West Yorkshire were well engineered, with leachate\ncollection (and the incineration of this). We adopted a policy that\nwe would not take low level nuclear waste, but probably could have\ndone. New sites were fitted with pipe systems to collect methane and\ncarry it to small scale generation plants, or for compression to LPG –\nthat was then used in waste collection vehicles. Living near landfill\nsites is obviously unpleasant, and the legacy of old sites had also to\nbe dealt with, but it must be noted that Yorkshire had and has many\nsuitable quarry sites that could still provide extensive capacity.\nLandfill is being ‘costed’ out through landfill taxes that apply not\nonly to waste, but to the materials (clay liner etc – that came\npredominanly from coal mining) used in site construction, and that are\ndesigned to favour large incineration plants.\nFeedstock is a contractual duty placed on the local authority/ies\nfeeding the plant. In a time of falling waste generation, then the\nimpact will be on recycling (and the operators want the high calorific\nvalue plastic and paper waste). Fines for failing to provide\nfeedstock are added to other contract costs, and the contracts are too\nlong term to be able to predict future patterns of arisings/recycling\nrates. Even in the 1990’s the Isle of Wight was faced with having to\nbuy back the paper it had sent for recycling in order to fulfill its\nincineration contract.\nAlthough rebranded as ‘Energy from Waste’ plants, this only even\nbegins to become an argument when the plant operates as a Combined\nHeat and Power plant feeding hotwater directly to local housing and\nindustrial developments. Burning produces bottom ash, the mineral\nresidue, of which a proportion is toxic. This cannot of course be\nidentified, hence the problem in Newcastle that Andy refers to in its\nuse on allotments, and which would argue for caution in its use in\nbuilding materials etc (do we want our nursery schools built with\ncinder blocks containing bottom ash?). Fly ash is collected in the\nchimneys and contains much more toxic material. This has to be\ndisposed to landfill not as waste, but as special waste at a much\nhigher cost per tonne because of the risk involved. And then there is\nwhat comes out of the chimney. Candy refers to money saving, and we\nknow (from SO2 spikes recorded in Leeds when the wind was in the wrong\ndirection) that the FGDS equipment at the east yorkshire conventional\npower plants was switched off when the price was low. There is no\nreason to suppose that waste incinerator operators will be any less\naware of this. There is a fall out of toxins around incinerator\nplants (first studied around crematoria in New England), as well as\nescape of fine particulates that are increasingly implicated in\nrespiratory disease.\nFinally there is the impact on alternative, and often small scale\ntechniques (the ones that large firms cannot generate large profits\nfrom). Bournemouth has pioneered anaerobic techniques on a medium\nscale; West Yorkshire has composting; Leeds has not only got a large\nrange of materials in its recycling, but has been actively exploring\nthe market for types of plastic not currently recycled. That is\nwthout waste minimisation, home-composting etc.\nPlenty of reasons to oppose incineration – what was the argument in favour?",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2018_02/content_41.html": "I bought second hand a copy of Dick Lehr & Gerard O’Neill ‘Black Mass: Whitey Bulger. the FBI and a devil’s deal’, a 2015 reprint of their 2000 original edition.\nThe account of the two sides getting drawn into one another, becoming co-dependent was interesting enough. Since two of those concerned were criminals they cannot be considered to be at fault in the relationship, it was just part of their career development. Fault lies with the law-enforcers failing through vanity and cowardice.\nI noted one passage however.\nThe younger brother of the criminal Jimmy ‘Whitey’ Bulger was the politician Billy Bulger, a Massachusetts state senator and for a long time president of the State Senate.\nOn p.82 the authors note:\n“In a number of highly publicized disputes Billy Bulger’s reputation as a vindictive autocrat was cemented. In one, Billy became enraged when a Boston housing judge refused to fill a clerkship with his hand-picked choice. The judge lashed out against Bulger’s raw patronage move by calling Bulger a “corrupt midget”. Payback came through legislation that cut the judge’s pay, reduced the size of his staff, and ended the court’s independent status by having it folded into another branch of the judiciary”\nA quick search shows the Boston Housing Court still exists, primarily dealing with evictions, with a Justice and Associate Justice.\nWhat seems completely strange is the idea that through legislation at the state level the judiciary can have its independence attacked – in particular the setting of the salary of judges has to be independent of the other powers to protect judicial independence.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_04_21_ukips-budget-something-is-missing/content_19.html": "I have been to a couple of hustings with different UKIP candidates and they have begun with identical little speeches about leaving the EU and having a budget that has been externally assessed and works.\nBut billions are missing in costs not covered by savings (mainly from leaving the EU), the thing they rabbit on about doing in their budgeting. I have scanned their manifesto, and can find nothing\nAnd that is border controls.\nBillions will be needed to reintroduce the border controls that will be required if we leave the EU, and to re-issue passports (and how complicated will that be, and how many staff will be needed – nothing wrong with creating employment though).\nMost expensive, the creation of a ‘hard border’ between the Irish Republic and Northern Ireland. Here another problem arises – the one of unpredicted consequences so familiar from our various adventures in the Middle East and North Africa: what will be the effect on the settlement reached in Northern Ireland following the Good Friday agreement, and what will be the increased policing costs of any return to the antagonisms that dominated in the period before the agreement.\nReally, UKIP, we should be told?\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2012_11_03_green-new-deal-2/content_51.html": "Green New Deal (2)\nThe EU has just agreed an Energy Efficiency Directive (EED) that is much weaker than the EU Parliament and NGO’s had campaigned for. If implemented it is likely to bring energy savings of only 15% by 2020, and there are no legally binding overall national targets. Member states are asked to adopt voluntary targets and these will be reviewed in 2014 in terms of progress towards the overall target. The 3% annual renovation rate for public buildings has been limited to just central government buildings, and provisions on public procurement, CHP generation and industrial audits are just voluntary.\nThe biggest positive, and this links directly to the GND, is the requirement that member states prepare long term ‘renovation roadmaps’ for their entire building stock. As a Party we need to work towards ensuring that the voluntary proposals to be reviewed in 2014 are on track to deliver the full 20% saving by 2020; and that active steps are taken towards the preparation of the ‘renovation roadmap’ for the UK building stock.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_10/content_13.html": "Strategy for the next Euro-election: Green New Deal (1)\nThere need be no secret about what must be at the core of the next European election campaign for the Green Party; it is the same as the central plank of the 2009 campaign: the Green New Deal.\nBased on an argument produced with the New Economics Foundation the Green New Deal argues for a Keynsian programme of public spending on a range of measures designed to green the economy, reduce our environmental impact, and along the way create jobs and reduce inequality. The Defence Secretary Philip Hammond recognises the value of such public spending, noting the creation of jobs (mostly American) involved in a new Trident programme. What any Green will argue is that the £100 billion Trident will cost could be applied to producing more jobs, and jobs directed to a more useful ends.\nThe Green candidate for the Presidency in the US, Jill Stein, is campaigning on a Green New Deal that as well as seeking to mend the lack of commitment to democracy in the country, and economic, employment, and fiscal policies aimed at curbing the power of big companies, the banks, and ‘the market’, includes a programme of employment built on Green jobs. This policy argues that 16 million jobs can be created in areas familiar to all of us: sustainable energy, energy efficiency retrofitting, mass transit, urban areas adapted for people, locally sourced agricultural production, organic farming and clean manufacturing.\nThis last an interesting point, nesting with the need for regulation, and the argument that regulation, and high standards, create jobs in manufacturing, fitting and maintenance of equipment; as well as inspection and enforcement; requiring companies to spend rather than distribute money to shareholders, with narrower profit margins exerting a downward pressure on prices.\nincineration\n21 OctI spent some time while a Leeds City councillor as Chair or Deputy\nChair of West Yorkshire Waste Management, Deputy Chair of Leeds\nEnvironment Committee, and chair of Save Waste and Prosper; I also\npersuaded the Labour group at the time to oppose a Leeds incinerator,\nand the incineration of Leeds waste.\nThere are a range of issues to factor in.\nLandfill sites in West Yorkshire were well engineered, with leachate\ncollection (and the incineration of this). We adopted a policy that\nwe would not take low level nuclear waste, but probably could have\ndone. New sites were fitted with pipe systems to collect methane and\ncarry it to small scale generation plants, or for compression to LPG –\nthat was then used in waste collection vehicles. Living near landfill\nsites is obviously unpleasant, and the legacy of old sites had also to\nbe dealt with, but it must be noted that Yorkshire had and has many\nsuitable quarry sites that could still provide extensive capacity.\nLandfill is being ‘costed’ out through landfill taxes that apply not\nonly to waste, but to the materials (clay liner etc – that came\npredominanly from coal mining) used in site construction, and that are\ndesigned to favour large incineration plants.\nFeedstock is a contractual duty placed on the local authority/ies\nfeeding the plant. In a time of falling waste generation, then the\nimpact will be on recycling (and the operators want the high calorific\nvalue plastic and paper waste). Fines for failing to provide\nfeedstock are added to other contract costs, and the contracts are too\nlong term to be able to predict future patterns of arisings/recycling\nrates. Even in the 1990’s the Isle of Wight was faced with having to\nbuy back the paper it had sent for recycling in order to fulfill its\nincineration contract.\nAlthough rebranded as ‘Energy from Waste’ plants, this only even\nbegins to become an argument when the plant operates as a Combined\nHeat and Power plant feeding hotwater directly to local housing and\nindustrial developments. Burning produces bottom ash, the mineral\nresidue, of which a proportion is toxic. This cannot of course be\nidentified, hence the problem in Newcastle that Andy refers to in its\nuse on allotments, and which would argue for caution in its use in\nbuilding materials etc (do we want our nursery schools built with\ncinder blocks containing bottom ash?). Fly ash is collected in the\nchimneys and contains much more toxic material. This has to be\ndisposed to landfill not as waste, but as special waste at a much\nhigher cost per tonne because of the risk involved. And then there is\nwhat comes out of the chimney. Candy refers to money saving, and we\nknow (from SO2 spikes recorded in Leeds when the wind was in the wrong\ndirection) that the FGDS equipment at the east yorkshire conventional\npower plants was switched off when the price was low. There is no\nreason to suppose that waste incinerator operators will be any less\naware of this. There is a fall out of toxins around incinerator\nplants (first studied around crematoria in New England), as well as\nescape of fine particulates that are increasingly implicated in\nrespiratory disease.\nFinally there is the impact on alternative, and often small scale\ntechniques (the ones that large firms cannot generate large profits\nfrom). Bournemouth has pioneered anaerobic techniques on a medium\nscale; West Yorkshire has composting; Leeds has not only got a large\nrange of materials in its recycling, but has been actively exploring\nthe market for types of plastic not currently recycled. That is\nwthout waste minimisation, home-composting etc.\nPlenty of reasons to oppose incineration – what was the argument in favour?\nMenwith Hill\n5 OctThere has been a local debate in Harrogate, in particular in the Harrogate Advertiser about a proposal for wind turbines close to the Menwith Hill site. My original letter, published on the 21st September read:\nDear Madam\nYou ask ‘wind turbines or radomes’ (HA 13.09.12). Let us first ignore the political drawing of the boundary of the Nidderdale AONB to put Menwith Hill outside and ask about the choice in terms of both climate change and civil liberties.\nThis week has seen the Arctic ice cover shrink to its smallest, and thinnest for thousands of years, at the same time the much more significant ice sheets in Greenland and North America have seen thinning and shrinkage beyond predictions. National energy policy is, inexplicably, moving from renewables to the search for more fossil fuels, both in the areas exposed by ice shrinkage, as well as from the rocks under our feet through ‘fracking’. Developments that will only make the climate problem worse.\nWind turbines are not a complete solution, but in a renewable energy mix they are part of the solution. There are a few sites perhaps where the visual impact might need to be taken into account, but wind turbines have a positive contribution to make. The American base at Menwith Hill does not have positives, unless you want your personal and business communications intercepted and passed to American business competitors, or to be part of a pointless and dangerous Star Wars weapon system.\nIt is not only the visual impact that needs to be asked, but what is the point of the intrusion – is it designed to do good, or do ill. Wind turbines every time.\nYours sincerely\nMartin Hemingway (Dr)\nFormer Chair\nLCC Menwith Hill Forum\nTHere was of course a lot of response, and I have today sent of a reply to some of thes, thet will I hope be published on the 11th:\nDear Editor\nMr Harrison (Letters 27th September 2012) very kindly refers to me by my title. It is because my doctoral research covered the Ice Age that I have a very keen awareness of the constancy of climate change. The focus of that work, on the maximum of the last Ice Age 17 000 years ago shows a human population excluded from northern Europe and hunting reindeer on the Mediterranean coast. This is a climate shift that our current population could not cope with, but luckily it looks as though the present interglacial will be a long one. What my understanding also makes clear is the huge difference between the current shift, linked to human production of greenhouse gases, from any other over the last few million years, this a change that the current population will have to cope with – and soon.\nMr Harrison and Mr McIntosh (Letters 4th October 2012) are exercised about the potential contribution of renewables in the future energy mix, and Mr McIntosh wants to focus on centralised production. A renewable mix is of most value in rural areas, and we need only look to the island of Samso in Denmark for an example of a rural community that now produces 140% of its electricity and heating from renewables – exporting the rest to the grid. This is effective decentralisation in a climate similar to ours, although less blessed with wind. Centralised – until large scale tidal comes on stream – means fossil fuels or nuclear, the latter touted as carbon neutral, although life cycle analysis call this into question. Nuclear has its own risks, and a report, also published on the 4th October, by the EU, highlights the lack of containment at some UK reactors – but it also cannot operate without a massive subsidy from the customer paid through their bills. Mr Harrison raises the question of a subsidy for renewable energy, but he, as well as the rest of us, has spent many years paying a subsidy to the nuclear industry .\nHe is also concerned about how many local jobs will come from the turbines. This allows a neat segue into the second strand of this correspondence. How many local jobs does Menwith provide, and what is its value to the local economy. A recent report on Menwith Hill by Steve Schofield ‘Lifting the lid on Menwith Hill’ presented at a meeting earlier this year in Harrogate has attempted to assess this. What was clear from Dr Schofield is that the pay of the Americans touted as an economic benefit is spent on the base on goods imported from the USA, or repatriated as savings. All recent large contracts have gone to UK firms based south of Birmingham; the hugely valuable electronic work is only available to Americans; the economic contribution is minor.\nMr Harrison also accuses me of paranoia over the functions of Menwith Hill. The role in Star Wars has been highlighted by the Americans themselves, and the role in the interception of communications of the Echelon system demonstrated over 1o years ago in the EU report presented in Harrogate by David Bowe, then an MEP. This shows that knowledge by US firms of contract details allowed them to win contracts worth tens of billions over European rivals – that is the economic value or rather ‘cost’!\nYours sincerely\nMartin Hemingway (Dr)\n(Green Party and former chair\nLCC Menwith Hill Forum)\n15 St Chads Drive\nLeeds",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_04_13_gildersome-baptist-church-yesterday/content_10.html": "I received, together with the other candidates, an invitation from David Newton at the church to provide a text – less than a side of A4 about the issues christian voters should be thinking about before they vote. Not a group that I know much about, but I offered to go along, read out my own sheet – so as not to take an unfair advantage over the other candidates – and be there to talk afterwards to anyone who wanted to talk. They came up with the issues of interest to them, and as we know from the responses to electoral matching sites such as VotesMatter2015 and Political Compass, they were rather more Green than anything else.\nThe UKIP candidate had sent a text (one and a half sides) on EU withdrawal with a couple of populist add-ons, and the Tory is attending next week.\nHere is the text that I read:\nI would like to thank David for setting the challenge of writing down a piece about ourselves and politics and the ‘christian voter’ – although I am addressing all types of voter.\nI am not suggesting it plays a part in your services but I want to start with primal scream therapy – not to have each or all of us screaming out – but because of the primal scream that lies at the root of all political activity; the primal scream of the small child without a sweet: “It’s not fair”. This is the well spring of political activity, identifying what is fair and deciding what we think is the way of putting it right – the therapy that is needed.\nWho is it we are to be fair to. The answer is easy – everybody. Not just the everybody that we can find outside in Gildersome, or Morley, or Leeds, or Yorkshire, or the rest of the world; but also the everybody that is to come; and – as an archaeologist you might expect this from me – everyone who has been and what they have to teach us about suffering and maybe joy, and most importantly why we are where we are.\nWhat do we mean by fairness, and what do we need to do. We need to be fair to the past –Baptists can bear witness to the unfairness of the establishment. Unfairness that led to the struggle for freedom, liberty of belief, of expression, of the individual. This is a central pillar of Green thinking: that we should allow people to do what they want so long as it does not harm others\nWe must also be aware of what that struggle produced in the end: employment rights, council housing, the Health Service, support for the most vulnerable, access to legal protection. We must be fair to the present. Things that we must protect, and that can be summarised as ‘Justice for all’. These are issues that should be addressed as you prepare your vote together with the means of protecting them –\nhow we run the economy, spending to Build as the Greens would advocate, or austerity with its food banks, its soup kitchens, and its despair;\nhow we raise the money for the things we want: taxes that ensure the wealthy pay for the fairer society we all want, particularly those that have inherited, or ‘fin’agled’ their wealth – an end to tax dodging, through a Tax Dodging Bill, whether we call it avoidance or evasion\nhow we approach the rest of the world: working to resolve the causes of conflict, over land, water, food, rather than by building bigger armies to deal with the conflicts or threaten them with weapons of mass immorality.\nAnd we must be fair to the future. The Hemingway name can be traced 600 years back in this area, I want it to be traced 600 years forward as well. And to do this we need to address the issues that affect that future: what we eat and drink, the air we breathe; biodiversity; energy extraction; global warming – the issues Greens have always been identified with by others, but which we have always defined as part of justice and fairness for all.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2018_09/content_14.html": "It may be that the President of the United States is not being kept away from things, but The Hill (thehill.com/homenews/morning-report ) reports this morning on the days schedule for President and Vice President.\nIt may of course be good delegation by a mighty business leader…\nThe president holds a reelection rally in Las Vegas at 10 p.m. ET.\nVice President Pence is juggling a packed schedule. This morning, he participates in “A Seat at the Table: Persecuted Church Summit,” in the White House Indian Treaty Room. The vice president and Karen Pence later present a flag to the Korean War Veterans Memorial Foundation at 11:20 a.m., complete with his remarks. (The vice president will present an American flag used during the honorable carry ceremony at Joint Base Pearl Harbor-Hickam in Hawaii on Aug. 1, which paid tribute to U.S. soldiers killed during the Korean War.) At lunch, Pence headlines a political gathering to benefit the National Republican Senatorial Committee. At 1:30 p.m., the Pences participate in a conference of Women Mayors of America in the Eisenhower Executive Office Building next to the White House. Shortly after, the vice president meets with Prime Minister Zoran Zaev of Macedonia in the Roosevelt Room, and later speaks by phone with Lenín Moreno, president of Ecuador.\nor not…",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2012_06_30_hello-world/content_57.html": "In my readings on EU law I had several times come across the case of Costa v ENEL as being one of the cases that confirmed the superiority of EU over national law, and when details were given that the issue was concerned with the nationalisation by the Italian government of the electricity supply industry. I was not however clear about whether the case decided that states could not nationalise industries.\nSo I went to the case, helpfully available on eur-lex.europa.eu. The bill in dispute was for 1925 lire – so clearly a matter of principle. This did not reach a decsion on the issue of nationalisation although this was discussed. More help came from a more recent report from the Centre for European Policy Studies (aei.pitt.edu/15173/1/Task_Force_Report_on_Bank_State_Aid.pdf) which on p.9 notes “nationalisation itself is not a form of state aid – the EU Treaty itself is neutral with regard to the form of ownership”.\nI was looking because of the banks of course, including the serial offender Royal Bank of Scotland. RBoS received, in two slices state aid amounting to £45.5 billion – the price of a useless weapons system if you wanted one – and the state ended up owning 84% of the company. What are the governance rules? The biggest figure in France was E2.45 billion for Caisse d’Epargne.\nThe report led on to other observations, in particular of the huge proportion of GDP this country has dedicated to the banks, especially in comparison with other economic units:\nIn 2007: Eurozone: 3% US: 0 UK: 5%\nIn 2008: Eurozone: 28% US: 57% UK: 58%\nIn 2009: Eurozone: 28% US: 48% UK: 74%\nIn 2009 three quarters of the national earnings went to support the banks.\nAnd now there are rafts of activities – personal insurance, small company insurance, LIBOR rates- that along with the financial instruments that created no real wealth, and the issues of bonuses highlight again the moral bankruptcy of the banks. The solution must lie in governance, and part of that solution must lie in ownership and oversight by people outside the financial system – the citizens of the state, or the members of a mutual: nationalisation or mutualisation.\nHi, this is a comment.\nTo delete a comment, just log in, and view the posts’ comments, there you will have the option to edit or delete them.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2014_02/content_25.html": "There has just been an item on Womans’ Hour on the radio on pregnancy clinics giving anti abortion advice.\nOne item raised was the advice given by these clinics that abortion can lead to infertility. The spokesperson for the Royal College of Obstetrics and Gynaecology said that infertility was a risk in any pregnancy, whether it led to delivery (think of deaths from purpureal fever through most of womens history) or ended in miscarriage or abortion, if there was an infection that was not treated.\nOne has to remember that part of the reasoning behind the Abortion Act was the need to protect women dying or being damaged following illegal or backstreet abortion. The case that every law student learns for the mischief/purposive rules of statutory interpretation (RCN and Sec of State for Health) emphasised this.\nIn Roumania when there was concern about low birth rate abortion was made illegal. There was a tiny immediate blip in births before it settled back to the old levels, the time it took for the back street to take over from the state; and then there was a big rise in the number of deaths of women following illegal abortions.\nIt is the blood of these women that the anti-abortionists have on their hands.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_05/content_21.html": "Had my first tweet accusing Greens of being responsible for the Tory government from a Susan Press. Aimed at me I suppose as the Green in Morley & Outwood. The assumption is that if Greens had not stood there and in other seats there would not be a Tory government.\nOf course if Labour had supported PR there would be a left of centre government, but let us leave that aside because embracing PR is a matter of principle.\nWe have to assume that people voted Green out of a respect for Green policies.\nThey wanted:\nProsperity not austerity\nKeynsian not market economics building for that prosperous future\nThey did not want:\nTTIP\nFracking\nTuition fees\nTrident\nGreen policies are not Labour policies, down to the deepest fundamentals.\nThe tweet annoyed me because Labour did not express clear firm policies based on consistent principles and a Philosophical Basis, and that is why they lost seats.",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2012_10_05_menwith-hill/content_61.html": "There has been a local debate in Harrogate, in particular in the Harrogate Advertiser about a proposal for wind turbines close to the Menwith Hill site. My original letter, published on the 21st September read:\nDear Madam\nYou ask ‘wind turbines or radomes’ (HA 13.09.12). Let us first ignore the political drawing of the boundary of the Nidderdale AONB to put Menwith Hill outside and ask about the choice in terms of both climate change and civil liberties.\nThis week has seen the Arctic ice cover shrink to its smallest, and thinnest for thousands of years, at the same time the much more significant ice sheets in Greenland and North America have seen thinning and shrinkage beyond predictions. National energy policy is, inexplicably, moving from renewables to the search for more fossil fuels, both in the areas exposed by ice shrinkage, as well as from the rocks under our feet through ‘fracking’. Developments that will only make the climate problem worse.\nWind turbines are not a complete solution, but in a renewable energy mix they are part of the solution. There are a few sites perhaps where the visual impact might need to be taken into account, but wind turbines have a positive contribution to make. The American base at Menwith Hill does not have positives, unless you want your personal and business communications intercepted and passed to American business competitors, or to be part of a pointless and dangerous Star Wars weapon system.\nIt is not only the visual impact that needs to be asked, but what is the point of the intrusion – is it designed to do good, or do ill. Wind turbines every time.\nYours sincerely\nMartin Hemingway (Dr)\nFormer Chair\nLCC Menwith Hill Forum\nTHere was of course a lot of response, and I have today sent of a reply to some of thes, thet will I hope be published on the 11th:\nDear Editor\nMr Harrison (Letters 27th September 2012) very kindly refers to me by my title. It is because my doctoral research covered the Ice Age that I have a very keen awareness of the constancy of climate change. The focus of that work, on the maximum of the last Ice Age 17 000 years ago shows a human population excluded from northern Europe and hunting reindeer on the Mediterranean coast. This is a climate shift that our current population could not cope with, but luckily it looks as though the present interglacial will be a long one. What my understanding also makes clear is the huge difference between the current shift, linked to human production of greenhouse gases, from any other over the last few million years, this a change that the current population will have to cope with – and soon.\nMr Harrison and Mr McIntosh (Letters 4th October 2012) are exercised about the potential contribution of renewables in the future energy mix, and Mr McIntosh wants to focus on centralised production. A renewable mix is of most value in rural areas, and we need only look to the island of Samso in Denmark for an example of a rural community that now produces 140% of its electricity and heating from renewables – exporting the rest to the grid. This is effective decentralisation in a climate similar to ours, although less blessed with wind. Centralised – until large scale tidal comes on stream – means fossil fuels or nuclear, the latter touted as carbon neutral, although life cycle analysis call this into question. Nuclear has its own risks, and a report, also published on the 4th October, by the EU, highlights the lack of containment at some UK reactors – but it also cannot operate without a massive subsidy from the customer paid through their bills. Mr Harrison raises the question of a subsidy for renewable energy, but he, as well as the rest of us, has spent many years paying a subsidy to the nuclear industry .\nHe is also concerned about how many local jobs will come from the turbines. This allows a neat segue into the second strand of this correspondence. How many local jobs does Menwith provide, and what is its value to the local economy. A recent report on Menwith Hill by Steve Schofield ‘Lifting the lid on Menwith Hill’ presented at a meeting earlier this year in Harrogate has attempted to assess this. What was clear from Dr Schofield is that the pay of the Americans touted as an economic benefit is spent on the base on goods imported from the USA, or repatriated as savings. All recent large contracts have gone to UK firms based south of Birmingham; the hugely valuable electronic work is only available to Americans; the economic contribution is minor.\nMr Harrison also accuses me of paranoia over the functions of Menwith Hill. The role in Star Wars has been highlighted by the Americans themselves, and the role in the interception of communications of the Echelon system demonstrated over 1o years ago in the EU report presented in Harrogate by David Bowe, then an MEP. This shows that knowledge by US firms of contract details allowed them to win contracts worth tens of billions over European rivals – that is the economic value or rather ‘cost’!\nYours sincerely\nMartin Hemingway (Dr)\n(Green Party and former chair\nLCC Menwith Hill Forum)\n15 St Chads Drive\nLeeds\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_11_03_green-new-deal-2/content_36.html": "Green New Deal (2)\nThe EU has just agreed an Energy Efficiency Directive (EED) that is much weaker than the EU Parliament and NGO’s had campaigned for. If implemented it is likely to bring energy savings of only 15% by 2020, and there are no legally binding overall national targets. Member states are asked to adopt voluntary targets and these will be reviewed in 2014 in terms of progress towards the overall target. The 3% annual renovation rate for public buildings has been limited to just central government buildings, and provisions on public procurement, CHP generation and industrial audits are just voluntary.\nThe biggest positive, and this links directly to the GND, is the requirement that member states prepare long term ‘renovation roadmaps’ for their entire building stock. As a Party we need to work towards ensuring that the voluntary proposals to be reviewed in 2014 are on track to deliver the full 20% saving by 2020; and that active steps are taken towards the preparation of the ‘renovation roadmap’ for the UK building stock.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_04_21_another-question-for-ukip/content_45.html": "A moral conundrum. UKIP want a points based system for immigrants that would allow us to poach doctors, nurses and other medical staff from developing countries, but they want to reduce overseas aid to the minimum to make replacement more difficult. Not something they are interested in resolving.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_12_12_agricultural-development-at-songhai-benin/content_55.html": "On Wednesday I am to speak, all being well, at the meeting of the World Development Movement in Leeds. The focus is on my visit to Benin in October last year, and in particular on the farming education project at Songhai in Porto Novo.\nI have spoken on this a number of times – to a joint GP/RS meeting at Leeds Met, to the AGM of Leeds Development Education Centre, to a Geographical Association meeting at Threshfield, to a TEESNET meeting in London, and a range of other venues.\nI was in Benin as part of the UK delegation to a joint meeting on Development Education with teachers from Brazil, Austria, Czech Republic, Benin and the UK.\nThere are various problems relating to farming in Benin. One of the specific problems in Benin was the recognition that young people were moving from the villages to the city because of low farm incomes. Songhai was set up partly to deal with this, and a major aspect is agricultural training. Young people spend 18 months at the centre, including time on a model farm that shows how the Songhai model can be adapted to circumstances in the villages, before going back to the village.\nFor all developing countries there are issues relating to the importation of farming techniques and species that are not native in either the biological or cultural sense – Songhai uses local techniques and varieties.\nLocal agriculture also suffers from the structure of the industry with raw materials being exported, and the value added through processing overseas, and the marketing being non-native. Songhai is set up to process and sell its own production, keeping the value added in the country.\nSonghai is an integrated system – plant waste is fed to animals, goes to compost, or goes to bio-energy; animal waste goes to compost, bio-energy, or fish food; fish waste goes to irrigation and bio-energy. In energy terms there is some growing of jatropha for fuel, and this is used on site, extensive use of solar, and experimental use of wind; they expect to be energy self-sufficient by 2014.\nAnother example of how Songhai works that I have used with students relates to brick production. The site has clay, and this is dug from shallow pits. The pits are not left, but are used for growing wet rice, partly irrigated by water from the fish farming. The clay is fired in a kiln built on site, and fuelled with wood grown on site.\nA local animal, the agouti was highly prized for bush meat, like a large beaver or rabbit they live on elephant grass, grown on site. Songhai got hold of three females and a male, and they bred like, well, rabbits. Only by constant sales can the population be kept at 300. The meat sales are a major income stream.\nOne unexplained link was between the animal waste and the fish. The manure is put in a shed in metre square boxes; flies land on these, lay eggs. The maggots are harvested and fed to the fish. The feature of the maggot shed that is perhaps a shining example of the Songhai idea is that it is surrounded by a moat with fish in. These fish will eat any maggots that wriggle out; they eat anything trying to get in and eat the maggots, and then are harvested themselves.\nOne comparison to Samso in Denmark is that soya is grown, squeezed for oil, and then the protein rich cake used for animal and plant food – again all the value is retained in the system.\nThe Power Point is one that I use in talking about Songhai, and will use tomorrow.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2014_02_12_pregnancy-clinics-and-anti-abortion-advice/content_53.html": "There has just been an item on Womans’ Hour on the radio on pregnancy clinics giving anti abortion advice.\nOne item raised was the advice given by these clinics that abortion can lead to infertility. The spokesperson for the Royal College of Obstetrics and Gynaecology said that infertility was a risk in any pregnancy, whether it led to delivery (think of deaths from purpureal fever through most of womens history) or ended in miscarriage or abortion, if there was an infection that was not treated.\nOne has to remember that part of the reasoning behind the Abortion Act was the need to protect women dying or being damaged following illegal or backstreet abortion. The case that every law student learns for the mischief/purposive rules of statutory interpretation (RCN and Sec of State for Health) emphasised this.\nIn Roumania when there was concern about low birth rate abortion was made illegal. There was a tiny immediate blip in births before it settled back to the old levels, the time it took for the back street to take over from the state; and then there was a big rise in the number of deaths of women following illegal abortions.\nIt is the blood of these women that the anti-abortionists have on their hands.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2014_05/content_47.html": "In preparation for the WDM Euro-hustings this evening I have been doing some more detailed reading on TTIP to supplement the more general pieces that I have read. A good outline with examples, and focussed particularly on the arbitration process at the heart of these trade agreements provided by FoEEurope: The TTIP of the anti-democracy iceberg.\nThe Office of the US Trade Representative presents a case in favour which seems to be that rules are needed to protect firms investing abroad against expropriation etc, against arbitrary decisions that fall outside laws promulgated to protect its environment, public health, labour laws etc. As such it fits with the distinction made in ‘Why Nations Fail’ between extractive political and economic institutions that mine public resources for the benefit of the elite, and inclusive political and economic institutions that provide the environment for economic growth and development.\nWhy as Greens oppose something with such a worthy purpose?\nIn general terms we can begin with a quite from Martin Schultz, past-President of the EU Parliament, and front runner for the Commission, a German Social democrat: “those who refuse to negotiate with the United States .. will not be able to have any influence over the progression of globalisation”. I have a feeling that, as a Green. I could leave it here: the progression of globalisation means creating an environment in which huge companies can control our lives and dictate to our countries, our courts, us, what we have to put up with with, and what they can be permitted to sell. The EU is committed to globalisation, and must be reformed if it is to work for the people of Europe. To quite Marie-Noelle Lienemann in the debate in the FRench senate on TTIP: “we are forced to note that happy globalisation did not happen .. multinational companies are in a situation that we cannot regulate”\nIn financial terms international trade treaties lead to loss of jobs – just as Pfizer/Astra-Zeneca deal will lead to loss of jobs. Competition will not be a ‘level playing field’ – the ‘Buy American Act’ will keep European firms from bidding for contracts in areas such as waste and water. The suggested economic benefits to the polity are not there.\nIn terms of protection, lower US standards may require the EU to accept food produced in the US that falls below current EU standards, while any future attempts to raise standards, to make them stricter could lead to challenge. As the debate in the French senate put it: “the “mechanism gives companies the possibility to sue a state whose legislation could have a negative impact on the company’s activity. A US shale gas producer could take legal action against France because it prohibits it exploitation”. The Office of the US Trade Representative says that the mechanism is not there to allow firms to sue for loss of profit, the history of the system in operation shows this to be untrue. Even the designation of foods as requiring a specific source to be able to use a specific designation could be challenged under the system.\nAt the toxic heart of the proposal is the enforcement system, instead of disputes being heard in the national courts by independent judges, or in the EU court by independent judges, in public (and again the Office of the USTR makes much of ‘the rule of law), they will be heard by a panel of three arbitrators (people who are corporate lawyers in their other life) in secret, and without a court of appeal, and with the losing party having to bear their own costs even when they have only defended the action (where is the fit with the ‘rule of law’?).\nSo where are we: the current proposal will allow a firm to take action against a national government that affects its profits by requiring certain environmental standards – we have seen this in Hamburg; it will allow a firm to take action against a national government when the firm breaches the terms of its contract and the government objects – we have seen this with Occidental Oil in Ecuador; it will allow a mining company to sue a government because their laws forbid open cast, and they want to open cast (in a nature reserve) to make a profit – Infinito Gold in Costa Rica.\nIf there is a dispute it will not be decided by independent judges in public in a court of law, but by ‘arbitrators’ from the world of big business in private.\nCivil Society must take a stand. Most of the parties in the EU Parliament have voted for this flawed proposal – the Greens from the UK, and the Green groups against.",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2015_04_21_ukips-budget-something-is-missing/content_33.html": "I have been to a couple of hustings with different UKIP candidates and they have begun with identical little speeches about leaving the EU and having a budget that has been externally assessed and works.\nBut billions are missing in costs not covered by savings (mainly from leaving the EU), the thing they rabbit on about doing in their budgeting. I have scanned their manifesto, and can find nothing\nAnd that is border controls.\nBillions will be needed to reintroduce the border controls that will be required if we leave the EU, and to re-issue passports (and how complicated will that be, and how many staff will be needed – nothing wrong with creating employment though).\nMost expensive, the creation of a ‘hard border’ between the Irish Republic and Northern Ireland. Here another problem arises – the one of unpredicted consequences so familiar from our various adventures in the Middle East and North Africa: what will be the effect on the settlement reached in Northern Ireland following the Good Friday agreement, and what will be the increased policing costs of any return to the antagonisms that dominated in the period before the agreement.\nReally, UKIP, we should be told?\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2014_05_07_ttip-isds-and-the-greens/content_16.html": "In preparation for the WDM Euro-hustings this evening I have been doing some more detailed reading on TTIP to supplement the more general pieces that I have read. A good outline with examples, and focussed particularly on the arbitration process at the heart of these trade agreements provided by FoEEurope: The TTIP of the anti-democracy iceberg.\nThe Office of the US Trade Representative presents a case in favour which seems to be that rules are needed to protect firms investing abroad against expropriation etc, against arbitrary decisions that fall outside laws promulgated to protect its environment, public health, labour laws etc. As such it fits with the distinction made in ‘Why Nations Fail’ between extractive political and economic institutions that mine public resources for the benefit of the elite, and inclusive political and economic institutions that provide the environment for economic growth and development.\nWhy as Greens oppose something with such a worthy purpose?\nIn general terms we can begin with a quite from Martin Schultz, past-President of the EU Parliament, and front runner for the Commission, a German Social democrat: “those who refuse to negotiate with the United States .. will not be able to have any influence over the progression of globalisation”. I have a feeling that, as a Green. I could leave it here: the progression of globalisation means creating an environment in which huge companies can control our lives and dictate to our countries, our courts, us, what we have to put up with with, and what they can be permitted to sell. The EU is committed to globalisation, and must be reformed if it is to work for the people of Europe. To quite Marie-Noelle Lienemann in the debate in the FRench senate on TTIP: “we are forced to note that happy globalisation did not happen .. multinational companies are in a situation that we cannot regulate”\nIn financial terms international trade treaties lead to loss of jobs – just as Pfizer/Astra-Zeneca deal will lead to loss of jobs. Competition will not be a ‘level playing field’ – the ‘Buy American Act’ will keep European firms from bidding for contracts in areas such as waste and water. The suggested economic benefits to the polity are not there.\nIn terms of protection, lower US standards may require the EU to accept food produced in the US that falls below current EU standards, while any future attempts to raise standards, to make them stricter could lead to challenge. As the debate in the French senate put it: “the “mechanism gives companies the possibility to sue a state whose legislation could have a negative impact on the company’s activity. A US shale gas producer could take legal action against France because it prohibits it exploitation”. The Office of the US Trade Representative says that the mechanism is not there to allow firms to sue for loss of profit, the history of the system in operation shows this to be untrue. Even the designation of foods as requiring a specific source to be able to use a specific designation could be challenged under the system.\nAt the toxic heart of the proposal is the enforcement system, instead of disputes being heard in the national courts by independent judges, or in the EU court by independent judges, in public (and again the Office of the USTR makes much of ‘the rule of law), they will be heard by a panel of three arbitrators (people who are corporate lawyers in their other life) in secret, and without a court of appeal, and with the losing party having to bear their own costs even when they have only defended the action (where is the fit with the ‘rule of law’?).\nSo where are we: the current proposal will allow a firm to take action against a national government that affects its profits by requiring certain environmental standards – we have seen this in Hamburg; it will allow a firm to take action against a national government when the firm breaches the terms of its contract and the government objects – we have seen this with Occidental Oil in Ecuador; it will allow a mining company to sue a government because their laws forbid open cast, and they want to open cast (in a nature reserve) to make a profit – Infinito Gold in Costa Rica.\nIf there is a dispute it will not be decided by independent judges in public in a court of law, but by ‘arbitrators’ from the world of big business in private.\nCivil Society must take a stand. Most of the parties in the EU Parliament have voted for this flawed proposal – the Greens from the UK, and the Green groups against.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_tag_samso/content_32.html": "There are many things that we should be doing as Greens, but central to many, in different ways is the issue of energy and the often conflicting environmental pressures. I hope to address various of these.\nBut today a positive way forward, and not just applicable in developed countries. It relates to the island of Samso of the eastern, Baltic, shore of Denmark. It provides an example of an integrated energy scheme that has developed with full local community involvement, and local community benefit: elements essential for acceptance of a range of the options that we would champion. While it could be argued that it is most suitable to rural areas, large parts of the Yorkshire and Humber region are rural, and would be suited to just such a mix of renewable generation methods, with the addition in many cases of the potential for water that is lacking on the almost flat island of Samso, set in a sea with limited tidal range, and often flat sea.\nSamso is not exceptional in Denmark, although Danish visitors that I have spoken to while there describe a visit to the island as like stepping back in time.\nI have used this material for a session training teachers of development education in Warsaw, and for a session training teachers in sustainability education in London earlier this year.\nThe island of Samso off the east coast of Denmark has a population of 4100. In the mid 1990’s its population produced 45 000 t of CO2 a year with energy provided by imported petrol and oil, and by a mainland link to coal fired power stations on the mainland. That footprint has now changed to minus 15 000 t as they export ‘clean’ energy to the mainland.\nIn 1997 Samso put in a bid to the Danish government in competition with three other islands and a mainland community to develop a renewable energy community. Samso won and some key individuals put their energy into persuading communities and individuals to invest their own money in the venture.\nThis was made easy by the investment funds available from the Danish government and the EU, and by a high tariff paid for renewable energy being fed into the national grid which meant that wind turbines would pay for themselves in 6-7 years.\nThe development has involved a range of integrated schemes, has brought communities together, and has linked to the agricultural economy of the island. The range of energy options is testimony to this.\nRENEWABLE ENERGY ON SAMSO\nWIND: This is the big provider.\nOffshore: A line of turbines to the south of the island have been erected with a mix of outside and island money. Offshore turbines are more efficient because of the lower turbulence, but are more expensive to erect and link to the grid.\nOnshore: individual houses have small turbines, some farmers have one or a group of turbines on their land paid for by locals and representing a good financial income.\nCHP (COMBINED HEAT & POWER): The village of Nordby is typical of the type of community scheme that operates across the island. A solar thermal array fills a large field, water is fed in at one end, and even on cloudy days emerges at a temperature of 70 C. The hot water is piped to houses in the village for heating. When this is insufficient a small furnace burns straw to heat the water. Local fields provide the straw; grazing sheep keep down the grass around the thermal array. Other plants use wood chip from on-island woodland.\nErected with local community money, the decision, planning and administration has brought the community together.\nSOLAR PANELS: On roof tops and farm buildings these supplement other sources and are paid for by individuals.\nBIOFUEL: One of the crops grown on the island is rape. The seed is squeezed for its oil which is being used to replace diesel in tractors. The straw goes to the CHP plants supplementing farm incomes. The protein rich ‘cake’ left after squeezing the oil is used as cattle feed replacing food that had to be brought in from the mainland, and saving on transport costs.\nFINNISH MASS FIREPLACE: A massive pillar or wall of thermal material with a furnace at the core burning wood or wood pellet. A single burn a day heats the wall which continues to emit heat for the rest of the day. Users say it is efficient and cheaper than oil – and the wood is grown on peoples own land or elsewhere on the island.\nSome isolated homes have GROUND HEAT PUMPS that heat water pumped through pipes in their own land.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_10_05_menwith-hill/content_49.html": "There has been a local debate in Harrogate, in particular in the Harrogate Advertiser about a proposal for wind turbines close to the Menwith Hill site. My original letter, published on the 21st September read:\nDear Madam\nYou ask ‘wind turbines or radomes’ (HA 13.09.12). Let us first ignore the political drawing of the boundary of the Nidderdale AONB to put Menwith Hill outside and ask about the choice in terms of both climate change and civil liberties.\nThis week has seen the Arctic ice cover shrink to its smallest, and thinnest for thousands of years, at the same time the much more significant ice sheets in Greenland and North America have seen thinning and shrinkage beyond predictions. National energy policy is, inexplicably, moving from renewables to the search for more fossil fuels, both in the areas exposed by ice shrinkage, as well as from the rocks under our feet through ‘fracking’. Developments that will only make the climate problem worse.\nWind turbines are not a complete solution, but in a renewable energy mix they are part of the solution. There are a few sites perhaps where the visual impact might need to be taken into account, but wind turbines have a positive contribution to make. The American base at Menwith Hill does not have positives, unless you want your personal and business communications intercepted and passed to American business competitors, or to be part of a pointless and dangerous Star Wars weapon system.\nIt is not only the visual impact that needs to be asked, but what is the point of the intrusion – is it designed to do good, or do ill. Wind turbines every time.\nYours sincerely\nMartin Hemingway (Dr)\nFormer Chair\nLCC Menwith Hill Forum\nTHere was of course a lot of response, and I have today sent of a reply to some of thes, thet will I hope be published on the 11th:\nDear Editor\nMr Harrison (Letters 27th September 2012) very kindly refers to me by my title. It is because my doctoral research covered the Ice Age that I have a very keen awareness of the constancy of climate change. The focus of that work, on the maximum of the last Ice Age 17 000 years ago shows a human population excluded from northern Europe and hunting reindeer on the Mediterranean coast. This is a climate shift that our current population could not cope with, but luckily it looks as though the present interglacial will be a long one. What my understanding also makes clear is the huge difference between the current shift, linked to human production of greenhouse gases, from any other over the last few million years, this a change that the current population will have to cope with – and soon.\nMr Harrison and Mr McIntosh (Letters 4th October 2012) are exercised about the potential contribution of renewables in the future energy mix, and Mr McIntosh wants to focus on centralised production. A renewable mix is of most value in rural areas, and we need only look to the island of Samso in Denmark for an example of a rural community that now produces 140% of its electricity and heating from renewables – exporting the rest to the grid. This is effective decentralisation in a climate similar to ours, although less blessed with wind. Centralised – until large scale tidal comes on stream – means fossil fuels or nuclear, the latter touted as carbon neutral, although life cycle analysis call this into question. Nuclear has its own risks, and a report, also published on the 4th October, by the EU, highlights the lack of containment at some UK reactors – but it also cannot operate without a massive subsidy from the customer paid through their bills. Mr Harrison raises the question of a subsidy for renewable energy, but he, as well as the rest of us, has spent many years paying a subsidy to the nuclear industry .\nHe is also concerned about how many local jobs will come from the turbines. This allows a neat segue into the second strand of this correspondence. How many local jobs does Menwith provide, and what is its value to the local economy. A recent report on Menwith Hill by Steve Schofield ‘Lifting the lid on Menwith Hill’ presented at a meeting earlier this year in Harrogate has attempted to assess this. What was clear from Dr Schofield is that the pay of the Americans touted as an economic benefit is spent on the base on goods imported from the USA, or repatriated as savings. All recent large contracts have gone to UK firms based south of Birmingham; the hugely valuable electronic work is only available to Americans; the economic contribution is minor.\nMr Harrison also accuses me of paranoia over the functions of Menwith Hill. The role in Star Wars has been highlighted by the Americans themselves, and the role in the interception of communications of the Echelon system demonstrated over 1o years ago in the EU report presented in Harrogate by David Bowe, then an MEP. This shows that knowledge by US firms of contract details allowed them to win contracts worth tens of billions over European rivals – that is the economic value or rather ‘cost’!\nYours sincerely\nMartin Hemingway (Dr)\n(Green Party and former chair\nLCC Menwith Hill Forum)\n15 St Chads Drive\nLeeds\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_about/content_27.html": "Martin Francis Hemingway.\nLeeds, West Yorkshire. Yorkshire & the Humber Region.\nI am seeking selection as the lead Green Party candidate for Yorkshire and the Humber in 2014. In the election in 2009 I was the lead candidate in the Euro election and with a positive campaign achieved one of the largest swings to the Greens nationally, and one of the largest percentages of the vote in the country:\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2012_11_13_samso-and-local-energy-generation/content_58.html": "There are many things that we should be doing as Greens, but central to many, in different ways is the issue of energy and the often conflicting environmental pressures. I hope to address various of these.\nBut today a positive way forward, and not just applicable in developed countries. It relates to the island of Samso of the eastern, Baltic, shore of Denmark. It provides an example of an integrated energy scheme that has developed with full local community involvement, and local community benefit: elements essential for acceptance of a range of the options that we would champion. While it could be argued that it is most suitable to rural areas, large parts of the Yorkshire and Humber region are rural, and would be suited to just such a mix of renewable generation methods, with the addition in many cases of the potential for water that is lacking on the almost flat island of Samso, set in a sea with limited tidal range, and often flat sea.\nSamso is not exceptional in Denmark, although Danish visitors that I have spoken to while there describe a visit to the island as like stepping back in time.\nI have used this material for a session training teachers of development education in Warsaw, and for a session training teachers in sustainability education in London earlier this year.\nThe island of Samso off the east coast of Denmark has a population of 4100. In the mid 1990’s its population produced 45 000 t of CO2 a year with energy provided by imported petrol and oil, and by a mainland link to coal fired power stations on the mainland. That footprint has now changed to minus 15 000 t as they export ‘clean’ energy to the mainland.\nIn 1997 Samso put in a bid to the Danish government in competition with three other islands and a mainland community to develop a renewable energy community. Samso won and some key individuals put their energy into persuading communities and individuals to invest their own money in the venture.\nThis was made easy by the investment funds available from the Danish government and the EU, and by a high tariff paid for renewable energy being fed into the national grid which meant that wind turbines would pay for themselves in 6-7 years.\nThe development has involved a range of integrated schemes, has brought communities together, and has linked to the agricultural economy of the island. The range of energy options is testimony to this.\nRENEWABLE ENERGY ON SAMSO\nWIND: This is the big provider.\nOffshore: A line of turbines to the south of the island have been erected with a mix of outside and island money. Offshore turbines are more efficient because of the lower turbulence, but are more expensive to erect and link to the grid.\nOnshore: individual houses have small turbines, some farmers have one or a group of turbines on their land paid for by locals and representing a good financial income.\nCHP (COMBINED HEAT & POWER): The village of Nordby is typical of the type of community scheme that operates across the island. A solar thermal array fills a large field, water is fed in at one end, and even on cloudy days emerges at a temperature of 70 C. The hot water is piped to houses in the village for heating. When this is insufficient a small furnace burns straw to heat the water. Local fields provide the straw; grazing sheep keep down the grass around the thermal array. Other plants use wood chip from on-island woodland.\nErected with local community money, the decision, planning and administration has brought the community together.\nSOLAR PANELS: On roof tops and farm buildings these supplement other sources and are paid for by individuals.\nBIOFUEL: One of the crops grown on the island is rape. The seed is squeezed for its oil which is being used to replace diesel in tractors. The straw goes to the CHP plants supplementing farm incomes. The protein rich ‘cake’ left after squeezing the oil is used as cattle feed replacing food that had to be brought in from the mainland, and saving on transport costs.\nFINNISH MASS FIREPLACE: A massive pillar or wall of thermal material with a furnace at the core burning wood or wood pellet. A single burn a day heats the wall which continues to emit heat for the rest of the day. Users say it is efficient and cheaper than oil – and the wood is grown on peoples own land or elsewhere on the island.\nSome isolated homes have GROUND HEAT PUMPS that heat water pumped through pipes in their own land.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2015_04_13_withdrawal-from-the-eu/content_50.html": "Withdrawal from the EU linked to reducing immigration from the EU under the ‘freedom of movement’ rules is central to the UKIP offer in this election. The Conservatives out of fear have embraced it and talk of renegotiation.\nThe first question is: Is the EU likely to agree to reform of the treaty terms on “freedom of movement of people”?\nTo which the answer is No. The freedoms established by the various Treaties that underpin the EU are almost not going to be negotiable – they are central tenets of the Treaty. Cameron will not be able to negotiate them away.\nThe second question is: Can the UK leave the EU but take EEA (associate) status like Norway or Switzerland and no longer have to permit “freedom of movement of people”?\nAgain the answer is No. In early 2014 Switzerland voted to limit the freedom of movement of people from Croatia the most recent accession state, and immediately lost the right to access EU education and research funds, and would go on to lose more. It is a central tenet of the Treaty, and EEA states are bound by the same rules as those in the EU, they just have no say n making the rules. Switzerland is busy rescinding the vote. It is important to ask – why do these two wealthy countries see it as in their economic interest to maintain these close links with the EU?\nThe third question: Is the only way to lose the requirements on “freedom of movement of people” complete separation from the EU?\nAnd here we get a Yes. This would give the UK the same status in relation to the EU as for example Botswana, one of the Commonwealth states UKIP will build links with. The UKIP suggestion that the UK could negotiate separate treaties with individual EU states would not help since these would be reciprocal, and a right of residence for the 1 million UK citizens in Spain might be linked to freedom of movement of people, and access to fishing grounds\nQuestion four takes us into the ground that UKIP does not publicise: If the UK left completely what would be the day to day consequences on ordinary UK citizens?\nThe answers here are crucial, we cannot leave the EU and retain the privileges of membership:\n- Visitors arriving at ports and airports would face border checks to cover purpose of visit, intention to return and level of income\n- Visitors would need to go through the non-EU visitors queue at airports, the current wait at Charles-de-Gaulle in Paris is one to two hours – and that is without thousands of Britons in the queue. The same at Barcelona, Palma, Rome..\n- Non EU citizens can only spend 90 days in any 180 in the Schengen zone, so there will be no long winter breaks in the Canaries.\n- If we bring in visa requirements for citizens of one EU country eg Bulgaria, the whole of the EU would require visas for UK citizens. If they wanted to be bloody minded they could make us queue at embassies and consulates or apply weeks in advance\n- Long term residents, would cease to be that. If staying more than five years they would have to apply for ‘long term resident status’ which might have requirements such as speaking the language. UK citizens with no right to remain would be expelled and could be detained for 6 months to ‘facilitate’this\n- Different rules on property sales may apply to non-EU citizens affecting property values\n- Pensioners would lose upgrading of UK pensions (UK pension law)\n- The rules on joining family members in the EU would be restrictive\n- Those seeking work in the EU would need a ‘Blue Card’ or be an ‘intra-corporate transferee’ subject to more demanding rules\n- Students would not get equal treatment on tuition fees, would have limited rights to work during study, and no right to stay on completion\nAnd then of course question 5: If the UK left completely what might be the economic consequences?\nThe UK is a major trading partner of the EU but this is in part because we are in the EU. Some firms assemble here to get round rules on access to the EU market in a country with low wages and limited workers rights. Financial institutions have indicated they would not stay, and while we might feel quite happy to say good riddance to the lot of them, it might not be the best solution. It will take years and cost billions to pay for such things as establishing new border controls and re-issuing passports. Establishing a ‘hard border’ between Eire and Northern Ireland, may well have consequences for the current political settlement there.\nAnd then of course we need to be clear about what the Green Party would do, especially since it dislikes the whole business orientation of the EU, while welcoming its internationalism?\nThe focus needs to be on addressing the concerns of those who feel that there is a strong negative impact of EU migrants on costs, jobs and housing in the UK (no matter how inaccurate those perceptions)\nFrance limits benefits and access to free healthcare to those who have paid into the national system for a certain time, but allows access to those who can demonstrate they have access to the relevant financial resources. Each country can establish its own rules, I would not suggest that we should be less welcoming, but the option is there.\nIf we are short of houses we must build – create jobs, generate taxes.\nIf we are short of jobs then Keynsian economic policies – Building to create jobs – the Green New Deal and one million jobs – reinstating the NHS – building sustainable transport (not HS2) are in our policies and central to our campaign.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_10_21_incineration/content_43.html": "I spent some time while a Leeds City councillor as Chair or Deputy\nChair of West Yorkshire Waste Management, Deputy Chair of Leeds\nEnvironment Committee, and chair of Save Waste and Prosper; I also\npersuaded the Labour group at the time to oppose a Leeds incinerator,\nand the incineration of Leeds waste.\nThere are a range of issues to factor in.\nLandfill sites in West Yorkshire were well engineered, with leachate\ncollection (and the incineration of this). We adopted a policy that\nwe would not take low level nuclear waste, but probably could have\ndone. New sites were fitted with pipe systems to collect methane and\ncarry it to small scale generation plants, or for compression to LPG –\nthat was then used in waste collection vehicles. Living near landfill\nsites is obviously unpleasant, and the legacy of old sites had also to\nbe dealt with, but it must be noted that Yorkshire had and has many\nsuitable quarry sites that could still provide extensive capacity.\nLandfill is being ‘costed’ out through landfill taxes that apply not\nonly to waste, but to the materials (clay liner etc – that came\npredominanly from coal mining) used in site construction, and that are\ndesigned to favour large incineration plants.\nFeedstock is a contractual duty placed on the local authority/ies\nfeeding the plant. In a time of falling waste generation, then the\nimpact will be on recycling (and the operators want the high calorific\nvalue plastic and paper waste). Fines for failing to provide\nfeedstock are added to other contract costs, and the contracts are too\nlong term to be able to predict future patterns of arisings/recycling\nrates. Even in the 1990’s the Isle of Wight was faced with having to\nbuy back the paper it had sent for recycling in order to fulfill its\nincineration contract.\nAlthough rebranded as ‘Energy from Waste’ plants, this only even\nbegins to become an argument when the plant operates as a Combined\nHeat and Power plant feeding hotwater directly to local housing and\nindustrial developments. Burning produces bottom ash, the mineral\nresidue, of which a proportion is toxic. This cannot of course be\nidentified, hence the problem in Newcastle that Andy refers to in its\nuse on allotments, and which would argue for caution in its use in\nbuilding materials etc (do we want our nursery schools built with\ncinder blocks containing bottom ash?). Fly ash is collected in the\nchimneys and contains much more toxic material. This has to be\ndisposed to landfill not as waste, but as special waste at a much\nhigher cost per tonne because of the risk involved. And then there is\nwhat comes out of the chimney. Candy refers to money saving, and we\nknow (from SO2 spikes recorded in Leeds when the wind was in the wrong\ndirection) that the FGDS equipment at the east yorkshire conventional\npower plants was switched off when the price was low. There is no\nreason to suppose that waste incinerator operators will be any less\naware of this. There is a fall out of toxins around incinerator\nplants (first studied around crematoria in New England), as well as\nescape of fine particulates that are increasingly implicated in\nrespiratory disease.\nFinally there is the impact on alternative, and often small scale\ntechniques (the ones that large firms cannot generate large profits\nfrom). Bournemouth has pioneered anaerobic techniques on a medium\nscale; West Yorkshire has composting; Leeds has not only got a large\nrange of materials in its recycling, but has been actively exploring\nthe market for types of plastic not currently recycled. That is\nwthout waste minimisation, home-composting etc.\nPlenty of reasons to oppose incineration – what was the argument in favour?\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2012_10_31_3/content_60.html": "Strategy for the next Euro-election: Green New Deal (1)\nThere need be no secret about what must be at the core of the next European election campaign for the Green Party; it is the same as the central plank of the 2009 campaign: the Green New Deal.\nBased on an argument produced with the New Economics Foundation the Green New Deal argues for a Keynsian programme of public spending on a range of measures designed to green the economy, reduce our environmental impact, and along the way create jobs and reduce inequality. The Defence Secretary Philip Hammond recognises the value of such public spending, noting the creation of jobs (mostly American) involved in a new Trident programme. What any Green will argue is that the £100 billion Trident will cost could be applied to producing more jobs, and jobs directed to a more useful ends.\nThe Green candidate for the Presidency in the US, Jill Stein, is campaigning on a Green New Deal that as well as seeking to mend the lack of commitment to democracy in the country, and economic, employment, and fiscal policies aimed at curbing the power of big companies, the banks, and ‘the market’, includes a programme of employment built on Green jobs. This policy argues that 16 million jobs can be created in areas familiar to all of us: sustainable energy, energy efficiency retrofitting, mass transit, urban areas adapted for people, locally sourced agricultural production, organic farming and clean manufacturing.\nThis last an interesting point, nesting with the need for regulation, and the argument that regulation, and high standards, create jobs in manufacturing, fitting and maintenance of equipment; as well as inspection and enforcement; requiring companies to spend rather than distribute money to shareholders, with narrower profit margins exerting a downward pressure on prices.\n31\nOct\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2014_02_12_pregnancy-clinics-and-anti-abortion-advice/content_23.html": "There has just been an item on Womans’ Hour on the radio on pregnancy clinics giving anti abortion advice.\nOne item raised was the advice given by these clinics that abortion can lead to infertility. The spokesperson for the Royal College of Obstetrics and Gynaecology said that infertility was a risk in any pregnancy, whether it led to delivery (think of deaths from purpureal fever through most of womens history) or ended in miscarriage or abortion, if there was an infection that was not treated.\nOne has to remember that part of the reasoning behind the Abortion Act was the need to protect women dying or being damaged following illegal or backstreet abortion. The case that every law student learns for the mischief/purposive rules of statutory interpretation (RCN and Sec of State for Health) emphasised this.\nIn Roumania when there was concern about low birth rate abortion was made illegal. There was a tiny immediate blip in births before it settled back to the old levels, the time it took for the back street to take over from the state; and then there was a big rise in the number of deaths of women following illegal abortions.\nIt is the blood of these women that the anti-abortionists have on their hands.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2014_05_07_ttip-isds-and-the-greens/content_18.html": "In preparation for the WDM Euro-hustings this evening I have been doing some more detailed reading on TTIP to supplement the more general pieces that I have read. A good outline with examples, and focussed particularly on the arbitration process at the heart of these trade agreements provided by FoEEurope: The TTIP of the anti-democracy iceberg.\nThe Office of the US Trade Representative presents a case in favour which seems to be that rules are needed to protect firms investing abroad against expropriation etc, against arbitrary decisions that fall outside laws promulgated to protect its environment, public health, labour laws etc. As such it fits with the distinction made in ‘Why Nations Fail’ between extractive political and economic institutions that mine public resources for the benefit of the elite, and inclusive political and economic institutions that provide the environment for economic growth and development.\nWhy as Greens oppose something with such a worthy purpose?\nIn general terms we can begin with a quite from Martin Schultz, past-President of the EU Parliament, and front runner for the Commission, a German Social democrat: “those who refuse to negotiate with the United States .. will not be able to have any influence over the progression of globalisation”. I have a feeling that, as a Green. I could leave it here: the progression of globalisation means creating an environment in which huge companies can control our lives and dictate to our countries, our courts, us, what we have to put up with with, and what they can be permitted to sell. The EU is committed to globalisation, and must be reformed if it is to work for the people of Europe. To quite Marie-Noelle Lienemann in the debate in the FRench senate on TTIP: “we are forced to note that happy globalisation did not happen .. multinational companies are in a situation that we cannot regulate”\nIn financial terms international trade treaties lead to loss of jobs – just as Pfizer/Astra-Zeneca deal will lead to loss of jobs. Competition will not be a ‘level playing field’ – the ‘Buy American Act’ will keep European firms from bidding for contracts in areas such as waste and water. The suggested economic benefits to the polity are not there.\nIn terms of protection, lower US standards may require the EU to accept food produced in the US that falls below current EU standards, while any future attempts to raise standards, to make them stricter could lead to challenge. As the debate in the French senate put it: “the “mechanism gives companies the possibility to sue a state whose legislation could have a negative impact on the company’s activity. A US shale gas producer could take legal action against France because it prohibits it exploitation”. The Office of the US Trade Representative says that the mechanism is not there to allow firms to sue for loss of profit, the history of the system in operation shows this to be untrue. Even the designation of foods as requiring a specific source to be able to use a specific designation could be challenged under the system.\nAt the toxic heart of the proposal is the enforcement system, instead of disputes being heard in the national courts by independent judges, or in the EU court by independent judges, in public (and again the Office of the USTR makes much of ‘the rule of law), they will be heard by a panel of three arbitrators (people who are corporate lawyers in their other life) in secret, and without a court of appeal, and with the losing party having to bear their own costs even when they have only defended the action (where is the fit with the ‘rule of law’?).\nSo where are we: the current proposal will allow a firm to take action against a national government that affects its profits by requiring certain environmental standards – we have seen this in Hamburg; it will allow a firm to take action against a national government when the firm breaches the terms of its contract and the government objects – we have seen this with Occidental Oil in Ecuador; it will allow a mining company to sue a government because their laws forbid open cast, and they want to open cast (in a nature reserve) to make a profit – Infinito Gold in Costa Rica.\nIf there is a dispute it will not be decided by independent judges in public in a court of law, but by ‘arbitrators’ from the world of big business in private.\nCivil Society must take a stand. Most of the parties in the EU Parliament have voted for this flawed proposal – the Greens from the UK, and the Green groups against.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_tag_renewable-energy/content_8.html": "There are many things that we should be doing as Greens, but central to many, in different ways is the issue of energy and the often conflicting environmental pressures. I hope to address various of these.\nBut today a positive way forward, and not just applicable in developed countries. It relates to the island of Samso of the eastern, Baltic, shore of Denmark. It provides an example of an integrated energy scheme that has developed with full local community involvement, and local community benefit: elements essential for acceptance of a range of the options that we would champion. While it could be argued that it is most suitable to rural areas, large parts of the Yorkshire and Humber region are rural, and would be suited to just such a mix of renewable generation methods, with the addition in many cases of the potential for water that is lacking on the almost flat island of Samso, set in a sea with limited tidal range, and often flat sea.\nSamso is not exceptional in Denmark, although Danish visitors that I have spoken to while there describe a visit to the island as like stepping back in time.\nI have used this material for a session training teachers of development education in Warsaw, and for a session training teachers in sustainability education in London earlier this year.\nThe island of Samso off the east coast of Denmark has a population of 4100. In the mid 1990’s its population produced 45 000 t of CO2 a year with energy provided by imported petrol and oil, and by a mainland link to coal fired power stations on the mainland. That footprint has now changed to minus 15 000 t as they export ‘clean’ energy to the mainland.\nIn 1997 Samso put in a bid to the Danish government in competition with three other islands and a mainland community to develop a renewable energy community. Samso won and some key individuals put their energy into persuading communities and individuals to invest their own money in the venture.\nThis was made easy by the investment funds available from the Danish government and the EU, and by a high tariff paid for renewable energy being fed into the national grid which meant that wind turbines would pay for themselves in 6-7 years.\nThe development has involved a range of integrated schemes, has brought communities together, and has linked to the agricultural economy of the island. The range of energy options is testimony to this.\nRENEWABLE ENERGY ON SAMSO\nWIND: This is the big provider.\nOffshore: A line of turbines to the south of the island have been erected with a mix of outside and island money. Offshore turbines are more efficient because of the lower turbulence, but are more expensive to erect and link to the grid.\nOnshore: individual houses have small turbines, some farmers have one or a group of turbines on their land paid for by locals and representing a good financial income.\nCHP (COMBINED HEAT & POWER): The village of Nordby is typical of the type of community scheme that operates across the island. A solar thermal array fills a large field, water is fed in at one end, and even on cloudy days emerges at a temperature of 70 C. The hot water is piped to houses in the village for heating. When this is insufficient a small furnace burns straw to heat the water. Local fields provide the straw; grazing sheep keep down the grass around the thermal array. Other plants use wood chip from on-island woodland.\nErected with local community money, the decision, planning and administration has brought the community together.\nSOLAR PANELS: On roof tops and farm buildings these supplement other sources and are paid for by individuals.\nBIOFUEL: One of the crops grown on the island is rape. The seed is squeezed for its oil which is being used to replace diesel in tractors. The straw goes to the CHP plants supplementing farm incomes. The protein rich ‘cake’ left after squeezing the oil is used as cattle feed replacing food that had to be brought in from the mainland, and saving on transport costs.\nFINNISH MASS FIREPLACE: A massive pillar or wall of thermal material with a furnace at the core burning wood or wood pellet. A single burn a day heats the wall which continues to emit heat for the rest of the day. Users say it is efficient and cheaper than oil – and the wood is grown on peoples own land or elsewhere on the island.\nSome isolated homes have GROUND HEAT PUMPS that heat water pumped through pipes in their own land.",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2015_04_13_gildersome-baptist-church-yesterday/content_40.html": "I received, together with the other candidates, an invitation from David Newton at the church to provide a text – less than a side of A4 about the issues christian voters should be thinking about before they vote. Not a group that I know much about, but I offered to go along, read out my own sheet – so as not to take an unfair advantage over the other candidates – and be there to talk afterwards to anyone who wanted to talk. They came up with the issues of interest to them, and as we know from the responses to electoral matching sites such as VotesMatter2015 and Political Compass, they were rather more Green than anything else.\nThe UKIP candidate had sent a text (one and a half sides) on EU withdrawal with a couple of populist add-ons, and the Tory is attending next week.\nHere is the text that I read:\nI would like to thank David for setting the challenge of writing down a piece about ourselves and politics and the ‘christian voter’ – although I am addressing all types of voter.\nI am not suggesting it plays a part in your services but I want to start with primal scream therapy – not to have each or all of us screaming out – but because of the primal scream that lies at the root of all political activity; the primal scream of the small child without a sweet: “It’s not fair”. This is the well spring of political activity, identifying what is fair and deciding what we think is the way of putting it right – the therapy that is needed.\nWho is it we are to be fair to. The answer is easy – everybody. Not just the everybody that we can find outside in Gildersome, or Morley, or Leeds, or Yorkshire, or the rest of the world; but also the everybody that is to come; and – as an archaeologist you might expect this from me – everyone who has been and what they have to teach us about suffering and maybe joy, and most importantly why we are where we are.\nWhat do we mean by fairness, and what do we need to do. We need to be fair to the past –Baptists can bear witness to the unfairness of the establishment. Unfairness that led to the struggle for freedom, liberty of belief, of expression, of the individual. This is a central pillar of Green thinking: that we should allow people to do what they want so long as it does not harm others\nWe must also be aware of what that struggle produced in the end: employment rights, council housing, the Health Service, support for the most vulnerable, access to legal protection. We must be fair to the present. Things that we must protect, and that can be summarised as ‘Justice for all’. These are issues that should be addressed as you prepare your vote together with the means of protecting them –\nhow we run the economy, spending to Build as the Greens would advocate, or austerity with its food banks, its soup kitchens, and its despair;\nhow we raise the money for the things we want: taxes that ensure the wealthy pay for the fairer society we all want, particularly those that have inherited, or ‘fin’agled’ their wealth – an end to tax dodging, through a Tax Dodging Bill, whether we call it avoidance or evasion\nhow we approach the rest of the world: working to resolve the causes of conflict, over land, water, food, rather than by building bigger armies to deal with the conflicts or threaten them with weapons of mass immorality.\nAnd we must be fair to the future. The Hemingway name can be traced 600 years back in this area, I want it to be traced 600 years forward as well. And to do this we need to address the issues that affect that future: what we eat and drink, the air we breathe; biodiversity; energy extraction; global warming – the issues Greens have always been identified with by others, but which we have always defined as part of justice and fairness for all.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_12/content_28.html": "On Wednesday I am to speak, all being well, at the meeting of the World Development Movement in Leeds. The focus is on my visit to Benin in October last year, and in particular on the farming education project at Songhai in Porto Novo.\nI have spoken on this a number of times – to a joint GP/RS meeting at Leeds Met, to the AGM of Leeds Development Education Centre, to a Geographical Association meeting at Threshfield, to a TEESNET meeting in London, and a range of other venues.\nI was in Benin as part of the UK delegation to a joint meeting on Development Education with teachers from Brazil, Austria, Czech Republic, Benin and the UK.\nThere are various problems relating to farming in Benin. One of the specific problems in Benin was the recognition that young people were moving from the villages to the city because of low farm incomes. Songhai was set up partly to deal with this, and a major aspect is agricultural training. Young people spend 18 months at the centre, including time on a model farm that shows how the Songhai model can be adapted to circumstances in the villages, before going back to the village.\nFor all developing countries there are issues relating to the importation of farming techniques and species that are not native in either the biological or cultural sense – Songhai uses local techniques and varieties.\nLocal agriculture also suffers from the structure of the industry with raw materials being exported, and the value added through processing overseas, and the marketing being non-native. Songhai is set up to process and sell its own production, keeping the value added in the country.\nSonghai is an integrated system – plant waste is fed to animals, goes to compost, or goes to bio-energy; animal waste goes to compost, bio-energy, or fish food; fish waste goes to irrigation and bio-energy. In energy terms there is some growing of jatropha for fuel, and this is used on site, extensive use of solar, and experimental use of wind; they expect to be energy self-sufficient by 2014.\nAnother example of how Songhai works that I have used with students relates to brick production. The site has clay, and this is dug from shallow pits. The pits are not left, but are used for growing wet rice, partly irrigated by water from the fish farming. The clay is fired in a kiln built on site, and fuelled with wood grown on site.\nA local animal, the agouti was highly prized for bush meat, like a large beaver or rabbit they live on elephant grass, grown on site. Songhai got hold of three females and a male, and they bred like, well, rabbits. Only by constant sales can the population be kept at 300. The meat sales are a major income stream.\nOne unexplained link was between the animal waste and the fish. The manure is put in a shed in metre square boxes; flies land on these, lay eggs. The maggots are harvested and fed to the fish. The feature of the maggot shed that is perhaps a shining example of the Songhai idea is that it is surrounded by a moat with fish in. These fish will eat any maggots that wriggle out; they eat anything trying to get in and eat the maggots, and then are harvested themselves.\nOne comparison to Samso in Denmark is that soya is grown, squeezed for oil, and then the protein rich cake used for animal and plant food – again all the value is retained in the system.\nThe Power Point is one that I use in talking about Songhai, and will use tomorrow.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_comments_feed/content_12.html": null,
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_11/content_4.html": "There are many things that we should be doing as Greens, but central to many, in different ways is the issue of energy and the often conflicting environmental pressures. I hope to address various of these.\nBut today a positive way forward, and not just applicable in developed countries. It relates to the island of Samso of the eastern, Baltic, shore of Denmark. It provides an example of an integrated energy scheme that has developed with full local community involvement, and local community benefit: elements essential for acceptance of a range of the options that we would champion. While it could be argued that it is most suitable to rural areas, large parts of the Yorkshire and Humber region are rural, and would be suited to just such a mix of renewable generation methods, with the addition in many cases of the potential for water that is lacking on the almost flat island of Samso, set in a sea with limited tidal range, and often flat sea.\nSamso is not exceptional in Denmark, although Danish visitors that I have spoken to while there describe a visit to the island as like stepping back in time.\nI have used this material for a session training teachers of development education in Warsaw, and for a session training teachers in sustainability education in London earlier this year.\nThe island of Samso off the east coast of Denmark has a population of 4100. In the mid 1990’s its population produced 45 000 t of CO2 a year with energy provided by imported petrol and oil, and by a mainland link to coal fired power stations on the mainland. That footprint has now changed to minus 15 000 t as they export ‘clean’ energy to the mainland.\nIn 1997 Samso put in a bid to the Danish government in competition with three other islands and a mainland community to develop a renewable energy community. Samso won and some key individuals put their energy into persuading communities and individuals to invest their own money in the venture.\nThis was made easy by the investment funds available from the Danish government and the EU, and by a high tariff paid for renewable energy being fed into the national grid which meant that wind turbines would pay for themselves in 6-7 years.\nThe development has involved a range of integrated schemes, has brought communities together, and has linked to the agricultural economy of the island. The range of energy options is testimony to this.\nRENEWABLE ENERGY ON SAMSO\nWIND: This is the big provider.\nOffshore: A line of turbines to the south of the island have been erected with a mix of outside and island money. Offshore turbines are more efficient because of the lower turbulence, but are more expensive to erect and link to the grid.\nOnshore: individual houses have small turbines, some farmers have one or a group of turbines on their land paid for by locals and representing a good financial income.\nCHP (COMBINED HEAT & POWER): The village of Nordby is typical of the type of community scheme that operates across the island. A solar thermal array fills a large field, water is fed in at one end, and even on cloudy days emerges at a temperature of 70 C. The hot water is piped to houses in the village for heating. When this is insufficient a small furnace burns straw to heat the water. Local fields provide the straw; grazing sheep keep down the grass around the thermal array. Other plants use wood chip from on-island woodland.\nErected with local community money, the decision, planning and administration has brought the community together.\nSOLAR PANELS: On roof tops and farm buildings these supplement other sources and are paid for by individuals.\nBIOFUEL: One of the crops grown on the island is rape. The seed is squeezed for its oil which is being used to replace diesel in tractors. The straw goes to the CHP plants supplementing farm incomes. The protein rich ‘cake’ left after squeezing the oil is used as cattle feed replacing food that had to be brought in from the mainland, and saving on transport costs.\nFINNISH MASS FIREPLACE: A massive pillar or wall of thermal material with a furnace at the core burning wood or wood pellet. A single burn a day heats the wall which continues to emit heat for the rest of the day. Users say it is efficient and cheaper than oil – and the wood is grown on peoples own land or elsewhere on the island.\nSome isolated homes have GROUND HEAT PUMPS that heat water pumped through pipes in their own land.",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2015_04_20_housing/content_54.html": "GREEN PARTY HOUSING\n“Affordable secure accommodation is a basic human need” is the first sentence of the Green Party policy document on housing, and whether talk is of just finding somewhere to live, or the price of houses a lot of conversation is about housing. What the policy emphasises is that shelter is a need, and that providing a roof over everyone’s head is the minimum in a civilised society. Yet housing is talked about.\nMore housing is needed. There are empty properties, properties kept for investment and second homes, and the use of Council Tax may bring some of these into use as housing, but the current estimates, based on the last census and changing family patterns suggest that 250 000 new homes a year are needed. Over the last sixty years private building has never produced more than half this number. Houses for sale are an important part of our housing mix, but as every Tory prime minster before Thatcher recognised this had to be underpinned by ‘fairly priced rented’ property.\nFirst then house building, private developers want cheap land to reduce their overheads. They want to build expensive properties to boost their profits. They are not concerned with need. For over thirty years local authorities have been prevented from building housing; for thirty years before that they produced as many houses as the private sector, ‘fairly priced rented’ property. But where are the houses to go? The Green Party supports the role of the Green Belt in limiting urban sprawl and preventing small towns like Morley being swallowed by the city. The Green Party wants the return of planning powers and housing decisions to local authorities. Local authorities can then plan for the use of brownfield before Greenfield sites, and plan new development with the needs of existing communities in mind.\nThe key though is the provision of affordable rented property. In Leeds the few new build council houses are available for £84 per week for a 2 bed property, to £112 per week for a 4 bed property. This in a city where a private landlord can charge £70 a week for a room in a shared house, 0ver £120 for a 2 bed, and over £250 for a 4 bed house. If the tenants qualify for Housing Benefit, our taxpayers pounds are going into the pockets of private landlords, who may not be as concerned with maintenance as the local authority. On average people on housing benefit in private rented property receive £958 more a year than those in social housing. Housing Benefit going to social housing tenants is recycled within the social housing sector, that bgoing to private sector tenants is taken out as profit.\nThe Green Party favours the reform of borrowing rules to allow local authorities to borrow more and to build affordable rented property. We also want to remove tax relief from mortgages for buy-to-let properties – a sum estimated at £5.8 billion a year. But we also want to see a range of alternative builds and ownership type including self build and co-operatives.\nThe Green Party also wants to see our existing housing stock brought up to higher standards of energy efficiency and insulation, and pioneering Green Party councillors in Kirklees and Leeds have already made this happen.\n- Affordable rented property\n- Affordable new build\n- Local planning and Green Belt protection\n- High environmental standards in housing\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_06_30_hello-world/content_46.html": "In my readings on EU law I had several times come across the case of Costa v ENEL as being one of the cases that confirmed the superiority of EU over national law, and when details were given that the issue was concerned with the nationalisation by the Italian government of the electricity supply industry. I was not however clear about whether the case decided that states could not nationalise industries.\nSo I went to the case, helpfully available on eur-lex.europa.eu. The bill in dispute was for 1925 lire – so clearly a matter of principle. This did not reach a decsion on the issue of nationalisation although this was discussed. More help came from a more recent report from the Centre for European Policy Studies (aei.pitt.edu/15173/1/Task_Force_Report_on_Bank_State_Aid.pdf) which on p.9 notes “nationalisation itself is not a form of state aid – the EU Treaty itself is neutral with regard to the form of ownership”.\nI was looking because of the banks of course, including the serial offender Royal Bank of Scotland. RBoS received, in two slices state aid amounting to £45.5 billion – the price of a useless weapons system if you wanted one – and the state ended up owning 84% of the company. What are the governance rules? The biggest figure in France was E2.45 billion for Caisse d’Epargne.\nThe report led on to other observations, in particular of the huge proportion of GDP this country has dedicated to the banks, especially in comparison with other economic units:\nIn 2007: Eurozone: 3% US: 0 UK: 5%\nIn 2008: Eurozone: 28% US: 57% UK: 58%\nIn 2009: Eurozone: 28% US: 48% UK: 74%\nIn 2009 three quarters of the national earnings went to support the banks.\nAnd now there are rafts of activities – personal insurance, small company insurance, LIBOR rates- that along with the financial instruments that created no real wealth, and the issues of bonuses highlight again the moral bankruptcy of the banks. The solution must lie in governance, and part of that solution must lie in ownership and oversight by people outside the financial system – the citizens of the state, or the members of a mutual: nationalisation or mutualisation.\nHi, this is a comment.\nTo delete a comment, just log in, and view the posts’ comments, there you will have the option to edit or delete them.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_tag_renewable-energy-community/content_22.html": "There are many things that we should be doing as Greens, but central to many, in different ways is the issue of energy and the often conflicting environmental pressures. I hope to address various of these.\nBut today a positive way forward, and not just applicable in developed countries. It relates to the island of Samso of the eastern, Baltic, shore of Denmark. It provides an example of an integrated energy scheme that has developed with full local community involvement, and local community benefit: elements essential for acceptance of a range of the options that we would champion. While it could be argued that it is most suitable to rural areas, large parts of the Yorkshire and Humber region are rural, and would be suited to just such a mix of renewable generation methods, with the addition in many cases of the potential for water that is lacking on the almost flat island of Samso, set in a sea with limited tidal range, and often flat sea.\nSamso is not exceptional in Denmark, although Danish visitors that I have spoken to while there describe a visit to the island as like stepping back in time.\nI have used this material for a session training teachers of development education in Warsaw, and for a session training teachers in sustainability education in London earlier this year.\nThe island of Samso off the east coast of Denmark has a population of 4100. In the mid 1990’s its population produced 45 000 t of CO2 a year with energy provided by imported petrol and oil, and by a mainland link to coal fired power stations on the mainland. That footprint has now changed to minus 15 000 t as they export ‘clean’ energy to the mainland.\nIn 1997 Samso put in a bid to the Danish government in competition with three other islands and a mainland community to develop a renewable energy community. Samso won and some key individuals put their energy into persuading communities and individuals to invest their own money in the venture.\nThis was made easy by the investment funds available from the Danish government and the EU, and by a high tariff paid for renewable energy being fed into the national grid which meant that wind turbines would pay for themselves in 6-7 years.\nThe development has involved a range of integrated schemes, has brought communities together, and has linked to the agricultural economy of the island. The range of energy options is testimony to this.\nRENEWABLE ENERGY ON SAMSO\nWIND: This is the big provider.\nOffshore: A line of turbines to the south of the island have been erected with a mix of outside and island money. Offshore turbines are more efficient because of the lower turbulence, but are more expensive to erect and link to the grid.\nOnshore: individual houses have small turbines, some farmers have one or a group of turbines on their land paid for by locals and representing a good financial income.\nCHP (COMBINED HEAT & POWER): The village of Nordby is typical of the type of community scheme that operates across the island. A solar thermal array fills a large field, water is fed in at one end, and even on cloudy days emerges at a temperature of 70 C. The hot water is piped to houses in the village for heating. When this is insufficient a small furnace burns straw to heat the water. Local fields provide the straw; grazing sheep keep down the grass around the thermal array. Other plants use wood chip from on-island woodland.\nErected with local community money, the decision, planning and administration has brought the community together.\nSOLAR PANELS: On roof tops and farm buildings these supplement other sources and are paid for by individuals.\nBIOFUEL: One of the crops grown on the island is rape. The seed is squeezed for its oil which is being used to replace diesel in tractors. The straw goes to the CHP plants supplementing farm incomes. The protein rich ‘cake’ left after squeezing the oil is used as cattle feed replacing food that had to be brought in from the mainland, and saving on transport costs.\nFINNISH MASS FIREPLACE: A massive pillar or wall of thermal material with a furnace at the core burning wood or wood pellet. A single burn a day heats the wall which continues to emit heat for the rest of the day. Users say it is efficient and cheaper than oil – and the wood is grown on peoples own land or elsewhere on the island.\nSome isolated homes have GROUND HEAT PUMPS that heat water pumped through pipes in their own land.",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_about/content_44.html": "Martin Francis Hemingway.\nLeeds, West Yorkshire. Yorkshire & the Humber Region.\nI am seeking selection as the lead Green Party candidate for Yorkshire and the Humber in 2014. In the election in 2009 I was the lead candidate in the Euro election and with a positive campaign achieved one of the largest swings to the Greens nationally, and one of the largest percentages of the vote in the country:\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2018_09_20_good-delegation-by-a-mighty-business-leader/content_42.html": "It may be that the President of the United States is not being kept away from things, but The Hill (thehill.com/homenews/morning-report ) reports this morning on the days schedule for President and Vice President.\nIt may of course be good delegation by a mighty business leader…\nThe president holds a reelection rally in Las Vegas at 10 p.m. ET.\nVice President Pence is juggling a packed schedule. This morning, he participates in “A Seat at the Table: Persecuted Church Summit,” in the White House Indian Treaty Room. The vice president and Karen Pence later present a flag to the Korean War Veterans Memorial Foundation at 11:20 a.m., complete with his remarks. (The vice president will present an American flag used during the honorable carry ceremony at Joint Base Pearl Harbor-Hickam in Hawaii on Aug. 1, which paid tribute to U.S. soldiers killed during the Korean War.) At lunch, Pence headlines a political gathering to benefit the National Republican Senatorial Committee. At 1:30 p.m., the Pences participate in a conference of Women Mayors of America in the Eisenhower Executive Office Building next to the White House. Shortly after, the vice president meets with Prime Minister Zoran Zaev of Macedonia in the Roosevelt Room, and later speaks by phone with Lenín Moreno, president of Ecuador.\nor not…\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2018_02_21_separation-of-powers-in-us/content_20.html": "I bought second hand a copy of Dick Lehr & Gerard O’Neill ‘Black Mass: Whitey Bulger. the FBI and a devil’s deal’, a 2015 reprint of their 2000 original edition.\nThe account of the two sides getting drawn into one another, becoming co-dependent was interesting enough. Since two of those concerned were criminals they cannot be considered to be at fault in the relationship, it was just part of their career development. Fault lies with the law-enforcers failing through vanity and cowardice.\nI noted one passage however.\nThe younger brother of the criminal Jimmy ‘Whitey’ Bulger was the politician Billy Bulger, a Massachusetts state senator and for a long time president of the State Senate.\nOn p.82 the authors note:\n“In a number of highly publicized disputes Billy Bulger’s reputation as a vindictive autocrat was cemented. In one, Billy became enraged when a Boston housing judge refused to fill a clerkship with his hand-picked choice. The judge lashed out against Bulger’s raw patronage move by calling Bulger a “corrupt midget”. Payback came through legislation that cut the judge’s pay, reduced the size of his staff, and ended the court’s independent status by having it folded into another branch of the judiciary”\nA quick search shows the Boston Housing Court still exists, primarily dealing with evictions, with a Justice and Associate Justice.\nWhat seems completely strange is the idea that through legislation at the state level the judiciary can have its independence attacked – in particular the setting of the salary of judges has to be independent of the other powers to protect judicial independence.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2012_11_13_samso-and-local-energy-generation/content_30.html": "There are many things that we should be doing as Greens, but central to many, in different ways is the issue of energy and the often conflicting environmental pressures. I hope to address various of these.\nBut today a positive way forward, and not just applicable in developed countries. It relates to the island of Samso of the eastern, Baltic, shore of Denmark. It provides an example of an integrated energy scheme that has developed with full local community involvement, and local community benefit: elements essential for acceptance of a range of the options that we would champion. While it could be argued that it is most suitable to rural areas, large parts of the Yorkshire and Humber region are rural, and would be suited to just such a mix of renewable generation methods, with the addition in many cases of the potential for water that is lacking on the almost flat island of Samso, set in a sea with limited tidal range, and often flat sea.\nSamso is not exceptional in Denmark, although Danish visitors that I have spoken to while there describe a visit to the island as like stepping back in time.\nI have used this material for a session training teachers of development education in Warsaw, and for a session training teachers in sustainability education in London earlier this year.\nThe island of Samso off the east coast of Denmark has a population of 4100. In the mid 1990’s its population produced 45 000 t of CO2 a year with energy provided by imported petrol and oil, and by a mainland link to coal fired power stations on the mainland. That footprint has now changed to minus 15 000 t as they export ‘clean’ energy to the mainland.\nIn 1997 Samso put in a bid to the Danish government in competition with three other islands and a mainland community to develop a renewable energy community. Samso won and some key individuals put their energy into persuading communities and individuals to invest their own money in the venture.\nThis was made easy by the investment funds available from the Danish government and the EU, and by a high tariff paid for renewable energy being fed into the national grid which meant that wind turbines would pay for themselves in 6-7 years.\nThe development has involved a range of integrated schemes, has brought communities together, and has linked to the agricultural economy of the island. The range of energy options is testimony to this.\nRENEWABLE ENERGY ON SAMSO\nWIND: This is the big provider.\nOffshore: A line of turbines to the south of the island have been erected with a mix of outside and island money. Offshore turbines are more efficient because of the lower turbulence, but are more expensive to erect and link to the grid.\nOnshore: individual houses have small turbines, some farmers have one or a group of turbines on their land paid for by locals and representing a good financial income.\nCHP (COMBINED HEAT & POWER): The village of Nordby is typical of the type of community scheme that operates across the island. A solar thermal array fills a large field, water is fed in at one end, and even on cloudy days emerges at a temperature of 70 C. The hot water is piped to houses in the village for heating. When this is insufficient a small furnace burns straw to heat the water. Local fields provide the straw; grazing sheep keep down the grass around the thermal array. Other plants use wood chip from on-island woodland.\nErected with local community money, the decision, planning and administration has brought the community together.\nSOLAR PANELS: On roof tops and farm buildings these supplement other sources and are paid for by individuals.\nBIOFUEL: One of the crops grown on the island is rape. The seed is squeezed for its oil which is being used to replace diesel in tractors. The straw goes to the CHP plants supplementing farm incomes. The protein rich ‘cake’ left after squeezing the oil is used as cattle feed replacing food that had to be brought in from the mainland, and saving on transport costs.\nFINNISH MASS FIREPLACE: A massive pillar or wall of thermal material with a furnace at the core burning wood or wood pellet. A single burn a day heats the wall which continues to emit heat for the rest of the day. Users say it is efficient and cheaper than oil – and the wood is grown on peoples own land or elsewhere on the island.\nSome isolated homes have GROUND HEAT PUMPS that heat water pumped through pipes in their own land.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com/content_3.html": "I received, together with the other candidates, an invitation from David Newton at the church to provide a text – less than a side of A4 about the issues christian voters should be thinking about before they vote. Not a group that I know much about, but I offered to go along, read out my own sheet – so as not to take an unfair advantage over the other candidates – and be there to talk afterwards to anyone who wanted to talk. They came up with the issues of interest to them, and as we know from the responses to electoral matching sites such as VotesMatter2015 and Political Compass, they were rather more Green than anything else.\nThe UKIP candidate had sent a text (one and a half sides) on EU withdrawal with a couple of populist add-ons, and the Tory is attending next week.\nHere is the text that I read:\nI would like to thank David for setting the challenge of writing down a piece about ourselves and politics and the ‘christian voter’ – although I am addressing all types of voter.\nI am not suggesting it plays a part in your services but I want to start with primal scream therapy – not to have each or all of us screaming out – but because of the primal scream that lies at the root of all political activity; the primal scream of the small child without a sweet: “It’s not fair”. This is the well spring of political activity, identifying what is fair and deciding what we think is the way of putting it right – the therapy that is needed.\nWho is it we are to be fair to. The answer is easy – everybody. Not just the everybody that we can find outside in Gildersome, or Morley, or Leeds, or Yorkshire, or the rest of the world; but also the everybody that is to come; and – as an archaeologist you might expect this from me – everyone who has been and what they have to teach us about suffering and maybe joy, and most importantly why we are where we are.\nWhat do we mean by fairness, and what do we need to do. We need to be fair to the past –Baptists can bear witness to the unfairness of the establishment. Unfairness that led to the struggle for freedom, liberty of belief, of expression, of the individual. This is a central pillar of Green thinking: that we should allow people to do what they want so long as it does not harm others\nWe must also be aware of what that struggle produced in the end: employment rights, council housing, the Health Service, support for the most vulnerable, access to legal protection. We must be fair to the present. Things that we must protect, and that can be summarised as ‘Justice for all’. These are issues that should be addressed as you prepare your vote together with the means of protecting them –\nhow we run the economy, spending to Build as the Greens would advocate, or austerity with its food banks, its soup kitchens, and its despair;\nhow we raise the money for the things we want: taxes that ensure the wealthy pay for the fairer society we all want, particularly those that have inherited, or ‘fin’agled’ their wealth – an end to tax dodging, through a Tax Dodging Bill, whether we call it avoidance or evasion\nhow we approach the rest of the world: working to resolve the causes of conflict, over land, water, food, rather than by building bigger armies to deal with the conflicts or threaten them with weapons of mass immorality.\nAnd we must be fair to the future. The Hemingway name can be traced 600 years back in this area, I want it to be traced 600 years forward as well. And to do this we need to address the issues that affect that future: what we eat and drink, the air we breathe; biodiversity; energy extraction; global warming – the issues Greens have always been identified with by others, but which we have always defined as part of justice and fairness for all.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_category_uncategorized_feed/content_26.html": null,
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_category_uncategorized/content_15.html": "I received, together with the other candidates, an invitation from David Newton at the church to provide a text – less than a side of A4 about the issues christian voters should be thinking about before they vote. Not a group that I know much about, but I offered to go along, read out my own sheet – so as not to take an unfair advantage over the other candidates – and be there to talk afterwards to anyone who wanted to talk. They came up with the issues of interest to them, and as we know from the responses to electoral matching sites such as VotesMatter2015 and Political Compass, they were rather more Green than anything else.\nThe UKIP candidate had sent a text (one and a half sides) on EU withdrawal with a couple of populist add-ons, and the Tory is attending next week.\nHere is the text that I read:\nI would like to thank David for setting the challenge of writing down a piece about ourselves and politics and the ‘christian voter’ – although I am addressing all types of voter.\nI am not suggesting it plays a part in your services but I want to start with primal scream therapy – not to have each or all of us screaming out – but because of the primal scream that lies at the root of all political activity; the primal scream of the small child without a sweet: “It’s not fair”. This is the well spring of political activity, identifying what is fair and deciding what we think is the way of putting it right – the therapy that is needed.\nWho is it we are to be fair to. The answer is easy – everybody. Not just the everybody that we can find outside in Gildersome, or Morley, or Leeds, or Yorkshire, or the rest of the world; but also the everybody that is to come; and – as an archaeologist you might expect this from me – everyone who has been and what they have to teach us about suffering and maybe joy, and most importantly why we are where we are.\nWhat do we mean by fairness, and what do we need to do. We need to be fair to the past –Baptists can bear witness to the unfairness of the establishment. Unfairness that led to the struggle for freedom, liberty of belief, of expression, of the individual. This is a central pillar of Green thinking: that we should allow people to do what they want so long as it does not harm others\nWe must also be aware of what that struggle produced in the end: employment rights, council housing, the Health Service, support for the most vulnerable, access to legal protection. We must be fair to the present. Things that we must protect, and that can be summarised as ‘Justice for all’. These are issues that should be addressed as you prepare your vote together with the means of protecting them –\nhow we run the economy, spending to Build as the Greens would advocate, or austerity with its food banks, its soup kitchens, and its despair;\nhow we raise the money for the things we want: taxes that ensure the wealthy pay for the fairer society we all want, particularly those that have inherited, or ‘fin’agled’ their wealth – an end to tax dodging, through a Tax Dodging Bill, whether we call it avoidance or evasion\nhow we approach the rest of the world: working to resolve the causes of conflict, over land, water, food, rather than by building bigger armies to deal with the conflicts or threaten them with weapons of mass immorality.\nAnd we must be fair to the future. The Hemingway name can be traced 600 years back in this area, I want it to be traced 600 years forward as well. And to do this we need to address the issues that affect that future: what we eat and drink, the air we breathe; biodiversity; energy extraction; global warming – the issues Greens have always been identified with by others, but which we have always defined as part of justice and fairness for all.",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2018_02_21_separation-of-powers-in-us/content_52.html": "I bought second hand a copy of Dick Lehr & Gerard O’Neill ‘Black Mass: Whitey Bulger. the FBI and a devil’s deal’, a 2015 reprint of their 2000 original edition.\nThe account of the two sides getting drawn into one another, becoming co-dependent was interesting enough. Since two of those concerned were criminals they cannot be considered to be at fault in the relationship, it was just part of their career development. Fault lies with the law-enforcers failing through vanity and cowardice.\nI noted one passage however.\nThe younger brother of the criminal Jimmy ‘Whitey’ Bulger was the politician Billy Bulger, a Massachusetts state senator and for a long time president of the State Senate.\nOn p.82 the authors note:\n“In a number of highly publicized disputes Billy Bulger’s reputation as a vindictive autocrat was cemented. In one, Billy became enraged when a Boston housing judge refused to fill a clerkship with his hand-picked choice. The judge lashed out against Bulger’s raw patronage move by calling Bulger a “corrupt midget”. Payback came through legislation that cut the judge’s pay, reduced the size of his staff, and ended the court’s independent status by having it folded into another branch of the judiciary”\nA quick search shows the Boston Housing Court still exists, primarily dealing with evictions, with a Justice and Associate Justice.\nWhat seems completely strange is the idea that through legislation at the state level the judiciary can have its independence attacked – in particular the setting of the salary of judges has to be independent of the other powers to protect judicial independence.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2012_12_12_agricultural-development-at-songhai-benin/content_62.html": "On Wednesday I am to speak, all being well, at the meeting of the World Development Movement in Leeds. The focus is on my visit to Benin in October last year, and in particular on the farming education project at Songhai in Porto Novo.\nI have spoken on this a number of times – to a joint GP/RS meeting at Leeds Met, to the AGM of Leeds Development Education Centre, to a Geographical Association meeting at Threshfield, to a TEESNET meeting in London, and a range of other venues.\nI was in Benin as part of the UK delegation to a joint meeting on Development Education with teachers from Brazil, Austria, Czech Republic, Benin and the UK.\nThere are various problems relating to farming in Benin. One of the specific problems in Benin was the recognition that young people were moving from the villages to the city because of low farm incomes. Songhai was set up partly to deal with this, and a major aspect is agricultural training. Young people spend 18 months at the centre, including time on a model farm that shows how the Songhai model can be adapted to circumstances in the villages, before going back to the village.\nFor all developing countries there are issues relating to the importation of farming techniques and species that are not native in either the biological or cultural sense – Songhai uses local techniques and varieties.\nLocal agriculture also suffers from the structure of the industry with raw materials being exported, and the value added through processing overseas, and the marketing being non-native. Songhai is set up to process and sell its own production, keeping the value added in the country.\nSonghai is an integrated system – plant waste is fed to animals, goes to compost, or goes to bio-energy; animal waste goes to compost, bio-energy, or fish food; fish waste goes to irrigation and bio-energy. In energy terms there is some growing of jatropha for fuel, and this is used on site, extensive use of solar, and experimental use of wind; they expect to be energy self-sufficient by 2014.\nAnother example of how Songhai works that I have used with students relates to brick production. The site has clay, and this is dug from shallow pits. The pits are not left, but are used for growing wet rice, partly irrigated by water from the fish farming. The clay is fired in a kiln built on site, and fuelled with wood grown on site.\nA local animal, the agouti was highly prized for bush meat, like a large beaver or rabbit they live on elephant grass, grown on site. Songhai got hold of three females and a male, and they bred like, well, rabbits. Only by constant sales can the population be kept at 300. The meat sales are a major income stream.\nOne unexplained link was between the animal waste and the fish. The manure is put in a shed in metre square boxes; flies land on these, lay eggs. The maggots are harvested and fed to the fish. The feature of the maggot shed that is perhaps a shining example of the Songhai idea is that it is surrounded by a moat with fish in. These fish will eat any maggots that wriggle out; they eat anything trying to get in and eat the maggots, and then are harvested themselves.\nOne comparison to Samso in Denmark is that soya is grown, squeezed for oil, and then the protein rich cake used for animal and plant food – again all the value is retained in the system.\nThe Power Point is one that I use in talking about Songhai, and will use tomorrow.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2015_02_03_green-candidate-for-morley-outwood/content_29.html": "Last night at the hustings of Leeds and Wakefield Green Party I was adopted as the parliamentary candidate for the Morley & Outwood constituency, a mixture of a small market town and a group of former pit villages. Of course, the Green party is not wealthy, and my standing depends on raising the deposit and other campaign costs.\nMy local links I will come to later, they are historical more than anything else, but with a surname like Hemingway connections to the area west of Wakefield and south of Leeds can be assumed.\nI come to the campaign with a lot of political experience. I worked on my first campaign when I was 16, and then on many other unsuccessful campaigns for the Labour Party before coming back to my family roots in Leeds at the end of 1985. In 1990 I was elected as Labour councillor for the old Whinmoor ward, and served three terms before standing down in 2002.\nI got a lot done while a Labour councillor, felt that I contributed as a ward and City councillor, but much that I did would be considered Green. I served on the Housing, Highways and Environment committees through my whole term. I was Deputy Chair, and for a time Chair, of West Yorkshire Waste Management – meeting that took me to Wakefield regularly (and to Stanley), and successfully persuaded the Leeds Labour Group then not to incinerate waste or allow Leeds waste to be incinerated. I was chair nationally of UK Nuclear Free Local Authorities, campaigning vigorously and widely. Of course many other things beside – and there may be time for a catalogue later.\nBut during the last term as a councillor the Labour party moved away from me. I had been worried by the election of Blair, shocked at the announcement they would stick with Tory policies including PFI, and in despair when they stuck to this. I could not defend the policies of New Labour (and I do know about SureStart .. but what else?), and left the Council, left the Party, and joined the Greens.\nWhy? Because the policies of the Green Party are close to those that made me join Labour, are close to the policies on which the welfare state, social housing, full employment, increasing equality were built during the fifties, sixties and seventies before Conservatives, New Labour and the Coalition took their axes to a consensus that worked for almost everyone – but not the rich, not the big companies.\nSince then I have carried on the politics working locally, regionally and nationally in the Green Party; standing as a local election candidate, as a Parliamentary candidate twice (in Leeds North-West), and twice in the European elections, almost getting elected as an MEP as lead candidate in 2009.\nThe 2015 general election offers a single choice – four parties in the neo-liberal market economy camp in a centralised state – Conservative, Labour, Liberal-Democrat and UKIP, all agreeing on austerity, only over the speed at which they are going to make life richer for the rich and more miserable for those at the bottom; and the alternative – the Greens – proposing a more Keynsian solution with public spending building houses, improving energy efficiency, developing infrastructure, rescuing the Health service and providing jobs at a living wage. And yes, the rich and the big companies will pay for it by being made to pay their taxes (and a bit more). And against the centralised state, powers devolved to the lowest level possible, with the power to raise money locally, and above all the power over how to spend locally both this money and the wealth redistributed across the country.\nIn today’s Green Party Manifesto, the Party says it would collect £25 billion a year through a wealth tax starting at £3 million. In France the wealth tax starts with personal fortunes of just £800,000. Yet it brings in only £4 billion per year. Why the difference between here and there ?\nAlso, the estimated tax revenue from the abolition of tax relief on loan interest paid by private landlords appears to assume that the number of such landlords will stay the same (or even go up!). But faced with much higher levels of taxation, most such landlords will simply sell up, pay off their mortgages and invest in something else.\nDear John\nit is a long time since I have visited my blog page, and can I begin by apologising for the long delay in replying to your question of the 14th April last year.\nIn relation to the first point the party member and group responsible for the tax calculation will have used a relevant formula for the calculation. If you would still like an answer I will try and find out. The two most obvious factors that might explain the difference would be to do with the number or net worth of individuals falling in the particular bracket, or the level at which the wealth tax was to be set.\nOn the second the main argument for the abolition of tax relief on buy to let mortgages was the decision not to subsidise a group of people making a personal income in a way that was not seen as socially desirable. Again, as to the calculation, I would need to ask, but I would like to think that there was some substance in your comment – if the change meant a fall in property prices and a transfer back of housing from private landlords to owner-occupiers, an admittedly unlikely scenario. There was considerable discussion of the proposal at conference and one view voiced by those working in the sector was that ‘the banks would never allow it’ presumably because of the level of risk they would then be exposed to – possibly accurate, but the banks were not regarded with a lot of sympathy at the time of that debate.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_04/content_5.html": "A moral conundrum. UKIP want a points based system for immigrants that would allow us to poach doctors, nurses and other medical staff from developing countries, but they want to reduce overseas aid to the minimum to make replacement more difficult. Not something they are interested in resolving.\nUKIP’s BUDGET: SOMETHING IS MISSING\n21 AprI have been to a couple of hustings with different UKIP candidates and they have begun with identical little speeches about leaving the EU and having a budget that has been externally assessed and works.\nBut billions are missing in costs not covered by savings (mainly from leaving the EU), the thing they rabbit on about doing in their budgeting. I have scanned their manifesto, and can find nothing\nAnd that is border controls.\nBillions will be needed to reintroduce the border controls that will be required if we leave the EU, and to re-issue passports (and how complicated will that be, and how many staff will be needed – nothing wrong with creating employment though).\nMost expensive, the creation of a ‘hard border’ between the Irish Republic and Northern Ireland. Here another problem arises – the one of unpredicted consequences so familiar from our various adventures in the Middle East and North Africa: what will be the effect on the settlement reached in Northern Ireland following the Good Friday agreement, and what will be the increased policing costs of any return to the antagonisms that dominated in the period before the agreement.\nReally, UKIP, we should be told?\nHousing\n20 AprGREEN PARTY HOUSING\n“Affordable secure accommodation is a basic human need” is the first sentence of the Green Party policy document on housing, and whether talk is of just finding somewhere to live, or the price of houses a lot of conversation is about housing. What the policy emphasises is that shelter is a need, and that providing a roof over everyone’s head is the minimum in a civilised society. Yet housing is talked about.\nMore housing is needed. There are empty properties, properties kept for investment and second homes, and the use of Council Tax may bring some of these into use as housing, but the current estimates, based on the last census and changing family patterns suggest that 250 000 new homes a year are needed. Over the last sixty years private building has never produced more than half this number. Houses for sale are an important part of our housing mix, but as every Tory prime minster before Thatcher recognised this had to be underpinned by ‘fairly priced rented’ property.\nFirst then house building, private developers want cheap land to reduce their overheads. They want to build expensive properties to boost their profits. They are not concerned with need. For over thirty years local authorities have been prevented from building housing; for thirty years before that they produced as many houses as the private sector, ‘fairly priced rented’ property. But where are the houses to go? The Green Party supports the role of the Green Belt in limiting urban sprawl and preventing small towns like Morley being swallowed by the city. The Green Party wants the return of planning powers and housing decisions to local authorities. Local authorities can then plan for the use of brownfield before Greenfield sites, and plan new development with the needs of existing communities in mind.\nThe key though is the provision of affordable rented property. In Leeds the few new build council houses are available for £84 per week for a 2 bed property, to £112 per week for a 4 bed property. This in a city where a private landlord can charge £70 a week for a room in a shared house, 0ver £120 for a 2 bed, and over £250 for a 4 bed house. If the tenants qualify for Housing Benefit, our taxpayers pounds are going into the pockets of private landlords, who may not be as concerned with maintenance as the local authority. On average people on housing benefit in private rented property receive £958 more a year than those in social housing. Housing Benefit going to social housing tenants is recycled within the social housing sector, that bgoing to private sector tenants is taken out as profit.\nThe Green Party favours the reform of borrowing rules to allow local authorities to borrow more and to build affordable rented property. We also want to remove tax relief from mortgages for buy-to-let properties – a sum estimated at £5.8 billion a year. But we also want to see a range of alternative builds and ownership type including self build and co-operatives.\nThe Green Party also wants to see our existing housing stock brought up to higher standards of energy efficiency and insulation, and pioneering Green Party councillors in Kirklees and Leeds have already made this happen.\n- Affordable rented property\n- Affordable new build\n- Local planning and Green Belt protection\n- High environmental standards in housing\nGildersome Baptist Church yesterday\n13 AprI received, together with the other candidates, an invitation from David Newton at the church to provide a text – less than a side of A4 about the issues christian voters should be thinking about before they vote. Not a group that I know much about, but I offered to go along, read out my own sheet – so as not to take an unfair advantage over the other candidates – and be there to talk afterwards to anyone who wanted to talk. They came up with the issues of interest to them, and as we know from the responses to electoral matching sites such as VotesMatter2015 and Political Compass, they were rather more Green than anything else.\nThe UKIP candidate had sent a text (one and a half sides) on EU withdrawal with a couple of populist add-ons, and the Tory is attending next week.\nHere is the text that I read:\nI would like to thank David for setting the challenge of writing down a piece about ourselves and politics and the ‘christian voter’ – although I am addressing all types of voter.\nI am not suggesting it plays a part in your services but I want to start with primal scream therapy – not to have each or all of us screaming out – but because of the primal scream that lies at the root of all political activity; the primal scream of the small child without a sweet: “It’s not fair”. This is the well spring of political activity, identifying what is fair and deciding what we think is the way of putting it right – the therapy that is needed.\nWho is it we are to be fair to. The answer is easy – everybody. Not just the everybody that we can find outside in Gildersome, or Morley, or Leeds, or Yorkshire, or the rest of the world; but also the everybody that is to come; and – as an archaeologist you might expect this from me – everyone who has been and what they have to teach us about suffering and maybe joy, and most importantly why we are where we are.\nWhat do we mean by fairness, and what do we need to do. We need to be fair to the past –Baptists can bear witness to the unfairness of the establishment. Unfairness that led to the struggle for freedom, liberty of belief, of expression, of the individual. This is a central pillar of Green thinking: that we should allow people to do what they want so long as it does not harm others\nWe must also be aware of what that struggle produced in the end: employment rights, council housing, the Health Service, support for the most vulnerable, access to legal protection. We must be fair to the present. Things that we must protect, and that can be summarised as ‘Justice for all’. These are issues that should be addressed as you prepare your vote together with the means of protecting them –\nhow we run the economy, spending to Build as the Greens would advocate, or austerity with its food banks, its soup kitchens, and its despair;\nhow we raise the money for the things we want: taxes that ensure the wealthy pay for the fairer society we all want, particularly those that have inherited, or ‘fin’agled’ their wealth – an end to tax dodging, through a Tax Dodging Bill, whether we call it avoidance or evasion\nhow we approach the rest of the world: working to resolve the causes of conflict, over land, water, food, rather than by building bigger armies to deal with the conflicts or threaten them with weapons of mass immorality.\nAnd we must be fair to the future. The Hemingway name can be traced 600 years back in this area, I want it to be traced 600 years forward as well. And to do this we need to address the issues that affect that future: what we eat and drink, the air we breathe; biodiversity; energy extraction; global warming – the issues Greens have always been identified with by others, but which we have always defined as part of justice and fairness for all.\nWithdrawal from the EU\n13 AprWithdrawal from the EU linked to reducing immigration from the EU under the ‘freedom of movement’ rules is central to the UKIP offer in this election. The Conservatives out of fear have embraced it and talk of renegotiation.\nThe first question is: Is the EU likely to agree to reform of the treaty terms on “freedom of movement of people”?\nTo which the answer is No. The freedoms established by the various Treaties that underpin the EU are almost not going to be negotiable – they are central tenets of the Treaty. Cameron will not be able to negotiate them away.\nThe second question is: Can the UK leave the EU but take EEA (associate) status like Norway or Switzerland and no longer have to permit “freedom of movement of people”?\nAgain the answer is No. In early 2014 Switzerland voted to limit the freedom of movement of people from Croatia the most recent accession state, and immediately lost the right to access EU education and research funds, and would go on to lose more. It is a central tenet of the Treaty, and EEA states are bound by the same rules as those in the EU, they just have no say n making the rules. Switzerland is busy rescinding the vote. It is important to ask – why do these two wealthy countries see it as in their economic interest to maintain these close links with the EU?\nThe third question: Is the only way to lose the requirements on “freedom of movement of people” complete separation from the EU?\nAnd here we get a Yes. This would give the UK the same status in relation to the EU as for example Botswana, one of the Commonwealth states UKIP will build links with. The UKIP suggestion that the UK could negotiate separate treaties with individual EU states would not help since these would be reciprocal, and a right of residence for the 1 million UK citizens in Spain might be linked to freedom of movement of people, and access to fishing grounds\nQuestion four takes us into the ground that UKIP does not publicise: If the UK left completely what would be the day to day consequences on ordinary UK citizens?\nThe answers here are crucial, we cannot leave the EU and retain the privileges of membership:\n- Visitors arriving at ports and airports would face border checks to cover purpose of visit, intention to return and level of income\n- Visitors would need to go through the non-EU visitors queue at airports, the current wait at Charles-de-Gaulle in Paris is one to two hours – and that is without thousands of Britons in the queue. The same at Barcelona, Palma, Rome..\n- Non EU citizens can only spend 90 days in any 180 in the Schengen zone, so there will be no long winter breaks in the Canaries.\n- If we bring in visa requirements for citizens of one EU country eg Bulgaria, the whole of the EU would require visas for UK citizens. If they wanted to be bloody minded they could make us queue at embassies and consulates or apply weeks in advance\n- Long term residents, would cease to be that. If staying more than five years they would have to apply for ‘long term resident status’ which might have requirements such as speaking the language. UK citizens with no right to remain would be expelled and could be detained for 6 months to ‘facilitate’this\n- Different rules on property sales may apply to non-EU citizens affecting property values\n- Pensioners would lose upgrading of UK pensions (UK pension law)\n- The rules on joining family members in the EU would be restrictive\n- Those seeking work in the EU would need a ‘Blue Card’ or be an ‘intra-corporate transferee’ subject to more demanding rules\n- Students would not get equal treatment on tuition fees, would have limited rights to work during study, and no right to stay on completion\nAnd then of course question 5: If the UK left completely what might be the economic consequences?\nThe UK is a major trading partner of the EU but this is in part because we are in the EU. Some firms assemble here to get round rules on access to the EU market in a country with low wages and limited workers rights. Financial institutions have indicated they would not stay, and while we might feel quite happy to say good riddance to the lot of them, it might not be the best solution. It will take years and cost billions to pay for such things as establishing new border controls and re-issuing passports. Establishing a ‘hard border’ between Eire and Northern Ireland, may well have consequences for the current political settlement there.\nAnd then of course we need to be clear about what the Green Party would do, especially since it dislikes the whole business orientation of the EU, while welcoming its internationalism?\nThe focus needs to be on addressing the concerns of those who feel that there is a strong negative impact of EU migrants on costs, jobs and housing in the UK (no matter how inaccurate those perceptions)\nFrance limits benefits and access to free healthcare to those who have paid into the national system for a certain time, but allows access to those who can demonstrate they have access to the relevant financial resources. Each country can establish its own rules, I would not suggest that we should be less welcoming, but the option is there.\nIf we are short of houses we must build – create jobs, generate taxes.\nIf we are short of jobs then Keynsian economic policies – Building to create jobs – the Green New Deal and one million jobs – reinstating the NHS – building sustainable transport (not HS2) are in our policies and central to our campaign.",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com/content_1.html": "I received, together with the other candidates, an invitation from David Newton at the church to provide a text – less than a side of A4 about the issues christian voters should be thinking about before they vote. Not a group that I know much about, but I offered to go along, read out my own sheet – so as not to take an unfair advantage over the other candidates – and be there to talk afterwards to anyone who wanted to talk. They came up with the issues of interest to them, and as we know from the responses to electoral matching sites such as VotesMatter2015 and Political Compass, they were rather more Green than anything else.\nThe UKIP candidate had sent a text (one and a half sides) on EU withdrawal with a couple of populist add-ons, and the Tory is attending next week.\nHere is the text that I read:\nI would like to thank David for setting the challenge of writing down a piece about ourselves and politics and the ‘christian voter’ – although I am addressing all types of voter.\nI am not suggesting it plays a part in your services but I want to start with primal scream therapy – not to have each or all of us screaming out – but because of the primal scream that lies at the root of all political activity; the primal scream of the small child without a sweet: “It’s not fair”. This is the well spring of political activity, identifying what is fair and deciding what we think is the way of putting it right – the therapy that is needed.\nWho is it we are to be fair to. The answer is easy – everybody. Not just the everybody that we can find outside in Gildersome, or Morley, or Leeds, or Yorkshire, or the rest of the world; but also the everybody that is to come; and – as an archaeologist you might expect this from me – everyone who has been and what they have to teach us about suffering and maybe joy, and most importantly why we are where we are.\nWhat do we mean by fairness, and what do we need to do. We need to be fair to the past –Baptists can bear witness to the unfairness of the establishment. Unfairness that led to the struggle for freedom, liberty of belief, of expression, of the individual. This is a central pillar of Green thinking: that we should allow people to do what they want so long as it does not harm others\nWe must also be aware of what that struggle produced in the end: employment rights, council housing, the Health Service, support for the most vulnerable, access to legal protection. We must be fair to the present. Things that we must protect, and that can be summarised as ‘Justice for all’. These are issues that should be addressed as you prepare your vote together with the means of protecting them –\nhow we run the economy, spending to Build as the Greens would advocate, or austerity with its food banks, its soup kitchens, and its despair;\nhow we raise the money for the things we want: taxes that ensure the wealthy pay for the fairer society we all want, particularly those that have inherited, or ‘fin’agled’ their wealth – an end to tax dodging, through a Tax Dodging Bill, whether we call it avoidance or evasion\nhow we approach the rest of the world: working to resolve the causes of conflict, over land, water, food, rather than by building bigger armies to deal with the conflicts or threaten them with weapons of mass immorality.\nAnd we must be fair to the future. The Hemingway name can be traced 600 years back in this area, I want it to be traced 600 years forward as well. And to do this we need to address the issues that affect that future: what we eat and drink, the air we breathe; biodiversity; energy extraction; global warming – the issues Greens have always been identified with by others, but which we have always defined as part of justice and fairness for all.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_page_2/content_7.html": "On Wednesday I am to speak, all being well, at the meeting of the World Development Movement in Leeds. The focus is on my visit to Benin in October last year, and in particular on the farming education project at Songhai in Porto Novo.\nI have spoken on this a number of times – to a joint GP/RS meeting at Leeds Met, to the AGM of Leeds Development Education Centre, to a Geographical Association meeting at Threshfield, to a TEESNET meeting in London, and a range of other venues.\nI was in Benin as part of the UK delegation to a joint meeting on Development Education with teachers from Brazil, Austria, Czech Republic, Benin and the UK.\nThere are various problems relating to farming in Benin. One of the specific problems in Benin was the recognition that young people were moving from the villages to the city because of low farm incomes. Songhai was set up partly to deal with this, and a major aspect is agricultural training. Young people spend 18 months at the centre, including time on a model farm that shows how the Songhai model can be adapted to circumstances in the villages, before going back to the village.\nFor all developing countries there are issues relating to the importation of farming techniques and species that are not native in either the biological or cultural sense – Songhai uses local techniques and varieties.\nLocal agriculture also suffers from the structure of the industry with raw materials being exported, and the value added through processing overseas, and the marketing being non-native. Songhai is set up to process and sell its own production, keeping the value added in the country.\nSonghai is an integrated system – plant waste is fed to animals, goes to compost, or goes to bio-energy; animal waste goes to compost, bio-energy, or fish food; fish waste goes to irrigation and bio-energy. In energy terms there is some growing of jatropha for fuel, and this is used on site, extensive use of solar, and experimental use of wind; they expect to be energy self-sufficient by 2014.\nAnother example of how Songhai works that I have used with students relates to brick production. The site has clay, and this is dug from shallow pits. The pits are not left, but are used for growing wet rice, partly irrigated by water from the fish farming. The clay is fired in a kiln built on site, and fuelled with wood grown on site.\nA local animal, the agouti was highly prized for bush meat, like a large beaver or rabbit they live on elephant grass, grown on site. Songhai got hold of three females and a male, and they bred like, well, rabbits. Only by constant sales can the population be kept at 300. The meat sales are a major income stream.\nOne unexplained link was between the animal waste and the fish. The manure is put in a shed in metre square boxes; flies land on these, lay eggs. The maggots are harvested and fed to the fish. The feature of the maggot shed that is perhaps a shining example of the Songhai idea is that it is surrounded by a moat with fish in. These fish will eat any maggots that wriggle out; they eat anything trying to get in and eat the maggots, and then are harvested themselves.\nOne comparison to Samso in Denmark is that soya is grown, squeezed for oil, and then the protein rich cake used for animal and plant food – again all the value is retained in the system.\nThe Power Point is one that I use in talking about Songhai, and will use tomorrow.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_tag_environment/content_37.html": "I spent some time while a Leeds City councillor as Chair or Deputy\nChair of West Yorkshire Waste Management, Deputy Chair of Leeds\nEnvironment Committee, and chair of Save Waste and Prosper; I also\npersuaded the Labour group at the time to oppose a Leeds incinerator,\nand the incineration of Leeds waste.\nThere are a range of issues to factor in.\nLandfill sites in West Yorkshire were well engineered, with leachate\ncollection (and the incineration of this). We adopted a policy that\nwe would not take low level nuclear waste, but probably could have\ndone. New sites were fitted with pipe systems to collect methane and\ncarry it to small scale generation plants, or for compression to LPG –\nthat was then used in waste collection vehicles. Living near landfill\nsites is obviously unpleasant, and the legacy of old sites had also to\nbe dealt with, but it must be noted that Yorkshire had and has many\nsuitable quarry sites that could still provide extensive capacity.\nLandfill is being ‘costed’ out through landfill taxes that apply not\nonly to waste, but to the materials (clay liner etc – that came\npredominanly from coal mining) used in site construction, and that are\ndesigned to favour large incineration plants.\nFeedstock is a contractual duty placed on the local authority/ies\nfeeding the plant. In a time of falling waste generation, then the\nimpact will be on recycling (and the operators want the high calorific\nvalue plastic and paper waste). Fines for failing to provide\nfeedstock are added to other contract costs, and the contracts are too\nlong term to be able to predict future patterns of arisings/recycling\nrates. Even in the 1990’s the Isle of Wight was faced with having to\nbuy back the paper it had sent for recycling in order to fulfill its\nincineration contract.\nAlthough rebranded as ‘Energy from Waste’ plants, this only even\nbegins to become an argument when the plant operates as a Combined\nHeat and Power plant feeding hotwater directly to local housing and\nindustrial developments. Burning produces bottom ash, the mineral\nresidue, of which a proportion is toxic. This cannot of course be\nidentified, hence the problem in Newcastle that Andy refers to in its\nuse on allotments, and which would argue for caution in its use in\nbuilding materials etc (do we want our nursery schools built with\ncinder blocks containing bottom ash?). Fly ash is collected in the\nchimneys and contains much more toxic material. This has to be\ndisposed to landfill not as waste, but as special waste at a much\nhigher cost per tonne because of the risk involved. And then there is\nwhat comes out of the chimney. Candy refers to money saving, and we\nknow (from SO2 spikes recorded in Leeds when the wind was in the wrong\ndirection) that the FGDS equipment at the east yorkshire conventional\npower plants was switched off when the price was low. There is no\nreason to suppose that waste incinerator operators will be any less\naware of this. There is a fall out of toxins around incinerator\nplants (first studied around crematoria in New England), as well as\nescape of fine particulates that are increasingly implicated in\nrespiratory disease.\nFinally there is the impact on alternative, and often small scale\ntechniques (the ones that large firms cannot generate large profits\nfrom). Bournemouth has pioneered anaerobic techniques on a medium\nscale; West Yorkshire has composting; Leeds has not only got a large\nrange of materials in its recycling, but has been actively exploring\nthe market for types of plastic not currently recycled. That is\nwthout waste minimisation, home-composting etc.\nPlenty of reasons to oppose incineration – what was the argument in favour?",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_02/content_24.html": "Last night at the hustings of Leeds and Wakefield Green Party I was adopted as the parliamentary candidate for the Morley & Outwood constituency, a mixture of a small market town and a group of former pit villages. Of course, the Green party is not wealthy, and my standing depends on raising the deposit and other campaign costs.\nMy local links I will come to later, they are historical more than anything else, but with a surname like Hemingway connections to the area west of Wakefield and south of Leeds can be assumed.\nI come to the campaign with a lot of political experience. I worked on my first campaign when I was 16, and then on many other unsuccessful campaigns for the Labour Party before coming back to my family roots in Leeds at the end of 1985. In 1990 I was elected as Labour councillor for the old Whinmoor ward, and served three terms before standing down in 2002.\nI got a lot done while a Labour councillor, felt that I contributed as a ward and City councillor, but much that I did would be considered Green. I served on the Housing, Highways and Environment committees through my whole term. I was Deputy Chair, and for a time Chair, of West Yorkshire Waste Management – meeting that took me to Wakefield regularly (and to Stanley), and successfully persuaded the Leeds Labour Group then not to incinerate waste or allow Leeds waste to be incinerated. I was chair nationally of UK Nuclear Free Local Authorities, campaigning vigorously and widely. Of course many other things beside – and there may be time for a catalogue later.\nBut during the last term as a councillor the Labour party moved away from me. I had been worried by the election of Blair, shocked at the announcement they would stick with Tory policies including PFI, and in despair when they stuck to this. I could not defend the policies of New Labour (and I do know about SureStart .. but what else?), and left the Council, left the Party, and joined the Greens.\nWhy? Because the policies of the Green Party are close to those that made me join Labour, are close to the policies on which the welfare state, social housing, full employment, increasing equality were built during the fifties, sixties and seventies before Conservatives, New Labour and the Coalition took their axes to a consensus that worked for almost everyone – but not the rich, not the big companies.\nSince then I have carried on the politics working locally, regionally and nationally in the Green Party; standing as a local election candidate, as a Parliamentary candidate twice (in Leeds North-West), and twice in the European elections, almost getting elected as an MEP as lead candidate in 2009.\nThe 2015 general election offers a single choice – four parties in the neo-liberal market economy camp in a centralised state – Conservative, Labour, Liberal-Democrat and UKIP, all agreeing on austerity, only over the speed at which they are going to make life richer for the rich and more miserable for those at the bottom; and the alternative – the Greens – proposing a more Keynsian solution with public spending building houses, improving energy efficiency, developing infrastructure, rescuing the Health service and providing jobs at a living wage. And yes, the rich and the big companies will pay for it by being made to pay their taxes (and a bit more). And against the centralised state, powers devolved to the lowest level possible, with the power to raise money locally, and above all the power over how to spend locally both this money and the wealth redistributed across the country.",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_04_20_housing/content_38.html": "GREEN PARTY HOUSING\n“Affordable secure accommodation is a basic human need” is the first sentence of the Green Party policy document on housing, and whether talk is of just finding somewhere to live, or the price of houses a lot of conversation is about housing. What the policy emphasises is that shelter is a need, and that providing a roof over everyone’s head is the minimum in a civilised society. Yet housing is talked about.\nMore housing is needed. There are empty properties, properties kept for investment and second homes, and the use of Council Tax may bring some of these into use as housing, but the current estimates, based on the last census and changing family patterns suggest that 250 000 new homes a year are needed. Over the last sixty years private building has never produced more than half this number. Houses for sale are an important part of our housing mix, but as every Tory prime minster before Thatcher recognised this had to be underpinned by ‘fairly priced rented’ property.\nFirst then house building, private developers want cheap land to reduce their overheads. They want to build expensive properties to boost their profits. They are not concerned with need. For over thirty years local authorities have been prevented from building housing; for thirty years before that they produced as many houses as the private sector, ‘fairly priced rented’ property. But where are the houses to go? The Green Party supports the role of the Green Belt in limiting urban sprawl and preventing small towns like Morley being swallowed by the city. The Green Party wants the return of planning powers and housing decisions to local authorities. Local authorities can then plan for the use of brownfield before Greenfield sites, and plan new development with the needs of existing communities in mind.\nThe key though is the provision of affordable rented property. In Leeds the few new build council houses are available for £84 per week for a 2 bed property, to £112 per week for a 4 bed property. This in a city where a private landlord can charge £70 a week for a room in a shared house, 0ver £120 for a 2 bed, and over £250 for a 4 bed house. If the tenants qualify for Housing Benefit, our taxpayers pounds are going into the pockets of private landlords, who may not be as concerned with maintenance as the local authority. On average people on housing benefit in private rented property receive £958 more a year than those in social housing. Housing Benefit going to social housing tenants is recycled within the social housing sector, that bgoing to private sector tenants is taken out as profit.\nThe Green Party favours the reform of borrowing rules to allow local authorities to borrow more and to build affordable rented property. We also want to remove tax relief from mortgages for buy-to-let properties – a sum estimated at £5.8 billion a year. But we also want to see a range of alternative builds and ownership type including self build and co-operatives.\nThe Green Party also wants to see our existing housing stock brought up to higher standards of energy efficiency and insulation, and pioneering Green Party councillors in Kirklees and Leeds have already made this happen.\n- Affordable rented property\n- Affordable new build\n- Local planning and Green Belt protection\n- High environmental standards in housing\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2015_05_11_greens-responsible/content_34.html": "Had my first tweet accusing Greens of being responsible for the Tory government from a Susan Press. Aimed at me I suppose as the Green in Morley & Outwood. The assumption is that if Greens had not stood there and in other seats there would not be a Tory government.\nOf course if Labour had supported PR there would be a left of centre government, but let us leave that aside because embracing PR is a matter of principle.\nWe have to assume that people voted Green out of a respect for Green policies.\nThey wanted:\nProsperity not austerity\nKeynsian not market economics building for that prosperous future\nThey did not want:\nTTIP\nFracking\nTuition fees\nTrident\nGreen policies are not Labour policies, down to the deepest fundamentals.\nThe tweet annoyed me because Labour did not express clear firm policies based on consistent principles and a Philosophical Basis, and that is why they lost seats.\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2018_09_20_good-delegation-by-a-mighty-business-leader/content_9.html": "It may be that the President of the United States is not being kept away from things, but The Hill (thehill.com/homenews/morning-report ) reports this morning on the days schedule for President and Vice President.\nIt may of course be good delegation by a mighty business leader…\nThe president holds a reelection rally in Las Vegas at 10 p.m. ET.\nVice President Pence is juggling a packed schedule. This morning, he participates in “A Seat at the Table: Persecuted Church Summit,” in the White House Indian Treaty Room. The vice president and Karen Pence later present a flag to the Korean War Veterans Memorial Foundation at 11:20 a.m., complete with his remarks. (The vice president will present an American flag used during the honorable carry ceremony at Joint Base Pearl Harbor-Hickam in Hawaii on Aug. 1, which paid tribute to U.S. soldiers killed during the Korean War.) At lunch, Pence headlines a political gathering to benefit the National Republican Senatorial Committee. At 1:30 p.m., the Pences participate in a conference of Women Mayors of America in the Eisenhower Executive Office Building next to the White House. Shortly after, the vice president meets with Prime Minister Zoran Zaev of Macedonia in the Roosevelt Room, and later speaks by phone with Lenín Moreno, president of Ecuador.\nor not…\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/http_martinhemingwayforeurope_wordpress_com_2012_10_21_incineration/content_56.html": "I spent some time while a Leeds City councillor as Chair or Deputy\nChair of West Yorkshire Waste Management, Deputy Chair of Leeds\nEnvironment Committee, and chair of Save Waste and Prosper; I also\npersuaded the Labour group at the time to oppose a Leeds incinerator,\nand the incineration of Leeds waste.\nThere are a range of issues to factor in.\nLandfill sites in West Yorkshire were well engineered, with leachate\ncollection (and the incineration of this). We adopted a policy that\nwe would not take low level nuclear waste, but probably could have\ndone. New sites were fitted with pipe systems to collect methane and\ncarry it to small scale generation plants, or for compression to LPG –\nthat was then used in waste collection vehicles. Living near landfill\nsites is obviously unpleasant, and the legacy of old sites had also to\nbe dealt with, but it must be noted that Yorkshire had and has many\nsuitable quarry sites that could still provide extensive capacity.\nLandfill is being ‘costed’ out through landfill taxes that apply not\nonly to waste, but to the materials (clay liner etc – that came\npredominanly from coal mining) used in site construction, and that are\ndesigned to favour large incineration plants.\nFeedstock is a contractual duty placed on the local authority/ies\nfeeding the plant. In a time of falling waste generation, then the\nimpact will be on recycling (and the operators want the high calorific\nvalue plastic and paper waste). Fines for failing to provide\nfeedstock are added to other contract costs, and the contracts are too\nlong term to be able to predict future patterns of arisings/recycling\nrates. Even in the 1990’s the Isle of Wight was faced with having to\nbuy back the paper it had sent for recycling in order to fulfill its\nincineration contract.\nAlthough rebranded as ‘Energy from Waste’ plants, this only even\nbegins to become an argument when the plant operates as a Combined\nHeat and Power plant feeding hotwater directly to local housing and\nindustrial developments. Burning produces bottom ash, the mineral\nresidue, of which a proportion is toxic. This cannot of course be\nidentified, hence the problem in Newcastle that Andy refers to in its\nuse on allotments, and which would argue for caution in its use in\nbuilding materials etc (do we want our nursery schools built with\ncinder blocks containing bottom ash?). Fly ash is collected in the\nchimneys and contains much more toxic material. This has to be\ndisposed to landfill not as waste, but as special waste at a much\nhigher cost per tonne because of the risk involved. And then there is\nwhat comes out of the chimney. Candy refers to money saving, and we\nknow (from SO2 spikes recorded in Leeds when the wind was in the wrong\ndirection) that the FGDS equipment at the east yorkshire conventional\npower plants was switched off when the price was low. There is no\nreason to suppose that waste incinerator operators will be any less\naware of this. There is a fall out of toxins around incinerator\nplants (first studied around crematoria in New England), as well as\nescape of fine particulates that are increasingly implicated in\nrespiratory disease.\nFinally there is the impact on alternative, and often small scale\ntechniques (the ones that large firms cannot generate large profits\nfrom). Bournemouth has pioneered anaerobic techniques on a medium\nscale; West Yorkshire has composting; Leeds has not only got a large\nrange of materials in its recycling, but has been actively exploring\nthe market for types of plastic not currently recycled. That is\nwthout waste minimisation, home-composting etc.\nPlenty of reasons to oppose incineration – what was the argument in favour?\nLeave a comment",
  "http_martinhemingwayforeurope_wordpress_com_/https_martinhemingwayforeurope_wordpress_com_2015_05_11_greens-responsible/content_31.html": "Had my first tweet accusing Greens of being responsible for the Tory government from a Susan Press. Aimed at me I suppose as the Green in Morley & Outwood. The assumption is that if Greens had not stood there and in other seats there would not be a Tory government.\nOf course if Labour had supported PR there would be a left of centre government, but let us leave that aside because embracing PR is a matter of principle.\nWe have to assume that people voted Green out of a respect for Green policies.\nThey wanted:\nProsperity not austerity\nKeynsian not market economics building for that prosperous future\nThey did not want:\nTTIP\nFracking\nTuition fees\nTrident\nGreen policies are not Labour policies, down to the deepest fundamentals.\nThe tweet annoyed me because Labour did not express clear firm policies based on consistent principles and a Philosophical Basis, and that is why they lost seats.\nLeave a comment"
}