{
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_volunteer/content_19.html": "Volunteer\nHelp us make a difference in your community\nKENT COUNTY COUNCIL ELECTIONS 2025\nWe are looking for candidates for the Kent Council Council Elections in 2025.\nIf you'd like to find out more or put yourself forwards as a candidate contact Christine Headley, our Campaign Manager, via e-mail: christinedoverld@gmail.com\nBecome a volunteer today\nWe are so pleased you want to join the team. If you already know how you would like to help, let us know below, if not then you can skip those questions and hit the big yellow 'I'm in' button and someone will be in contact. Thank you.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_page-1/content_13.html": "Dover & Deal Liberal Democrats' Annual Lunch with Mike Martin MP\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nDover & Deal Liberal Democrats are proud to announce their candidates in Deal & Walmer, Dover North, Dover Town, Dover West and Sandwich\nDEAL AND WALMER\nHoward Evans has worked in the tyre and rubber industry most of his life and is still the Secretary-General of the Rubber Trade Association of Europe, responsible for the processes and procedures of the rubber market, contract development and discipline, and arbitration.\nHis experience opposes the hostile isolationist business policies with our commercial and geographic neighbours, supports fairness across our local communities and advances affordable practicable sustainable rural and town energy and transport policies.\nDEAL AND WALMER\nJohn Gosling has voted Liberal and then Liberal Democrat all his life. He writes:\n\"I joined the Party in 2015 in order to fight against Brexit and I stand for a restoration of harmony and alignment with Europe.\n\"I spent most of my career as a designer of high spec furniture and interiors, with many clients in the City of London.\n\"I have also had experience as a labourer, as a maintenance man in a dementia care home and charity fundraiser. This has given me a great insight into all levels of society.\n“I believe deeply in the values of Centre politics to prevent the excesses of the Far Right and Far Left and I am committed to the balance and common sense it represents.”\nDOVER NORTH\nBob Hope has lived in Dover District for almost 25 years. He has considerable business acumen having run and chaired several international companies involved in transport, sport and television.\nBob is heavily involved in the local community and has raised considerable funds through fund-raising and sponsorship to revitalise a village asset and bring it back to life.\nBob will bring his broad experience and drive to his role as a Kent County Councillor. He is particularly keen in ensuring that value for money is a key priority.\nAs a Liberal Democrat he wants to see greater provision for children and young people – particularly when it comes to access to sport; improved road management and repair of pot-holes: greater focus on support for green energy and protecting the environment; and a sensible and joined up approach to more affordable and social housing provision, built sustainably.\nDOVER TOWN\nRyan Grimes was born and raised in Dover as part of a large and close-knit family. He knows the everyday frustrations shared by many Dovorians; from pot holes and increasingly reckless driving in town, to watching Dover lag behind in terms of services, investment, and opportunity.\nHaving a broad career covering climate research, parkland management, and fighting forest fires by helicopter, Ryan wants to fight to make Dover better for everyone.\n“Dover has so much potential, so much to be proud of. Cooperation and communication can unlock so much good for the town and its people. We can no longer be an afterthought.”\nDOVER TOWN\nAdrian Walker-Smith was originally a member of the Liberal Party and joined the Liberal Democrats when the party was founded in 1988.\nHe has lived in Dover Town since 2021. His career started with acting at the Old Vic, moved through customer services with Readers’ Digest, continued with various roles in the Civil Service including leading the Cartel Investigation Branch of the Office of Fair Trading, and concluded with ten years as an Independent Member of the Parole Board.\nHe currently volunteers with two charities in Dover.\nDOVER WEST\nPenelope James has lived in Dover West Ward for nearly 25 years and ran her own very successful Communications Consultancy during this time.\nShe has been a parish councillor for 10 years, chair of South Kent Mind, is very involved in the local community where she lives, sitting on a range of committees, and stood as the Liberal Democrat candidate in the General Election in 2024.\nPenelope has been a vocal campaigner for the broader community of Dover & Deal on issues including the Dover & Deal Liberal Democrat campaign against the creation of an Internal Border Facility at Dover and protecting the Area of Outstanding Natural Beauty, located in Dover West.\nPenelope pledges to listen to local people and put them first. She will ensure more support for schools and young people, improved mental health provision and energy-efficient housing for local people at affordable prices.\nSANDWICH\nMartyn Pennington lives in the village of Woodnesborough, near Sandwich, with his wife, two cats and a mother-in-law of 95.\nBefore his retirement he was an internationally respected expert in overseas aid to poor countries, its effectiveness and \"value for money\". As an elder of the United Reformed Church and a member of Sandwich Town Council with ten years experience in local councils, he is well aware of the issues facing Sandwich and the surrounding area.\nMartyn says:\n\"I am passionate about bringing power to local communities, where so many people give their time and effort to help others.\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nPenelope James is a strong campaigner, hard-working and honest. She has lived in the constituency for almost 25 years and ran her own very successful Communications Consultancy during this time.\nFrom Archers Farm Solar Site to Openness and Accountability at Sandwich Town Council.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nEd Davey is a husband, a father and a carer. He is the Leader of the Liberal Democrats.\nIt is Ed’s experience of caring that drives much of his politics, and motivates his tireless campaigning for a fair deal.\nMeet our representatives and candidates.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_contact-us/content_11.html": "Get in touch\nEmail secretary@doverdeallibdems.org.uk\nPhone/text 07570 026989 (If you phone, be prepared to leave a message. We will get back to you.)\nFaceBook: www.facebook.com/Doverdeallibdems\nInstagram: doverdeallibdems\nTwitter: @doverdeallibdem\nEmail secretary@doverdeallibdems.org.uk\nPhone/text 07570 026989 (If you phone, be prepared to leave a message. We will get back to you.)\nFaceBook: www.facebook.com/Doverdeallibdems\nInstagram: doverdeallibdems\nTwitter: @doverdeallibdem",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_values/content_17.html": "What we stand for\nThe Liberal Democrats exist to build and safeguard a fair, free and open society, in which we seek to balance the fundamental values of liberty, equality and community, and in which no-one shall be enslaved by poverty, ignorance or conformity.\nPreamble to the Liberal Democrat Constitution\nThe Liberal Democrats stand firm on seven core values: liberty, equality, democracy, community, human rights, internationalism, and environmentalism. Each of these underpin the party's specific policy proposals.\nLiberty\nWe believe in the right of individuals to make their own decisions about how they live their lives, as long as they do not cause harm to others.\nOur aim is to empower and support individuals to pursue their dreams, to make the most of their talents and to live their lives as they wish.\nEquality\nWe stand by the idea that without equality, true liberty cannot be realised.\nThis requires an active state to: ensure that no one is held back by poverty, poor health, or discrimination, including on the basis of personal characteristics or beliefs; provide access to education or training, and other public services, including a welfare safety net; and guarantee that everyone enjoys equality before the law.\nDemocracy\nWe understand that through democracy, every citizen is empowered to make their voice heard, without being dominated by entrenched interests or the power of money; checks and balances, so that those in power cannot abuse their positions for personal gain or political advantage; and a plurality of views, where no individual or organisation is deterred from speaking truth to power.\nCommunity\nWe believe it is important to provide support for a diverse range of organisations that enable individuals to join together in the pursuit of common goals or activities; and the decentralisation of political and economic power to local government and the nations and regions of the UK.\nHuman Rights\nProviding, defending and promoting equal legal rights for everyone to pursue their lives according to their abilities, wishes and means, with no discrimination on the basis of religion or belief, gender, sexuality, age, ethnicity, disability, or minority status in their country of birth or permanent residency is highly important to us.\nInternationalism\nWe support a fairer and more equal, tolerant and connected world and collaboration with the UK's neighbours - including, ultimately, rejoining the EU - in guaranteeing peace and security, tackling the climate and nature emergencies, standing up to corporate power and spreading prosperity around the world.\nEnvironmentalism\nWe value the importance of acting at home and internationally to promote environmentally sustainable means of production and consumption and living in harmony with nature.\nOur policies\nLearn more about the influence these values have on Liberal Democrat policy",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_page-2/content_25.html": "General Election Financial Appeal\nA General Election is looming. It must be called by the end of this year, though the actual date is up to Rishi Sunak to decide.\nA General Election is looming. It must be called by the end of this year, though the actual date is up to Rishi Sunak to decide.\nPlay areas, Outdoor Gyms and No Mow for Biodiversity.\nCllr Rick Blackwell, Liberal Democrat member of Walmer Town Council reports on his take on the controversial decision to buy 62 The Strand as council offices.\nOur latest letter in the Dover Express: its a scandal that filthy sewage is being pumped into our rivers and coastlines.\nStill no progress on Sandwich Guildhall bus stop.\n70% OF pensioners in Dover and Deal face a £15.6 million tax bombshell Click on title to read the full story\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_page-4/content_9.html": "Lib Dems Say \"No\" to Closing Richborough and Deal Recycling Centres\nProposals from the Conservative-run Kent County Council to close the household waste recycling station at Richborough and possibly Deal have incensed local people.\nDover & Deal Liberal Democrats are proud to announce their candidates in Deal & Walmer, Dover North, Dover Town, Dover West and Sandwich\nDEAL AND WALMER\nHoward Evans has worked in the tyre and rubber industry most of his life and is still the Secretary-General of the Rubber Trade Association of Europe, responsible for the processes and procedures of the rubber market, contract development and discipline, and arbitration.\nHis experience opposes the hostile isolationist business policies with our commercial and geographic neighbours, supports fairness across our local communities and advances affordable practicable sustainable rural and town energy and transport policies.\nDEAL AND WALMER\nJohn Gosling has voted Liberal and then Liberal Democrat all his life. He writes:\n\"I joined the Party in 2015 in order to fight against Brexit and I stand for a restoration of harmony and alignment with Europe.\n\"I spent most of my career as a designer of high spec furniture and interiors, with many clients in the City of London.\n\"I have also had experience as a labourer, as a maintenance man in a dementia care home and charity fundraiser. This has given me a great insight into all levels of society.\n“I believe deeply in the values of Centre politics to prevent the excesses of the Far Right and Far Left and I am committed to the balance and common sense it represents.”\nDOVER NORTH\nBob Hope has lived in Dover District for almost 25 years. He has considerable business acumen having run and chaired several international companies involved in transport, sport and television.\nBob is heavily involved in the local community and has raised considerable funds through fund-raising and sponsorship to revitalise a village asset and bring it back to life.\nBob will bring his broad experience and drive to his role as a Kent County Councillor. He is particularly keen in ensuring that value for money is a key priority.\nAs a Liberal Democrat he wants to see greater provision for children and young people – particularly when it comes to access to sport; improved road management and repair of pot-holes: greater focus on support for green energy and protecting the environment; and a sensible and joined up approach to more affordable and social housing provision, built sustainably.\nDOVER TOWN\nRyan Grimes was born and raised in Dover as part of a large and close-knit family. He knows the everyday frustrations shared by many Dovorians; from pot holes and increasingly reckless driving in town, to watching Dover lag behind in terms of services, investment, and opportunity.\nHaving a broad career covering climate research, parkland management, and fighting forest fires by helicopter, Ryan wants to fight to make Dover better for everyone.\n“Dover has so much potential, so much to be proud of. Cooperation and communication can unlock so much good for the town and its people. We can no longer be an afterthought.”\nDOVER TOWN\nAdrian Walker-Smith was originally a member of the Liberal Party and joined the Liberal Democrats when the party was founded in 1988.\nHe has lived in Dover Town since 2021. His career started with acting at the Old Vic, moved through customer services with Readers’ Digest, continued with various roles in the Civil Service including leading the Cartel Investigation Branch of the Office of Fair Trading, and concluded with ten years as an Independent Member of the Parole Board.\nHe currently volunteers with two charities in Dover.\nDOVER WEST\nPenelope James has lived in Dover West Ward for nearly 25 years and ran her own very successful Communications Consultancy during this time.\nShe has been a parish councillor for 10 years, chair of South Kent Mind, is very involved in the local community where she lives, sitting on a range of committees, and stood as the Liberal Democrat candidate in the General Election in 2024.\nPenelope has been a vocal campaigner for the broader community of Dover & Deal on issues including the Dover & Deal Liberal Democrat campaign against the creation of an Internal Border Facility at Dover and protecting the Area of Outstanding Natural Beauty, located in Dover West.\nPenelope pledges to listen to local people and put them first. She will ensure more support for schools and young people, improved mental health provision and energy-efficient housing for local people at affordable prices.\nSANDWICH\nMartyn Pennington lives in the village of Woodnesborough, near Sandwich, with his wife, two cats and a mother-in-law of 95.\nBefore his retirement he was an internationally respected expert in overseas aid to poor countries, its effectiveness and \"value for money\". As an elder of the United Reformed Church and a member of Sandwich Town Council with ten years experience in local councils, he is well aware of the issues facing Sandwich and the surrounding area.\nMartyn says:\n\"I am passionate about bringing power to local communities, where so many people give their time and effort to help others.\nProposals from the Conservative-run Kent County Council to close the household waste recycling station at Richborough and possibly Deal have incensed local people.\nPolling shows 46% of adults with a mortgage said they were worried about losing their home because of unpaid bills in June.\nDover & Deal Liberal Democrats are campaigning for a fairer, greener and more prosperous Dover and a brighter future for the next generation.\nDover & Deal Lib Dems have campaigned hard against the siting of the Inland Border Facility at Whitcliffs Business Park, Whitfield and continue to do so.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nEd Davey is a husband, a father and a carer. He is the Leader of the Liberal Democrats.\nIt is Ed’s experience of caring that drives much of his politics, and motivates his tireless campaigning for a fair deal.\nMeet our representatives and candidates.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_donate/content_4.html": "This policy was last updated on the 2nd May 2018\nThe Liberal Democrats (“the Party”) respect individuals’ rights over their personal data. We are committed to ensuring that people are treated fairly in everything we do. This Privacy and Cookie Notice (“Notice”) outlines:\nWhere this Notice refers to ‘personal data’ it is referring to data about you (or other living people) from which you (or they) could be identified – such as name, date of birth or contact details.\nThis Notice applies to all personal data processed by the Party about its members and members of the public. This includes data gathered via third parties, such as social media sites, and which is therefore also covered by their own Privacy Polices.\nThis policy was last updated on 2nd May 2018. Any updates will be posted to this version of the policy. If you wish to see a previous version of the policy, or have any other questions, please get in touch.\nWe may collect personal data about you such as:\nWe may also collect information when you interact with the party digitally, such as by visiting one of our websites or communicating with one of our social media channels. This may include additional data to that above, such as:\nWe may also collect information about you from other public sources, such as the Land Registry, Companies House or other commercially available sources. We only do so where those sources are lawfully permitted to share the data with us and where we have a legal basis to process data from such sources. This may include, for example, checking the eligibility of a potential donor and may include additional data to that above, such as:\nWe may use your personal data to further our objectives, share it with our elected representatives and/or contact you in future. Examples of the way we may use your data include to:\nFor more specific information about how we use your data for these activities, and the legal basis on which we rely to process your data in this way, please see the ‘Why the Party is allowed to use your information in this way’ part of this Notice.\nIf you have provided us with your email, mobile phone number or landline phone number and we have a legal right to use them for such purposes, we may use that information to contact you to promote causes and campaigns that we support, such as by sending you an email, online advert, or a text message.\nWe will respect any registration you hold with the Telephone Preference Service (TPS) except where you have opted in to receive phone calls on that number from us.\nYou may opt out of communications from us at any time.\nDepending on how and why you provide us with your personal data it may be shared within the Party (i.e. between local, regional and national parts of the party and with our elected representatives) or with companies that provide services to the Party (“service providers”). For more information on service providers, please see here: https://www.libdems.org.uk/data-sharing.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations).\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so. For example, where you have signed a petition and are clearly informed that this petition will be presented to a third party.\nThe Party is a registered national political party in the UK; our work is designed to promote our values and to engage UK citizens in the democratic process.\nAccordingly, our work is considered to be of substantial public interest. Because of that public interest basis we are entitled to process sensitive personal data which relates to your political opinions, and your personal data more generally, for the purposes of enabling us to perform our work effectively. Specifically, that processing may include using those aspects of your personal data to help us to plan and execute political campaigns, canvass for your support (such as by visiting or calling you), raise funds, and perform casework that relates to you and your local community.\nYou do have rights to ask us to stop processing your data for these purposes, and you can read details about those rights here . In addition to the above we may also process your data for other purposes where you ask us to, or enter into a relationship with us that requires us to.\nFor example, if you choose to join us as a volunteer we will need to process your personal data to record that you have given us your support in this way. A contract will be put in place between you and us and we will process your personal data to the extent that we need to in order to fulfil our obligations under that contract.\nSimilarly, you may from time to time give us your consent to send you communications by e-mail (or similar mediums) which promote our work. Where you do that we will use your details to send you those kinds of communications until you tell us otherwise. Should you ever ask us to stop sending those kinds of communications we will hold your details on file to ensure that we respect that request – we justify that retention on the basis that we have a legitimate interest in holding your data in that way.\nFinally, where we have received your personal data in the various ways described above, we may continue to hold it as part of our records after the relevant processing has stopped. We hold data in this way because we have a legitimate interest in doing so. Specifically, where you have been a member or a volunteer (or have otherwise engaged with us such as by attending a conference or event, or by responding to a survey or questionnaire) we have a legitimate interest in holding your personal data to help us to monitor the numbers and the diversity of people who engage with us, as well as a legitimate interest in making sure that we can follow up any complaints or grievances which you may raise (or which people may raise about you).\nThe Party will not sell your personal data to third parties.\nDepending on how and why you provide us with your personal data it may be shared within the Party (e.g. between local, regional and national parts of the party) and our elected representatives. It may also be shared with those who provide services to the Party (“service providers”).\nWe may use service providers to undertake processing operations on our behalf to provide us with a variety of administrative, statistical, advertising and technical services. We will only supply service providers with the minimum amount of personal data they need to fulfil the services we request. We oblige all of our data processors to sign contracts with us that clearly set out their commitment to respecting individual rights, protecting your personal data – including not using it for any purpose other than providing us with an agreed service or fulfilling their legal obligations - and their commitments to assisting us to help you exercise your rights as a data subject.\nWith your consent, service providers may hold personal data about you in order to facilitate the provision of future services or financial transactions to which you have agreed, such as a payment processor retaining your payment details in order to process agreed future payments from you.\nPlease note that some of our service providers are based outside of the European Economic Area (the “EEA”). Where we transfer your data to a service provider that is outside of the EEA we seek to ensure that appropriate safeguards are in place to make sure that your personal data is held securely and that your rights as a data subject are upheld – in almost all cases we do this by ensuring that the agreements between us and our chosen service providers contain what are called the ‘model clauses’ that oblige them to treat your personal data as if they themselves were based in the EEA.\nIn addition, we may share your personal data with third parties when we are required to do so by law (for example, with the Police where they ask us to assist them with their investigations). In some cases, this may result in your personal data becoming public.\nIn particular, the Party and our candidates are required to submit records, including personal data, of donations above certain thresholds to the relevant regulatory authority. In some cases, some of these donation details are made public. For more details about this, please contact us.\nHowever, save for the limited circumstances noted above, we will never pass your personal data to any unrelated third parties unless you have given us your permission to do so.\nA cookie is a small text file placed on your device when you visit a website. You can accept or decline cookies through your browser settings or other software. For more information about cookies, see Information Commissioner's Office's Cookies Information\nWhen you visit one of our websites, we may place one or more cookies on your device. These are for purposes which include:\nBy using one or more of our sites, you are consenting to our use of cookies in accordance with this Notice. If you do not agree to our use of cookies, then you should set your browser or other software settings accordingly.\nWe may provide links to third party organisations with whom we have affinity arrangements, such as an online retailer. In such cases additional cookies may be placed to facilitate this arrangement and the third parties may also gather personal data about you in line with their own privacy policies. If a third party shares any personal data gathered in this way with the Liberal Democrats, it will be made clear in its own privacy policy.\nWe also provide options to share content on social media which may result in your being directed to the social media network’s own systems. If you proceed with this, those networks may gather personal data about you in line with their own privacy policies. On our websites or in other digital communications we may also use technologies variously described as web beacons, pixel tags, clear gifs or tracking pixels to provide us with information about how people have navigated through the site or responded to the communication.\nThe Party takes the protection of your information very seriously. We use encryption (SSL) to protect your personal data when appropriate, and all the information provided to the Party is stored securely once we receive it. People working or volunteering on behalf of the Party only have access to the information they need, and the web servers are stored in a high-security environment that is kept under 24-hour guard. The Party may store your personal data on secure servers either on our premises or in third party data centres.\nClick on the following link to learn more about our Cookies Policy.\nWe only keep your personal data for as long as required to meet the purposes set out in this Notice, unless a longer retention period is required by law. For example, this may include holding your data after you have ceased to engage with the party (such as by resigning or ceasing to be a member) where we have a legitimate interest in doing so, such as to enable us to respond effectively to grievances that may arise after you cease to engage with us. Where we collect and hold your details as part of our public interest work, this may also include retaining those details for as long as you remain a registered voter in the UK.\nWhere permitted by law, we may also save personal data for archiving purposes in the public interest, including historical research. This may involving passing such data to third parties who run historical archives .\nThe exact details of this are set out in our Data Retention Policy, a copy of which is available here (https://www.libdems.org.uk/data-retention) and all the above is subject to your legal rights, such as to have data in certain cases deleted or corrected, as set out below.\nYou have legal rights over any of your personal data that we hold.\nYou may, at any time, request access to the personal data that we hold which relates to you (sometimes called a subject access request).\nThis right entitles you to receive a copy of the personal data that we hold about you. It is not a right that allows you to request personal data about other people, or a right to request specific documents from us that do not relate to your personal data.\nYou may, at any time, request that we correct personal data that we hold about you which you believe is incorrect or inaccurate. You may also ask us to erase personal data if you do not believe that we need to continue retaining it (sometimes called the right to be forgotten).\nPlease note that we may ask you to verify any new data that you provide to us and may take our own steps to check that the new data you have supplied us with is accurate. Further, we are not always obliged to erase personal data when asked to do so; if for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to erase we will tell you what that reason is at the time we respond to your request.\nWhere we process your personal data on the legal basis of us having a legitimate interest to do so, you are entitled to ask us to stop processing it in that way if you feel that our continuing to do so impacts on your fundamental rights and freedoms or if you feel that those legitimate interests are not valid.\nYou may also ask us to stop processing your personal data (a) if you dispute the accuracy of that personal data and want us verify its accuracy; (b) where it has been established that our use of the data is unlawful but you do not want us to erase it; (c) where we no longer need to process your personal data (and would otherwise dispose of it) but you wish for us to continue storing it in order to enable you to establish, exercise or defend legal claims.\nIf for any reason we believe that we have a good legal reason to continue processing personal data that you ask us to stop processing, we will tell you what that reason is, either at the time we first respond to your request or after we have had the opportunity to consider and investigate it.\nYou may, at any time, write to us to ask us to cease processing your personal data which relates to your political opinions (such as how you have voted in the past, and things that you have told us about how you are likely to vote).\nPlease note that these requests can only be made about data which relates to your political opinions; they will not affect our right to use other aspects of your personal data.\nWhere you wish to transfer certain personal data that we hold about you, which is processed by automated means, to a third party you may write to us and ask us to provide it to you in a commonly used machine-readable format.\nWherever possible, we will provide you with a choice about how we can contact you to share information about the Party. You can opt out of communications at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems, or by the methods described below.\nIf you provide us with your email address and indicate that we may do so (e.g. by subscribing to an email distribution list or by ‘opting in’ through the membership page) we may send you further information about the Party in the future. These communications will take the form of e-mails promoting us and our work.\nYou can request that you cease to receive these kind of communications from us at any time. The easiest way to do so is to use the unsubscribe link provided at the bottom of any e-mail messages that we send to you. You can also do so at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nIf you provide your mobile phone number, we may call or send you text messages if you have given us permission to do so. You may request to stop receiving SMS messages at any point.\nYou can stop receiving SMS text messages by following the instructions to opt out provided within that text message. You can also do so by at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems.\nWe may contact you by post or telephone using information provided to us through the electoral roll and other legitimate sources of contact information for the purposes of campaigning, notifying you of our values and policies, and checking your eligibility to donate.\nWe will respect any registration you hold with the Telephone Preference Service except where you have opted in to receive communications from us. Further, even if you are not on the Telephone Preference Service register you may ask us to stop making calls to you by telling one of our operators when we call you.\nIf you provide us with your email address or telephone number we may use it to ensure online adverts you receive from us are relevant to you. These communications will take the form of online adverts promoting us and our work.\nYou can opt out of online advertising at any time by visiting libdems.org.uk/optout. It may take several days for requests submitted this way to become effective on our systems. We will have to share your data with relevant service providers. You may still receive online advertising from time to time where providers are unable to remove you from lists or their systems do not permit exclusion lists.\nWhile all of our direct marketing communications contain details of how you can stop receiving them in the future you can either follow those instructions (such as using the unsubscribe link in an email or telling a telephone caller), visit libdems.org.uk/optout, or ask us directly using the contact details below. If you do the latter, please provide us with full details of the telephone numbers, postal addresses, email addresses and so on to which you wish us to stop sending communications to in order to help us deal with your request quickly and accurately.\nLiberal Democrat Party\n8-10 Great George Street\nLondon\nSW1P 3AE\nTel: 020 7222 7999\nEmail: data.protection@libdems.org.uk\nWe will process any requests to stop receiving communications as quickly and comprehensively as is practical although there may in some cases be further communications already on their way to you which cannot be stopped.\nIf you ask us to stop sending you information (e.g. by email, post, phone or SMS text), we may keep a record of your information to make sure we do not contact you again, up until the normal retention period for that type of data. See our retention policy above for details.\nPlease note that this right to stop communications does not apply to emails that we send to you that are a necessary part of us providing a service to you (such as messaging you about your status as a member or a volunteer) or us notifying you about how your personal data is being used.\nIn addition, the right to stop communications does not apply to the Election Address that we are permitted to send to you during certain elections.\nYou may exercise any of these rights by contacting us using the details below and providing the necessary details for us to be able to identify the relevant data and to act on your request accurately.\nWhen you contact us making a request to exercise your rights we are entitled to ask you to prove that you are who you say you are. We may ask you to provide copies of relevant ID documents to help verify your identity.\nIt will help us to process your request if you clearly state which right you wish to exercise and, where relevant, why it is that you are exercising it. The clearer and more specific you can be the faster and more efficiently we can process the request. If you do not provide us with sufficient information then we may delay actioning your request until you have provided us with additional information (and where this is the case we will tell you).\nIf you have any queries regarding the information set out here, if you wish to exercise any of your rights set out above or if you think that it has not been followed, please contact:\nLiberal Democrats\n8-10 Great George Street\nLondon\nSW1P 3AE\ndata.protection@libdems.org.uk\nYou can also use these contact details, marked for the attention of the Chief Executive, if you wish to lodge a formal complaint about any matter covered here.\nClose the window\nIf you would like to give a donation over £11,180, the Fundraising Team will be delighted to facilitate this. Please email details of your proposed donation to corporate@libdems.org.uk, as we do not take gifts above £11,180 online. Thank you.\nPlease call 020 7022 0988 to donate or ask a question. We are open from 9.30 to 5.30 Monday to Friday.\nIf you wish to donate to your local party by cash or cheque, please contact them directly. If you want to donate to the Federal Party please send your donations to Liberal Democrats, 1 Vincent Square, London, SW1P 2PN.\nYou are donating to a political party. This means that if you are donating £500.01 or more, your details will be checked to ensure that you are registered on a UK electoral register. If you donate £11,180.01 or more to the Liberal Democrats in, your name (but not your address) and the amount of the donation will be reported to the Electoral Commission for publication on their public register of donations to the Liberal Democrats.\nThe money you use to make a donation must be from your own funds. You must not pass on money to the Liberal Democrats from a third party. It is an offence not to reveal the true source of a donation. Please email corporate@libdems.org.uk if you have any queries about your donation.\nBy making a donation you confirm that you are eligible to make political donations in the UK, and that this donation is not made for or on behalf of any other person. For more information please read our terms and conditions.\nPublished and promoted by Mike Dixon on behalf of the Liberal Democrats, 1 Vincent Square, London, SW1P 2PN. Hosted by SmarterPay.\nThe Liberal Democrats and their elected representatives may use the information you’ve given to contact you. By providing your data to us, you are consenting to us making contact with you in the future by mail, email, telephone, text, website and apps, even though you may be registered with the Telephone Preference Service. Your data may be stored or otherwise processed in the US, governed by European Commission model contract clauses. You can always opt out of communications at any time by contacting us or visiting www.libdems.org.uk/optout. For more information go to www.libdems.org.uk/privacy.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news/content_14.html": "Dover & Deal Liberal Democrats' Annual Lunch with Mike Martin MP\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nPenelope James is a strong campaigner, hard-working and honest. She has lived in the constituency for almost 25 years and ran her own very successful Communications Consultancy during this time.\nFrom Archers Farm Solar Site to Openness and Accountability at Sandwich Town Council.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_page-3/content_28.html": "Dover & Deal’s Conservative MP has voted against a Liberal Democrat amendment which would have committed the government to improving local GP and ambulance wait times (15th November).\nA staggering 72% of burglaries went unsolved in Kent in the 2022/2023 financial year - an average of 13 a day, new analysis has revealed.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_page-4/content_35.html": "Lib Dems Say \"No\" to Closing Richborough and Deal Recycling Centres\nProposals from the Conservative-run Kent County Council to close the household waste recycling station at Richborough and possibly Deal have incensed local people.\nProposals from the Conservative-run Kent County Council to close the household waste recycling station at Richborough and possibly Deal have incensed local people.\nPolling shows 46% of adults with a mortgage said they were worried about losing their home because of unpaid bills in June.\nDover & Deal Liberal Democrats are campaigning for a fairer, greener and more prosperous Dover and a brighter future for the next generation.\nDover & Deal Lib Dems have campaigned hard against the siting of the Inland Border Facility at Whitcliffs Business Park, Whitfield and continue to do so.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_page-3/content_20.html": "KENT COUNTY COUNCIL ELECTIONS, 1 MAY 2025\nDOVER DISTRICT'S LIBERAL DEMOCRAT CANDIDATES\nDover & Deal Liberal Democrats are proud to announce their candidates in Deal & Walmer, Dover North, Dover Town, Dover West and Sandwich\nDEAL AND WALMER\nHoward Evans has worked in the tyre and rubber industry most of his life and is still the Secretary-General of the Rubber Trade Association of Europe, responsible for the processes and procedures of the rubber market, contract development and discipline, and arbitration.\nHis experience opposes the hostile isolationist business policies with our commercial and geographic neighbours, supports fairness across our local communities and advances affordable practicable sustainable rural and town energy and transport policies.\nDEAL AND WALMER\nJohn Gosling has voted Liberal and then Liberal Democrat all his life. He writes:\n\"I joined the Party in 2015 in order to fight against Brexit and I stand for a restoration of harmony and alignment with Europe.\n\"I spent most of my career as a designer of high spec furniture and interiors, with many clients in the City of London.\n\"I have also had experience as a labourer, as a maintenance man in a dementia care home and charity fundraiser. This has given me a great insight into all levels of society.\n“I believe deeply in the values of Centre politics to prevent the excesses of the Far Right and Far Left and I am committed to the balance and common sense it represents.”\nDOVER NORTH\nBob Hope has lived in Dover District for almost 25 years. He has considerable business acumen having run and chaired several international companies involved in transport, sport and television.\nBob is heavily involved in the local community and has raised considerable funds through fund-raising and sponsorship to revitalise a village asset and bring it back to life.\nBob will bring his broad experience and drive to his role as a Kent County Councillor. He is particularly keen in ensuring that value for money is a key priority.\nAs a Liberal Democrat he wants to see greater provision for children and young people – particularly when it comes to access to sport; improved road management and repair of pot-holes: greater focus on support for green energy and protecting the environment; and a sensible and joined up approach to more affordable and social housing provision, built sustainably.\nDOVER TOWN\nRyan Grimes was born and raised in Dover as part of a large and close-knit family. He knows the everyday frustrations shared by many Dovorians; from pot holes and increasingly reckless driving in town, to watching Dover lag behind in terms of services, investment, and opportunity.\nHaving a broad career covering climate research, parkland management, and fighting forest fires by helicopter, Ryan wants to fight to make Dover better for everyone.\n“Dover has so much potential, so much to be proud of. Cooperation and communication can unlock so much good for the town and its people. We can no longer be an afterthought.”\nDOVER TOWN\nAdrian Walker-Smith was originally a member of the Liberal Party and joined the Liberal Democrats when the party was founded in 1988.\nHe has lived in Dover Town since 2021. His career started with acting at the Old Vic, moved through customer services with Readers’ Digest, continued with various roles in the Civil Service including leading the Cartel Investigation Branch of the Office of Fair Trading, and concluded with ten years as an Independent Member of the Parole Board.\nHe currently volunteers with two charities in Dover.\nDOVER WEST\nPenelope James has lived in Dover West Ward for nearly 25 years and ran her own very successful Communications Consultancy during this time.\nShe has been a parish councillor for 10 years, chair of South Kent Mind, is very involved in the local community where she lives, sitting on a range of committees, and stood as the Liberal Democrat candidate in the General Election in 2024.\nPenelope has been a vocal campaigner for the broader community of Dover & Deal on issues including the Dover & Deal Liberal Democrat campaign against the creation of an Internal Border Facility at Dover and protecting the Area of Outstanding Natural Beauty, located in Dover West.\nPenelope pledges to listen to local people and put them first. She will ensure more support for schools and young people, improved mental health provision and energy-efficient housing for local people at affordable prices.\nSANDWICH\nMartyn Pennington lives in the village of Woodnesborough, near Sandwich, with his wife, two cats and a mother-in-law of 95.\nBefore his retirement he was an internationally respected expert in overseas aid to poor countries, its effectiveness and \"value for money\". As an elder of the United Reformed Church and a member of Sandwich Town Council with ten years experience in local councils, he is well aware of the issues facing Sandwich and the surrounding area.\nMartyn says:\n\"I am passionate about bringing power to local communities, where so many people give their time and effort to help others.\nDover and Deal News\nDover & Deal Conservative MP votes against more support for local GP and ambulance services!\nDover & Deal’s Conservative MP has voted against a Liberal Democrat amendment which would have committed the government to improving local GP and ambulance wait times (15th November).\n72% Of All Burglaries In Kent Go Unsolved\nA staggering 72% of burglaries went unsolved in Kent in the 2022/2023 financial year - an average of 13 a day, new analysis has revealed.\nUK Lib Dem news\nOvertaking the Conservatives\nLocal Election Results Briefing: Our best ever winning streak\nVote Liberal Democrat Today\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nEnding Trump’s terrible trade war\nWe have to stand tough against Trump’s tariffs\nMeet Ed Davey\nLeader of the Liberal Democrats\nEd Davey is a husband, a father and a carer. He is the Leader of the Liberal Democrats.\nIt is Ed’s experience of caring that drives much of his politics, and motivates his tireless campaigning for a fair deal.\nLearn more about Ed\nOur people\nMeet our representatives and candidates.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_general-election-financial-appeal/content_23.html": "General Election Financial Appeal\nDear Member\nA General Election is looming, it could be as soon as this May, or later in the year.\nRegardless, Dover & Deal Liberal Democrats need to be ready to help change the\ndirection of the country and get the Conservatives out of government. To do this\nwe need your assistance. We must raise money for General Election\ncommunications with voters within the Dover & Deal constituency and the newly\nformed Herne Bay & Sandwich constituency where we will be sharing costs. These\nfunds do not come from HQ.\nIn the Dover and Deal constituency the funds raised will enable us to produce\nElection Address from Penelope James, which will be delivered by Royal Mail to\nall voters in the constituency. Excitingly, we’ve already booked our slot with the\nprinters, so we can be ready as soon as the General Election is called.\nIn Herne Bay and Sandwich where our candidate is Angie Curwen, we play a\nsupportive role. However, Angie was born and grew up in Sandwich and a properly\nfunded campaign will provide a good basis for future growth.\nWe need to step up our campaigning in both constituencies now. Money spent\nbefore an election is called is always more effective in gathering support than\nextra leaflets during the campaign. The MOST effective way you can help is by\nmaking a regular, reliable donation to our funds by setting up a standing order.\nAnything from £5 to £50 per month will make an enormous difference to our\ncampaign.\nTo donate via standing order you\n• set one up via your bank’s website to Dover and Deal Liberal Democrats – Unity Trust Bank, Sort Code: 60-83-01, Account Number: 20481421\n• or, you can fill in the form here [page on website.\nIf you would prefer to make a single donation then you can send it by bank transfer to Unity Trust Bank as per the details above, or by cheque made payable to Dover and Deal Liberal Democrats and sent to me by post at the address above.\nThe Liberal Democrats have had some fantastic by-election results in the past year against Conservatives and Labour and have shown that people like what we have to say. Any help you can give will make a real difference to our campaign.\nMany thanks for your ongoing support, it is greatly appreciated.\nAdrian Walker-Smith\nTreasurer, Dover & Deal Liberal Democrats\nPS The Conservative Party has already raised millions of pounds in donations to throw at their campaign in seats like Dover & Deal. Please act now to ensure we can hold our Conservative MPs to account.\nADRIAN WALKER-SMITH\n181 The Gateway\nDover\nCT16 1LL\nTel. 07539 692643\nEmail adrianwalkersmith@gmail.com\nMarch 2024",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_lib-dems-say-no-to-closing-richborough-and-deal-recycling-centres/content_12.html": "Lib Dems Say \"No\" to Closing Richborough and Deal Recycling Centres\nThe proposals from the Conservative-run Kent County Council to close the household waste recycling station at Richborough and possibly Deal, along with reductions in opening hours at other stations in east Kent have incensed local people.\nMartyn Pennington, local Lib Dem Sandwich Town Councillor says: “Not only have the Richborough and Deal sites the benefits of easy access, comprehensive facilities, and helpful staff, they are also central to the whole area.\n“Closing the Richborough and Deal recycling centres will mean residents will have to drive to the centre at Whitfield, Dover incurring unnecessary mileage and needless additional carbon pollution. It will also mean increased fly-tipping, to the detriment of our rural environment, and, sadly, redundancies for staff.\n“We are told the scheme is necessary to save money. But the savings would be tiny compared with the total KCC budget. Conservative councillors at KCC are happy to vote for pay increases for themselves and cuts for the rest of us. The financial cost of these cuts will fall partly on DDC, who do the household waste collections, so KCC are just passing the financial buck”.\n“Sandwich Town Council is working with neighbouring councils to fight the closure but coming just after the auctioning off by KCC - behind the Town Council’s back - of Sandwich’s old nursery school building, it shows how remote Conservative-led KCC in Maidstone is from what the local people want.\n“It seems that KCC, in these latest proposals, are trying to play off Deal and Richborough against each other. We are in touch with the organisers of the Deal campaign to work together.”\nPenelope James, Lib Dem Parliamentary Candidate for Dover added: “We are in the middle of climate change. We see the signs all around us. We need to be doing far more to encourage residents to recycle. Closing the Richborough and Deal tips will see us peddling backwards and make it more difficult than it is already to recycle. These centres provide an important service for our communities and a vital one in our efforts to confront climate change.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_the-pound1k-stealth-tax-facing-pensioners-in-dover-deal/content_36.html": "THE £1K STEALTH TAX FACING PENSIONERS IN DOVER & DEAL\n21 Mar 2024\nPENSIONERS IN DOVER AND DEAL FACING A £1K STEALTH TAX THANKS TO THE CONSERVATIVES!\nOur letter published in the Dover Express, March 21, 2024...\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_page-1/content_24.html": "Dover & Deal Liberal Democrats' Annual Lunch with Mike Martin MP\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nPenelope James is a strong campaigner, hard-working and honest. She has lived in the constituency for almost 25 years and ran her own very successful Communications Consultancy during this time.\nFrom Archers Farm Solar Site to Openness and Accountability at Sandwich Town Council.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nLeader's Speech to Spring Conference 2025\nThe Liberal Democrat plan commits to making the UK a global leader in animal welfare through stronger standards, workforce investment, and ethical farming practices.\nOnly the Liberal Democrats will stand up to Trump, invest in the UK’s security, support Ukraine, hold back Russia, deepen our ties with European and commonwealth partners, and stand up for liberal, British values.\nAs liberals, we believe that true equality is achieved when individuals are not only free from prejudice and discrimination, but also free to fulfil their potential. So fighting for LGBTQ+ rights is not a choice Liberals make.\nThe Liberal Democrats' bold plan to restore UK leadership in science and innovation will drive investment, boost global collaboration, and ensure technology benefits everyone, not just the privileged few.\nReflecting on the year’s International Women’s Day theme of “accelerate action”, I am sadly reminded of how much more we still need to achieve.\nThe UK needs to strengthen both our Armed Forces and our soft power.\nToday is Holocaust Memorial Day.\nThe UK must once again stand tall, leading on the world stage and working closely with those who share our interests – including, above all, our partners in Europe.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_martyn-pennington-liberal-democrat-councillor-for-sandwich-town-council-report-for-february-2024/content_38.html": "MARTYN PENNINGTON, LIBERAL DEMOCRAT COUNCILLOR FOR SANDWICH TOWN COUNCIL, REPORT FOR FEBRUARY 2024\nIn Sandwich, the positioning of the bus stop by the Guildhall Forecourt, which has just been renovated at a cost of over £1 million, is concerning residents because traffic approaching from behind the buses is unsighted. Furthermore and more worryingly, pedestrians cannot see vehicles approaching, especially cars intending to turn left into Cattle Market. There have already been several near misses and it’s only a matter of time before a serious accident occurs.\nSadly Kent County Council and Dover District Council have refused to take our residents’ concerns seriously. The Town Council passed a resolution maintaining our objections to the scheme, but regrettably Sandwich’s Conservative Kent County Councillor did not bother to attend and may be unaware of the serious risk to residents, particularly elderly people.\nI, along with most other town councillors, will continue to push for action by KCC to rectify this dangerous situation.\nI have also visted Sandwich Pantry, as I have a special concern for those in Sandwich who are not ‘just about managing’. The Pantry does a terrific job in providing food at cheap prices for those who cannot afford to shop at the main foodstores and supermarkets.\nI have also raised concerns that the Age UK centre in Sandwich, which supports elderly people throughout the area, gets sufficient funding to carry on its good work.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_martyn-pennington-our-liberal-democrat-sandwich-town-councillor-report-for-april-2024/content_7.html": "Martyn Pennington - Our Liberal Democrat Sandwich Town Councillor Report For May 2024\n2 Jun 2024\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_news-from-our-walmer-town-councillor-rick-blackwell/content_6.html": "NEWS FROM OUR WALMER TOWN COUNCILLOR, RICK BLACKWELL\n6 Sep 2024\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk/content_1.html": "Dover & Deal Liberal Democrats' Annual Lunch with Mike Martin MP\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nDover & Deal Liberal Democrats are proud to announce their candidates in Deal & Walmer, Dover North, Dover Town, Dover West and Sandwich\nDEAL AND WALMER\nHoward Evans has worked in the tyre and rubber industry most of his life and is still the Secretary-General of the Rubber Trade Association of Europe, responsible for the processes and procedures of the rubber market, contract development and discipline, and arbitration.\nHis experience opposes the hostile isolationist business policies with our commercial and geographic neighbours, supports fairness across our local communities and advances affordable practicable sustainable rural and town energy and transport policies.\nDEAL AND WALMER\nJohn Gosling has voted Liberal and then Liberal Democrat all his life. He writes:\n\"I joined the Party in 2015 in order to fight against Brexit and I stand for a restoration of harmony and alignment with Europe.\n\"I spent most of my career as a designer of high spec furniture and interiors, with many clients in the City of London.\n\"I have also had experience as a labourer, as a maintenance man in a dementia care home and charity fundraiser. This has given me a great insight into all levels of society.\n“I believe deeply in the values of Centre politics to prevent the excesses of the Far Right and Far Left and I am committed to the balance and common sense it represents.”\nDOVER NORTH\nBob Hope has lived in Dover District for almost 25 years. He has considerable business acumen having run and chaired several international companies involved in transport, sport and television.\nBob is heavily involved in the local community and has raised considerable funds through fund-raising and sponsorship to revitalise a village asset and bring it back to life.\nBob will bring his broad experience and drive to his role as a Kent County Councillor. He is particularly keen in ensuring that value for money is a key priority.\nAs a Liberal Democrat he wants to see greater provision for children and young people – particularly when it comes to access to sport; improved road management and repair of pot-holes: greater focus on support for green energy and protecting the environment; and a sensible and joined up approach to more affordable and social housing provision, built sustainably.\nDOVER TOWN\nRyan Grimes was born and raised in Dover as part of a large and close-knit family. He knows the everyday frustrations shared by many Dovorians; from pot holes and increasingly reckless driving in town, to watching Dover lag behind in terms of services, investment, and opportunity.\nHaving a broad career covering climate research, parkland management, and fighting forest fires by helicopter, Ryan wants to fight to make Dover better for everyone.\n“Dover has so much potential, so much to be proud of. Cooperation and communication can unlock so much good for the town and its people. We can no longer be an afterthought.”\nDOVER TOWN\nAdrian Walker-Smith was originally a member of the Liberal Party and joined the Liberal Democrats when the party was founded in 1988.\nHe has lived in Dover Town since 2021. His career started with acting at the Old Vic, moved through customer services with Readers’ Digest, continued with various roles in the Civil Service including leading the Cartel Investigation Branch of the Office of Fair Trading, and concluded with ten years as an Independent Member of the Parole Board.\nHe currently volunteers with two charities in Dover.\nDOVER WEST\nPenelope James has lived in Dover West Ward for nearly 25 years and ran her own very successful Communications Consultancy during this time.\nShe has been a parish councillor for 10 years, chair of South Kent Mind, is very involved in the local community where she lives, sitting on a range of committees, and stood as the Liberal Democrat candidate in the General Election in 2024.\nPenelope has been a vocal campaigner for the broader community of Dover & Deal on issues including the Dover & Deal Liberal Democrat campaign against the creation of an Internal Border Facility at Dover and protecting the Area of Outstanding Natural Beauty, located in Dover West.\nPenelope pledges to listen to local people and put them first. She will ensure more support for schools and young people, improved mental health provision and energy-efficient housing for local people at affordable prices.\nSANDWICH\nMartyn Pennington lives in the village of Woodnesborough, near Sandwich, with his wife, two cats and a mother-in-law of 95.\nBefore his retirement he was an internationally respected expert in overseas aid to poor countries, its effectiveness and \"value for money\". As an elder of the United Reformed Church and a member of Sandwich Town Council with ten years experience in local councils, he is well aware of the issues facing Sandwich and the surrounding area.\nMartyn says:\n\"I am passionate about bringing power to local communities, where so many people give their time and effort to help others.\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nPenelope James is a strong campaigner, hard-working and honest. She has lived in the constituency for almost 25 years and ran her own very successful Communications Consultancy during this time.\nFrom Archers Farm Solar Site to Openness and Accountability at Sandwich Town Council.\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nEd Davey is a husband, a father and a carer. He is the Leader of the Liberal Democrats.\nIt is Ed’s experience of caring that drives much of his politics, and motivates his tireless campaigning for a fair deal.\nMeet our representatives and candidates.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_martyn-pennington-liberal-democrat-councillor-for-sandwich-town-council-report-for-september-2024/content_2.html": "MARTYN PENNINGTON, LIBERAL DEMOCRAT COUNCILLOR FOR SANDWICH TOWN COUNCIL, REPORT FOR SEPTEMBER 2024\nIn Sandwich, the positioning of the bus stop by the Guildhall Forecourt, which has just been renovated at a cost of over £1 million, is concerning residents because traffic approaching from behind the buses is unsighted. Furthermore and more worryingly, pedestrians cannot see vehicles approaching, especially cars intending to turn left into Cattle Market. There have already been several near misses and it’s only a matter of time before a serious accident occurs.\nSadly Kent County Council and Dover District Council have refused to take our residents’ concerns seriously. The Town Council passed a resolution maintaining our objections to the scheme, but regrettably Sandwich’s Conservative Kent County Councillor did not bother to attend and may be unaware of the serious risk to residents, particularly elderly people.\nI, along with most other town councillors, will continue to push for action by KCC to rectify this dangerous situation.\nI have also visted Sandwich Pantry, as I have a special concern for those in Sandwich who are not ‘just about managing’. The Pantry does a terrific job in providing food at cheap prices for those who cannot afford to shop at the main foodstores and supermarkets.\nI have also raised concerns that the Age UK centre in Sandwich, which supports elderly people throughout the area, gets sufficient funding to carry on its good work.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_cllr-rick-blackwell-liberal-democrat-member-of-walmer-town-council-reports-on-his-take-on-the-controversial-decision-to-buy-62-the-strand-as-council-offices/content_21.html": "62 The Strand: An Asset for Walmer\nA few years ago Walmer Town Council made the controversial decision to buy 62 The Strand to use as offices. There were also concerns over the lease of 8 The Strand, the premises they had previously used. It would appear that this is all flaring up again, with several of the new councillors seeking to ‘re-fight’ the battle, with some wanting to sell no.62 and rent again.\nI am against this as I believe that the office is an asset for Walmer.\nFurthermore, the Public Works loan used to buy it is charged at less than 2% interest for the life of the debt. It is true that it is not fully fit for purpose insofar as we cannot hold large meetings there, but this was also true of the previous office.\nAs we still hold the lease for no.8 we are now holding meetings there, which is possible because there is no office furniture and equipment present.\nMy view is that we should keep no.62, which gives us good office and storage space, continue with our efforts to reassign the lease for no.8 and rent halls for meetings as before. Ultimately we could remodel no.62 so meetings can take place there. This is a source of great frustration to me as this subject seems to be taking up a lot of time and energy that could be spent elsewhere.\nCllr Rick Blackwell",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_agm-2024/content_30.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_our-letter-in-the-dover-express-and-east-kent-mercury-january-31-2024-concerning-the-appalling-57-rise-in-ae-waiting-times-in-east-kent-since-2019/content_27.html": "Our Letter In The Dover Express and East Kent Mercury (January 31, 2024) Highlighting The Appalling 57% Rise In A&E Waiting Times In East Kent Since 2019\nOur Letter in the Dover Express, May 16, 2024\nSewage dumping in Dover & Deal up 370% in 2023\nDear Editor\nI have just learnt that sewage dumping in Dover & Deal increased by a shocking 370% in 2023, up 195% on 2022 figures. That equates to 930 hours, or almost 18 hours per week!\nThe sewage scandal is worsening by the day, under the noses of the Conservative government, and what are they doing about it? Nada. They just sit on their hands and look the other way, while water companies pay their shareholders millions of pounds in dividends instead of investing taxpayers’ money in infrastructure.\nUnbelievably, nationwide, sewage was dumped into England’s rivers over 460,000 times for a total of over 3.6 million hours in 2023. It’s got to stop.\nFrankly, I find it disgusting that our water companies in Dover & Deal felt they could pump filthy sewage into our waterways so many times last year, impacting so negatively on our precious environment.\nWe cannot go on like this, allowing water companies to dump sewage whenever they feel like with no redress.\nThe Liberal Democrats have led the way for years in campaigning for tougher action. I want to see a tougher water regulator, an end to bonuses for polluting water company bosses and stronger protections for our local environment.\nResidents of Dover & Deal, and our environment, deserve a fair deal on sewage discharges, nothing less.\nYours faithfully\nPenelope James\nLiberal Democrat Parliamentary Candidate for Dover & Deal\nSaid Penelope James, Liberal Democrat Parliamentary Candidate for Dover & Deal:\n\"Our East Kent Hospitals University NHS Foundation Trust, which includes Buckland Hospital, Dover, deserves so much better than this out-of-touch Conservative government which is ignoring the suffering of patients, driving our health service into the ground and eroding confidence in timely medical help.\n\"Liberal Democrats are committed to ensuring everyone gets the care and treatments they need, including accessible GP services, overhauling NHS Dentistry & boosting cancer survival rates.\"",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_search/content_10.html": "Dover & Deal Liberal Democrats' Annual Lunch with Mike Martin MP\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nAll East Kent Lib Dem members are more than welcome to join Mike Martin and Dover and Deal Lib Dems on Saturday 8th February.\nDover and Deal LibDems AGM 2024 Draft minutes of our 2024 AGM All you need to know about our AGM 2024 Chair's Annual Report\nIn Sandwich, the positioning of the bus stop by the Guildhall Forecourt, which has just been renovated at a cost of over £1 million, is concerning residents because traffic approaching from…\nKENT COUNTY COUNCIL ELECTIONS, 1 MAY 2025 Dover & Deal Liberal Democrats are proud to announce their candidates in Deal & Walmer, Dover North, Dover Town, Dover West and Sandwich DEAL AND…\nPenelope James is a strong campaigner, hard-working and honest. She has lived in the constituency for almost 25 years and ran her own very successful Communications Consultancy during this time.\nFrom Archers Farm Solar Site to Openness and Accountability at Sandwich Town Council.\nA General Election is looming. It must be called by the end of this year, though the actual date is up to Rishi Sunak to decide.\nPlay areas, Outdoor Gyms and No Mow for Biodiversity.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_72-of-all-burglaries-in-kent-go-unsolved/content_33.html": "72% Of All Burglaries In Kent Go Unsolved\nA staggering 72% of burglaries went unsolved in Kent in the 2022/2023 financial year - an average of 13 a day, new analysis has revealed.\nThe figures, from official Home Office statistics, show that in 2022/2023 a total of 4,850 burglaries in Kent were closed without a suspect being identified, accounting for 72% of all cases. Meanwhile, just 6% of Kent burglaries resulted in a suspect being charged or summonsed.\nThe national figures paint a similarly dire picture. Across England and Wales, nearly 77% of all burglaries went unsolved in that same time period.\nDover & Deal Liberal Democrats have slammed the Government for these figures. Since 2015, the Conservatives have taken over 4,000 Police Community Support Officers off the streets. And as of last year, just 12% of officers across England and Wales were assigned to frontline neighbourhood policing teams.\nThe Liberal Democrats are calling for a return to proper community policing, where officers are trusted and visible in their neighbourhoods, with the time and resources to focus on tackling local crimes like burglaries. The party is also calling for a new “Burglary Response Guarantee” under which all domestic burglaries would be attended by the police and properly investigated.\nCommenting, Liberal Democrat Parliamentary Candidate for Dover & Deal, Penelope James, said:\n“Everyone deserves to feel safe and secure in their own homes. But under this terrible Government, so many burglars are getting off scot-free. These figures will bring little comfort to families and pensioners in Kent.\n“It’s a disgrace that our local communities are paying the price for the Conservative Government’s failures to get tough on burglaries.\n“The Conservatives must finally bring back proper community policing and back the Liberal Democrats Burglary Response Guarantee so all burglaries are attended by the police. It’s the only way to reverse these shocking figures.”",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_penelope-james-our-dover-deal-candidate-for-the-general-election-on-july-4/content_3.html": "Penelope James - Our Dover & Deal Candidate for the General Election on July 4\nPenelope James is the Liberal Democrat candidate for Dover & Deal. She is a strong campaigner, hard-working and honest. She has lived in the constituency for almost 25 years and ran her own very successful Communications Consultancy during this time.\nPenelope has been a parish councillor for 8 years, Chair of South Kent Mind (the mental health charity), Vice-Chair of Governors for a secondary school and is very involved in the local community where she lives, sitting on a range of committees and campaigning locally on environmental issues.\nPenelope has been a vocal campaigner for the broader community of Dover & Deal on issues from ensuring the blood testing clinic in Victoria Hospital, Deal is reinstated, to leading the Dover & Deal Liberal Democrat campaign against the creation of an Internal Border Facility at Dover.\nPenelope’s priorities are to fight for a fairer, greener and more prosperous Dover & Deal constituency for everyone. She pledges to listen to local people and put them first.\nSpecifically, she is campaigning for urgent action to cut the cost-of-living crisis, ensure everyone has access to see a GP and dentist, build more social houses and homes that are properly insulated, and protect our environment, including putting an end to the sewage scandal and making water companies clean up their act.\nVOTE FOR PENELOPE JAMES ON JULY 4!\nIf you'd like to help Penelope with her campaign you can contact her at info@doverdeallibdems.org.uk",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_social-events/content_8.html": "PIZZA & POLITICS EVENING\nWITH GRAHAM COLLEY\nFRIDAY, APRIL 4, 2025| 7.30 - 10PM\nGUSTON VILLAGE HALL\nThe Street, Guston, Dover CT15 5EU\nCome and join us for a relaxed, social evening with other Lib Dem members and supporters and find out more about our distinguished guest speaker Graham Colley.\nGraham is a long-time resident of Kent, living and working in Rochester as a solicitor. He is President of the Liberal Democrat Lawyers Associationand used to work as a Legal Aid solicitor, so has real experience in dealing with the police, and the issues they face in Kent.\nHe was our Liberal Democrat Candidate for the role of Kent Police & Crime Commissioner in May 2024.\nGraham has spent a lifetime fighting for human rights, civil liberties and access to justice. He is determined to use the limited police resources in Kent to prevent crime, aid victim support and cut reoffending rates.\nTickets are £10 a head (in advance), or £12 on the door, and include pizza and dessert, soft drinks/tea/coffee. You are welcome to bring your own wine/beer.\nTo book tickets (prior to the event) or contact: secretary@doverdeallibdems.org.uk / phone 07570 026989\nHurrah! - our Lib Dem Gatherings are back, starting this Wednesday February 26 and continuing for the rest of the year.\nWhy not come and join us for a relaxed chat over a pint of beer/glass of wine/cup of coffee/tea about politics, the universe and everything in between. Find out more about our events in Dover District, the up-coming Kent County Elections and how you can get involved\nWe're a friendly bunch, so why not pitch up on Wednesday and meet some new people who really care about our community and want to make things happen?\nWe generally meet in the bar area upstairs but if you can't find us we may be in one of the function rooms\nFuture Gatherings will take place on:\nWednesday March 26\nWednesday April 30\nWednesday May 28\nWednesday June 25\nDOVER & DEAL LIB DEM COFFEE MORNINGS\nOur regular morning meet-up with delicious cakes and biscuits to discuss life, politics, the universe and everything in between.\nThey take place on the second Thursday of every month\nTime: 10.30am - noon\nOur next Coffee Mornings are:\nThursday March 13, 2025\n1 Elizabeth Drive, Woodnesborough\nSandwich, CT13 0FR\nTime: 10.30am - noon\nTel: 07710 030278\nThursday April 10, 2025\n181 The Gateway, Dover\nCT16 1LL\nTime: 10.30am - 12 noon\nTel: 07791 752049\nThursday May 8, 2025\n2 West View, 2 Cop Street\nAsh, Canterbury, CT3 2DN\nTime: 10.30am - 12 noon\nTel: 07791 752049\nThursday June 12, 2025\n36 Willowbank, Sandwich\nCT13 9QA\nTime: 10.30am - 12 noon\nTel: 07810 835389\nThursday July 10, 2025\n117 Dover Road, Sandwich\nCT13 ODA\nTime: 10.30am - 12 noon\nTel: 07788 175434\nAdults £5",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_rick-blackwell-our-liberal-democrat-walmer-town-councillor-report-for-february-2024/content_37.html": "RICK BLACKWELL OUR LIBERAL DEMOCRAT WALMER TOWN COUNCILLOR REPORT FOR FEBRUARY 2024\nIn my role as a Walmer Town Councillor, I sit on the Amenities and Environment Committee, The Planning Committee and the Climate Emergency Working Group.\nThe projects that I have been involved with during February 2024 include:\n- Planning and approval of converting Stoney Path (a parcel of waste ground to the rear of the allotments) to a Community Orchard. Work has commenced on this.\n- Exploring the possibility of the Council taking over a piece of land to the rear of Churchill Avenue from Dover District Council to turn into a community space. This has included a consultation of local residents.\nResidents have also raised some concerns with me about the state of the Rose Walk and Pergola in Marke Wood park, along with concerns about the play area. I was pleased to be able to raise these matters with DDC’s head of Parks and Open Spaces who informed the Council that they were seeking funding to carry out necessary repairs. Since then the pergola has been demolished which is disappointing to say the least.\nThe controversy about the Council’s purchase of 62 The Stand as an office still rumbles on. I have been a strong advocate of our keeping this property as our office as we have it on very favourable terms. Meaning the Mortgage payment is much cheaper than renting, and of course we have the office as an asset for Walmer.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_dover-deal-liberal-democrats-annual-lunch-with-mike-martin-mp/content_16.html": "Dover & Deal Liberal Democrats' Annual Lunch with Mike Martin MP\nThe Dover & Deal Lib Dem Annual Lunch is taking place on Saturday February 8, 2025 from 12.30 - 3pm. Our speaker will be Mike Martin, our recently elected MP for Tunbridge Wells.\nMike was elected as Member of Parliament (MP) for Tunbridge Wells in July 2024 with 43.6 per cent of the vote and a majority of 8,687 over the second-placed Conservative candidate. He is the first non-Conservative to win the constituency since it was first contested in February 1974.\nMike describes himself as a pro-European, internationalist, \"explicitly pro-green\", and is in favour of a strong stance on defence. He is an ex-soldier, military strategist, and author and served multiple tours in Helmand Province during the War in Afghanistan.\nHe has a degree in biological sciences from the University of Oxford and a Doctor or Philosophy (PhD) degree in war studies from King's College London, which he completed in 2013 with a thesis entitled War on its Head: An Oral History of the Helmandi Conflict 1978-2012. He is also a senior visiting research fellow at King's College London.\nTickets are £37 and include a welcome glass of fizz and a buffet lunch. You can book tickets here.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_dover-deal-liberal-democrats-campaign-against-the-dover-inland-border-facility/content_15.html": "Dover & Deal Liberal Democrats Campaign Against the Dover Inland Border Facility\nThe Dover Inland Border Facility base at the Whitcliffs Business Park, Whitfield has cost £18.3 million to build and £20 million to purchase the land!\nDover & Deal Lib Dems have campaigned hard against the siting of the Inland Border Facility at Whitcliffs Business Park, Whitfield and continue to do so.\nWe have issued several news releases, spoken to Meridan News, completed two HMRC Surveys and asked Lib Dem Peer Baroness Jenny Randerson, Transport Spokesperson, to ask questions regarding the facility in the House of Lords. These ranged from why no Environmental Impact Assessment (EIA) was originally undertaken; how light pollution would be mitigated and why the usage of IBFs in Kent has been considerably less that predicted prior to the end of the Brexit Transition period. Sadly, the responses have not included any concrete information.\nThe facility lies empty. The jobs that were to have been created – around 200 – have not materialised and we now understand that the Dover IBF has been taken over by the Department of Transport which has refused to reveal its ongoing spending on security, meaning the bill is almost certainly higher than the figure of £18.3 million.\nIndeed, the huge IBF at Sevington, Ashford, (230 acres), which is barely used, cost £154 million to build plus running costs of £89 million. Kent County Council has received an additional £9.2m revenue funds related to resource for traffic management, auxiliary operational facility support, temporary facilities, signage and winter services costs this includes c£730,000 for staff costs for their project and contract management services since July 2020!\nThe scale of the of the costs are mind-boggling. Nationwide at least £466 million was spent on constructing and running the unwanted sites across England and Wales – and four of the seven sites are now closed!\nMarch 2023\nBACKGROUND TO THE DOVER INLAND BORDER FACILITY AND OUR CAMPAIGN – November 2021\nThe Conservative Government had four years to prepare for Brexit and then, at the last minute, came up with a plan which, it appears, was barely researched, and ill-thought out. There was almost no consultation with the local community. Residents were contacted by letter on 31 December 2020 to be informed that a 1200 lorry park was to be built virtually in their back gardens (at Guston) with only a couple of weeks to respond. Even Dover District Councillors were only permitted (at a meeting held in secret) to see the application 24 hours before a Council meeting to approve the plans. Neither were Councillors allowed to disclose the details to others prior to that Council meeting!\nDover & Deal Lib Dems, supported by Lib Dem Peer Baroness Jenny Randerson, Transport Spokesperson in the House of Lords, have asked why no Environmental Impact Assessment (EIA) was undertaken. In 2019 the Conservative Government introduced a law which specified that a Special Development Order (SDO) cannot be used for any development over 5 hectares without an EIA. The site at White Cliffs / Guston covers 37 hectares (91 acres). It now appears that, under emergency Brexit legislation, ministers can grant SDOs regardless of its 2019 legislation! (It’s a case of making up the rules as we go along.)\nBaroness Randerson has brought a regret motion querying the use of the SDO and asked several written questions in the House of Lords over the past two years regarding the cancellation of meetings, the impact of light pollution and why the usage of IBFs in Kent has been considerably less that predicted prior to the end of the Transition period. Sadly, the responses have not included any concrete information.\nConcerns raised by various local parties including Dover & Deal Lib Dems have included environmental impact and traffic implications, as the A2 is a single lane road in both directions at various points from and to Dover Port, and struggles with congestion at busy times already. According to the news release, these concerns have been listened to and acted upon, but it remains to be seen.\nUPDATE – July 2021\nThe Cabinet Office has recently undertaken a review of costs and feasibility on all the IBFs in Kent and has confirmed that it is still committed to going ahead with the site at White Cliffs / Guston.\nHowever, the IBF will now only utilise one quarter of the site and that will be towards the western edge close to existing retail park, the new Dover Leisure Centre, Christchurch Academy, Duke of York Royal Military School and Guston & Whitfield primary schools, which is of concern. There is no information, as yet, as to what will happen with the remaining land. The site cost £8.5 million. HMRC are to take over the site from the DfT and the proposed DEFRA checks in relation to animals will no longer take place at White Cliffs / Guston because of the site’s unsuitable geological features, substantial levels of chalk and, as the land sits on top of the aquifer, the undulating nature of the site renders it unsuitable!\nThis means DEFRA is currently in negotiations regarding a new site in Dover which they propose to lease for 5 years, at more cost to the taxpayer. They have yet to reveal the location of the site.\nThe existing site at White Cliffs / Guston is now to become be a permanent fixture (it was originally only going to be needed for five years) but plans have still to be revealed, promised in August. However, it is anticipated that 1,000 lorries will use the site on a daily basis, though that may tail off over a period of time. There is no current timescale as to when development might begin but it is thought it will not commence until Summer 2022, presumably while the A2 is upgraded to a dual carriage way (tbc).\nGuston Parish Council has raised the issue of lighting, which has caused such controversy at the Sevington IBF, and has been reassured that mistakes made at Sevington will not be replicated at the White Cliffs / Guston IBF.\nThere remains a question about the North Downs Way which incorporates the old Roman Road to Dover and how it is going to be redirected – such a shame.\nThe Conservative MP, KCC and DDC leaders, in their recent news release, say the new development will ensure millions of pounds of investment into the Dover area, and describe it as a “real Brexit boost”, with hundreds of jobs created by HMRC, health operations and the increase in port business.\nResidents say that benefits to local job seekers would be the same if the location of the IBF were moved to a better, safer and more appropriate site. They estimate only a couple of hundred jobs will be created – better than nothing, but at enormous cost both financially and to the local community and environment.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_september-news-from-our-walmer-town-councillor-rick-blackwell/content_5.html": "SEPTEMBER NEWS FROM OUR WALMER TOWN COUNCILLOR, RICK BLACKWELL\n8 Oct 2024\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_joshua-babarinde-obe-our-fantastic-speaker-at-the-dover-deal-annual-lunch/content_32.html": "JOSHUA BABARINDE OBE - OUR FANTASTIC SPEAKER AT THE DOVER & DEAL ANNUAL LUNCH, OCTOBER 14, 2023\nDover & Deal Liberal Democrats’ Annual Lunch, October 14, 2023\nJoshua Babarinde OBE, Liberal Democrat Parliamentary Candidate for Eastbourne was the guest speak at the Dover & Deal Liberal Democrats’ Annual Lunch on Saturday October 14, 2023, at Ash Village Hall, Ash.\nJosh was awarded an OBE for services to criminal justice, social enterprise and the economy in 2020 at the age of 26. He has been identified by Forbes Magazine, the influential American business magazine, as one of the top young social entrepreneurs in Europe as part of their 30 under 30.\nJosh spoke about the need for urgent change in our politics, that people should be able to achieve their goals, without relying on luck. “Luck shouldn’t come into it”, he said. “As a Liberal Democrat I believe everyone should have the opportunity to grow and thrive no matter what their circumstances, religion, gender or race. As a Liberal Democrat I want to create a fair, free and open society in which the fundamental values of liberty, equality and community are fairly balanced.”\nJosh also spoke about his challenge to Conservative MPs over the sewage crisis in our waterways and coastlines, how we must change the reliance on foodbanks, how Liberal Democrats have concrete plans to support people through the cost of living crisis, to provide the housing that people need and in the right places, to rescue the NHS and ensure we have proper community policing on our streets.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_dover-deal-conservative-mp-votes-against-more-support-for-local-gp-and-ambulance-services/content_31.html": "Dover & Deal Conservative MP votes against more support for local GP and ambulance services!\nNEWS RELEASE\nIssued November 17, 2023\nDover & Deal Conservative MP votes against\nmore support for local GP and ambulance services!\nDover & Deal’s Conservative MP has voted against a Liberal Democrat amendment which would have committed the government to improving local GP and ambulance wait times (15th November).\nLiberal Democrats in Dover & Deal have criticised Natalie Elphicke MP for voting against the amendment as NHS waiting lists hit a record 7.8 million earlier this month, saying it shows a “callous disregard for patients waiting in pain”.\nThe amendment also called on the Conservative government to build the 40 new hospitals it promised and to bring in measures to address the crises in the NHS and social care.\nThe Liberal Democrats have set out a clear plan to fix local health services, including giving people the right to see a GP within a week, or 24 hours if in urgent need. (See graphic attached).\nDover & Deal Liberal Democrat spokesperson, Penelope James said:\n“Natalie Elphicke MP has shown a callous disregard for patients waiting in pain. Residents in Dover & Deal deserve local health services that provide the care people need, instead of being forced to wait for weeks on end for a GP appointment, or hours for an ambulance to arrive. Sadly, this Conservative government has run our NHS into the ground.\n“It’s clear that communities like ours have been taken for granted by the Conservative Party for far too long. Dover & Deal deserves a strong local champion who will stand up for our health services in Parliament. Voters know that, with the Liberal Democrats, they will get just that.”\nENDS\nNotes to Editors:\n- The record of the votes on the amendment can be found here.\n- The text of the Liberal Democrat amendment can be found here (amendment k).",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_walmer-town-council-cllr-blackwells-update-for-april-2024/content_22.html": "Walmer Town Council - Cllr Blackwell's Update for April 2024\n2 May 2024\nThis website uses cookies\nLike most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_half-mortgage-borrowers-fear-losing-their-homes-as-rates-soar/content_26.html": "Half Mortgage Borrowers Fear Losing Their Homes as Rates Soar\nAlmost one in two mortgage borrowers are now worried about losing their home because of soaring bills, a shocking new poll has revealed.\nIt comes as the average two-year fixed mortgage rate reaches a new 15-year high of 6.66 per cent.\nPolling from Savanta, commissioned by the Liberal Democrats, shows 46% of adults with a mortgage said they were worried about losing their home because of unpaid bills in June.\nDover & Deal Liberal Democrats are calling for a Mortgage Protection Fund, which would offer targeted support of up to £300 a month to those families facing the steepest rise in mortgage costs and in danger of losing their homes. This would be based on past schemes and be fully paid for by reversing Conservative tax cuts to big banks.\nResponding to the news that fixed-rate mortgages have risen to the mini-budget peak, Liberal Democrat Parliamentary Candidate for Dover, Penelope James said:\n\"Latest mortgage rates are just another hammer blow to millions of families right across the county, inflicted by this out-of-touch Conservative government.\n\"Every month our Conservative Government brings more cold comfort to millions of hardworking families across Dover struggling with their mortgages and the cost of living.\n\"Conservative Ministers have sat on their hands for far too long and done nothing and put their heads in the sand. It’s not good enough.\n\"We need real action to help people with their mortgages and that starts by introducing the Liberal Democrats' mortgage protection fund.\"",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_page-2/content_18.html": "General Election Financial Appeal\nA General Election is looming. It must be called by the end of this year, though the actual date is up to Rishi Sunak to decide.\nDover & Deal Liberal Democrats are proud to announce their candidates in Deal & Walmer, Dover North, Dover Town, Dover West and Sandwich\nDEAL AND WALMER\nHoward Evans has worked in the tyre and rubber industry most of his life and is still the Secretary-General of the Rubber Trade Association of Europe, responsible for the processes and procedures of the rubber market, contract development and discipline, and arbitration.\nHis experience opposes the hostile isolationist business policies with our commercial and geographic neighbours, supports fairness across our local communities and advances affordable practicable sustainable rural and town energy and transport policies.\nDEAL AND WALMER\nJohn Gosling has voted Liberal and then Liberal Democrat all his life. He writes:\n\"I joined the Party in 2015 in order to fight against Brexit and I stand for a restoration of harmony and alignment with Europe.\n\"I spent most of my career as a designer of high spec furniture and interiors, with many clients in the City of London.\n\"I have also had experience as a labourer, as a maintenance man in a dementia care home and charity fundraiser. This has given me a great insight into all levels of society.\n“I believe deeply in the values of Centre politics to prevent the excesses of the Far Right and Far Left and I am committed to the balance and common sense it represents.”\nDOVER NORTH\nBob Hope has lived in Dover District for almost 25 years. He has considerable business acumen having run and chaired several international companies involved in transport, sport and television.\nBob is heavily involved in the local community and has raised considerable funds through fund-raising and sponsorship to revitalise a village asset and bring it back to life.\nBob will bring his broad experience and drive to his role as a Kent County Councillor. He is particularly keen in ensuring that value for money is a key priority.\nAs a Liberal Democrat he wants to see greater provision for children and young people – particularly when it comes to access to sport; improved road management and repair of pot-holes: greater focus on support for green energy and protecting the environment; and a sensible and joined up approach to more affordable and social housing provision, built sustainably.\nDOVER TOWN\nRyan Grimes was born and raised in Dover as part of a large and close-knit family. He knows the everyday frustrations shared by many Dovorians; from pot holes and increasingly reckless driving in town, to watching Dover lag behind in terms of services, investment, and opportunity.\nHaving a broad career covering climate research, parkland management, and fighting forest fires by helicopter, Ryan wants to fight to make Dover better for everyone.\n“Dover has so much potential, so much to be proud of. Cooperation and communication can unlock so much good for the town and its people. We can no longer be an afterthought.”\nDOVER TOWN\nAdrian Walker-Smith was originally a member of the Liberal Party and joined the Liberal Democrats when the party was founded in 1988.\nHe has lived in Dover Town since 2021. His career started with acting at the Old Vic, moved through customer services with Readers’ Digest, continued with various roles in the Civil Service including leading the Cartel Investigation Branch of the Office of Fair Trading, and concluded with ten years as an Independent Member of the Parole Board.\nHe currently volunteers with two charities in Dover.\nDOVER WEST\nPenelope James has lived in Dover West Ward for nearly 25 years and ran her own very successful Communications Consultancy during this time.\nShe has been a parish councillor for 10 years, chair of South Kent Mind, is very involved in the local community where she lives, sitting on a range of committees, and stood as the Liberal Democrat candidate in the General Election in 2024.\nPenelope has been a vocal campaigner for the broader community of Dover & Deal on issues including the Dover & Deal Liberal Democrat campaign against the creation of an Internal Border Facility at Dover and protecting the Area of Outstanding Natural Beauty, located in Dover West.\nPenelope pledges to listen to local people and put them first. She will ensure more support for schools and young people, improved mental health provision and energy-efficient housing for local people at affordable prices.\nSANDWICH\nMartyn Pennington lives in the village of Woodnesborough, near Sandwich, with his wife, two cats and a mother-in-law of 95.\nBefore his retirement he was an internationally respected expert in overseas aid to poor countries, its effectiveness and \"value for money\". As an elder of the United Reformed Church and a member of Sandwich Town Council with ten years experience in local councils, he is well aware of the issues facing Sandwich and the surrounding area.\nMartyn says:\n\"I am passionate about bringing power to local communities, where so many people give their time and effort to help others.\nA General Election is looming. It must be called by the end of this year, though the actual date is up to Rishi Sunak to decide.\nPlay areas, Outdoor Gyms and No Mow for Biodiversity.\nCllr Rick Blackwell, Liberal Democrat member of Walmer Town Council reports on his take on the controversial decision to buy 62 The Strand as council offices.\nOur latest letter in the Dover Express: its a scandal that filthy sewage is being pumped into our rivers and coastlines.\nStill no progress on Sandwich Guildhall bus stop.\n70% OF pensioners in Dover and Deal face a £15.6 million tax bombshell Click on title to read the full story\nLocal Election Results Briefing: Our best ever winning streak\nEvery vote for the Liberal Democrats counts. It's a vote to elect a strong local champion, who will fight for a fair deal for you and your community.\nWe have to stand tough against Trump’s tariffs\nEd Davey is a husband, a father and a carer. He is the Leader of the Liberal Democrats.\nIt is Ed’s experience of caring that drives much of his politics, and motivates his tireless campaigning for a fair deal.\nMeet our representatives and candidates.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_march-report-from-sandwich-town-councillor-martyn-pennington/content_39.html": "March Report from Sandwich Town Councillor, Martyn Pennington\nMartyn Pennington reports:\nRECEPTION FOR VOLUNTARY ORGANISATIONS: On 26 March, the Mayor hosted a reception for the leaders of the main voluntary organisations in Sandwich which I attended.These organisations are vital for the life of the community in Sandwich, meeting all sorts of needs. Sadly, most of the funding from Kent and Dover councils has dried up over the last few years, so important organisations, like those helping the elderly, disabled and young people, are starved of resources. Often their hard work as volunteers goes unnoticed by the general public, so events like this reception give them the recognition which is richly deserve.\nBUS STOP BY THE GUILDHALL, SANDWICH: At the Town Council meeting on 25 March, I raised the issue of the dangerous placement of the Guildhall bus stop with Sandwich’s Kent County Councillor. Sadly, she was unable to bring any news of progress in resolving the issue. This is an accident waiting to happen.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_dover-deal-liberal-democrats-plans-for-the-district/content_29.html": "Dover & Deal Liberal Democrats – Plans For The District\nDover & Deal Liberal Democrats are campaigning for a fairer, greener and more prosperous Dover and a brighter future for the next generation.\nHOUSING\nWe need new homes, but believe we should be building the right houses (more affordable homes and council houses) supported by roads, facilities and services (public transport, shops, GP surgeries, schools) in the right places.\nWe will urgently push for all homes in the District to be insulated and all new builds to be built sustainably, and include proper insulation, heat-pumps, solar-panels and electric vehicle charging points, and incentivise building to PASSIVHAUS standard.\nWe will challenge the unrealistic housing target imposed by the Conservative Government on local councils and we will improve planning enforcement by giving planning officers the teeth they need to strictly enforce planning breaches.\nENVIRONMENT\nThe environment is at the heart of everything we do. We will ensure the Conservative-led commitment to making Dover carbon-neutral by 2030 is rigorously pursued and exceeded if possible.\nWe will plant more trees in the district and protect existing trees more strictly.\nWe will push to put a stop to sewage dumping and demand water companies stop discharging raw sewage into our rivers and seas killing off our wildlife and impacting on our coastlines and tourism.\nWe will tackle Air Quality - particularly for Dover residents, who live near the port and the A20.\nWe will clamp down on Litter & Fly-tipping in town centres, along the A2 and our rural hedgerows and ensure our streets are kept free from litter and weeds without the use of glyphosates.\nAnd finally, we will rigorously protect the Area of Outstanding Natural Beauty which takes up a considerable part of our District.\nHEALTHIER COMMUNITIES\nWe pledge to build a community that works for everyone. Liberal Democrats have called for a return to proper local health services. (There are now 2,679 patients for every GP in Kent & Medway, up by 18% since 2016.) And support the campaign to reinstate the Blood Service at Deal Hospital and retain other services which have been reduced.\nWe are concerned about the level of anti-social behaviour and crime in the area which is going unsolved (only 5% of burglaries in Kent are currently solved) and will push for the recruitment of more Community Police Officers.\nWe will work hard to expand support to new businesses, particularly green enterprises, and bring empty upstairs floors of Dover/Deal high street back into residential use or office space.\nTRANSPORT\nImproved public transport, which is sustainable, particularly in rural areas, is vital and we need more cycle routes to encourage people out of their cars.\nWe will work with Kent Highways to crack down on speeding and introduce more ‘20 is Plenty’ zones – as we know they lead to 20% fewer casualties, improve the environment by reducing CO2 emissions, are 50% quieter, and have little impact on journey times.\nThe growing number of cars and lorries parking dangerously on pavements is another issue we will address.",
  "https_doverdeallibdems_org_uk/https_doverdeallibdems_org_uk_news_article_this-government-is-not-making-polluters-pay/content_34.html": "Like most websites, this site uses cookies. Some are required to make it work,\nwhile others are used for statistical or marketing purposes. If you choose not\nto allow cookies some features may not be available, such as content from other\nwebsites. Please read our Cookie Policy for more information."
}