{
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_news_a27-ris3-pipeline-work-update/content_13.html": "The scheme has been identified as one of 32 schemes within the RIS3 pipeline, for early options identification work for potential future investment.\nAs you know, the A27 Chichester Bypass is a key route for the local and regional economy. However, your constituents experience significant delays on this 5.5km stretch of road. The proposed scheme will help reduce congestion and deliver safer routes for road users, cyclists, pedestrians and horse riders. Providing opportunities to enhance the environment and create better connectivity to and from Chichester.\nTo help shape our Options being developed, we held five Stakeholder Referencing Groups (SRGs) and a Council Members briefing in November 2021 with the following:\n- tourism and education\n- transport\n- business, horticultural, agricultural, freight\n- environment\n- Parish Councils\n- West Sussex County Council and Chichester District Council\nWe would like to take this opportunity to share with you key themes and topics identified at these meetings and our progress to date. We have attached an update to this email for your convenience.\nFurther information can also be found on our dedicated scheme webpage https://nationalhighways.co.uk/a27cb.",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_news_category_Articles/content_8.html": "Andy Green from Chichester College Meeting 7th June 2023 With exam season here, Gillian knows that lots of young people will be thinking 'what's next?' for them in their journey. It was great for Gillian to catchup... Articles\nGraylingwell Food Hub Visit 2nd June 2023 Back in January, Gillian met up with UKHarvest at their Donnington centre to learn how their team behind the scenes make it all possible. The other day, she... Articles\nRNLI Coxswain Rob Archibald Interview 1st June 2023 Gillian had a brilliant to chat with Coxswain Rob Archibald about some of the volunteering roles available at RNLI Selsey Lifeboat. There are plenty of... Articles\nChichester Festival Theatre Visit 26th May 2023 Want to work in the theatre but are worried you: Didn't go to the 'right school; Don't have a Drama degree; or Come from a less 'arty' background? There are now... Articles\nFoster Care Fortnight 26th May 2023 Gillian had a brilliant time celebrating Foster Care Fortnight and welcoming so many amazing foster carers to 10 Downing Street recently. Thank you for... Articles\nMumsnet Interview 25th May 2023 It was great for Gillian to chat childcare, teachers, special educational needs and much more with mumsnet.com founder Justine Roberts. Gillian thanks Mumsnet... Articles\nEnergy Bills and Inflation Down 25th May 2023 Today's price cap announcement means that from July, we should see energy bills fall by nearly £430 per year on average. Yesterday, we saw the ONS confirm... Articles\nYoung People's Shop Visit 24th May 2023 It was great for Gillian to drop by the Young People’s Shop the other day to talk mental health and local youth services. The Shop offer emotional support and... Articles\nRichard Craven Retirement 23rd May 2023 Thank you Richard Craven for more than 25 years of service to the Chichester Harbour Conservancy! As Director and Harbour Master, Richard has been a real... Articles",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_chichesterplanforwater/content_6.html": "As part of the latest Chichester Water Conference on 22nd March 2024, Gillian announced Chichester's Plan for Water.\nChichester’s Plan for Water draws on the years of work undertaken by Gillian as the Member of Parliament for Chichester and others in the constituency to end sewage outflows for good.\nThe Plan details significant new funding promised by Southern Water in their latest business plan which, subject to the approval of regulators, will transform water treatment in Chichester over the next five years. Southern Water’s business plan allocates over £56 million to the following communities:\n- Thornham - £30 million – this will be used to create a new UV water treatment facility\n- Chichester - £16 million\n- Lavant - £8 million\n- Bosham - £1.4 million\n- Sidlesham - £500,000\n- Pagham - £500,000\nLaunching the plan, Gillian said\nSince being elected as the Member of Parliament for Chichester, sewage and water quality have been some of the most common issues to cross my desk, and my position has always been clear: The dumping of sewage in our harbour and waterways is completely unacceptable.\nI'm delighted to be launching this plan today. I hope it will help constituents to understand where we are, and more importantly what we are doing to bring an end to sewage discharges.\nThe huge investment from Southern Water, which is detailed in the plan, is a result of the long-term campaign I and others in our area have led to clean up our waterways, including the beautiful Chichester Harbour, and to hold Southern to account.\nOf course there's still more to do and I will continue to push for consistent and strong action to stop sewage outflows in our constituency for good.\nYou can download and read the full plan below.\nYou can re-watch the Chichester Water Conference in full above.\nIf you have any questions please click here to fill out our contact form.",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_cdn-cgi_l_email-protection/content_16.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_news_project-gigabit-spring-update-minister-media-data-and-digital-infrastructure/content_10.html": "Update from Minister for Media, Data and Digital Infrastructure\nToday we have published Building Digital UK's (BDUK) Project Gigabit Spring Update. It reports on the excellent progress we continue to make in delivering reliable, lightning-fast broadband across the length and breadth of the UK.\nIn this latest quarterly update, the first since BDUK became an Executive Agency, we report on the conclusion of the successful Local Full Fibre Networks programme. This programme has delivered gigabit connectivity to more than 5,000 public buildings, including schools, libraries and GP surgeries, with Government investment of £164 million. We also report that we have now reached the significant milestone of 100,000 Gigabit Broadband Vouchers issued, with 65,000 vouchers claimed so far.\nFurther updates reported in this publication include the launch of two local procurements in Cornwall and two regional procurements in Norfolk and Suffolk, extending gigabit-capable connectivity to up to around 190,000 premises. BDUK has now begun the pre-procurement process for around three-quarters of expected procurements and has completed over 20 market engagement exercises across the UK.\nWe also provide updates on how we are working closely with the devolved governments to deliver Project Gigabit plans in some of the hardest-to-reach areas in the UK, and highlight Northern Ireland’s gigabit-capable broadband growth, which has reached the UK wide target of 85% gigabit-capable coverage almost three years early. This means over 750,000 homes in NI are already able to access some of the fastest speeds in the world.\nOn 1 April 2022, BDUK became an Executive Agency of DCMS, with a new Head Office in the heart of Manchester. This is the most efficient and effective way of ensuring we build on the excellent progress to date, creating a fully gigabit nation and delivering on the Prime Minister’s promise to level up communities across the UK.\nThe Project Gigabit Delivery Plan Spring Update can be found here - https://www.gov.uk/government/publications/project-gigabit-delivery-pla….",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_campaigns_supporting-our-rural-and-coastal-communities/content_12.html": "Gillian works to support rural communities and businesses. Gillian represents a large part of the South Downs National Park and coastline from Chichester Harbour AONB to the Pagham Nature reserve that includes the Port of Selsey.\nGillian works closely with Government bodies such as the Environment Agency, Natural England, The National Federation of Fishermen's Organisations (NFFO) and DEFRA as well as local groups, agencies, businesses and individuals to protect and enhance our rural communities across the Chichester constituency.\nKeep up to date with her work here.",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_accessibility/content_3.html": "This accessibility statement relates to this website, which is part of the Bluetree website platform.\nIt is important to make websites accessible to the widest possible audience. Therefore this site has been designed to meet the Web Content Accessibility Guidelines 2.1 AA, but also satisfies many other checkpoints laid out in the Guidelines for level AAA.\nThese guidelines are intended to make website content accessible to people with disabilities. They also help to ensure that slower devices and Internet connections do not impede substantially on navigating the website.\nTherefore, you should be able to:-\n- Zoom in up to 300% without test spilling off the screen using your web browser settings. For example, in Chrome, hold down the ctrl key and press the + and - keys. In Safari, hold down the cmd key and press the + and - keys.\n- Navigate most of the website using a keyboard\n- Navigate most of the website using speech recognition software\n- Listen to most of the website with a screen reader\n- Read most of the website with a Braille device\nAbilityNet has advice on making your device easier to use if you have additional access needs.\nWhat we do to improve accessibility\nThe website administrator is responsible for the accessibility of this website. However, the developers regularly review design and functionality accessibility on the website platform, including:-\n- Improving layouts and colours to enhance simplicity and contrast\n- Ensuring that text appears in a legible font size\n- Ensuring that tap targets are an accessible size and not too small or close together\n- Considering accessibility in all design and functionality decisions\n- Publishing best practice for website administrators relating to content accessibility\nHow accessible is the website platform?\nDue to the devolved nature of the administration of a website platform, the responsibility for accessibility of content rests with the content creators. The developers are aware of the potential to add or modify content that is not as accessible as it could be, including:-\n- Images used as links\n- Broken links\n- Text as images in some locations, such as infographics and logos, without supportive descriptions\n- Non-optimal images and pdfs, such as scanned letters\n- Some historic images lack alternative text (prior to August 2016, when alt text became mandatory on the platform)\n- Not all videos feature subtitles and/or descriptive text\nThe developers of the website platform have no control over nor can take any responsibility for the content added to the website, but strive to resolve these where possible through aspects of the functionality as well as integral and disseminated best practice. It is entirely possible for all of these accessibility issues to be resolved by content creators themselves.\nBrowser accessibility\nThis website has been optimised for the latest versions of the following browsers:-\n- Google Chrome\n- Mozilla Firefox\n- Apple Safari\n- Microsoft Edge\nIf the website does not display correctly, please update to the latest version of your browser.\nHow to request information in an accessible format\nThis website has its own administrator and if you need information in a different format, please contact that individual using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears.\nReporting accessibility problems\nThis website has its own administrator and if you find any problems that are not listed on this page or if you think the website is not meeting accessibility requirements, please contact the administrator using the form or details on the Contact page in the menu. Alternatively, you can write to the address in the footer if one appears. If necessary, information about structural or design accessibility issues will be passed to the developers to include in the development roadmap.\nIf you contact us with a complaint about accessibility and you are not happy with our response, contact the Equality Advisory and Support Service (EASS).\nFrom time to time, other website developers copy this Accessibility statement for use on their own websites. This statement applies exclusively to the accessibility of genuine Bluetree websites and is unlikely to be valid on other platforms, websites or servers. We have no control over website developers who copy this statement for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_working-chichester/content_2.html": "Gillian has worked closely with MPs, agencies and organisations to improve and protecting the environment in and around Chichester.\nProtecting the River Ems\nGillian has worked with local councillors from WSCC and CDC respectively, as well as, the community to reduce the rate of water abstraction f\nGillian has been working to improve digital connectivity throughout Chichester.The UK Gigabit ProgrammeThe UK Gigabit Programme or ‘Project Gigabit’ is a £5 billion government infrastructure project that brings together everything the government is doing to enable and deliver fast and reliable digit\nRadiotherapy is a core part of modern cancer treatment and is second only to surgery in its effectiveness in treating cancer. About 40% of cancer patients who are cured receive radiotherapy cancer treatment.\nA27 Chichester bypass How to be kept up to dateWe would encourage everyone who would like to be kept informed to subscribe to the National Highways dedicated scheme webpage CLICK HERE.\nAs part of the latest Chichester Water Conference on 22nd March 2024, Gillian announced Chichester's Plan for Water.Chichester’s Plan for Water draws on the years of work undertaken by Gillian as the Member of Parliament for Chichester and others in the constituency to end sewage outflows for good.T",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_news_updates-chichester-community-conference-chichester-observer/content_7.html": "We face significant challenges locally to balance the need to provide more homes with protecting our natural environment and existing communities. To dive into these issues, last week I held the Chichester Community Conference. The online panel event included, both local councils, Highways England, Natural England, Southern Water and The Environment Agency, covered a huge range of local concerns, around key infrastructure and the A27, planning and development, and environmental concerns including sewerage releases into both the Chichester and Pagham Harbours. I am grateful to everyone who came online to watch and participate live, but in case you were unable to attend, a recording of the conference is now available on my website,www.gilliankeegan.com. Over the coming days, we will also be posting further information on some of the topics discussed and some written responses on the technical detail covered during the conference.\nDuring the Conference one big piece of new and positive news came from Highways England (HE) who updated us on their work on the A27. Back in March 2020, the A27 Chichester Bypass was included in the Department for Transport’s list of projects to be developed for possible future funding, sharing a £347 million funding pot as one of 32 possible schemes nationwide. This work will then lead to some of those to be included in the Road Investment Strategy 3 (RIS3) which is between 2025-2030.\nAt the Conference, Highways England explained that the project is at a very early stage, which means they’ll be considering new and previous options. As they’re developed over the coming 12 months they will be undertaking traffic modelling using previous modelling and fresh data. As part of the process, HE will begin engaging with a wide range of stakeholders later this year and have promised they will be transparent with stakeholders and hold open discussions on the complexities around them.\nHaving a transparent and open process with Highways England has been a goal of mine ever since becoming an MP, so I am pleased that we are heading in that direction. We have an opportunity to work collaboratively as a community with Highways England to develop a workable solution.",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_privacy/content_4.html": "This document outlines how Gillian Keegan processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Gillian Keegan\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Gillian Keegan.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Gillian Keegan, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Gillian Keegan via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_news_positive-step-forward-a27-chichester-bypass-major-scheme-be-developed-possible-future-funding/content_11.html": "Chichester’s MP, the district council and county council have welcomed news that the A27 Chichester Bypass major improvement scheme is included in a list of projects to be developed for possible future funding.\nHighways England has said that £300 million is available for preparatory work into 32 possible schemes nationwide - although only some of these will be included in its next Road Investment Strategy for the 2025-30 period (RIS3).\nA meeting with Highways England last week included Chichester MP Gillian Keegan, the county council’s Cabinet Member for Highways and Infrastructure, Roger Elkins, and Leader of Chichester District Council, Eileen Lintill.\nGillian Keegan MP, who had several meetings with the Secretary of State and Ministers from the Department for Transport to successfully secure the funding, said: “This is the first step on a long journey to improve the current congestion on the A27. Since the previous options were rejected, I have been in many meetings with Government Ministers at the Department for Transport to secure funding to move forward with improving the A27.\n“Now we have secured initial development funding I will be working with the Local Authorities to ensure this process is transparent and that all options are explained in detail by Highways England to the people of the Chichester District. My role in this process is to work with national and local agencies to secure funding in the RIS3 budget once plans have been developed and agreed for a future scheme.\n“We all know improvements must be made and I will do everything I can to support our councils and communities.”\nRoger Elkins, county council Cabinet Member for Highways and Infrastructure, said: “We had a very positive conversation with Highways England.\n“Although it must be stressed there is no guarantee of funding for a major scheme, we look forward to re-engaging with the community, other councils, the MP and Highways England in due course to produce a compelling business case for a major A27 scheme.\n“Our aim remains finding a long-term solution for the A27 at Chichester that reduces congestion, is viable and affordable and, crucially, has the support of the community.”\nCllr Lintill, Leader of Chichester District Council, said she is grateful that the A27 Chichester Bypass major improvement scheme has been included in the list of schemes to be developed for possible future funding.\n“This is good news and a very positive step, but we will be one of many authorities competing for funding and so we will need to make a very good business case for a major A27 scheme,” explains Cllr Lintill. “I must stress that nothing is guaranteed, and at the moment, it’s too early to say what any scheme will look like, but we will be writing to Highways England to ask for an open and transparent process to take place for all our residents, workers and businesses. In considering the options, we will also be asking Highways England to set out its reasons clearly and provide evidence for any deliverable and non-deliverable options.”\nAs part of the adopted Chichester Local Plan, a number of small scale improvements to the Chichester Bypass to manage the impact of new development have been included, which will need to be completed by 2029. The council leaders and MP have asked that any further technical work on developing a major scheme for the A27 must take the Local Plan scheme into account. They have also asked for any options not considered deliverable by Highways England to be fully explained to stakeholders.\nCllr Lintill added: “I look forward to working closely with our partners and Highways England to ensure that a major scheme to improve this key part of the A27 for our residents, workers and visitors, is included in the next funding strategy.”",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_podcasts-and-profiles/content_14.html": "Gillian joins Iain Dale on For the Many podcast Tuesday, 1 October, 2024 Live from the Conservative Party conference , Gillian and Iain discuss politics past, present and future....Credit: For the Many Podcast\nGillian joins Ed Balls on Political Currency Podcast Thursday, 15 August, 2024 Gillian joins Ed Balls on the Political Currency podcast whilst George Osbourne takes a break. Credit: Political Currency Podcast\nGillian Keegan on The Rest is Politics Podcast Tuesday, 16 January, 2024 Credit: The Rest is Politics\nGillian on BBC Political Thinking with Nick Robinson Sunday, 20 November, 2022 https://www.bbc.co.uk/sounds/play/m001dwj0Credit: BBC Sounds - Political Thinking\nGillian Keegan joins Chopper's Politics Podcast Monday, 15 November, 2021 Gillian Keegan, Health and Social Care Minister joins Chopper's Politics Podcast.\nGillian appears on 'What Were You Thinking' Podcast by Laura Round Wednesday, 15 September, 2021 Credit: 'What Were You Thinking?' Podcast by Laura Round.\nGillian Keegan appears on #AskTheMinister TES FE Podcast Wednesday, 15 September, 2021 Gillian appears on #AskTheMinister TES FE Podcast to discuss Results, T-Levels and the FutureCredit: TES FE Podcast.\nGillian joins Iain Dale All Talk Podcast Monday, 15 February, 2021 Gillian on Iain Dale All Talk Podcast February 2021Credit: LBC Iain Dale All Talk Podcast.\nGillian Keegan appears on Women with Balls Podcast Friday, 20 November, 2020 https://www.globalplayer.com/podcasts/episodes/7DrcDjP/ Credit: The Spectator: Women with Balls Podcast",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_campaigns_better-broadband/content_9.html": "Gillian has been working to improve digital connectivity throughout Chichester.\nThe UK Gigabit Programme\nThe UK Gigabit Programme or ‘Project Gigabit’ is a £5 billion government infrastructure project that brings together everything the government is doing to enable and deliver fast and reliable digital connectivity for the entire country. Through one of the fastest rollouts in Europe, two thirds of households now have access to gigabit speeds by the end of 2021 - a huge leap from 2019 when it was just one in ten.\nAs part of this programme BDUK is launching phased contracts to those hard to reach parts of the UK that will need government support towards the cost of gigabit-capable broadband.\nTo complement this work and to support pace of delivery, there are three other elements to Project Gigabit:\nGigabit Broadband Voucher Scheme\nThere is up to £210 million to give people in eligible rural areas immediate financial help to get gigabit-capable speeds. The scheme is accessible through broadband service providers that have registered to provide connections through the scheme.\nVouchers worth up to £1,500 for homes and £3,500 for businesses help to cover the costs of installing gigabit broadband to people’s doorsteps.\nYou can check if you’re eligible for a voucher at your address on the Gigabit Broadband Voucher Scheme website.\nGigabit Hubs\nThere is up to £110 million available to connect public sector buildings - such as GP surgeries, libraries and schools - in hard to reach parts of the UK.\nFor more information, see GigaHubs: key information.\nWSCC Broadband Support and Information",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com/content_1.html": "Skip to main content\nMain navigation\nAbout Gillian Keegan\nNews\nContact\nGillian Keegan Highlights\nMedia Appearances\nPodcasts and Profiles\nPublic Speaking\nWorking for Chichester\nIntro Video (background video that auto-plays without sound)\nGillian Keegan\nMember of Parliament for Chichester (2017-2024)\nFormer Secretary of State for Education\nMedia Appearances\nGillian Keegan Highlights\nPodcasts and Profiles\nAbout Gillian Keegan\nClick Here",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_news_two-million-rural-homes-and-businesses-benefit-ps5-billion-broadband-upgrade/content_15.html": "2.2 million homes and businesses in England set to get top-of-the-range connections\nMillions of people in rural England will get access to the fastest broadband speeds on the market as part of a £5 billion plan to level up internet access across the UK.\nThe government’s Project Gigabit fund to upgrade digital infrastructure in hard-to-reach areas will accelerate the country’s recovery from covid, fire up high-growth sectors such as tech and the creative industries, put an end to families battling for bandwidth and bring the speed and reliability people need to start and run businesses.\nNew details published today reveal up to 1,850,000 additional premises across 26 English counties, including in West Sussex, will get access to gigabit speed internet of 1,000 megabits per second - enough to download a HD movie in less than 30 seconds and lay the foundations for next-generation tech such as 8K-quality video streaming. In West Sussex the scheme is expected to provide this upgrade to over 67,000 homes.\nIt brings the current total number of premises in scope for government-funded coverage to 2.2 million, with more still to be announced over the coming months across England, Scotland, Wales and Northern Ireland.\nThis is in addition to the tens of millions of premises that broadband firms are rapidly connecting through their commercial rollout, from one in ten households in 2019 to more than two in five today. The UK is also on track for the fastest rollout in Europe this year and for 60 per cent of all households to have access to gigabit speeds by the end of this year.\nThe government is also on track to hit its target of achieving at least 85 per cent gigabit-capable UK coverage by 2025, and ministers are ready to go as fast as broadband companies can manage.\nDigital Secretary Oliver Dowden said:\nProject Gigabit is our national mission to level up rural areas by giving them the fastest internet speeds on the market.\nMillions more rural homes and businesses will now be lifted out of the digital slow lane thanks to our mammoth £5 billion investment and one the quickest rollouts in Europe.\nThis broadband revolution will create jobs, power up businesses and allow everyone to access vital services at lightning fast speed, helping us build back better from the pandemic.\nAlmost half a million (480,000) premises in Shropshire, Norfolk, Suffolk, Worcestershire, Hampshire and the Isle of Wight will be among the first to benefit followed by counties including Derbyshire, Wiltshire, Gloucestershire, Lancashire, Surrey, Leicestershire, Warwickshire, Nottinghamshire, Hertfordshire, Staffordshire, Lincolnshire and Yorkshire.\nThe news follows a raft of Project Gigabit updates benefiting all four UK nations, including £24 million to roll out gigabit broadband in ten local authority areas in Northern Ireland, 234,000 homes and businesses in Wales being confirmed as in scope to receive upgrades through the programme, and £4.5 million to help thousands in central Scotland get next-generation connections.\nOn top of this, today it is also being confirmed that the Scottish and Welsh governments and 15 English councils have made at least an extra £26 million available in top-ups to the UK Government’s Gigabit Broadband Voucher Scheme. The scheme, which is available nationwide, covers the costs of a gigabit connection in areas that are particularly difficult to reach, and the top-ups boost the financial help available.\nThere are 47,000 homes and businesses now plugged in to gigabit broadband as a result of the scheme, with a further 38,000 in the pipeline and millions of pounds in vouchers still available for people to claim.\nUnder the record-breaking fund, a cornerstone of the Prime Minister’s plan to build back better, the government is investing in areas left behind by the industry’s roll out plans due to the expense and lack of a commercial incentive to connect them to gigabit capable networks.\nThe first Project Gigabit contracts announced in March are expected to commence from May next year, with spades hitting the ground soon afterwards. This includes 349,000 premises in Essex, Dorset, Cumbria, Cambridgeshire, Northumberland, Durham, Tyneside, Teesside and Cornwall.\nMany more areas are due for upgrades under the scheme and will be announced later this year, with hundreds of thousands more homes and businesses set to benefit.\nChief Secretary to the Treasury Steve Barclay said:\nThe pandemic has seen more services offered online and more businesses and consumers wanting to use online services, in particular from home.\nThis announcement enabling over 2m homes to have the fastest internet services will make a real difference to those businesses and consumers wanting to maximise the benefits of digital services.",
  "https_www_gilliankeegan_com_/https_www_gilliankeegan_com_campaigns_a27-improvement/content_5.html": "A27 Chichester bypass\nHow to be kept up to date\nWe would encourage everyone who would like to be kept informed to subscribe to the National Highways dedicated scheme webpage CLICK HERE. By doing so you will be notified of future updates as the scheme progresses.\nContact NH\nEmail: [email protected]\nTelephone: 0300 123 5000"
}