{
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_03_11_tusc-east-london-mayoral-candidates-pay-tribute-to-bob-crow/content_26.html": "Trade Unionist and Socialist Coalition mayoral candidates for Newham and Tower Hamlets today paid tribute to RMT general secretary Bob Crow who died this morning.\nLois Austin, TUSC mayoral candidate for Newham said: “I am shocked by the passing of Bob Crow and it is a big loss to the trade union and anti-cuts movement in London and across Britain.\n“Bob stood up for things that most people agree with – such as decent living standards for all and renationalisation of the railways.\n“Under his leadership the RMT, like the PCS service union I work for, has fought for it members, refusing to bow down to the Tories or wait in hope for a Labour government.\n“The forerunner of the RMT, the Society of Railway Servants, founded the Labour Party. But today Labour is just like the Tories. Today, the RMT is helping to build the Trade Unionist and Socialist Coalition, which was backed by Bob Crow since it was founded in 2010, to get back the political voice for workers.”\nHugo Pierre, TUSC mayoral candidate for Tower Hamlets, said: “Bob Crow stood out because he stood up for working class people – the same reason why the right wing press vilified him.\n“The best way to remember Bob Crow is to carry on his work, by being in a trade union, by opposing the austerity agenda, by fighting for working class people to have a decent standard of living.\n“He embodied the best fighting spirits of people in this borough. There’s enormous inequality in Tower Hamlets, with Canary Wharf looking over people living in overcrowded and impoverished conditions. We’d do well to follow in Bob’s footsteps by continuing the battle against such inequality.”",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_tag_private-rents/content_13.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_05_01_newham-and-havering-tusc-candidates-stand-up-for-london-underground-jobs/content_24.html": "Newham TUSC candidate Bob Severn, with fellow TUSC supporter Becci Heagney, visited the Upminster depot on 29 and 30 April to support RMT strikers. There they met Havering TUSC candidate and train driver Chris Rice (wearing the high-vis jacket).\nNewham TUSC candidate Bob Severn, with fellow TUSC supporter Becci Heagney, visited the Upminster depot on 29 and 30 April to support RMT strikers. There they met Havering TUSC candidate and train driver Chris Rice (wearing the high-vis jacket).",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_02_26_tusc-protests-for-rent-controls-at-landlords-show/content_28.html": "Campaigners called for rent controls outside the Landlord and Letting Show at the Barbican in a protest organised by Newham and Waltham Forest Trade Unionist and Socialist Coalition groups.\nWith Tory MP and landlord Richard Benyon getting £635,000 from housing benefit in just one year, protesters called for rent caps instead of benefit caps.\nSome landlords said it was fair that the ‘market decides’ rents and that ‘everyone needs to make a profit’. Millions of tenants struggling to pay the rent will disagree. One landlord said they needed to have enough money to afford to evict people!\nTUSC campaigners call for:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_category_uncategorized_page_2/content_30.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_tag_richard-benyon/content_9.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_04/content_3.html": "Thirty people listened to mayoral candidate Lois Austin speak at Newham Trade Unionist and Socialist Coalition’s election launch meeting at Katherine Road Community Centre on Saturday 5 April.\nIntroducing the meeting as chair, Helen Pattison said how a Newham Labour council had come up to the TUSC stall at Upton Park earlier in the day. He looked at a Newham TUSC leaflet, which listed policies including:\n· Cap rents not benefits – build council homes\n· Axe the bedroom tax\n· Support the Focus E15 mums\n· A minimum wage of £10 an hour across the borough\n· End zero-hour contracts\n· A free education for all. Reintroduce EMA\n· No NHS cuts. No privatisation. Defend NHS jobs\nThe Labour councillor responded by saying: “I don’t stand for any of that.”\nMayoral candidate Lois Austin said: “Newham desperately needs an alternative to the main three big business parties.”\nLois Austin said that TUSC was Bob Crow’s party. RMT general secretary Crow, who died in March and whose funeral was held in the East London cemetery in Manor Park, was a founding member of TUSC in 2010. “Under Bob, the RMT succeeded in standing up for it members in resisting cuts and privatisation.” TUSC was set up to have an alternative to Labour that stood up for working class people.\n“We have a rotten Labour council, who do the really nasty things they don’t have to do – implement the bedroom tax, issue eviction notices, allowing the eviction of the E15 mums.”\nLois said that the Olympic legacy hasn’t benefitted most people in Newham, but instead pushed up property prices in Stratford while Newham has an acute housing crisis, with people living in cramped housing, many living in sheds and garages.\n“24,000 people are on the council house waiting list. We need to build 20,000 council homes while renovating the many empty properties.”\n“Labour councillors say they can’t oppose the cuts as it means breaking the law. But that’s not true.\n“We’ve seen £110 million of cuts in Newham, but they have £180 million in reserves while £111 million was spent on Building 1,000. We’d do all the things that working class people need, like restoring EMA.\n“We’d set a needs budget. A third of families in Newham are deprived. We’d lift people out of poverty. We’d build a mass campaign, link up with other councils that agree with us, and take on the Tories – or Labour Party if they’re in government, to get the needed money.”\nSteve Hedley, RMT assistant general secretary and a Newham TUSC council candidate, said: “Newham Labour say they’re against cuts, but have no choice. It’s like saying you’re a vegetarian, and having pork pies for lunch! That’s why I’m urging everyone here to get involved in TUSC campaigning.”\nMany TUSC supporters spoke from the floor, including a retired Newham council worker and GMB steward, and a Somali woman who spoke about the horrors of being stuck in agency work with no holiday rights or sick pay.\nTo finish the meeting, Lois spoke about her record as a campaigner. She was an organiser against the poll tax, which was defeated by a mass non-payment campaign of millions of people. Lois was chair of Youth Against Racism in Europe, and led a seven-year campaign that got the BNP headquarters in Welling closed.\nLois was a founding member of the Stop the War Coalition, campaigning against the unjust wars in Afghanistan and Iraq. Lois helped leaded the Stratford Academy Concerned Parents, which in 2012 united staff, parents and the local community in support of a teachers’ strike that successfully stopped cuts to teachers’ pat and the bullying of staff.\nAt the end of the meeting, TUSC candidates and supporters gathered behind the Newham TUSC banner for a group photo.\nMonthly Archives: April 2014\nReminder: Newham TUSC offical Launch!\nSaturday 5 April, 3pm-5pm\nKatherince Road Community Centre, 254 Katherine Rd, London, E7 8PN\nElect Lois Austin\nfor a workers mayor on a workers wage!\nSir Robin Wales is paid £80,029 pa, and gave himself a 4% pay rise last year. Meanwhile the council plans to evict young mothers and ship them off around the country, they are implementing the bedroom tax, and allowing huge cuts to services though!\nThere is no fight back coming from Newham Labour!\nTUSC is an anti cuts coalition standing for Major and in a number of council seats around Newham.\nnewham.tusc@gmail.com",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_tag_andrew-charalambous/content_14.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_03/content_18.html": "(photo Paul Mattsson)\nMembers of the Newham Trade Unionist and Socialist Coalition (TUSC) organised a successful protest outside the Labour Party special conference on Saturday 1st March in opposition to the Collins Review proposals being voted on inside the Excel centre in east London.\nProtesters had their mouths gagged and held placards saying, “Don’t let Labour silence trade unions”. A picture of Ed Miliband walking past one of these placards was featured on the BBC website.\nThe conference was held in Newham, the borough where trade unionist Keir Hardie was originally elected as a West Ham South MP in 1892 before he went on to become the first Labour Party leader.\nFormer Labour MP and TUSC national chair Dave Nellist sent a message of support to the Newham TUSC group, saying “Labour’s real regard for the unions is shown by them devoting a mere two hours of conference to overturn 113 years of shared history”.\nTUSC supporters approach Miliband before Labour Party special conference, photo Paul Mattsson (Click to enlarge)\nOne of the speakers at the protest was TUSC’s prospective mayoral candidate for Newham, Lois Austin: “Keir Hardie would be turning in his grave if he saw this conference.\n“I joined the Labour Party when I was 15 as I wanted to be in an organisation that fought for working class people. I was also the national chair of the Labour Party’s youth wing, the Labour Party Young Socialists, in the late 1980s.\n“But socialists like me were forced out or silenced by people like Tony Blair who were backed by big business to rid the party of socialists. The Collins Review is the last nail in the coffin of trade union representation within Labour”.\nAnother Newham TUSC council candidate, Bob Severn, said: “If you shop at Sainsbury’s, you don’t get to ‘opt in’ whether your purchases will end up funding the Tory party. These rule changes are about ending the remaining influence of organised working class people in Labour, to secure it as a pro-austerity, pro-big business party”.\nBut TUSC welcomes trade unionists as Labour closes the door.\nPress coverage of TUSC protest can be seen at the following websites:\nBBC: http://www.bbc.co.uk/news/uk-politics-26381922\nIndependent: http://www.independent.co.uk/news/uk/politics/ed-miliband-labour-party-reforms-will-bring-people-back-into-politics-9162294.html and picture at http://www.independent.co.uk/news/uk/politics/ed-miliband-gains-backing-from-lord-owen-as-labour-approves-reforms-9162835.html\nNewham Recorder: http://www.newhamrecorder.co.uk/news/trade_unionist_campaigners_protest_outside_labour_s_excel_centre_conference_1_3373968\nBarking and Dagenham Post: http://www.barkinganddagenhampost.co.uk/news/politics/trade_unionist_campaigners_protest_outside_labour_s_excel_centre_conference_1_3373968",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_page_2/content_4.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_category_uncategorized/content_19.html": "Vote Lois Austin for Mayor of Newham\nA workers’ mayor on a worker’s wage\nAxe the bedroom tax – Build council houses – Cap rents\nVote for TUSC – the party launched by Bob Crow\nThe Tories claim they’re an alternative to Labour in Newham – but it is the Tory government that has cuts Newham’s funding by a third. The Labour council may as well be Tory though – as it has more than agreed to carry through the cuts while carrying out the highest number of council home evictions! UKIP are also no alternative – they want to make more cuts than the Tories or Labour! Ukip hates public services as it’s another party headed by profit hungry millionaires.\nNewham TUSC says:\nAxe The Bedroom Tax! Cap rents not benefits – Build council homes\nPrivate landlords are pushing families into poverty with rip off rents. A cap on private rents and building council housing would offer familes safe and\naffordable homes.\nSupport the Focus E15 Mums – give them council housing in the borough\nNewham Council tried to re-house young mothers from Newham in Birmingham. We say give them council housing in the Borough\nA minimum wage of £10 an hour across the borough – End zero-hour contracts\nMany workers can’t afford to cover the rent, bills and living costs because wages are so low. Pay us enough to live.\nA free education for all! Reintroduce EMA – Young people deserve access to free, decent education.\nBringing back EMA will help teenagers from low paid families carry on their Education.\nNo NHS cuts. No privatisation. Defend NHS jobs.\nNewham Candidates\nForest Gate North: Bob Severn, Axe The Bedroom Tax\nForest Gate South: Niall Mulholland, NUJ\nGreen Street West: Mark Dunne, health worker\nGreen Street East: Lois Austin, anti-racism and anti-cuts Campaigner\nBoleyn: Ben Robinson , Axe The Bedroom Tax\nEast Ham North: Keerthkan Thennavan, Tamil Solidarity\nEast Ham Central: Helen Pattison, living wage campaigner\nEast Ham South: Steve Hedley, RMT Assistant General Secretary",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_author_bbkingbr_page_2/content_21.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_03_29_come-to-the-election-launch-meeting-on-5-april/content_12.html": "Great repsonse in East Ham today when mayoral candidate Lois Austin was among TUSC activists campaigning for rent controls.\nThanks to all the shops and restaurants that agreed to display posters and/or leaflets for next week’s election launch meeting.\nCome along!\nNewham TUSC election launch meeting\nSaturday 5 April, 3pm-5pm\nKatherine Road Community Centre\n254 Katherine Road, London E7 8PN\nNewham TUSC stands for:\n– Cap rents not benefits! Build council homes\n– Axe the bedroom tax\n– Support the Focus E15 mums\n– A minimum wage of £10 an hour across the borough\n– End zero-hour contracts\n– A free education for all. Reintroduce EMA\n– No NHS cuts. No privatisation. Defend NHS jobs",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_02_25_protest-outside-the-landlord-and-letting-show-at-the-barbican-tomorrow/content_16.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_tag_barbican/content_11.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_02_25_newham-tusc-supports-striking-primary-teachers/content_29.html": "Newham TUSC campaigners on 12 February went to Avenue Primary in Manor Park to support teachers taking strike action against the school breaking away from national pay agreement.\nThe new pay policy was decided by the HR committee (made up of four governors including the chair of governors). The NUT has asked, since September, for governing body keeping the existing pay scales, but the chair of governors refused further talks with the union.\nThe new scheme involves almost twice as many points on the pay scale, likely to mean that teacher get smaller pay rises each year. Teachers are concerned they’ll end up competing with each other for a pay rise and have to concentrate on trying to meet targets, taking them away from the important job of teaching.\nMore strike action is planned for the first week of March if the school continues with the new pay scheme.",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_05/content_6.html": "Vote Lois Austin for Mayor of Newham\nA workers’ mayor on a worker’s wage\nAxe the bedroom tax – Build council houses – Cap rents\nVote for TUSC – the party launched by Bob Crow\nThe Tories claim they’re an alternative to Labour in Newham – but it is the Tory government that has cuts Newham’s funding by a third. The Labour council may as well be Tory though – as it has more than agreed to carry through the cuts while carrying out the highest number of council home evictions! UKIP are also no alternative – they want to make more cuts than the Tories or Labour! Ukip hates public services as it’s another party headed by profit hungry millionaires.\nNewham TUSC says:\nAxe The Bedroom Tax! Cap rents not benefits – Build council homes\nPrivate landlords are pushing families into poverty with rip off rents. A cap on private rents and building council housing would offer familes safe and\naffordable homes.\nSupport the Focus E15 Mums – give them council housing in the borough\nNewham Council tried to re-house young mothers from Newham in Birmingham. We say give them council housing in the Borough\nA minimum wage of £10 an hour across the borough – End zero-hour contracts\nMany workers can’t afford to cover the rent, bills and living costs because wages are so low. Pay us enough to live.\nA free education for all! Reintroduce EMA – Young people deserve access to free, decent education.\nBringing back EMA will help teenagers from low paid families carry on their Education.\nNo NHS cuts. No privatisation. Defend NHS jobs.\nNewham Candidates\nForest Gate North: Bob Severn, Axe The Bedroom Tax\nForest Gate South: Niall Mulholland, NUJ\nGreen Street West: Mark Dunne, health worker\nGreen Street East: Lois Austin, anti-racism and anti-cuts Campaigner\nBoleyn: Ben Robinson , Axe The Bedroom Tax\nEast Ham North: Keerthkan Thennavan, Tamil Solidarity\nEast Ham Central: Helen Pattison, living wage campaigner\nEast Ham South: Steve Hedley, RMT Assistant General Secretary",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_03_07_tusc-causes-stir-at-labour-rules-change-conference/content_22.html": "(photo Paul Mattsson)\nMembers of the Newham Trade Unionist and Socialist Coalition (TUSC) organised a successful protest outside the Labour Party special conference on Saturday 1st March in opposition to the Collins Review proposals being voted on inside the Excel centre in east London.\nProtesters had their mouths gagged and held placards saying, “Don’t let Labour silence trade unions”. A picture of Ed Miliband walking past one of these placards was featured on the BBC website.\nThe conference was held in Newham, the borough where trade unionist Keir Hardie was originally elected as a West Ham South MP in 1892 before he went on to become the first Labour Party leader.\nFormer Labour MP and TUSC national chair Dave Nellist sent a message of support to the Newham TUSC group, saying “Labour’s real regard for the unions is shown by them devoting a mere two hours of conference to overturn 113 years of shared history”.\nTUSC supporters approach Miliband before Labour Party special conference, photo Paul Mattsson (Click to enlarge)\nOne of the speakers at the protest was TUSC’s prospective mayoral candidate for Newham, Lois Austin: “Keir Hardie would be turning in his grave if he saw this conference.\n“I joined the Labour Party when I was 15 as I wanted to be in an organisation that fought for working class people. I was also the national chair of the Labour Party’s youth wing, the Labour Party Young Socialists, in the late 1980s.\n“But socialists like me were forced out or silenced by people like Tony Blair who were backed by big business to rid the party of socialists. The Collins Review is the last nail in the coffin of trade union representation within Labour”.\nAnother Newham TUSC council candidate, Bob Severn, said: “If you shop at Sainsbury’s, you don’t get to ‘opt in’ whether your purchases will end up funding the Tory party. These rule changes are about ending the remaining influence of organised working class people in Labour, to secure it as a pro-austerity, pro-big business party”.\nBut TUSC welcomes trade unionists as Labour closes the door.\nPress coverage of TUSC protest can be seen at the following websites:\nBBC: http://www.bbc.co.uk/news/uk-politics-26381922\nIndependent: http://www.independent.co.uk/news/uk/politics/ed-miliband-labour-party-reforms-will-bring-people-back-into-politics-9162294.html and picture at http://www.independent.co.uk/news/uk/politics/ed-miliband-gains-backing-from-lord-owen-as-labour-approves-reforms-9162835.html\nNewham Recorder: http://www.newhamrecorder.co.uk/news/trade_unionist_campaigners_protest_outside_labour_s_excel_centre_conference_1_3373968\nBarking and Dagenham Post: http://www.barkinganddagenhampost.co.uk/news/politics/trade_unionist_campaigners_protest_outside_labour_s_excel_centre_conference_1_3373968",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_05_01_labour-rent-proposals-dont-go-far-enough-only-tusc-has-real-solutions-to-housing-crisis/content_8.html": "Today Labour has called for caps on rent increases and an ending for excessive tenancy fees.\nBut Trade Unionist and Socialist Coalition candidates have said these proposals don’t go far enough.\nWaltham Forest TUSC candidate Nancy Taaffe said: “People stuck in the rip off private rent sector will of course welcome any capping on the money being stolen off them by extortionate landlords.\n“However Labour’s proposals don’t go anywhere near far enough and have been made long after TUSC candidates have been calling for rent controls.\n“Since the start of the year Waltham Forest TUSC has been campaigning for the return of rent controls. Today, when challenged by the Tories, Labour made clear that it would not bring back rent controls.\n“Was the housing situation worse when there were rent controls before 1989? No, it was far better due to the combination of capped rents in the private sector and a higher availability of council housing.”\n“Both Labour and the Tories support profiteering from housing through the expansion of private letting and privatisation of social housing. Only TUSC candidates have real solutions for the housing crisis.”\nLewisham TUSC mayoral candidate Chris Flood said: “When I was a Lewisham Socialist Party councillor I led a successful campaign to stop the Labour council’s privatisation of council housing in Telegraph Hill.\n“The New Labour governments are as much to blame for the current housing crisis as the Tories. The Blair and Brown governments and Labour councils pushed through the privatisation of council housing through housing associations, arms-length management organisations and private finance initiatives.\n“They said tenants had to vote for one of these options to get their homes maintained. In reality privatisation means rents will increase and accountability will fall. Less cash goes to upkeep as more goes into shareholders’ back pockets.\n“In Telegraph Hill we told tenants there was fourth option – properly funded, well maintained council housing. And that’s what they voted for.”\nNewham TUSC mayoral candidate Lois Austin said: “In Newham there is compulsory landlord registration. But this hasn’t stopped people sleeping in sheds and garages. This hasn’t stopped the cost of renting from ballooning. We need rent controls and rent councils – affordable rents with democratic accountability.\n“And we also need a crash programme of home construction to build truly affordable council housing – not 80% of the extortionate private market rates.\n“Today many labour councillors are themselves profiteering Landlords, so whose side do you think they’re really on?”\nTUSC councillors would build a mass campaign to win:\nRent control: Stop rip off landlords! A cap on rents in the private sector to bring private rents in line with social housing rents. Councils should have a compulsory register of private landlords – they should refuse to issue a license to landlords letting overcrowded, poor quality housing at rip-off rents. They could also set up a council-run, not-for-profit letting agency.\nRent councils: The government’s definition of ‘affordable’ means nothing to most of us. The council could establish committees of housing workers, tenants and the local trade unions to set the rents.\nHouse-building and renovation: Use the council’s reserves and borrowing powers to build and renovate enough decent quality social housing for all those who want it and campaign for the government to divert its private developer subsidy to a mass programme of building social housing.\nBring all housing association stock and housing services back in-house: Privatisation has driven up costs. You can’t control what you don’t own. The council should run all social housing and housing services itself for the best value and accountability to the community.\nAxe the bedroom tax: The bedroom tax is forcing the poorest and most vulnerable out of their homes. The council should immediately stop the implementation of the tax and associated eviction proceedings, as well as fully restore council tax benefit.",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_05_21_vote-tusc-on-22-may/content_7.html": "Vote Lois Austin for Mayor of Newham\nA workers’ mayor on a worker’s wage\nAxe the bedroom tax – Build council houses – Cap rents\nVote for TUSC – the party launched by Bob Crow\nThe Tories claim they’re an alternative to Labour in Newham – but it is the Tory government that has cuts Newham’s funding by a third. The Labour council may as well be Tory though – as it has more than agreed to carry through the cuts while carrying out the highest number of council home evictions! UKIP are also no alternative – they want to make more cuts than the Tories or Labour! Ukip hates public services as it’s another party headed by profit hungry millionaires.\nNewham TUSC says:\nAxe The Bedroom Tax! Cap rents not benefits – Build council homes\nPrivate landlords are pushing families into poverty with rip off rents. A cap on private rents and building council housing would offer familes safe and\naffordable homes.\nSupport the Focus E15 Mums – give them council housing in the borough\nNewham Council tried to re-house young mothers from Newham in Birmingham. We say give them council housing in the Borough\nA minimum wage of £10 an hour across the borough – End zero-hour contracts\nMany workers can’t afford to cover the rent, bills and living costs because wages are so low. Pay us enough to live.\nA free education for all! Reintroduce EMA – Young people deserve access to free, decent education.\nBringing back EMA will help teenagers from low paid families carry on their Education.\nNo NHS cuts. No privatisation. Defend NHS jobs.\nNewham Candidates\nForest Gate North: Bob Severn, Axe The Bedroom Tax\nForest Gate South: Niall Mulholland, NUJ\nGreen Street West: Mark Dunne, health worker\nGreen Street East: Lois Austin, anti-racism and anti-cuts Campaigner\nBoleyn: Ben Robinson , Axe The Bedroom Tax\nEast Ham North: Keerthkan Thennavan, Tamil Solidarity\nEast Ham Central: Helen Pattison, living wage campaigner\nEast Ham South: Steve Hedley, RMT Assistant General Secretary",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_04_03_reminder-newham-tusc-offical-launch/content_23.html": "Saturday 5 April, 3pm-5pm\nKatherince Road Community Centre, 254 Katherine Rd, London, E7 8PN\nElect Lois Austin\nfor a workers mayor on a workers wage!\nSir Robin Wales is paid £80,029 pa, and gave himself a 4% pay rise last year. Meanwhile the council plans to evict young mothers and ship them off around the country, they are implementing the bedroom tax, and allowing huge cuts to services though!\nThere is no fight back coming from Newham Labour!\nTUSC is an anti cuts coalition standing for Major and in a number of council seats around Newham.\nnewham.tusc@gmail.com",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com/content_1.html": "Vote Lois Austin for Mayor of Newham\nA workers’ mayor on a worker’s wage\nAxe the bedroom tax – Build council houses – Cap rents\nVote for TUSC – the party launched by Bob Crow\nThe Tories claim they’re an alternative to Labour in Newham – but it is the Tory government that has cuts Newham’s funding by a third. The Labour council may as well be Tory though – as it has more than agreed to carry through the cuts while carrying out the highest number of council home evictions! UKIP are also no alternative – they want to make more cuts than the Tories or Labour! Ukip hates public services as it’s another party headed by profit hungry millionaires.\nNewham TUSC says:\nAxe The Bedroom Tax! Cap rents not benefits – Build council homes\nPrivate landlords are pushing families into poverty with rip off rents. A cap on private rents and building council housing would offer familes safe and\naffordable homes.\nSupport the Focus E15 Mums – give them council housing in the borough\nNewham Council tried to re-house young mothers from Newham in Birmingham. We say give them council housing in the Borough\nA minimum wage of £10 an hour across the borough – End zero-hour contracts\nMany workers can’t afford to cover the rent, bills and living costs because wages are so low. Pay us enough to live.\nA free education for all! Reintroduce EMA – Young people deserve access to free, decent education.\nBringing back EMA will help teenagers from low paid families carry on their Education.\nNo NHS cuts. No privatisation. Defend NHS jobs.\nNewham Candidates\nForest Gate North: Bob Severn, Axe The Bedroom Tax\nForest Gate South: Niall Mulholland, NUJ\nGreen Street West: Mark Dunne, health worker\nGreen Street East: Lois Austin, anti-racism and anti-cuts Campaigner\nBoleyn: Ben Robinson , Axe The Bedroom Tax\nEast Ham North: Keerthkan Thennavan, Tamil Solidarity\nEast Ham Central: Helen Pattison, living wage campaigner\nEast Ham South: Steve Hedley, RMT Assistant General Secretary",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_03_22_newham-tusc-mayoral-candidate-joins-focus-e15-mums-to-confront-austerity-mayor/content_5.html": "TUSC Newham mayoral candidate Lois Austin confronts £80,000 pa Sir Robin Wales, whose New Labour council has cut services by a third in the 6th poorest borough in the country.\nLois joined the Focus E15 single young mothers facing eviction due to cuts.\n1 thought on “Newham TUSC mayoral candidate joins Focus E15 mums to confront austerity mayor”\nComments are closed.",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_tag_housing-benefit/content_15.html": "Join the Trade Unionist and Socialist Coalition protest outside the Landlord and Letting Show at the Barbican, London, on Wednesday 26 February from 9am.\nProtesters will call for rent controls and an end to rip-off landlords – for rent caps instead of benefit caps.\nReports over the past few days have shown how millionaire landlord are making fortunes out of housing benefit.\nLandlords will collect £9.2 billion from housing benefit this year alone – in many cases for doing very little. One million privately rented homes fail to meet basic safety standards.\nBritain’s richest MP, Tory Richard Benyon – ‘worth’ £110 million – is piling up £625,000 a year from housing benefit claimants. So if he wants to cut the benefit bill, he should start by cutting the rents he charges.\nUkip’s housing spokesperson, Andrew Charalambous, collected £745,351 from housing benefit, again showing how his party are just another group of hypocritical millionaires.\nAnd today it’s been reported that the Duchy of Cornwall and Crown Estates receive over £200,000 a year from housing benefits.\nThis money should instead be going to building and renovating affordable, publicly owned housing.\nAcross London, Trade Unionist and Socialist Coalition local election candidates are demanding:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts\nJoin the protest: Wednesday 26 February, 9am, Hall 2, Barbican Centre, corner of Golden lane/Beech Street tunnel, London EC2Y 8AD – nearest tube Barbican",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_about/content_20.html": "Newham TUSC is standing in the 22 May 2014 elections against all cuts, in opposition to the 100% New Labour council that has carried through the Con-Dems’ cuts. Join us, vote for us!\nAlso see www.facebook.com/newhamTUSC and @TUSC Newham.\nContact 07432 593 149 or newham.tusc@gmail.com\nThis blog is promoted by Bob Severn, 29A Maud Road, London E13 0JT on behalf of all Newham TUSC candidates.\n1 thought on “About”",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_02/content_10.html": "Campaigners called for rent controls outside the Landlord and Letting Show at the Barbican in a protest organised by Newham and Waltham Forest Trade Unionist and Socialist Coalition groups.\nWith Tory MP and landlord Richard Benyon getting £635,000 from housing benefit in just one year, protesters called for rent caps instead of benefit caps.\nSome landlords said it was fair that the ‘market decides’ rents and that ‘everyone needs to make a profit’. Millions of tenants struggling to pay the rent will disagree. One landlord said they needed to have enough money to afford to evict people!\nTUSC campaigners call for:\n• Rent controls – a cap on rents in the private sector to bring private rents in line with social housing\n• Council-run, not for profit letting agencies\n• Borough rent councils, made up of housing workers, tenants and local trade unions\n• House building and renovation – campaign for the government to divert its private developer subsidy to a mass programme of building social housing. For councils to use reserves and borrowing powers to build and renovate public housing now\n• Bring all housing association stock and housing services back in-house – privatisation has driven up costs\n• Axe the bedroom tax and reverse all housing benefit cuts",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_author_bbkingbr/content_2.html": "Vote Lois Austin for Mayor of Newham\nA workers’ mayor on a worker’s wage\nAxe the bedroom tax – Build council houses – Cap rents\nVote for TUSC – the party launched by Bob Crow\nThe Tories claim they’re an alternative to Labour in Newham – but it is the Tory government that has cuts Newham’s funding by a third. The Labour council may as well be Tory though – as it has more than agreed to carry through the cuts while carrying out the highest number of council home evictions! UKIP are also no alternative – they want to make more cuts than the Tories or Labour! Ukip hates public services as it’s another party headed by profit hungry millionaires.\nNewham TUSC says:\nAxe The Bedroom Tax! Cap rents not benefits – Build council homes\nPrivate landlords are pushing families into poverty with rip off rents. A cap on private rents and building council housing would offer familes safe and\naffordable homes.\nSupport the Focus E15 Mums – give them council housing in the borough\nNewham Council tried to re-house young mothers from Newham in Birmingham. We say give them council housing in the Borough\nA minimum wage of £10 an hour across the borough – End zero-hour contracts\nMany workers can’t afford to cover the rent, bills and living costs because wages are so low. Pay us enough to live.\nA free education for all! Reintroduce EMA – Young people deserve access to free, decent education.\nBringing back EMA will help teenagers from low paid families carry on their Education.\nNo NHS cuts. No privatisation. Defend NHS jobs.\nNewham Candidates\nForest Gate North: Bob Severn, Axe The Bedroom Tax\nForest Gate South: Niall Mulholland, NUJ\nGreen Street West: Mark Dunne, health worker\nGreen Street East: Lois Austin, anti-racism and anti-cuts Campaigner\nBoleyn: Ben Robinson , Axe The Bedroom Tax\nEast Ham North: Keerthkan Thennavan, Tamil Solidarity\nEast Ham Central: Helen Pattison, living wage campaigner\nEast Ham South: Steve Hedley, RMT Assistant General Secretary",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_02_25_8/content_25.html": "Newham TUSC campaginer Helen Pattison supporting the nearest Atos protest in Romford on 19 February. As Clive Heemskerk said in his letter to the Guardian, councillors “could refuse to implement the bedroom tax and council tax benefit cuts, which have affected disabled people also hit by WCAs.”",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_04_06_30-attend-newham-tusc-election-launch/content_27.html": "Thirty people listened to mayoral candidate Lois Austin speak at Newham Trade Unionist and Socialist Coalition’s election launch meeting at Katherine Road Community Centre on Saturday 5 April.\nIntroducing the meeting as chair, Helen Pattison said how a Newham Labour council had come up to the TUSC stall at Upton Park earlier in the day. He looked at a Newham TUSC leaflet, which listed policies including:\n· Cap rents not benefits – build council homes\n· Axe the bedroom tax\n· Support the Focus E15 mums\n· A minimum wage of £10 an hour across the borough\n· End zero-hour contracts\n· A free education for all. Reintroduce EMA\n· No NHS cuts. No privatisation. Defend NHS jobs\nThe Labour councillor responded by saying: “I don’t stand for any of that.”\nMayoral candidate Lois Austin said: “Newham desperately needs an alternative to the main three big business parties.”\nLois Austin said that TUSC was Bob Crow’s party. RMT general secretary Crow, who died in March and whose funeral was held in the East London cemetery in Manor Park, was a founding member of TUSC in 2010. “Under Bob, the RMT succeeded in standing up for it members in resisting cuts and privatisation.” TUSC was set up to have an alternative to Labour that stood up for working class people.\n“We have a rotten Labour council, who do the really nasty things they don’t have to do – implement the bedroom tax, issue eviction notices, allowing the eviction of the E15 mums.”\nLois said that the Olympic legacy hasn’t benefitted most people in Newham, but instead pushed up property prices in Stratford while Newham has an acute housing crisis, with people living in cramped housing, many living in sheds and garages.\n“24,000 people are on the council house waiting list. We need to build 20,000 council homes while renovating the many empty properties.”\n“Labour councillors say they can’t oppose the cuts as it means breaking the law. But that’s not true.\n“We’ve seen £110 million of cuts in Newham, but they have £180 million in reserves while £111 million was spent on Building 1,000. We’d do all the things that working class people need, like restoring EMA.\n“We’d set a needs budget. A third of families in Newham are deprived. We’d lift people out of poverty. We’d build a mass campaign, link up with other councils that agree with us, and take on the Tories – or Labour Party if they’re in government, to get the needed money.”\nSteve Hedley, RMT assistant general secretary and a Newham TUSC council candidate, said: “Newham Labour say they’re against cuts, but have no choice. It’s like saying you’re a vegetarian, and having pork pies for lunch! That’s why I’m urging everyone here to get involved in TUSC campaigning.”\nMany TUSC supporters spoke from the floor, including a retired Newham council worker and GMB steward, and a Somali woman who spoke about the horrors of being stuck in agency work with no holiday rights or sick pay.\nTo finish the meeting, Lois spoke about her record as a campaigner. She was an organiser against the poll tax, which was defeated by a mass non-payment campaign of millions of people. Lois was chair of Youth Against Racism in Europe, and led a seven-year campaign that got the BNP headquarters in Welling closed.\nLois was a founding member of the Stop the War Coalition, campaigning against the unjust wars in Afghanistan and Iraq. Lois helped leaded the Stratford Academy Concerned Parents, which in 2012 united staff, parents and the local community in support of a teachers’ strike that successfully stopped cuts to teachers’ pat and the bullying of staff.\nAt the end of the meeting, TUSC candidates and supporters gathered behind the Newham TUSC banner for a group photo.",
  "https_newhamtusc_wordpress_com_/https_newhamtusc_wordpress_com_2014_02_25_last-nights-town-hall-protests/content_17.html": "First Newham TUSC protested outside the town hall against more cuts (£15 million in tonight’s budget) and for affordable housing….\n…and then we joined in with the Focus E15 mum protest inside the town hall after they weren’t allowed into the council chamber. The mums are being evicted and pushed out of Newham, for some this could be over 100 miles, into insecure expensive private renting – all thanks to Newham Labour’s removal of support for the Focus scheme."
}