{
  "https_davidbaines_co_uk/https_davidbaines_co_uk_support/content_4.html": "Who can David help?\nDavid can only help in cases raised by people who live in the St Helens North constituency, which covers the local wards of Billinge and Seneley Green, Blackbrook, Haydock, Moss Bank, Newton-le-Willows, Parr, Rainford and Windle. Strict Parliamentary protocol means that MPs are only allowed to take up cases on behalf of their own constituents.\nYou can check if David is your local MP by entering your postcode here.\nPlease note that if you are contacting David on behalf of a friend or family member he will need their consent over the phone or in writing before taking action.\nWhat issues can David help with?\nDavid can help you with any matter for which Parliament or central government is responsible such as:\nHow can David help?\nDavid and his team can help constituents by raising concerns with the relevant organisation, government department or official, or writing to the relevant Minister. Our constituent cases are dealt with in terms of how urgent the case is, so please note that due to the volume of correspondence David receives, helping constituents with urgent personal problems has to take priority over responding to correspondence on political issues.\nPlease note that David doesn't have any control over St Helens Borough Council and if your enquiry relates to a local government matter your ward councillors are the best people to assist you. This includes issues related to streets and pavements, waste collection, local parks, planning issues, high street services, and local developments. You can contact your local councillors by entering your postcode here. Please contact them in the first instance.\nSt Helens Borough Council can be reached on 01744 676789.\nDo you have a question about Labour policy or David's position on a particular issue?\nIf you are contacting David with a query about policy please visit The Labour Party website to read the Party’s latest policy positions. Please note that if your email is from an organised campaign on a specific issue (e.g. 38 Degrees or change.org) David is unlikely to be able to send you a personal reply due to receiving a large volume of correspondence of this nature. Personal correspondence will always be dealt with as quickly as possible but David receives hundreds of emails, letters and calls every week and urgent requests for support will be dealt with first, ahead of policy questions.\nGet in touch with David\nEmail: david.baines.mp@parliament.uk\nPhone: 01744 21336\nWriting: Suite 2 Westway House, 42-44 Bridge Street, Newton-Le-Willows WA12 9QT",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_my-commitments-to-you/content_6.html": "I have been an active campaigner for 20 years, and will continue to work all year round for you.\nCopyright © 2025 David Baines for St Helens North - All Rights Reserved.\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_privacy-policy/content_2.html": "This Privacy Notice for David Baines for St Helens North ('me', 'we', 'us', or 'our'), describes how and why we might collect, store, use, and/or share ('process') your information when you use our services ('Services'), such as when you:\nVisit our website at davidbaines.co.uk, or any website of ours that links to this privacy notice; Engage with us in other related ways, including any marketing or events.\nHave Questions or Concerns?\nUnderstanding your privacy rights and choices is essential. If you do not agree with our policies and practices, please do not use our Services. If you still have any questions or concerns, please contact us at david@davidbaines.co.uk\nWhat Personal Information Do We Process?\nWhen you visit, use, or navigate our Services, we may process personal information depending on how you interact with David Baines for St Helens North and the Services, the choices you make, and the products and features you use.\nDo We Process Any Sensitive Personal Information?\nWe may process sensitive personal information when necessary with your consent or as otherwise permitted by applicable law.\nDo We Receive Any Information From Third Parties?\nWe do not receive any information from third parties.\nHow Do We Process Your Information?\nWe process your information to provide, improve, and administer our Services, communicate with you, for security and fraud prevention, and to comply with the law. We may also process your information for other purposes with your consent. We process your information only when we have a valid legal reason to do so.\nIn What Situations and With Which Parties Do We Share Personal Information?\nWe may share information in specific situations and with specific third parties.\nHow Do We Keep Your Information Safe?\nWe have organizational and technical processes and procedures in place to protect your personal information. However, no electronic transmission over the internet or information storage technology can be guaranteed to be 100% secure, so we cannot promise or guarantee that hackers, cybercriminals, or other unauthorized third parties will not be able to defeat our security and improperly collect, access, steal, or modify your information.\nWhat Are Your Rights?\nDepending on your geographic location, applicable privacy law may grant you certain rights regarding your personal information.\nHow Do You Exercise Your Rights?\nThe easiest way to exercise your rights is by contacting us. We will consider and act upon any request in accordance with applicable data protection laws.\n1. WHAT INFORMATION DO WE COLLECT?\nPersonal Information You Disclose to Us\nIn Short: We collect personal information that you provide to us.\nWe collect personal information that you voluntarily provide to us when you express an interest in obtaining information about us or our products and Services, when you participate in activities on the Services, or otherwise when you contact us.\nPersonal Information Provided by You. The personal information that we collect depends on the context of your interactions with us and the Services, the choices you make, and the products and features you use. The personal information we collect may include the following:\nSensitive Information. When necessary, with your consent or as otherwise permitted by applicable law, we process the following categories of sensitive information:\nAll personal information that you provide to us must be true, complete, and accurate, and you must notify us of any changes to such personal information.\n2. HOW DO WE PROCESS YOUR INFORMATION?\nIn Short: We process your information to provide, improve, and administer our Services, communicate with you, for security and fraud prevention, and to comply with law. We may also process your information for other purposes with your consent.\nWe process your personal information for a variety of reasons, depending on how you interact with our Services, including:\n3. WHAT LEGAL BASES DO WE RELY ON TO PROCESS YOUR INFORMATION\nIn Short: We only process your personal information when we believe it is necessary and we have a valid legal reason (i.e. legal basis) to do so under applicable law, like with your consent, to comply with laws, to provide you with services to enter into or fulfil our contractual obligations, to protect your rights, or to fulfil our legitimate business interests.\nThe General Data Protection Regulation (GDPR) and UK GDPR require us to explain the valid legal bases we rely on in order to process your personal information. As such, we may rely on the following legal bases to process your personal information:\n4. HOW LONG DO WE KEEP YOUR INFORMATION?\nIn Short: We keep your information for as long as necessary to fulfil the purposes outlined in this privacy notice unless otherwise required by law.\nWe will only keep your personal information for as long as it is necessary for the purposes set out in this privacy notice, unless a longer retention period is required or permitted by law (such as tax, accounting, or other legal requirements).\nWhen we have no ongoing legitimate business need to process your personal information, we will either delete or anonymize such information, or, if this is not possible (for example, because your personal information has been stored in backup archives), then we will securely store your personal information and isolate it from any further processing until deletion is possible.\n5. HOW DO WE KEEP YOUR INFORMATION SAFE?\nIn Short: We aim to protect your personal information through a system of organizational and technical security measures.\nWe have implemented appropriate and reasonable technical and organizational security measures designed to protect the security of any personal information we process. However, despite our safeguards and efforts to secure your information, no electronic transmission over the Internet or information storage technology can be guaranteed to be 100% secure, so we cannot promise or guarantee that hackers, cybercriminals, or other unauthorized third parties will not be able to defeat our security and improperly collect, access, steal, or modify your information. Although we will do our best to protect your personal information, transmission of personal information to and from our Services is at your own risk. You should only access the Services within a secure environment.\n6. DO WE COLLECT INFORMATION FROM MINORS?\nIn Short: We do not knowingly collect data from or market to children under 18 years of age.\nWe do not knowingly solicit data from or market to children under 18 years of age. By using the Services, you represent that you are at least 18 or that you are the parent or guardian of such a minor and consent to such minor dependent’s use of the Services. If we learn that personal information from users less than 18 years of age has been collected, we will deactivate the account and take reasonable measures to promptly delete such data from our records. If you become aware of any data we may have collected from children under age 18, please contact us at david@davidbaines.co.uk\n7. WHAT ARE YOUR PRIVACY RIGHTS?\nIn Short: In some regions, such as the European Economic Area (EEA) and United Kingdom (UK), you have rights that allow you greater access to and control over your personal information. You may review, change, or terminate your account at any time.\nIn some regions (like the EEA and UK), you have certain rights under applicable data protection laws. These may include the right (i) to request access and obtain a copy of your personal information, (ii) to request rectification or erasure; (iii) to restrict the processing of your personal information; and (iv) if applicable, to data portability. In certain circumstances, you may also have the right to object to the processing of your personal information. You can make such a request by contacting us by using the contact details provided in the section 'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?' below.\nWe will consider and act upon any request in accordance with applicable data protection laws.\nIf you are located in the EEA or UK and you believe we are unlawfully processing your personal information, you also have the right to complain to your local data protection supervisory authority. You can find their contact details here.\nIf you are located in Switzerland, the contact details for the data protection authorities are available here.\nWithdrawing Your Consent: If we are relying on your consent to process your personal information, you have the right to withdraw your consent at any time. You can withdraw your consent at any time by contacting us by using the contact details provided in the section 'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?' below.\nHowever, please note that this will not affect the lawfulness of the processing before its withdrawal nor will it affect the processing of your personal information conducted in reliance on lawful processing grounds other than consent.\nOpting Out of Marketing and Promotional Communications: You can unsubscribe from our marketing and promotional communications at any time by clicking on the unsubscribe link in the emails that we send, replying 'STOP' or 'UNSUBSCRIBE' to the SMS messages that we send, or by contacting us using the details provided in the section 'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?' below. You will then be removed from the marketing lists. However, we may still communicate with you — for example, to send you service-related messages that are necessary for the administration and use of your account, to respond to service requests, or for other non-marketing purposes.\nIf you have questions or comments about your privacy rights, you may email us at david@davidbaines.co.uk\n8. CONTROLS FOR DO-NOT-TRACK FEATURES\nMost web browsers and some mobile operating systems and mobile applications include a Do-Not-Track ('DNT') feature or setting you can activate to signal your privacy preference not to have data about your online browsing activities monitored and collected. At this stage, no uniform technology standard for recognizing and implementing DNT signals has been finalized. As such, we do not currently respond to DNT browser signals or any other mechanism that automatically communicates your choice not to be tracked online. If a standard for online tracking is adopted that we must follow in the future, we will inform you about that practice in a revised version of this privacy notice.\n9. DO WE MAKE UPDATES TO THIS NOTICE?\nIn Short: Yes, we will update this notice as necessary to stay compliant with relevant laws.\nWe may update this privacy notice from time to time. The updated version will be indicated by an updated 'Revised' date, and the updated version will be effective as soon as it is accessible. If we make material changes to this privacy notice, we may notify you either by prominently posting a notice of such changes or by directly sending you a notification. We encourage you to review this privacy notice frequently to be informed of how we are protecting your information.\n10. HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\nIf you have questions or comments about this notice, you may email us at david@davidbaines.co.uk\n11. HOW CAN YOU REVIEW, UPDATE, OR DELETE THE DATA WE COLLECT FROM YOU?\nBased on the applicable laws of your country, you may have the right to request access to the personal information we collect from you, change that information, or delete it. To request to review, update, or delete your personal information, please submit a request by emailing david@davidbaines.co.uk",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_pathways-to-work/content_7.html": "Secretary of State for Work and Pensions Liz Kendall has published the government’s plans to reform welfare in a Green Paper titled ‘Pathways to Work’.\nMy starting point with this is one I think most people can agree on: we need a welfare system that works for all of us. Those who can work, should. Those who need adjustments in the workplace should get them. And importantly, those who cannot work should always be properly supported.\nThere is no doubt that the current system is failing. Too many people are stuck on benefits with not enough support to get into work, too many employers don't or can't do enough to make adjustments for staff who need them, and too many young people are not in education, employment or training – about 1 in 8 nationally, which is around 1 million young people. And there is no getting away from the fact that the cost of the welfare bill is spiralling and unsustainable.\nI welcome a lot of what the government has announced including £1billion for employment support, scrapping Work Capability Assessments, increasing Universal Credit above inflation, introducing a ‘Right to Try’ so people can have a go at working and return to their benefits without a reassessment if it doesn’t work out, and giving more support for those severely disabled who will sadly never be able to work.\nHowever I am concerned about proposals to raise the threshold for the Personal Independence Payment Daily Living payment, and I am worried too about the idea of increasing the age for young people to qualify for the Universal Credit Health element to 22.\nIt is important to note that none of the reforms announced by the government will result in any immediate changes to anyone’s benefits. I want to reassure all my constituents that my office and I will continue to be available to help people access benefits or advice.\nYou can read the Green Paper and take part in the government consultation here, where accessible formats are also available: Pathways to Work: Reforming Benefits and Support to Get Britain Working Green Paper - GOV.UK\nI would also be grateful if you could share your views with me. I have been speaking with local organisations which offer a range of support to disabled people, older people and younger people, and I have found their input extremely helpful.\nI want to hear from as many people as possible about what's not working in our welfare system right now, what is, and what needs to change for the better.\nIf you live in St Helens North, please tell me your views below:",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_newsletters/content_8.html": "As our Member of Parliament I want to do all I can to keep residents in every part of St Helens North informed of my work both here in our local area and in Parliament. As part of this I will be publishing regular newsletters.\nDownload my latest newsletter below, subscribe above, and please do get in touch if you have any questions or comments.",
  "https_davidbaines_co_uk/https_davidbaines_co_uk/content_1.html": "Welcome to the official website of David Baines MP\nMember of Parliament for\nSt Helens North\nMember of Parliament for\nSt Helens North\nMeeting Health Secretary Wes Streeting to discuss health services in St Helens North\nPromoted by Andy Bowden on behalf of David Baines, both c/o Room S4, 8 Bickerstaffe Street, St Helens, WA10 1DH.",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_my-record/content_11.html": "I was a teacher in local Primary Schools for nearly a decade and a voluntary youth worker before that, and my wife is a teaching assistant. I want to raise aspiration and achievement and fight for investment in services for children. As Leader of the council, together we took Children's Services from 'inadequate' to 'good', with services for care leavers rated 'outstanding', and while the Tories have let schools crumble, we rebuilt them. I was delighted to open the brand new Ashurst Primary School and deliver a modern new facility for Penkford at Willow Bank. We also worked to make sure children and young people are at the heart of the borough's regeneration and investment plans, from giving them access to new careers and opportunities to having a say on what we do and how.\nWe've all experienced huge challenges in recent years. In leading the Council through the pandemic I worked with partners from the public, third and private sector to coordinate support for communities and protect the most vulnerable. We set up #StHelensTogether which is now continuing to offer help for those who need it through the cost of living crisis, including supporting the launch of the mobile food pantry and through the ongoing work of our award-winning Inequalities Commission to begin to tackle the long term health inequalities within the borough. New homes, new jobs and new infrastructure is also vital to this, and that's why I worked so hard as Leader to attract investment alongside agreeing an Inclusive Growth Strategy to make sure local people and businesses are at the front of the queue for the opportunities we create.\nEvery year the task of setting a balanced budget for the Council gets harder as government funding goes down and demand for essential services like social care goes up, and all public services are facing the same challenge - just like most households and businesses. Working with public, private and third sector partners including schools, the NHS, GPs and more, I led our local campaign calling on the government to provide fair funding for services. I will always be a staunch defender of our public services. We also did all we could to support workers - as Leader I took the decision to give all care workers the Foundation Living Wage, supporting the UNISON campaign.\nAs Leader of the council we made huge progress on several major projects. We delivered plans and funding for once in a lifetime regeneration of Earlestown and St Helens town centres; we began bringing Earlestown Town Hall back into full public use, with external repairs now complete; we secured Freeport status for Parkside and delivered the Link Road, as promised, before work begins on Phase One; Glass Futures is nearing completion, ready to transform the global glass industry and lead work on decarbonisation across the foundation industries; and we delivered a Local Plan which is ambitious for jobs, homes and infrastructure while protecting the vast majority of our green and open spaces.",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_my-story/content_5.html": "St Helens North is my home, and I am honoured to be our Member of Parliament. I live in St Helens North with my wife and two young children and I was a teacher in local schools for nearly a decade. Before that, I was a volunteer youth worker with children and young people in Moss Bank.\nI was Leader of the Council from 2019, taking us through the challenges of Covid, ongoing austerity and the cost of living crisis.\nI grew up in Haydock in the 80’s, raised by my mum and dad who are from Blackbrook and Parr. They worked all hours and days to make ends meet and I couldn’t have asked for better role models.\nWe felt the devastation Thatcher’s government did to communities, especially ones like ours. Through difficult times my family taught me the importance of hard work, compassion and community from an early age. Those values guide everything I do.\nI was nearly 18 before I saw a Labour government and the difference it made to families like mine and communities like ours, and another generation has suffered under the Tories in the last 14 years.\nAt KGV park in Haydock, early 80s\nFor more than 20 years as a Labour member and proud trade unionist I’ve campaigned right across the borough.\nI first stood for election in 2013 for the ward I live in because I wanted to try and make a difference to my local community. I then started working for the Labour Party as a campaign organiser and for a Labour MP and Shadow Minister, for the same reason I got into teaching - to try and help people.\nIn 2019 I was given the huge honour and responsibility of leading the Council. We've faced massive challenges in this time, and as Leader of our fantastic Labour team I’ve fought tooth and nail for our communities on the local, regional and national stage, from leading efforts to support communities through the pandemic and cost of living emergency to building new schools, taking Children’s Services from ‘inadequate’ to ‘good’, agreeing plans and funding for once in a lifetime regeneration of our town centres, beginning work to bring Earlestown Town Hall and the Gamble back into full public use, delivering transformational projects like Glass Futures and Parkside redevelopment, and much more.\nLike my Dad took me, now I take my own sons to Saints\nAs a teacher and as a councillor I saw the impact of Tory chaos, and as a resident I felt it, just like we did in the 80s. Our public services were left decimated. Our health services on their knees. Our schools struggling to set a budget.\nThe Tories stacked the deck against working people and communities like ours, just like they always do. We deserve better, and that's why I wanted to take the fight for you and our local area to Parliament.\nI have always put the interests of our local area first, and I always will.\nCLICK HERE TO READ MORE ABOUT MY RECORD\nI've always fought for our communities, and I always will",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_assisted-dying/content_10.html": "The assisted dying bill, officially titled Terminally Ill Adults (End of Life Bill) 2024-25 will have its Second Reading in the House of Commons this Friday. If approved, it will go to the Committee Stage which will involve a small number of MPs reviewing and revising the bill, and then Third Reading, again in the Commons. If it falls on Friday, it can be proposed again in the future although it is unlikely it would be for some time.\nI would like to thank all those in St Helens North who have contacted me about it from both sides of the debate, and all those who have given me their time to discuss the bill and answer my questions. I have heard the views of local hospice and palliative care specialists, doctors, individuals working in social care, community groups, faith leaders, clinicians, carers and hundreds of constituents from all walks of life.\nI have decided to vote against the bill on Friday, and would like to explain why.\nLet me say first of all that I have enormous respect for those in favour of the bill and I have no doubt that they are supporting it in good faith and with the very best intentions. There are strong arguments in favour, and I have considered them carefully. In principle, the idea of ‘my death, my choice’ is a clear and logical one. And I have been incredibly moved by the personal stories and experiences of those whose loved ones have suffered painful or undignified deaths. But in deciding how to vote on this issue I wanted to consider the wider implications and particularly the impacts on vulnerable groups, both intentional and unintentional.\nAs I have previously stated, I came into this with an open mind and with no strong views either way. If pushed, before giving the issue due consideration I would most probably have been inclined to support the bill for reasons of personal choice and liberty. However, it wasn’t something I had ever had great cause or inclination to think deeply about, so I have come into this ready and willing to study all the evidence and arguments.\nHaving done so, I can say that the more I have read, the more I have listened, the more conversations I have had, the more I have become convinced that this is the wrong bill at the wrong time.\nFirstly, I have heard the concerns of those who work in end of life care and with vulnerable people who are convinced that the risk of coercion is impossible to eliminate. There are safeguards in the bill but they simply do not and cannot prevent incidents of vulnerable or frail individuals being coerced, consciously or subliminally, into ending their own lives early.\nIn the view of Not Dead Yet, a network of disabled people who oppose assisted dying: “We’re concerned that disabled people and people who are seriously ill could feel pressure (real or imagined) to request an early death. That’s particularly true if people are anxious about being a financial, emotional or physical burden.” This view has been echoed by many others I have spoken with who work in healthcare and with vulnerable people in particular.\nAlready around 375000 people over the age of 60 are subject to abuse every year in England and Wales. This is a shocking figure.\nSupporters of the bill state that its safeguards are “the most robust in the world”. In their own view therefore, this bill is as good as it gets, and so no amount of debate at Committee Stage, should the bill pass this Friday, will be able to address concerns regarding the very real risks of coercion.\nAnd even if we were to accept that this bill makes it unlikely that vulnerable adults might be deliberately coerced, I feel the greater risk which will inevitably exist is people taking the decision to end their lives because they feel like a burden to their loved ones or to the NHS – something they are more likely to feel given the current state of palliative care and social care more generally, which brings me to my next major objection.\nI have heard the concerns of constituents, social care workers, palliative care specialists and hospices about the current state of palliative and social care. It is a scandal. There is a huge amount we need to do in order to fix in our health system and end of life care must be high on that list.\nIn and of itself this is no reason to oppose assisted dying. But the fact that as a whole the system is currently ill-equipped to offer real choice should give us all pause for thought.\nThere are many outstanding people and groups providing end of life care but the system right now leaves too many patients not only fearful about their own possible pain and discomfort, but also at risk of feeling like a burden to their loved ones.\n85% of the Association for Palliative Medicine members oppose a change in the law, and those working in the sector have told me clearly that they believe the government should be prioritising improvements in end of life care, not assisted dying.\nIn the words of one local doctor who specialises in palliative care: “I am extremely concerned that allowing assisted dying as a choice without getting the support to make the full spectrum of choices available to a person will potentially skew their decision towards that.”\n“I have consulted with many people over the years who are facing the end of their life. In the vast majority of cases where they have expressed a wish for their life to be over it is because of poor symptom control or fear of pain or other symptoms. Often with good palliative care we can alleviate those things but we are a precious commodity in specialist palliative care and not everyone can access it across England.\n“How can we offer people the option to end their life sooner without first ensuring that they have had the opportunity for the best possible symptom control and advanced care planning?”\nI have also heard concerns from clinicians and those in the health system that the proposed process set out in the bill is problematic.\nThe bill states that the patient must be terminally ill and have been given a prognosis of six months, and then two doctors and a judge must approve the patient’s request for an assisted death.\nFirstly, I have heard overwhelming evidence which suggests giving a six month prognosis is far from an exact science. I have heard clearly from doctors and end of life specialists the concerns they have about this key premise of the bill. They have shared with me many examples from their own work over many years in which patients have lived far beyond the six months they were given, and have lived well thanks to good care and pain management.\nThe definition of terminal illness in the bill has also attracted criticism, with one eating disorder charity expressing fears that the wording would mean that disorders such as anorexia and bulimia might qualify.\nSecond, I have heard significant concerns from clinicians including doctors about the expectations placed upon the ‘coordinating doctor’ and others in the process. They will require extensive knowledge of the patient, their condition, symptom control, advanced care planning, assessing capacity, and safeguarding. In the words of one doctor who has contacted me, the requirements placed on the doctor “describes a palliative care doctor […] but there are not enough of us.”\nWe also have to consider that a survey by the British Medical Association which represents doctors found that 45% of their members said they would be unwilling to participate in the process in any way, and under the proposals in the bill they would, rightly, be under no obligation to be involved. The current health and care system is already stretched; to introduce new demands of staff is a challenge at any time, but when nearly half are unwilling to participate questions must be asked about its practicality.\nFinally, I have considered the arguments about a ‘slippery slope’. The bill is clearly defined and constricted to terminally ill adults with six months to live (though I have referred to concerns about these points above) and I find the steps the bill’s authors have made in this regard reassuring. However, the worries from many quarters about this bill opening the door to further expansion are understandable. I have heard from constituents and end of life care specialists who are concerned about this, and I do believe that it risks fundamentally shifting our perceptions of death, end of life care, the role of physicians and the health system more widely.\nWhen considered in the context of current pressures around palliative and social care, I do not believe that such a shift is in society’s general interest. Furthermore, the experience in other territories is that we should expect legal and political efforts to try and expand the criteria. We need to think very carefully before opening the door to that.\nFor all these reasons I will be opposing the bill on Friday. It has been suggested that those with doubts should support it at this stage and then there can be a longer debate at Committee Stage, but there has already been years of debate over this and the concerns people have are well documented. Many MPs might be new to it – including me – but the debate itself isn’t new. A small committee of MPs looking at the bill line by line is not going to be able to address the concerns which are already well known. If the problems I have outlined above could be addressed, I think they would have been in the version of the bill in front of us.\nI know my decision will be disappointing for those constituents who have urged me to support it, but I hope this statement at least explains my reasons and shows how deeply I have considered this issue. It is not something I have taken lightly.\nI have no doubt that the majority of MPs, whether we vote for or against the bill, want to see improvements in the NHS, social care, and in palliative care too. It isn’t right that any patient suffers a painful death in discomfort or without dignity, and without access to the highest quality palliative care. We need to focus our time and energy on improving that situation urgently.",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_news/content_3.html": "Copyright © 2025 David Baines for St Helens North - All Rights Reserved.\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data.",
  "https_davidbaines_co_uk/https_davidbaines_co_uk_tell-me-your-priorities/content_9.html": "This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nCopyright © 2025 David Baines for St Helens North - All Rights Reserved.\nPowered by\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data."
}