{
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_cdn-cgi_l_email-protection/content_24.html": "The website from which you got to this page is protected by Cloudflare. Email addresses on that page have been hidden in order to keep them from being accessed by malicious bots. You must enable Javascript in your browser in order to decode the e-mail address.\nIf you have a website and are interested in protecting it in a similar way, you can sign up for Cloudflare.",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_about-rss/content_12.html": "RSS feeds and news syndication\nYou can read the latest news from this website using your news reader, or display them on your own website using RSS (Rich Site Summary) XML documents, wherever you see the orange RSS symbol.\nWhat is RSS?\nRSS is a defacto XML standard invented by Netscape for news distribution, now used by thousands of sites. RSS is an open format that uses a simple set of XML tags to define a news \"channel\" that allows any site to provide basic meta-information about your new content (headline, link, description).\nWhenever you use our RSS feeds publicly (where anyone but yourself would be reading them), you should provide proper attribution to this website. We cannot provide advice or technical support in the coding and integration of our RSS feeds into your site or software. Additionally we ask that you cache the RSS feed and do not query more than once in any hour.",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-presses-justice-secretary-prisoner-early-release-scheme/content_21.html": "Bromsgrove and the surrounding villages are benefitting from an extra 330 new police officers across West Mercia since 2019.\nAs your MP, I will campaign for additional police patrols, particularly in rural areas; a crackdown on anti-social behaviour; and an increase in new opportunities for young p\nWriting in this week's (May 2nd) Bromsgrove Standard, Bradley said:“Traffic congestion and delays blight our everyday lives and hampers our economy.I get your frustrations, and even anger, with Bromsgrove’s traffic problems because I get stuck in the gridlock too.Whilst as an MP I have no direct pow",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-urges-government-continue-backing-midlands-rail-hub/content_16.html": "Bradley has urged the Government to continue backing the Midlands Rail Hub ahead of its Spending Review.\nIn a letter to the Transport Secretary Heidi Alexander, the local MP urged her to support the £1.75 billion project’s ‘strong’ business case.\nThe Midlands Rail Hub will allow for an additional Cross City train to run each hour to and from Bromsgrove, giving a regular three trains per hour Cross City service from Bromsgrove into Birmingham. Bromsgrove will also continue to be served by faster trains to Birmingham that have originated in Hereford or Worcester.\nBarnt Green and Alvechurch, will also benefit from the proposals. They will also benefit from an additional Cross City service to and from Redditch, which the Midlands Rail Hub provides extra capacity for.\nThe project was supported by previous MP Sajid Javid who, when Chancellor, gave £20 million to support the early development of the scheme. In February 2024, the previous Government announced funding to deliver the Full Business Case for the Midlands Rail Hub moving the project forward to the delivery phase.\nBradley said:\n“A key part of My Plan for Bromsgrove and the Villages is to improve local transport.\n“It’s clear the Midlands Rail Hub will bring benefits to rail users across Bromsgrove and the Villages, and it therefore has my full support.\n“The Government claims its mission is to deliver economic growth – and to achieve this they will need to back projects like the Midlands Rail Hub.\n“I’ve therefore written to the Transport Secretary to urge her to support the Midlands Rail Hub’s strong business and to continue backing this project just like the previous Government did.”",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-vote-conservative/content_2.html": "Ahead of tomorrow's (May 1st) crucial local elections, Bradley said:\n\"Tomorrow (May 1st) you will be heading to the polls to vote in perhaps the most crucial set of local elections in years.\nWhy? Because the future of Worcestershire is at stake.\nWith the Labour government imposing council reorganisation on us, whoever leads Worcestershire County Council will decide the future of our County.\nThere are some political parties who want to split our County in two and tie Bromsgrove to bankrupt Birmingham City Council.\nThat will mean more Council Tax for less services.\nI don’t want that for you or your family.\nThe best option on the table is for a One Worcestershire unitary authority. One council providing all the services that local people rely on. Independent analysts have said this will save over £20 million in just year one, whereas two unitary authorities will save just over £4 million over 11 years.\nVote for One Worcestershire by voting for your local Conservative candidate.\nBut that’s not all that’s at stake tomorrow.\nThe Conservative-led County Council has ensured the 3rd lowest Council Tax in the country. It’s also delivered solid finances, a growing local economy and an on demand bus service in Bromsgrove and surrounding villages.\nLet’s keep moving forward and building on the progress that’s been made.\nYour local Conservative candidates, which you can view by clicking here, are focussed on local issues and have real plans to deliver results for you and your community.\nThe fact is either Conservatives or Labour will control Worcestershire County Council after tomorrow’s local elections.\nA vote for any party other than Conservative will let Starmer’s Labour in by the back door.\nLet’s not them do to Worcestershire what they’ve done to Birmingham.\nVote Conservative tomorrow.\"",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-continues-back-local-pubs/content_6.html": "Bradley recently met with the British Beer and Pub Association as he continues to back local pubs.\nFollowing his meeting, Bradley said:\n\"Pubs are at the heart of our communities and the backbone of our local economy.\n\"I recently met with the British Beer and Pub Association at The Queens Head in Stoke Pound to discuss how I can continue to support our pubs in Bromsgrove and the Villages.\n\"They've been hit hard recently, with the triple whammy of Government tax rises, wage increases and a reduction in business rates relief.\"",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_campaigns_improving-local-transport-and-road-safety/content_11.html": "We rely on good local transport every day.\nAs your MP, I will prioritise new investment to reduce congestion and to make local roads safer, particularly through villages.\nI will also campaign for improved access at rural stations and a wider roll out of Worcestershire on Demand, the responsive transport system that's reducing isolation.",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-meets-bromsgrove-and-redditch-rail-user-partnership/content_20.html": "Bradley recently met with members of the Bromsgrove and Redditch Rail User Partnership as part of his work to improve local transport.\nFollowing his meeting, Bradley said:\n\"I'm committed to improving local transport, and as part of that work I recently met with Bromsgrove and Redditch Rail User Partnership.\n\"We discussed the case for more services to stop at Bromsgrove Train Station and Barnt Green, as well as improving access at our stations.\n\"I will be following up these points when I meet soon with Network Rail.\"",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-bromsgrove-says-no-closer-links-birmingham/content_8.html": "Bradley said:\n\"As council reorganisation plays out in the coming months and years, I’ll be fighting to keep our county together as One Worcestershire, delivering excellent services, at excellent value.\n\"Worcestershire has a distinct identity, and it would be a travesty to see our historic county split in two.\"",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-fights-bus-passengers-facing-50-fare-hike/content_22.html": "Bradley has raised concerns about the impact the Government’s 50% fare hike could have on local bus services.\nUnder plans announced by the Government last year, the current bus fare pricing cap of £2 rose to £3 when it ended on December 31.\nAnd the increase is likely to be felt sharply by the most vulnerable in society and have a negative impact on both young and old passengers.\nBradley has warned the increase in prices could see a drop in passenger numbers and ultimately see a reduction in services.\nBradley said:\n“The Government might argue the fare increase is just a pound, but the cumulative effect in Bromsgrove and the Villages and across the country could be a disaster.\n“As local fares go up as a direct result of the Government’s policies, it is likely passenger numbers will go down and ultimately bus companies may be faced with stopping vital routes and ending essential services.\n“The impact of the increases will be felt right across the board from young people using buses to access education, to workers and older people who have the bus as their only source of transport to go to appointments, go shopping or visit family and friends.\n“The cost to people could work out to be hundreds of pounds a year to regular users, let alone the environmental impact of discouraging sustainable travel as people turn back to cars.\n“There is still time for the Transport Secretary to change this decision and I urge her to do so.”",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_category_Local-News/content_15.html": "Bradley Thomas on BREP: \"It’s critical this delivers both a tangible improvement in keeping Bromsgrove moving and in reducing the congestion and gridlock\" 2nd May 2025 Writing in this week's (May 2nd) Bromsgrove Standard, Bradley said: “Traffic congestion and delays blight our everyday lives and hampers our economy. I get your... Local News\nBradley Thomas: \"The use of cash must not been phased out\" 30th April 2025 In responding to the Treasury Select Committee's report on the acceptance of cash, Bradley said: \"It's disappointing the Treasury Select Committee has stopped... Local News\nBradley Thomas: \"Vote Conservative\" 30th April 2025 Ahead of tomorrow's (May 1st) crucial local elections, Bradley said: \"Tomorrow (May 1st) you will be heading to the polls to vote in perhaps the most crucial... Local News\nBradley Thomas continues to back local pubs 28th April 2025 Bradley recently met with the British Beer and Pub Association as he continues to back local pubs. Following his meeting, Bradley said: \"Pubs are at the heart... Local News\nBradley Thomas: Government support for the hair and beauty sector is not optional, it is essential 24th April 2025 Bradley has stood up for local hair and beauty salons in a Westminster Hall debate in Parliament. Bradley said: \"The hair and beauty sector is not merely about... Local News\nBradley Thomas visits Bromsgrove Youth and Community Hub 22nd April 2025 Bradley has praised the “inspiring” work of the team behind Bromsgrove’s newest youth-led organisation. The Hub Bromsgrove runs drop-in support for young people... Local News\n\"A victory for a common sense\" - Bradley Thomas responds to Supreme Court's biological sex definition ruling 16th April 2025 Following today’s (April 16th) ruling by the Supreme Court, Bradley said: “Today’s ruling by the Supreme Court is a victory for a common sense. It confirms what... Local News\nBradley Thomas visits National Grid's Upton Warren substation 15th April 2025 Bradley Thomas recently met with National Grid at their substation in Upton Warren. Bradley said: \"I recently met up with the National Grid team at their Upton... Local News\nBradley Thomas urges Government to continue backing the Midlands Rail Hub 14th April 2025 Bradley has urged the Government to continue backing the Midlands Rail Hub ahead of its Spending Review. In a letter to the Transport Secretary Heidi Alexander... Local News",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_privacy/content_7.html": "This document outlines how Bradley Thomas MP processes and manages personal data and:\n• Identifies the data controller.\n• Explains the lawful basis for processing personal data.\n• Outlines the personal data held and processed.\n• Outlines the scope of the special category personal data held and processed.\n• Outlines the process of Subject Access Requests.\n1. Data Controller\nThe Data Controller is Bradley Thomas MP\n2. Contact\nIf you have any questions about this policy or for more information about how we use your data or would like to exercise any of your rights contact Bradley Thomas MP.\n3. Lawful basis for processing\nAll processing is carried out by consent or either under the legitimate interest of Bradley Thomas MP, or public interest. These cover processing to conduct casework, campaigning and communication. Where processed under the lawful basis of a task carried out in the public interest, it is to support or promote democratic engagement. This includes fundraising activity in order to support democratic engagement.\n4. Data sources\nData held is that provided by you when you contact us and correspondence with third parties in response to cases taken up on your behalf. We may also hold data that you provide when we contact you – for instance, if we ask you to participate in a survey or petition. If you do not wish for us to contact you by telephone please do not provide this information. We perform a database lookup automatically upon any form submission to include electoral boundary data. The Register of Electors that councils provide to authorised persons under the Representation of the People Act is also used for electoral purposes.\n5. Data Security\nPersonal data is stored electronically and securely. We ensure that our service providers comply with the same high standard that we do, and we store our data on the Bluetree servers in the UK.\n6. Special category data\nSpecial category data will be processed under the lawful basis indicated in section 3, as is permitted in clauses 22, 23 and 24 of schedule 1 of the Data Protection Act, covering political parties and elected representatives.\n7. Transferring your data outside of the European Economic Area\nThe EU GDPR adequacy decision means that data can continue to flow between the UK and the European Economic Area (EEA). Some service providers are located outside of the EEA and therefore it may be necessary to transfer your personal data outside of the EEA. Where the transfer of your data outside of the EEA takes place we will make sure that it is protected in the same way as if the data was inside the EEA, and it only occurs with your consent.\nWe will use one of the following safeguards to ensure this:\n• Where the European Commission has issued an adequacy decision determining that a non-EEA country or organisation ensures an adequate level of data protection.\n• A contract is put in place with the recipient of the data obliging them to protect the data to the same standards as the EEA.\nLegally it is not permitted to transfer certain types of data, such as Electoral Register Data, outside of the EEA, and we honour that obligation.\n8. Data retention policy\nPersonal data will be held for no longer than necessary. Some types of data may be held for longer than others. Typically the maximum retention is two election cycles. Review of the data held will occur in each election cycle to determine whether it should be maintained or put beyond use. We also comply with the ICO's expectation guidelines relating to petitions.\n9. Subject Access Requests\nWe will request verification of the identity of any individual making a request, ask for further clarification and details if needed and respond within one calendar month once we have confirmed it is a legitimate request. In accordance with ICO guidelines, we keep a log of Subject Access Requests that contains details of the request, including that which can identify you personally, indefinitely.\nData subjects have the right to the following:\n• To be told whether any personal data is being processed\n• To be given a description of the personal data, the reasons it is being processed and whether it will be given to another organisations or people.\n• To be given a copy of the information comprising the data, and given details of the source of the data where this is available.\n10. Will we share your data with anyone else?\nIf you have contacted us about a personal or policy issue, your data may be passed on to a third-party in the course of dealing with your enquiry, such as local authorities, government agencies, public bodies, health trusts, regulators, and so on. Any third parties that we may share your data with are obliged to keep your details securely, and to use them only for the basis upon which they were originally intended.\nWe may need to share your data with a third party, such as the police, if required to do so by law.\nUnless otherwise specified, data may also be shared with entities of Political Party associations, federations, branches, groups and affiliates in order to assist you or maintain contact with you in support of democratic engagement.\nCasework and other submissions from the Contact form are sent directly to their destination. The nature of casework and other enquiries are not retained on the website, but this information is available for a limited period on the Bluetree servers in the UK for access only in the event of a police investigation. Your name and contact details submitted via the Contact form are only retained on the website if you grant consent to join the email subscriptions list. Anonymised data from the Contact form is retained for benchmarking purposes.\nYour personal data is only used as outlined here and within your reasonable expectations based on the nature of the communication, and recognising the need of politically related engagement in wider support of democratic engagement.\n11. Data Rights\nAt any point you have the following rights:\n• Right of access – you have the right to request a copy of the information held about you.\n• Right of rectification – you have a right to correct data held about you that is inaccurate or incomplete.\n• Right to be forgotten – in certain circumstances you can ask for the data held about you to be erased from our records.\n• Right to object – you have the right to object to certain types of processing, such as direct marketing.\n• Right to object to automated processing, including profiling – you also have the right to be subject to the legal effects of automated processing or profiling.\n• Right to judicial review: if our office refuses your request under rights of access, we will provide you with a reason why. You have the right to complain.\n12. Making a complaint\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom. The contact details for the ICO are:\n• Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AF\n• Telephone: 0303 123 1113\n• Website: https://ico.org.uk/concerns/\nIf you have any questions about the data held please contact Bradley Thomas MP via the contact information on this website.\nPlease note that proof of identity is required should you choose to exercise any of the above rights in relation to personal data.\nThis website itself is supported technically by Bluetree Website Services, who share a Privacy Policy with the Conservatives that can be found here: www.conservatives.com/privacy\nWe retain the right to update this policy at any time. If there are changes that significantly impact your rights, we will contact you in advance.\nFrom time to time, other website developers copy this Privacy Policy for use on their own websites. This Privacy Policy applies exclusively to the ways in which data is collected, hosted and used on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this Privacy Policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2302S",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_events_feed/content_17.html": null,
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_campaigns_increased-police-patrols-and-reducing-crime/content_9.html": "Bromsgrove and the surrounding villages are benefitting from an extra 330 new police officers across West Mercia since 2019.\nAs your MP, I will campaign for additional police patrols, particularly in rural areas; a crackdown on anti-social behaviour; and an increase in new opportunities for young people.",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_events_jobs-fair-2025/content_14.html": "Bradley's inaugural Jobs Fair will be taking place at Bromsgrove School Sports Centre on Friday, May 30th from 10am until 2pm.\nSponsored by Excool, the Jobs Fair will bring together local businesses, organisations and training providers to help residents explore new job opportunities. There will also be a free CV writing workshop.\nThe Jobs Fair is free to attend and is open to residents of all ages from teenagers about to leave school to anyone wanting to find a new job, change careers or learn new skills.\nThere is still space available for local businesses, organisations and training providers to have a stand at the Jobs Fair. To book your place please send an email to [email protected].\nBradley said:\n“I’m really looking forward to bringing together major local employers and training providers at my inaugural Jobs Fair.\n“Whether you’re about to enter the world of work, looking for a new job or wanting to change careers, the Jobs Fair is open to all. See you there!”",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_cookies/content_18.html": "Cookies are a technology we use to provide you with a tailored experience on this website, as well as on other online platforms on which we operate. A cookie is a piece of code that is sent to your web browser and is stored on your system. Cookies cannot be used to identify you personally, but are important to the smooth experience of this website on your device, in the following ways:-\n- Recognising your device so that your don't have to give the same information several times during one task\n- Measuring the number of people coming to the website for the purpose of ensuring that our servers have capacity to load web pages quickly at peak times\n- Benchmarking anonymised data to improve the design and functionality of the website including when we, from time to time, test and experiment with new technologies to improve your online experience\nWe only set essential cookies on this website, including for the performance and optimisation of the site. We do not place any non-essential cookies on the website (e.g for advertisers) and therefore there are no cookie management preferences, but nonetheless you can control what cookies are used, by editing the settings in your web browser.\nWe do not use cookies to collect information that can identify you personally.\nPlease see below a list of the main cookies this website currently uses. Any cookies that are currently being tested will not be documented in this list, until we decide to implement them permanently. All cookies will be visible to you through your web browser’s settings, or using third party tools depending on your web browser.\nHere is a list of the main cookies currently in use:\nCookies to manage your visit\ncookie-agreed\nWhen you close the cookies pop-up box, a cookie will be set on your machine to remember your preference. If you click 'OK': a session cookie will be set so that the pop-up doesn't display across any pages for the remainder of your visit. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\npopup\nRemembers when you've closed a pop-up so that it doesn't appear again during your session. The cookie persists for 30 days, meaning that unless you or your browser clear existing cookies, the pop-up won't display again the next time you visit the website if that visit is within 30 days.\nThird-party cookies\nWe do not have access to data collected by these third-party services and cannot prevent third-party services from setting these cookies. Where possible, we will notify you that third-party cookies may be set when using certain services. Below are details on third-party services more commonly used on Bluetree websites.\nFacebook cookies\nIf this website is displaying a Facebook feed, then Facebook may set cookies, which we block. There may also be a Facebook pixel installed on the website. For more details on what information Facebook collects, please visit their website.\nTwitter cookies\nIf this website is displaying a Twitter feed, then Twitter may set cookies. For more details on what information Twitter collects, please visit their website.\nYouTube cookies\nWe may embed videos from YouTube. YouTube uses cookies to help maintain the integrity of video statistics, prevent fraud and to improve their site experience. If you view a video, YouTube may set cookies. Please visit YouTube's page on embedding videos for more information.\nVimeo cookies\nWe may embed a Vimeo video, in which case Vimeo may set cookies on the website. For more details on what information Vimeo collects, please visit their website.\nFlickr cookies\nWe may embed Flickr photo gallery Flash players. When viewing a page with an embedded Flash player, Flickr may set cookies on your machine, and further cookies may be set when you click on the Flash player - both by Flickr and its parent company Yahoo. For more information, please visit Yahoo's cookies page.\nStripe cookies\nOn some websites, we install Stripe, which sets its own cookies that are essential pursuant to the prevention of fraud. For more details on what information Stripe collects, please visit their website.\nOther Google cookies\nThere maybe Google pixels and cookies on this website to track incoming traffic from links elsewhere on the Internet. These do not identify you personally. Please see Google's privacy policy for further information.\nOpting out/removing cookies\nWe regard all of the cookies that we set on this website as necessary to the smooth operation of the site and to ensure that we have sufficient resources to manage spikes in visitor numbers.\nYou can also control what cookies you accept through your browser. For details on how to do this, please visit https://aboutcookies.org.\nPlease note that by deleting our cookies or disabling future cookies you may not be able to access certain areas or features of this website.\nThis policy is reviewed on a regular basis. Please check back in the future for updates and changes.\nFrom time to time, other website developers copy this Cookies policy for use on their own websites. This policy applies exclusively to the ways in which cookies are set on genuine Bluetree websites and is not valid on other platforms, websites or servers. We have no control over website developers who copy this policy for their own purposes, which is a breach of copyright, but if you are reading this on a genuine Bluetree website, you will see 'Powered by Bluetree' at the bottom of the footer.\nVersion: 2403S",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news/content_5.html": "Bradley Thomas on BREP: \"It’s critical this delivers both a tangible improvement in keeping Bromsgrove moving and in reducing the congestion and gridlock\" Friday, 2 May, 2025 Writing in this week's (May 2nd) Bromsgrove Standard, Bradley said: “Traffic congestion and delays blight our everyday lives and hampers our economy. I get your frustrations, and even anger, with Bromsgrove’s traffic problems because I get stuck in the gridlock too. Whilst as an MP I have no direct powers over the County Council, they must investigate improved delivery of this scheme and how it... Local News\nBradley Thomas: \"The use of cash must not been phased out\" 30th April 2025 In responding to the Treasury Select Committee's report on the acceptance of cash, Bradley said: \"It's disappointing the Treasury Select Committee has stopped... Local News\nBradley Thomas: \"Vote Conservative\" 30th April 2025 Ahead of tomorrow's (May 1st) crucial local elections, Bradley said: \"Tomorrow (May 1st) you will be heading to the polls to vote in perhaps the most crucial... Local News\nBradley Thomas continues to back local pubs 28th April 2025 Bradley recently met with the British Beer and Pub Association as he continues to back local pubs. Following his meeting, Bradley said: \"Pubs are at the heart... Local News\nBradley Thomas: Government support for the hair and beauty sector is not optional, it is essential 24th April 2025 Bradley has stood up for local hair and beauty salons in a Westminster Hall debate in Parliament. Bradley said: \"The hair and beauty sector is not merely about... Local News\nBradley Thomas visits Bromsgrove Youth and Community Hub 22nd April 2025 Bradley has praised the “inspiring” work of the team behind Bromsgrove’s newest youth-led organisation. The Hub Bromsgrove runs drop-in support for young people... Local News\n\"A victory for a common sense\" - Bradley Thomas responds to Supreme Court's biological sex definition ruling 16th April 2025 Following today’s (April 16th) ruling by the Supreme Court, Bradley said: “Today’s ruling by the Supreme Court is a victory for a common sense. It confirms what... Local News\nBradley Thomas visits National Grid's Upton Warren substation 15th April 2025 Bradley Thomas recently met with National Grid at their substation in Upton Warren. Bradley said: \"I recently met up with the National Grid team at their Upton... Local News\nBradley Thomas urges Government to continue backing the Midlands Rail Hub 14th April 2025 Bradley has urged the Government to continue backing the Midlands Rail Hub ahead of its Spending Review. In a letter to the Transport Secretary Heidi Alexander... Local News\nBradley Thomas: \"Bromsgrove says NO to closer links with Birmingham!\" 11th April 2025 Bradley said: \"As council reorganisation plays out in the coming months and years, I’ll be fighting to keep our county together as One Worcestershire... Local News",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_campaigns_better-local-gp-and-hospital-access/content_19.html": "Access to GPs, dentists and hospitals is essential. As your MP, I will work to deliver out of hours GP appointments to support our young and elderly populations; increase mental health provision; and investment to train and retain medical professionals in Worcestershire.",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-meets-local-police-sergeant/content_10.html": "Bradley recently met with Sergeant Jamie Jenks to discuss local policing matters in Bromsgrove and the Villages.\nFollowing his meeting, Bradley said:\n\"As part of my work to ensure our streets and roads remain safe, I recently met with our local Police Sergeant Jamie Jenks.\n\"Thanks to the hard-work and dedication of our local officers, there was a 13% reduction in reported burglary offences in North Worcestershire in 2023/24.\n\"This reduction in reported burglary offences has continued in 2024/25, with a further 16% fall in burglary offences.\n\"There's always more to do, but I know our officers are working 24/7 to keep us all safe and I will continue to back them every step of the way.\"",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-holds-meeting-discuss-bordesley-speeding-concerns/content_25.html": "Bradley has held a meeting to discuss speeding concerns in Bordesley.\nIt follows concerns raised by residents about road safety along the busy A441 route through the village.\nBradley recently brought together local resident Karen Kilbride, Cllr Alan Bailes, Councillor for Alvechurch South, Cllr Marc Bayliss, Cabinet Member for Highways and Transport on Worcestershire County Council, and Jon Fraser from Worcestershire County Council’s Highways Team to discuss speeding on the A441 through Bordesley.\nBradley said:\n“Improving road safety in the constituency is one of my top priorities, so I was keen to bring together key stakeholders to discuss how we can tackle speeding on the A441 in Bordesley after I was contacted by residents about this issue.\n“I now hope residents are listened to and we see action taken to improve road safety along this route – and I’ll be doing everything I can to make sure this happens.”",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-urges-local-nhs-boss-increase-number-gp-appointments/content_23.html": "Bradley has written to the head of the local NHS to urge him to increase the number of GP appointments in Bromsgrove and the Villages.\nIn a letter to Simon Trickett, Chief Executive of NHS Herefordshire and Worcestershire, the local MP acknowledged the challenges some patients are having in accessing GP appointments.\nBradley has therefore urged the NHS to increase the number of GP appointments in his constituency. This forms part of his Plan for Bromsgrove and the Villages in which Bradley promised to campaign for better local GP access.\nBradley said:\n“Under the last Government, which delivered record funding for our NHS, progress was made to improve access to GP appointments, both face-to-face and virtually. However, I fully recognise that it remains challenging for many of my constituents to access GP appointments.\n“In light of this, I’ve written to the Chief Executive of NHS Herefordshire and Worcestershire to urge him to increase the number of appointments available in Bromsgrove and the Villages.\n“I’m determined to deliver on the promise I’ve made to my constituents to campaign for better local GP access and this step I’m taking is part of that work.”",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_news_bradley-thomas-brep-its-critical-delivers-both-tangible-improvement-keeping-bromsgrove-moving/content_13.html": "Writing in this week's (May 2nd) Bromsgrove Standard, Bradley said:\n“Traffic congestion and delays blight our everyday lives and hampers our economy.\nI get your frustrations, and even anger, with Bromsgrove’s traffic problems because I get stuck in the gridlock too.\nWhilst as an MP I have no direct powers over the County Council, they must investigate improved delivery of this scheme and how it can be achieved in a way that mitigates disruption to vehicles and pedestrians, whilst maintaining an emphasis on pedestrian safety.\nEver since I was first elected last July, I have been holding Worcestershire County Council to account over their A38 BREP scheme.\nThis project was agreed to before I was first elected, and I therefore was not able to provide input before spades were put in the ground.\nWhilst I welcome investment in our highways infrastructure, it’s critical that this delivers both a tangible improvement in keeping Bromsgrove moving, and in reducing the congestion and gridlock that blights the lives of residents and businesses.\nIt’s my job as your MP to hold the County Council to account and to ensure the project delivers the promises that were made.\nOne of the first meetings I held was between the Revise BREP Group and the County Council’s Cabinet Member with Responsibility for Highways and Transport.\nHowever, like you, in recent weeks and months I have grown increasingly frustrated at the disruption this work is causing.\nI’ve therefore written to the County Council with six key points that I want answers to.\n- The apparent lack of progress of the works in recent months.\n- The seemingly little planned increase in vehicle flow and a reduction of congestion once the works are completed.\n- A lack of suitable visual plans of the final outcome available on the project website to allay the concerns in point two.\n- Equipment sitting dormant through a full working day.\n- Concerns around pedestrian safety whilst works are taking place, including the lack of crossing points across the A38 whilst works are taking place.\n- Concerns around the prolonged road closure of Stoke Road, and whether this can be a staged closure to better manage traffic flow/access.\nI’m pragmatic and I want to find workable solutions to the problems we face. I’m not about making empty promises that can’t be kept.\nHowever, if this project doesn’t lead to tangible improvements in keeping Bromsgrove moving and in reducing the congestion after all the money that has been spent and after all the frustration it has caused, then we will all be asking the same question: what was the point?\nI’ll be sharing the response I receive from the County Council on my social media channels and on my website, so please do look out for that.”",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_map-locations/content_4.html": "Skip to main content\nBradley Thomas MP\nDelivering for Bromsgrove and the Villages\nMain navigation\nHome\nAbout Bradley\nNews\nCampaigns\nMy Plan\nContact\nEvents\nBradley Thomas MP\nDelivering for Bromsgrove and the Villages\nMy Map",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk_events/content_3.html": "Jobs Fair 2025 30th May 2025 10am - 2pm Bradley's inaugural Jobs Fair will be taking place at Bromsgrove School Sports Centre on Friday, May 30th from 10am until 2pm. Sponsored by Excool, the Jobs...",
  "https_www_bradleythomas_org_uk_/https_www_bradleythomas_org_uk/content_1.html": "Contact Bradley\nIs Bradley your MP?\nEnter your postcode\nI'm proud to be the Member of Parliament for Bromsgrove and the Villages. I'm determined to deliver results for our wonderful constituency. I'm here to help, so please don't hesitate to get in touch.\nBradley will be holding his inaugural Jobs Fair at Bromsgrove School Sports Centre on Friday, May 30th from 10am until 2pm.\nSponsored by Excool, the Jobs Fair will bring together local businesses, organisations and training providers to help residents explore new job opportunities. There will also be a free CV writing workshop."
}