{
  "https_www_dicconspain_org_/https_www_dicconspain_org/content_1.html": "I’m your Labour candidate for Ashford Central in the Kent County Council election on 1st May. As a borough councillor since 2019, I’ve delivered real results: getting the road outside New Hayesbank surgery fixed by formally challenging KCC, helping to save evening and weekend buses by writing to Stagecoach, creating safer community paths, securing funding for play areas, and proposing and helping deliver our revitalised town centre market. I’m driving the campaign to bring international rail back to Ashford and working to revitalise our town centre.\nI'm Kent born and bred. My parents, an engineer and a teacher, taught me to aspire to make things better and solve problems for myself and others. They also taught me to never give up, no matter the odds. When I was growing up, I was diagnosed with dyslexia, but this didn't hold me back it only made me more determined.\nI'm a problem-solver by nature. As an IT consultant and senior project manager, I've worked in high-pressure and high-stakes environments, finding solutions through collaboration, creativity, and diplomacy. I know that the challenges we face can be overcome if we work together.\nPlease join my supporters.\nLet’s Get Ashford Back On Track with better roads and buses, more jobs, vibrant community spaces, and proper support for every child.\nDemand Ashford’s fair share of the £50m pothole fund. Fight for better buses, affordable fares, extended pensioner bus pass times, and free passes for secondary students.\nContinue to drive our campaign to bring international rail back to Ashford. Champion a new mid-sized town centre multi-purpose venue, and build on our successful market expansion. All these will help deliver secure jobs.\nSecure funding for better facilities and green spaces across Ashford Central. Deliver safer walking routes, and advance a key community hub development we’ve been working towards.\nI’ll fight to ensure all children and young people get the proper support in and out of school they need to succeed. As someone who has dyslexia, and received support as a child, I understand how important this is.",
  "https_www_dicconspain_org_/https_www_dicconspain_org_privacy-policy/content_2.html": "We care about your privacy and keep your personal data safe. This policy tells you how we do this when you use our website, no matter where you are. It also tells you about your privacy rights and how the law helps to protect you.\n- WHO WE ARE AND HOW TO CONTACT US\nDiccon Spain (also know as Diccon Spain For Ashford Central, and before that Diccon Spain For Ashford Campaign) is the controller and responsible for your personal data (referred to as “we“, “us” or “our” in this privacy policy).\nIf you want to ask us anything about this policy or how we use your data, or if you are unhappy with how we do this, please email us at diccon@dicconspain.org\n- PURPOSE OF THIS PRIVACY POLICY\nThis policy tells you how we use your personal data when you:\n- use this website - for example, when you sign up as a supporter of Diccon Spain (previously Diccon Spain For Ashford Campaign) or fill in a survey\n- give us your data in other ways.\nWe use your data to keep you updated on the Campaign and how you can help us.\nWe may also share your data with other groups that support the Campaign and have the same goals and values as us. We only do this when we have a good reason and the law allows us to.\nThis website is not intended for children and we do not knowingly collect data from children.\nPlease read this policy carefully, along with any other notices and policies we may give you when we ask for your data. We want you to know how and why we use your data. This policy adds to other policies and does not replace them.\n- THE DATA WE COLLECT ABOUT YOU\nPersonal data is any information that can tell who you are. It does not include data that has no link to your identity (anonymous data). We may collect, use, store and share different types of personal data about you, such as:\n- your name, username, marital status, title, date of birth and gender\n- your address, email and phone number\n- your bank account and card details\n- your payments and purchases from us\n- your IP address, login data, browser, time zone, location, and device\n- your username, interests, preferences, feedback and survey answers\n- how you use our website\n- how you want to receive content and marketing from us\nWe also collect, use and share data that is not personal, such as numbers or facts, for any reason. This data may come from your personal data, but it does not show who you are. For example, we may use your usage data to find out how many users visit a certain part of our website. But if we mix this data with your personal data and it can show who you are, we treat it as personal data and use it according to this policy.\n- HOW WE COLLECT YOUR PERSONAL DATA\nHow we collect your data We get your data from you when you:\n- fill in forms or write to us by post, phone, email or other ways\n- sign up as a supporter of a Campaign\n- subscribe to our mailing lists\n- give us feedback or contact us by forms, email, phone or other ways\n- HOW WE USE YOUR PERSONAL DATA\nHow we use your data We only use your personal data when the law lets us. We use your personal data to (The uses):\n- sign you up as a supporter of Diccon Spain (previously Diccon Spain For Ashford Campaign);\n- tell you about the Campaign and how you can get involved;\n- tell you about other groups that support the Campaign and have the same goals and values as us;\n- handle your donations, payments, fees and charges;\n- follow the law; and reply to your questions and complaints.\nWhy we use your data.\nWe use your data because (The legal basis):\n- you have agreed to it (for example, when you subscribe to our information);\n- you have a contract with us that needs it (for example, when you pay or donate to us);\n- we have a good reason and the law allows us to; or\n- the law tells us to (for example, when we have to report your donations).\n- WHEN WE WILL SHARE YOUR DATA\nWe will not sell or share your personal data with anyone else, unless you know and agree to it (for example, when you sign a petition). We may share your data to:\n- Move it to another place (if needed);\n- Follow the law;\n- Work with suppliers who help us with money matters, such as The Labour Party, Stripe, Paypal and others.\n- WHEN YOUR DATA MAY BE USED FOR MARKETING\nOur Marketing\nWe will send you messages about the Campaign and the people involved if you have asked us for information or signed up for our marketing.\nRight to object/Opting-out\nYou can tell us to stop sending you marketing messages at any time by emailing us at diccon@dicconspain.org\nYou can also say no to your data being used for direct marketing.\nIf we process your data on the basis of “legitimate interests” or “a task carried out in the public interest”, then you have the right to object to us using your data in that way. This right is not absolute and we may continue to process your data if we can demonstrate compelling legitimate grounds.\nIf you say no to marketing messages, this will not affect other data we have from you as a result of other engagements or transactions with us (for example, if you say no to our messages, we will still use your data to process your donations).\n- COOKIES\nCookies are small files of information that websites send to your computer, tablet, or mobile device. We use cookies to make your experience on our website better. For example, cookies can remember your preferences, such as your language or location. You can choose which cookies you want to accept or reject by changing your browser settings. You can also ask your browser to tell you when a website uses cookies. If you say no to cookies, some parts of our website may not work properly.\n- CHANGE OF PURPOSE\nWe will only use your personal data for the reasons we told you when we collected it, unless we have a good reason to use it for something else and it is related to the original reasons (as we explained in this privacy policy). If you want to know how the new use is related to the original use, please email us. If we need to use your personal data for something else that is not related, we will tell you and we will tell you why we can do that.\n- CHANGES TO THE PRIVACY POLICY\nWe check our privacy policy regularly and will tell you if we make any big changes. You can see the latest version of our privacy policy on this website.\n- THIRD-PARTY LINKS\nThis website may have links to other websites, platforms, plug-ins and apps. If you click on those links or use those connections, other people may get or share your data. We do not control those websites or platforms and we are not responsible for how they use your data. When you go to another website, we suggest you read their privacy policy carefully.\n- INTERNATIONAL TRANSFERS\nWe may need to move your personal data to countries outside the EEA to use it for the reasons we told you in this privacy policy. We always make sure that our suppliers protect your data rights when they move your data. We expect all our suppliers to follow a contract approved by the EU or to make sure information security and other appropriate safeguards are in place to protect your data and they use approved model contract clauses to cover the transfer or they have Binding Corporate Rules in place.\n- DATA SECURITY\nWe use security measures to keep your personal data safe from loss, misuse, or unauthorised changes or sharing. We only let our staff, agents, contractors and other partners see your personal data if they need to for their work. They must follow our rules and keep your data confidential. We will tell you and the appropriate regulator if there is a data breach.\n- HOW LONG WE WILL HOLD YOUR PERSONAL DATA FOR\nWe only keep your personal data for as long as we need it for the reasons we collected it, or for any legal reasons. We may keep your personal data for longer if someone complains or if we think there may be a legal problem. We decide how long to keep your personal data by looking at:\n- how much, what kind and how sensitive your personal data is;\n- how likely it is that someone may misuse or share your personal data without permission;\n- why we use your personal data and if we can do that in other ways;\n- what the law, tax, accounting or other rules say.\n- YOUR LEGAL RIGHTS\nYou have some rights over your personal data that we hold. We have explained these rights below and how you can use them.\nRight of access\nYou can ask us for a copy of your personal data that we have at any time. This is called a subject access request or SAR. You may have heard of this right before. We follow the ICO’s guide when we deal with your requests for your personal data. You can read this guide by visiting this link https://ico.org.uk/for-the-public/your-right-to-get-copies-of-your-data/preparing-and-submitting-your-subject-access-request/. Please note that this right lets you get a copy of your personal data from us so you can check if it is correct and if we are using it lawfully. It is not a right that lets you ask for other people’s data, or for documents that do not have your data in them. You can use this right at any time by emailing us at diccon@dicconspain.org and telling us that you want a copy of your data. You do not need to use a special form to do this.\nYour right to change or delete your data\nYou can ask us to change your personal data that we have if you think it is wrong or not up to date. You can also ask us to delete your personal data if you think we do not need it anymore (this is also called the “right to be forgotten”). Please note that we may ask you to prove that the new data you give us is correct and we may check it ourselves. Also, we do not have to delete your personal data if we have a good reason to keep it; if this happens, we will tell you why when we reply to your request. You can use this right at any time by emailing us at diccon@dicconspain.org and telling us that you want to change or delete your data and why. If you want us to change your data, you should tell us what the new data is. You do not need to use a special form to do this.\nYour right to limit how we use your data\nWe may use your personal data for a good reason or for the public good (see this privacy policy for how and why we do this). You can ask us to stop using your data in this way if you think it affects your rights and freedoms or if you think our reason is not valid. You can also ask us to stop using your personal data if: (a) you think it is wrong and want us to check it; (b) we are using it unlawfully but you do not want us to delete it; or (c) we do not need it anymore but you want us to keep it for legal reasons. Please note that we may keep using your data if we have a good legal reason to do so. We will tell you why when we reply to your request or after we look into it. You can use this right at any time by emailing us at diccon@dicconspain.org and telling us that you want us to stop using some of your data and why. You do not need to use a special form to do this.\nYour right to move your data\nYou can ask us to give you some of your personal data that we have and that we use by computers. You can ask us to give it to you in a format that is easy to read and use by other computers. We do not think this right will be used by most of the people we work with, because of the kind of work we do and the systems we use. But if you want to move your data from us to someone else, we will try to help you if we can.\nYour right to say no to marketing\nAs we said before, we may send you emails or other messages about the Campaign and the people involved. You can tell us to stop at any time. You can do this by clicking on the ‘unsubscribe’ link at the bottom of each message (or by doing something similar). Or, if you cannot use those links, or if you want to talk to us directly – you can email us at diccon@dicconspain.org and tell us which messages you do not want to get anymore.\nYour right to know about automated decisions and profiling\nYou have the right to know if we use your personal data to make decisions or profiles by computers without people being involved. If we do this, we will tell you how it works and what it means for you. Using your rights When you write to us to use your rights, we may ask you to prove who you are. We may ask you to send us copies of ID documents to check your identity. This is to make sure that we do not give your data to someone else by mistake. We may also contact you to ask you more questions about your request to help us answer faster. It will help us if you tell us clearly which right you want to use and why. The more details you give us, the better we can help you. If you do not give us enough information, we may have to wait until you do before we can do anything. We will tell you if this happens. You usually do not have to pay anything to use your rights. But we may charge you a reasonable fee if your request is not fair, repeated or too much. Or we may say no to your request in these cases. We try to reply to all requests within one (1) month. But it may take us longer than a month if your request is very complicated or if you have made many requests. If this happens, we will tell you and keep you updated.\n- RIGHT TO LODGE A COMPLAINT\nIf you are unhappy with the way that we have processed or handled your data then you have a right to complain to the Information Commissioner’s Office (ICO). The ICO is the supervisory body authorised by the Data Protection Act 2018 to regulate the handling of personal data within the United Kingdom.The contact details for the ICO are:Information Commissioner’s Office, Wycliffe House, Water Lane, Wilmslow, SK9 5AFTelephone: 0303 123 1113 Website:https://ico.org.uk/concerns/"
}