{
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_council-meets-with-ea-to-discuss-bassetlaw-flood-plight/content_32.html": "Council meets with EA to discuss Bassetlaw flood plight\n- jamesnaish\n- Jan 10, 2024\n- 3 min read\nUpdated: Jan 27, 2024\nBassetlaw District Council and the Environment Agency have met this week to discuss the devastating floods that hit Bassetlaw in October and the need for the funding of future flood mitigation schemes to change.\nData provided by the Environment Agency showed that Storm Babet was the wettest three-day period on record in the Midlands which also led to record river levels across Nottinghamshire, Derbyshire, Lincolnshire and Leicestershire.\nBassetlaw District Council and its Leader, Cllr James Naish, had previously called on the Environment Agency to meet with members and officers to discuss scrapped flood alleviation schemes, funding challenges and the mitigation measures that need to be put in place to limit future flooding across the district.\nThis week, senior regional and national officials from the Environment Agency visited some of the most flood-hit areas of Worksop and Retford to see first-hand the impact of localised flooding. This was followed-up by a meeting between the Council and the Environment Agency’s Chief Executive to discuss removing blockers to meaningful investment.\nCllr James Naish said: “We had two productive meetings where we were able to discuss our experiences of historic flooding and visit the areas of Bassetlaw that are frequently flooded. Bassetlaw residents and businesses need to see urgent action and it was good to hear that Environment Agency colleagues, who have done a great job operationally, still want to see alleviation schemes come forwards. They still believe there are schemes that can make a difference.”\nA total of £11.7m of potential schemes across Bassetlaw were put forward in 2021/22, to be delivered over a five-year period, and this was increased to £27m in 2022/23. However, HM Treasury rules mean that this money is not available until full business cases have been submitted, which take into account land and property values versus the cost of providing the scheme. In Bassetlaw’s case, due to comparatively low land and property values, the value for money threshold is typically missed – despite frequent flooding and considerable damage being caused to personal and business property.\nIn June 2021, Bassetlaw was set to receive initial funding for the Retford Beck Flood Mitigation Scheme which has subsequently been withdrawn despite £250,000 being allocated by Bassetlaw District Council and £170,000 being allocated by Nottinghamshire County Council. Land was also purchased by the District Council in anticipation of approval.\nCllr Naish added: “It is clear the funding formulas and approaches need to change to make large investment schemes viable in Bassetlaw. Bassetlaw houses, businesses and land are worth saving just as much as anywhere else, especially given the frequency with which lives are being disrupted.\n“The Environment Agency is ultimately responsible for flood protection schemes on main watercourses like the River Ryton and the River Idle, but the broken funding system means its interventions are currently limited to routine maintenance. We want that to change, and I know Environment Agency staff want to see the same.\n“We are increasing our efforts to explain to politicians how the system needs to change to help places like Bassetlaw, and will be working with other councils who are in a similar position to push this up the political agenda. We will also continue to work with Nottinghamshire County Council as the Lead Flood Authority and the Environment Agency to identify short-term measures that can be taken to reduce the known risks and prepare communities as best we can in the event of future flooding.\n“I am immensely grateful for the operational response involving the Environment Agency, Councils, Councillors, residents and businesses who have all done a great job, but it is unsustainable, dangerous and unfair for this to remain the only meaningful line of defence for our area.”",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_exciting-improvements-underway-at-langold-country-park/content_30.html": "Exciting improvements underway at Langold Country Park\n- jamesnaish\n- Mar 21, 2024\n- 2 min read\nWork is underway to make Langold Country Park more user friendly and accessible thanks to over £170k of funding secured and provided by Bassetlaw District Council.\nGroundworks for a new Changing Places facility and separate café pod to modernise amenities have started as part of the latest investment in the popular park. £140k has come from the Council with additional funding coming from the Department for Levelling Up, Housing & Communities' Changing Places Fund.\nCllr Darrell Pulk, Cabinet Member for Environment and Energy, said: “These two pods are an exciting addition to Langold Country Park and will open the site to more residents and visitors and improve their experience even more. This shows the Council’s continuing investment in our parks and open spaces making sure they are accessible for all to enjoy.”\nThe addition of a Changing Places toilet to the park - featuring specialist equipment such as hoists, changing benches, adapted toilet and extra space for parents and carers - will support a person who cannot use standard accessible toilets.\nCllr Gillian Freeman, Vice Chair and Ward Member for Langold, said: “I am looking forward to the arrival of these new pods and the difference they will make to people visiting this much-loved park.” James Naish, Leader of Bassetlaw District Council, added: \"We are very proud of the parks which the Council maintains. They are an important place for Bassetlaw people to exercise, socialise and relax so it's great to see further investment taking place.\"\nThe pods, which are being built off site, are expected to be lifted into place in April, replacing old structures which were deemed no longer fit for purpose. It’s hoped the Changing Places pod and café pod will be up and running at the beginning of May in time for the opening of the Splash Park.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_rural-communities-get-more-than-500k-funding/content_20.html": "Rural communities get more than £500k funding\n- jamesnaish\n- Jan 26, 2024\n- 1 min read\nUpdated: Jan 27, 2024\nMore than half a million pounds of funding is on its way to support rural community groups and businesses in Bassetlaw after they bid for funding to help improve facilities for residents and support enterprise.\nBassetlaw District Council is administering the authority’s allocation of the Government’s Rural England Prosperity Fund, worth almost £714,000, over the next two financial years.\nThe funding is a rural top-up to the United Kingdom Shared Prosperity Fund (UKSPF) and is being distributed to a total of 18 community groups and businesses. 10 community groups in the district are sharing £267,259 for projects such as a wildlife discovery area, a new conference room, and solar panels. In addition, £307,635 is supporting eight businesses with new equipment, heat pump installation and building refits.\nTuxford Town Council, one of the successful recipients, will be creating a new outdoor exercise gym, youth shelter and BMX track at the Gilbert Avenue playing fields with its grant of £49,271.\nCllr Julie Leigh, Cabinet Member for Identity and Place said: \"Rural England Prosperity Fund grants are great news for our communities and businesses in rural areas of Bassetlaw. It provides welcome funding to support them in their efforts to improve facilities for our residents and to help businesses with their growth ambitions.\"\nCllr James Naish, Leader of Bassetlaw District Council, said: \"I'm delighted to see money going to our rural communities. Funding is often skewed towards larger settlements but our rural communities remain a choice destination to visit and work for many. I look forward to seeing how the funds are spent over the coming months.\"",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_first-steps-in-multi-billion-pound-step-project-with-planning-permission-granted-for-ukaea-base-in-n/content_6.html": "First steps in multi-billion-pound STEP project\n- jamesnaish\n- Jan 16, 2024\n- 2 min read\nUpdated: Jan 27, 2024\nA significant milestone preparing for a UK first in energy production, which will create thousands of jobs and attract investment in North Nottinghamshire, has been reached.\nThe multi-billion-pound project at West Burton will transform the power station site to support the development of STEP (Spherical Tokamak for Energy Production), the UK’s prototype fusion energy plant which aims to produce ongoing electricity from fusion.\nBassetlaw District Council has approved plans for the first temporary building to be constructed on site – helping to contribute to employment opportunities, to regeneration and to assisting the start of the ambitious project being led by the UK Atomic Energy Authority (UKAEA).\nCllr James Naish, Leader of Bassetlaw District Council said: “Delivering a prototype fusion energy plant at West Burton will bring massive investment to the area and is a game-changer for our local economy. The first planning permission for new construction on the STEP site is a significant milestone for the Council. I look forward to more applications coming forward as the project develops at West Burton over the next two decades.”\nThe temporary building will house project staff as they work on the plans to deliver a prototype fusion energy power station that demonstrates how to produce sustained low carbon energy from fusion. Fusion energy has the potential to deliver a safe and virtually limitless source of clean electricity, based on the same processes that power the sun.\nJames Cowan, Director of Programme Development for STEP as part of UKAEA Group, said: “It’s going to be our first UKAEA base in North Nottinghamshire, and a location from which we can fulfil our vision of delivering a prototype fusion plant that moves us towards commercial viability. We are pleased to be working with Bassetlaw District Council on this programme of national significance. I hope this will be the first of many planning approvals in the future, helping us to collectively deliver social and economic benefits to the area.”",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_delight-at-national-recognition-for-independent-living-schemes/content_21.html": "Delight at national recognition for independent living schemes\n- jamesnaish\n- Apr 19, 2024\n- 1 min read\nBassetlaw District Council is celebrating national recognition for its work modernising independent living schemes and improving the overall experience for residents.\nThe Council has been crowned the winner of the ‘Neighbourhood Transformation’ category at the AICO Community Awards, held last night in Birmingham.\nThe Council, in partnership with main contractors Fortems and Make Consultants, have transformed Larwood House in Worksop, alongside improvement works at Westmorland House in Harworth and Bircotes, with plans for more.\nCraig Taylor, Director of Regeneration and Neighbourhoods at Bassetlaw District Council said: “I am delighted our ambition to transform and invest in our independent living centres has been recognised nationally. The work, when completed, will have delivered around £16million worth of investment into the Council’s independent living scheme portfolio.\n“As well as providing quality independent living for an aging population, we are addressing health and wellbeing inequalities, cutting running costs and reducing carbon emissions by installing energy efficient heating systems and insulation.”\nBassetlaw’s independent living centres are a collection of self-contained apartments and flats that specifically cater for older residents who wish to live in a community setting. Major improvement works at Westmorland House in Harworth are due to be completed in the summer, with plans in place for further schemes over the next two years in the district at Conway Gardens in Retford and Swallow Court in Misterton.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_bassetlaw-district-council-goes-electric/content_15.html": "Bassetlaw District Council goes electric\n- jamesnaish\n- Sep 26, 2023\n- 2 min read\nBassetlaw District Council is taking its commitment to be one of the cleanest and greenest districts in the country further by introducing a fleet of new electric vehicles.\nThe Council has recently replaced six diesel vehicles in their fleet with new electric vehicles which will help to strengthen the Council’s green credentials and is a significant step towards the goal of being net zero by 2030.\nThe new Renault Kangoo E-Tech vans are charged at the Carlton Forest depot, which last year saw the building equipped with a solar PV system equivalent to 146 solar panels and an electric vehicle charge station.\nCllr Darrel Pulk, Cabinet member for Environment and Energy, said: “The purchase of these new vans bears testament to Bassetlaw's commitment to helping to protect the environment by reducing our carbon footprint. I am delighted we have been able to replace some of our fleet with these six new vehicles and have received positive feedback from staff who are thrilled to use these new vans.\n“As part of our Vision 2040, we are aiming to be the cleanest, greenest district in the country and the purchase of these vehicles alongside our other carbon-reducing efforts will help us to achieve this goal.”\nWith a range of 186 miles on a full charge, the vans are used by lots of different teams across the Council including Environmental Health, Parks and Open Spaces, Facilities and the Anti-Social Behaviour Team.\nFollowing the successful launch of two electric street sweepers last year, the Council plans to replace its entire diesel fleet with electric vehicles over the coming of years. This includes refuse vehicles as it makes an ambitious move towards reaching its Net Zero target.\nCllr James Naish, Leader of Bassetlaw District Council, said: “As well as introducing electric fleet vehicles, the Council has also made its offices at Queens Buildings more carbon neutral by installing a new air source heating system, installed new solar panels at its Carlton Forest Depot, and completed a significant carbon reduction project at Kilton Forest Golf Course. We understand the role that we need to play in leading the decarbonisation agenda locally and I'm pleased to see more progress being made on this complex but important journey.”",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_blog_categories_james4rushcliffe/content_27.html": "top of page\nJOIN THE CAMPAIGN\nHome\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nHome\nbottom of page",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_demand-for-more-school-places-being-met-in-worksop/content_12.html": "Demand for more school places being met in Worksop\n- jamesnaish\n- Feb 14, 2024\n- 2 min read\nBassetlaw District Council has secured £3 million of developer funding to help meet growing demand for school places in Worksop.\nThe funding will contribute to the total cost of building of a new primary school in Gateford – Whipman Woods Flying High Academy – which has been generated through Community Infrastructure Levy and Section 106 contributions. This is being collected by Bassetlaw District Council as part of the planning process and will be transferred to Nottinghamshire County Council at intervals as the development progresses.\nWork is already underway on the £11.47 million school, which is expected to open in September 2024. Built over two phases, it will create a total of 315 places, with an initial 210 school and 26 nursery places created to help meet the demand created by new homes in the area.\nCllr Julie Leigh, Cabinet Member for Identity and Place at Bassetlaw District Council, said: “This investment in Worksop will help to meet the growing demand on school places from families moving into new homes being built in the area.\n“This allocation of funding shows that essential services and infrastructure, that benefit new and existing communities, are provided for and delivered through the planning process.\n“It is vital we make sure everyone has easy access to the services they need, including high-quality education facilities, and this developer contribution will help to achieve this.”\nSection 106 contributions and the Community Infrastructure Levy is money developers must pay towards improving infrastructure in the local area and forms part of their planning consent. It means any additional demands the development puts on services such as schools or roads, can be met.\nPlanning permission for up to 750 new homes, a one-form entry primary school, a community hall and two junior playing pitches was first approved by the District Council in 2015. As part of the conditions of building the new homes at Gateford Park, developers have made the £3million contribution towards the primary school which is being built on Gatekeeper Way.\nWhen completed, the single-story building will have eight classrooms, a kitchen and a school hall. Outside spaces include plans for a multi-use games area, playing field and trim trail.\nEnergy efficiency measures such as solar panels on the roof, air source heat pumps, sensor-controlled LED lighting as well as three electric vehicle charging points are all being built in.\nThe project is being led by Nottinghamshire County Council, with its partner Arc Partnership, a joint venture between the council and SCAPE, which has designed and will manage the construction through its delivery partner, Morgan Sindall Construction.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com/content_2.html": "top of page\nI am in the process of updating my website and this work is underway. You can stay in touch with my activities in the meantime on Facebook: https://www.facebook.com/JamesNaish4Rushcliffe\nTo get in touch, please email james.naish.mp@parliament.uk or call 07967 807 037. You can also write to us in Westminster or at our local office: James Naish MP, Bridgford Business Hub, 4 Albert Road, West Bridgford, Nottingham, NG2 5GQ.\nThank you for your patience in the meantime.\nbottom of page",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_the-plan/content_24.html": "Under a Labour government, I want Rushcliffe to be a collection of thriving, prosperous and sustainable settlements which are at the heart of powering the next generation, net zero economy. Every Rushcliffe resident should have fair and equal opportunities to access public services and increase their life chances.\nMy vision focuses on five key pillars which, beneath them, have a range of practical policies and achievable outcomes.\nMy plan for investment and growth is focused on two key areas: supporting workers' rights, our high streets and small and micro businesses so they can flourish; and making the most of the significant green energy opportunities afforded by Rushcliffe’s geographical location and natural assets.\nTo achieve this, we need our critical infrastructure to be improved, including by reducing flooding risks and growing our bus network again. And for our communities to be sustainable and prosperous, we need to see our public services strengthened via better access to school places and healthcare; and to empower Rushcliffe residents to have a proper say over housing, infrastructure and rental standards.\nThere is a lot to do but I am confident that by focusing efforts on these five pillars, I will be able to help the whole of Rushcliffe thrive.\nMy vision and plan for Rushcliffe\n1. Boost Rushcliffe's investment and productivity\nProtect workers' rights through banning zero-hour contracts, ending endemic low pay, improving worker safety and ending qualifying periods under Labour's New Deal for Working People\n1.\nImplement Labour's nine-point plan to support Rushcliffe businesses, pubs and high streets. This includes cutting and eventually scrapping business rates\n2.\nSupport the development of localised supply chains for major industries and investments, creating local jobs for Rushcliffe people. \"Buy, make and sell more\" in Britain as a whole\n3.\nWork closely with Rushcliffe Borough Council to secure more money directly for Rushcliffe, given it has only received £3.1m of Levelling Up investment in total across 8 national schemes\n4.\nEnd competitive bidding processes which mean some Nottinghamshire areas like Ashfield \"win\" funding (£92m+) while others - like Rushcliffe - \"lose\" (£3.1m)\n5.\nWork with newly-accredited Visit Nottinghamshire to promote the best that Rushcliffe has to offer to visitors and residents, especially its wide range of independent businesses and public houses\n6.\nMaximise the returns from Rushcliffe's sporting footprint by working in partnership with Notts County Cricket, Nottingham Forest, the National Water Sports Centre and others to evolve their community offer\n7.\nMake Brexit work by cutting the red tape hampering small businesses and industries across Rushcliffe, especially for its farming community. 6,300 agricultural firms have gone out of business since 2017\n8.\n2. Bring green energy, jobs and skills to Rushcliffe\nBuild on Rushcliffe's history of powering the UK to become a home for green alternatives such as hydrogen and geothermal energy. Work with the site owners of Ratcliffe-on-Soar power station to create a leading green energy employment site\n1.\nCreate more high-quality apprenticeships across Rushcliffe and Nottinghamshire by transforming the Apprenticeship Levy scheme to make it more flexible\n2.\nPromote access to fair and appropriate re-training through Technical Excellence Colleges\n3.\nStrengthen the partnership with Nottingham College and the city's two universities to ensure good technical skills pathways. Promote strong education and business links in new industries\n4.\nBring wider green technology investment into Rushcliffe through Labour's National Wealth Fund, including money for green hydrogen manufacturing (£500m in the East Midlands over the next parliament)\n5.\nAttract an electric vehicle battery plant to Nottingham / Rushcliffe through Labour’s £1.5bn Battery Power fund\n6.\nSupport the switch-on of Great British Energy, a new publicly-owned clean power generation company to cut energy bills and deliver good jobs - making families up to £1,400 better off a year\n7.\nLobby for a policy which requires all parts of the UK to allocate land (0.5%) and set targets for green energy generation to enable a fair, just and sustainable transition which doesn't overwhelm areas with existing National Grid connections\n8.\n3. Improve Rushcliffe's infrastructure and transport\nWork with partners to secure investment for key roads in Rushcliffe via the £1.5bn local transport fund which will be under the control of the new East Midlands CCA Mayor\n1.\nWork with the new mayor and Notts County Council to create sustainable public transport services, especially in rural Rushcliffe. Seek to reverse cuts (such as the axing of CT4N’s number 22 and 23 services) through the £2.2bn Network North fund to transform local transport\n2.\nSet-up a Rushcliffe version of Labour's Flood Resilience Taskforce to coordinate flooding preparation and resilience between central government, local authorities, community groups and emergency services\n3.\nLobby to reform the funding and processes of the Environment Agency to ensure appropriate capital schemes can be initiated to protect Rushcliffe residents and businesses from flooding. Just 120 extra properties in the East Midlands were better protected in 2023\n4.\nStop sewage polluting our rivers and seas by - among other things - putting water companies under special measures, strengthening the regulator (Ofwat) and taking repeated offenders to court\n5.\nBring the UK’s railways back into public ownership when contracts expire\n6.\nEncourage active travel policy adoption (walking, cycling, exercise initiatives) wherever possible to promote positive physical and mental health across Rushcliffe\n7.\nEnsure that where any new housing is built, public services and local infrastructure - such as school and nursery places, new health centres and GP appointments - are boosted and prioritised\n8.\n4. Save Rushcliffe's public services\nRestore neighbourhood policing and town centre patrols in Rushcliffe through Labour's commitment to employ 13,000 new neighbourhood police and PCSOs\n1.\nPrevent crime in the first place by improving mental health / addiction support services, including professional support for all secondary schools in Rushcliffe\n2.\nReduce appointment waiting times and restore \"the family doctor\" in Rushcliffe through Labour's commitment to 7,500 more medical school places and 10,000 more nursing and midwifery clinical placements per year\n3.\nLobby for an overhaul of social care via a 10-year reform plan. This is especially important for Rushcliffe's ageing population (an increase of 26.3% in people aged 65 years and over in the 2021 census)\n4.\nImprove education provision locally through Labour's commitment to recruit 6,500 new teachers by ending the charitable status of private schools. Campaign for more school places \"on site\" in settlements like Ruddington\n5.\nRemove legislative barriers to local authorities opening new childcare provision. Further address the supply side of childcare, working with the early years and childcare sector to build capacity\n6.\nWork with Nottinghamshire County Council to extend recycling provision with a new, improved centre for Rushcliffe to replace the centre closed at Langar in 2015\n7.\nFight for more powers to be passed directly to local councils and local people to make decisions. Westminster isn't always best placed to decide what happens in Rushcliffe\n8.\n5. Strengthen Rushcliffe's communities and housing\nCut household energy bills by up to £1400 a year through insulating millions of homes and building cheaper, cleaner power across the country\n1.\nTackle the wider rising cost of living after months of government failure. This includes strengthening the minimum wage to ensure it reflects the cost of living\n2.\nProtect pensioners’ independence by maintaining the triple lock for at least five years\n3.\nSupport national calls to give £1.2bn of mineworkers’ pension funds to ex-miners (recommended by a 2021 BEIS Select Committee report)\n4.\nSupport a significant expansion of Neighbourhood Plans with site allocations to give residents control over growth and infrastructure in Rushcliffe communities (only 9 adopted today vs. over 35 in Bassetlaw)\n5.\nFocus house building on the regeneration of brownfield land or the grey belt rather than swamping existing locations. Alternatively, lobby for the creation of large brand-new settlements instead, like Stevenage and Milton Keynes in the last century\n6.\nFocus build effort primarily on more affordable homes and council homes to meet demand, including homes for downsizing (given 65% of properties built in Rushcliffe are 3-bed plus). This will help to stabilise eye-watering mortgage and rent costs\n7.\nWork with Rushcliffe District Council to clamp down on poor standards in the private-rented sector\n8.\nLeveraging my deep connections and involvement with local communities, I will seek to actively engage residents in the decision-making process, ensuring their voices are heard and their needs are met\nA community-centric approach\nUsing my experience delivering large innovative projects, I'll build strong partnerships to bring creative solutions to local challenges, focusing on sustainable, long-term infrastructure development\nInnovative planning and problem-solving\nI am committed to inclusivity, ensuring that all community groups, including the most vulnerable, have a say in how Rushcliffe develops and grows. This includes rural communities who are too often deprioritised.\nInclusive\nengagement\nDrawing from my rigorous and methodical approach to work, I will ensure that decisions are data-driven, ensuring effectiveness and accountability in governance.\nEvidence-based decisions\nHow I'll work for Rushcliffe\nFor me, standing and winning in Rushcliffe isn't the end-goal - I want to be your voice in parliament because I believe there is lots to do and it needs someone with a bold vision and a coherent plan to deliver the best for Rushcliffe and the wider region.\nI have developed this plan by reviewing over 240 news stories from Rushcliffe settlements over the past five years. I have used this to understand the issues that link individual settlements across the constituency.\nHowever, I have also used it to understand the key differences between each location. To win votes across the constituency, we need to ensure that residents from all Rushcliffe settlements know that Labour is on their side and that we have answers that speak to their immediate local needs as well as the national problems created by the past 15 years of Tory government. A good MP can and should address both.\nSo beneath the five pillars, I have identified 8 key areas of focus that I'd hope to progress as an MP. I hope the totality of this view represents the key priorities for you and your neighbours - if not, please get in touch as this plan isn't static and should reflect members' and residents' priorities as well as my own.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_more-jobs-set-to-be-created-in-worksop/content_17.html": "More jobs set to be created in Bassetlaw\n- jamesnaish\n- Mar 25, 2024\n- 2 min read\nUpdated: Apr 30, 2024\nPlans to unlock £160 million in government grants have taken a notable step forward as the final steps are taken to formalise the East Midlands Investment Zone (EMIZ) - part of which will be on the edge of Worksop - helping to create new jobs, increase productivity and boost the local economy.\nBassetlaw District Council Cabinet members have agreed to progress to the next stage of the proposed EMIZ which will include three sites: the Centre of Excellence in Modern Construction (Bassetlaw and Bolsover); Infinity Park Derby (Derby City and South Derbyshire); and Hartington Staveley (Chesterfield).\nThe EMIZ is intended to act as a catalyst for new investments from existing companies in the region, including Laing O’Rourke in Bassetlaw and Rolls-Royce in Derby.\nTogether, these sites are intended to support growth in the green industries and advanced manufacturing sectors across the East Midlands as a whole. It’s expected they will collectively help to bring in over £380 million in private investment and upwards of 4,000 jobs to the region.\nBy continuing to be key partners in this inward investment strategy, Bassetlaw District Council can bid for flexible funding in the future worth around £120 million which it can spend on areas including skills, local infrastructure, business support and research and innovation. This could be anywhere in the district, including projects associated with the STEP fusion energy project at West Burton.\nCllr James Naish, Leader of Bassetlaw District Council, said: “We are pleased to see that once more, Bassetlaw’s potential as a vibrant place to live, work and do business is being recognised as one of only three parts of the East Midlands to be part of the emerging East Midlands Investment Zone.\n“By continuing to engage and work at a regional level, the Council and its partners will be able to accelerate the transformation of the district into a hub for new technologies.\n“We welcome the opportunities that this will bring to secure new investment; to create high-quality apprenticeships and jobs; and, ultimately, to improve life chances for Bassetlaw residents.”\nThe financial incentives on the three sites – totalling 95 hectares in total – will initially last five years with the potential for a further five-year extension. Bassetlaw District Council’s Cabinet has given permission to enter into a Memorandum of Understanding with the new East Midlands Mayoral Combined County Authority (EMMCCA).\nIt is expected that investment incentives at the Laing O’Rourke Centre of Excellence in Modern Construction (CEMC) on the edge of Worksop, will fast track the development of a modular construction hub and an apprenticeship training academy, boosting local productivity. Linked with the University of Nottingham this vital economic boost will create positive opportunities for raising the skill sets of local residents.\nThe latest Cabinet paper details how the EMIZ will be established at the start of next month when the East Midlands Mayoral County Combined Authority (EMMCCA) is formally created.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_independent-planning-inspectors-find-bassetlaw-local-plan-sound/content_28.html": "Independent planning inspectors find Bassetlaw Local Plan ‘Sound’\n- jamesnaish\n- Mar 11, 2024\n- 3 min read\nBassetlaw District Council’s Local Plan is considered to be ‘sound’ by the independent Planning Inspectorate following examination, with the addition of some recommendations known as Main Modifications which are a normal part of the Local Plan process.\nThis means that the Inspectors agree that the Bassetlaw Local Plan sets out an appropriate way to deliver sustainable housing and employment, supported by new infrastructure, across the district for the next 14 years on sites put forward by a range of landowners from across Bassetlaw.\nThe Local Plan calls for a total of 11,195 homes to be built across the district by 2038. However, because many new homes have either already been built, allocated through other routes such as Neighbourhood Plans or have planning permission, the Local Plan only allocates 2,387 new homes to be built by 2038 – an average of 133 new homes each year.\nTo support the creation of 9,699 new jobs and housing, the Local Plan requires significant infrastructure benefits across the district with land and financial contributions set aside for two new schools, health services, five trees for every new house, new parks and open spaces, transport improvements including road junctions and financial contributions to support Bassetlaw Hospital.\nThe Bassetlaw Local Plan also deals with several other matters such as Climate Change, by providing additional tree planting, the provision of open spaces and promotion of sustainable travel and cycle routes; Biodiversity, by ensuring wildlife is not negatively affected and enhanced in some areas; and manage and reduce the flood risk across all developments with sustainable drainage.\nCouncillor Julie Leigh said: “Having a Local Plan means that we can put an end to speculative development in Bassetlaw, plan properly for new housing and employment across the district and crucially, help ensure that vital infrastructure is provided alongside new building. This includes land and funding allocated for new school facilities in Retford and Worksop, junction improvements across Bassetlaw, and funding for Health Facilities.”\nAs part of the Local Plan, the Council has taken the decision not to ask for Community Infrastructure Levy funding from large Local Plan sites including Peaks Hill Farm, Ordsall South and Trinity Farm. This is because CIL monies are not tied to specific areas and can be spent anywhere in the district.\nInstead, the Council has chosen to ask developers to fund the necessary infrastructure for these sites through Section 106 Agreements. This means that the Council can ensure that money provided by developers is used in the areas where development takes place.\nBy taking this decision, the Council also demonstrates a funding gap of £9.5million, which is the difference between the total known cost of the infrastructure set out in the plan and the amount that will be raised from developer contributions. By having this funding gap, the Council will be able to access Community Infrastructure Levy monies, which could raise up to an additional £10.8million.\nThe Planning Inspector’s report states that: “although there is a funding gap, there is also a reasonable prospect of the gap being bridged. We, therefore, conclude that the existence of an infrastructure funding gap is not a reason to find the Plan unsound.”\nCllr James Naish, Leader of Bassetlaw District Council, added: “This major milestone brings the examination process to an end and puts the Council on the front foot against speculative development. We will now begin the final journey towards formal adoption later in the year.”\nClick here to read the independent Planning Inspectors’ Report.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_landlords-held-to-account/content_25.html": "Landlords held to account\n- jamesnaish\n- Jul 26, 2023\n- 2 min read\nBassetlaw District Council has held two local landlords to account after they failed to make essential repairs to their tenant’s heating system.\nDavid Griffiths and Emily Griffiths, who own the property in Harworth and Bircotes, failed to maintain a gas heating system that left their tenant with no hot water or heating between 15th August and 6th September 2022.\nThe Griffiths, of Tickhill Road, Harworth, were found guilty of charges relating to the Environmental Protection Act 1990 at Mansfield Magistrates Court on 18th May 2023 and were each fined £990, ordered to contribute costs of £356 and pay a Victim Surcharge of £396 - totalling £1,742 for each defendant.\nIn September 2021, Bassetlaw District Council received a complaint from the tenant that their home was in a state of disrepair and, following an inspection, officers identified hazards relating to gas safety, electrical safety, food safety, personal hygiene and structural issues.\nOver the next 11 months, the Council received more complaints from the tenant that although some problems had been rectified, there was a persistent issue with the central heating and hot water boiler and the landlord was not responding to their messages for support. As a result, the Council served a notice requiring the landlords to carry out work that would reinstate a constant supply of hot running water to the property. The property owners failed to comply with the notice and the Council replaced the boiler in default of the notice.\nWhile the defendants corresponded with the Council throughout the process and have now reimbursed the Council for the replacement boiler, they failed to attend an interview under caution when requested and did not attend the hearing at Mansfield Magistrates Court, where the case was proven in their absence.\nCllr Jonathan Slater, Cabinet Member for Housing and Estates at Bassetlaw District Council, said: “As a local authority we have powers at our disposal to ensure that landlords provide their tenants with safe and warm homes. Mr and Mrs Griffiths failed their tenant and left them to live in conditions that were completely unacceptable.\n“We hope that by highlighting this case, we send a message to neglectful landlords that if your properties do not meet the required standards, we can and will take action against you.”\nIf you live in private rented accommodation and have any concerns about the safety of your home, please contact the Council’s Environmental Health Team on 01909 533 533 or visit: www.bassetlaw.gov.uk/environmental-health/information-for-private-tenants-and-landlords/",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_council-allocates-extra-cost-of-living-funding/content_7.html": "Council allocates extra cost-of-living funding\n- jamesnaish\n- Aug 8, 2023\n- 2 min read\nBassetlaw District Council has allocated £160,000 to projects to provide additional support to our communities through the ongoing cost-of-living crisis, as part of its early preparations for a potentially difficult winter.\nThe funding comes after the Council hosted a meeting with 20 partner organisations across Bassetlaw to prepare for the impacts of the rising cost of living on residents over the coming autumn and winter months.\nThe information provided by a range of agencies painted a stark picture of the issues that some residents are likely to face in the coming months. An example of this is the unprecedented demand for the services of Citizens Advice Bassetlaw which has seen its workload increase from being ‘average’ across the Citizens Advice network to now being in the top five nationally.\nSome of the key issues being raised by service users include debt, benefits advice, energy, housing and employment, with the worst-affected age groups being working-age people who have been hit hard by rising mortgage and rent costs. The fact that these groups are in deficit ahead of the winter is particularly worrying to the Council and its partners, and suggests that it could be a difficult winter for many.\nTo help support and build the resilience of the community and voluntary sector which often acts as the first point of contact for those in need, ahead of the winter, Bassetlaw District Council is allocating:\nCitizens Advice Bassetlaw – Welfare Benefits Caseworker costs - £67,206\nCitizens Advice Bassetlaw – Housing Caseworker costs - £28,433\nFood Bank Community Shop – Staffing and fruit and vegetables - £41,500\nWarm Packs - £10,000Warm Spaces - £5,000\nCo-ordinated Communications - £8,750\nKaren Whitlam, Chief Executive Officer for Citizens Advice Bassetlaw, said: “The financial assistance from the Council has helped us to deal with unprecedented demand for help from local people. It is only by working together that we can continue to provide support to those most in need as the pressures of the rising cost of living continue.”\nLynn Tupling, Chief Executive of Bassetlaw Action Centre, said: “The warm packs were a significant help to the elderly and vulnerable last winter who were faced with the dilemma of ‘heating or eating’. The funding for the packs from Bassetlaw District Council made this possible and we welcome the support being provided for the 2023/24 winter.”\nThe Council and its partners will continue to watch trends in Bassetlaw and seek to react wherever possible, but is seeking to put firm foundations in place now.\nCouncillor Lynne Schuller, Cabinet Member for Health and Wellbeing at Bassetlaw District Council, said: “The rising cost of living is not just putting significant financial pressure on Bassetlaw residents; it is also a public health crisis as these pressures are sadly not going away. We have already taken significant steps to protect the most vulnerable groups within our area, and our sincere hope is that the latest allocation of funding will help those who experience difficulties in the next few months, including people who probably never expected that they would need help.”\nCllr James Naish, Leader of Bassetlaw District Council, said: “As a District Council, we are grateful for the support of a network of partners who are dealing with many of the frontline challenges. We will continue to work together to prepare for the challenges that the autumn and winter will bring.”",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_james-for-rushcliffe/content_1.html": "The polls suggest that we are heading towards a Labour government. If they are right, for Rushcliffe, the choice is simple ... do you want a voice in the next government or not? If you do, you need to vote Labour. Anything else, you are likely to end-up with a backbench MP with limited influence. You are always better to have an MP on the government benches.\n1. Have a voice IN government, not out\nAs a Council Leader covering an area of more than 115,000 people, I know what it means to represent a disparate rural seat like Rushcliffe. I want to make sure that issues in East Leake, Keyworth, Cotgrave and the rural villages are prioritised in the same way as issues in West Bridgford. The constituency as a whole needs to thrive, not just parts of it.\n2. Focus on the whole of Rushcliffe\nA lot of Rushcliffe residents have told me that they don't feel well-represented at the moment. Their voices aren't heard and their concerns aren't responded to quickly. As your MP, whether fighting for inward investment, calling out Government inaction or simply responding to constituents’ concerns, I will engage promptly and effectively so you know that you're being listened to.\n3. Engage and listen to residents\nAs a local Labour team, we are committed to working together to demonstrate and implement Labour's values using our public voice. As your MP, I will work with all Rushcliffe councillors to address local failings and to paint a positive vision for the future. We will have one voice at all levels of government and across the wider region.\n4. Work hard and as one team locally\nWhy vote Labour in Rushcliffe? We will...\n1. Boosting investment and growth\nI will drive Rushcliffe's economic growth by attracting meaningful investment, supporting local workers and boosting productivity through leveraging our strategic location and resources to promote local industries and entrepreneurship.\n2. Securing green energy\nskills and jobs\nI am committed to using my professional background to transform Rushcliffe into a green energy hub with innovative, high-quality, unionised jobs in emerging industries such as hydrogen, with an emphasis on harnessing local resources and talent of all ages.\n3. Improving transport and infrastructure\nI recognise the need for a comprehensive upgrade of Rushcliffe's infrastructure and transport systems, and to urgently address the risks caused by increased flooding. This means improving road networks, public transport and making rail travel more sustainable.\n4. Saving Rushcliffe's\nkey public services\nFrom health care in Radcliffe-on-Trent and East Leake to education in Ruddington and Cotgrave to emergency services in West Bridgford and across the constituency, I will work hard to secure funding and reform services to enhance delivery.\n5. Empowering Rushcliffe communities\nI'll strengthen Rushcliffe's communities by promoting vibrant neighbourhood development and inclusive, affordable housing using planning tools such as neighbourhood plans to put you in control. Rushcliffe residents need a stronger say in its future.\nFor me, standing and winning in Rushcliffe isn't the end-goal - I want to be your voice in parliament because I believe there is lots to do and it needs someone with a bold vision and a coherent plan to deliver the best for Rushcliffe and the wider region.\nRushcliffe is already a great place to live, work and do business. However, there is a lack of strategic place-based leadership today.\nGrowth is happening organically, meaning many residents and businesses are rightfully concerned about a lack of infrastructure, disappearing green spaces and overstretched public services. Residents need and want to believe that growth is being managed properly - that someone is looking 10 to 15 years ahead and planning for a sustainable future.\nMy vision for Rushcliffe is clear. It focuses on five key pillars which, beneath them, have a range of practical policies and achievable outcomes.\nThis plan has been developed by building a database of news stories from across the constituency; engaging residents on the doorstep; and liaising with local councillors. I strongly believe in the need to combine national and local agendas to get the best outcomes for workers, residents and businesses.\nLatest\nSome of James' supporters:\nHelen Fanning\nRushcliffe resident\nJames is known for being a hardworking, forward-thinking and bold leader. He has so much to offer to Rushcliffe and the wider region which is why I am supporting him at the general election. The country needs fresh voices, fresh energy and fresh ideas\nCllr Chris Grocock\nRushcliffe Borough Council\nAs the Councillor for a rural ward in Rushcliffe District, I believe James is the right person to be Rushcliffe's voice in parliament. He already knows how to lead a large area in the East Midlands and how to secure investment. He has my full support\nLauren Crow\nRushcliffe business owner\nAs a business owner, I know that James understands the challenges facing the workforce. He is committed to creating opportunities for everyone to thrive and has a credible plan to do this, which is why I am backing him\nCllr Sue Shaw\nFormer cabinet member, Bassetlaw\nJames has been a very effective Council Leader, securing over £60m of government funding and a multi-billion-pound infrastructure project which will genuinely change lives. Bassetlaw’s loss would 100% be Rushcliffe’s gain\nMy plan for Rushcliffe\n1. Boosting investment and growth\nI pledge to drive Rushcliffe's economic growth by attracting substantial investments, fostering local businesses, and enhancing productivity. This includes leveraging our strategic location and resources to boost local industries and entrepreneurship. I'll work on creating an environment conducive to business innovation and expansion, ensuring Rushcliffe becomes a magnet for talent, innovation and economic activity.\n2. Securing green energy skills and jobs\nI am committed to transforming Rushcliffe into a green energy hub by introducing innovative, high-quality jobs in emerging industries such as hydrogen. This will be driven by my experience of bringing fusion energy to North Nottinghamshire. All investment must also create jobs. This is why my focus will be on protecting current industries, protecting workers’ rights, creating new jobs and ensuring that every household and business benefits from cleaner, more affordable energy. This will involve advocating for both government and private investment in green technologies, with an emphasis on harnessing local resources and talent.\n3. Improving critical infrastructure\nMy commitment to Rushcliffe includes a comprehensive upgrade of our infrastructure and transport systems. This means improving road networks, enhancing public transportation, and ensuring efficient connectivity. I will focus on making travel easier, safer, and more sustainable, encouraging active travel, and integrating Rushcliffe more effectively into the regional and national transport network.\n4. Saving public services\nI am dedicated to ensuring the availability and quality of public services in Rushcliffe. From health care and education to emergency services, I'll work to secure funding, improve facilities and enhance service delivery. My goal is to make sure that every resident has access to excellent public services, contributing to a higher quality of life for all.\n5. Empowering communities\nI aim to strengthen Rushcliffe's communities by promoting inclusive, affordable housing and vibrant neighbourhood development. My focus will be on creating housing that meets the needs of all, from young families to the elderly. I will advocate for responsible development that respects our environment and heritage, ensuring that Rushcliffe remains a desirable and sustainable place to live and work.\nI am standing to be Labour’s parliamentary candidate in Rushcliffe because, as an energy industry professional and current Council Leader, I believe that I have the right mix of experience and vision to lead Rushcliffe over the next few years.\nThe country is at a significant juncture after 14 years of mismanagement - you only have to look around you to see that things are going backwards. Schools and roads are literally crumbling around us.\nI have fought against that narrative locally and led bottom-up efforts to secure a multi-billion-pound investment in the form of a fusion energy prototype plant for Nottinghamshire as well as over £60m of Government grants. Our Local Plan is projected to create almost 10,000 jobs while securing new schools, healthcare investment, new bus services, flood mitigation infrastructure and affordable housing. The same can be done in Rushcliffe.\nI believe that I have the foresight, credentials and hand-on experience to give Rushcliffe a proper voice in the national debate and to ensure that Nottinghamshire and the East Midlands gets its fair share of investment. I understand where green investment needs to go and how to get it moving. My professional background means I can work with both private sector bosses and senior politicians to promote this constituency and make the most of its untapped potential.\nI believe that I can offer Rushcliffe a fresh, bold and dynamic form of leadership which has been lacking for the past five years. It’s time for change.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_bassetlaw-district-council-commits-to-net-zero-operations-target-by-2030/content_18.html": "Bassetlaw District Council commits to net zero operations target by 2030\n- jamesnaish\n- Sep 22, 2023\n- 1 min read\nCouncillors at Bassetlaw District Council have unanimously committed to reducing council operations to Net Zero by 2030, following a motion to Council on Thursday 21st September 2023.\nThis means that by 2030, the Council’s operations should achieve a balance between the carbon emitted into the atmosphere and the carbon removed from it.\nThe motion, proposed by Cllr Darrell Pulk, Cabinet Member for Environment and Energy, after being suggested by the Leader of the Council, Cllr James Naish, resolved to:\nBecome a member of the UK100 network of local leaders pledging to lead a rapid transition to net zero\nAgree to the 'UK100 Net Zero Pledge'\nTo meet net zero council operations by 2030\nTo meet net zero areawide emissions by 2045\nTo report carbon emissions annually for both council emissions and areawide emissions\nLimit the use of carbon offsets, and if they are used, then these must be as local as possible\nCllr Darrell Pulk said: “I am delighted that the motion to join UK100 was passed unanimously and shows that Councillors are committed to achieving net zero for Council operations by 2030.\n“We need to take action now if we are to create a better future for both families and future generations across Bassetlaw. Net zero can be a driver for new jobs and industry and can be a catalyst for stimulating local economic growth. It can support residents to reduce energy bills, deliver cleaner air and greener communities.“",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_blog_categories_community/content_31.html": "top of page\nJOIN THE CAMPAIGN\nHome\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nHome\nbottom of page",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_blog/content_11.html": "top of page\nDelight at national recognition for independent living schemes\nBassetlaw District Council is celebrating national recognition for its work modernising independent living schemes and improving the...\njamesnaish\nApr 19, 20241 min read\nMore jobs set to be created in Bassetlaw\nPlans to unlock £160 million in government grants have taken a notable step forward as the final steps are taken to formalise the East...\njamesnaish\nMar 25, 20242 min read\nExciting improvements underway at Langold Country Park\nWork is underway to make Langold Country Park more user friendly and accessible thanks to over £170k of funding secured and provided by...\njamesnaish\nMar 21, 20242 min read\n£20m Levelling Up funding on its way to Bassetlaw\nBassetlaw District Council has completed work with the UK Government and received the green light to invest £20 million of regeneration...\njamesnaish\nMar 15, 20242 min read\nIndependent planning inspectors find Bassetlaw Local Plan ‘Sound’\nBassetlaw District Council’s Local Plan is considered to be ‘sound’ by the independent Planning Inspectorate following examination, with...\njamesnaish\nMar 11, 20243 min read\nDemand for more school places being met in Worksop\nBassetlaw District Council has secured £3 million of developer funding to help meet growing demand for school places in Worksop. The...\njamesnaish\nFeb 14, 20242 min read\nRural communities get more than £500k funding\nMore than half a million pounds of funding is on its way to support rural community groups and businesses in Bassetlaw after they bid for...\njamesnaish\nJan 26, 20241 min read\nResidents delight at Larwood House refurbishment\nResidents say they are happy and settled at Larwood House in Worksop, one of Bassetlaw District Council’s five independent living...\njamesnaish\nJan 24, 20242 min read\nMore funding for arts, heritage, cultural and creative activities\nGrants of up to £5,000, to support communities in Bassetlaw with a passion for arts, heritage, cultural and creative projects have been...\njamesnaish\nJan 19, 20242 min read\nWork continues at Westmoreland House\nBassetlaw District Council is continuing to make significant investment in its accommodation for older people by modernising and...\njamesnaish\nJan 18, 20242 min read\nFirst steps in multi-billion-pound STEP project\nA significant milestone preparing for a UK first in energy production, which will create thousands of jobs and attract investment in...\njamesnaish\nJan 16, 20242 min read\nCouncil meets with EA to discuss Bassetlaw flood plight\nBassetlaw District Council and the Environment Agency have met this week to discuss the devastating floods that hit Bassetlaw in October...\njamesnaish\nJan 10, 20243 min read\nMore Bassetlaw start-ups secure Enterprise Grants\nBassetlaw District Council is continuing to award Enterprise Grants to start-up and pre-start-up businesses across the district; and...\njamesnaish\nDec 21, 20232 min read\nGovernment builds full council tax increase into Local Government funding settlement for 2024/25\nOn Monday, the Secretary of State for Levelling Up, Housing and Communities, Michael Gove, published the Provisional Local Government...\njamesnaish\nDec 20, 20233 min read\nMiddletons Yard celebrates official opening\nBassetlaw District Council has officially opened its thriving new business hub in Worksop town centre, providing facilities and support...\njamesnaish\nOct 17, 20232 min read\nBassetlaw District Council goes electric\nBassetlaw District Council is taking its commitment to be one of the cleanest and greenest districts in the country further by...\njamesnaish\nSep 26, 20232 min read\nBassetlaw District Council commits to net zero operations target by 2030\nCouncillors at Bassetlaw District Council have unanimously committed to reducing council operations to Net Zero by 2030, following a...\njamesnaish\nSep 22, 20231 min read\nCouncil brings more CCTV refuge points to Worksop\nBassetlaw District Council is continuing to make Worksop a safer place by installing three more CCTV Refuge Points for people to use if...\njamesnaish\nAug 23, 20232 min read\nCouncil allocates extra cost-of-living funding\nBassetlaw District Council has allocated £160,000 to projects to provide additional support to our communities through the ongoing...\njamesnaish\nAug 8, 20232 min read\nStatement on the future of Wilko\nA statement from Cllr James Naish, Leader of Bassetlaw District Council on the emerging situation at Wilko. “Like many local employees...\njamesnaish\nAug 3, 20232 min read\nbottom of page",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_blog_categories_politics/content_23.html": "top of page\nJOIN THE CAMPAIGN\nHome\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nHome\nbottom of page",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_residents-delight-at-larwood-house-refurbishment/content_4.html": "Residents delight at Larwood House refurbishment\n- jamesnaish\n- Jan 24, 2024\n- 2 min read\nUpdated: Jan 27, 2024\nResidents say they are happy and settled at Larwood House in Worksop, one of Bassetlaw District Council’s five independent living centres, which has officially been opened after extensive refurbishment.\nBright, modern and welcoming apartments have been created at the complex in Worksop as 32 bedsits have been transformed into 18 self-contained one-bed apartments with updated communal areas.\nFive residents have already moved in and are benefitting from larger living spaces, a fully accessible wet room and either a private patio or Juliet balcony.\nBrenda Morris is among those who has moved back in and said: “It really is beautiful; I love it here and have settled in nicely since making the move in November. I can’t believe how big it is; my flat has more space than the bungalow I used to live in.”\nAs well as communal spaces including a lounge, kitchen and accessible gardens, there is also a store for personal mobility scooters, a drying room and a treatment room for visiting mobile hairdressers.\nEnergy efficiency measures such as solar panels and air source heat pumps have been installed, reducing the building’s carbon emissions.\nCllr Jonathan Slater, Cabinet Member for Housing and Estates said: “We’re proud of the investment being made in our Independent Living Centres and it shows a real commitment to improving our housing stock. Larwood House is the first of our centres to be upgraded with state-of-the-art facilities supporting people to live independently for many years to come.”\nCllr James Naish, Leader of Bassetlaw District Council, said: “We are investing over £117m in our social housing stock over the next 5 years. With rent in the private-rented sector continuing to increase rapidly, it is more important than ever that councils are supported to invest in high-quality affordable housing for the future. I look forward to seeing our similar schemes in Harworth and Bircotes, Retford and Misterton come to fruition over the next couple of years.”\nBassetlaw’s Independent Living Centres are a collection of self-contained apartments and flats that specifically cater for older residents who wish to live in a community setting. Larwood House is the first of the Council’s Independent Living Centres to undergo refurbishment, with work underway at Westmoreland House in Harworth and Bircotes and improvements planned for Conway Gardens in Retford and Swallow Court in Misterton.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_statement-on-the-future-of-wilko/content_8.html": "Statement on the future of Wilko\n- jamesnaish\n- Aug 3, 2023\n- 2 min read\nA statement from Cllr James Naish, Leader of Bassetlaw District Council on the emerging situation at Wilko.\n“Like many local employees and residents, Bassetlaw District Council is concerned to hear today’s announcement from Wilko. Wilko has historically been at the epicentre of retail business in Bassetlaw, and we are proud of its long and established history of serving the high street. It is a great family-orientated business which puts people and customers at the heart of its operations.\n“As a Council, we stand to support anxious employees wherever we can. We are in active dialogue with the GMB trade union and have written to the Chief Executive of Wilko, seeking an urgent meeting, while putting the Council's teams on standby to help as required.\n“We support finding a buyer as quickly as possible to ensure that high streets, near and far, remain vibrant places to shop, work and socialise. Bassetlaw is a great place to do business with significant inward investment planned over the next two decades, and Bassetlaw District Council will actively welcome discussions with any party considering supporting this much-loved brand.”\nLetter to Mark Jackson, Chief Executive of Wilko\nDate: 3 August 2023\nDear Mark\nLike many local employees and Bassetlaw residents, Bassetlaw District Council is concerned to hear today’s announcement from Wilko.\nWilko has historically been at the epicentre of retail business in Bassetlaw, and we are proud of its long and established history of serving the high street, as we know you are. It is a great family-orientated business which puts people and customers at the heart of its operations.\nWe are deeply concerned about the potential impact on existing Wilko staff, many of whom will be anxious following today’s news.\nAs a Council, we stand with you at this difficult hour and our staff are at your disposal to use as required to try and identify a buyer as quickly as possible to ensure that high streets, near and far, remain vibrant places to shop, work and socialise.\nTo that end, we would like to request an urgent meeting on Monday morning so that our teams can be fully briefed of the situation and we can prepare to support you, Wilko employees, trade unions and others in the critical days that lie ahead.\nWe look forward to hearing from you and wish you and Wilko every success in the meantime.\nYours sincerely,\nCllr James Naish, Leader\nCllr Jo White, Leader Deputy Leader",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_blank/content_3.html": "top of page\nDelight at national recognition for independent living schemes\nBassetlaw District Council is celebrating national recognition for its work modernising independent living schemes and improving the...\njamesnaish\nApr 19, 2024\nMore jobs set to be created in Bassetlaw\nPlans to unlock £160 million in government grants have taken a notable step forward as the final steps are taken to formalise the East...\njamesnaish\nMar 25, 2024\nExciting improvements underway at Langold Country Park\nWork is underway to make Langold Country Park more user friendly and accessible thanks to over £170k of funding secured and provided by...\njamesnaish\nMar 21, 2024\n£20m Levelling Up funding on its way to Bassetlaw\nBassetlaw District Council has completed work with the UK Government and received the green light to invest £20 million of regeneration...\njamesnaish\nMar 15, 2024\nIndependent planning inspectors find Bassetlaw Local Plan ‘Sound’\nBassetlaw District Council’s Local Plan is considered to be ‘sound’ by the independent Planning Inspectorate following examination, with...\njamesnaish\nMar 11, 2024\nDemand for more school places being met in Worksop\nBassetlaw District Council has secured £3 million of developer funding to help meet growing demand for school places in Worksop. The...\njamesnaish\nFeb 14, 2024\nRural communities get more than £500k funding\nMore than half a million pounds of funding is on its way to support rural community groups and businesses in Bassetlaw after they bid for...\njamesnaish\nJan 26, 2024\nResidents delight at Larwood House refurbishment\nResidents say they are happy and settled at Larwood House in Worksop, one of Bassetlaw District Council’s five independent living...\njamesnaish\nJan 24, 2024\nMore funding for arts, heritage, cultural and creative activities\nGrants of up to £5,000, to support communities in Bassetlaw with a passion for arts, heritage, cultural and creative projects have been...\njamesnaish\nJan 19, 2024\nWork continues at Westmoreland House\nBassetlaw District Council is continuing to make significant investment in its accommodation for older people by modernising and...\njamesnaish\nJan 18, 2024\nFirst steps in multi-billion-pound STEP project\nA significant milestone preparing for a UK first in energy production, which will create thousands of jobs and attract investment in...\njamesnaish\nJan 16, 2024\nCouncil meets with EA to discuss Bassetlaw flood plight\nBassetlaw District Council and the Environment Agency have met this week to discuss the devastating floods that hit Bassetlaw in October...\njamesnaish\nJan 10, 2024\nMore Bassetlaw start-ups secure Enterprise Grants\nBassetlaw District Council is continuing to award Enterprise Grants to start-up and pre-start-up businesses across the district; and...\njamesnaish\nDec 21, 2023\nGovernment builds full council tax increase into Local Government funding settlement for 2024/25\nOn Monday, the Secretary of State for Levelling Up, Housing and Communities, Michael Gove, published the Provisional Local Government...\njamesnaish\nDec 20, 2023\nMiddletons Yard celebrates official opening\nBassetlaw District Council has officially opened its thriving new business hub in Worksop town centre, providing facilities and support...\njamesnaish\nOct 17, 2023\nBassetlaw District Council goes electric\nBassetlaw District Council is taking its commitment to be one of the cleanest and greenest districts in the country further by...\njamesnaish\nSep 26, 2023\nBassetlaw District Council commits to net zero operations target by 2030\nCouncillors at Bassetlaw District Council have unanimously committed to reducing council operations to Net Zero by 2030, following a...\njamesnaish\nSep 22, 2023\nCouncil brings more CCTV refuge points to Worksop\nBassetlaw District Council is continuing to make Worksop a safer place by installing three more CCTV Refuge Points for people to use if...\njamesnaish\nAug 23, 2023\nCouncil allocates extra cost-of-living funding\nBassetlaw District Council has allocated £160,000 to projects to provide additional support to our communities through the ongoing...\njamesnaish\nAug 8, 2023\nStatement on the future of Wilko\nA statement from Cllr James Naish, Leader of Bassetlaw District Council on the emerging situation at Wilko. “Like many local employees...\njamesnaish\nAug 3, 2023\nPriory Centre engagement hub now open in Worksop town centre\nResidents, businesses and visitors who want to learn more about Bassetlaw District Council’s plans to regenerate the Priory Centre have...\njamesnaish\nAug 2, 2023\nLandlords held to account\nBassetlaw District Council has held two local landlords to account after they failed to make essential repairs to their tenant’s heating...\njamesnaish\nJul 26, 2023\nbottom of page",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_council-brings-more-cctv-refuge-points-to-worksop/content_9.html": "Council brings more CCTV refuge points to Worksop\n- jamesnaish\n- Aug 23, 2023\n- 2 min read\nBassetlaw District Council is continuing to make Worksop a safer place by installing three more CCTV Refuge Points for people to use if they feel unsafe, threatened, or need urgent help.\nFunded by the Nottinghamshire Office of the Police and Crime Commissioner and its Safer Streets Fund, the refuge points work by connecting the person in need of assistance with the Council’s CCTV Control Room Operatives, who can contact the emergency services where necessary.\nThe latest refuge points are located on Bridge Street, Victoria Square and The Canch, and it is hoped that the introduction of these additional cameras will act as a deterrent and an increase a sense of safety for people visiting the town centre and the Canch.\nCllr Lynne Schuller, Cabinet Member for Health and Wellbeing at Bassetlaw District Council said: “I am really pleased to have this initiative available within our District, enabling people to feel safer within our streets. Alongside a range of projects we are actively prioritising community safety.”\nThe Refuge Points were installed following feedback from residents as part of community safety questionnaires and a multi-agency Environmental Visual Audit. These areas, central to the District’s night-time economy were also identified as hot spots for anti-social behaviour in data from the Council and Nottinghamshire Police.\nThere are now a total of nine refuge points within Bassetlaw, located at:\nHigh Hoe Road, Worksop\nBlyth Road, Worksop\nDevonshire Street / Newcastle Avenue, Worksop\nPriorswell Road, Worksop\nGateford Road / Babbage Way, Worksop\nVictoria Square, Worksop\nBridge Street, Worksop\nThe Canch, Worksop\nGrove Street, Retford (funded by a grant from the office of the Nottinghamshire Police and Crime Commissioner)\nNottinghamshire Police and Crime Commissioner Caroline Henry said the additional Refuge Point cameras are a game changer for tackling crime and anti-social behaviour in Bassetlaw.\n“It’s brilliant to hear that residents are already benefitting from the extended security offered by the Refuge Point cameras across Bassetlaw, made possible by Safer Streets. These devices are simple to use yet offer people a direct connection with the control room staff who can ensure help is on its way to you sooner. There’s nothing worse than feeling unsafe when out and about, and this is something that we are dedicated to tackling through the Safer Streets programme in Bassetlaw and across the county.”",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_middletons-yard-celebrates-official-opening/content_26.html": "Middletons Yard celebrates official opening\n- jamesnaish\n- Oct 17, 2023\n- 2 min read\nBassetlaw District Council has officially opened its thriving new business hub in Worksop town centre, providing facilities and support for up to 30 small and micro businesses.\nMiddletons Yard, which saw a number of buildings with historical significance sympathetically regenerated into a modern and contemporary business hub, was officially opened by the Council’s Chair, Cllr Deborah Merryweather, along with other dignitaries and partners who were integral to the project.\nAfter welcoming its first tenants in December 2022, it has since become a base for 22 businesses. This includes companies in a diverse number of sectors including finance, transport, green technology and fostering services in addition to an independent café called Secret Garden.\nCllr Deborah Merryweather, Chair of Bassetlaw District Council, said: “It was wonderful to be able to officially open this building and speak with many of the people who now base their businesses here. I would like to thank all of the partners who were involved in this project and helped to make it all possible.\n“We know that in order to support our towns and our independent businesses, places like Middletons Yard need to be created so that small and micro businesses have the opportunity to get started and grow to their full potential. This is reflected in the Council's recently-adopted Vision 2040 strategy and our ambition for Bassetlaw to be a great place to do business.”\nMatch-funding of £1.8 million was provided by D2N2 and Midlands Engine through the ‘Unlocking Growth in N2 Town Centres’ programme. Additional funding of £108,000 was provided by the National Lottery Heritage Fund.\nMiddletons Yard provides managed office space over two floors in its main building, three floors in a second building and additional self-contained offices in the historic Brewers Yard section. The buildings have been designed to offer flexible spaces and to include two dedicated meeting rooms and break-out areas to encourage networking between businesses. The hub also accommodates a co-working space and virtual tenancies for start-ups and micro businesses.\nIn addition to office space, the Council’s Economic Development Team provide occupants with a wrap-around business support service that includes access to start-up Enterprise Grants, pre-start up advice and training, links to supply chains, and skills and recruitment support.\nIn addition to supporting local businesses, Middletons Yard is also supporting the high street by bringing additional footfall to Worksop town centre. Public spaces are an integral part of the site to increase accessibility in the town centre and provide easy access to the high street and public transport hubs.\nDeputy Leader of the Council and Cabinet Member for Business and Skills, Cllr Jo White, said: “I was delighted to invite Jonathan Reynolds MP to jointly open Middletons Yard because Bassetlaw District Council's model of supporting local businesses is a standard that many other authorities view with envy.\n“It is important that we share achievements and initiatives like Middletons Yard with senior politicians like Jonathan, who was very impressed with what he saw, supporting local business whilst bringing a derelict site back to life.”\nIf you would like to know more about Middletons Yard or enquire about the four remaining available office spaces, please visit www.middletonsyard.co.uk or call 01909 384 811.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_blog_categories_politics-1/content_16.html": "top of page\nJOIN THE CAMPAIGN\nHome\nPosts Coming Soon\nExplore other categories in this blog or check back later.\nHome\nbottom of page",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_priory-centre-engagement-hub-now-open-in-worksop-town-centre/content_10.html": "Priory Centre engagement hub now open in Worksop town centre\n- jamesnaish\n- Aug 2, 2023\n- 2 min read\nResidents, businesses and visitors who want to learn more about Bassetlaw District Council’s plans to regenerate the Priory Centre have been dropping into a new engagement hub.\nIn its first two weeks, more than 850 people have visited the engagement hub on Bridge Place, Worksop to look at the plans and images of what the new Priory Centre could look like, to learn more about the development as a whole and to talk to officers involved with the project.\nThe £20million regeneration plans, which includes Levelling Up funding of £17.9million, will help to transform Worksop town centre by creating a dedicated venue for family entertainment and play, alongside a new food court and existing retail.\nCouncillor Julie Leigh, Cabinet Member for Identity and Place at Bassetlaw District Council, said: “The engagement hub has already given hundreds of people the chance to understand the project in more depth and to have their questions answered by officers directly involved in the redevelopment plans.\n“As part of this engagement, we have also been recording the views of people visiting the hub and over 320 comments have been provided, which includes lots of positive and useful feedback. We really value your views and input, so we hope that this level of feedback continues for the remainder of the engagement period.”\nCllr James Naish, the Leader of Bassetlaw District Council, said: “The redevelopment of the Priory Centre is a huge project for Worksop and Bassetlaw which we hope will attract more people to the town centre and encourage them to stay for longer. Over £40m has been secured in Government funding to-date and we will continue to push for more investment across the whole of the District.”\nThe engagement hub is located at the entrance to the Priory Centre on the corner of Bridge Place. It opened on Thursday 20th July and will be in place throughout a six-week engagement period which ends on Sunday 27 August.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_work-continues-at-westmoreland-house/content_14.html": "Work continues at Westmoreland House\n- jamesnaish\n- Jan 18, 2024\n- 2 min read\nBassetlaw District Council is continuing to make significant investment in its accommodation for older people by modernising and improving its Independent Living Centre in Harworth and Bircotes.\nThe Westmoreland House project is taking place as part of the Council’s plan to improve all of its Independent Living Centre accommodation across the district as part of a five-year partnership with specialist design and build company Fortem.\nThe works are on track to be completed by summer 2024 with the building’s exterior almost complete and internal works well underway. The finished scheme will offer 33 one-bedroomed flats, all fitted with wet rooms for residents over the age of 60. There will also be a new central courtyard and communal areas across the site.\nJonathan Slater, Cabinet Member for Housing and Estates said: “It’s great to see the progress that’s been made at Westmoreland House. Projects like these are vital in helping our older residents. It gives them a place to feel safe and reduces isolation whilst also providing them with high-quality, good value living.\n“We’re proud of the work we are doing to improve the standard of the homes at our Independent Living Centres and working with Fortem has allowed us to consider the residents who will call them home, from the start of the project to the finish.”\nThe properties will also have a number of energy efficient measures installed including: a future-proofed gas heating system that could be upgraded to be fuelled by a gas and hydrogen mix when required; electric heating that will be powered by a solar power PV system; upgraded ventilation and air conditioning to ensure communal areas are as comfortable as possible; upgraded windows; and external wall insulation. Smart monitoring systems will also be installed to ensure the building does not become at risk of damp and mould in the future. The site will also have an interactive warden call system that promotes social inclusion for those at risk of loneliness.\nCllr James Naish, Leader of Bassetlaw District Council, said: “We are investing over £117m in our social housing stock over the next 5 years. With rent in the private-rented sector continuing to increase rapidly, it is more important than ever that councils are supported to invest in high-quality affordable housing for the future. I am pleased to see this project progress and look forward to its completion in the summer.”\nThe Westmoreland House project runs alongside a £4m renovation of Larwood House in Worksop. The renovations of Conway Gardens in Retford and Swallow Court in Misterton are set to commence from 2025 and consultation with residents there on potential improvements are already underway.",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_levelling-up-funding-on-its-way-to-bassetlaw/content_5.html": "£20m Levelling Up funding on its way to Bassetlaw\n- jamesnaish\n- Mar 15, 2024\n- 2 min read\nUpdated: Apr 30, 2024\nBassetlaw District Council has completed work with the UK Government and received the green light to invest £20 million of regeneration funding across the district through its Levelling Up Partnership.\nThe Government’s Levelling Up Partnerships team has been working with Council officers, local businesses, health care providers, schools, colleges and charities - and visiting the district - to get an insight into local priorities and needs.\nThe selected projects needed to fulfil Levelling Up missions which include increasing life chances across three key areas: 'Community and place', 'Local businesses' and 'People and skills'.\nThe projects given the go-ahead include:\nStreetscape improvements in Retford, Tuxford and Worksop that could include improved shop frontages, measures to reduce crime, access improvements and other public realm improvements.\nThe development of a health and wellbeing exercise facility at The Priory Centre, Worksop.\nA new training and practical workshop-based education centre at Worksop Creative Village.\nThe employment of a STEP Skills & Engagement Officer to raise awareness of the opportunities that will be created by the planned prototype fusion power plant at West Burton.\nA new banking and community accessible space at Retford Town Hall.\nSite clearance and enabling works at the former North Border School site in Harworth.\nRefurbishment of Manton Children’s Centre to be used as a family hub.\nEnhancements to the Centre Place facility in Cheapside, Worksop, in line with the area’s Thriving Neighbourhoods Plan.\nCouncillor Julie Leigh, Cabinet Member for Identity & Place at Bassetlaw District Council, said: “We have worked with ministers from the Department for Levelling Up to ensure that the funding can be used across Bassetlaw to help drive change and improve the life chances and opportunities for our residents. A range of projects across the district have been agreed with ministers and, put together, they progress the Council’s aspirations in Vision 2040.”\nCllr James Naish, Leader of Bassetlaw District Council, added: “This £20million investment will help to propel change and generate opportunities for residents of all ages across Bassetlaw. Among the eight confirmed projects, there are schemes in Tuxford and Harworth & Bircotes as well as Retford and Worksop, all of which contributes to delivering the Council’s vision for Bassetlaw as a whole to become an even better place to live, work and do business.”",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_more-funding-for-arts-heritage-cultural-and-creative-activities/content_13.html": "More funding for arts, heritage, cultural and creative activities\n- jamesnaish\n- Jan 19, 2024\n- 2 min read\nGrants of up to £5,000, to support communities in Bassetlaw with a passion for arts, heritage, cultural and creative projects have been announced.\nBassetlaw District Council’s Arts and Heritage Grant Programme, which is part of the Government’s UK Shared Prosperity Fund, is offering groups, organisations and charities another chance to apply.\nA second round of funding has been announced and groups have until 12noon on Tuesday 13th February to submit their applications.\nPrevious grants have helped 10 groups in the district to provide projects including creative therapies for people fighting cancer, a sculpture celebrating the LGBTQ+ community, and funding for a Christmas Lantern Parade.\nJames Naish, Leader of Bassetlaw District Council said: “This latest round of funding will help create new and exciting possibilities for groups and communities to develop projects which will benefit residents across the district.\n“We are looking forward to seeing a diverse range of creative ideas, to help build pride in place and support greater health and wellbeing of our communities.”\nCommunity groups who wish to bid for a share the latest round of funding for 2024/25 can now do so, with applications welcome from both constituted and non-constituted organisations.\nGroups can apply for grants of between £500 and £5,000, as well as smaller grants of between £500 and £1,000. The funding is part of a package of measures being delivered over the next two years, thanks to Bassetlaw District Council securing more than £3.39million of the Government’s UKSPF monies. This will help to fund projects and initiatives that build pride in place and increase life chances across three key areas - Community and Place, Local Businesses and People and Skills.\nTo learn more about who can apply for each grant and how to bid for funding, please visit: https://www.bassetlaw.gov.uk/business-advice/ukspf-bidding-and-procurement-opportunities/ukspf-bidding-arts-and-heritage-small-grant-programme/",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_government-builds-full-council-tax-increase-into-local-government-funding-settlement-for-2024-25/content_19.html": "Government builds full council tax increase into Local Government funding settlement for 2024/25\n- jamesnaish\n- Dec 20, 2023\n- 3 min read\nOn Monday, the Secretary of State for Levelling Up, Housing and Communities, Michael Gove, published the Provisional Local Government Finance Settlement for 2024-25. While officially increasing the maximum funding to Councils for 2023/24 by 6.5%, Bassetlaw will only see a below inflation increase of 4.5%. The Government’s settlement assumes that all local authorities will increase council tax by the maximum allowed, meaning financial support for local government is increasingly falling on residents who are already managing cost-of-living pressures.\nThe Local Government Association (LGA), which is the national voice of local government, has warned that “the settlement does not provide enough funding to meet the severe cost and demand pressures which have left councils of all political colours and types warning of the serious challenges they face to set balanced budgets next year.” Collectively, councils in England are estimated to face a funding gap of £4 billion over the next two years. There have been several high-profile cases of councils submitting Section 114 notices in the past few months including Nottingham and Birmingham City Councils which confirms that they expect expenditure for the current financial year to exceed income which is unlawful.\nBassetlaw District Council Leader, James Naish, said: \"While our finances remain in a relatively stable position, we aren’t shielded from the pressures being experienced by so many councils across the country. It is frustrating that with inflation stubbornly remaining above the Bank of England’s target, the Government hasn’t provided any meaningful new funding to help councils seeking to provide important front-line services. This is especially true of District Councils like Bassetlaw which will receive a lower spending power increase than other councils as it won’t receive any additional income through the adult social care precept.”\nThe LGA has historically argued that council tax rises cannot be an effective solution to the long-term pressures faced by councils, particularly in social care. Increasing council tax raises different amounts of money in different parts of the country, unrelated to need. The data suggests that Bassetlaw’s core spending power in 2024/25 will increase by 4.5% which was below October’s CPI inflation figure of 4.6%. It ranks Bassetlaw 327rd out of the 349 local authorities based on percentage increases to its core spending power vs. 2023/24 levels.\nBased on a Band D property in Bassetlaw in 2023/24, only 8.38% of the council tax bill goes to the District Council. The rest goes to Nottinghamshire County Council (64.46%), Nottinghamshire Police (11.62%), Adult Social Care (9.92%, also Nottinghamshire County Council), Nottinghamshire Fire & Rescue Service (3.87%) and Parish Councils (1.75%).\nWhile Levelling Up Secretary Michael Gove said the “real-terms increase … demonstrates how the Government stands behind councils up and down the country”, the County Councils Network (CCN) said its members would be “bitterly disappointed”, with finance spokesperson Councillor Barry Lewis saying the CCN “had put together a strong case for emergency funding next year to address the significant financial headwinds councils face which are outside of our control.”\nCllr Naish continued: “Once again, we are faced with a one-year settlement for local government, the sixth in a row. This limits our ability to plan ahead and creates a culture of councils needing to maximise increases while they are on the table, not knowing what the Local Government Finance Settlement will be the following year. Along with councils of all political colours, we call on the next Government to change the short-term approach to local government funding so councils can effectively forward plan to maximise spending returns while keeping any cost increases as low as possible for local residents and businesses.”",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_latest/content_22.html": "top of page\nDelight at national recognition for independent living schemes\nBassetlaw District Council is celebrating national recognition for its work modernising independent living schemes and improving the...\njamesnaish\nApr 19, 2024\nMore jobs set to be created in Bassetlaw\nPlans to unlock £160 million in government grants have taken a notable step forward as the final steps are taken to formalise the East...\njamesnaish\nMar 25, 2024\nExciting improvements underway at Langold Country Park\nWork is underway to make Langold Country Park more user friendly and accessible thanks to over £170k of funding secured and provided by...\njamesnaish\nMar 21, 2024\n£20m Levelling Up funding on its way to Bassetlaw\nBassetlaw District Council has completed work with the UK Government and received the green light to invest £20 million of regeneration...\njamesnaish\nMar 15, 2024\nIndependent planning inspectors find Bassetlaw Local Plan ‘Sound’\nBassetlaw District Council’s Local Plan is considered to be ‘sound’ by the independent Planning Inspectorate following examination, with...\njamesnaish\nMar 11, 2024\nDemand for more school places being met in Worksop\nBassetlaw District Council has secured £3 million of developer funding to help meet growing demand for school places in Worksop. The...\njamesnaish\nFeb 14, 2024\nRural communities get more than £500k funding\nMore than half a million pounds of funding is on its way to support rural community groups and businesses in Bassetlaw after they bid for...\njamesnaish\nJan 26, 2024\nResidents delight at Larwood House refurbishment\nResidents say they are happy and settled at Larwood House in Worksop, one of Bassetlaw District Council’s five independent living...\njamesnaish\nJan 24, 2024\nMore funding for arts, heritage, cultural and creative activities\nGrants of up to £5,000, to support communities in Bassetlaw with a passion for arts, heritage, cultural and creative projects have been...\njamesnaish\nJan 19, 2024\nWork continues at Westmoreland House\nBassetlaw District Council is continuing to make significant investment in its accommodation for older people by modernising and...\njamesnaish\nJan 18, 2024\nFirst steps in multi-billion-pound STEP project\nA significant milestone preparing for a UK first in energy production, which will create thousands of jobs and attract investment in...\njamesnaish\nJan 16, 2024\nCouncil meets with EA to discuss Bassetlaw flood plight\nBassetlaw District Council and the Environment Agency have met this week to discuss the devastating floods that hit Bassetlaw in October...\njamesnaish\nJan 10, 2024\nMore Bassetlaw start-ups secure Enterprise Grants\nBassetlaw District Council is continuing to award Enterprise Grants to start-up and pre-start-up businesses across the district; and...\njamesnaish\nDec 21, 2023\nGovernment builds full council tax increase into Local Government funding settlement for 2024/25\nOn Monday, the Secretary of State for Levelling Up, Housing and Communities, Michael Gove, published the Provisional Local Government...\njamesnaish\nDec 20, 2023\nMiddletons Yard celebrates official opening\nBassetlaw District Council has officially opened its thriving new business hub in Worksop town centre, providing facilities and support...\njamesnaish\nOct 17, 2023\nBassetlaw District Council goes electric\nBassetlaw District Council is taking its commitment to be one of the cleanest and greenest districts in the country further by...\njamesnaish\nSep 26, 2023\nBassetlaw District Council commits to net zero operations target by 2030\nCouncillors at Bassetlaw District Council have unanimously committed to reducing council operations to Net Zero by 2030, following a...\njamesnaish\nSep 22, 2023\nCouncil brings more CCTV refuge points to Worksop\nBassetlaw District Council is continuing to make Worksop a safer place by installing three more CCTV Refuge Points for people to use if...\njamesnaish\nAug 23, 2023\nCouncil allocates extra cost-of-living funding\nBassetlaw District Council has allocated £160,000 to projects to provide additional support to our communities through the ongoing...\njamesnaish\nAug 8, 2023\nStatement on the future of Wilko\nA statement from Cllr James Naish, Leader of Bassetlaw District Council on the emerging situation at Wilko. “Like many local employees...\njamesnaish\nAug 3, 2023\nPriory Centre engagement hub now open in Worksop town centre\nResidents, businesses and visitors who want to learn more about Bassetlaw District Council’s plans to regenerate the Priory Centre have...\njamesnaish\nAug 2, 2023\nLandlords held to account\nBassetlaw District Council has held two local landlords to account after they failed to make essential repairs to their tenant’s heating...\njamesnaish\nJul 26, 2023\nbottom of page",
  "https_www_jamesnaish_com_james-for-rushcliffe/https_www_jamesnaish_com_post_more-bassetlaw-start-ups-secure-enterprise-grants/content_29.html": "More Bassetlaw start-ups secure Enterprise Grants\n- jamesnaish\n- Dec 21, 2023\n- 2 min read\nBassetlaw District Council is continuing to award Enterprise Grants to start-up and pre-start-up businesses across the district; and since April this year, nine businesses have secured a total of £14,510 to help with business costs such as marketing, equipment or uniforms.\nBusinesses applying for the scheme can be awarded a grant of up to £2000. Just some of the businesses to be awarded grants this year include:\nObviously Optical\nThe Mobile Pizza Company\nThe Cleaning Lady\nThe Ruddy Duck Printshop\nSummit Signs\nTo access the grant process, businesses must support their application with a sound business plan and accurate financial projections. The Council’s business advisers also provide support for the application process and can assist candidates who are unsure of certain business-related topics.\nCllr Jo White, Deputy Leader of Bassetlaw District Council and Cabinet Member for Business and Skills said: “We are one of the few councils that proactively assists new businesses and start-ups with financial support. Our Enterprise Grant has been available over the last 20 plus years.\n“As Chair of the panel, I get to meet many different organisations applying for the grant. Their unique ideas and proposals are always interesting and it’s great to see how our support has the power to help turn those plans into reality.\n“If anyone is thinking of applying for the grant, don’t hesitate, have a go - and if you have any questions, contact our business adviser who is always happy to help you through the application process.”\nAs well as the grant, the individual or business get a dedicated Business Adviser who offers one-to-one support, plus access to fully-funded workshops to ensure they have all the support they need to start their business.\nCllr James Naish, Leader of Bassetlaw District Council, said: “We are proud to have a strong record of new businesses in Bassetlaw surviving for more than three years. We want to do everything that we can to support local entrepreneurs and it's fantastic to hear more local success stories.”\nYou can find out more about the Enterprise Grants and read successful applicant interviews here on the Council's website."
}