{
  "https_www_andrewcooper_net_/https_www_andrewcooper_net/content_1.html": "top of page\nIt is the greatest honour to be elected to represent Northwich, Winsford and Middlewich in Parliament.\nAs your MP, I’ll never shy away from the tough challenges. I’ll remain rooted in the community in which I live, and fight for the place we love and feel proud to call home.\nTogether, I know we can build a better society for us all - in Mid Cheshire and beyond.\nAll the best,\nAndrew\nLatest News\nbottom of page",
  "https_www_andrewcooper_net_/https_www_andrewcooper_net_help-and-advice/content_5.html": "Help and Advice\nCouncil services\nMost services are provided by:\nCheshire West and Chester Council\nSome services, such as parks, play areas, cemeteries, allotments or town centre events may be provided by your town or parish council.\nNorthwich | Winsford | Middlewich | Rudheath | Kingsmead | Hartford | Davenham and Bostock | Moulton | Whitegate and Marton\nMental health\nIf you think you are at risk of putting yourself in immediate danger please call 999 or go to A&E.\nText 'SHOUT' to 85258\n116 123 (free from any UK number)\nA Natural Health Service project from The Mersey Forest.\nDomestic violence\nDial 999 if you’ve been threatened or attacked and require urgent assistance.\nHousing and homelessness\nIn Northwich and Winsford:\nwestcheshirehomes@cheshirewestandchester.gov.uk\nIn Middlewich:\n0300 123 5017 option 1\ncheshirehomechoice@cheshireeast.gov.uk\nCitizens Advice Cheshire East\nNational\nFood and essentials\nDebt, Universal Credit and benefits\nCitizens Advice Cheshire East\nWeaver Vale Housing Trust Money Matters Team\n(WVHT residents only)",
  "https_www_andrewcooper_net_/https_www_andrewcooper_net_contact-me/content_3.html": "Address\nUnit 23 Meridian House\nRoad One Industrial Estate\nWinsford CW7 3QG\nEmail\nandrew.cooper.mp@parliament.uk\nPhone\n0207 219 7479\nSocial Media",
  "https_www_andrewcooper_net_/https_www_andrewcooper_net_surgeries/content_2.html": "top of page\nAdvice Surgeries\nMy weekly advice surgeries take place on a Friday and alternate between online and in-person appointments. The in-person appointments rotate between venues in Northwich, Middlewich and Winsford. Please note that I and my team are only able to provide advice and assistance to residents of Mid Cheshire constituency. You can check which constituency you live in here.\nTo request an appointment, complete the form below, email Andrew.Cooper.MP@parliament.uk or call the office on 0207 219 7479.\nbottom of page",
  "https_www_andrewcooper_net_/https_www_andrewcooper_net_in-parliament/content_4.html": "In Parliament\nVisiting Parliament\nWhen Parliament is in session\nFree tours, run for constituents by Houses of Parliament tour guides, happen on the following days and times while Parliament is sitting:\n-\nMonday 9am – 12pm\n-\nTuesday 9am – 9:50am\n-\nTuesday 10:15am – 12pm\n-\nWednesday 9am – 9:50am\n-\nWednesday 10:15am - 12pm\n-\nFriday 3:30pm – 5pm\nTours take approximately 75 minutes.\nPlease drop me an email at andrew.cooper.mp@parliament.uk for further details.\nWhen Parliament is in recess\nOutside of the session, Parliament offers tours on a commercial basis. For more information, visit the UK parliament website.\nMy work in Parliament\nYou can find out more about my voting record, written contributions, and spoken contributions on the UK Parliament website.\nRaising issues\nI regularly raise issues on behalf constituents, businesses and organisations in Mid Cheshire. This can be privately, by writing to the relevant ministers, departments or officials, or in public in the House of Commons chamber.\nDo you have an issues you would like me to raise? Get in touch.\nEarly day motions\nI regret that as a point of principle, I do not sign any Early Day Motions except in exceptional circumstances. However, I am happy to discuss ways we can get issues on the national agenda and effect meaningful change. Please get in touch if I can help."
}