{
  "http_andreawall_org_/http_andreawall_org_tag_halton_page_3/content_149.html": "I’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area. I have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an […]\nTag: Halton\nNational Dementia Awareness Week 17th May – 24th May 2015\n“Walk Down Memory Lane” Share Tweet Email\nKingsway Spring Clean\nAround 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nKingsway Ward Spring Clean\nI am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring. This is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and […]\nKingsway Ward Councillor Surgeries\nKingsway Ward councillor surgeries will take place at the following venues and times: Andrea (me) – Third Wednesday of each month 12.00pm – 1.00pm. St Paul’s Church Community Centre, Vicarage Road, Widnes. June and Margaret – first Thursday of each month 6.00pm – 7.00pm. Room 15 of Kingsway Learning Centre/Widnes Library. Our surgeries are for […]\nWidnes sports centre to be named after rugby legend Frank Myler\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email\nArea Forum Tuesday 27 January 2015 6.30pm\nIn Halton, our main neighbourhood partnerships are called Area Forums. At Area Forum meetings, you can give your views, comments and concerns on local issues and priorities directly to the Council. They are a chance for you to make a real difference to your communities. You can also submit a question to Area Forums. Kingsway […]",
  "http_andreawall_org_/http_andreawall_org_creativity-for-life/content_97.html": "Dear Resident,\nI’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join.\nLoose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust.\nThe project is aimed at Kingsway residents along with Riverside and Appleton ward residents.\nTo start off there are free Family Christmas Craft Workshops, each Wednesday from 5pm – 6.30pm for the next four weeks, creating Advent Calendars, Christmas Cards, Festive Star and Tree Decoration. Booking is essential.\nThe project is to offer music, arts and media opportunities for all ages and help improve participation of residents and decrease social isolation. Loose would like to know what you would like to participate in, you can find details here and below.\nI really hope that this benefits as many Kingsway Ward residents as possible.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_blog_page_3/content_14.html": "In Halton, our main neighbourhood partnerships are called Area Forums. At Area Forum meetings, you can give your views, comments and concerns on local issues and priorities directly to the Council. They are a chance for you to make a real difference to your communities. You can also submit a question to Area Forums. Kingsway […]\nTag: Blog\nHappy New Year\nI hope you all had a good Christmas, mine was good, a quiet one spent with my family. I wish you all a happy and healthy 2015 and I look forward to meeting more Kingsway ward residents and working as hard as I can for you. Please don’t hesitate to get in touch if you […]",
  "http_andreawall_org_/http_andreawall_org_mini-motorbikes-quad-bikes-off-road-vehicles-and-anti-social-behaviour/content_57.html": "I’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area.\nI have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an opinion on this matter please email me andrea.wall@halton.gov.uk. If you don’t live in the Kingsway Ward, I’ll be happy to pass on any views on this issue to your own ward councillors.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_kingsway-ward-litter-pick-saturday-16th-february-2019/content_132.html": "Thank you to Peter T, Charlie, Angela & Rachael for joining in today’s litter pick. We managed to do half of Kingsway, Leigh Ave, Frederick Street & Dickson Street. Four bin bags of litter collected, bit of exercise, fresh air and nice chats with people.",
  "http_andreawall_org_/http_andreawall_org_military-veterans-wellbeing-symposium/content_72.html": "For the second year running I had the privilege of representing Halton at the Military Veterans & Their Families’ Wellbeing Symposium.\nIt was an honour to be invited alongside Military Veterans, delegates from the Royal British Legion, Combat Stress, Help the Heroes, serving armed forces representatives and NHS representatives.\nI learned a lot again this year from the wide variety of speakers and the message was clear, that more must be done to push the positives of ex service people and how their skills can be highly adaptable to ‘civvy street’. More must also be done to try to encourage Military Veterans to tell their GPs that they have served, as this enables a greater depth of research to be done into a variety of illnesses that may be more prevalent in people that have served.\nThe work the NHS has been doing to tailor specialised services sounds very encouraging and is being led by a GP who served.\nIt was great to bump into Gavin Jones who runs The Hub at the Halton Stadium, a once a month drop in centre for Military Veterans.\nFinally thanks to John Goulding, a Widnes Military Veteran who is one of the organisers of the Symposium and the research work that is ongoing regarding the well being of our ex service people and their families.",
  "http_andreawall_org_/http_andreawall_org_kingsway-ward-litter-pick-saturday-2nd-february-2019/content_51.html": "Thank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice chat, bit of exercise and spoke to some lovely people while out and about.",
  "http_andreawall_org_/http_andreawall_org_gallery_nggallery_thumbnails/content_145.html": "Skip to content\nSaturday, May 03, 2025\nCllr Andrea Wall\nHighfield Ward, Widnes, Halton\nMy Story\nContact Me\nCommunity\nMy Views\nNews\nHighfield Ward\nSocial Media\nGallery\nHighfield Ward Resident Survey\nSearch for:\nGallery\n[Watch as Slideshow]\nShare\nTweet\nEmail",
  "http_andreawall_org_/http_andreawall_org_police-in-the-community/content_96.html": "Blog Community Police in the Community Posted on 16th December 201629th December 2017 Author Andrea Wall Comment(0) Share Tweet EmailGood to see the police giving out advice at the Stadium today, including the Nominated Neighbour cards.",
  "http_andreawall_org_/http_andreawall_org_tag_happy-new-year/content_15.html": "I hope you all had a good Christmas, mine was good, a quiet one spent with my family. I wish you all a happy and healthy 2015 and I look forward to meeting more Kingsway ward residents and working as hard as I can for you. Please don’t hesitate to get in touch if you […]",
  "http_andreawall_org_/http_andreawall_org_tag_frank-myler-pavillion/content_38.html": "Dear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nTag: Frank Myler Pavillion\nLiverpool Road Works\nDear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]\nFrank Myler Pavilion – Official Opening and Fitness Classes\nThe official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]",
  "http_andreawall_org_/http_andreawall_org_tag_austerity/content_66.html": "Halton has been a Universal Credit full service area since July 2016. Cllr Andrea Wall (Kingsway) has long been a campaigning, vociferous critic of the system. Cllr Wall recently moved the HBC motion calling on the government to stop their roll out of Universal Credit to other areas, which was unanimously carried by the council. Today […]\nTag: austerity\nWhat I do as a councillor\nDear Resident, I’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do. First and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings […]",
  "http_andreawall_org_/http_andreawall_org_widnesgolfclubpetition/content_29.html": "I am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years.\nPlease join me by signing my petition, the text of which is below. You can sign the petition here:\nIf/when the application goes in, I will also be going door to door to get as many formal objections as possible submitted to any application to build houses on this land. If you can help with this please let me know.\nWhy is this important?\nWe believe that the green space of Widnes Golf Club is extremely important in terms of making up part of the ‘green lung’ of Widnes. It has for many decades been a central green space in the heart of Widnes and we believe that it must remain as green space.\nWe have lost many of our green areas to housing development due to government planning laws. Housing development of this nature spot would have a hugely detrimental impact on the people of Kingsway Ward living nearby and also on people living across the whole of Widnes.\nThe traffic on Liverpool Road and Highfield Road is we feel already at capacity, to add more houses with the numbers of cars that come with those houses would increase people’s travelling times, pollution and hugely increase the number of vehicles travelling near our local schools.\nWe are deeply concerned that building houses on this important green space would heavily impact on the pupil places available at our local schools, many of which in the nearby vicinity are already hugely over subscribed. This would then have a wider impact on families living across Widnes when seeking school places.\nWe urge Widnes Golf Club and their members to please think of the local community that the club has been part of for nearly 100 years. We urge Widnes resident golf club members at their Emergency General Meeting to vote against the proposals by their committee to sell the land for housing development. We urge them to think of the wide ranging impact of their vote on their fellow Widnes residents and call on them as fellow Widnesians to stop the golf club’s attempts to sell this land for housing development.\n*****UPDATE***** Widnes Golf Club members have voted by a majority to try to obtain planning permission to develop this Green Space. We urge them to think again and take into account the detrimental impact their decision could have on fellow Widnesians\n******UPDATE****** Anwyl Construction/ Anwyl Homes have been announced as the company that will attempt to get planning permission to build a housing development on this vitally important Green Lung of Widnes. We urge them to look at the strong local opposition to any building on this designated Green Space and the long history of fierce local opposition when this has been attempted before.\nIf they will not, we urge Halton Borough Council to do everything in their power to stop any part of this designated Green Space land being turned into a housing development.\nHow it will be delivered\nIn person Sign here https://you.38degrees.org.uk/petitions/no-housing-development-of-widnes-golf-club",
  "http_andreawall_org_/http_andreawall_org_kingsway-trees/content_74.html": "Happy that the trees I’ve been working on getting planted on the Biggy have now been planted. Another six planted bringing it up to twelve so far.\nHappy that the trees I’ve been working on getting planted on the Biggy have now been planted. Another six planted bringing it up to twelve so far.",
  "http_andreawall_org_/http_andreawall_org_distraction-burglary/content_70.html": "There was a distraction burglary in Kingsway Ward last week.\nLook after our elderly and/or vulnerable neighbours with the\nNominated Neighbour Scheme.\nIt’s a card to encourage elderly/vulnerable people to not open their door to unknown people and to phone a trusted neighbour to check the person out for them.\nCards are available at Widnes Police Station or the exhibition vehicle in Widnes Town Centre.",
  "http_andreawall_org_/http_andreawall_org_long-loaf/content_42.html": "Lovely time at my surgery at Long Loaf Community Lunch at St Paul’s community hall. Great meal and even a song from my friend Alan #communitymatters\nLovely time at my surgery at Long Loaf Community Lunch at St Paul’s community hall. Great meal and even a song from my friend Alan #communitymatters",
  "http_andreawall_org_/http_andreawall_org_tag_asb/content_95.html": "Following the damage to people’s vehicles in Kingsway Ward last night and ongoing anti social behaviour. On behalf of the ward, I today agreed to the police implementing a dispersal zone. The dispersal zone is now in place. This disgraceful behaviour is really affecting residents’ quality of life and must stop. Share Tweet Email\nTag: ASB\nPlay Area Clean Up\nMassive thank you to everybody that turned out today to give Dundalk Rd Play Area a clean up following it being set on fire and the toddler swings destroyed over Christmas. This play area is hugely important to the local community. We cleaned up the park and surrounding areas of litter and hope that the […]\nPlay Area Set on Fire\nSo angry at the damage caused to the play area at the top of Dundalk Road over Christmas. The play area is in Kingsway Ward as the ward goes right across to the boundary at Ditton Community Centre. There is no excuse for this mindless destructive behaviour, lots of families use this little play area. […]\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nOperation Granite – Motorbikes, Mini Motos and Anti Social Behaviour\nI wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]\nStewards Ave/Liverpool Rd Public Footpaths and Anti Social Behaviour\nToday I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue […]\nMini Motorbikes, Quad Bikes, off road vehicles and anti social behaviour\nI’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area. I have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an […]",
  "http_andreawall_org_/http_andreawall_org_category_community/content_49.html": "Thank you to Ashley High School Student Council for inviting me to attend their council meeting this morning to explain what I do as a councillor and a Question & Answer session – very interesting and challenging questions. Always a pleasure to go in to speak to the students and staff at Ashley High School. […]\nCommunity\nKingsway Ward Litter Pick – Saturday 2nd March 2019\nI thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field […]\nKingsway Ward Litter Pick – Saturday 16th February 2019\nThank you to Peter T, Charlie, Angela & Rachael for joining in today’s litter pick. We managed to do half of Kingsway, Leigh Ave, Frederick Street & Dickson Street. Four bin bags of litter collected, bit of exercise, fresh air and nice chats with people. Share Tweet Email\nKingsway Ward Litter Pick – Saturday 2nd February 2019\nThank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice […]\nWidnes Royal British Legion & Royal Artillery Schools Poppy Appeal Awards\nProud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]\nAidan’s Christmas Carol Fundraiser\nI had a lovely time at Aidansteddybearchallenge Christmas Carol Fundraiser tonight. It is always a pleasure to see Aidan and his mum Caroline. Fantastic young man and family. I put my wish on the Christmas tree, Aidan’s Tree of Memories & Christmas Wishes – for peace and for people not to be in poverty. Share Tweet Email\nWidnes Viking’s Golden Generation & Chemics Cafe\nLovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]\nSanta Dash 2017\nGreat time taking part in Halton Haven’s Santa Dash today. Hopefully a lot of money raised for our local hospice by the many participants! Share Tweet Email\nKingsway Estate Security\nA Kingsway resident has just informed me that her son’s bike has been stolen from their back garden on the Kingsway Estate. It is a red/silver/orange Voodoo suspension bike and was stolen between 6pm and 7pm. Can people please keep an eye out for it. Additionally could people please keep the security gates on to […]\nVPX (Victoria Park Experience) Year Two\nGreat time today at VPX Widnes. Free activities for the kids. It’s been great to provide support for this free event for the second year running, with Cllr Phil Harris. I’ve really enjoyed working with Kingsway’s PCSO Bowers on it. Pictured are Cllr Harris, Assistant Chief Constable Nick Bailey, PCSO Bowers and me. One person missing […]",
  "http_andreawall_org_/http_andreawall_org_kingsway-back/content_139.html": "Great to see this work underway in a neglected Kingsway Back that Halton Housing Trust own. Residents reported problems to me, I met with Tommy from HHT on Monday and work is underway within the week to rectify the problems for residents. #partnership",
  "http_andreawall_org_/http_andreawall_org_tag_foxley-heath/content_50.html": "Dear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]",
  "http_andreawall_org_/http_andreawall_org_tag_labour_page_2/content_134.html": "“Walk Down Memory Lane” Share Tweet Email\nTag: Labour\nKingsway Spring Clean\nAround 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nKingsway Ward Councillor Surgeries\nKingsway Ward councillor surgeries will take place at the following venues and times: Andrea (me) – Third Wednesday of each month 12.00pm – 1.00pm. St Paul’s Church Community Centre, Vicarage Road, Widnes. June and Margaret – first Thursday of each month 6.00pm – 7.00pm. Room 15 of Kingsway Learning Centre/Widnes Library. Our surgeries are for […]",
  "http_andreawall_org_/http_andreawall_org_tag_kingsway-together/content_78.html": "Dear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nTag: Kingsway Together\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]\nKingsway Together\nDear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]",
  "http_andreawall_org_/http_andreawall_org_postal-workers-strike/content_144.html": "I support our posties in their battle to stop their pensions being slashed, to stop the worsening of their terms & conditions, achieve a pay rise and their attempts to protect our postal service.\nThis is not just about a pay rise, this is ordinary working people standing up for themselves and their families. This is about protecting post workers terms & conditions for future posties. We should all support them, or it could be a different job attacked next. The posties have managed to overcome serious Tory obstacles to legally be able to strike.\nThe Tories want you to turn on your postie, because it suits them for ordinary working people to turn on each other. The Tories don’t want our attention on how they could be stopping firms using poverty pay, zero hours and bogus self employment to undercut the Royal Mail while making huge profits. It much better suits the Tories for us to be blaming our fellow workers.\nInstead of letting the Tories divide us against our posties, we should be totally supporting our postal workers. Do we want jobs to continue getting worse in terms of working conditions and lower paid?\nThe posties have got the guts to take a stand, support them and it will further weaken this terrible government. Supporting our posties is an act of sticking up for our own futures too, if the posties win it will strike fear into this government and these companies that are taking huge profits, while making life worse for the ordinary worker.\nSolidarity to our posties #RiseUp",
  "http_andreawall_org_/http_andreawall_org_category_blog_page_5/content_154.html": "The first VPX Widnes was a fantastic day. It’s been a great pleasure to have been part of assisting with it coming to Widnes. I hope this is the first of many. Well done to Karen and Vicky the PCSOs who ran with the idea to bring VPX to Widnes and spent hours organising it;Tony who […]\nBlog\nKingsway Back\nGreat to see this work underway in a neglected Kingsway Back that Halton Housing Trust own. Residents reported problems to me, I met with Tommy from HHT on Monday and work is underway within the week to rectify the problems for residents. #partnership Share Tweet Email\nWidnes Growing Together Launched\nPress report on Widnes Growing Together: “A gardening scheme is being launched in Widnes with the aim of nurturing green-fingered skills and community spirit. Widnes Growing Together has been set up by Kingsway councillor Andrea Wall to foster neighbourhood pride, improve the environment, give residents the chance to enter ‘In Bloom’ competitions and to enable […]\nAshley School Council\nReally enjoyed attending the meeting of Ashley School’s School Council today. Really enthusiastic young people, some tough & really interesting questions from them. The School Council unanimously voted that I can attend again after half term for more pupil questions. Great initiatives going on at the school. Share Tweet Email\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nLiverpool Road Works\nDear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]\nOne Year Update and Happy New Year\nDear Resident, I’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016. Since being elected by residents last December and again in May I have been working hard to learn how to […]",
  "http_andreawall_org_/http_andreawall_org_tag_spring-clean/content_115.html": "Share Tweet Email\nTag: Spring Clean\nCommunity Clean Up 2017\nA community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed […]\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nKingsway Spring Clean\nAround 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nKingsway Ward Spring Clean\nI am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring. This is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and […]",
  "http_andreawall_org_/http_andreawall_org_contact-me/content_92.html": "You can contact me by email – andrea.wall@halton.gov.uk\nBy Phone or Text – 07795390979\nI am happy to arrange a home visit if required.\nI also hold a monthly surgery 12.00pm -1.00pm on the third Wednesday of each month at St Paul’s Community Hall, Vicarage Road, Widnes.\nI hold a weekly Facebook Live Question & Answer session for Kingsway Ward residents on Sunday evenings, 7pm – 9pm",
  "http_andreawall_org_/http_andreawall_org_tag_widnes_page_2/content_26.html": "Dear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nTag: Widnes\nLiverpool Road Works\nDear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]\nOne Year Update and Happy New Year\nDear Resident, I’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016. Since being elected by residents last December and again in May I have been working hard to learn how to […]\nCreativity For Life!\nDear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]\nFrank Myler Pavilion – Official Opening and Fitness Classes\nThe official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]\nOperation Granite – Motorbikes, Mini Motos and Anti Social Behaviour\nI wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]\nStewards Ave/Liverpool Rd Public Footpaths and Anti Social Behaviour\nToday I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue […]",
  "http_andreawall_org_/http_andreawall_org_king-george-v-playing-fields-frank-myler-sports-and-recreation-ground/content_35.html": "Dear Kingsway Ward Resident,\nI’ve had a few queries today about why there is fencing and work on going on a small part of the King George V Playing Fields by Foxley Heath. The work going on is to put in the sewerage outlet pipes for the new Victoria Gardens housing development on Liverpool Road. I’ve been advised that the work will take 6-8 weeks to complete and then the area concerned will be returned to grass.\nThe footpaths will only be closed as the machinery passes and then will be re-opened.\nFrank Myler Sports and Recreation Ground\nThis Wednesday 9th September from 3pm there will be free sports activities at the new Frank Myler Sports and Recreation Ground, previously the ICI Rec. From 3pm – 5pm there will also be a chance to have a look around the new Frank Myler Sports Pavilion. Details of the activities on offer on Wednesday can be found on the below publicity.\nThe Frank Myler Sports Pavilion is a single storey building, comprising of the following:\n- 8 large sports changing rooms\n- 2 family changing rooms\n- 5 officials changing rooms\n- 2 accessible changing rooms\n- a community room (suitable for exercise classes, meetings and functions, the room can be divided into separate areas)\n- kitchen\n- outdoor football and rugby pitches and a cricket wicket\n- reception area with WiFi\n- a floodlit multi use games area\nHalton Council hopes the high quality facilities will be fully operational over the summer months delivering support to the local amateur sport teams and providing new opportunities for a wide range of community activities. Activity examples include: holiday multi-sport sessions for ages 8 to 18yrs, sports specific coaching sessions and group exercise classes for 25 – 55yrs\nThe council’s sport and recreation team, already offers and facilitates a number of generic services that will be delivered from the venue, such as, community sports coach scheme, sports volunteer programme, coach education and development workshops and sports leadership courses.\nThe Frank Myler Sports and Recreation Ground is an important community sports facility in Halton and is situated in the Kingsway Ward on Liverpool Road. The site has historically provided community sports facilities and pitches for the community. In developing the site multisport has been a prime consideration. The site is centrally located in the town on a major public transportation route and forms the northern part of a much larger sports park area.\nIn addition to improving activity levels the facilities hope to use sport as a tool to regenerate and revitalise the wider community, helping to address issues relating to health, anti-social behaviour, education and environmental improvement.\nIf you have any queries regarding this or any other matter, please do not hesitate to contact me.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_kingsway-community-skip-scheme-and-update/content_58.html": "Dear Resident,\nAn update to let you know what I am doing.\nI am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time and if you would like to volunteer for this please contact me. The Spring Clean Skip Scheme and Litter Pick event last year were very successful, you can read about it here and I’m hoping this year will be even better.\nThe Skip Scheme is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and provides you with the opportunity to get rid of any household items including wood, garden waste, soil, scrap metal, bricks or rubble, hard plastics and small electrical items that you may have. Nonetheless, there will be a skip available for small non-recyclable items that cannot be placed in your black wheeled bin.\nI am currently working with Ashley School, Saints Peter & Paul School and the council’s Open Spaces team to bring some planting and colour to the ward. The two schools both got funding from the Kingsway Together project and their pupils will work together on this and hopefully the local community will get involved once things are in place to begin this lovely work. On the subject of Kingsway Together, St Bede’s Infants also received funding to improve the Mary Mary Garden that is on the corner of Leigh Avenue and Kingsway. Their pupils are working on designs for bringing colour to this corner of Kingsway and mini beast hotels to encourage the wildlife.\nI have been working on getting a gate installed at the end of Milton Avenue/beginning of Stewards Avenue. The funding has been obtained from Area Forum and we are currently consulting with residents that live backing on to the old access road, to introduce a gate to act as a barrier to vehicles that are causing anti social behaviour behind their homes and on the King George V Playing Fields. The proposed gate would still allow pedestrians, push bikes and mobility scooters to access the playing fields and paths but would stop vehicles, including off road bikes from gaining access to the fields and the rear of these homes. The residents living backing on to the old road would receive keys to allow them vehicle access to the rear of their properties. I am hoping that the consultation will be favourable and that this will lessen the anti social behaviour being suffered by these residents and residents at the bottom of Foxley Heath.\nI am aware that the off road bikes are still causing problems in the ward and across the town. The police have recently seized a number of them under Operation Scrambler, I continue to urge you to call the police on 101 to report incidences of this dangerous behaviour.\nAmongst many issues that residents have raised with me recently are housing trust repairs, dogs being let out loose on the Kingsway backs, parking in the week on Sinclair Avenue and I am working to try to remedy these for them.\nA number of residents have contacted me regarding getting a Zebra Crossing on the college side of Milton Road. I fully support these residents and I am consulting with the relevant council departments to try to have a crossing installed.\nAs usual I have attended various council meetings and outside agency meetings as one of your representatives and I encourage you to contact me if you need any help or have any queries.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_play-area-set-on-fire/content_84.html": "So angry at the damage caused to the play area at the top of Dundalk Road over Christmas. The play area is in Kingsway Ward as the ward goes right across to the boundary at Ditton Community Centre.\nThere is no excuse for this mindless destructive behaviour, lots of families use this little play area. They are expensive to fix and as everybody knows there is very little money about due to government cuts.\nThere are also more motor bike tracks on the playing fields and on some of the roundabouts. Some people also now seem to think it is acceptable behaviour to not pick up after their dogs.\nNONE of this is acceptable behaviour.\nWe have a collective responsibility to look after our area. Most of us want to live in a nice environment and look after it but it is being destroyed by the mindless, selfish actions of a few. If anybody saw who set the fire please contact the police on 101 and the same goes for when you see the mini motor motorbikes.\nIt is OUR things that are being destroyed and damaged.",
  "http_andreawall_org_/http_andreawall_org_tag_liverpool-road/content_7.html": "Dear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]",
  "http_andreawall_org_/http_andreawall_org_kingsway-estate-security/content_21.html": "A Kingsway resident has just informed me that her son’s bike has been stolen from their back garden on the Kingsway Estate. It is a red/silver/orange Voodoo suspension bike and was stolen between 6pm and 7pm. Can people please keep an eye out for it.\nAdditionally could people please keep the security gates on to the backs on the Kingsway Estate locked, they were installed to give residents extra security from anti social behaviour and incidences of theft. My understanding is the gate nearest to where this bike theft has taken place had been left open. It’s not fair that a minority of people are putting the security of other resident’s property at risk, it takes seconds to shut the gates.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_category_community_page_2/content_141.html": "Lovely time at my surgery at Long Loaf Community Lunch at St Paul’s community hall. Great meal and even a song from my friend Alan #communitymatters Share Tweet Email\nCommunity\nWidnes & District Horticultural Society\nHad a lovely evening with Widnes Gardening Club – Widnes Horticultural Society. They’re looking to relaunch their annual Widnes show, hopefully at the Frank Myler Pavilion in Kingsway Ward and I’ve agreed to help them. They welcome new members of any age group to join them, lovely bunch of people. Share Tweet Email\nWidnes Growing Together Update\nA little compilation of our site from the start to the current day. We’ve had set backs, we’ve won a RHS Award, we beat off stiff competition to win the top prize in the Tesco Bags of Help funding. The poly tunnel and communal shed are next on the list. Some of the plot holders, […]\nLitter Pick\nDespite the rain twelve bin bags of rubbish removed from Steward’s Brook today. Thank you to Michelle, Charlie and Alex for their help. Share Tweet Email\nKingsway Annual Spring Clean 2017\nShare Tweet Email\nCommunity Clean Up 2017\nA community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed […]\nPlay Area Clean Up\nMassive thank you to everybody that turned out today to give Dundalk Rd Play Area a clean up following it being set on fire and the toddler swings destroyed over Christmas. This play area is hugely important to the local community. We cleaned up the park and surrounding areas of litter and hope that the […]\nPolice in the Community\nGood to see the police giving out advice at the Stadium today, including the Nominated Neighbour cards. Share Tweet Email\nNorth West Ambulance Day\nReally interesting and informative time today at the North West Ambulance Service Open day held at the Stadium. Learned a lot, that I hope will come in useful for residents. Local children, including my son were also taught CPR and took part in a radio interview with a paramedic on teaching life saving skills in […]\nVPX (Victoria Park Experience)\nThe first VPX Widnes was a fantastic day. It’s been a great pleasure to have been part of assisting with it coming to Widnes. I hope this is the first of many. Well done to Karen and Vicky the PCSOs who ran with the idea to bring VPX to Widnes and spent hours organising it;Tony who […]",
  "http_andreawall_org_/http_andreawall_org_warm-home-discount-scheme/content_69.html": "People who are on Guaranteed Pension Credit should by now have received information on how to receive the £140 discount on their energy bills if their supplier is part of the Warm Home Discount Scheme.\nHowever, people on low incomes could also qualify for the £140 discount, if their supplier is part of the scheme and they meet the criteria set by their energy supplier. Details of how to apply are on this link.",
  "http_andreawall_org_/http_andreawall_org_kingsway-ward-litter-pick-saturday-2nd-march-2019/content_45.html": "I thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field and the Half Moon behind the stadium of litter, collecting nine bin bags full. We also got the sellotape off the bushes, as someone had bizarrely covered them in it. I will be contacting each of the kid’s head teachers to let them know how much hard work they put in today to tidy up their environment.",
  "http_andreawall_org_/http_andreawall_org/content_1.html": "Thank you for visiting my site. I consider it an honour to represent and serve the people of Kingsway Ward and Halton. I am a Labour Councillor, however, as a ward councillor, I represent people regardless of political views.\nI have built and created this site to keep people updated on what I am doing and what is going on in Kingsway, Widnes, Halton and the wider area. Your views and input are very important to me, please get in touch with them.\nBest wishes,\nAndrea Wall\nMy Story Contact Me Posts",
  "http_andreawall_org_/http_andreawall_org_mystory/content_64.html": "I am married to Ian and we have two children, my maiden name is Tiernan and I lived in West Bank, Widnes until I was five. I attended St Patrick’s nursery, St Bede’s and St Joseph’s schools in Widnes. I have spent the past 20 years running a small local family business with my husband and like many people in Widnes have also worked at ‘the GUS’.\nAlongside being a Kingsway Ward & Halton Councillor since December 2014, I work as Office Manager & Senior Caseworker to Derek Twigg MP and continue to help run a small local business with my husband.\nOn 6th May 2021 I was elected as a Councillor in the new Highfield Ward, as a result of the government’s boundary commission re-drawing the wards across Halton and splitting up the Kingsway Ward into different wards.\nI have lived in Widnes all of my life, I love our community and our area. I am passionate about trying to make the Highfield Ward, Widnes and Halton the very best they can be.\nOne of my main principles is fairness. I believe that our society should be much fairer, that your background and where you are from should not have a detrimental impact on your life chances, that hard work should be properly rewarded. I believe that it is our duty to look after the young, elderly and vulnerable in our community. I believe that one day we will achieve a fairer society.\nIn the meantime, I try my best to try to help make things better, solve issues for people if I can and try to protect our vulnerable in whatever way I can. I can’t always succeed but I will always try.\nThe work I do as a councillor is so varied that it is difficult to list it – from anti-social behaviour, litter, bollards, parking, alley gates, representing on planning issues, social care issues, housing, homelessness, to school governor, scrutiny of council policies, budgets, to name a few. If you can think of it, I’ve usually come across it.\nMy main research focus has gone into the devastating impact of changes to our Social Security system – from Bedroom Tax, changes to disability benefits, Universal Credit and the poverty that the changes are inflicting on low paid families and vulnerable people. As a result of the work and training I’ve undertaken in this area, I have strong links to Halton CAB and I am a Widnes Foodbank Voucher Issuer. I am fiercely against the current implementation of Universal Credit, I believe it is a terribly flawed system.\nOn a lighter note, in the last couple of years I have set up a community growing project charity, Widnes Growing Together. Through this project I aim to turn unused space into community growing spots to enable people to grow cheap, healthy food for themselves. The first site is coming along well. I believe in all communities having nearby access to green space, in particular areas that are classed as deprived.\nYou can also find details of some of the council meetings that I attend on Halton Borough Council’s website.",
  "http_andreawall_org_/http_andreawall_org_tag_vikings/content_47.html": "Lovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]",
  "http_andreawall_org_/http_andreawall_org_tag_widnes-golf-club/content_56.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]\nTag: Widnes Golf Club\nCllr Andrea Wall – Formal Objection to Planning Application Number: 20/00471/FUL\nI am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the Unitary Development Plan (UDP) and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition of the cars that […]\nWidnes Golf Club Green Space – OPPOSE building houses on it.\nI am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]",
  "http_andreawall_org_/http_andreawall_org_vpx-victoria-park-experience/content_118.html": "The first VPX Widnes was a fantastic day. It’s been a great pleasure to have been part of assisting with it coming to Widnes. I hope this is the first of many. Well done to Karen and Vicky the PCSOs who ran with the idea to bring VPX to Widnes and spent hours organising it;Tony who started it off in Warrington and brought his experience here to help Widnes VPX. Fantastic effort from all the local sports clubs, Halton Council’s Sports Development Team and Events Team, the Police, Fire Service, the Vikings, face painters, characters, all the volunteers and everyone else that put the effort in to make today happen.\nIt was lovely to see kids and families enjoying all the free activities on offer. I spent all day there and took along my 7 year old son who thoroughly enjoyed it.",
  "http_andreawall_org_/http_andreawall_org_tag_halton_page_2/content_131.html": "Share Tweet Email\nTag: Halton\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]\nOne Year Update and Happy New Year\nDear Resident, I’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016. Since being elected by residents last December and again in May I have been working hard to learn how to […]\nCreativity For Life!\nDear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]\nKingsway Together\nDear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]\nArea Forum Update – Trees for Kingsway Ward\nDear Resident, Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have […]\nKing George V Playing Fields & Frank Myler Sports and Recreation Ground\nDear Kingsway Ward Resident, I’ve had a few queries today about why there is fencing and work on going on a small part of the King George V Playing Fields by Foxley Heath. The work going on is to put in the sewerage outlet pipes for the new Victoria Gardens housing development on Liverpool Road. I’ve been advised […]\nOperation Granite – Motorbikes, Mini Motos and Anti Social Behaviour\nI wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]\nStewards Ave/Liverpool Rd Public Footpaths and Anti Social Behaviour\nToday I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue […]",
  "http_andreawall_org_/http_andreawall_org_update-on-village-green-application/content_31.html": "Derek Twigg MP has given me his eye witness statement in support of the application to have the green space (the Biggie) in the middle of the Kingsway Estate registered as a Village Green. It looks like X marks the spot on the photograph – they’re actually the paths.\nIt is already designated as green space, however, Village Green status gives further protections against any future development attempts in future years. The land is not currently at risk but it would do no harm to future proof it’s protection.\nKingsway Estate residents Past & Present could you help with providing statements of your use of the land over the decades or use that you have witnessed. Minimum twenty years proof that local people have took part in lawful sports and pastimes on the land is a requirement. Some examples are ad-hoc games – football, rugby, rounders, cricket etc, picnics, fetes, parties, dog walking, walking.\nI believe this land has been in use by local people since the late 1920s/early 1930s. The estate or scheme as it was called was designed around the principle of the large central communal green recreation area and the backs were allotment land.\nIf you could send your statements of how you have used or seen this land used lawfully by local residents over the years to andrea.wall@halton.gov.uk it would really assist in achieving Village Green status.",
  "http_andreawall_org_/http_andreawall_org_press-report-on-play-area-vandalism/content_123.html": "Report on the damage and clean up of Dundalk Road play area.\nhttp://www.liverpoolecho.co.uk/news/local-news/widnes-councillor-blasts-mindless-destruction-12408400\nUpdate: The soft surface will be repaired once the temperature rises a bit, as it doesn’t set properly if temperature is under 4 degrees when it is laid.",
  "http_andreawall_org_/http_andreawall_org_category_blog_page_6/content_148.html": "Dear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]\nBlog\nKingsway Together\nDear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]\nFrank Myler Pavilion – Official Opening and Fitness Classes\nThe official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]\nArea Forum Update – Trees for Kingsway Ward\nDear Resident, Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have […]\nWhat I do as a councillor\nDear Resident, I’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do. First and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings […]\nLaura Byrne RIP\nSadly Laura Byrne, who grew up in the Kingsway ward passed away on Thursday 17th September. Laura was 20 years old and tragically took her own life. I knew Laura and although troubled she was a lovely, gentle person, who had much to offer. She was a member of the Labour Party and worked tirelessly […]\nKingsway Ward Local Election May 2015\nI’ve been re-elected as a Labour councillor for the Kingsway Ward today and I am very grateful for the support that I have received during the election campaign and from the votes cast. I am thankful that the majority of Kingsway residents have put their trust in me and Labour again. This has been my second election within […]",
  "http_andreawall_org_/http_andreawall_org_national-dementia-awareness-week-17th-may-24th-may-2015/content_65.html": "News National Dementia Awareness Week 17th May – 24th May 2015 Posted on 26th March 201529th December 2017 Author Andrea Wall Comment(0) Share Tweet Email“Walk Down Memory Lane”",
  "http_andreawall_org_/http_andreawall_org_tag_kingsway/content_83.html": "I am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]\nTag: Kingsway\nAshley High School Visit\nThank you to Ashley High School Student Council for inviting me to attend their council meeting this morning to explain what I do as a councillor and a Question & Answer session – very interesting and challenging questions. Always a pleasure to go in to speak to the students and staff at Ashley High School. […]\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Spring Clean\nAround 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nWidnes sports centre to be named after rugby legend Frank Myler\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email\nArea Forum Tuesday 27 January 2015 6.30pm\nIn Halton, our main neighbourhood partnerships are called Area Forums. At Area Forum meetings, you can give your views, comments and concerns on local issues and priorities directly to the Council. They are a chance for you to make a real difference to your communities. You can also submit a question to Area Forums. Kingsway […]",
  "http_andreawall_org_/http_andreawall_org_widnes-golf-club-planning-application-objections/content_16.html": "Councillor Andrea Wall – Representation submitted 02.04.2020\nI am writing to formally object to any of the Green Space known as Widnes Golf\nClub being developed for housing. This land is designated as Green Space in\nthe UDP and in the Local Plan, it is on the already heavily congested Liverpool\nRoad and the addition of the cars that go with 255 properties would make the\ncongestion and resultant pollution worse in this area. There are hundreds of\nschool children that pass by this on school days and the increased traffic would\nbring increased risk to their safety. Already Leigh Avenue, Highfield Road,\nLower House Lane and Liverpool Road are regularly backed up with traffic, to\nadd more traffic would simply make the existing situation worse. The nearby\nprimary schools and two of the high schools are already hugely oversubscribed,\nadding more houses here would push existing residents out of a chance of a\nschool place at these schools. Due to this Green Space’s location, I believe\nany housing development of this land is uniquely placed to impact on existing\nresidents across the whole of Widnes.\nA housing development here would change the character of the area and lose\nus Green Space that we can ill afford to lose, alongside this would be the\ndestruction of trees, hedgerows and habitats for wildlife. I also have concerns\nregarding the flooding that regularly occurs on Liverpool Road. People who live\noff Liverpool Road and Leigh Avenue, such as in Foxley Heath, Three Crowns,\nHeath Road area and around the Ball O’Ditton, the Kingsway Estate area and\nthe Shakespeare Road area already regularly struggle to leave their roads to\nget on to the main roads, which I have personally witnessed. I have also\npersonally witnessed the difficulties in people leaving the Frank Myler\nPavilion/Ditton Primary School car park.\nI have concerns regarding the capacity of vital services in this area, such as\nGPs and dentists, the existing facilities in the area are already very busy.\nAs I work my way through the hundreds of pages of reports, I will be submitting\nfurther objections, but these are my starting points.\n1) As a ward councillor I have spoken to hundreds of people in the vicinity and\nnot one person has said they agree with this application. In the local area there\nis universal opposition to this application, the views of the local community\nshould be given much weight in the decision-making process, as it is the local\ncommunity that would have to live with the result should the development be\ngranted permission.\n2) When the Local Plan was out for Public Consultation, with this land\ndesignated as Green Space in it, over 1,000 representations went in to the\ncouncil from the local community supporting the Green Space Designation,\ntherefore it is clear what the local community’s views are.\n3) On page 9 of the Design and Access Statement of the application it states:\n“There are a large number of schools in the vicinity which have capacity to\naccommodate new pupils.”\nThis is simply not true, two out of the three local high school are hugely over\nsubscribed and the nearest primary schools, St Bede’s and Ditton Primary are\nalso over subscribed.\n4) On page 13 of the Design and Access Statement of the application it states:\n“To provide a mix of dwelling types that will satisfy local need and enhance the\nprofile of the area as a whole.” The majority of the houses proposed to be built\nare 4 bed+ houses there is not a local shortage of 4 bed+ houses in the private\nmarket sector. From local knowledge of other developments of this nature, it\ntends to be people moving into the local area that buy this type of housing, not\npeople that already live here, therefore it is not the case that there is local need.\nThe local community are clear that this development would not enhance the\narea at all, it would make the existing area worse.\n5) Page 13 of the Design and Access Statement also states: “To create a well informed attractive neighbourhood, not dominated by car.” Yet the application\nincludes 200% car parking and a garage for houses – meaning at least two cars\nper property, a huge addition to the already congested roads in the area.\n6) I note that nearly a quarter of the 25% ‘affordable’ housing would be in the\nform of 1 bedroom flats and none of the properties for market sale are flats it\nwould appear that the ‘affordable’ housing is being squashed into the smallest\nland space possible to maximise the space for full market houses, it is therefore\ndifficult to understand how nearly a quarter of the proposed ‘affordable’ housing\nare indistinguishable from the other housing, as quite clearly a block of flats is\nvery distinguishable from houses.\n7) I do not accept that the golf club have done their best to drive up membership\nor to encourage none members to pay to play golf there, I have seen no\nevidence of this whatsoever. Indeed, I believe the opposite to be true and this\nis in fact an attempt to ‘cash in’ on the land. Recent local press reports state\nthat the Golf Club are saying for them to continue in their present form they\nwould have to reduce down to members volunteering to run the course,\ntherefore there is clearly an option for them to continue.\n8) The municipal golf course will be re-opening as a nine-hole golf course with\nclub house facilities, therefore the proposed 9 hole golf course will not even be\nunique in the town of Widnes and is not an enhancement to this borough.\n9) This application constitutes a loss of Designated Green Space in this borough\nwith no replacement Green Space on offer whatsoever and indeed only the\nenhancement of another borough’s Greenspace on offer, this is unacceptable\nand in my view against the UDP and Local Plan.\nI will be writing and submitting further objections in the near future.\nKind regards,\nCllr Andrea Wall – Kingsway\nCouncillor Andrea Wall – Representation submitted 03.04.2020\nFollowing the submission of my first formal objection to this application I will\nnow turn to the application’s Planning Statement document, Halton’s Core\nStrategy, Halton’s Unitary Development Plan and Halton’s Local Plan.\nPage 5 of the Planning Statement states that there are four high schools\nwithin a half mile radius of the site, while technically this is true, one of these\nhigh schools, Ashley High School is a specialist education provision, specifically\nonly for pupils with a SEN/Autistic Spectrum Condition. Ormiston Chadwick has\nbeen over subscribed for the past two years and for the coming year was full\nby the time the distance from the school reached 1,231 metres. Wade Deacon\nhas been over subscribed for many years and for the coming year was full by\nthe time the distance from the school reached 1,605 metres.\nBelow my comments are in bold after each policy.\n2) Core Strategy Policy CS1: Halton’s Spatial Strategy states:\n“Brownfield Focus (beneficial and efficient use of existing sites) Outside of the\nKey Areas of Change, the re-use of previously developed land will be\nprioritised, notably where regenerating or bringing sites back into use will bring\nwider benefits to the Borough. Important green infrastructure within the urban\narea will be protected from detrimental development to ensure its value, both\nindividually and as part of a network, is retained.”\nThe Designated Green Space known as Widnes Golf Club is not one of\nthe Key Areas of Change. It is important green infrastructure within an\nurban area and must be protected to ensure its value, both individually\nand as part of the green network that runs through Spike Island, through\nLeigh Rec, through King George Playing Fields and onto the Golf Club is\nretained. It is intrinsic to the green network within Widnes.\n3) Core Strategy Policy CS3: Housing Supply and Locational Priorities\nHousing Requirement states:\n“A minimum of 9,930 net additional homes should be provided between 2010\nand 2028 at an average rate of 552 dwellings per annum.”\nThese figures have changed in the Local Plan (DALP) that was unanimously\npassed by full Council in August 2019 and is currently with the Planning\nInspectorate the new figures are below:\n“During the period 2014 to 2037 provision will be made for the development of at least 8,050 (net) additional dwellings a. At an average of 350 dwellings (net) each year”\nEnough housing supply land has been allocated in Halton to achieve\nthese housing figures, without building on this Green Space. The\nGovernment’s standard methodology calculation of Housing Need gives\na minimum requirement for Halton of 296 net new dwellings per annum,\ntherefore Halton’s plan exceeds the Government’s minimum requirement\nfor Halton.\n4) Core Strategy Policy CS7: Infrastructure Provision states:\n“Development should be located to maximise the benefit of existing\ninfrastructure and to minimise the need for new provision. Where new\ndevelopment creates or exacerbates deficiencies in infrastructure it will be\nrequired to ensure those deficiencies or losses are compensated for,\nadequately mitigated or substituted before development is begun or occupied.”\nThis Designated Green Space is bound by residential housing, a railway\nline and the very busy Liverpool Road (B5178), for a B road this road\nalready has huge volumes of traffic and is a main route across the town\nof Widnes. When it was partially closed for a number of weeks, there was\nchaos on the surrounding road network. Two further roads and three\nfurther openings on to this road, with the addition of approximately\nanother 500+ cars will detrimentally impact on the infrastructure and will\nexacerbate the deficiency that already exists. There is nothing that can be\ndone to change the B5178 in this location due to its proximity to existing\nhousing and no amount of Section 106 funds could mitigate the\ndetrimental impact on local residents.\n5) Core Strategy Policy CS12: Housing Mix states:\n“On sites of 10 or more dwellings, the mix of new property types delivered\nshould contribute to addressing identified needs as quantified in the most up to\ndate Strategic Housing Market Assessment, unless precluded by site specific\nconstraints, economic viability or prevailing neighbourhood characteristics.”\nThe Local Plan states the below:\n“The Mid-Mersey SHMA 2016 sets out the demographic need for different sizes\nof homes, identifying that the majority of market homes need to provide two or\nthree bedrooms, with more than 50% of homes being three bedroomed.”\nThe UDP states the below:\n“The housing type profile in Halton currently differs from the national pattern\nwith higher proportions of medium/large terraced houses and bungalows than\nelsewhere in the country. Consequently, there is under provision of other\ndwelling types, namely small terraced and detached homes and also to a\ncertain extent, flatted homes. Surveys demonstrate that the variety of bed\nspaces provided in homes across the Borough is comparable to other areas in\nthe country, but that residents’ aspirations are mostly for two and three\nbedroomed terraced and semi-detached properties.”\nThe majority of houses that this application proposes are 4 bedroom\ndetached houses, yet the need and aspiration in Halton is identified as\nbeing for 2 and 3 bedroom properties. There have already been many 4\nbedroom detached houses built in Widnes in the last decade or so, there\nis no local need for further properties of this type. I have checked on this\ndeveloper’s other sites and the minimum starting price for their 4\nbedroom detached houses is £251,000 and they range up to over\n£300,000. The average annual income of Halton residents is £28,000, even\nin dual income families this would be a mortgage multiplier of a minimum\nof 4.4. It is more social housing that we need to meet local people’s\nneeds, built on brownfield sites, not more 4 bedroom detached houses,\ntaking away Green Space.\n6) Core Strategy Policy CS13: Affordable Housing states:\n“Affordable housing units will be provided, in perpetuity, on schemes including\n10 or more dwellings (net gain) or 0.33 hectares or greater for residential\npurposes. Affordable housing provision will be sought at 25% of the total\nresidential units proposed. The Council will seek to secure 50% of new\nprovision as social and affordable rented tenures and 50% intermediate\nhousing tenures across the Borough.”\nThe minimum requirement of 25% ‘affordable’ housing is in the\napplication, however, nearly a quarter of the ‘affordable’ dwellings are in\nthe form of 1 bedroomed flats, there are no market rate flats in the\napplication, therefore a quarter of the affordable dwellings would be\ndistinguishable from the rest. In addition, I note that it is often the case\nthat developers return once they have received planning permission to\nstate that they can no longer build the ‘affordable’ dwellings promised as\nthe scheme is would not be viable (profitable) if they have to build them.\n7) Core Strategy Policy CS20: NATURAL AND HISTORIC ENVIRONMENT\nstates:\n“Halton’s natural and historic environments provide the Borough with a range\nof biological, geological and heritage assets which are not only of environmental\nvalue but provide a social and economic resource and ultimately contribute to\nthe character of the Borough’s landscapes. These assets should therefore be\nconserved and where possible enhanced for current and future generations and\nto ensure a strong sense of place and improve local distinctiveness.”\nThis designated Green Space is part of Halton’s natural and historic\nenvironment, it is located within the Mersey Community Forest and is the\nsite of a Deciduous Woodland. Quite clearly this development would\nresult in the loss of natural/heritage assets of landscape character, as the\nproposal is to build on it. Once done this could never be reversed and it\nis certainly not enhancing it for future generations, it is destroying it for\nfuture generations.\n8) Core Strategy Policy CS21: Green Infrastructure states:\n“Halton’s green infrastructure network will be protected, enhanced and\nexpanded, where appropriate. Halton Borough Council working alongside other\npartners and agencies responsible for the delivery and maintenance of green\ninfrastructure will achieve this through: Ensuring that new development\nmaximises opportunities to make provision for high quality and multifunctional\ngreen infrastructure taking account of deficiencies and the standards for green\nspace provision. Resisting the loss of green infrastructure where there are\nidentified deficiencies in provision.”\nThis application goes against this policy to protect, enhance and expand\nthe green infrastructure. This application would result in a substantial\nloss of green infrastructure. This Local Green Space is special to the\nlocal community as is demonstrated by the huge numbers that put in\nrepresentations supporting it retaining Green Space Designation when\nthe Local Plan went out to public consultation.\n9) Core Strategy Policy CS22: HEALTH AND WELL-BEING states:\n“Ensuring the Borough’s communities have good health and well-being is a\nmajor priority for Halton. Statistics show that health standards in Halton are\namongst the worst in the country and highlight that this is an aspect of life in the\nBorough in need of urgent improvement. It is essential that policies are put in\nplace that tackle the underlying causes of health problems in the Borough, and\nfacilitate the provision of healthy lifestyles and healthy environments for all.”\nThis application goes against this policy to facilitate healthy lifestyles and\nhealthy environments for all. The loss of such a huge amount of\nDesignated Green Space would have a negative impact on the healthy\nenvironment. In addition the number of additional people would put a\nstrain on already stretched health care resources in the vicinity, making\nit harder for existing residents to get things like GP appointments.\n10) Core Strategy Policy CS23: MANAGING POLLUTION AND RISK states:\n“Halton is affected by risk to its population, environment and buildings from a\nvariety of sources from both within and outside of the Borough. The domination\nof Halton’s past and current economy by industry has left a legacy of pollution,\nparticularly ground contamination which presents a physical and financial\nbarrier for development to overcome. Today, industrial processes in the\nBorough are carefully controlled through environmental legislation and permits\nto ensure that pollution is managed. In addition to these statutory processes it\nis important that the mechanisms available through planning processes are also\nused to minimise the effects of pollution on health and the environment.”\nThe addition of at least another 500 + cars in this area would increase the\npollution levels. Due to the legacy left by the chemical industry in Halton,\nit is all the more important to retain Designated Green Space in this area,\nthis land was originally owned by a chemical company, it is only right that\nit is retained as Designated Green Space for the local population, many\nof whom have had family members that have suffered ill health due to the\nlegacy of the chemical industry.\n1 UDP Policy GE6 PROTECTION OF DESIGNATED GREENSPACE\nstates:\n“ Development within designated and proposed greenspace, as defined on the\nProposals Map, will not be permitted unless it is ancillary to the enjoyment of\nthe greenspace or, in the case of designated greenspace in educational use, it\nis specifically required for educational purposes, in compliance with Policy GE8.\nExceptions may be made where the loss of the amenity value, which led to the\ndesignation of the site as greenspace, is adequately compensated for. Loss of\namenity value may be compensated for where either of the following criteria\ncan be satisfied:\na Development on part of the site would fund improvements that raise the\noverall amenity value of the greenspace, as measured against the criteria for\ndesignation of greenspace set out in the justification to this policy. In assessing\nwhether a proposal would raise the overall amenity value of the site,\nconsideration will also be given to the extent to which accessibility to and\nthrough the site, including linkages with other greenspaces, would be improved.\nb The developer provides a suitable replacement greenspace of at least equal\nsize and amenity value, or significantly enhances the amenity value of nearby\ngreenspace. In assessing whether a proposal would significantly improve the\namenity value of a nearby greenspace, consideration will be given to the extent\nto which the quality and accessibility of the space would be enhanced.\nc No proposal should result in a loss of amenity for local residents by forcing\nthem to travel to a less convenient location.\nd In all exceptional cases there would have to be clear and convincing reasons\nwhy development should be permitted or that loss of amenity value could be\nadequately compensated.”\na) This application goes against this policy. Building houses is not\nancillary to the enjoyment of the Green Space. The proposal does not\nraise the overall amenity value of this Designated Green Space, it severely\nreduces the size of the Green Space and the justifications for the policy\nclearly state that quantity of Green Space is a consideration. This land is\npart of a series of pieces of land that has a target of 30% Woodland Cover\nset by the Mersey Forest.\nOur environment faces serious challenges, ranging from climate change\nto habitat fragmentation, this application goes against the work being\ndone to improve our environment to ensure Halton plays its part in\ntackling the climate emergency.\nb) The developer is not providing suitable replacement Green Space of\nat least equal size or amenity value.\nc) This application seeks to remove an 18 hole course from this\nborough, replace it with a 9 hole golf course and invest in an existing 18\nhole golf course over the borough boundary. This is a loss of amenity for\nlocal residents, who will have to travel further and by car, increasing\npollution to their nearest 18 hole golf course.\nd) There are no clear and convincing reasons that this is an\nexceptional case or that it should be permitted, the loss of amenity value\nand Designated Green Space cannot be adequately compensated.\n12) UDP Policy GE8 DEVELOPMENT WITHIN DESIGNATED\nGREENSPACE states:\n“New buildings required for recreation and interpretative uses will be permitted\nwithin designated greenspace if their function is directly related and ancillary to\nthe use and enjoyment of the greenspace.”\nI have no objection to the Golf Club building a new club house, subject to\nit not interfering with the peaceable enjoyment of their neighbour’s\nproperties.\n13) UDP Policy GE10 PROTECTION OF LINKAGES IN GREENSPACE\nSYSTEMS states:\n“Greenspace systems, as defined on the Proposals Map, are networks of\ninterconnecting greenspaces, providing important visual, physical, functional\nand structural linkages. Development affecting a “greenspace system” will not\nbe permitted in the following circumstances:\na It would sever or unacceptably affect visual, physical, functional or structural\nlinkages within the system.\nb It would have an unacceptable effect on any part of the system, to the\ndetriment of the overall amenity of the system, measured in terms of visual\nimpact, impact on the landscape, impact on wildlife, and impact on the\nrecreational value of the system.\nc It would be detrimental to the objective of creating a network of interconnecting greenspaces.\nd It would break visual or cultural links with the historic use of the landscape.\ne It would impair the movement of people on foot, cycle or horse-back.\nf It would impair the colonisation or movement of flora or fauna.\ng It would cause a material reduction in a habitat whose characteristics are of\ndemonstrable value to the Greenspace System.\nh It would cause demonstrable harm to any protected speciees known to be\ndependent on the use of the affected part of the system for migration, breeding,\nfeeding or shelter.”\nThis application should not be permitted as it would create each of the\ncircumstances set out in A through to H, apart from E.\n14) UDP Policy GE12 PROTECTION OF OUTDOOR PLAYING SPACE FOR\nFORMAL SPORT AND RECREATION states:\n“Development that would result in the loss of outdoor playing space for formal\nsport and recreation, such as pitches, courts, greens and athletics tracks,\nwhether in public, private or educational use, will not be permitted unless one\nor more of the following criteria can be satisfied:\na A carefully quantified documented assessment of current and future needs\nfor the school/ educational establishment or local community, has\ndemonstrated that there is an excess of playing field provision and the site has\nno special significance to the interests of sport.\nb The existing facilities are of a poor quality and are underused and\ndevelopment on a small part of the playing space would fund improvements\nthat significantly enhance the quality of these facilities and enhance the\npotential for the increased usage of the site for outdoor sports and recreation,\nprovided that the development will not affect land forming part of a playing pitch,\nbowling green or tennis court, (outside a residential curtilage) including any\nsafety margins or the loss of any other sporting/ancillary facility on the site nor\nreduce the size of the site to an extent which restricted its reasonable use,\ntaking into account longer-term needs of the local community.\nc The developer provides a suitable replacement facility, at least equivalent in\nterms of quantity and quality, and which is in place prior to the existing site\nbeing lost.”\nNone of these criteria have been met, therefore this application should\nnot be permitted.\n15) UDP Policy GE26 PROTECTION OF HEDGEROWS states:\n“Development will not be permitted if it is likely to damage or destroy an existing\nhedgerow, either directly or indirectly, unless the importance of the proposed\ndevelopment can be shown to clearly outweigh both the amenity value and\nnature conservation value of the hedgerow.”\nThis application states that existing hedgerow will be destroyed, the\nproposed development’s importance does not clearly outweigh the\namenity value and nature conservation value of hedgerow.",
  "http_andreawall_org_/http_andreawall_org_litter-pick/content_63.html": "Despite the rain twelve bin bags of rubbish removed from Steward’s Brook today. Thank you to Michelle, Charlie and Alex for their help.\nDespite the rain twelve bin bags of rubbish removed from Steward’s Brook today. Thank you to Michelle, Charlie and Alex for their help.",
  "http_andreawall_org_/http_andreawall_org_tag_kingsway-ward/content_5.html": "I thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field […]\nTag: Kingsway Ward\nKingsway Ward Litter Pick – Saturday 2nd February 2019\nThank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice […]\nWidnes Royal British Legion & Royal Artillery Schools Poppy Appeal Awards\nProud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]\nWidnes Viking’s Golden Generation & Chemics Cafe\nLovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]\nKingsway Estate Security\nA Kingsway resident has just informed me that her son’s bike has been stolen from their back garden on the Kingsway Estate. It is a red/silver/orange Voodoo suspension bike and was stolen between 6pm and 7pm. Can people please keep an eye out for it. Additionally could people please keep the security gates on to […]\nUpdate on Village Green Application\nDerek Twigg MP has given me his eye witness statement in support of the application to have the green space (the Biggie) in the middle of the Kingsway Estate registered as a Village Green. It looks like X marks the spot on the photograph – they’re actually the paths. It is already designated as green […]\nVillage Green Application\nPreparing to apply to register the field in the middle of the Kingsway Estate as a Village Green to enable it to become an additionally protected space for residents with Village Green status. It is already designated as green space, however, Village Green status gives further protections against any future development attempts in future years. […]\nLong Loaf\nLovely time at my surgery at Long Loaf Community Lunch at St Paul’s community hall. Great meal and even a song from my friend Alan #communitymatters Share Tweet Email\nTemporary Dispersal Zone\nFollowing the damage to people’s vehicles in Kingsway Ward last night and ongoing anti social behaviour. On behalf of the ward, I today agreed to the police implementing a dispersal zone. The dispersal zone is now in place. This disgraceful behaviour is really affecting residents’ quality of life and must stop. Share Tweet Email\nKingsway Annual Spring Clean 2017\nShare Tweet Email",
  "http_andreawall_org_/http_andreawall_org_liverpool-road-works/content_117.html": "Dear Resident,\nA number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or so. Foxley Heath residents have asked that drivers please leave a gap for them to exit and enter their estate, as some drivers are not leaving a gap at the entrance to the estate which is leading to further back up of traffic.\nI have looked into what the situation is and below is the information I have received from the council’s Highways Department:\nThe works are Section 278 of the Highways Act works that are being carried out by Barratt Homes. The length of the Temporary Traffic Lights has been determined due to two areas where work is being carried out, which are at the extremes of the affected length. One of these is due to be completed very shortly and when this happens the lights will be shortened in length. The other area of works, which is by the entrance to the new development has approximately another week of work to complete. BT are working there and once they have completed their works, then the Tactile Paving, surfacing and lining etc can be finished. Council Officers have been out this morning to speak to them and they are actively pushing for an early completion.\nI will keep an eye on the situation and update you as I receive any further updates. I completely understand the frustration, as work is getting carried out in other areas too, which is further impacting on our journeys. Please do remember to leave a space for Foxley Heath residents to exit and enter their estate, many who are trying to turn right out of the estate or turn right into it are finding their path blocked by cars waiting at the temporary lights but not leaving a gap.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_widnes_page_3/content_44.html": "I’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area. I have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an […]\nTag: Widnes\nKingsway Ward Local Election May 2015\nI’ve been re-elected as a Labour councillor for the Kingsway Ward today and I am very grateful for the support that I have received during the election campaign and from the votes cast. I am thankful that the majority of Kingsway residents have put their trust in me and Labour again. This has been my second election within […]\nNational Dementia Awareness Week 17th May – 24th May 2015\n“Walk Down Memory Lane” Share Tweet Email\nKingsway Spring Clean\nAround 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nKingsway Ward Spring Clean\nI am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring. This is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and […]\nKingsway Ward Councillor Surgeries\nKingsway Ward councillor surgeries will take place at the following venues and times: Andrea (me) – Third Wednesday of each month 12.00pm – 1.00pm. St Paul’s Church Community Centre, Vicarage Road, Widnes. June and Margaret – first Thursday of each month 6.00pm – 7.00pm. Room 15 of Kingsway Learning Centre/Widnes Library. Our surgeries are for […]\nWidnes sports centre to be named after rugby legend Frank Myler\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_tag_councillor/content_25.html": "Dear Resident, I’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do. First and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings […]",
  "http_andreawall_org_/http_andreawall_org_author_cllr-andrea-wall_page_4/content_156.html": "Share Tweet Email\nAuthor: Andrea Wall\nPress Report on Play Area Vandalism\nReport on the damage and clean up of Dundalk Road play area. http://www.liverpoolecho.co.uk/news/local-news/widnes-councillor-blasts-mindless-destruction-12408400 Update: The soft surface will be repaired once the temperature rises a bit, as it doesn’t set properly if temperature is under 4 degrees when it is laid. Share Tweet Email\nCommunity Clean Up 2017\nA community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed […]\nPlay Area Clean Up\nMassive thank you to everybody that turned out today to give Dundalk Rd Play Area a clean up following it being set on fire and the toddler swings destroyed over Christmas. This play area is hugely important to the local community. We cleaned up the park and surrounding areas of litter and hope that the […]\nPlay Area Set on Fire\nSo angry at the damage caused to the play area at the top of Dundalk Road over Christmas. The play area is in Kingsway Ward as the ward goes right across to the boundary at Ditton Community Centre. There is no excuse for this mindless destructive behaviour, lots of families use this little play area. […]\nPolice in the Community\nGood to see the police giving out advice at the Stadium today, including the Nominated Neighbour cards. Share Tweet Email\nDistraction Burglary\nThere was a distraction burglary in Kingsway Ward last week. Look after our elderly and/or vulnerable neighbours with the Nominated Neighbour Scheme. It’s a card to encourage elderly/vulnerable people to not open their door to unknown people and to phone a trusted neighbour to check the person out for them. Cards are available at Widnes […]\nWidnes Growing Together Awards\nPress Report: A Widnes gardening project is celebrating after scooping another gong – this time with a big bag of cash to fund further development. Widnes Growing Together triumphed in Groundwork’s Bags Of Help contest funded by the Tesco 5p carrier bag charges hot on the heels of winning a Royal Horticultural Society award. The […]\nBulb Planting\nGreat working with Ashley School pupils today, planting 3000 flowering bulbs on the Kingsway Biggy. This is a project that I’ve been working on with the school since the Kingsway Together funding was achieved. The pupils worked really hard and our MP Derek Twigg, who grew up on the Kingsway Estate paid them a visit. […]\nNorth West Ambulance Day\nReally interesting and informative time today at the North West Ambulance Service Open day held at the Stadium. Learned a lot, that I hope will come in useful for residents. Local children, including my son were also taught CPR and took part in a radio interview with a paramedic on teaching life saving skills in […]",
  "http_andreawall_org_/http_andreawall_org_operation-granite-motorbikes-mini-motos-and-anti-social-behaviour/content_10.html": "I wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here.\nI’m really pleased that Widnes Police have this week announced an operation to target this dangerous anti social behaviour and that Kingsway Ward is one of the areas in Widnes that the police will be concentrating on. The police operation is known as Operation GRANITE and will run from Tuesday 21st July until Sunday 30th August 2015.\nYou can read the press reports on this operation here.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_category_myviews_page_3/content_138.html": "I’ve been re-elected as a Labour councillor for the Kingsway Ward today and I am very grateful for the support that I have received during the election campaign and from the votes cast. I am thankful that the majority of Kingsway residents have put their trust in me and Labour again. This has been my second election within […]\nMy Views\nHappy New Year\nI hope you all had a good Christmas, mine was good, a quiet one spent with my family. I wish you all a happy and healthy 2015 and I look forward to meeting more Kingsway ward residents and working as hard as I can for you. Please don’t hesitate to get in touch if you […]",
  "http_andreawall_org_/http_andreawall_org_tag_community_page_2/content_113.html": "Great time today at VPX Widnes. Free activities for the kids. It’s been great to provide support for this free event for the second year running, with Cllr Phil Harris. I’ve really enjoyed working with Kingsway’s PCSO Bowers on it. Pictured are Cllr Harris, Assistant Chief Constable Nick Bailey, PCSO Bowers and me. One person missing […]\nTag: Community\nLong Loaf\nLovely time at my surgery at Long Loaf Community Lunch at St Paul’s community hall. Great meal and even a song from my friend Alan #communitymatters Share Tweet Email\nWidnes & District Horticultural Society\nHad a lovely evening with Widnes Gardening Club – Widnes Horticultural Society. They’re looking to relaunch their annual Widnes show, hopefully at the Frank Myler Pavilion in Kingsway Ward and I’ve agreed to help them. They welcome new members of any age group to join them, lovely bunch of people. Share Tweet Email\nTemporary Dispersal Zone\nFollowing the damage to people’s vehicles in Kingsway Ward last night and ongoing anti social behaviour. On behalf of the ward, I today agreed to the police implementing a dispersal zone. The dispersal zone is now in place. This disgraceful behaviour is really affecting residents’ quality of life and must stop. Share Tweet Email\nKingsway Annual Spring Clean 2017\nShare Tweet Email\nCommunity Clean Up 2017\nA community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed […]\nPlay Area Clean Up\nMassive thank you to everybody that turned out today to give Dundalk Rd Play Area a clean up following it being set on fire and the toddler swings destroyed over Christmas. This play area is hugely important to the local community. We cleaned up the park and surrounding areas of litter and hope that the […]\nPlay Area Set on Fire\nSo angry at the damage caused to the play area at the top of Dundalk Road over Christmas. The play area is in Kingsway Ward as the ward goes right across to the boundary at Ditton Community Centre. There is no excuse for this mindless destructive behaviour, lots of families use this little play area. […]\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email",
  "http_andreawall_org_/http_andreawall_org_total-eclipse-of-the-sn/content_133.html": "Blog My Views Total Eclipse of The S*n Posted on 26th October 201729th December 2017 Author Andrea Wall Comment(0) Share Tweet EmailWith my son and Paul Collins flying the Total Eclipse of the S&n flag in Widnes today.",
  "http_andreawall_org_/http_andreawall_org_tag_the-aves/content_53.html": "Sadly Laura Byrne, who grew up in the Kingsway ward passed away on Thursday 17th September. Laura was 20 years old and tragically took her own life. I knew Laura and although troubled she was a lovely, gentle person, who had much to offer. She was a member of the Labour Party and worked tirelessly […]",
  "http_andreawall_org_/http_andreawall_org_springeaster-update-2016/content_54.html": "Dear Resident,\nIt’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press report on it here. It was really great to see the community spirit of people helping each other out.\nSadly on the same weekend someone in a jeep decided they wanted to tear up the big Kingsway field (The Biggy). You can read the press report on that here. This has been reported to the police who are investigating. This was hugely disappointing, not just because it is a real community asset but also as two local schools are due to start a project on the field in the next few months to make it more attractive and colourful for residents to enjoy. The Kingsway in Bloom and Wildflowers project that I have been working on with the schools and mentioned here is currently in the planning stages. I would urge anyone seeing people doing damage to the field or anywhere else to report it to the police using 101 or fill out the online anonymous Crime Stoppers form here. I really can’t stress how important reporting incidents is in terms of getting certain crimes/areas a higher priority for issues to be solved.\nOn a positive note, the gates and CCTV that were fitted on the footpaths between Stewards Avenue and Liverpool Road have so far been a huge success in tackling the anti social behaviour that was heavily impacting on residents lives. I’ve spoken to a number of residents who report that their quality of life has massively improved since they were installed. I’m really happy about that as everybody should be able to live peacefully and without fear; anti social behaviour is the opposite of that and really damagingly affects residents in our communities.\nAnti Social Behaviour brings me on to the off road bikes that continue to plague our area. Last week the vehicle barrier gate at the Milton Avenue/Stewards Avenue entrance to the playing fields, that I mentioned I was working on here was fitted. I am hopeful that this will help with the nuisance off road bikes by closing off one of the entrance/escape routes and also reduce the amount of fly tipping taking place in this area. As I pointed out about the damage to the field, please report incidents to the police using 101 or report anonymously online by filling in the Crime Stoppers form. The more incidents reported, the higher the priority given.\nI am still working on getting a Zebra Crossing fitted on the college side of Milton Road and hope to be able to give a full update on that in the near future.\nReviewing the issues that residents raise with me, I have noticed an increase in the amount of complaints regarding some of the ‘Kingsway Backs’, of particular concern is that a minority of individuals are allowing their dogs to use some of them as toilets and not clean up after them. This is not only disgusting behaviour, it is dangerous – in particular for children. Dogs should not be left unsupervised in the backs and their waste should be picked up by their owners; the backs are communal spaces and are for all the residents that live around each one. I am working with Halton Housing Trust who own these pieces of land to resolve this.\nOn a brighter note the fitness and sporting activities on offer at the Frank Myler Pavilion, which is in Kingsway Ward, continues to increase. There are also various activities, including a Lego Club on offer at the library. I also saw that a Swap Shop of Under 5s clothing now takes place at Kingsway Learning Centre on Friday morning, with free quality used under five children’s clothing in stock, there are also a number of children and adult activities and classes at Kingsway Learning Centre. I have started a Facebook Page to keep you updated of news and activities on offer in the ward, which you can find here.\nAs usual I have attended various council meetings as one of your representatives and continue to hold my drop in Ward Surgery on the Third Wednesday of each month at St Paul’s Community Centre, 12.00pm -1.00pm.\nAs always, if you have any queries or need any help contact me.\nI hope you have a lovely Easter.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_ashley-high-school-visit/content_37.html": "Thank you to Ashley High School Student Council for inviting me to attend their council meeting this morning to explain what I do as a councillor and a Question & Answer session – very interesting and challenging questions. Always a pleasure to go in to speak to the students and staff at Ashley High School. Love how their Student Council room is dedicated to Lord Jack Ashley, along with the school itself.",
  "http_andreawall_org_/http_andreawall_org_category_myviews_page_2/content_125.html": "Thoroughly enjoyed organising today’s Halton Labour show of support for Wear Red Day, showing racism the red card. #WRD17 Share Tweet Email\nMy Views\nPostal Workers Strike\nI support our posties in their battle to stop their pensions being slashed, to stop the worsening of their terms & conditions, achieve a pay rise and their attempts to protect our postal service. This is not just about a pay rise, this is ordinary working people standing up for themselves and their families. This […]\nMilitary Veterans & Families Wellbeing Symposium\nFor the second year running I had the privilege of representing Halton at the Military Veterans & Their Families’ Wellbeing Symposium. It was an honour to be invited alongside Military Veterans, delegates from the Royal British Legion, Combat Stress, Help the Heroes, serving armed forces representatives and NHS representatives. I learned a lot again this […]\nKingsway Trees\nHappy that the trees I’ve been working on getting planted on the Biggy have now been planted. Another six planted bringing it up to twelve so far. Share Tweet Email\nPlay Area Set on Fire\nSo angry at the damage caused to the play area at the top of Dundalk Road over Christmas. The play area is in Kingsway Ward as the ward goes right across to the boundary at Ditton Community Centre. There is no excuse for this mindless destructive behaviour, lots of families use this little play area. […]\nWidnes Growing Together\nI set up the charity Widnes Growing Together a few months back, with the aim of turning derelict green space into a Community Garden & Allotments site with full disability access. We have a growing number of volunteers and have come a long way in a few months. I put in a funding bid to […]\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nOne Year Update and Happy New Year\nDear Resident, I’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016. Since being elected by residents last December and again in May I have been working hard to learn how to […]\nWhat I do as a councillor\nDear Resident, I’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do. First and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings […]\nMini Motorbikes, Quad Bikes, off road vehicles and anti social behaviour\nI’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area. I have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an […]",
  "http_andreawall_org_/http_andreawall_org_formalobjectionwidnesgolfcourse2021/content_79.html": "I am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the Unitary Development Plan (UDP) and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition of the cars that go with 233 properties would make the congestion and resultant pollution worse in this area. There are hundreds of school children that pass by this on school days and the increased traffic would bring increased risk to their safety. Already Leigh Avenue, Highfield Road, Lower House Lane and Liverpool Road are regularly backed up with traffic, to add more traffic would simply make the existing situation worse. The nearby primary schools and two of the high schools are already hugely oversubscribed, adding more houses here would push existing residents out of a chance of a school place at these schools. Due to this Green Space’s location, I believe any housing development of this land is uniquely placed to impact on existing residents across the whole of Widnes.\nA housing development here would change the character of the area and lose us Green Space that we can ill afford to lose, alongside this would be the destruction of trees, hedgerows and habitats for wildlife. I also have concerns regarding the flooding that regularly occurs on Liverpool Road. People who live off Liverpool Road and Leigh Avenue, such as in Foxley Heath, Three Crowns, Heath Road area and around the Ball O’Ditton, the Kingsway Estate area and the Shakespeare Road area already regularly struggle to leave their roads to get on to the main roads, which I have personally witnessed. I have also personally witnessed the difficulties in people leaving the Frank Myler Pavilion/Ditton Primary School car park.\nI have concerns regarding the capacity of vital services in this area, such as GPs and dentists, the existing facilities in the area are already very busy.\n- As a ward councillor I have spoken to hundreds of people in the vicinity and not one person has said they agree with this application. In the local area there is universal opposition to this application, the views of the local community should be given much weight in the decision-making process, as it is the local community that would have to live with the result should the development be granted permission.\n- When the Local Plan was out for Public Consultation, with this land designated as Green Space in it, over 1,000 representations went in to the council from the community supporting the Green Space Designation, therefore it is clear what the local community’s views are.\n- On page 9 of the Design and Access Statement of the application it states: “There are a large number of schools in the vicinity which have capacity to accommodate new pupils.”\nThis is simply not true, two out of the three local high school are hugely over subscribed and the nearest primary schools, St Bede’s and Ditton Primary are also over subscribed.\n4. On page 13 of the Design and Access Statement of the application it states: “To provide a mix of dwelling types that will satisfy local need and enhance the profile of the area as a whole.”\nThe majority of the houses proposed to be built are 4 bed+ houses there is not a local shortage of 4 bed+ houses in the private market sector. From local knowledge of other developments of this nature, it tends to be people moving into the local area that buy this type of housing, not people that already live here. The local community are clear that this development would not enhance the area at all, it would make the existing area worse.\n5. Page 13 of the Design and Access Statement also states: “To create a well-informed attractive neighbourhood, not dominated by car.”\nYet the application includes 200% car parking and a garage for houses – meaning at least two cars per property, a huge addition to the already congested roads in the area.\n6. I note that nearly a quarter of the 25% ‘affordable’ housing would be in the form of 1 bedroom flats and none of the properties for market sale are flats it would appear that the ‘affordable’ housing is being squashed into the smallest land space possible to maximise the space for full market houses, it is therefore difficult to understand how at least a quarter of the proposed ‘affordable’ housing is indistinguishable from the other housing, as quite clearly a block of flats is very distinguishable from houses.\n7. I do not accept that the golf club have done their best to drive up membership or to encourage none members to pay to play golf there, I have seen no evidence of this whatsoever. Indeed, I believe the opposite to be true and this is in fact an attempt to ‘cash in’ on the land. Recent local press reports state that the Golf Club are saying for them to continue in their present form they would have to reduce down to members volunteering to run the course, therefore there is clearly an option for them to continue.\n8. The proposed 9 hole golf course is not an enhancement to this borough, it is a downgrading and a detriment to this borough.\n9. This application constitutes a loss of Designated Green Space in this borough with no replacement Green Space on offer whatsoever and indeed only the enhancement of another borough’s Green Space on offer, this is unacceptable and in my view against the UDP and the Local Plan.\nI will now turn to the application’s Planning Statement document, Halton’s Core Strategy, Halton’s Unitary Development Plan and Halton’s Local Plan.\n- The Planning Statement states that there are four high schools within a half mile radius of the site, while technically this is true, one of these high schools, Ashley High School is a specialist education provision, specifically only for pupils with a SEN/Autistic Spectrum Condition. Ormiston Chadwick has been over subscribed for the past two years and last year was full by the time the distance from the school reached 1,231 metres. Wade Deacon has been over subscribed for many years and last year was full by the time the distance from the school reached 1,605 metres.\n2. Core Strategy Policy CS1: Halton’s Spatial Strategy states:\n“Brownfield Focus (beneficial and efficient use of existing sites) Outside of the Key Areas of Change, the re-use of previously developed land will be prioritised, notably where regenerating or bringing sites back into use will bring wider benefits to the Borough. Important green infrastructure within the urban area will be protected from detrimental development to ensure its value, both individually and as part of a network, is retained.”\nThe Designated Green Space known as Widnes Golf Club is not one of the Key Areas of Change. It is important green infrastructure within an urban area and must be protected to ensure its value, both individually and as part of the green network that runs through Spike Island, through Leigh Rec, through King George Playing Fields and onto the Golf Club is retained. It is intrinsic to the green network within Widnes.\n3. Core Strategy Policy CS3: Housing Supply and Locational Priorities Housing Requirement states:\n“A minimum of 9,930 net additional homes should be provided between 2010 and 2028 at an average rate of 552 dwellings per annum.”\nThese figures have changed in the Local Plan (DALP) that was unanimously passed by full Council in August 2019 and is currently with the Planning Inspectorate the new figures are below:\n“During the period 2014 to 2037 provision will be made for the development of at least 8,050 (net) additional dwellings a. At an average of 350 dwellings (net) each year”\nEnough housing supply land has been allocated in Halton to achieve these housing figures, without building on this Green Space. The Government’s standard methodology calculation of Housing Need gives a minimum requirement for Halton of 296 net new dwellings per annum, therefore Halton’s plan exceeds the Government’s minimum requirement for Halton.\n4. Core Strategy Policy CS7: Infrastructure Provision states:\n“Development should be located to maximise the benefit of existing infrastructure and to minimise the need for new provision. Where new development creates or exacerbates deficiencies in infrastructure it will be required to ensure those deficiencies or losses are compensated for, adequately mitigated or substituted before development is begun or occupied.”\nThis Designated Green Space is bound by residential housing, a railway line and the very busy Liverpool Road (B5178), for a B road this road already has huge volumes of traffic and is a main route across the town of Widnes. When it was partially closed for a number of weeks, there was chaos on the surrounding road network. Two further road openings on to this road, with the addition of approximately another 500+ cars will detrimentally impact on the infrastructure and will exacerbate the deficiency that already exists. There is nothing that can be done to change the B5178 in this location due to its proximity to existing housing and no amount of Section 106 funds could mitigate the detrimental impact on local residents.\n5. Core Strategy Policy CS12: Housing Mix states:\n“On sites of 10 or more dwellings, the mix of new property types delivered should contribute to addressing identified needs as quantified in the most up to date Strategic Housing Market Assessment, unless precluded by site specific constraints, economic viability or prevailing neighbourhood characteristics.”\nThe Local Plan states the below:\n“The Mid-Mersey SHMA 2016 sets out the demographic need for different sizes of homes, identifying that the majority of market homes need to provide two or three bedrooms, with more than 50% of homes being three bedroomed.”\nThe UDP states the below:\n“The housing type profile in Halton currently differs from the national pattern with higher proportions of medium/large terraced houses and bungalows than elsewhere in the country. Consequently, there is under provision of other dwelling types, namely small terraced and detached homes and also to a certain extent, flatted homes. Surveys demonstrate that the variety of bed spaces provided in homes across the Borough is comparable to other areas in the country, but that residents’ aspirations are mostly for two and three bedroomed terraced and semi-detached properties.”\nThe majority of houses that this application proposes are 4 bedroom detached houses, yet the need and aspiration in Halton is identified as being for 2 and 3 bedroom properties. There have already been many 4 bedroom detached houses built in Widnes in the last decade or so, there is no local need for further properties of this type. I have checked on this developer’s other sites and the minimum starting price for their 4 bedroom detached houses is £251,000 and they range up to over £300,000. The average annual income of Halton residents is £28,000, even in dual income families this would be a mortgage multiplier of a minimum of 4.4. It is more social housing that we need to meet local people’s needs, built on brownfield sites, not more 4 bedroom detached houses, taking away Green Space.\n6. Core Strategy Policy CS13: Affordable Housing states:\n“Affordable housing units will be provided, in perpetuity, on schemes including 10 or more dwellings (net gain) or 0.33 hectares or greater for residential purposes. Affordable housing provision will be sought at 25% of the total residential units proposed. The Council will seek to secure 50% of new provision as social and affordable rented tenures and 50% intermediate housing tenures across the Borough.”\nThe minimum requirement of 25% ‘affordable’ housing is in the application, however, nearly a quarter of the ‘affordable’ dwellings are in the form of 1 bedroomed flats, there are no market rate flats in the application, therefore a quarter of the affordable dwellings would be distinguishable from the rest. In addition, I note that it is often the case that developers return once they have received planning permission to state that they can no longer build the ‘affordable’ dwellings promised as the scheme is would not be viable (profitable) if they have to build them.\n7. Core Strategy Policy CS20: NATURAL AND HISTORIC ENVIRONMENT states:\n“Halton’s natural and historic environments provide the Borough with a range of biological, geological and heritage assets which are not only of environmental value but provide a social and economic resource and ultimately contribute to the character of the Borough’s landscapes. These assets should therefore be conserved and where possible enhanced for current and future generations and to ensure a strong sense of place and improve local distinctiveness.”\nThis designated Green Space is part of Halton’s natural and historic environment, it is located within the Mersey Community Forest and is the site of a Deciduous Woodland. Quite clearly this development would result in the loss of natural/heritage assets of landscape character, as the proposal is to build on it. Once done this could never be reversed and it is certainly not enhancing it for future generations, it is destroying it for future generations.\n8. Core Strategy Policy CS21: Green Infrastructure states:\n“Halton’s green infrastructure network will be protected, enhanced and expanded, where appropriate. Halton Borough Council working alongside other partners and agencies responsible for the delivery and maintenance of green infrastructure will achieve this through: Ensuring that new development maximises opportunities to make provision for high quality and multifunctional green infrastructure taking account of deficiencies and the standards for green space provision. Resisting the loss of green infrastructure where there are identified deficiencies in provision.”\nThis application goes against this policy to protect, enhance and expand the green infrastructure. This application would result in a substantial loss of green infrastructure. This Local Green Space is special to the local community as is demonstrated by the huge numbers that put in representations supporting it retaining Green Space Designation when the Local Plan went out to public consultation.\n9. Core Strategy Policy CS22: HEALTH AND WELL-BEING states:\n“Ensuring the Borough’s communities have good health and well-being is a major priority for Halton. Statistics show that health standards in Halton are amongst the worst in the country and highlight that this is an aspect of life in the Borough in need of urgent improvement. It is essential that policies are put in place that tackle the underlying causes of health problems in the Borough, and facilitate the provision of healthy lifestyles and healthy environments for all.”\nThis application goes against this policy to facilitate healthy lifestyles and healthy environments for all. The loss of such a huge amount of Designated Green Space would have a negative impact on the healthy environment. In addition the number of additional people would put a strain on already stretched health care resources in the vicinity, making it harder for existing residents to get things like GP appointments. There is also a proven link between green space and trees helping with mental health.\n10. Core Strategy Policy CS23: MANAGING POLLUTION AND RISK states:\n“Halton is affected by risk to its population, environment and buildings from a variety of sources from both within and outside of the Borough. The domination of Halton’s past and current economy by industry has left a legacy of pollution, particularly ground contamination which presents a physical and financial barrier for development to overcome. Today, industrial processes in the Borough are carefully controlled through environmental legislation and permits to ensure that pollution is managed. In addition to these statutory processes it is important that the mechanisms available through planning processes are also used to minimise the effects of pollution on health and the environment.”\nThe addition of at least another 500 + cars in this area would increase the pollution levels. Due to the legacy left by the chemical industry in Halton, it is all the more important to retain Designated Green Space in this area, this land was originally owned by a chemical company, it is only right that it is retained as Designated Green Space for the local population, many of whom have had family members that have suffered ill health due to the legacy of the chemical industry.\n11. UDP Policy GE6 PROTECTION OF DESIGNATED GREENSPACE states:\n“ Development within designated and proposed greenspace, as defined on the Proposals Map, will not be permitted unless it is ancillary to the enjoyment of the greenspace or, in the case of designated greenspace in educational use, it is specifically required for educational purposes, in compliance with Policy GE8.\nExceptions may be made where the loss of the amenity value, which led to the designation of the site as greenspace, is adequately compensated for. Loss of amenity value may be compensated for where either of the following criteria can be satisfied:\na Development on part of the site would fund improvements that raise the overall amenity value of the greenspace, as measured against the criteria for designation of greenspace set out in the justification to this policy. In assessing whether a proposal would raise the overall amenity value of the site, consideration will also be given to the extent to which accessibility to and through the site, including linkages with other greenspaces, would be improved.\nb The developer provides a suitable replacement greenspace of at least equal size and amenity value, or significantly enhances the amenity value of nearby greenspace. In assessing whether a proposal would significantly improve the amenity value of a nearby greenspace, consideration will be given to the extent to which the quality and accessibility of the space would be enhanced.\nc No proposal should result in a loss of amenity for local residents by forcing them to travel to a less convenient location.\nd In all exceptional cases there would have to be clear and convincing reasons why development should be permitted or that loss of amenity value could be adequately compensated.”\nThis application goes against this policy. Building houses is not ancillary to the enjoyment of the Green Space. The proposal does not raise the overall amenity value of this Designated Green Space, it severely reduces the size of the Green Space and the justifications for the policy clearly state that quantity of Green Space is a consideration. This land is part of a series of pieces of land that has a target of 30% Woodland Cover set by the Mersey Forest.\nOur environment faces serious challenges, ranging from climate change to habitat fragmentation, this application goes against the work being done to improve our environment to ensure Halton plays its part in tackling the climate emergency.\n- The developer is not providing suitable replacement Green Space of at least equal size or amenity value.\n- This application seeks to remove an 18 hole course from this borough, replace it with a 9 hole golf course and invest in an existing 18 hole golf course over the borough boundary. This is a loss of amenity for local residents, who will have to travel further and by car, increasing pollution to their nearest 18 hole golf course.\n- There are no clear and convincing reasons that this is an exceptional case or that it should be permitted, the loss of amenity value and Designated Green Space cannot be adequately compensated.\n- 12. UDP Policy GE8 DEVELOPMENT WITHIN DESIGNATED GREENSPACE states:\n“New buildings required for recreation and interpretative uses will be permitted within designated greenspace if their function is directly related and ancillary to the use and enjoyment of the greenspace.”\nI have no objection to the Golf Club building a new club house, subject to it not interfering with the peaceable enjoyment of their neighbour’s properties.\n13. UDP Policy GE10 PROTECTION OF LINKAGES IN GREENSPACE SYSTEMS states:\n“Greenspace systems, as defined on the Proposals Map, are networks of interconnecting greenspaces, providing important visual, physical, functional and structural linkages. Development affecting a “greenspace system” will not be permitted in the following circumstances:\na It would sever or unacceptably affect visual, physical, functional or structural linkages within the system.\nb It would have an unacceptable effect on any part of the system, to the detriment of the overall amenity of the system, measured in terms of visual impact, impact on the landscape, impact on wildlife, and impact on the recreational value of the system.\nc It would be detrimental to the objective of creating a network of inter-connecting greenspaces.\nd It would break visual or cultural links with the historic use of the landscape.\ne It would impair the movement of people on foot, cycle or horse-back.\nf It would impair the colonisation or movement of flora or fauna.\ng It would cause a material reduction in a habitat whose characteristics are of demonstrable value to the Greenspace System.\nh It would cause demonstrable harm to any protected species known to be dependent on the use of the affected part of the system for migration, breeding, feeding or shelter.”\nThis application should not be permitted as it would create each of the circumstances set out in A through to H, apart from E.\n14. UDP Policy GE12 PROTECTION OF OUTDOOR PLAYING SPACE FOR FORMAL SPORT AND RECREATION states:\n“Development that would result in the loss of outdoor playing space for formal sport and recreation, such as pitches, courts, greens and athletics tracks, whether in public, private or educational use, will not be permitted unless one or more of the following criteria can be satisfied:\na A carefully quantified documented assessment of current and future needs for the school/ educational establishment or local community, has demonstrated that there is an excess of playing field provision and the site has no special significance to the interests of sport.\nb The existing facilities are of a poor quality and are underused and development on a small part of the playing space would fund improvements that significantly enhance the quality of these facilities and enhance the potential for the increased usage of the site for outdoor sports and recreation, provided that the development will not affect land forming part of a playing pitch, bowling green or tennis court, (outside a residential curtilage) including any safety margins or the loss of any other sporting/ancillary facility on the site nor reduce the size of the site to an extent which restricted its reasonable use, taking into account longer-term needs of the local community.\nc The developer provides a suitable replacement facility, at least equivalent in terms of quantity and quality, and which is in place prior to the existing site being lost.”\nNone of these criteria have been met, therefore this application should not be permitted.\n15. UDP Policy GE26 PROTECTION OF HEDGEROWS states:\n“Development will not be permitted if it is likely to damage or destroy an existing hedgerow, either directly or indirectly, unless the importance of the proposed development can be shown to clearly outweigh both the amenity value and nature conservation value of the hedgerow.”\nThis application states that existing hedgerow will be destroyed, the proposed development’s importance does not clearly outweigh the amenity value and nature conservation value of hedgerow.",
  "http_andreawall_org_/http_andreawall_org_category_blog/content_82.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]\nBlog\nWidnes Golf Club Planning Application Objections\nCouncillor Andrea Wall – Representation submitted 02.04.2020 I am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the UDP and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition […]\nWidnes Golf Club Green Space – OPPOSE building houses on it.\nI am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]\nAshley High School Visit\nThank you to Ashley High School Student Council for inviting me to attend their council meeting this morning to explain what I do as a councillor and a Question & Answer session – very interesting and challenging questions. Always a pleasure to go in to speak to the students and staff at Ashley High School. […]\nKingsway Ward Litter Pick – Saturday 2nd March 2019\nI thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field […]\nKingsway Ward Litter Pick – Saturday 16th February 2019\nThank you to Peter T, Charlie, Angela & Rachael for joining in today’s litter pick. We managed to do half of Kingsway, Leigh Ave, Frederick Street & Dickson Street. Four bin bags of litter collected, bit of exercise, fresh air and nice chats with people. Share Tweet Email\nWidnes Cemetery and Dogs\nI’ve had some residents contact me recently that are finding a minority of people using Widnes Cemetery to walk dogs upsetting. While I understand that some people might walk their dogs in the cemetery and also be paying their respects at a resting place, dogs (apart from assistance dogs) are not allowed in the cemetery. […]\nKingsway Ward Litter Pick – Saturday 2nd February 2019\nThank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice […]\nWidnes Royal British Legion & Royal Artillery Schools Poppy Appeal Awards\nProud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]\nAidan’s Christmas Carol Fundraiser\nI had a lovely time at Aidansteddybearchallenge Christmas Carol Fundraiser tonight. It is always a pleasure to see Aidan and his mum Caroline. Fantastic young man and family. I put my wish on the Christmas tree, Aidan’s Tree of Memories & Christmas Wishes – for peace and for people not to be in poverty. Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_category_blog_page_2/content_103.html": "Lovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]\nBlog\nSanta Dash 2017\nGreat time taking part in Halton Haven’s Santa Dash today. Hopefully a lot of money raised for our local hospice by the many participants! Share Tweet Email\nUniversal Credit\nHalton has been a Universal Credit full service area since July 2016. Cllr Andrea Wall (Kingsway) has long been a campaigning, vociferous critic of the system. Cllr Wall recently moved the HBC motion calling on the government to stop their roll out of Universal Credit to other areas, which was unanimously carried by the council. Today […]\nWarm Home Discount Scheme\nPeople who are on Guaranteed Pension Credit should by now have received information on how to receive the £140 discount on their energy bills if their supplier is part of the Warm Home Discount Scheme. However, people on low incomes could also qualify for the £140 discount, if their supplier is part of the scheme […]\nKingsway Estate Security\nA Kingsway resident has just informed me that her son’s bike has been stolen from their back garden on the Kingsway Estate. It is a red/silver/orange Voodoo suspension bike and was stolen between 6pm and 7pm. Can people please keep an eye out for it. Additionally could people please keep the security gates on to […]\nUpdate on Village Green Application\nDerek Twigg MP has given me his eye witness statement in support of the application to have the green space (the Biggie) in the middle of the Kingsway Estate registered as a Village Green. It looks like X marks the spot on the photograph – they’re actually the paths. It is already designated as green […]\nVillage Green Application\nPreparing to apply to register the field in the middle of the Kingsway Estate as a Village Green to enable it to become an additionally protected space for residents with Village Green status. It is already designated as green space, however, Village Green status gives further protections against any future development attempts in future years. […]\nArriva Bus Strikes\nI was on the Unite Arriva bus workers picket line at the St Helen’s bus depot from 7am for couple of hours before work this morning. Thanks to the Widnes resident bus drivers for inviting me. The last thing the bus drivers and staff want to do is cause disruption to the public. However, withdrawing […]\nTotal Eclipse of The S*n\nWith my son and Paul Collins flying the Total Eclipse of the S&n flag in Widnes today. Share Tweet Email\nShow Racism the Red Card\nThoroughly enjoyed organising today’s Halton Labour show of support for Wear Red Day, showing racism the red card. #WRD17 Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_category_blog_green-space/content_90.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]\nGreen Space\nWidnes Golf Club Planning Application Objections\nCouncillor Andrea Wall – Representation submitted 02.04.2020 I am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the UDP and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition […]\nWidnes Golf Club Green Space – OPPOSE building houses on it.\nI am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]",
  "http_andreawall_org_/http_andreawall_org_tag_halton/content_76.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]\nTag: Halton\nWidnes Golf Club Green Space – OPPOSE building houses on it.\nI am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]\nAshley High School Visit\nThank you to Ashley High School Student Council for inviting me to attend their council meeting this morning to explain what I do as a councillor and a Question & Answer session – very interesting and challenging questions. Always a pleasure to go in to speak to the students and staff at Ashley High School. […]\nKingsway Ward Litter Pick – Saturday 2nd March 2019\nI thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field […]\nKingsway Ward Litter Pick – Saturday 2nd February 2019\nThank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice […]\nWidnes Royal British Legion & Royal Artillery Schools Poppy Appeal Awards\nProud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]\nWidnes Viking’s Golden Generation & Chemics Cafe\nLovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]\nCommunity Clean Up 2017\nA community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed […]\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nLiverpool Road Works\nDear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]",
  "http_andreawall_org_/http_andreawall_org_author_cllr-andrea-wall_page_6/content_155.html": "Dear Resident, I’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016. Since being elected by residents last December and again in May I have been working hard to learn how to […]\nAuthor: Andrea Wall\nCreativity For Life!\nDear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]\nKingsway Together\nDear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]\nFrank Myler Pavilion – Official Opening and Fitness Classes\nThe official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]\nArea Forum Update – Trees for Kingsway Ward\nDear Resident, Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have […]\nWhat I do as a councillor\nDear Resident, I’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do. First and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings […]\nLaura Byrne RIP\nSadly Laura Byrne, who grew up in the Kingsway ward passed away on Thursday 17th September. Laura was 20 years old and tragically took her own life. I knew Laura and although troubled she was a lovely, gentle person, who had much to offer. She was a member of the Labour Party and worked tirelessly […]\nKing George V Playing Fields & Frank Myler Sports and Recreation Ground\nDear Kingsway Ward Resident, I’ve had a few queries today about why there is fencing and work on going on a small part of the King George V Playing Fields by Foxley Heath. The work going on is to put in the sewerage outlet pipes for the new Victoria Gardens housing development on Liverpool Road. I’ve been advised […]\nOperation Granite – Motorbikes, Mini Motos and Anti Social Behaviour\nI wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]\nStewards Ave/Liverpool Rd Public Footpaths and Anti Social Behaviour\nToday I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue […]",
  "http_andreawall_org_/http_andreawall_org_tag_council/content_24.html": "Skip to content\nSaturday, May 03, 2025\nCllr Andrea Wall\nHighfield Ward, Widnes, Halton\nMy Story\nContact Me\nCommunity\nMy Views\nNews\nHighfield Ward\nSocial Media\nGallery\nHighfield Ward Resident Survey\nSearch for:\nTag:\ncouncil\nCommunity\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nLoading Comments...\nWrite a Comment...\nEmail (Required)\nName (Required)\nWebsite",
  "http_andreawall_org_/http_andreawall_org_tag_ashley-high-school/content_121.html": "Thank you to Ashley High School Student Council for inviting me to attend their council meeting this morning to explain what I do as a councillor and a Question & Answer session – very interesting and challenging questions. Always a pleasure to go in to speak to the students and staff at Ashley High School. […]",
  "http_andreawall_org_/http_andreawall_org_author_cllr-andrea-wall/content_106.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]\nAuthor: Andrea Wall\nCllr Andrea Wall – Formal Objection to Planning Application Number: 20/00471/FUL\nI am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the Unitary Development Plan (UDP) and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition of the cars that […]\nWidnes Golf Club Planning Application Objections\nCouncillor Andrea Wall – Representation submitted 02.04.2020 I am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the UDP and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition […]\nWidnes Golf Club Green Space – OPPOSE building houses on it.\nI am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]\nAshley High School Visit\nThank you to Ashley High School Student Council for inviting me to attend their council meeting this morning to explain what I do as a councillor and a Question & Answer session – very interesting and challenging questions. Always a pleasure to go in to speak to the students and staff at Ashley High School. […]\nKingsway Ward Litter Pick – Saturday 2nd March 2019\nI thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field […]\nKingsway Ward Litter Pick – Saturday 16th February 2019\nThank you to Peter T, Charlie, Angela & Rachael for joining in today’s litter pick. We managed to do half of Kingsway, Leigh Ave, Frederick Street & Dickson Street. Four bin bags of litter collected, bit of exercise, fresh air and nice chats with people. Share Tweet Email\nWidnes Cemetery and Dogs\nI’ve had some residents contact me recently that are finding a minority of people using Widnes Cemetery to walk dogs upsetting. While I understand that some people might walk their dogs in the cemetery and also be paying their respects at a resting place, dogs (apart from assistance dogs) are not allowed in the cemetery. […]\nKingsway Ward Litter Pick – Saturday 2nd February 2019\nThank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice […]\nWidnes Royal British Legion & Royal Artillery Schools Poppy Appeal Awards\nProud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]",
  "http_andreawall_org_/http_andreawall_org_kingsway-together/content_91.html": "Dear Resident,\nGood News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group of Kingsway Together.\nResidents, community groups, schools and other organisations can apply for up to a maximum of £2000 per project, maximum two projects. The criteria is that the project must benefit Kingsway Ward Residents or the Kingsway Ward itself. There are some other basic criteria, such as the budget cannot fund on going costs.\nDuring the next week, application forms will be delivered to every home in the Kingsway Ward, they’re also available to collect from Widnes Library, Kingsway Learning Centre, the Stadium, Riverside College and the Healthcare Resource Centre. Information will be available to be viewed on the Police & Crime Commissioner’s Website. You can also download an application form by clicking on the below button.\nThe closing date for applications is Friday 20th November 2015, then between Monday 14th December 2015 and Monday 21st December 2015, Kingsway Ward residents will be asked to vote on which projects they want to be funded from Kingsway Together, so it will be entirely in your hands. There is more information on the below poster and a map showing the ward boundaries.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_police/content_60.html": "Dear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]",
  "http_andreawall_org_/http_andreawall_org_tag_dementia-awareness/content_34.html": "News National Dementia Awareness Week 17th May – 24th May 2015 “Walk Down Memory Lane” Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_tag_sport/content_18.html": "A sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_category_blog_page_4/content_157.html": "Report on the damage and clean up of Dundalk Road play area. http://www.liverpoolecho.co.uk/news/local-news/widnes-councillor-blasts-mindless-destruction-12408400 Update: The soft surface will be repaired once the temperature rises a bit, as it doesn’t set properly if temperature is under 4 degrees when it is laid. Share Tweet Email\nBlog\nCommunity Clean Up 2017\nA community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed […]\nPlay Area Clean Up\nMassive thank you to everybody that turned out today to give Dundalk Rd Play Area a clean up following it being set on fire and the toddler swings destroyed over Christmas. This play area is hugely important to the local community. We cleaned up the park and surrounding areas of litter and hope that the […]\nPlay Area Set on Fire\nSo angry at the damage caused to the play area at the top of Dundalk Road over Christmas. The play area is in Kingsway Ward as the ward goes right across to the boundary at Ditton Community Centre. There is no excuse for this mindless destructive behaviour, lots of families use this little play area. […]\nPolice in the Community\nGood to see the police giving out advice at the Stadium today, including the Nominated Neighbour cards. Share Tweet Email\nDistraction Burglary\nThere was a distraction burglary in Kingsway Ward last week. Look after our elderly and/or vulnerable neighbours with the Nominated Neighbour Scheme. It’s a card to encourage elderly/vulnerable people to not open their door to unknown people and to phone a trusted neighbour to check the person out for them. Cards are available at Widnes […]\nWidnes Growing Together Awards\nPress Report: A Widnes gardening project is celebrating after scooping another gong – this time with a big bag of cash to fund further development. Widnes Growing Together triumphed in Groundwork’s Bags Of Help contest funded by the Tesco 5p carrier bag charges hot on the heels of winning a Royal Horticultural Society award. The […]\nBulb Planting\nGreat working with Ashley School pupils today, planting 3000 flowering bulbs on the Kingsway Biggy. This is a project that I’ve been working on with the school since the Kingsway Together funding was achieved. The pupils worked really hard and our MP Derek Twigg, who grew up on the Kingsway Estate paid them a visit. […]\nNorth West Ambulance Day\nReally interesting and informative time today at the North West Ambulance Service Open day held at the Stadium. Learned a lot, that I hope will come in useful for residents. Local children, including my son were also taught CPR and took part in a radio interview with a paramedic on teaching life saving skills in […]\nWidnes Growing Together\nI set up the charity Widnes Growing Together a few months back, with the aim of turning derelict green space into a Community Garden & Allotments site with full disability access. We have a growing number of volunteers and have come a long way in a few months. I put in a funding bid to […]",
  "http_andreawall_org_/http_andreawall_org_kingsway-annual-spring-clean-2017/content_81.html": "Blog Community Kingsway Annual Spring Clean 2017 Posted on 1st March 201729th December 2017 Author Andrea Wall Comment(0) Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_author_cllr-andrea-wall_page_3/content_153.html": "Thoroughly enjoyed organising today’s Halton Labour show of support for Wear Red Day, showing racism the red card. #WRD17 Share Tweet Email\nAuthor: Andrea Wall\nPostal Workers Strike\nI support our posties in their battle to stop their pensions being slashed, to stop the worsening of their terms & conditions, achieve a pay rise and their attempts to protect our postal service. This is not just about a pay rise, this is ordinary working people standing up for themselves and their families. This […]\nMilitary Veterans & Families Wellbeing Symposium\nFor the second year running I had the privilege of representing Halton at the Military Veterans & Their Families’ Wellbeing Symposium. It was an honour to be invited alongside Military Veterans, delegates from the Royal British Legion, Combat Stress, Help the Heroes, serving armed forces representatives and NHS representatives. I learned a lot again this […]\nVPX (Victoria Park Experience) Year Two\nGreat time today at VPX Widnes. Free activities for the kids. It’s been great to provide support for this free event for the second year running, with Cllr Phil Harris. I’ve really enjoyed working with Kingsway’s PCSO Bowers on it. Pictured are Cllr Harris, Assistant Chief Constable Nick Bailey, PCSO Bowers and me. One person missing […]\nLong Loaf\nLovely time at my surgery at Long Loaf Community Lunch at St Paul’s community hall. Great meal and even a song from my friend Alan #communitymatters Share Tweet Email\nKingsway Trees\nHappy that the trees I’ve been working on getting planted on the Biggy have now been planted. Another six planted bringing it up to twelve so far. Share Tweet Email\nWidnes & District Horticultural Society\nHad a lovely evening with Widnes Gardening Club – Widnes Horticultural Society. They’re looking to relaunch their annual Widnes show, hopefully at the Frank Myler Pavilion in Kingsway Ward and I’ve agreed to help them. They welcome new members of any age group to join them, lovely bunch of people. Share Tweet Email\nWidnes Growing Together Update\nA little compilation of our site from the start to the current day. We’ve had set backs, we’ve won a RHS Award, we beat off stiff competition to win the top prize in the Tesco Bags of Help funding. The poly tunnel and communal shed are next on the list. Some of the plot holders, […]\nLitter Pick\nDespite the rain twelve bin bags of rubbish removed from Steward’s Brook today. Thank you to Michelle, Charlie and Alex for their help. Share Tweet Email\nTemporary Dispersal Zone\nFollowing the damage to people’s vehicles in Kingsway Ward last night and ongoing anti social behaviour. On behalf of the ward, I today agreed to the police implementing a dispersal zone. The dispersal zone is now in place. This disgraceful behaviour is really affecting residents’ quality of life and must stop. Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_widnes-growing-together/content_108.html": "I set up the charity Widnes Growing Together a few months back, with the aim of turning derelict green space into a Community Garden & Allotments site with full disability access. We have a growing number of volunteers and have come a long way in a few months.\nI put in a funding bid to the Tesco Bags of Help Scheme back in June and I’m happy to announce that WGT has been successfully shortlisted in the top three projects in our region, meaning a minimum of £8000 funding for the project. This will make a huge difference to how quickly we can do the things we want to achieve.\nWGT along with the other two successful projects in our region will go forward to a public vote in Tesco stores with their customers deciding the outcome. The public will be able to vote as many times as they shop for their favourite project in local Tesco stores from 31st October 2016 to 13th November 2016. The project with the highest number of votes across the region will receive £12,000, the second placed project £10,000 and the third placed project £8,000.\nAbsolutely made up and hope you will nip down and vote for Widnes Growing Together from 31st October.",
  "http_andreawall_org_/http_andreawall_org_universal-credit/content_105.html": "Halton has been a Universal Credit full service area since July 2016.\nCllr Andrea Wall (Kingsway) has long been a campaigning, vociferous critic of the system. Cllr Wall recently moved the HBC motion calling on the government to stop their roll out of Universal Credit to other areas, which was unanimously carried by the council.\nToday she is campaigning in Liverpool with her Unite the Union branch against the planned roll out to other areas, including Liverpool, calling on the government to stop the Universal Credit roll out.\nCllr Andrea Wall said, “The damage that Universal Credit has done to job seekers, low paid working families and the disabled in Halton has absolutely horrified me. The government urgently need to listen and stop the roll out before more people are left destitute for weeks on end and more hard working families are left beaten down and demoralised by this government’s abject failure of a system. The Universal Credit system is deeply and inherently flawed.”",
  "http_andreawall_org_/http_andreawall_org_widnes-growing-together-launched/content_136.html": "Press report on Widnes Growing Together:\n“A gardening scheme is being launched in Widnes with the aim of nurturing green-fingered skills and community spirit.\nWidnes Growing Together has been set up by Kingsway councillor Andrea Wall to foster neighbourhood pride, improve the environment, give residents the chance to enter ‘In Bloom’ competitions and to enable to them to make friends while learning how to create lush greenery and flower arrangements.\nOther goals include reducing social isolation, providing learning opportunities for young people, encouraging participants from different ages and backgrounds to work together and to take part in physical activity.\nCllr Wall said research had proven that gardening benefits health and wellbeing.\nHer two fellow trustees are the Reverend Greg Sharples and Cllr Phil Harris.\nCllr Wall said: “Widnes Growing Together will be a charitable organisation firmly rooted in the community.\n“Along with my fellow trustees I am really excited about this project as amongst the proven benefits of community gardening are better health, knowledge, improving our own environment, meeting people and community spirit.\n“Doctors in some areas are beginning to prescribe gardening as a means of reducing social isolation, improving physical health and improving mental health.\n“Gardening and growing are also a life skill that children are starting to be taught again.\n“I’d like to see our communities getting involved in the various ‘In Bloom’ competitions that are run every year, growing their own produce and flowers.\n“I believe anybody can benefit from community based gardening.\n“However, this can only work with the backing of the local community. This is a brand new project and we welcome any ideas and advice from the community.”\nTo take part call Cllr Wall on 07795 390 979 or email andrea.wall@halton.gov.uk\nhttp://www.liverpoolecho.co.uk/incoming/neighbourhoods-gardening-project-launched-widnes-11417738",
  "http_andreawall_org_/http_andreawall_org_vpx-victoria-park-experience-year-two/content_88.html": "Great time today at VPX Widnes. Free activities for the kids. It’s been great to provide support for this free event for the second year running, with Cllr Phil Harris. I’ve really enjoyed working with Kingsway’s PCSO Bowers on it.\nPictured are Cllr Harris, Assistant Chief Constable Nick Bailey, PCSO Bowers and me. One person missing is Tony ‘Kemik’ Spruce, he was too modest to be photographed, however, VPX was his original idea. He has been running the hugely successful VPX in Warrington for years. Luckily for us he wanted a VPX in his home town too and PCSO Graham took up the challenge last year, followed by PCSO Bowers this year, both assisted by Tony. I’m hopeful that VPX Widnes will become a yearly fixture and hopefully rival Warrington’s in a friendly way of course.",
  "http_andreawall_org_/http_andreawall_org_tag_blog_page_2/content_89.html": "Sadly Laura Byrne, who grew up in the Kingsway ward passed away on Thursday 17th September. Laura was 20 years old and tragically took her own life. I knew Laura and although troubled she was a lovely, gentle person, who had much to offer. She was a member of the Labour Party and worked tirelessly […]\nTag: Blog\nKing George V Playing Fields & Frank Myler Sports and Recreation Ground\nDear Kingsway Ward Resident, I’ve had a few queries today about why there is fencing and work on going on a small part of the King George V Playing Fields by Foxley Heath. The work going on is to put in the sewerage outlet pipes for the new Victoria Gardens housing development on Liverpool Road. I’ve been advised […]\nOperation Granite – Motorbikes, Mini Motos and Anti Social Behaviour\nI wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]\nStewards Ave/Liverpool Rd Public Footpaths and Anti Social Behaviour\nToday I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue […]\nMini Motorbikes, Quad Bikes, off road vehicles and anti social behaviour\nI’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area. I have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an […]\nKingsway Ward Local Election May 2015\nI’ve been re-elected as a Labour councillor for the Kingsway Ward today and I am very grateful for the support that I have received during the election campaign and from the votes cast. I am thankful that the majority of Kingsway residents have put their trust in me and Labour again. This has been my second election within […]\nNational Dementia Awareness Week 17th May – 24th May 2015\n“Walk Down Memory Lane” Share Tweet Email\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nKingsway Ward Spring Clean\nI am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring. This is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and […]\nKingsway Ward Councillor Surgeries\nKingsway Ward councillor surgeries will take place at the following venues and times: Andrea (me) – Third Wednesday of each month 12.00pm – 1.00pm. St Paul’s Church Community Centre, Vicarage Road, Widnes. June and Margaret – first Thursday of each month 6.00pm – 7.00pm. Room 15 of Kingsway Learning Centre/Widnes Library. Our surgeries are for […]",
  "http_andreawall_org_/http_andreawall_org_tag_planning/content_23.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]",
  "http_andreawall_org_/http_andreawall_org_what-i-do-as-a-councillor/content_59.html": "Dear Resident,\nI’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do.\nFirst and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings per week, average length of meeting is two hours. I spend a couple of hours a night reading through various reports and researching resident issues. I’m also a Local Education Authority appointed School Governor, which involves quite a bit of training to stay up to date with government changes and attending meetings regarding the running of the school. I hold a monthly ward residents’ surgery on the third Wednesday of each month 12.30pm – 1.30pm at St Paul’s Community Centre, where residents advise me of any issues that they may be having. However, most of my work with residents comes via the telephone or by email. I’ve missed two council committee meetings since my election, one due to illness and one due to it clashing with my son’s seventh birthday tea. On average I spend around 25 – 30 hours a week on councillor related duties.\nThe work I have carried out to help residents that have approached me is wide ranging and in the main of a confidential nature. The work includes helping to stop anti-social behaviour, fly tipping removal, housing complaints, parking complaints, supporting residents suffering with bedroom tax, supporting residents facing eviction because of bedroom tax by supporting them in court, assisting elderly residents who feel isolated to attend groups to get them out of the house, representing residents on planning issues and lots of other issues. I act as an advocate for residents with numerous agencies, including council departments. I mostly do home visits to work out exactly what I may be able to do to assist and sometimes these home visits can be distressing, as due to the austerity inflicted on our area by the Tories, some of our vulnerable residents are really suffering. I cannot work miracles but I always do my best.\nDue to being a Kingsway Ward Councillor, I am also a Halton Borough Councillor and involved in decisions affecting the whole borough. The budget cuts inflicted on our area by the Tories are horrendous, it’s no surprise to me that Halton has moved in to the top twenty most deprived areas, according to this report. Since 2010, when the Tories and Lib Dems entered a coalition Halton has lost £46 million in central government grant funding, a cut of 45%. You can read some detail here http://www.haltonchamber.co.uk/news/budget.html.\nCouncil Tax accounts for only 12% of the council’s budget in Halton (see below chart), so we feel the cuts inflicted on us by the Tories far more deeply as an area, than more affluent areas.\nI became a councillor because I want to help people, which I believe I am achieving as residents that I have assisted have thanked me and quite a few stay in touch with me. Being a councillor can be very rewarding when you get a good result for the person/family that you are assisting or the ward/borough; it can also be distressing when you come across the many victims of this government and trying to set the council budget to try to protect services and our most vulnerable people is to be frank, a soul destroying task.\nI love working with residents and meeting you, other parts of being a councillor are far more difficult but I will always do my best.\nAs always if you have any queries or need any help contact me.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_gallery_nggallery_slideshow/content_135.html": "Skip to content\nSaturday, May 03, 2025\nCllr Andrea Wall\nHighfield Ward, Widnes, Halton\nMy Story\nContact Me\nCommunity\nMy Views\nNews\nHighfield Ward\nSocial Media\nGallery\nHighfield Ward Resident Survey\nSearch for:\nGallery\n[View Images as thumbnails]\nShare\nTweet\nEmail",
  "http_andreawall_org_/http_andreawall_org_tag_poppy-appeal/content_19.html": "Proud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]",
  "http_andreawall_org_/http_andreawall_org_area-forum-tuesday-27-january-2015-6-30pm/content_28.html": "In Halton, our main neighbourhood partnerships are called Area Forums. At Area Forum meetings, you can give your views, comments and concerns on local issues and priorities directly to the Council. They are a chance for you to make a real difference to your communities. You can also submit a question to Area Forums.\nKingsway ward is part of the Appleton, Kingsway & Riverside Area Forum and the next meeting will take place on Tuesday 27th January at 6.30pm in the Karalius Suite, Halton Select Stadium.\nThe agenda and minutes for previous meetings can be found here.\nPlease come along and share your views.\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_golden-generation/content_32.html": "Lovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]",
  "http_andreawall_org_/http_andreawall_org_area-forum-update-trees-for-kingsway-ward/content_110.html": "Dear Resident,\nKingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have been allocated to things like alley gating to improve the security of residents, Community Skip Scheme, outdoor furniture for the Fellowship Centre, extra litter bins, helping a local dance troupe, community sports equipment for the new Frank Myler Sports & Recreation Ground, which is in our ward, and a number of other projects.\nI’m pleased to let you know that, using Kingsway Area Forum funds, six semi mature trees have been ordered and are soon to be planted on ‘The Biggy’, the big green square in the middle of the Kingsway Estate. The trees chosen are Crataegus Oxycantha (Paul’s Scarlet). The tree is a Hawthorn that grows to form a dense rounded crown up to 10 metres tall, with dark green leaves and when in flower, clusters of double red flowers. Please see below photographs of fully grown examples.\nThe benefits of trees in communities are well known, they’re good for the environment, can make an area look more attractive, provide habitat for wildlife and improve the sense of well being of residents, amongst many other benefits. It is hoped that we will be able to achieve more in the future to make this large patch of green space a more attractive area for local residents to enjoy.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_author_cllr-andrea-wall_page_7/content_142.html": "I’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area. I have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an […]\nAuthor: Andrea Wall\nKingsway Ward Local Election May 2015\nI’ve been re-elected as a Labour councillor for the Kingsway Ward today and I am very grateful for the support that I have received during the election campaign and from the votes cast. I am thankful that the majority of Kingsway residents have put their trust in me and Labour again. This has been my second election within […]\nNational Dementia Awareness Week 17th May – 24th May 2015\n“Walk Down Memory Lane” Share Tweet Email\nKingsway Spring Clean\nAround 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nKingsway Ward Spring Clean\nI am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring. This is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and […]\nKingsway Ward Councillor Surgeries\nKingsway Ward councillor surgeries will take place at the following venues and times: Andrea (me) – Third Wednesday of each month 12.00pm – 1.00pm. St Paul’s Church Community Centre, Vicarage Road, Widnes. June and Margaret – first Thursday of each month 6.00pm – 7.00pm. Room 15 of Kingsway Learning Centre/Widnes Library. Our surgeries are for […]\nWidnes sports centre to be named after rugby legend Frank Myler\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email\nArea Forum Tuesday 27 January 2015 6.30pm\nIn Halton, our main neighbourhood partnerships are called Area Forums. At Area Forum meetings, you can give your views, comments and concerns on local issues and priorities directly to the Council. They are a chance for you to make a real difference to your communities. You can also submit a question to Area Forums. Kingsway […]\nHappy New Year\nI hope you all had a good Christmas, mine was good, a quiet one spent with my family. I wish you all a happy and healthy 2015 and I look forward to meeting more Kingsway ward residents and working as hard as I can for you. Please don’t hesitate to get in touch if you […]",
  "http_andreawall_org_/http_andreawall_org_santa-dash-2017/content_85.html": "Great time taking part in Halton Haven’s Santa Dash today. Hopefully a lot of money raised for our local hospice by the many participants!\nGreat time taking part in Halton Haven’s Santa Dash today. Hopefully a lot of money raised for our local hospice by the many participants!",
  "http_andreawall_org_/http_andreawall_org_category_blog_page_3/content_150.html": "I support our posties in their battle to stop their pensions being slashed, to stop the worsening of their terms & conditions, achieve a pay rise and their attempts to protect our postal service. This is not just about a pay rise, this is ordinary working people standing up for themselves and their families. This […]\nBlog\nMilitary Veterans & Families Wellbeing Symposium\nFor the second year running I had the privilege of representing Halton at the Military Veterans & Their Families’ Wellbeing Symposium. It was an honour to be invited alongside Military Veterans, delegates from the Royal British Legion, Combat Stress, Help the Heroes, serving armed forces representatives and NHS representatives. I learned a lot again this […]\nVPX (Victoria Park Experience) Year Two\nGreat time today at VPX Widnes. Free activities for the kids. It’s been great to provide support for this free event for the second year running, with Cllr Phil Harris. I’ve really enjoyed working with Kingsway’s PCSO Bowers on it. Pictured are Cllr Harris, Assistant Chief Constable Nick Bailey, PCSO Bowers and me. One person missing […]\nLong Loaf\nLovely time at my surgery at Long Loaf Community Lunch at St Paul’s community hall. Great meal and even a song from my friend Alan #communitymatters Share Tweet Email\nKingsway Trees\nHappy that the trees I’ve been working on getting planted on the Biggy have now been planted. Another six planted bringing it up to twelve so far. Share Tweet Email\nWidnes & District Horticultural Society\nHad a lovely evening with Widnes Gardening Club – Widnes Horticultural Society. They’re looking to relaunch their annual Widnes show, hopefully at the Frank Myler Pavilion in Kingsway Ward and I’ve agreed to help them. They welcome new members of any age group to join them, lovely bunch of people. Share Tweet Email\nWidnes Growing Together Update\nA little compilation of our site from the start to the current day. We’ve had set backs, we’ve won a RHS Award, we beat off stiff competition to win the top prize in the Tesco Bags of Help funding. The poly tunnel and communal shed are next on the list. Some of the plot holders, […]\nLitter Pick\nDespite the rain twelve bin bags of rubbish removed from Steward’s Brook today. Thank you to Michelle, Charlie and Alex for their help. Share Tweet Email\nTemporary Dispersal Zone\nFollowing the damage to people’s vehicles in Kingsway Ward last night and ongoing anti social behaviour. On behalf of the ward, I today agreed to the police implementing a dispersal zone. The dispersal zone is now in place. This disgraceful behaviour is really affecting residents’ quality of life and must stop. Share Tweet Email\nKingsway Annual Spring Clean 2017\nShare Tweet Email",
  "http_andreawall_org_/http_andreawall_org_tag_rights/content_104.html": "I was on the Unite Arriva bus workers picket line at the St Helen’s bus depot from 7am for couple of hours before work this morning. Thanks to the Widnes resident bus drivers for inviting me. The last thing the bus drivers and staff want to do is cause disruption to the public. However, withdrawing […]",
  "http_andreawall_org_/http_andreawall_org_widnes-sports-centre-to-be-named-after-rugby-legend-frank-myler/content_98.html": "A sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article",
  "http_andreawall_org_/http_andreawall_org_gallery/content_36.html": "Skip to content\nSaturday, May 03, 2025\nCllr Andrea Wall\nHighfield Ward, Widnes, Halton\nMy Story\nContact Me\nCommunity\nMy Views\nNews\nHighfield Ward\nSocial Media\nGallery\nHighfield Ward Resident Survey\nSearch for:\nGallery\n[Watch as Slideshow]\nShare\nTweet\nEmail",
  "http_andreawall_org_/http_andreawall_org_kingsway-ward-local-election-may-2015/content_122.html": "I’ve been re-elected as a Labour councillor for the Kingsway Ward today and I am very grateful for the support that I have received during the election campaign and from the votes cast. I am thankful that the majority of Kingsway residents have put their trust in me and Labour again. This has been my second election within 5 months and I have really enjoyed meeting many residents during this time. I intend and hope to meet many more of you over the next four years.\nThe results for Kingsway Ward were as follows:\nLabour (Me): 2,126\nUKIP: 424\nConservatives: 303\nI am elected to represent all Kingsway Ward residents. I will work as hard as I can for you and the area as part of your Labour team for Kingsway, alongside June and Margaret.\nPlease don’t hesitate to get in touch with any issues that you may have or ideas for the Kingsway Ward/the wider Halton area. That’s what I’m here for.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_cllr-andrea-wall/content_33.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]\nTag: Cllr Andrea Wall\nWidnes Golf Club Green Space – OPPOSE building houses on it.\nI am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]\nAshley High School Visit\nThank you to Ashley High School Student Council for inviting me to attend their council meeting this morning to explain what I do as a councillor and a Question & Answer session – very interesting and challenging questions. Always a pleasure to go in to speak to the students and staff at Ashley High School. […]\nKingsway Ward Litter Pick – Saturday 2nd March 2019\nI thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field […]\nKingsway Ward Litter Pick – Saturday 2nd February 2019\nThank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice […]\nWidnes Royal British Legion & Royal Artillery Schools Poppy Appeal Awards\nProud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]",
  "http_andreawall_org_/http_andreawall_org_community-clean-up-2017/content_107.html": "A community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed on the Great British Spring Clean website:\nhttp://www.greatbritishspringclean.org.uk/eventdetails/2706…\nOn the same day, I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged by the Kingsway Ward Councillors.\nThe Spring Clean Skip Scheme and Litter Pick event last year and the year before were very successful and I’m hoping this year will be even better.\nThe Skip Scheme is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and provides you with the opportunity to get rid of any household items including wood, garden waste, soil, scrap metal, bricks or rubble, hard plastics and small electrical items that you may have. The skips will be at the Stadium, Squires Avenue and Simms Cross School on Saturday 18th March from 8am until 12pm.",
  "http_andreawall_org_/http_andreawall_org_widnes-growing-together-update/content_114.html": "A little compilation of our site from the start to the current day. We’ve had set backs, we’ve won a RHS Award, we beat off stiff competition to win the top prize in the Tesco Bags of Help funding. The poly tunnel and communal shed are next on the list.\nSome of the plot holders, including the Widnes Wonders WI have started work on their plots. Local school OCA (Bankfield), who are plot holders are making our raised beds for the communal garden section. The Chief Fire Officer of Cheshire, Paul Hancock paid us a visit today and was very impressed.\nIn short this patch of derelict land is back in community use and I’m made up to see people enjoying it. Thank you to everybody that has helped to get us this far in particular Phil Harris and Barbara Wright, who have been there from the start.",
  "http_andreawall_org_/http_andreawall_org_north-west-ambulance-day/content_151.html": "Really interesting and informative time today at the North West Ambulance Service Open day held at the Stadium. Learned a lot, that I hope will come in useful for residents. Local children, including my son were also taught CPR and took part in a radio interview with a paramedic on teaching life saving skills in schools.",
  "http_andreawall_org_/http_andreawall_org_category_community_page_3/content_112.html": "Great to see this work underway in a neglected Kingsway Back that Halton Housing Trust own. Residents reported problems to me, I met with Tommy from HHT on Monday and work is underway within the week to rectify the problems for residents. #partnership Share Tweet Email\nCommunity\nAshley School Council\nReally enjoyed attending the meeting of Ashley School’s School Council today. Really enthusiastic young people, some tough & really interesting questions from them. The School Council unanimously voted that I can attend again after half term for more pupil questions. Great initiatives going on at the school. Share Tweet Email\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]\nCreativity For Life!\nDear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]\nKingsway Together\nDear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]\nLaura Byrne RIP\nSadly Laura Byrne, who grew up in the Kingsway ward passed away on Thursday 17th September. Laura was 20 years old and tragically took her own life. I knew Laura and although troubled she was a lovely, gentle person, who had much to offer. She was a member of the Labour Party and worked tirelessly […]\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email",
  "http_andreawall_org_/http_andreawall_org_temporary-dispersal-zone/content_43.html": "Following the damage to people’s vehicles in Kingsway Ward last night and ongoing anti social behaviour. On behalf of the ward, I today agreed to the police implementing a dispersal zone. The dispersal zone is now in place. This disgraceful behaviour is really affecting residents’ quality of life and must stop.",
  "http_andreawall_org_/http_andreawall_org_widnes-district-horticultural-society/content_130.html": "Had a lovely evening with Widnes Gardening Club – Widnes Horticultural Society. They’re looking to relaunch their annual Widnes show, hopefully at the Frank Myler Pavilion in Kingsway Ward and I’ve agreed to help them.\nThey welcome new members of any age group to join them, lovely bunch of people.",
  "http_andreawall_org_/http_andreawall_org_widnes-vikings-golden-generation-chemics-cafe/content_87.html": "Lovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by and try it out, great group of people.\nThe Chemics Cafe is on the first Wednesday of each month at the stadium 11.00am – 12.30pm and is a relaxed place for people with Alzheimer’s and their carers to meet up, make friends and socialise. Details here https://www.c-i-c.co.uk/chemicscafe\nThe Golden Generation, a free Widnes supporters social club for the over 55s meets every Friday afternoon in the Stadium 2.30pm – 4.30pm to share their Widnes memories and socialise. Details here:\nhttp://www.widnesvikings.co.uk/…/share-your-memories-at-gol…\nhttp://www.widnesvikings.co.uk/…/share-your-memories-at-gol…\nBest wishes,Andrea",
  "http_andreawall_org_/http_andreawall_org_tag_loose/content_20.html": "Dear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]",
  "http_andreawall_org_/http_andreawall_org_tag_the-studio/content_46.html": "Dear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]",
  "http_andreawall_org_/http_andreawall_org_laura-byrne-rip/content_73.html": "Sadly Laura Byrne, who grew up in the Kingsway ward passed away on Thursday 17th September. Laura was 20 years old and tragically took her own life. I knew Laura and although troubled she was a lovely, gentle person, who had much to offer. She was a member of the Labour Party and worked tirelessly for the party in the run up to the General Election. When we’d meet up she’d tell me that her dream was to work for the good of her community, had she lived I believe that she would have fulfilled that ambition.\nLaura’s 23 year old sister has been left to pay for and organise her funeral. Residents of The Aves have rallied together, like the loving community they are, to raise the money to lay Laura to rest. Children in The Aves are washing cars and doing gardening, adults have done bucket collections in local pubs and they have set up an online donation page which at the time of writing has raised £773.00 in two days.\nThe Aves are really doing Laura and themselves proud as a community. I’ve spoken to some of the organisers and they are not only doing this to raise money for the funeral, their aim is to raise awareness about what is left behind when anyone commits suicide, in particular a young person.\nI wish Laura had been able to see how much she was valued and I hope she is at peace now.\nThis is a very sad time but seeing the strong community spirit in The Aves makes me extra proud to represent them as one of their councillors.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_category_news_page_2/content_137.html": "Dear Kingsway Ward Resident, I’ve had a few queries today about why there is fencing and work on going on a small part of the King George V Playing Fields by Foxley Heath. The work going on is to put in the sewerage outlet pipes for the new Victoria Gardens housing development on Liverpool Road. I’ve been advised […]\nNews\nOperation Granite – Motorbikes, Mini Motos and Anti Social Behaviour\nI wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]\nStewards Ave/Liverpool Rd Public Footpaths and Anti Social Behaviour\nToday I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue […]\nNational Dementia Awareness Week 17th May – 24th May 2015\n“Walk Down Memory Lane” Share Tweet Email\nKingsway Spring Clean\nAround 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\nKingsway Ward Spring Clean\nI am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring. This is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and […]\nKingsway Ward Councillor Surgeries\nKingsway Ward councillor surgeries will take place at the following venues and times: Andrea (me) – Third Wednesday of each month 12.00pm – 1.00pm. St Paul’s Church Community Centre, Vicarage Road, Widnes. June and Margaret – first Thursday of each month 6.00pm – 7.00pm. Room 15 of Kingsway Learning Centre/Widnes Library. Our surgeries are for […]\nWidnes sports centre to be named after rugby legend Frank Myler\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email\nArea Forum Tuesday 27 January 2015 6.30pm\nIn Halton, our main neighbourhood partnerships are called Area Forums. At Area Forum meetings, you can give your views, comments and concerns on local issues and priorities directly to the Council. They are a chance for you to make a real difference to your communities. You can also submit a question to Area Forums. Kingsway […]",
  "http_andreawall_org_/http_andreawall_org_play-area-clean-up/content_11.html": "Massive thank you to everybody that turned out today to give Dundalk Rd Play Area a clean up following it being set on fire and the toddler swings destroyed over Christmas. This play area is hugely important to the local community.\nWe cleaned up the park and surrounding areas of litter and hope that the culprits will see how much the community values this area and hope they start treating it with respect.\nBig thanks to Caroline & Aidan, Keiron, Lauren, Peter & children and Phil for giving up their time.",
  "http_andreawall_org_/http_andreawall_org_kingsway-ward-councillor-surgeries/content_140.html": "Kingsway Ward councillor surgeries will take place at the following venues and times:\nAndrea (me) – Third Wednesday of each month 12.00pm – 1.00pm. St Paul’s Church Community Centre, Vicarage Road, Widnes.\nJune and Margaret – first Thursday of each month 6.00pm – 7.00pm. Room 15 of Kingsway Learning Centre/Widnes Library.\nOur surgeries are for Kingsway Ward residents to come along and raise any issues that they might have with their councillors – Margaret Horabin, June Roberts and myself. No appointment is necessary. You can also contact us by phone or email if you prefer.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_motorbikes/content_3.html": "I wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]",
  "http_andreawall_org_/http_andreawall_org_tag_budget/content_61.html": "Dear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]",
  "http_andreawall_org_/http_andreawall_org_happy-new-year/content_102.html": "I hope you all had a good Christmas, mine was good, a quiet one spent with my family.\nI wish you all a happy and healthy 2015 and I look forward to meeting more Kingsway ward residents and working as hard as I can for you. Please don’t hesitate to get in touch if you need me or have any questions for me.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_2015/content_17.html": "I hope you all had a good Christmas, mine was good, a quiet one spent with my family. I wish you all a happy and healthy 2015 and I look forward to meeting more Kingsway ward residents and working as hard as I can for you. Please don’t hesitate to get in touch if you […]",
  "http_andreawall_org_/http_andreawall_org_tag_blog/content_8.html": "Dear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]\nTag: Blog\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]\nOne Year Update and Happy New Year\nDear Resident, I’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016. Since being elected by residents last December and again in May I have been working hard to learn how to […]\nCreativity For Life!\nDear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]\nKingsway Together\nDear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]\nFrank Myler Pavilion – Official Opening and Fitness Classes\nThe official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]\nArea Forum Update – Trees for Kingsway Ward\nDear Resident, Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have […]\nWhat I do as a councillor\nDear Resident, I’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do. First and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings […]",
  "http_andreawall_org_/http_andreawall_org_category_myviews/content_93.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]\nMy Views\nCllr Andrea Wall – Formal Objection to Planning Application Number: 20/00471/FUL\nI am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the Unitary Development Plan (UDP) and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition of the cars that […]\nWidnes Golf Club Planning Application Objections\nCouncillor Andrea Wall – Representation submitted 02.04.2020 I am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the UDP and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition […]\nWidnes Golf Club Green Space – OPPOSE building houses on it.\nI am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]\nWidnes Cemetery and Dogs\nI’ve had some residents contact me recently that are finding a minority of people using Widnes Cemetery to walk dogs upsetting. While I understand that some people might walk their dogs in the cemetery and also be paying their respects at a resting place, dogs (apart from assistance dogs) are not allowed in the cemetery. […]\nUniversal Credit\nHalton has been a Universal Credit full service area since July 2016. Cllr Andrea Wall (Kingsway) has long been a campaigning, vociferous critic of the system. Cllr Wall recently moved the HBC motion calling on the government to stop their roll out of Universal Credit to other areas, which was unanimously carried by the council. Today […]\nUpdate on Village Green Application\nDerek Twigg MP has given me his eye witness statement in support of the application to have the green space (the Biggie) in the middle of the Kingsway Estate registered as a Village Green. It looks like X marks the spot on the photograph – they’re actually the paths. It is already designated as green […]\nVillage Green Application\nPreparing to apply to register the field in the middle of the Kingsway Estate as a Village Green to enable it to become an additionally protected space for residents with Village Green status. It is already designated as green space, however, Village Green status gives further protections against any future development attempts in future years. […]\nArriva Bus Strikes\nI was on the Unite Arriva bus workers picket line at the St Helen’s bus depot from 7am for couple of hours before work this morning. Thanks to the Widnes resident bus drivers for inviting me. The last thing the bus drivers and staff want to do is cause disruption to the public. However, withdrawing […]\nTotal Eclipse of The S*n\nWith my son and Paul Collins flying the Total Eclipse of the S&n flag in Widnes today. Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_frank-myler-pavilion-official-opening-and-fitness-classes/content_13.html": "The official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015.\nIt was a great Community Fun Day with lots of free activities for all the family to enjoy.\nWhile there I was talking to some of the Sports Development Team about the fitness classes that have been launched there. There are number of classes already available, including Yoga, Pilates, Zumba, Fitsteps and Insanity. I’ve included the current timetable below. (Please check with the Sports Development Team for up to date information) The team advised me that if you have an interest in a class that isn’t already available, they will try to put it on for you, if there is enough interest. You can do this by calling into the Pavilion or by telephoning 0151 511 8550 or emailing fmenquiries@halton.gov.uk\nI hope that the Frank Myler Pavilion and Sports & Recreation Grounds become a much used and loved community sports facility and I think it is a great addition to the Kingsway Ward and the whole town.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_social-media/content_4.html": "Skip to content\nSaturday, May 03, 2025\nCllr Andrea Wall\nHighfield Ward, Widnes, Halton\nMy Story\nContact Me\nCommunity\nMy Views\nNews\nHighfield Ward\nSocial Media\nGallery\nHighfield Ward Resident Survey\nSearch for:\nSocial Media\nPowered by Juicer\nShare\nTweet\nEmail",
  "http_andreawall_org_/http_andreawall_org_tag_halton-labour/content_12.html": "Dear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nTag: Halton Labour\nKingsway Together\nDear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]\nFrank Myler Pavilion – Official Opening and Fitness Classes\nThe official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]",
  "http_andreawall_org_/http_andreawall_org_tag_area-forum/content_86.html": "Dear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nTag: Area Forum\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nArea Forum Update – Trees for Kingsway Ward\nDear Resident, Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have […]\nStewards Ave/Liverpool Rd Public Footpaths and Anti Social Behaviour\nToday I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue […]\nKingsway Ward Spring Clean\nI am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring. This is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and […]\nArea Forum Tuesday 27 January 2015 6.30pm\nIn Halton, our main neighbourhood partnerships are called Area Forums. At Area Forum meetings, you can give your views, comments and concerns on local issues and priorities directly to the Council. They are a chance for you to make a real difference to your communities. You can also submit a question to Area Forums. Kingsway […]",
  "http_andreawall_org_/http_andreawall_org_21st-march-kingsway-ward-spring-clean-update/content_101.html": "Community 21st March Kingsway Ward Spring Clean Update Posted on 3rd March 201529th December 2017 Author Andrea Wall Comment(0) Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_tag_roadworks/content_109.html": "Dear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]",
  "http_andreawall_org_/http_andreawall_org_village-green-application/content_22.html": "Preparing to apply to register the field in the middle of the Kingsway Estate as a Village Green to enable it to become an additionally protected space for residents with Village Green status.\nIt is already designated as green space, however, Village Green status gives further protections against any future development attempts in future years. The land is not currently at risk but it would do no harm to future proof it’s protection.\nKingsway Estate residents Past & Present could you help with providing statements of your use of the land over the decades or use that you have witnessed. Minimum twenty years proof that local people have took part in lawful sports and pastimes on the land is a requirement. Some examples are ad-hoc games – football, rugby, rounders, cricket etc, picnics, fetes, parties, dog walking, walking.\nI believe this land has been in use by local people since the late 1920s/early 1930s. The estate or scheme as it was called was designed around the principle of the large central communal green recreation area and the backs were allotment land.\nIf you could send your statements of how you have used or seen this land used lawfully by local residents over the years to andrea.wall@halton.gov.uk it would really assist in achieving Village Green status.",
  "http_andreawall_org_/http_andreawall_org_tag_kingsway-ward_page_4/content_124.html": "“Walk Down Memory Lane” Share Tweet Email\nTag: Kingsway Ward\nKingsway Spring Clean\nAround 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\n21st March Kingsway Ward Spring Clean Update\nShare Tweet Email\nKingsway Ward Spring Clean\nI am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring. This is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and […]\nKingsway Ward Councillor Surgeries\nKingsway Ward councillor surgeries will take place at the following venues and times: Andrea (me) – Third Wednesday of each month 12.00pm – 1.00pm. St Paul’s Church Community Centre, Vicarage Road, Widnes. June and Margaret – first Thursday of each month 6.00pm – 7.00pm. Room 15 of Kingsway Learning Centre/Widnes Library. Our surgeries are for […]\nWidnes sports centre to be named after rugby legend Frank Myler\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email\nArea Forum Tuesday 27 January 2015 6.30pm\nIn Halton, our main neighbourhood partnerships are called Area Forums. At Area Forum meetings, you can give your views, comments and concerns on local issues and priorities directly to the Council. They are a chance for you to make a real difference to your communities. You can also submit a question to Area Forums. Kingsway […]\nHappy New Year\nI hope you all had a good Christmas, mine was good, a quiet one spent with my family. I wish you all a happy and healthy 2015 and I look forward to meeting more Kingsway ward residents and working as hard as I can for you. Please don’t hesitate to get in touch if you […]",
  "http_andreawall_org_/http_andreawall_org_category_news/content_94.html": "People who are on Guaranteed Pension Credit should by now have received information on how to receive the £140 discount on their energy bills if their supplier is part of the Warm Home Discount Scheme. However, people on low incomes could also qualify for the £140 discount, if their supplier is part of the scheme […]\nNews\nTemporary Dispersal Zone\nFollowing the damage to people’s vehicles in Kingsway Ward last night and ongoing anti social behaviour. On behalf of the ward, I today agreed to the police implementing a dispersal zone. The dispersal zone is now in place. This disgraceful behaviour is really affecting residents’ quality of life and must stop. Share Tweet Email\nPress Report on Play Area Vandalism\nReport on the damage and clean up of Dundalk Road play area. http://www.liverpoolecho.co.uk/news/local-news/widnes-councillor-blasts-mindless-destruction-12408400 Update: The soft surface will be repaired once the temperature rises a bit, as it doesn’t set properly if temperature is under 4 degrees when it is laid. Share Tweet Email\nDistraction Burglary\nThere was a distraction burglary in Kingsway Ward last week. Look after our elderly and/or vulnerable neighbours with the Nominated Neighbour Scheme. It’s a card to encourage elderly/vulnerable people to not open their door to unknown people and to phone a trusted neighbour to check the person out for them. Cards are available at Widnes […]\nWidnes Growing Together Awards\nPress Report: A Widnes gardening project is celebrating after scooping another gong – this time with a big bag of cash to fund further development. Widnes Growing Together triumphed in Groundwork’s Bags Of Help contest funded by the Tesco 5p carrier bag charges hot on the heels of winning a Royal Horticultural Society award. The […]\nBulb Planting\nGreat working with Ashley School pupils today, planting 3000 flowering bulbs on the Kingsway Biggy. This is a project that I’ve been working on with the school since the Kingsway Together funding was achieved. The pupils worked really hard and our MP Derek Twigg, who grew up on the Kingsway Estate paid them a visit. […]\nWidnes Growing Together Launched\nPress report on Widnes Growing Together: “A gardening scheme is being launched in Widnes with the aim of nurturing green-fingered skills and community spirit. Widnes Growing Together has been set up by Kingsway councillor Andrea Wall to foster neighbourhood pride, improve the environment, give residents the chance to enter ‘In Bloom’ competitions and to enable […]\nLiverpool Road Works\nDear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]\nFrank Myler Pavilion – Official Opening and Fitness Classes\nThe official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]\nArea Forum Update – Trees for Kingsway Ward\nDear Resident, Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have […]",
  "http_andreawall_org_/http_andreawall_org_tag_labour/content_27.html": "Lovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]\nTag: Labour\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nLiverpool Road Works\nDear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nOne Year Update and Happy New Year\nDear Resident, I’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016. Since being elected by residents last December and again in May I have been working hard to learn how to […]\nArea Forum Update – Trees for Kingsway Ward\nDear Resident, Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have […]\nWhat I do as a councillor\nDear Resident, I’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do. First and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings […]\nKing George V Playing Fields & Frank Myler Sports and Recreation Ground\nDear Kingsway Ward Resident, I’ve had a few queries today about why there is fencing and work on going on a small part of the King George V Playing Fields by Foxley Heath. The work going on is to put in the sewerage outlet pipes for the new Victoria Gardens housing development on Liverpool Road. I’ve been advised […]\nOperation Granite – Motorbikes, Mini Motos and Anti Social Behaviour\nI wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]\nMini Motorbikes, Quad Bikes, off road vehicles and anti social behaviour\nI’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area. I have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an […]",
  "http_andreawall_org_/http_andreawall_org_tag_widnes-royal-british-legion/content_68.html": "Proud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]",
  "http_andreawall_org_/http_andreawall_org_aidans-christmas-carol-fundraiser/content_75.html": "I had a lovely time at Aidansteddybearchallenge Christmas Carol Fundraiser tonight. It is always a pleasure to see Aidan and his mum Caroline. Fantastic young man and family. I put my wish on the Christmas tree, Aidan’s Tree of Memories & Christmas Wishes – for peace and for people not to be in poverty.",
  "http_andreawall_org_/http_andreawall_org_tag_halton-sport/content_41.html": "The official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]",
  "http_andreawall_org_/http_andreawall_org_tag_kingsway-ward_page_2/content_127.html": "A community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed […]\nTag: Kingsway Ward\nPlay Area Clean Up\nMassive thank you to everybody that turned out today to give Dundalk Rd Play Area a clean up following it being set on fire and the toddler swings destroyed over Christmas. This play area is hugely important to the local community. We cleaned up the park and surrounding areas of litter and hope that the […]\nPlay Area Set on Fire\nSo angry at the damage caused to the play area at the top of Dundalk Road over Christmas. The play area is in Kingsway Ward as the ward goes right across to the boundary at Ditton Community Centre. There is no excuse for this mindless destructive behaviour, lots of families use this little play area. […]\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nLiverpool Road Works\nDear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]\nOne Year Update and Happy New Year\nDear Resident, I’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016. Since being elected by residents last December and again in May I have been working hard to learn how to […]\nCreativity For Life!\nDear Resident, I’m happy to inform you that a new project has launched that Kingsway Ward residents are invited to join. Loose who are based at The Studio, Lacey Street have launched a project called Creativity for Life, that is being funded by the People’s Health Trust. The project is aimed at Kingsway residents along with Riverside […]",
  "http_andreawall_org_/http_andreawall_org_author_cllr-andrea-wall_page_5/content_158.html": "I set up the charity Widnes Growing Together a few months back, with the aim of turning derelict green space into a Community Garden & Allotments site with full disability access. We have a growing number of volunteers and have come a long way in a few months. I put in a funding bid to […]\nAuthor: Andrea Wall\nVPX (Victoria Park Experience)\nThe first VPX Widnes was a fantastic day. It’s been a great pleasure to have been part of assisting with it coming to Widnes. I hope this is the first of many. Well done to Karen and Vicky the PCSOs who ran with the idea to bring VPX to Widnes and spent hours organising it;Tony who […]\nKingsway Back\nGreat to see this work underway in a neglected Kingsway Back that Halton Housing Trust own. Residents reported problems to me, I met with Tommy from HHT on Monday and work is underway within the week to rectify the problems for residents. #partnership Share Tweet Email\nWidnes Growing Together Launched\nPress report on Widnes Growing Together: “A gardening scheme is being launched in Widnes with the aim of nurturing green-fingered skills and community spirit. Widnes Growing Together has been set up by Kingsway councillor Andrea Wall to foster neighbourhood pride, improve the environment, give residents the chance to enter ‘In Bloom’ competitions and to enable […]\nAshley School Council\nReally enjoyed attending the meeting of Ashley School’s School Council today. Really enthusiastic young people, some tough & really interesting questions from them. The School Council unanimously voted that I can attend again after half term for more pupil questions. Great initiatives going on at the school. Share Tweet Email\nSpring/Easter Update 2016\nDear Resident, It’s been a busy few weeks in the Kingsway Ward. The Spring Clean on Saturday 19th March was very successful , building further on last year’s event; with many residents taking the opportunity to get rid of their unwanted items and volunteers helping out to do a Litter Pick. You can read the press […]\nLiverpool Road Works\nDear Resident, A number of you have contacted me regarding the situation with the temporary traffic lights on Liverpool Road, near Foxley Heath and the Frank Myler Pavilion. I understand the frustration these works are causing, as I’ve been caught up in the traffic there on a number of occasions in the last week or […]\nSaturday 19th March Kingsway Ward Spring Clean\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]",
  "http_andreawall_org_/http_andreawall_org_widnes-royal-british-legion-royal-artillery-schools-poppy-appeal-awards/content_48.html": "Proud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was lovely to see the children collecting their school’s certificate and gifts.\nI was very surprised and a bit overwhelmed to be presented with beautiful flowers by the Widnes Royal British Legion & Royal Artillery as the last award.\nThank you to them for the flowers, their kind words about me and for using their Legion nickname for me – Arkwright (it’s the tuck shops). Proud to count them as friends, I love volunteering with the Widnes RBL & Royal Artillery.",
  "http_andreawall_org_/http_andreawall_org_kingsway-ward-spring-clean/content_55.html": "I am pleased to inform you that with funding from your local Area Forum, Margaret, June and myself have arranged for a Community Recycling Skip Scheme for Kingsway Ward, which will take place on Saturday 21st March 2015, the first day of Spring.\nThis is not like a traditional ‘rubbish skip scheme’ as the focus is on recycling and provides you with the opportunity to get rid of any household items including wood, garden waste, soil, scrap metal, bricks or rubble, hard plastics and small electrical items that you may have. Nonetheless, there will be a skip available for small non-recyclable items that cannot be placed in your black wheeled bin.\nThis coincides with Community Clear Up Day, a national Spring Clean taking place across the country. More news on this soon.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_news/content_80.html": "Around 250kg of litter collected across Widnes by volunteers. Click here to read full story Share Tweet Email\nTag: News\nWidnes sports centre to be named after rugby legend Frank Myler\nA sports centre to be built on the former Widnes Recreation Club site is to be named after rugby legend Frank Myler. Click to read full news article Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_widnes-growing-together-awards/content_71.html": "Press Report:\nA Widnes gardening project is celebrating after scooping another gong – this time with a big bag of cash to fund further development.\nWidnes Growing Together triumphed in Groundwork’s Bags Of Help contest funded by the Tesco 5p carrier bag charges hot on the heels of winning a Royal Horticultural Society award.\nIt was launched in June by Kingsway ward councillor Andrea Wall and now has £12,000 to splash out on a communal hut, patio, raised beds for disabled participants and access.\nVolunteers have already produced their own jam.\nCllr Wall, Labour, said the competition victory was unexpected as votes could only be cast in Tesco and\nthe two other contenders were based in Knowsley which had about four branches of the supermarket compared to Halton’s one.\nShe said Widnes shoppers must have thrown their support behind the project and could now look forward to the project’s development.\nThe Kingsway councillor said: “We’ll be getting a hut and hopefully a toilet and then we will be all systems go.\n“A new gate is on order, the old gate is not functioning properly and people find it hard to open.\n“I certainly didn’t expect we would win.\n“We’ve got one store in Halton and I think they had about four over in Knowsley.\n“The people in Halton must have got behind the Widnes project.\n“I’m really pleased.”\nShe added that residents have welcomed the extra greenery into the area since the project’s launch.\nCllr Wall said: “The land hadn’t been used for years.\n“It was a lot of work.\nhttp://www.liverpoolecho.co.uk/news/awards-victory-widnes-allotments-community-12281871",
  "http_andreawall_org_/http_andreawall_org_author_cllr-andrea-wall_page_2/content_147.html": "I had a lovely time at Aidansteddybearchallenge Christmas Carol Fundraiser tonight. It is always a pleasure to see Aidan and his mum Caroline. Fantastic young man and family. I put my wish on the Christmas tree, Aidan’s Tree of Memories & Christmas Wishes – for peace and for people not to be in poverty. Share Tweet Email\nAuthor: Andrea Wall\nWidnes Viking’s Golden Generation & Chemics Cafe\nLovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]\nSanta Dash 2017\nGreat time taking part in Halton Haven’s Santa Dash today. Hopefully a lot of money raised for our local hospice by the many participants! Share Tweet Email\nUniversal Credit\nHalton has been a Universal Credit full service area since July 2016. Cllr Andrea Wall (Kingsway) has long been a campaigning, vociferous critic of the system. Cllr Wall recently moved the HBC motion calling on the government to stop their roll out of Universal Credit to other areas, which was unanimously carried by the council. Today […]\nWarm Home Discount Scheme\nPeople who are on Guaranteed Pension Credit should by now have received information on how to receive the £140 discount on their energy bills if their supplier is part of the Warm Home Discount Scheme. However, people on low incomes could also qualify for the £140 discount, if their supplier is part of the scheme […]\nKingsway Estate Security\nA Kingsway resident has just informed me that her son’s bike has been stolen from their back garden on the Kingsway Estate. It is a red/silver/orange Voodoo suspension bike and was stolen between 6pm and 7pm. Can people please keep an eye out for it. Additionally could people please keep the security gates on to […]\nUpdate on Village Green Application\nDerek Twigg MP has given me his eye witness statement in support of the application to have the green space (the Biggie) in the middle of the Kingsway Estate registered as a Village Green. It looks like X marks the spot on the photograph – they’re actually the paths. It is already designated as green […]\nVillage Green Application\nPreparing to apply to register the field in the middle of the Kingsway Estate as a Village Green to enable it to become an additionally protected space for residents with Village Green status. It is already designated as green space, however, Village Green status gives further protections against any future development attempts in future years. […]\nArriva Bus Strikes\nI was on the Unite Arriva bus workers picket line at the St Helen’s bus depot from 7am for couple of hours before work this morning. Thanks to the Widnes resident bus drivers for inviting me. The last thing the bus drivers and staff want to do is cause disruption to the public. However, withdrawing […]\nTotal Eclipse of The S*n\nWith my son and Paul Collins flying the Total Eclipse of the S&n flag in Widnes today. Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_widnes-cemetery-and-dogs/content_129.html": "I’ve had some residents contact me recently that are finding a minority of people using Widnes Cemetery to walk dogs upsetting.\nWhile I understand that some people might walk their dogs in the cemetery and also be paying their respects at a resting place, dogs (apart from assistance dogs) are not allowed in the cemetery.\nPeople who have contacted me are finding it distressing to see dogs ‘doing their business’ near their loved one’s graves. Victoria Park is only down the road to walk dogs in.\nI’m sure nobody intends any disrespect, however, I hope that people’s feelings are taken into account and the dog walking in the cemetery stops.",
  "http_andreawall_org_/http_andreawall_org_tag_sports/content_77.html": "Dear Kingsway Ward Resident, I’ve had a few queries today about why there is fencing and work on going on a small part of the King George V Playing Fields by Foxley Heath. The work going on is to put in the sewerage outlet pipes for the new Victoria Gardens housing development on Liverpool Road. I’ve been advised […]",
  "http_andreawall_org_/http_andreawall_org_highfield-ward-resident-survey/content_119.html": "Highfield Ward Resident Survey Please enable JavaScript in your browser to complete this form.Name *FirstLastEmail *Overall how much do you like living in your area? *A lotA moderate amountA littleNot at allPlease add any comments or suggestions you have How strong is the sense of community in your area? *Very strongSomewhat strongNot so strongNot at all strongPlease add any comments or suggestions you have about community spriritWhat in your view would improve your area?How safe do you feel in your area? *Very safeSomewhat safeNot so safeNot at all safePlease add any comments or suggestions regarding safetyWhat do you like least about your area?What do you like most about your area?Which road do you live in?Submit Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_kingsway-ward/content_120.html": "The Highfield ward is represented by myself, Bob Gilligan and Paul Nolan, we are all Labour councillors and work closely together to do our best for the area.\nT\nThe Highfield ward is represented by myself, Bob Gilligan and Paul Nolan, we are all Labour councillors and work closely together to do our best for the area.\nT",
  "http_andreawall_org_/http_andreawall_org_tag_community/content_100.html": "I am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]\nTag: Community\nKingsway Ward Litter Pick – Saturday 2nd March 2019\nI thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field […]\nKingsway Ward Litter Pick – Saturday 2nd February 2019\nThank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice […]\nWidnes Royal British Legion & Royal Artillery Schools Poppy Appeal Awards\nProud to have been invited to attend the Widnes Royal British Legion & Royal Artillery’s Schools’ Poppy Appeal Awards this morning. The event was for the Widnes Royal British Legion & Royal Artillery to say thank you to the Widnes school children/schools who helped to smash the Widnes Poppy Appeal record in 2018. It was […]\nWidnes Viking’s Golden Generation & Chemics Cafe\nLovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]\nUniversal Credit\nHalton has been a Universal Credit full service area since July 2016. Cllr Andrea Wall (Kingsway) has long been a campaigning, vociferous critic of the system. Cllr Wall recently moved the HBC motion calling on the government to stop their roll out of Universal Credit to other areas, which was unanimously carried by the council. Today […]\nKingsway Estate Security\nA Kingsway resident has just informed me that her son’s bike has been stolen from their back garden on the Kingsway Estate. It is a red/silver/orange Voodoo suspension bike and was stolen between 6pm and 7pm. Can people please keep an eye out for it. Additionally could people please keep the security gates on to […]\nUpdate on Village Green Application\nDerek Twigg MP has given me his eye witness statement in support of the application to have the green space (the Biggie) in the middle of the Kingsway Estate registered as a Village Green. It looks like X marks the spot on the photograph – they’re actually the paths. It is already designated as green […]\nVillage Green Application\nPreparing to apply to register the field in the middle of the Kingsway Estate as a Village Green to enable it to become an additionally protected space for residents with Village Green status. It is already designated as green space, however, Village Green status gives further protections against any future development attempts in future years. […]\nArriva Bus Strikes\nI was on the Unite Arriva bus workers picket line at the St Helen’s bus depot from 7am for couple of hours before work this morning. Thanks to the Widnes resident bus drivers for inviting me. The last thing the bus drivers and staff want to do is cause disruption to the public. However, withdrawing […]",
  "http_andreawall_org_/http_andreawall_org_tag_christmas/content_111.html": "I hope you all had a good Christmas, mine was good, a quiet one spent with my family. I wish you all a happy and healthy 2015 and I look forward to meeting more Kingsway ward residents and working as hard as I can for you. Please don’t hesitate to get in touch if you […]",
  "http_andreawall_org_/http_andreawall_org_tag_litter/content_52.html": "I thought with the weather I might be on my own today but was very pleasantly surprised. Big thank you to Peter F (+ Louis the dog), Peter T, Karen, Laura and local kids Lottie, Elsa, Tia, Austin, Scott and the two Lily’s for joining in today’s Kingsway Litter Pick. We cleared the Biggie field […]\nTag: Litter\nKingsway Ward Litter Pick – Saturday 2nd February 2019\nThank you to Peter T, Charlie, Angela, Rachael and Laura for joining in today’s litter pick with me. We managed to do Milton Avenue, Masefield Avenue, Stewards Avenue, Scott Avenue, Browning Avenue, Hood Road and Kipling, Wordsworth and Burns Cres and a section of Lowerhouse Lane. We collected four bin bags full, had a nice […]\nKingsway Annual Spring Clean 2017\nShare Tweet Email\nKingsway Community Skip Scheme and Update\nDear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]",
  "http_andreawall_org_/http_andreawall_org_widnes-golf-club-second-planning-application-meeting/content_2.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to speak in support. Thank you to everyone that attended.\n“Thank you Chair and the committee for allowing me to speak. I am speaking on behalf of the residents that live in the area of the golf course and people from across Widnes that have contacted me. I am also speaking on behalf of my Highfield Ward colleagues – Cllr Bob Gilligan and Cllr Paul Nolan.\nI am not going to take up your time by reading out to you the contents of the report you have in front of you and no doubt have diligently studied. A report that recommends that you refuse this application and also recommends that the Council defends a refusal position with the Planning Inspectorate.\nThis application is very similar to the application that was refused by the committee on 2nd March this year. So much so that the applicant, the Golf Club sent out an email to it’s members on the 10th November stating:\n“A public inquiry into the first appeal was scheduled to commence on the 6th of December and a request was made to the Inspectorate to use this Inquiry to also consider the second appeal at the same time (a practice called co-joining) given the proposal was very similar to the one in the first appeal.”\nMy understanding is that the Planning Inspectorate have found Halton’s Local Plan to be sound, this includes the Golf Club land being designated Green Space.\nBack in the 1920s this now designated green space was bought by a company that polluted much of our town, I imagine back then it was bought because they wanted somewhere for their managers to play golf up out of the way of the chemical factories and slum housing that the workers lived in. I believe that this green space must be protected for the people of Widnes, in part because of its unique heritage but also to let us keep some green space that is not contaminated. I believe we have a duty of care to protect this designated green space for the future generations. The future generations are already deeply concerned about Climate Change and we must help them.\nThere are many studies that indicate that just being able to see green space and trees improves people’s sense of wellbeing, health and mental health. Building a housing estate would take that away from the people who live around the course and from people across Widnes.\nOur MP Derek Twigg has stated that he believes this land should never be built on as it would change the entire character of this area of Widnes and Widnes itself. I agree with him.\nThere were hundreds of objections against these planning applications, there is almost universal opposition to this land being built on from the Highfield Ward residents and opposition from across Widnes.\nI want to pay tribute to all the residents that have fought against these plans through difficult times, through Covid Lockdowns and have worked together with me through many ups and downs throughout this process. They have kept hope that the right decision will be made. Despite what I believe to be tactics by the developers, to deflate local residents’ hope and opposition, the developers have not succeeded. The community remains joined together and willing to help the Council to fight on against this.\nThis is not about NIMBYISM, this is about protecting an integral part of our landscape heritage. This land is part of the green network that runs from Spike Island, through to Leigh Rec and King George’s Playing fields and then the final piece now is the designated green space known as Widnes Golf Club. This land is in the heart of Widnes and is part of our Green Lung. This is land that was bought by one of our biggest polluters and is now one of our biggest protectors against pollution, it must remain so.\nIt is well known that green space and trees soak up pollution out of our atmosphere. This green space is home to a wide variety of wildlife, locals have even named the woodpecker that lives there Woody. Many of the trees are subject to tree preservation orders. There is already flooding in this location and building on it can only make that worse.\nAllowing this application would put the road junctions over capacity and put children’s safety at risk when walking to school. Now I know this is not a material planning concern but allowing this application would knock children who live in existing Widnes homes out of the catchment zone for the most popular schools. This land is unique in Widnes because of its central location and proximity to the high schools, two of which are already over subscribed.\nWhen work is done to Liverpool Road, it leads to chaos across the road network in Widnes. I have personally tried to get out of the estates and roads around this area many times and each time it is difficult and can actually be quite frightening to try to turn in the opposite direction to the oncoming traffic lane. Foxley Heath, Liverpool Rd, Heath Rd, Highfield Rd and the roads off them – Shakespeare, Tennyson, Addison, Woodland Lynton and right along to Chestnut Lodge, including Prescot Rd, Tabley and Cradley are all an extremely busy area for traffic.\nThis application goes against many of Halton’s planning policies, it is against the current Unitary Development Plan is also against the new Local Plan, which as I’ve already stated has been said to be sound by the Planning Inspectorate and in it the Golf Club is designated as Green Space.\nAt its very core this planning application seeks to cash in on many millions of pounds, hurt our town and invest part of the cash they make in a green space over the border in St Helens! Just let that sink in, we in Widnes would lose a huge swathe of our urban green space and St Helens would gain investment and protection in one of theirs, that cannot be just or fair on the people of Widnes and Halton.\nI, along with Cllr Bob Gilligan and Cllr Paul Nolan and the local community, including golf club members that have contacted me, urge you to please refuse this planning application and fight the appeal with the Planning Inspectorate. The community is here, it stands ready to support you and will be behind you. Thank you for listening.”",
  "http_andreawall_org_/http_andreawall_org_tag_universal-credit/content_9.html": "Halton has been a Universal Credit full service area since July 2016. Cllr Andrea Wall (Kingsway) has long been a campaigning, vociferous critic of the system. Cllr Wall recently moved the HBC motion calling on the government to stop their roll out of Universal Credit to other areas, which was unanimously carried by the council. Today […]",
  "http_andreawall_org_/http_andreawall_org_arriva-bus-strikes/content_30.html": "I was on the Unite Arriva bus workers picket line at the St Helen’s bus depot from 7am for couple of hours before work this morning. Thanks to the Widnes resident bus drivers for inviting me. The last thing the bus drivers and staff want to do is cause disruption to the public. However, withdrawing their labour (striking) is the last resort when dealing with a huge company that refuses to be reasonable. Arriva is owned by the German transport giant Deutsche Bahn AG and has huge financial resources.\nThe Arriva bus workers are fed up of inadequate pay offers when the company makes huge profits, yet the bus staff struggle to make ends meet as wages lag behind rising inflation. Arriva can settle this instantly and end disruption to passengers by giving their workers an adequate pay rise. Don’t blame the bus workers, it is Arriva’s refusal to properly negotiate and recognise their workers reasonable requests that is causing the disruption. The last line of defence a worker has when an employer is being unfair is the legal withdrawal of their labour.",
  "http_andreawall_org_/http_andreawall_org_tag_community_page_3/content_146.html": "Dear Resident, An update to let you know what I am doing. I am pleased to inform you that with funding from your local Area Forum, a Community Recycling Skip Scheme has been arranged for Kingsway Ward, which will take place on Saturday 19th March 2016. A litter pick will also take place at the same time […]\nTag: Community\nKingsway Together Awards\nDear Resident, I attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me […]",
  "http_andreawall_org_/http_andreawall_org_tag_widnes/content_6.html": "Tonight the second planning application from Widnes Golf Club was unanimously refused by the council and it was unanimously agreed by the committee that the Council defend its refusal decision at the appeal to the Planning Inspectorate. Text of what I said is copied below, Widnes Golf Club did not bother to send anybody to […]\nTag: Widnes\nCllr Andrea Wall – Formal Objection to Planning Application Number: 20/00471/FUL\nI am writing to formally object to any of the Green Space known as Widnes Golf Club being developed for housing. This land is designated as Green Space in the Unitary Development Plan (UDP) and in the Local Plan, it is on the already heavily congested Liverpool Road and the addition of the cars that […]\nWidnes Golf Club Green Space – OPPOSE building houses on it.\nI am hearing that Widnes Golf Club are coming close to putting in a planning application to build houses on the designated Green Space. As many will know, I am absolutely opposed to this Green Space being developed and have been campaigning against it for a number of years. Please join me by signing my […]\nWidnes Viking’s Golden Generation & Chemics Cafe\nLovely time at lunch time with the Widnes Viking’s Golden Generation members who help out at the Chemics Cafe. Thanks very much to Peter for inviting me, really enjoyed meeting everybody and their brilliant Widnes chant. Luckily I had black & white on but it’s not a requirement. I’d encourage anyone interested to drop by […]\nUpdate on Village Green Application\nDerek Twigg MP has given me his eye witness statement in support of the application to have the green space (the Biggie) in the middle of the Kingsway Estate registered as a Village Green. It looks like X marks the spot on the photograph – they’re actually the paths. It is already designated as green […]\nVillage Green Application\nPreparing to apply to register the field in the middle of the Kingsway Estate as a Village Green to enable it to become an additionally protected space for residents with Village Green status. It is already designated as green space, however, Village Green status gives further protections against any future development attempts in future years. […]\nVPX (Victoria Park Experience) Year Two\nGreat time today at VPX Widnes. Free activities for the kids. It’s been great to provide support for this free event for the second year running, with Cllr Phil Harris. I’ve really enjoyed working with Kingsway’s PCSO Bowers on it. Pictured are Cllr Harris, Assistant Chief Constable Nick Bailey, PCSO Bowers and me. One person missing […]\nCommunity Clean Up 2017\nA community clean up of Stewards’ Brook will take place on Saturday 18th March. Stewards’ Brook is the wooded area between Stewards Avenue and Foxley Heath. If you would like to volunteer for this community clean up please contact me so that I can keep you updated. You can also find the clean up listed […]\nPlay Area Clean Up\nMassive thank you to everybody that turned out today to give Dundalk Rd Play Area a clean up following it being set on fire and the toddler swings destroyed over Christmas. This play area is hugely important to the local community. We cleaned up the park and surrounding areas of litter and hope that the […]\nPlay Area Set on Fire\nSo angry at the damage caused to the play area at the top of Dundalk Road over Christmas. The play area is in Kingsway Ward as the ward goes right across to the boundary at Ditton Community Centre. There is no excuse for this mindless destructive behaviour, lots of families use this little play area. […]",
  "http_andreawall_org_/http_andreawall_org_bulb-planting/content_143.html": "Great working with Ashley School pupils today, planting 3000 flowering bulbs on the Kingsway Biggy. This is a project that I’ve been working on with the school since the Kingsway Together funding was achieved.\nThe pupils worked really hard and our MP Derek Twigg, who grew up on the Kingsway Estate paid them a visit.\nThe results may not be symmetrical etc but should bring some all year colour, the children really enjoyed doing it and they’ll be back soon to plant some Wildflowers. I hope that residents will enjoy what they’ve done.\nUpdate: Press report on the planting http://www.liverpoolecho.co.uk/news/local-news/3000-flower-bulbs-planted-widnes-12228594",
  "http_andreawall_org_/http_andreawall_org_stewards-aveliverpool-rd-public-footpaths-and-anti-social-behaviour/content_62.html": "Today I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue and Liverpool Road by the Albion Pub and St Raphael’s Church.\nThese footpaths have been blighted by anti social behaviour in recent years, which has caused many problems for nearby residents. Myself and ward colleagues are investigating a number of ways to tackle the anti social behaviour problem. I fully support the gating off of the footpaths to enable residents to have a better quality of life.\nIf you have received a letter today, please respond to it with your views as we need the majority of residents to respond to the consultation to ensure we have as many residents’ views as possible. The closing date for responses is Friday 17th July 2015.\nIf you need assistance in returning your response I will happily collect and return it for you, just contact me if you need help.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_show-racism-the-red-card/content_128.html": "Blog My Views Show Racism the Red Card Posted on 20th October 201729th December 2017 Author Andrea Wall Comment(0) Share Tweet EmailThoroughly enjoyed organising today’s Halton Labour show of support for Wear Red Day, showing racism the red card. #WRD17",
  "http_andreawall_org_/http_andreawall_org_kingsway-spring-clean/content_67.html": "News Kingsway Spring Clean Posted on 24th March 201529th December 2017 Author Andrea Wall Comment(0) Share Tweet EmailAround 250kg of litter collected across Widnes by volunteers. Click here to read full story",
  "http_andreawall_org_/http_andreawall_org_kingsway-together-awards/content_126.html": "Dear Resident,\nI attended the Kingsway Together awards on Friday evening, which as you know I’ve been working on for the past few months. It was lovely to see all the projects receiving funding for various initiatives to improve the area, you can find each project’s details below. It was a pleasure and honour for me to accept the awards for Clean Up Kingsway and Kingsway Wildflowers, who were unable to attend.\nI’d like to thank the Cheshire PCC for granting this funding to Kingsway Ward and everyone else that was involved in making this a success, especially the residents that got involved either by putting projects forward or by voting.\nI’ll be continuing to work on Kingsway Together as a means of trying to raise community spirit and have already arranged to work with Ashley School and Saints Peter & Paul on the flower planting that will be going on in the area as a result of both schools receiving funding to improve our area and get pupils involved in the Kingsway community.\nAs always if you have any suggestions, queries or would like help with anything please contact me.\nBest wishes,\nAndrea\nClean Up Kingsway\n£1,369.39 – An individually run community street cleaner, but I am willing to work with other people I will carry on providing a weekly street clean to the neighbourhood (only area to have this), and tackle other environmental issues to benefit the local community and make it a better place to live.\nRemembrance Garden\n£1,200 – A garden of remembrance for pupils to remember loved ones. Many of our pupils have suffered recent bereavement including the loss of parents. We have found gardening and a quiet place to reflect supports children in coping with grief.\nSupporting Young People\n£1,560 – More young people are now coming to activities at St Pauls’ than we can deal with. Some are troubled at home, have been expelled, or drink too much. We need to pay some extra sessional workers for six months, while we get the grants in to continue this work long-term.\nSimms Cross School Stage Restoration\n£2,000 – Restoration of Simms Cross School stage to allow pupils and people in the community to develop basic life skills through drama. New stage curtains will allow the children to produce plays and join in drama clubs in a more professional setting that will be fun and educational.\nCommunity Inclusion\n£1,088.62 – The project is based on inclusion, to stimulate, engage and develop the young person’s ability to participate in the sessions we provide and opening up more opportunities for more children with complex needs. Children with limited upper body movement require specialist equipment which is costly and we require funding.\nKingsway Together in Bloom\n£1,650.42 – Saints Peter and Paul students have identified green spaces in the Kingsway ward that would benefit from some improvements and a splash of colour by planting bulbs and wildflowers and creating planters for identified areas. They will maintain these through their volunteering sections of the Halton Mayor’s and DofE Awards.\nHow Does Your Garden Grow?\n£2,000 – Enhancing the shrubs and wild flowers surrounding St Bede’s Infant School Mary Mary Garden situated on the corner of Kingsway and Leigh Avenue. This will also provide insulation against noise and air pollution from the road, enhance our eco work providing a haven for wildlife and reduce the opportunity for anti-social behaviour.\nUnity Morris Dancers\n£2,000 – The idea of our morris dancing troupe is to promote co-ordination from a young age, helps children raise their own confidence and also gets a lot of children off the streets and gives them something exciting to look forward to each week.\nFamily Rugby For All\n£1,270 – The project will help people to keep fit, healthy and get involved in rugby league activities which are new, safe, coached and open to all age groups in the family. We coach children from age two using rugby skills to develop co-ordination, confidence, team work and interaction in a group.\nTrain Like A Viking\n£1,990 – ‘Train Like a Viking’ is a weekly gym and fitness opportunity for 16-24 year olds based in the Vikings Performance Centre at the Select Security Stadium under expert guidance from the Vikings community team. The project aims to tackle issues such as anti-social behaviour whilst promoting positive mental wellness.\nKingsway Wildflowers\n£1,970 – Ashley School, to plant wildflower seeds at the Frank Myler Sport & Recreation Ground. This will encourage wildlife and improve the appearance of the area. It will hopefully raise the awareness amongst people of the need to create a sustainable environment that we can all be involved in.\nLadies Boxer Size & Support for Community Club\n£1,067.98 – Widnes Boxing Club is a not for profit organisation run by Jackie Ryan, his family and friends. We are looking to add new safety matting and expand our reach by introducing a ladies class at the new pavilion on Liverpool Road. We will need equipment for this.\nMamafit Kingsway\n£1,880 – Fitness classes for pregnant women and mums with young children. Mamafit Kingsway offers exercise and lifestyle classes to support pregnant women and new mums helping them to get fit, active and stay healthy during this exciting stage of life. Learn safe, effective exercises and make new friends!",
  "http_andreawall_org_/http_andreawall_org_ashley-school-council/content_99.html": "Really enjoyed attending the meeting of Ashley School’s School Council today. Really enthusiastic young people, some tough & really interesting questions from them. The School Council unanimously voted that I can attend again after half term for more pupil questions. Great initiatives going on at the school.",
  "http_andreawall_org_/http_andreawall_org_saturday-19th-march-kingsway-ward-spring-clean/content_116.html": "Blog Community Saturday 19th March Kingsway Ward Spring Clean Posted on 29th February 201629th December 2017 Author Andrea Wall Comment(0) Share Tweet Email",
  "http_andreawall_org_/http_andreawall_org_tag_mini-motos/content_40.html": "I wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]",
  "http_andreawall_org_/http_andreawall_org_one-year-update-and-happy-new-year/content_39.html": "Dear Resident,\nI’ve now been one of your councillors for a year and thought I’d write an update for you on what I do and also wish you all a Happy, Healthy and Peaceful 2016.\nSince being elected by residents last December and again in May I have been working hard to learn how to best represent and help you. It has been a steep learning curve and the nature of the role means that the majority of learning is done ‘on the job’, although I have completed a variety of training courses this year in many different areas to help me to help you.\nThe issues raised with me have been many and varied – Bedroom Tax, Evictions, Fly Tipping, Parking, Planning Objections, Disability Rights, Housing Issues, Homelessness and Anti Social Behaviour are amongst the main things I have dealt with.\nAnti Social Behaviour remains a major issue to some residents, in particular the motorbikes that are being ridden around the Kingsway ward by people with no safety helmets and as in this previous post, I am still asking people to report this behaviour. There was some success with the police’s Operation Granite but there is still a problem.\nBack in July I reported that I was taking part in a public consultation with a view to gating off the path ways at the top of Stewards Avenue, due to the residents suffering years of anti social behaviour from the paths. The public consultation came back in favour of gating and I’m happy to report that using Area Forum funding, the paths were gated off in November. I’ve spoken to a number of residents since and they are pleased that they have the gates and have experienced improvement in their quality of life since they were fitted. There have been issues with vandalism of the gates but through work with the police, a CCTV camera has been installed, which I hope will further deter anti social behaviour.\nThere has been good news for the ward with the opening of The Frank Myler Pavilion and Sports Ground, the activities on offer there are growing all the time and it’s lovely to go past and see the children making use of the Multi Use Games Area (MUGA).\nOther good news is that Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. This year Kingsway funds have been allocated to things like alley gating to improve the security of residents, Community Skip Scheme, outdoor furniture for the Fellowship Centre, extra litter bins, helping a local dance troupe, community sports equipment for the new Frank Myler Sports & Recreation Ground, extra trees and Breakfast with Santa at Kingsway Learning Centre.\nIn the last few months I have worked on the Kingsway Together Participatory Budget from the Cheshire PCC, you can read news of it here. Kingsway Ward residents, including children still have time to vote for their favourite projects to receive funding, you can do so here, voting closes on Wednesday 30th December and the funding will be announced in the evening of Friday 8th January. Looking at the projects it looks like there will certainly be more plants, flowers and fitness classes in Kingsway in 2016, with local schools looking to get their pupils involved in improving the area, whilst working towards various awards. After the funding is announced, I’d like to keep Kingsway Together going as a community initiative, to enable more discussion and participation, with the hope of raising the community spirit that I have witnessed this year even further.\nI did a post about the horrendous cuts the Tories are inflicting on Halton a couple of months back, you can find it here and I am sad to report that things have not improved at all on that front and it remains for me, the most difficult aspect of what I do. However, despite what the Tories are inflicting on our community, I have witnessed many acts of people pulling together as a community and how much people are willing to help each other.\nI have really enjoyed meeting so many of you this year and in the main getting results for you or if I’ve been unable to explaining why. Before I was elected, I promised that I would always do my best and that promise is at the heart of everything that I do.\nIn the New Year, I’d like to meet more of you, listen to your views and ideas about the area and obviously help with any issues that you want to raise. So as always, please get in touch.\nBest wishes,\nAndrea",
  "http_andreawall_org_/http_andreawall_org_tag_kingsway-ward_page_3/content_152.html": "Dear Resident, Good News! Kingsway Ward has been awarded a £20,000 Participatory Budget from the Cheshire Police and Crime Commissioner. Participatory budgeting directly involves local people in making decisions on the spend and priorities for their area. I’ve been working on this project for a couple of months and I’m part of the organising steering group […]\nTag: Kingsway Ward\nFrank Myler Pavilion – Official Opening and Fitness Classes\nThe official opening, by Widnes legend Frank Myler, of the new Frank Myler Pavilion and Sports & Recreation Grounds took place yesterday, Saturday 3rd October 2015. It was a great Community Fun Day with lots of free activities for all the family to enjoy. While there I was talking to some of the Sports Development Team about the […]\nArea Forum Update – Trees for Kingsway Ward\nDear Resident, Kingsway Ward, along with other wards in Halton currently has a small pot of money each year to be spent locally in the ward. Community groups can also apply for small amounts of funding if their project is for the improvement and benefit of their ward and/or ward residents. In recent times monies have […]\nWhat I do as a councillor\nDear Resident, I’ve been one of your councillors for nearly ten months now and thought I’d do a post letting you know what I do. First and foremost I am a Kingsway Ward councillor and I represent you on the council. I attend on average two evening meetings per week and on average three day time meetings […]\nLaura Byrne RIP\nSadly Laura Byrne, who grew up in the Kingsway ward passed away on Thursday 17th September. Laura was 20 years old and tragically took her own life. I knew Laura and although troubled she was a lovely, gentle person, who had much to offer. She was a member of the Labour Party and worked tirelessly […]\nKing George V Playing Fields & Frank Myler Sports and Recreation Ground\nDear Kingsway Ward Resident, I’ve had a few queries today about why there is fencing and work on going on a small part of the King George V Playing Fields by Foxley Heath. The work going on is to put in the sewerage outlet pipes for the new Victoria Gardens housing development on Liverpool Road. I’ve been advised […]\nOperation Granite – Motorbikes, Mini Motos and Anti Social Behaviour\nI wrote a post recently about the complaints I’m dealing with regarding the damage caused to Kingsway Ward green spaces and the noise that is plaguing residents from the dangerous use of vehicles such as mini motorbikes, scooters and quad bikes in the area. You can read it here. I’m really pleased that Widnes Police have […]\nStewards Ave/Liverpool Rd Public Footpaths and Anti Social Behaviour\nToday I’ve been out delivering public consultation letters with members of the Community Safety team to houses on Stewards Avenue, Kipling Crescent, Burns Crescent, Hood Road and a small part of Liverpool Road. The purpose of the consultation is to gather affected residents views on gating off the two public footpaths that connect Stewards Avenue […]\nMini Motorbikes, Quad Bikes, off road vehicles and anti social behaviour\nI’m currently dealing with numerous complaints regarding noise and damage caused to Kingsway Ward green spaces by people using vehicles such as mini motorbikes and quad bikes in the area. I have met with a number of residents and am now carrying out a study of how many residents are affected by this issue. If you have an […]\nKingsway Ward Local Election May 2015\nI’ve been re-elected as a Labour councillor for the Kingsway Ward today and I am very grateful for the support that I have received during the election campaign and from the votes cast. I am thankful that the majority of Kingsway residents have put their trust in me and Labour again. This has been my second election within […]"
}